{
  "sid": "q01e3a",
  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/",
  "title:": "Is grading really that hard?",
  "text": "Profs of Reddit, you literally wrote the assignments, chose their format, chose the timeframe to give them out, and chose the deadline. So why does it still take 4 weeks for me to get my grades and feedback? I see no excuse other than just not caring about student learning tbh.",
  "author": "Agua_Fresca_Cuh",
  "created": 1633201900,
  "updated": 1634089687,
  "over_18": false,
  "upvotes": 357,
  "upvote_ratio": 0.89,
  "comments": {
    "hf57zqh": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf57zqh/",
      "text": "Lurking prof here. Short answer is you're right, this is bad behavior. Call your prof's out on it in their end of the semester evals. \n\nLonger answer: grading is the most monotonous thing in the world. Imagine you're an expert on a topic, and you have to read a paper on that topic written by a novice. That's going to be pretty painful (that's not meant as an insult to the students--they're learning, of course their assignments are going to be relatively elementary). Now imagine you have to do it 20, or 30, or 50 times in a row. Now imagine you have to do it 30 times in a row, three years in a row. Reading the same papers over and over again, writing the same comments over and over again. A lot of the feedback is repeating stuff you specifically mentioned in class, stuff that you specifically wrote into the assignment sheet, because you know what mistakes students are going to make before they make them, because you've done this a million times before. On top of all that, you know that 95% of students are just going to check their grade and never read the feedback you spent so much time writing (you know that because they make the same mistakes on their next paper). It is absolutely the worst part of being a professor. It's like painting a house that you know is going to be torn down, and as soon as you finish you have to move on to painting the next house that is going to be torn down. \n\nThose aren't meant to be excuses, and, like I said, ultimately you're right. But if you're wondering the reasons, I think most professors would agree with what I wrote.",
      "author": "tongmengjia",
      "created": 1633209393,
      "upvotes": 560,
      "replies": {
        "hf5k7vw": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5k7vw/",
          "text": "Professor here. This is 100% correct.\n\nFour weeks is excessive. You are right. But grading is definitely this painful.",
          "author": "gb8er",
          "created": 1633214782,
          "upvotes": 216,
          "replies": {
            "hf6wvpr": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6wvpr/",
              "text": "How can students help make grading more enjoyable?",
              "author": "forgotten_rhyme28",
              "created": 1633238995,
              "upvotes": 36,
              "replies": {
                "hf6xi82": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6xi82/",
                  "text": "Put time and energy into understanding the material instead of treating our classes like they're just hoops to jump through.\n\nAsk questions that show you've spent some time thinking about what we talk about in class.\n\nDo the work instead of looking up the answers on Chegg or in the solutions manual.\n\nIf I think I'm grading something that someone spent time working on and that they will actually understand and care about feedback, I actually don't mind grading at all.  However, the only time I can be sure that students actually look at feedback is on exams, so that's where I spend the most time grading.",
                  "author": "NielsBohron",
                  "created": 1633239408,
                  "upvotes": 48,
                  "replies": {}
                },
                "hf7q8h4": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf7q8h4/",
                  "text": "I always tell my students, just general life advice that will serve them well in many circumstances: don’t irritate the person who evaluates you.\n\nThat typically means taking a moment to put yourself in the mindset of the person who’s doing the evaluation and unraveling their motives. Professors are people who love their subject matter so freaking much they devoted their lives to it. Our assessments are not tricks to trap you, we just genuinely want to see what you’ve learned (in general, I know there are some jerk profs out there but they are hopefully rare and soon to be retired). We believe we’ve given you the tools and resources to demonstrate your learning effectively. So just come into it with a spirit of intellectual curiosity. Read the directions carefully! Review the course materials that apply to that assignment! Just, make an genuine effort to show that you’ve learned something and don’t treat our life’s work like it’s a huge boring waste of time chore (even if you think so, just don’t make it apparent to us). \n\nMostly I’ve found that students who ask questions like “how can we make this less painful for you” are already doing this, so you probably needn’t concern yourself with this advice. But you’d be shocked at the frequency with which students tell us things like “this is dumb why do I even have to” or “you never told us we needed to do that” (after two lectures, an email, and specific assignment instructions saying exactly that thing they needed to do). It can be…soul crushing after a number of years.",
                  "author": "gb8er",
                  "created": 1633260844,
                  "upvotes": 17,
                  "replies": {}
                },
                "hf8rzkv": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf8rzkv/",
                  "text": " - write legibly (if you are handwriting assignments)\n\n - please don't staple pages together in the dead centre of the page\n\n - naming and numbering pages is also very useful\n\n - don't abandon a question part-way through and pick it back up 3 pages later, it's hard to keep track of things that way\n\n - submit all work in the stated format\n\n - if you're doing math/physics/ect **use your words to explain what you're doing**, we're not mindreaders, we don't know where you've pulled this random equation from or why you're using it, and it means we can't identify the flaws in your thinking, which means **we can't help you**.",
                  "author": "officially_anxious",
                  "created": 1633279640,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "hf5wuk3": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5wuk3/",
          "text": "Never read the feedback? *insert gasp gif. Hell no, I read every iota of feedback given.",
          "author": "comfort_fiend",
          "created": 1633220465,
          "upvotes": 44,
          "replies": {}
        },
        "hf8grni": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf8grni/",
          "text": "I was an undergrad TA with grading responsibilities one semester. It was for one of my favorite classes, Real Analysis, so I thought grading would be easy and fun. I couldn’t have been more wrong. Reading through people’s wall-of-text proofs in tiny font with no paragraph breaks, figuring out if it was sound and giving them feedback if it wasn’t, and then having to do the same through 24 more repetitions of the same exact problem set — it was one of the more soul-crushing job responsibilities I’ve had. (On the upside, it did give me a lot more perspective into writing and submitting things in a way to make it easier on my profs and TAs.)\n\nI’m not proud of it, but there were times when I took close to four weeks to get feedback back. (Obviously my time management skills as an undergrad weren’t nearly as developed as a professor’s would be, and I’ll be striving for a higher timeliness standard if-and-when I’m a professor myself.)",
          "author": "secondpriceauctions",
          "created": 1633274707,
          "upvotes": 6,
          "replies": {}
        },
        "hf68hsc": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf68hsc/",
          "text": "NAP (not a professor)… sometimes professors teach 3 or even 4 courses a semester. \n\nOP probably forgot that they aren’t they center of the Profs universe. \n\nBut generally, 4 weeks with no update or communication is excessive barring family/personal emergencies",
          "author": "BjornReborn",
          "created": 1633225842,
          "upvotes": 33,
          "replies": {
            "hf6lmbb": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6lmbb/",
              "text": "I’ve had professors who teach six 25 person classes per semester. They’re 1x weekly for 75 minutes though.",
              "author": "Falcon10301",
              "created": 1633232481,
              "upvotes": 5,
              "replies": {}
            },
            "hf68zln": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf68zln/",
              "text": "Also NAP, but my family all works in higher education. I don’t give an f how high the professor puts me on their priority scale, but I for the amount I pay, I don’t care. They are free to switch jobs and work in private industry if they can’t do the basic aspects of their job.\n\nEdit: grammar",
              "author": "Agua_Fresca_Cuh",
              "created": 1633226075,
              "upvotes": -44,
              "replies": {
                "hf6fl72": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6fl72/",
                  "text": "It sounds like they are doing their job, just not as fast as you'd like.",
                  "author": "NielsBohron",
                  "created": 1633229355,
                  "upvotes": 27,
                  "replies": {
                    "hf6i1j2": {
                      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6i1j2/",
                      "text": "Good point when I get it back next semester I should be more understanding. Why should I expect a professor working in a university to care about time frames and deadlines? That’s unheard of for academia right?",
                      "author": "Agua_Fresca_Cuh",
                      "created": 1633230590,
                      "upvotes": -29,
                      "replies": {
                        "hf6kill": {
                          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6kill/",
                          "text": "No, we know our deadlines.  The only deadline we have when it comes to grades is to get our final grades into the Instruction Office 2 business days after the class ends (specifics vary by institution, obviously).  We are hired to do that and given near-total autonomy when it comes to how we determine those grades.",
                          "author": "NielsBohron",
                          "created": 1633231870,
                          "upvotes": 14,
                          "replies": {
                            "hf6kusf": {
                              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6kusf/",
                              "text": "What a great attitude to have as a professor I’m sure your teaching reviews are stellar. Hopefully they don’t review them when you go up for tenure or full prof.",
                              "author": "Agua_Fresca_Cuh",
                              "created": 1633232055,
                              "upvotes": -40,
                              "replies": {
                                "hf6mb19": {
                                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6mb19/",
                                  "text": "Oh, it's always so nice to see a snarky student who thinks s/he understands the responsibilities of a faculty member while resorting to thinly-veiled ad hominem as a form of rebuttal. /s",
                                  "author": "tspier",
                                  "created": 1633232853,
                                  "upvotes": 31,
                                  "replies": {
                                    "hf97y88": {
                                      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf97y88/",
                                      "text": "This made me laugh with glee",
                                      "author": "CauliflowerWeekly158",
                                      "created": 1633286109,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "hf6mic3": {
                                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6mic3/",
                                  "text": "Thanks, they are stellar, and that played a role in me getting tenure.  \n\nI'm not saying that I don't give feedback, but I definitely work a lot harder to give immediate feedback on quizzes and tests than I do on the hw assignments where the keys are available online.  I frequently end up getting behind by 4 weeks on assignments that are essentially graded on completion in order to keep up with more meaningful assignments \n\nThat said, if there was a student complaint that I was taking too long, admin would basically ignore it as long as I'm not discriminating against specific students.",
                                  "author": "NielsBohron",
                                  "created": 1633232964,
                                  "upvotes": 18,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hf6ycyy": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6ycyy/",
                  "text": "Clearly you don't understand math?  \nIn my first year undergrad class, we had 200 students per lecture. If each paper takes 30 minutes to read, that would equal 100 hours to mark a single assignment. Many profs have more than 1 lecture section, so it could be 200+ hours to mark even 1 assignment. On top of this, profs have their other job like research and other academia. Teaching you isn't their only task.",
                  "author": "ChaoticxSerenity",
                  "created": 1633240003,
                  "upvotes": 14,
                  "replies": {}
                },
                "hf6wneq": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6wneq/",
                  "text": "the amount of down votes you getting, i know you def touched their nerves.  my advice, grind out though college and after you graduate, never look back.  those professors are biggest hypocrites you will ever meet. all i see just bunch of sorry excuses from them",
                  "author": "ghostmode342",
                  "created": 1633238847,
                  "upvotes": -14,
                  "replies": {}
                }
              }
            }
          }
        },
        "hf6ghjk": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6ghjk/",
          "text": "Also, it's certainly possible that these assignments are being graded more slowly because there are other assignments that are more important or more meaningful where the prof is spending their time and energy.",
          "author": "NielsBohron",
          "created": 1633229806,
          "upvotes": 6,
          "replies": {}
        },
        "hf87aqp": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf87aqp/",
          "text": "Yeah I'm a student and try to remember most times grading the assignment(x100) is gonna be way worse than actually doing the assignment(x1).",
          "author": "jsimercer",
          "created": 1633270368,
          "upvotes": 2,
          "replies": {}
        },
        "hf6emyp": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6emyp/",
          "text": "looks like there is zero liability in education industry. in corporate world you actually have to work, whether you like it or not, cause you simply gonna get fired if you dont.",
          "author": "ghostmode342",
          "created": 1633228884,
          "upvotes": -16,
          "replies": {
            "hf6q9oo": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6q9oo/",
              "text": "oh man it just COMPLETELY slipped our minds that corporations and academia are the same thing! I guess we're done here then",
              "author": "TDVapoR",
              "created": 1633235054,
              "upvotes": 9,
              "replies": {}
            },
            "hf6fh7w": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6fh7w/",
              "text": "Oh, you must be one of those people who never procrastinates!  How rare to find someone like that; I teach a hundred or so students each year, and in ten years, I've never seen a student that never procrastinates.  I bet it's hard to be so humble and understanding of us mere mortals.  /s",
              "author": "NielsBohron",
              "created": 1633229300,
              "upvotes": 7,
              "replies": {
                "hf6hdsc": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6hdsc/",
                  "text": "im just a lurker here. i work in corporate but one of your own, a professor said it in above post, not me. i only said noone is held accountable when professor chooses to completely ignore students . i def wouldnt want my kid to go to university whrre he has to wait for 4 weeks for any kind of feedback on his homework.",
                  "author": "ghostmode342",
                  "created": 1633230257,
                  "upvotes": -5,
                  "replies": {}
                },
                "hf6sf22": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6sf22/",
                  "text": "The difference is simple. If a student procrastinates on their homework, it only affects them. If a professor procrastinates on grading, it only affects the student. \n\nI’ve seen classmates make repeated mistakes through the semester that they would have rectified after the first instance of homework was graded in a timely manner.",
                  "author": "thejimbo56",
                  "created": 1633236296,
                  "upvotes": -4,
                  "replies": {
                    "hf6t0ne": {
                      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6t0ne/",
                      "text": "You're neglecting the fact that there are soo many ways to get feedback.  And that there are soo many ways to cheat on homework.  I'm not going to waste my time giving feedback that may or may not ever be seen on assignments where the the key is freely available.  \n\nIf you need or want detailed feedback on homework, come to office hours or ask in class, and I'm happy to oblige because I know that you care and that you are paying attention.",
                      "author": "NielsBohron",
                      "created": 1633236643,
                      "upvotes": 8,
                      "replies": {
                        "hf73jbz": {
                          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf73jbz/",
                          "text": "Or, you know, you could just do your job.",
                          "author": "thejimbo56",
                          "created": 1633243703,
                          "upvotes": -7,
                          "replies": {
                            "hfa5r7u": {
                              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hfa5r7u/",
                              "text": "I am doing my job, thank you.  The most effective way to communicate ideas and educate students, IMHO, is to grade HW on completion and make the answer keys available.  I've tried other ways, and this is by far the most effective and efficient way to give meaningful feedback.  As both the subject matter expert and the pedagogical expert, I'll keep trusting my training and experience instead of listening to a random student on the internet who can't be bothered to understand that the responsibility for checking understanding lies with the student not the instructor in a college course.\n\nThanks for your input, though.",
                              "author": "NielsBohron",
                              "created": 1633300005,
                              "upvotes": 1,
                              "replies": {
                                "hfa71z2": {
                                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hfa71z2/",
                                  "text": "If it is solely the student’s responsibility to make sure they understand the content, what is your purpose?",
                                  "author": "thejimbo56",
                                  "created": 1633300581,
                                  "upvotes": -1,
                                  "replies": {
                                    "hfa9r12": {
                                      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hfa9r12/",
                                      "text": "To present the material in a way that promotes understanding, to enhance understanding by providing context and answering questions, and to evaluate that understanding.  \n\nThis is not compulsory education; if students only want to show up enough to get a C, or don't want to show up for the class at all, that's their business and I'm not going to chase them down.  Similarly, if a student can't be bothered to check the freely available answer key to an assignment or to ask me why their answers don't match the key, that's their decision.",
                                      "author": "NielsBohron",
                                      "created": 1633301784,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hf9u2rz": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf9u2rz/",
          "text": "Don't worry, next year will be the year the admin finally tightens up enrollment standards.",
          "author": "bl1y",
          "created": 1633294986,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hf56nk2": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf56nk2/",
      "text": "Four weeks is excessive in most cases, but as others have said, there are many factors that can delay grades being done. It’s unlikely that the reason is just that they don’t care.",
      "author": "PhDapper",
      "created": 1633208802,
      "upvotes": 53,
      "replies": {}
    },
    "hf5pfij": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5pfij/",
      "text": "Reading and responding to an 8 page essay takes me about 45 minutes if I want to do a decent job (and assuming there's not a huge issue like plagiarism or just making up claims, which can add a lot of time).\n\nI've got 19 students in my section. That means each 8 page assignment I give takes a little over 14 hours to grade.\n\nI am hired for only 10 hours a week to teach my course.\n\nI'm in class 3 of those hours. It takes me on average as much time to prep for a class as it takes to teach it (though often longer if there's a substantial reading -- and think about how many different things I had to read to find the one thing being assigned). That leaves me with 4 hours. 1 of those is office hours. Sometimes I can use that time to prep, but often I have student meetings, e-mails to respond to, or some admin stuff.\n\nSo, on average I have 3 hours per week that I can spend on grading. That means it should take about 5 weeks to return an essay.\n\n**The thing no one tells students** is that you don't get what you pay for. You get what your university pays for.",
      "author": "bl1y",
      "created": 1633217116,
      "upvotes": 107,
      "replies": {
        "hf5skez": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5skez/",
          "text": "Yeah and as an adjunct I literally *only get paid for the hours I am in class.* I don’t get any pay for prep or grading, but of course I have to do it or I won’t have the job. It’s absolutely fucked, excuse my language",
          "author": "nlh1013",
          "created": 1633218516,
          "upvotes": 56,
          "replies": {
            "hf6k6yi": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6k6yi/",
              "text": "Our adjuncts make $2500, before taxes, for the whole semester.  It is hard for me to blame them when students complain about grading timelines, though I understand the students' frustration, too.",
              "author": "TheKwongdzu",
              "created": 1633231699,
              "upvotes": 16,
              "replies": {}
            }
          }
        }
      }
    },
    "hf66ai3": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf66ai3/",
      "text": "2 weeks is generally the accepted turn around for assignments. Grading depends on the assignment and if it’s a small class with just you, or a large class with TAs (which takes forever and has additional layers I’m going to skip for now). \n\nGrading a presentation or a quiz/exam is pretty quick and easy if you don’t procrastinate, but papers take forever. Trying to decipher the poor writing and give points where possible is what takes the longest amount of time and is incredibly monotonous and soul crushing at times. So despite what students think, we prefer not having to take off points because it makes our lives more difficult/takes more time (especially since we need to explain what was wrong). We could just give all the bad grammar papers zeros or 100’s but then we’re subject to grade appeals and such. \n\nOne other item that slows down grading is consistency. Usually I (I don’t know who else does this) will need to go back to previously graded assignments to assure I wasn’t just in a specific mood when grading those and therefore was grading unfairly. \n\nFinally, we have other things we’re expected to do as part of our profession. If this is an R1 (like I’m at) research is a HUGE part of what we do and it takes up A LOT of time. We also have committees and such that occupy a lot of our time. A lot of our grading comes “after hours” (i.e., Is take home work) and some people have families/kids and such. That said, reasonable turn around is an expectation of our job.",
      "author": "Jonjoloe",
      "created": 1633224787,
      "upvotes": 19,
      "replies": {
        "hf70gdb": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf70gdb/",
          "text": "I was going to write nearly this exact reply…I’m doing my PhD at a large R1, and while we’re funded by being TAs, our research load is quite extensive. This is not to mention our own classes taken for the first three years of the program, which entail approximately 200-300 pages of reading per class per week. I take three per term. And I have two sections to TA—so that’s 60 students’ exams/papers. I’m not getting those back to you in under two weeks because I value my sanity, and I know my students value my sanity so I grade fairly! Here’s a snapshot of a typical workload for a TA at an R1: it’s doing damn much. I work approximately 60 hours a week doing: my own research and corresponding deadlines (I spend approximately 15-20 hours a week on this), my own class work (same as research), prep for section (2-4 hours per week), teaching/going to lectures (5 hours a week), office hours (3 hours per week), going to my own classes (15 hours per week), and emails/general upkeep (3-4 hours per week). It’s not that we don’t care as your TAs especially, we just have no time or energy to get them back in what students think is “reasonable”. Please be kind to your TAs and professors! Four weeks is a while, yes, but there may be extenuating circumstances around that too! We’re all just people doing our best—when my dad had cancer (he was a stat prof), he had students going above his head to the department chair because he was “taking too long” to return exams. We’re talking 2-3 weeks while the man was doing chemo. Please remember that we have bad semesters like you do, and if it’s really bothering you, please make an office hours appointment and don’t make your TA or prof’s life harder. You don’t know what else they have going on!",
          "author": "her0nduck",
          "created": 1633241451,
          "upvotes": 8,
          "replies": {}
        },
        "hf6k5ey": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6k5ey/",
          "text": "Yeah the research thing on the side is definitely something i forgot to consider for those kinds of professors",
          "author": "Chaz_Delicious",
          "created": 1633231676,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hf6mj3d": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6mj3d/",
      "text": "As someone who has been—and still is—a student, I get the frustration, I really do. In the field I teach, I consider detailed, specific feedback on each student’s work to be about half of my opportunity to provide quality instruction, so I want to be as punctual in providing that feedback as possible. In some courses I’ve taken as a student, that punctuality was critical, while in others it was mostly my curiosity and impatience driving my frustration from delayed grading. In any case, having to wait on grades *is* definitely frustrating.\n\nHowever, like any situation, it’s rarely as simple as “if this person cared, this source of frustration wouldn’t exist.” For context, here’s a selection of just some of the responsibilities I have demanding my attention at any given time:  \n\nTeaching 5 to 7 unique courses per semester, acting as academic advisor for students, scheduling my department’s courses, managing three equipment-heavy labs, purchasing equipment and supplies, diagnosing and repairing equipment, writing and revising curriculum, supervising student projects, on- and off-campus recruiting, conducting course and program assessment, serving on 3+ committees, developing marketing materials for the department, managing dual credit instructors and courses, developing mandatory professional development materials, maintaining contact with employers and advisory committee members, filling out admin-required paperwork and documenting contact with students (because, like students, upper admin like to assume faculty just aren’t capable of doing their jobs), and, of course, grading.  \n\nThere simply aren’t enough hours in the week to accomplish everything that needs to be done in the ideal amount of time, and my entire school is understaffed, so everyone on campus is doing the work of multiple people. Unfortunately, that does interfere with getting some graded work back to students in a timely fashion, no matter how dedicated we are to student learning. I can work 70+ hours a week and still not have half the time I need to actually accomplish everything that truly needs to be done. I end up having to make the most of what time I do have based on what will create the best outcomes for my students.  \n\nSome foundational courses for first-year students in the program require feedback on assignments to be provided twice a week to be effective, and that grading takes priority. Upper-level courses with work that relies heavily on prompt feedback is second priority, as I know my seniors are more comfortable asking questions in class when they need help. Elective courses for non-major students, where more than enough time is provided in class to complete all coursework while I am present to answer questions and provide assistance, is third priority. The rare senior course where feedback on an earlier assignment is not necessary for completing subsequent work is lowest on the list.  \n\nSomeone else in the comments put it well: You get what your *institution* pays for, not what *you* pay for. If, as a faculty member, I only had my courses to focus on, and if lab managers and recruiters and advisors and marketing staff (and so on and so forth) would be employed by the school, I could have *all* work graded and ready to return by the start of the next class. That, unfortunately, is not the reality of the situation. I do the best with the time and resources I have, and I know many others are doing the same.",
      "author": "blue_arrow_comment",
      "created": 1633232977,
      "upvotes": 9,
      "replies": {}
    },
    "hf6301r": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6301r/",
      "text": "I used to hate on professors who would use Pearson or multiple choice quizzes cause it usually meant the questions were stock and taken right out of the question bank, which I originally assumed was done out of laziness. Now, after a couple more semesters, I pray that all my assignments are like that. They have immediate results and there’s no need to wait. \n\nI’ve had one professor not grade anything until the week before finals. The anxiety of not knowing how you’re doing in the class until the week before finals is fucking brutal. I hope you find a solution to your problem.",
      "author": "MiddleweightMuffin",
      "created": 1633223237,
      "upvotes": 8,
      "replies": {
        "hf6z6m4": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6z6m4/",
          "text": "I feel you! My professors now are great thankfully, but I remember in high school, my Spanish 4 or 5 (can't remember) teacher took almost 2 months to grade our tests. I'm not a native Spanish speaker so I wasn't sure if I did terrible, mediocre, or great on the test. The same can be applied to any class that I'm taking now. I could be confident in my quiz/test, but if they're taking forever to grade it, how am I supposed to know if I need to improve on something in time?",
          "author": "prncsx",
          "created": 1633240563,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hf4v3a3": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf4v3a3/",
      "text": ">  I see no excuse other than just not caring about student learning tbh.\n\nOften professors who care take *more* time, not less, because they want to take the time to give good/useful feedback.\n\nGrading time depends on the nature of the assignments and the number of students in class. It can take a *long* time to grade written assignments, particularly if your peers happen to write incoherent drivel that practically needs a translation service, lol. Professors that don't care about students will just give those students and F and no feedback, but professors that care need to take the time dig into that mess so that they can explain to the student how to improve so they *don't* fail the class. \n\nSo yeah, grading can be hard. Some papers are easier to grade than others. Be patient, because chances are your professor is working on it.",
      "author": "HumanDrinkingTea",
      "created": 1633203814,
      "upvotes": 55,
      "replies": {
        "hf52cmm": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf52cmm/",
          "text": "This hasn’t been my experience at all. I have never, in my entire college career, waited for weeks to receive feedback from a prof and had it contribute to my education. It usually comes so far later that it has become irrelevant, especially when concepts build in each other throughout a semester.",
          "author": "Agua_Fresca_Cuh",
          "created": 1633206943,
          "upvotes": 9,
          "replies": {
            "hf542ox": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf542ox/",
              "text": "Exactly this. I'm having the same problem.",
              "author": "dkdbbdjxjjfskxncj",
              "created": 1633207692,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "hf4s32q": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf4s32q/",
      "text": "Because there could be a hundred students per class and they have multiple classes? They probably also have a family and a life outside of school and for the most part are only human?",
      "author": "skippy5433",
      "created": 1633202500,
      "upvotes": 36,
      "replies": {}
    },
    "hf6tk6y": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6tk6y/",
      "text": "Having taught public high school counts, maybe?\n\nEvery page I assigned out means I get 150 pages back.\n\nEver try grading 150 sheets of 20 questions each? It's boring, tedious, terrible work.\n\nAs much as students hate homework; teachers hate them 100x more.",
      "author": "mlstdrag0n",
      "created": 1633236961,
      "upvotes": 10,
      "replies": {
        "hf7l96c": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf7l96c/",
          "text": "have your ever worked a job where you dont get to choose not to do your job, where you get fired for not doing your job?",
          "author": "ghostmode342",
          "created": 1633257330,
          "upvotes": -5,
          "replies": {}
        }
      }
    },
    "hf4svjf": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf4svjf/",
      "text": "Because they aren't just teachers, they have personal research, other obligations and family life. They also usually have more than 1 class too.",
      "author": "NinjaLorian",
      "created": 1633202844,
      "upvotes": 20,
      "replies": {}
    },
    "hf8qkrq": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf8qkrq/",
      "text": "I've had profs who didn't return one assignment before the next one was due. So there was no chance to improve on it. And with comments telling you how to improve on the next one... but I've already turned in the next one. it's infuriating",
      "author": "ctrldwrdns",
      "created": 1633279018,
      "upvotes": 3,
      "replies": {}
    },
    "hf5kcf6": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5kcf6/",
      "text": "Not a professor but my Calc 3 Professor graded my 1 exam out of 3 on the spot. Less than 2 minutes.",
      "author": "Jbonbon17",
      "created": 1633214837,
      "upvotes": 7,
      "replies": {
        "hf5vfn7": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5vfn7/",
          "text": "I mean it takes a shorter amount of time to grade if you aced the exam. You blasting in your calc classes or sum?",
          "author": "TheRapidTrailblazer",
          "created": 1633219811,
          "upvotes": 17,
          "replies": {
            "hf60i8i": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf60i8i/",
              "text": "If they do really well... or really poorly... it doesn't take long to grade",
              "author": "acm2033",
              "created": 1633222096,
              "upvotes": 14,
              "replies": {}
            },
            "hf5yc2g": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5yc2g/",
              "text": "Oh you right, I did get a low A on it.",
              "author": "Jbonbon17",
              "created": 1633221132,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hf6oaa2": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6oaa2/",
      "text": "I used to grade. It's just tough.\n\nI used to grade 120 papers each assignment, 6 assignments a semester. It's so, so, so monotonous, especially when you guys answer really stupidly. I give partial credit for *any* effort, and whole points off for stuff that wastes my time, like, \"Name Five Elements\", and you answer, \"Fire, Water, Air, Space, Earth\" in a fucking STEM class.\n\nI swear, you people have contributed to my alcoholism more than anyone else, ever.",
      "author": "leadalloyammo",
      "created": 1633233957,
      "upvotes": 9,
      "replies": {}
    },
    "hf6jxph": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6jxph/",
      "text": "I agree but for some assignments i dont really mind if they take their time on them. Stuff like homework or lab worksheets(not write ups) usually get handed back in a month. Really the assignments that have little impact on my grade i turn them in and kinda forget about them until i get them back. Could also throw projects in the mix too since you really have to go with the rubric and thoroughly grade each one.\n\nExams should and usually are the priority for professors in my experience. Never waited longer than a week for an exam grade and thats how it should be.\n\nBut also some professors like to give back a bunch of different work all at once so you get your hw and worksheets and other stuff alll handed back at once.\n\nSeems like your professor needs a TA. Had a physics teacher who teaches 3 classes a semester and always got work back within 4 days or so. TA graded the homework while the professor did the lab work and exams, it was only 3 things but theres alot of calculations and i didnt find any errors in the grading.",
      "author": "Chaz_Delicious",
      "created": 1633231564,
      "upvotes": 2,
      "replies": {
        "hf6kz5x": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6kz5x/",
          "text": "The most frustrating thing is that there are 3 TA’s for the course. Not that anyone responds to emails though.",
          "author": "Agua_Fresca_Cuh",
          "created": 1633232121,
          "upvotes": -1,
          "replies": {
            "hf77d8p": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf77d8p/",
              "text": "So it’s not the professor who’s falling behind on marking, it’s the undergrad/Masters/PhD students who are being forced to TA (probably as a requirement for a research grant or stipend or something)",
              "author": "officially_anxious",
              "created": 1633246714,
              "upvotes": 5,
              "replies": {}
            },
            "hf6olti": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6olti/",
              "text": "How many students in the class? I once had a uni course with 1300 students and 1 teacher and a handful of TA's. The teacher set up a class question board and a general 'FAQ' page because there was no damn way she could answer all of the emails she received within a timely manner. (*No* fucking clue btw why my uni decided to set up that course like that. It's the only class I ever took that had a major ratio issue.)\n\nAlso-- just for some input on emails. I work in an online customer service retail, responding to emails every day. I also use premade responses to make my work easier, modifying them slightly to fit each question. In any given hour, I could probably respond to around 20 emails with a relatively detailed answer. I can answer 50 if I disregard any attempt to be genuine and use *only* premade responses.\n\nAnd this is me, as someone who has a lot of experience with emails and spend all day going through the routine of it. I don't know how your class is set up but if your professor spends everyday day teaching, researching, grading, hosting office hours, etc. then they might have very little time to answer emails, and it might be virtually impossible for them to reply to everyone. I mean-- just thinking about my example-- if even 1/6 of my class had emailed my professor every week, then she would receive approximately 200 emails. If she works at a pace similar to me, it would take her 10 hours to answer them all within 5 business days. And by that time, she might have had another 200 emails to get through again.",
              "author": "april-then-may",
              "created": 1633234132,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hf6rczs": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6rczs/",
      "text": "Sounds to me like you'd do well to visit a professor's office hours and ask about specific assignments. That's what I do--grades are hidden online because I get tired of getting asked 30 times a day why I haven't graded the assignment due last night. If you want to know how you did, you can come to office hours and we'll go over it there, or you can wait until I have a chance to get through grading it. I've got grading for 4 classes, minimum, per semester, with 28 students per class, and that's not even taking into account all the other crap the department and admin has thrust upon us this term.\n\nUnless you don't want any real feedback on your papers, in which case I can give you a grade on the spot and you can make the same mistakes on every subsequent assignment.\n\nI apologize that you don't feel like your professors deserve to have a life outside of you. Unfortunately, that's not something that's going to change.",
      "author": "bgbwtp",
      "created": 1633235679,
      "upvotes": 4,
      "replies": {
        "hf6t5yh": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6t5yh/",
          "text": "But no credit for late assignments, right?",
          "author": "thejimbo56",
          "created": 1633236726,
          "upvotes": -5,
          "replies": {
            "hf6usm0": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6usm0/",
              "text": "Aw, that's cute! You think that reading my comment history is gonna make me feel bad for you!\n\nHere's the thing: YOU, student, don't have to give feedback on 120 individuals' assignments. I do. And if you can't be bothered to turn in a 5-point, 2-question assignment in three days, that's not a failing on my part. That's very much something you need to take up with your inability to follow simple instructions.\n\nI have no sympathy for you. Not from any of your comments here, and especially not for this completely pointless dig at my policies. I even tried to give you  valid advice, but instead of taking it, you just want someone you tell you that you're right and they're wrong, but ... well. You're not, fam. Take a seat.",
              "author": "bgbwtp",
              "created": 1633237694,
              "upvotes": 5,
              "replies": {
                "hf73gtz": {
                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf73gtz/",
                  "text": "If the attention to detail you put into this reply is any indication of what you put into teaching, I feel sorry for your students. \n\n1. Why would you assume I read through your post history? That’s a really weird thing to assume when there is no evidence that I’ve done so. My reply to you was just confirming that you hold your students to a fairly standard expectation that you apparently don’t apply to yourself. \n\n2. Not a student. Don’t care about your workload, this is a career path that you chose. When I was a student, I personally never had an issue with completing and submitting my work on time. Again, unsure about the assumptions all over this dramatic outburst. \n\n3. Which other specific comments of mine do you feel no sympathy for? I’m truly curious. Also, if you could kindly point out where you gave me advice of any kind, valid or not, I’d be greatly appreciative - as well as confused, because this is the first time we’ve ever interacted in any fashion. \n\nFor the record, you receive an F on this reply. Poorly researched, multiple assumptions unsupported by any evidence, punctuation and grammar, unprofessional tone. You did manage to spell correctly, though. 5/100.",
                  "author": "thejimbo56",
                  "created": 1633243649,
                  "upvotes": -7,
                  "replies": {
                    "hf84mpc": {
                      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf84mpc/",
                      "text": "Actually, there IS evidence, since nothing in this post says I give no credit for late work, but there is a comment from a few days ago that does say so. Therefore, evidence suggests you do indeed do so. But nice try attempting to deflect that.\n\nFurthermore, if you're not a student, then you have no horse in this race and can go away forever, since you have literally no reason to be here.\n\nSee, here's the deal: let's say you have an assignment due today. You, *hypothetical student*, turn it in on time, as do half of your peers. But the other half doesn't, and turns it in in three days or later. Well, in three days, another assignment is due. So I can either grade all your peers' work now for the first assignment and make you wait later for the second, or you can just wait anyway since I won't release grades until everyone has been graded so answers cannot be shared, because students cheat and escalating that nonsense is a mess and a half. Either way, it's not my fault students can't do their work in a timely manner when I also have to do all the other grading, the class planning, the office hours, the department meetings, the college-wide meetings, the committees I've been forced to be on despite not wanting to nor having the time, and I still need to be able to eat and sleep so you can have grades at all. \n\nAnd finally, I'll admit I wrote that as I was heading to bed after an exceptionally long day, and assumed you were OP. I apologise for that, but not for the content of my post, since the rest of it is valid. I still have no sympathy for you when you don't seem to have sympathy in return, I still think that if you can't understand that you aren't the center of the world that's not my problem, and I still gave valid advice that ought to be followed if you, *hypothetical student*, are going to be rude about the fact that not every student is going to be as *perfect* as you.\n\nI'd rather take an F from someone who admits they have no idea what they're talking about, especially when they clearly think they're being \"funny\" but are actually just a sad excuse for a troll. Again, take a seat.",
                      "author": "bgbwtp",
                      "created": 1633269052,
                      "upvotes": 3,
                      "replies": {
                        "hf8x9y2": {
                          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf8x9y2/",
                          "text": "That’s not evidence, chief, that’s you making an assumption. Again, my question was simply verifying whether your students are held to an extremely common standard. The fact that you jumped straight to “yOu WeNt ThRoUgH mY cOmMeNt HiStOrY!!!” is evidence that you might be a little paranoid, though. \n\nI am not currently be a student, but I might be again some day. Both of my girls are currently students. I have as much reason to be here as anyone. \n\nAt no point did I admit I have no idea what I’m talking about. I’m quite familiar with being overworked. I’m overworked myself. I handle it with some basic time management skills, like not fucking around on Reddit if my work isn’t done. Maybe you could try that?\n\nLet’s examine your hypothetical assignment above. Either you accept late work or you don’t. If you do not, as evidenced by your baseless and weird claim that I’ve been going through your post history when I asked about it, there is no need to wait to grade papers until they have all been received as students who haven’t completed the work will not be able to cheat on it. \n\nThe lack of self awareness it takes to complain about students completing their work in a timely manner the same comment that you make excuses for not completing your own work in a timely manner is stunning. \n\nMaybe you’re the one who should take a seat, so you can grade some papers.",
                          "author": "thejimbo56",
                          "created": 1633281837,
                          "upvotes": -2,
                          "replies": {
                            "hf9srnd": {
                              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf9srnd/",
                              "text": "Fam, now you're just rambling. I cannot follow your all over the place argument.\n\nGo away. Unless and until you yourself have anything of meaning to add (which won't happen, since you're neither a current student nor a teacher), then I'm done with you. You don't know my late work policy. You don't know how or why I do what I do.\n\nIf you're so concerned with grading, go become a teacher and ensure students get work the next day. Please. I encourage you to put your money where your mouth is.",
                              "author": "bgbwtp",
                              "created": 1633294447,
                              "upvotes": 2,
                              "replies": {
                                "hfa6ton": {
                                  "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hfa6ton/",
                                  "text": "My “all over the place argument” is a point for point response to your comment. If you can’t follow it, perhaps your initial argument should have been more clear and concise. \n\nI don’t need to be a current student or teacher to have a meaningful place in this conversation. \n\nI do know your late work policy, because you confirmed in this thread that it is no credit for late work. As for why you do what you do, you’ve pretty clearly indicated that you have time management problems.",
                                  "author": "thejimbo56",
                                  "created": 1633300482,
                                  "upvotes": -1,
                                  "replies": {
                                    "hfafzkq": {
                                      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hfafzkq/",
                                      "text": "Fam, you know a *part* of my late work policy. Please, give me a detailled break down of how I grade every assignment and how I grade work that's late ranging from discussion posts to group work to papers. Please, enlighten me as to exactly why you think you know anything at all except for a few sentences I've given you to work with. You say I was assuming--hate to break it to you, but you're going off far less information to come up with your incorrect ramblings. \n\nHere's the thing: you're not a teacher. You don't know what teachers are dealing with. I suggest yet again that you become a teacher and then come and tell me why I should have time to grade immediately with everything else admin puts on me. I would love to see how you handle everything we do, because I'd bet you couldn't hack it. \n\nI'm sorry you're such a miserable person with such little understanding of nuance that you feel as though you're able to have a conversation here, when from what I see scrolling through this post all you know how to do is say you don't know education but you know other things that aren't education.\n\nI've got no time management problems. Further, I never once even said I returned assignments to students late--yet again, you're \"assuming\" after accusing me of the same. I'm sorry you're too uninformed to see that. Have a nice day, and go annoy someone else with your uselessness. I'll be blocking you because I don't have time for your nonsense.",
                                      "author": "bgbwtp",
                                      "created": 1633304758,
                                      "upvotes": 1,
                                      "replies": {
                                        "hfahh9w": {
                                          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hfahh9w/",
                                          "text": "Well, that was dramatic.",
                                          "author": "thejimbo56",
                                          "created": 1633305504,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hf5qw7f": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5qw7f/",
      "text": "When you have 60+ students for 3 classes and not much time I can understand why it takes them days to do it.",
      "author": "VoiceofReason541",
      "created": 1633217762,
      "upvotes": 2,
      "replies": {}
    },
    "hf62ii6": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf62ii6/",
      "text": "When students turn in assignments late: \"you're an adult now. You have to be responsible\"\n\nWhen professors return grades week after they're turned in: \"they got lives you know??\"",
      "author": "unholymanserpent",
      "created": 1633223014,
      "upvotes": -1,
      "replies": {
        "hf6svw6": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6svw6/",
          "text": "Not sure why you’re being downvoted here, it’s absolutely true.",
          "author": "thejimbo56",
          "created": 1633236569,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hf5wiio": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf5wiio/",
      "text": "dude i had a Prof who didn't grade anything at all ... until the last day of the semester we got our grades on assignments.. it's not really required of them",
      "author": "aguafreska",
      "created": 1633220311,
      "upvotes": 1,
      "replies": {}
    },
    "hf7kw7g": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf7kw7g/",
      "text": "Good grading with detailed comments is hard. Profs are under paid and over worked. Teachers at all levels are unappreciated.",
      "author": "caveatemptor18",
      "created": 1633257076,
      "upvotes": 1,
      "replies": {}
    },
    "hf66f81": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf66f81/",
      "text": "im suprised professors complain how boring it is to grade papers.  what did you think? you gonna have all studends writing phd level papers? this your job, to grade and provide feedback.  whether student will read or not, does not mean you dont have to provide feedback or not care.  great teacher have patience, put students first, not youself.",
      "author": "ghostmode342",
      "created": 1633224848,
      "upvotes": -7,
      "replies": {
        "hf69eyg": {
          "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf69eyg/",
          "text": "Just gonna float this out there too: If Professors are bored grading assignments, they are totally free to switch up the assignments and make them fun or use an auto grader. Don’t like grading papers? Don’t assign them. I have little sympathy for professors with that complaint since they have considerable control over the content and assignments.",
          "author": "Agua_Fresca_Cuh",
          "created": 1633226280,
          "upvotes": -4,
          "replies": {
            "hf6gtcs": {
              "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf6gtcs/",
              "text": "There are absolutely bad professors, and those who aren't reasonably timely with giving feedback to their students aren't doing their jobs right.\n\nBut... come on. Don't assign papers if you don't like grading them? Not assigning written work is a disservice to students learning material which requires nuanced, well-developed, and carefully-articulated understanding. A classics course wouldn't be a classics course without essay-writing.\n\nAgain, I'm not saying that four weeks is appropriate in any typical circumstance. But if you're this frustrated about it, muster up the courage to talk to your professor face-to-face (going to office hours and bearing in mind that your professors are people too), not just ranting about it on reddit.",
              "author": "TDVapoR",
              "created": 1633229973,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "hf9c2u0": {
      "link": "/r/college/comments/q01e3a/is_grading_really_that_hard/hf9c2u0/",
      "text": "Not a professor but a GA who grades, if it’s a small assignment that can be quick. And things like tests depend on how much of it is essay, it is monotonous and students want to know why they have points off and it can be specific. With essays, we have to read the whole thing and make sure you meet all the goals, have proper grammar, and correct citations. I have one class of 63 and another of 150, so grading can definitely take a while.",
      "author": "Ok_Cranberry_2936",
      "created": 1633287800,
      "upvotes": 1,
      "replies": {}
    }
  }
}