{
  "sid": "py1rds",
  "link": "/r/college/comments/py1rds/has_anyone_taken_out_extra_student_loans_to_avoid/",
  "title:": "Has anyone taken out extra student loans to avoid working full time",
  "text": "I am planning out my college plan and I’m pondering what if I just take out extra money to live on so I don’t have to work full time or even at all?\n\nIn my area it costs about 2k a month to live basically bare bones. So 24k a year.\n\nTuition for the cheapest school near me is 9k a year. So 36k for 4 years.\n\nWhat if I just take out extra loans so I only have to work a little bit and i can just bust ass and finish bachelor degree in 2.5 years? I can take summer classes and do whatever else I need to do to go faster. I could pay it off by the same age because it would cost more but it’d be a lot less painful than working ft and going to school for 6 years.\n\nAlso the earlier I get out of school, the higher my salary will be by a certain age. If I get out and become an engineer at 30 vs 33, my salary will be higher at 40.",
  "author": "SantaOMG",
  "created": 1632940848,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "heredhh": {
      "link": "/r/college/comments/py1rds/has_anyone_taken_out_extra_student_loans_to_avoid/heredhh/",
      "text": "I'm gonna try not to share my opinion here and just share some stuff you should consider. \n1) Some loans will allow you to do this. Make sure you read the terms and conditions \n2)Look into scholarships that cover housing. Some university's offer scholarships that you can apply to room and board, and some other scholarships do. If you can live in a dorm and get a campus meal plan on a scholarship, this can save you lots of money. \n3) Interest. You will end up paying significantly more than you spend originally because of interest. The general rule I've heard is don't take out more loans that your expected salary your first year out of college. (Eg: if your right out of college salary would be $60,000, dont take out more than $60,000 in loans). \n4) Tuition wise there's not much benefit to trying to cut your time down. If you take summer or winter classes you will pay more tuition. You may be able to get done 1 semester early by taking max course loads, but that depends on the credit limit at your school. Also, your financial aid may not apply to winter/summer semesters. In my experience, working during breaks and saving enough money to only need to work part time during the semester has been a better use of my time. \n5, but really it's 4 cont.) Many schools have credit limits for how many you can take in a semester. Make sure you look into this. I've taken max credits every semester at my school, fall and spring, and I'm only 1 semester ahead. \n6) If you can do number 2, it's worth sticking around for 4 years because of the amount you'd save on housing and food \n7)Some scholarships give out money that is designed to be spending money. \n8) Check if any of your scholarships are based on maintaining a certain GPA. If they are, don't overload yourself with courses. The amount you'd save by taking a lot is probably less than you'd lose if your GPA fell too low. \n9) Highly recommend looking into an on campus job at an info desk kinda thing. You'll probably spend over half your shift able to do your homework. \n10) If you are not getting any financial assistance from parents, it's worth finding a way to file taxes as an independent. You will get so much more money from the fafsa",
      "author": "Maleficent_Unit_7928",
      "created": 1632944015,
      "upvotes": 1,
      "replies": {
        "hero095": {
          "link": "/r/college/comments/py1rds/has_anyone_taken_out_extra_student_loans_to_avoid/hero095/",
          "text": "Really? The fastest you can complete college is 3.5 years? That doesn’t seem right, but I’m not educated on this stuff. I was thinking I could bust ass and do it in 2.5",
          "author": "SantaOMG",
          "created": 1632947901,
          "upvotes": 2,
          "replies": {
            "hesnfjb": {
              "link": "/r/college/comments/py1rds/has_anyone_taken_out_extra_student_loans_to_avoid/hesnfjb/",
              "text": "Literally everything deepmess says sums it up well. I'd emphasize the lack of course offerings in the winter/summer.  A lot of courses have prereqs, and if those prereqs aren't offered when you need them to be you'll have to wait for everything. Depending on major this could be a common theme. I couldn't graduate early if I wanted to because of how many consecutive courses I need to take in a very specific order.",
              "author": "Maleficent_Unit_7928",
              "created": 1632964028,
              "upvotes": 2,
              "replies": {}
            },
            "hesfgwg": {
              "link": "/r/college/comments/py1rds/has_anyone_taken_out_extra_student_loans_to_avoid/hesfgwg/",
              "text": "it depends on how many credits you go into college with and your college's policies. my university requires 124 credits to graduate, and doesn't allow you to take more than 19 credits per semester. \n\nif you went to my college with zero credits to your name and maxed out every semester it'd take 7 semesters to finish. for example, if you started in fall 2021 you could finish in fall 2023. \n\nhowever, even though this is possible, it is definitely not probable. most scholarships have a credit minimum & credit limit, and often don't apply to summer semesters. there's also a separate FAFSA for the summer, and it greatly decreases the amount of aid you receive. not to mention the fact that course offerings are often more limited in the summer. and your intended degree path may not even allow you to finish that fast because of prerequisites. \n\nbut if ALL of that is out of the way, it's still hard to get huge priviate loans for college. you will need a cosigner with a fantastic credit score, because many private student loan lenders have conservative limits. if you plan to take out 60k in loans you will probably need multiple lenders. your options are also limited because there aren't a ton of private student loan lenders, and if you took out a regular private loan you'd have to start paying it back asap. \n\nnot to mention: college is fucking HARD. taking 7 consecutive courses at 19 credits, especially in something like engineering, would be too much for anyone. have you done AP/IB? what's your courseload look like rn? engineering is super math heavy so you been be a calc God if you're gonna do that. be prepared to have zero time for a social life, hobbies, clubs, sleep...\n\nmy advice: see if it's possible to get qualified at a community college. seems like a better fit for you and would probably be a better use of your resources, since at college you're mostly paying for the experience",
              "author": "DeepMess9",
              "created": 1632960293,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "herjoi8": {
      "link": "/r/college/comments/py1rds/has_anyone_taken_out_extra_student_loans_to_avoid/herjoi8/",
      "text": "I didn't do it to avoid working fulltime, but when I was laid off during the Spring 2020 shutdown, I returned to school for another degree and lived off the loans for a year- which were designated for living expenses as well as tuition and books anyway. I just hope the degree will result in a well-paying job so I can afford the payments...",
      "author": "whatistheformat",
      "created": 1632946155,
      "upvotes": 3,
      "replies": {}
    },
    "herks3a": {
      "link": "/r/college/comments/py1rds/has_anyone_taken_out_extra_student_loans_to_avoid/herks3a/",
      "text": "I haven't but would if I had to temporarily",
      "author": "TragicalKingdom",
      "created": 1632946600,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634055979
}