{
  "sid": "rhz2bl",
  "link": "/r/college/comments/rhz2bl/alcohol_policy/",
  "title:": "alcohol policy?",
  "text": "My university has a policy where if a student is under the influence and gets ill and cops/ambulance get involved, the student will face no consequences. However, I was out drinking one night, got roofied, and ended up really really sick. I had no alcohol or drugs on me, so there was no possession, just the fact that I was drunk and roofied. The ambulance and police had to come, and I ended up on disciplinary probation and losing my car insurance (which wtf, nothing to do with driving but okay). Is this even allowed with that original policy in place? What loophole did they jump through here to get me in trouble? Freshman year of college ruined over getting roofied, bs.",
  "author": "skinandbonesss",
  "created": 1639685502,
  "updated": 1639787756,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hotouyn": {
      "link": "/r/college/comments/rhz2bl/alcohol_policy/hotouyn/",
      "text": "Impossible to say without reading the exact wording of the policy, but it seems wrong regardless. I recommend you pursue an appeal - look up the exact procedure, but normally you can get the case re-examined by a higher dean.\n\nIn your appeal, emphasize that you were roofied - that’s not your fault, and you’re the victim, so you shouldn’t be punished for that. You might still be in trouble, but I think you should be able to get out of disciplinary probation.\n\nAs for the insurance thing, you need to talk to an expert/lawyer; it’s unlikely that you on your own can get anything done there.",
      "author": "DarthKnah",
      "created": 1639685981,
      "upvotes": 4,
      "replies": {
        "hovlqwk": {
          "link": "/r/college/comments/rhz2bl/alcohol_policy/hovlqwk/",
          "text": "Depending on what disciplinary probation is and what it shows up on (could give hiccups for grad school), might make sense to retain an education lawyer. Or at least get a short phone consultation with one.\n\nSome universities are not very \"youth-friendly\" with their hearings and expect students to make their case like a lawyer. OP might not have everything explained to them properly or know how to give a decent defense.",
          "author": "darniforgotmypwd",
          "created": 1639715821,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoto6q5": {
      "link": "/r/college/comments/rhz2bl/alcohol_policy/hoto6q5/",
      "text": "Car insurance shouldn't have anything to do with your school. Amnesty policies are weird in how they're written so I'd review it to see exactly what is covered and who is covered.",
      "author": "Nosleep_9764",
      "created": 1639685718,
      "upvotes": 1,
      "replies": {}
    },
    "hov1f2u": {
      "link": "/r/college/comments/rhz2bl/alcohol_policy/hov1f2u/",
      "text": "Idk but I just wanted to make sure that you got/get a blood test that proves you were drugged and what drug it was. It will be easier to fight with that confirmed.",
      "author": "Victorian_Era2",
      "created": 1639706576,
      "upvotes": 1,
      "replies": {}
    },
    "hovjcj3": {
      "link": "/r/college/comments/rhz2bl/alcohol_policy/hovjcj3/",
      "text": "\"losing my car insurance\"\n\nHmm... honestly this is a first. Was there a police report filed? If anything, you should be considered a victim in anything reported. Who is the insurer and do you know what caused them to drop you? The only thing they could pull would be police reports and I don't see how they could have noticed one so fast.\n\nI'm not an expert on insurance but you should file a complaint online with the CFPB. They might be able to help and will forward it to the relevant agency otherwise. Maybe complain to your state insurance board if there is such a thing.\n\n\"Is this even allowed with that original policy in place?\"\n\nPublic or private university? On or off-campus? How did the university find out?\n\nIf a public university is punishing you, then they must claim you were either on-campus or a nexus of the campus (reasonable attachment to the university, like a football stadium or off-campus university garage) because otherwise they cannot punish you in this specific situation. For them to make that claim, it's their own error because as you say you were drugged. I would be pressing them on that part and asking them how they think their sanction doesn't imply that you were also drugged under their jurisdiction.",
      "author": "darniforgotmypwd",
      "created": 1639714675,
      "upvotes": 1,
      "replies": {}
    },
    "how2jhb": {
      "link": "/r/college/comments/rhz2bl/alcohol_policy/how2jhb/",
      "text": "Did the ambulance take you to the hospital if you were roofied? If not, why not? If so, were you drug tested for date rape medicine? You should definitely get that medical documentation/police report if somebody did slip you drugs and you should present that to an administrator of your college.",
      "author": "lootcaker",
      "created": 1639725852,
      "upvotes": 1,
      "replies": {}
    }
  }
}