{
  "sid": "qqjb9u",
  "link": "/r/college/comments/qqjb9u/teacher_put_everyone_the_lowest_grade_because_the/",
  "title:": "Teacher put everyone the lowest grade because the class was cheating. But my team wasn't, what can I do?",
  "text": "The title says everything. My class cheated on a written test, teacher found out, put everyone the lowest grade. Problem was my team and I had the highest grade, with a lot of effort. Friday we are gonna meet to see what can the class do, and probably the teacher is going to make another harder test...\n\nDo you have any idea what could we possibly do to defend ourselves? What can we say, or show o whatever to prove we didn't cheat. I hate my classmates, I wouldn't give them my answers even if my life depended on it.",
  "author": "Maitasun",
  "created": 1636509640,
  "updated": 1636655154,
  "over_18": false,
  "upvotes": 23,
  "upvote_ratio": 1.0,
  "comments": {
    "hk0nfha": {
      "link": "/r/college/comments/qqjb9u/teacher_put_everyone_the_lowest_grade_because_the/hk0nfha/",
      "text": "If they were all cheating through a groupme or something you could show that you weren’t apart of it, or point out that the material you provided is vastly different from the rest of the class.",
      "author": "rynpickles",
      "created": 1636510718,
      "upvotes": 12,
      "replies": {}
    },
    "hk2uhv5": {
      "link": "/r/college/comments/qqjb9u/teacher_put_everyone_the_lowest_grade_because_the/hk2uhv5/",
      "text": "Just go to office hours and ask the professor what evidence he has to prove you and your team cheated. Call it all into question.\n\nFor example:\n\nProfessor: \"Someone posted the quiz answers on the class online chat.\"\n\nYou: \"OK. And what evidence do you have that I 1) logged into the class chat, and 2) looked at the answers?\"",
      "author": "Comprehensive-Ad3963",
      "created": 1636558671,
      "upvotes": 5,
      "replies": {}
    },
    "hk1vgi3": {
      "link": "/r/college/comments/qqjb9u/teacher_put_everyone_the_lowest_grade_because_the/hk1vgi3/",
      "text": "Talking directly to your instructor is a great start,see what they have to say and then go from there.",
      "author": "loveypower",
      "created": 1636539282,
      "upvotes": 1,
      "replies": {}
    }
  }
}