{
  "sid": "q1ojde",
  "link": "/r/college/comments/q1ojde/minors_for_psych_major/",
  "title:": "minors for psych major",
  "text": "i’m wondering if anyone knows good minors for a psych major. tbh i’m not entirely sure what i want to do w psych, but i’m thinking ab being a therapist or psychologist or something involving research. my school offers a wrtc minor and i’ve always been good at writing and honestly enjoy it, but idk if that would benefit my psych major.",
  "author": "Powerful-Tomatillo29",
  "created": 1633413136,
  "updated": 1634084054,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hfh2cy8": {
      "link": "/r/college/comments/q1ojde/minors_for_psych_major/hfh2cy8/",
      "text": "Heyo! Criminology, Psychology, and Philosophy triple major here with a minor in Gender and Women’s studies. I would absolutely recommend a Sociology or Gender and Women’s Studies minor. They’ll both give you great information to supplement your career in psych. Sociology will provide you with knowledge about society that will help you better understand the struggles of your clients and the structural inequalities in our nation (assuming you’re in the US). GWS will give you the best tools for assisting victims of sexual violence and understanding how men and women are impacted by the media and conceptions of gender",
      "author": "wantonsong",
      "created": 1633438630,
      "upvotes": 3,
      "replies": {}
    },
    "hfg97cj": {
      "link": "/r/college/comments/q1ojde/minors_for_psych_major/hfg97cj/",
      "text": "Many people argue that minors usually have little to no set-in-stone influence on your career endeavors. That said, if you're going to have a minor, I don't think it would be a terrible idea to base it mostly on what interests you rather than how it can or cannot relate to your major.\n\nNonetheless, many people seem to pair a psychology major with a more technical minor, like biology or statistics, or one that is also within the social sciences, like sociology. After all, math is usually a big part of work in research, whether that's a broad understanding or in-depth calculation of it.",
      "author": "yourangleoryuordevil",
      "created": 1633415194,
      "upvotes": 2,
      "replies": {}
    },
    "hfgeg1s": {
      "link": "/r/college/comments/q1ojde/minors_for_psych_major/hfgeg1s/",
      "text": "Also a Psych major, I added a minor in Intelligence Studies, and a concentration in Criminal/Forensic Psychology. But I intend to go to Law School and then practice criminal defense so these courses make sense for my goals. What about a Philosophy minor? The classes are typically writing heavy and the critical thinking skills you would gain could be quite helpful in research.",
      "author": "LissaLee26",
      "created": 1633419816,
      "upvotes": 2,
      "replies": {}
    },
    "hfg73y1": {
      "link": "/r/college/comments/q1ojde/minors_for_psych_major/hfg73y1/",
      "text": "You can minor in Time Machine Engineering and invent a machine that enables you to travel back in time and prevent people from going crazy in the first place.\n\n\n\nOr you can build a homicidal ice cream machine robot that destroys humanity with it's sugary dairy goodness. Free statins will rain from the sky but it will be too late to unclog 8 billion arteries. \"Revenge is sweet and best served cold\" said the ice cream machine. \n\n\n\n(Sorry. I have insomnia.)",
      "author": "LarryLongBalls_",
      "created": 1633413489,
      "upvotes": 1,
      "replies": {}
    },
    "hfge6vb": {
      "link": "/r/college/comments/q1ojde/minors_for_psych_major/hfge6vb/",
      "text": "Maybe business or marketing. From the information I gather, clinics and agency may overwork therapists by overbooking clients that will cause burnouts. If you decide to open a private practice, you can set the number of clients you want to see per week and set your own rate. Not everyone is good with business.",
      "author": "DifferentMetal",
      "created": 1633419552,
      "upvotes": 1,
      "replies": {}
    },
    "hfhhl08": {
      "link": "/r/college/comments/q1ojde/minors_for_psych_major/hfhhl08/",
      "text": "i would just do a minor in what you’re interested in since i feel like most minors don’t really have much to do with your career.\n\nbut that being said, if you want to do research; biology might be a good option",
      "author": "sincerelygrace",
      "created": 1633445751,
      "upvotes": 1,
      "replies": {}
    }
  }
}