{
  "sid": "qzzg9b",
  "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/",
  "title:": "Scholarship donor meeting conflict time with future final exam",
  "text": "What the heck do I do when the donor zoom meeting is conflicting with my calculus final exam date and time. I feel like the donor should have known that there’s final exams in that week. I can’t just tell the donor to change the time because this is a big company. They were the ones who invited me for that time. The only way to not conflict the time is probably begging my calculus professor to change it for me. This is ridiculous lol.",
  "author": "Letusia",
  "created": 1637624843,
  "updated": 1639850935,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlpcs70": {
      "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hlpcs70/",
      "text": "How would a donor know your exam schedule? \n\nIs there an office that coordinates these events? You should go through them, as your exam is obviously higher priority.",
      "author": "biggreen10",
      "created": 1637625028,
      "upvotes": 9,
      "replies": {
        "hlphln9": {
          "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hlphln9/",
          "text": "Usually they can look in the university calendar that says exam week for that month. Well, they probably just didn’t care and just pick whatever date is available for them.\n\n This looks like a big event and many members will be there who are in this big company so I feel weird asking that one person with the only email I can contact if he could change the date. There was no option to change time or date in the email. It just says register or you will regret it.",
          "author": "Letusia",
          "created": 1637627296,
          "upvotes": 1,
          "replies": {
            "hlpiwts": {
              "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hlpiwts/",
              "text": "You need to get in touch and explain you have an exam. People sponsoring your degree don't want you to miss an exam, that's totally counter to the point. \n\nBut I imagine if you just blow it off without saying anything, there could be trouble.",
              "author": "biggreen10",
              "created": 1637627913,
              "upvotes": 4,
              "replies": {
                "hlpq8ho": {
                  "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hlpq8ho/",
                  "text": "I could try to ask my professor first. If he says no then I’ll just email them about the conflict time. I apologize that I’m just a little annoyed but I can do this! Thank you for chatting with me and this helps me think this through.",
                  "author": "Letusia",
                  "created": 1637631386,
                  "upvotes": 0,
                  "replies": {
                    "hlpqbgr": {
                      "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hlpqbgr/",
                      "text": "Start with the scholarship people. This is not a reason to reschedule a final exam.",
                      "author": "biggreen10",
                      "created": 1637631424,
                      "upvotes": 3,
                      "replies": {
                        "hlpu2ty": {
                          "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hlpu2ty/",
                          "text": "I just found out another problem is that I have two professors who didn’t put what day is the final exam in the syllabus so there’s a possibility of another time conflict if I ask the donor to change the time. This is just terrible. I’ll have to talk to those professors first then.",
                          "author": "Letusia",
                          "created": 1637633154,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "hmo9upk": {
                          "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmo9upk/",
                          "text": "The only email I could contact to was a special projects manager and he did not respond at all. It’s been a week and that same invitation email was sent to me again to register. So if he doesn’t respond then my only choice is to ask the professor or skip the scholarship donor event. :(",
                          "author": "Letusia",
                          "created": 1638287358,
                          "upvotes": 1,
                          "replies": {
                            "hmoa2z8": {
                              "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmoa2z8/",
                              "text": "Did you follow up with that person after your first email? Did you try calling him? \n\nIs there nobody in the scholarship or financial aid office you can get in touch with?",
                              "author": "biggreen10",
                              "created": 1638287452,
                              "upvotes": 1,
                              "replies": {
                                "hmodevb": {
                                  "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmodevb/",
                                  "text": "No they only showed one person to contact with as email and there is no phone number. :(",
                                  "author": "Letusia",
                                  "created": 1638288798,
                                  "upvotes": 1,
                                  "replies": {
                                    "hmodq26": {
                                      "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmodq26/",
                                      "text": "Is there not a campus directory online you could look him up on or anything? I find it hard to believe there is nobody else to contact. You may need to be a bit resourceful here.",
                                      "author": "biggreen10",
                                      "created": 1638288921,
                                      "upvotes": 1,
                                      "replies": {
                                        "hmoldum": {
                                          "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmoldum/",
                                          "text": "I found him on the scholarship website but he still doesn’t have a phone number. The only thing I could probably do is call that website’s phone number and ask for him or about the event. I’m going to do that later today. Hope I can get some good info and if I can change the time of the event.",
                                          "author": "Letusia",
                                          "created": 1638291909,
                                          "upvotes": 1,
                                          "replies": {}
                                        },
                                        "hmp25b3": {
                                          "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmp25b3/",
                                          "text": "I called the website and they didn’t even know him and said he might be a new employee. They don’t know his phone number so they just direct me to a number that focuses on scholarships. That number didn’t pick up so I gave a quick message on what’s going on. Hope they respond soon.",
                                          "author": "Letusia",
                                          "created": 1638298500,
                                          "upvotes": 1,
                                          "replies": {}
                                        },
                                        "hns2vsx": {
                                          "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hns2vsx/",
                                          "text": "I might not be able to change the time because the person I emailed to said there is a possibility of changing the time but he did not respond this week again. He might be busy again or he was not able to reach the donor or the donor is busy too. So, I guess I will most likely not be able to meet the donor because it is next week. He even asked me in email last week that I should try to change my final exam time which is just terrible.",
                                          "author": "Letusia",
                                          "created": 1639003919,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlpu8el": {
      "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hlpu8el/",
      "text": "scholarship people don't want you to miss a final exam, that's literally the opposite of what they want (they want you to do well, i.e. not waste their money).\n\nask scholarship people if they can reschedule or propose new time or something. in any case, they do not want you to miss an exam.\n\ngiven the choice between taking an exam and coming to some event, the scholarship people want you to take the exam.",
      "author": "wobbletelescope",
      "created": 1637633223,
      "upvotes": 2,
      "replies": {
        "hlpvodt": {
          "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hlpvodt/",
          "text": "Ok thank you! I’ll have to talk to my two professors first because for some reason they never put a date for a final exam so just want to make sure before asking the scholarship people to change the time and date.",
          "author": "Letusia",
          "created": 1637633897,
          "upvotes": 1,
          "replies": {}
        },
        "hmoabu4": {
          "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmoabu4/",
          "text": "What happens if the special projects manager did not respond to my email? It’s been a week now and that same email was sent to me again to register yesterday. If he doesn’t respond then that means asking my professor to change the final exam time or I skip the scholarship donor event meeting. :(",
          "author": "Letusia",
          "created": 1638287552,
          "upvotes": 1,
          "replies": {
            "hmpo28i": {
              "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmpo28i/",
              "text": "follow up on the email, skip the scholarship meeting and take your final. i stand by my belief that people who want you to do well so much as to give you thousands of dollars will want you to take the final.",
              "author": "wobbletelescope",
              "created": 1638307263,
              "upvotes": 2,
              "replies": {
                "hmprvzx": {
                  "link": "/r/college/comments/qzzg9b/scholarship_donor_meeting_conflict_time_with/hmprvzx/",
                  "text": "Good news! I emailed the manager again and he finally replied after I called the company today. I guess he was super busy or had a vacation. He emailed me that he’ll try to find another available time by talking to the scholarship donor. I hope he can do it. Yeah final exam is more important to me so I emailed that if he can’t do it, I will have to skip the meeting sadly.",
                  "author": "Letusia",
                  "created": 1638308805,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}