{
  "sid": "rebykr",
  "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/",
  "title:": "Who else can't sit down and write an essay for the life of them?",
  "text": "I'm taking a sociology class, and as interesting of a class as it's been, I can't for the life of me make progress on this 10 page paper due in less than 48 hours. \n\nFor some context, I'm a STEM major, who rarely takes humanities and social sciences. I took this sociology class as a premed requirement but ended up genuinely enjoying it a lot (a good, engaging professor can do wonders). \n\nI'm often able to sit down for several hours of nonstop grinding orgo/physics practice problems or bio flashcards. But when it comes even to writing a short paper, I can't do it. \n\nAnyone else relate? Tips?",
  "author": "fascinatingly_stupid",
  "created": 1639266491,
  "updated": 1639516179,
  "over_18": false,
  "upvotes": 286,
  "upvote_ratio": 0.99,
  "comments": {
    "ho6lwa9": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6lwa9/",
      "text": "I will walk around with my laptop and use speech to text on word when I can't sit still. I'll say what I want and then go back and edit it once I get the core of the paper done.",
      "author": "KatieKZoo",
      "created": 1639266839,
      "upvotes": 115,
      "replies": {
        "ho7dkf8": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7dkf8/",
          "text": "Good suggestion",
          "author": "poopmasterrrrrrr",
          "created": 1639280344,
          "upvotes": 14,
          "replies": {}
        },
        "ho7w0u2": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7w0u2/",
          "text": "That’s actually dope I never thought ab that. Then again I smoke while I’m writing papers so I would probably have to do twice as much editing after I use TTS 😂",
          "author": "Chasey7136",
          "created": 1639290639,
          "upvotes": 11,
          "replies": {}
        },
        "ho818od": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho818od/",
          "text": "The problem is I often have no idea what I’m talking about and an extremely reliant on the books/articles I use lol",
          "author": "the100broken",
          "created": 1639294476,
          "upvotes": 5,
          "replies": {}
        },
        "ho8syau": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho8syau/",
          "text": "At the risk of sounding like a idiot, you can do that? Sorry.",
          "author": "yobaby123",
          "created": 1639316097,
          "upvotes": 2,
          "replies": {
            "ho9aitp": {
              "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho9aitp/",
              "text": "Yep. Word has a really good talk to text feature.",
              "author": "KatieKZoo",
              "created": 1639324007,
              "upvotes": 3,
              "replies": {
                "ho9h8t1": {
                  "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho9h8t1/",
                  "text": "Thanks, man.",
                  "author": "yobaby123",
                  "created": 1639326801,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho6wkfg": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6wkfg/",
      "text": "Hi, poli sci major here, have written tons of essays so here's some tips if it helps\n\nWatch a lot of videos about the topic. Also helps if you have a conversation about it with a classmate/friend/TA.\n\n\nFocus on trying to get all your thoughts out on the paper, doesnt have to be good or have grammar or make sense at all, just vomit it out on the paper. It can be edited later.\n\n\nThis is similar to the above mentioned tips but remind yourself what you like the most about the class/topic. Write as if you're explaining it to someone, it takes the pressure off of being scholarly. \n\nHope you do well!",
      "author": "communistpotatoes",
      "created": 1639271920,
      "upvotes": 53,
      "replies": {}
    },
    "ho6nlwa": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6nlwa/",
      "text": "Can’t relate, but I use speak to type, it helps",
      "author": "SadAcadia2747",
      "created": 1639267641,
      "upvotes": 21,
      "replies": {
        "ho6vme2": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6vme2/",
          "text": "I can’t possibly understand how that would help",
          "author": "Megadog3",
          "created": 1639271466,
          "upvotes": -20,
          "replies": {
            "ho73qt1": {
              "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho73qt1/",
              "text": "Your thoughts on a page",
              "author": "SadAcadia2747",
              "created": 1639275433,
              "upvotes": 15,
              "replies": {}
            }
          }
        }
      }
    },
    "ho7978f": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7978f/",
      "text": "(I'm drunk rn so take everything I say with a grain of salt)\n\nI tutor college students for english and essay writing. The best analogy I have for it came from my sister that seems to click for a lot of people I tutor.\n\nThink of an essay like a skirt: long enough to cover the important parts, but short enough to keep it interesting. Keep every paragraph between either 4-6 or 4-7 sentences, ignore the 3-5 rule entirely.\n\nOnce you find your three points for the body paragraphs, come up with one or two talking points or mini subjects that relate to those points individually. For example, I had to write a debate/informative essay based on two articles devating on the importance of naps in a workplace environment in different countries and if it was something the U.S. should implement, whether it be in agreement or against it we had to choose our side and write an argument. My three points were: workers health, engagement in the company, and functionality. My talking points per paragraph were, in order, mental health, lower turn over rates, and higher performance among individual workers. \n\nBefore I got those talking points though, I researched my original three points, and chose those three talking points as they were the easiest to back up with the  \"evidence\" found. Once you've got these down, write down a couple paragraphs of whatever comes to mind per point and then chose what makes the most sense together and boom, you have got your essay.\n\nThen all you really need to do is summarize your body paragraphs into a conclusion paragraph and also write your introduction. Your introduction is suppose to draw people in or put the question in their head that your body paragraphs will answer while the conclusion is basically a tl:dr. They should be the only paragraphs that are less than 6 sentences, but still keep them at 4-5 sentences.",
      "author": "BrittCattica97",
      "created": 1639278138,
      "upvotes": 13,
      "replies": {
        "ho79in7": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho79in7/",
          "text": "Otherwise, a lot of what people are saying in other comments are also VERY useful",
          "author": "BrittCattica97",
          "created": 1639278298,
          "upvotes": 3,
          "replies": {}
        },
        "ho9bqmp": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho9bqmp/",
          "text": "I just got turned on by thinking about the structure of an essay. Thank you.",
          "author": "judashpeters",
          "created": 1639324506,
          "upvotes": 3,
          "replies": {
            "hoae4g1": {
              "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/hoae4g1/",
              "text": "This made me stupid laugh 😅",
              "author": "BrittCattica97",
              "created": 1639339632,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hoa3xwr": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/hoa3xwr/",
          "text": "As a writing tutor you have great advice and sometimes someone that struggle really needs to hear an outlined way of writing so they can then make their own decisions of how to combine steps or what not. This is definitely similar to what I teach my students.",
          "author": "TiredOfForgottenPass",
          "created": 1639335695,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho6u1q0": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6u1q0/",
      "text": "Watch a YouTube or documentary on it. Having a video usually inspires me. Even quote from it like you were commenting on your favorite tv show. Or start researching online for your own sources and as you read start forming a story to tell. Hope that makes sense.",
      "author": "BlueOcean7987",
      "created": 1639270701,
      "upvotes": 11,
      "replies": {}
    },
    "ho7n93b": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7n93b/",
      "text": "I am having the opposite problem right now. I can write essays for hours (because I love writing and am majoring in poli sci, might minor in English or philosophy idk). I'm trying to study for my math final but can't do it for the life of me. I have forever hated calculus and still do. Anyways, good luck! Hope you can discipline yourself like I'm trying to right now lol",
      "author": "spiicyant",
      "created": 1639285432,
      "upvotes": 5,
      "replies": {}
    },
    "ho6oorx": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6oorx/",
      "text": "I think the introduction and idea on what to write + how you want the writing to go is the hardest part. After that, it’s like a clear field but if you can’t think, I’d look online for some inspiration.",
      "author": "ThicccPanta",
      "created": 1639268161,
      "upvotes": 3,
      "replies": {}
    },
    "ho79asg": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho79asg/",
      "text": "Journalism and English major here - all I do is write.\n\nWhat type of essay is it? Is it a reflection-paper type deal, do you have a prompt that's asking you to answer a specific question, or is it more free-range (you pick the topic)? Regardless, to help get past writer's block, I focus on writing my thoughts free-form. Poor grammar, no spell check, just get your thoughts down on the paper. Do not even CARE if it's bad, just write 500 words on the topic to get the gears spinning. I often find myself becoming so bogged down with the formal rules of academic writing that it can stifle progress, so I start with getting some content first then spend some time rewriting and accurately formatting everything.\n\nThen, once you have the gears spinning and your thoughts down on paper, write one sentence about what your paper is about in response to the prompt. That will form the outline for the rest of your paper. From there, get to get at least one paragraph defining specific terms that will be referenced in your argument. Then, use the rest of the paper to walk the reader through your line of thinking. \"One reason why I'm arguing x is because y . . .\" This can be anywhere from two or three paragraphs, to many, many more depending on the requirements. If it's 10 pages, you'll be looking at ~3,300 words (double spaced), which might seem like a lot, but once you start working in context on top of your argument, it'll eat up words like nothing. Best of luck with the paper!",
      "author": "Alpha_DoubleNegative",
      "created": 1639278188,
      "upvotes": 4,
      "replies": {}
    },
    "ho7hj5z": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7hj5z/",
      "text": "i usually write out all of my thoughts exactly like i’d tell them to someone and then go back and edit. i also type single spaced for 5 pages and it tricks my brain into thinking it’s doing less work and then once i hit the limit i change to double space and voila.",
      "author": "dearwikipedia",
      "created": 1639282354,
      "upvotes": 3,
      "replies": {}
    },
    "ho7tstp": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7tstp/",
      "text": "oh gosh i understand your shoes as i’m also in STEM rn. But i personally enjoy reading so much hence i’ll be taking an English class next sem to read books and write about it. I know writing could be pretty difficult even to a person who enjoys reading like me :’) But i just tryna get some balance in my educational journey as college is also the best time to get those educational classes to widen your mind about different topics in life i think :’) \n\ni’m also almost considering taking an English minor, even English is not my first language. But just let’s see how my Eng class goes next sem :’)",
      "author": "remisme",
      "created": 1639289179,
      "upvotes": 3,
      "replies": {}
    },
    "ho80upt": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho80upt/",
      "text": "It’s weird because I hate doing tedious/ boring tasks, but I’m so unexplainably good at writing essays. I do the same thing every time, and it has never failed me: just write. Just. Write. I’m a sociology major and the first thing i do is copy the questions/ prompt/ rubric right into my document, then I answer every individual question in the prompt or rubric, (make sure you separate each question by line) right underneath the question, with a fact, followed by my input from a sociological perspective. If you can’t think of something, look up the prompt and see what other people think, look up different sociological perspectives of the prompt, ask classmates etc. (citing anything you used as inspiration). I SWEAR by just writing and going back later. I literally never even write my introduction paragraph until I finish the body of my essay. How can you write an introduction to an essay you haven’t written yet? Just state a fact, write what you think, look up what other people think, write some more, cite cite cite! You got this!",
      "author": "Ineedadvicepleaze",
      "created": 1639294177,
      "upvotes": 2,
      "replies": {}
    },
    "ho8tuyd": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho8tuyd/",
      "text": "So I love writing essays, and could possibly churn them out if you let me. But sometimes, I can't do it--\n\nWhen I get like that, what helps me the most is writing an outline and free writing\n\nSo you should know what an outline is by now, but if you don't it's basically the bare bones of what you want to write about. The main points are your 3-5 sub topics you're going to address in your essay, and then you fill in everything in between. \n\nThe more detailed my outline is, the better it is for me. Because after that it's just like piecing together a puzzle. \n\nUnder each topic/line in my outline I write a paragraph or so about it. Then I edit it, boom rough draft essay. \n\nAfter that I take some time, keep adding info (usually through free writing) and now my essay is like 25-20 pages long. Oops.",
      "author": "NoodleEmpress",
      "created": 1639316567,
      "upvotes": 2,
      "replies": {}
    },
    "ho7jqfj": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7jqfj/",
      "text": ">For some context, I'm a STEM major\n\nchecks out lmao",
      "author": "JPtoony",
      "created": 1639283528,
      "upvotes": 1,
      "replies": {
        "ho7jw05": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7jw05/",
          "text": "Imagine looking down on a STEM major.",
          "author": "Badsinger_",
          "created": 1639283611,
          "upvotes": 0,
          "replies": {
            "ho7ugwy": {
              "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7ugwy/",
              "text": "I'm not, I'm a stem major too. It's just a stereotype that stem majors hate writing essays, and I was making a joke about how well that lines up with this post",
              "author": "JPtoony",
              "created": 1639289607,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ho6lujj": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6lujj/",
      "text": "Smoke a blunt, you’ll focus. Let us know how that goes. Puff puff",
      "author": "DrySlough",
      "created": 1639266817,
      "upvotes": -7,
      "replies": {
        "ho783ky": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho783ky/",
          "text": "The one time I tried smoking before an essay I fell asleep at my desk.",
          "author": "ElonMuskIs_God",
          "created": 1639277584,
          "upvotes": 1,
          "replies": {}
        },
        "ho6qa73": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6qa73/",
          "text": "Lmaoooo",
          "author": "hoodspeaker",
          "created": 1639268911,
          "upvotes": 0,
          "replies": {}
        },
        "ho6qh64": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6qh64/",
          "text": "I ate edibles and wrote an essay once. It definitely helped me get past my writers block.",
          "author": "hoodspeaker",
          "created": 1639269004,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ho6tk2h": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6tk2h/",
      "text": "Love your username. No advise but I relate to you so much",
      "author": "idkthoughso",
      "created": 1639270464,
      "upvotes": 1,
      "replies": {}
    },
    "ho6wpb5": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho6wpb5/",
      "text": "OMG YES. I EMPATHIZE AND UNDERSTAND THIS SO MUCH the exact same thing happened to me this semester. I’m a stem major and I hadn’t written a paper in like two years until I had this gen-ed in history. \nIt stinks if this is at the end of your semester, because to be honest the only way I got back in the funk of writing essays and papers for this class was just by doing it. First essay we had I flunked, second one was much better in terms of ideas flowing. \nMy best advice tho would be that you can’t think of it like a problem. There’s no equation sheet to check, no step you might have calculated wrong. You (or at least “I”) have to just get it out, put down the words, and THEN go back and fine tune. Let your brain flow and tie the ideas together as it naturally sees fit, even if the sentences and structure aren’t perfect. Then just edit/make sure you’ve included the ideas you needed to and I’m sure you’ll be fine :)",
      "author": "late-to-the-party-",
      "created": 1639271983,
      "upvotes": 1,
      "replies": {}
    },
    "ho7631z": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7631z/",
      "text": "I just sat down and punched out an essay without stopping for the first time in my academic career and I’m a senior in uni rn.",
      "author": "divineInsanity4",
      "created": 1639276574,
      "upvotes": 1,
      "replies": {}
    },
    "ho782k0": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho782k0/",
      "text": "Definitely can relate. I absolutely despise academic writing.",
      "author": "Quiet-Use989",
      "created": 1639277570,
      "upvotes": 1,
      "replies": {}
    },
    "ho7b280": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7b280/",
      "text": "I am a criminal justice and paralegal studies major so I write a lot of essays and briefs. I feel like the hardest part for me is getting started, so I let myself write something terrible. I don’t erase a sentence if I think I’m repeating myself or have used the same word twenty times. Once I have a terrible section done, I go back and start editing. Then once I’m done separating the paragraphs and making it prettier, I repeat the process. Maybe it’ll work for other people too idk",
      "author": "junocereal",
      "created": 1639279082,
      "upvotes": 1,
      "replies": {}
    },
    "ho7f0ke": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7f0ke/",
      "text": "Currently procrastinating a paper for Latin lol  \n\nThing is. it's only 2-3 pages",
      "author": "ogorangeduck",
      "created": 1639281075,
      "upvotes": 1,
      "replies": {}
    },
    "ho7ubd8": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho7ubd8/",
      "text": "I can't either. Luckily I'm really good at writing essays at the very last minute and getting good grades on them. I can't finish essays without the pressure of a looking deadline, and I find it really difficult to get started. What I usually do is just write out whatever comes to mind first. Just the act of getting started usually makes it much easier for me to finish an essay.",
      "author": "fire_and_music",
      "created": 1639289506,
      "upvotes": 1,
      "replies": {}
    },
    "ho89bhp": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho89bhp/",
      "text": "STEM major as well and having the same issue. For context I LOVE writing and reading. I've always been a good essay writer, but once you get to taking all STEM classes it becomes sooo hard to get yourself to do liberal arts kinda things.",
      "author": "CallMeMae",
      "created": 1639301045,
      "upvotes": 1,
      "replies": {}
    },
    "ho8bo1k": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho8bo1k/",
      "text": "You can do this. I was you this entire semester, up until two weeks ago. Get up early tomorrow, sit down, and write as much of your paper as you can (hopefully half or more). Don’t check your phone that much. Have a relaxing night. Do the same the next day—keep writing until you’re done, then hand in your paper by the deadline. \n\nIf I recall correctly, the main theories in sociology are functionalism, conflict theory, symbolic interactionism, and feminist standpoint theory. Maybe pick one of those as the lens for your paper (if it fits the assignment)?\n\n10 pages isn’t long, but it isn’t short either. More moderate than anything else.",
      "author": "SavCItalianStallion",
      "created": 1639303051,
      "upvotes": 1,
      "replies": {}
    },
    "ho8k807": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho8k807/",
      "text": "Dying",
      "author": "ISwallowLolis",
      "created": 1639310293,
      "upvotes": 1,
      "replies": {}
    },
    "ho8nbp2": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho8nbp2/",
      "text": "Write an outline",
      "author": "Business_Downstairs",
      "created": 1639312658,
      "upvotes": 1,
      "replies": {}
    },
    "ho94i4w": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho94i4w/",
      "text": "There’s a website called the most dangerous writing app you could try. You have either a timer or a word count and if you stop writing for too long, it erases everything. The lowest word count is 75, up to over 1000. I usually go with that, but I know the lowest timer is three minutes",
      "author": "QueenofFloof",
      "created": 1639321475,
      "upvotes": 1,
      "replies": {}
    },
    "ho9b7df": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/ho9b7df/",
      "text": "I'm a prof but I also a nit giod at just writing an essay \n\nSo I start with a bullet point list of important sections I want to write about.\n\nI start with INTRO\n\nThen I arrange and rearrange the other bulllet points until I like the narrative I'm developing.\n\nAfter that I write what I call a garbage draft where you just write whatevs no care about grammar or anything.\n\nAfter that, its a matter of revising and citation.",
      "author": "judashpeters",
      "created": 1639324287,
      "upvotes": 1,
      "replies": {}
    },
    "hoa6n9e": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/hoa6n9e/",
      "text": "Also trying to finish a sociology paper and I can't do it for the life of me.",
      "author": "AFanOfStickers",
      "created": 1639336704,
      "upvotes": 1,
      "replies": {}
    },
    "hoaenhc": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/hoaenhc/",
      "text": "My best advice it to go somewhere to do the writing. A library, student union, cafe, ect. Really forces me to just sit down and do ir",
      "author": "womaninstem02",
      "created": 1639339844,
      "upvotes": 1,
      "replies": {
        "hoaeoo1": {
          "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/hoaeoo1/",
          "text": "\nHello! You have made the mistake of writing \"ect\" instead of \"etc.\"\n\n\"Ect\" is a common misspelling of \"etc,\" an abbreviated form of the Latin phrase \"et cetera.\" Other abbreviated forms are **etc.**, **&c.**, **&c**, and **et cet.** The Latin translates as \"et\" to \"and\" + \"cetera\" to \"the rest;\" a literal translation to \"and the rest\" is the easiest way to remember how to use the phrase. \n\n[Check out the wikipedia entry if you want to learn more.](https://en.wikipedia.org/wiki/Et_cetera)\n\n^(I am a bot, and this action was performed automatically. Comments with a score less than zero will be automatically removed. If I commented on your post and you don't like it, reply with \"!delete\" and I will remove the post, regardless of score. Message me for bug reports.)",
          "author": "ectbot",
          "created": 1639339858,
          "upvotes": 1,
          "replies": {
            "hoahjb5": {
              "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/hoahjb5/",
              "text": "Damn😖",
              "author": "womaninstem02",
              "created": 1639341020,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoalm16": {
      "link": "/r/college/comments/rebykr/who_else_cant_sit_down_and_write_an_essay_for_the/hoalm16/",
      "text": "I get so distracted. I write two sentences and take a 40 minute break",
      "author": "09ikj",
      "created": 1639342647,
      "upvotes": 1,
      "replies": {}
    }
  }
}