{
  "sid": "reu6hw",
  "link": "/r/college/comments/reu6hw/i_got_25_on_my_midterm_i_can_still_pass_and/",
  "title:": "I got 25% on my midterm. I can still pass and make-way with my final but...",
  "text": "I kind of lost motivation. I thought that if I studied I'd do fine, all I had to do was review the concepts, and practice as much as I could before the exam. All of that didn't really help one bit. And I look at everybody else's scores and I lie down just telling myself:\n\n \"I guess I'm too dumb for this, maybe I could drop out and go start working or something? Nah, my parents wouldn't even allow me to dropout.\" \n\nI found that if I do really well on my final, particularly 97% or above I'd get enough of a grade to pass (the passing grade is 60). I then tell myself: \n\n\"There's 6 weeks left till the final. I think it's possible to get a 97%-100% if I practice for maybe 6-8 hours a day for these 6 weeks right?\"\n\nAnd here I am. I realize I have assignments, weekly and biweekly quizzes for all the subjects, studying on the other subjects ,labs, and my end of term project. \n\nRealistically speaking it isn't possible at all is it? I need advice",
  "author": "Chessmund",
  "created": 1639331451,
  "updated": 1639516434,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hoa8fmg": {
      "link": "/r/college/comments/reu6hw/i_got_25_on_my_midterm_i_can_still_pass_and/hoa8fmg/",
      "text": "In the future, doing that poorly on the midterm is a sign to withdraw from the course.",
      "author": "peakfreak18",
      "created": 1639337379,
      "upvotes": 2,
      "replies": {
        "hoa8rdt": {
          "link": "/r/college/comments/reu6hw/i_got_25_on_my_midterm_i_can_still_pass_and/hoa8rdt/",
          "text": "According to my university, I can't withdraw after the midterm examination. You have to predetermine you courses during the first 2 weeks of the university and base your experience on whether or not you want to end up withdrawing of said course. \n\nI'm stuck with this.",
          "author": "Chessmund",
          "created": 1639337507,
          "upvotes": 1,
          "replies": {
            "hoa91uk": {
              "link": "/r/college/comments/reu6hw/i_got_25_on_my_midterm_i_can_still_pass_and/hoa91uk/",
              "text": "I get the add/drop period, but most schools have a withdrawal policy too. You don’t get your money back for the course, but you do get to quit without a grade.",
              "author": "peakfreak18",
              "created": 1639337618,
              "upvotes": 1,
              "replies": {
                "hoa9wxd": {
                  "link": "/r/college/comments/reu6hw/i_got_25_on_my_midterm_i_can_still_pass_and/hoa9wxd/",
                  "text": "Yeah, just to double check on my knowledge, I was unfortunately right. The university does ***not*** have a withdraw policy.\n\nYeah no worries though. Thanks for you advice",
                  "author": "Chessmund",
                  "created": 1639337954,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}