{
  "sid": "q84dmb",
  "link": "/r/college/comments/q84dmb/double_majoring_how_hard_is_it/",
  "title:": "Double Majoring. How hard is it?",
  "text": "I'm planning on double majoring in Western Languages and Literatures & Psychology. I love working hard and studying makes me my most productive, happy self. I really want to get a degree in PSY and saw that my college offers it as a second major to WLL. Is it worth it do double major? Has anyone have any advice based on their experience? I don't want to feel burnt out or make my life a living hell by putting myself through a lot of stress.",
  "author": "tiramisuandbooks",
  "created": 1634232195,
  "updated": 1634590132,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hgmysrt": {
      "link": "/r/college/comments/q84dmb/double_majoring_how_hard_is_it/hgmysrt/",
      "text": "i’m a double major, one of mine is psych. It’s not easy but it’s doable. I take 5/6 classes a semester instead of the 4 (average class load for one major) and i’m still graduating on time. If it helps you niche yourself for the career you want than it’s worth it.",
      "author": "rynpickles",
      "created": 1634233954,
      "upvotes": 6,
      "replies": {}
    },
    "hgoa0vg": {
      "link": "/r/college/comments/q84dmb/double_majoring_how_hard_is_it/hgoa0vg/",
      "text": "I’m double majoring in medical lab science and statistics. The credits line up so I’m meeting my required classes and electives. As for content, I’m passionate about these subjects so I don’t mind at all. Sometimes it is more work but I enjoy learning it. But I’m mostly double majoring because it is really convenient for me to do so.\n\nAs for burnout, some semesters I take it slow and some I don’t mind. Ask your advisor what she recommends each semester because a lot of content you’ll be able to make connections across classes",
      "author": "milk1tea",
      "created": 1634255154,
      "upvotes": 2,
      "replies": {}
    },
    "hgpjda9": {
      "link": "/r/college/comments/q84dmb/double_majoring_how_hard_is_it/hgpjda9/",
      "text": "Plan carefully and have the majors satisfy each other’s elective requirements as much as possible. Very doable.\n\nBut make sure the two majors complement each other, other wise not worth the hassle..",
      "author": "AcademicDifficulty",
      "created": 1634278549,
      "upvotes": 2,
      "replies": {}
    }
  }
}