{
  "sid": "pvenou",
  "link": "/r/college/comments/pvenou/working_parttime_while_attending_university/",
  "title:": "working part-time while attending university full-time on a scholarship",
  "text": "hi,\n\nI'm a second year Business Administration student and I work part-time as an accounting clerk. I know many people don't see BA as a challenging the degree (and it isn't), but I am on a scholarship for which I have to finish all semesters in the top 10%. I managed till now, but I wasn't working at the time.\n\nI was wondering if any of you have any advice on how to keep my scholarship and continue working. I start uni on Monday and I'm a bit nervous because I don't know how I'm gonna do anything. my workplace offers me a lot of flexibility (I can basically go in whenever I want and for how many hours I want as long as I reach my target of 20h/week), but my timetable is SUCH a shitfest and now my seminars are on campus which is incredibly inconvenient. \n\nI would quit my job 'cause I'm definitely not enamoured with it or anything, but I need the money and I think the experience won't hurt either. till I can find something 100% remote I'll have to deal with it, so I'm looking forward to any suggestions you might have on how to improve my time management. thanks!",
  "author": "bibicicimici",
  "created": 1632600978,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hef95pz": {
      "link": "/r/college/comments/pvenou/working_parttime_while_attending_university/hef95pz/",
      "text": "Check for on campus job opportunities. Lots of different depts need info desk/administrative stuff where half the time you can just sit and do homework while you wait for somebody to ask a question. \n\nThat being said, if thats not an option, what you're doing is doable. It's all about time management. I know it sounds obvious but it makes a big difference. Schedule your whole week thoroughly. I sit down on Sunday and make a schedule through Friday (Sat is for cleaning, catching up, taking a breather). I write down everything I have to do that week and start inputting it in, working backwards (filling Friday first, Sunday last). During my busy weeks I literally schedule like by the hour, including meals, showers, basically anything that takes more than 10 minutes. And I always overbudget what I think I'll need for time so that if something else goes long I have wiggle room, and I feel more in control when I feel ahead. This helps me a lot because it gets rid of the \"oh my god when and how am I possibly going to do this all\" and helps just focus on the task at hand. Also, it's worth talking to your boss to see how flexible that 20 is. Having the flexibility to work 15 one week and 25 another to make up for it is really valuable because some weeks will be busier than others. Also, on the commute front, I sometimes find it valuable to listen to lectures or audio versions of e texts while I drive, if either are available. Not for the first time you take in the material, but rewatching or rereading in this was can help with studying (BUT DRIVE SAFELY YOUR MOST IMPORTANT FOCUS IS OBVIOUSLY THE ROAD).",
      "author": "Maleficent_Unit_7928",
      "created": 1632707725,
      "upvotes": 2,
      "replies": {
        "heg9g2d": {
          "link": "/r/college/comments/pvenou/working_parttime_while_attending_university/heg9g2d/",
          "text": "Thank you so much! I can indeed make up for lost hours next weeks which is really good. I'll take legal vacations during the exam session to be fully focused on school. I managed to create a doable timetable that I'll follow every week unless something comes up.\n\nI will definitely try your method of managing my time. Your comment is incredibly helpful and I will definitely take you advice into account!",
          "author": "bibicicimici",
          "created": 1632733085,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634052332
}