{
  "sid": "r6rk2n",
  "link": "/r/college/comments/r6rk2n/i_found_an_online_calculator_that_tells_you_what/",
  "title:": "I found an online calculator that tells you what you need to get on a final in order to pass a class!",
  "text": "Hi guys! So I just found an online calculator, where if you put in the final exam worth and your desired class grade, it will tell you how much you need to get on the final in order to get that grade. It's really helpful so I thought I would share.\n\n [Finals Calculator (thecalculator.co)](https://www.thecalculator.co/others/Finals-Calculator-304.html) \n\nGood luck on your finals everybody!",
  "author": "ThoughtCenter87",
  "created": 1638398745,
  "updated": 1639854476,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hmv6xlp": {
      "link": "/r/college/comments/r6rk2n/i_found_an_online_calculator_that_tells_you_what/hmv6xlp/",
      "text": "This is dope thanks for this !",
      "author": "NotoriousJez",
      "created": 1638403815,
      "upvotes": 2,
      "replies": {
        "hmv8xya": {
          "link": "/r/college/comments/r6rk2n/i_found_an_online_calculator_that_tells_you_what/hmv8xya/",
          "text": "No problem!",
          "author": "ThoughtCenter87",
          "created": 1638404700,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmvzgb5": {
      "link": "/r/college/comments/r6rk2n/i_found_an_online_calculator_that_tells_you_what/hmvzgb5/",
      "text": "I find the idea of it to be somewhat troubling.  Sophomores in high school should be able to do the math necessary to solve this kind of problem.  If a college student needs an online calculator for this, it indicates a deficiency in basic math.  Some \"back to the basics\" style studying would be in order.",
      "author": "taxref",
      "created": 1638416270,
      "upvotes": 4,
      "replies": {
        "hmw0lsp": {
          "link": "/r/college/comments/r6rk2n/i_found_an_online_calculator_that_tells_you_what/hmw0lsp/",
          "text": "Have you seen what highschoolers are taught recently regarding math? I just got out of high school two years ago and the math and methods they teach are deficient. When I was in middle school California decided to change how high school teachers would teach math across the board. When I entered college I had to take a remedial math class because I got into precalculus unable to understand anything. My professor recommended me to drop precalculus and take remedial math that semester so I did.\n\nAt this point, I should be able to solve a problem like this. I get it. But the way I've been taught math is this: Here's a problem, here's the exact method to solve this problem, now do this fifty times over following this exact method. And see, I can do that. It's rote memorization. But I can't solve a problem that I have never seen before. This is something that I need practice in, not actual math but problem-solving and creative thinking in the realm of math.\n\nCurrent highschoolers aren't taught creativity in math. They're just taught \"Here's a problem, memorize this way to do it, here's 50 more problems that are exactly the same but with the numbers changed.\" They're not even taught *why* they're solving a problem, they're just taught to do it. Honestly, it's entirely possible that I know how to solve this formula, but because it's written in words I don't know how to set it up. It's probably why I struggle with physics despite passing two precalculus classes.",
          "author": "ThoughtCenter87",
          "created": 1638416811,
          "upvotes": 1,
          "replies": {
            "hn0ildk": {
              "link": "/r/college/comments/r6rk2n/i_found_an_online_calculator_that_tells_you_what/hn0ildk/",
              "text": "Going into more detail about \"back to the basics\" studying, there are many basic math books and websites designed for different grades.  Use those tools now, and you can catch up a great deal in the space of a few months.\n\nI would recommend you start out by looking at 8th grade problems.  If you can do those problems easily, move to a higher grade.  If you struggle with the 8th grade level, move down to a lower grade.  Don't be embarrassed if you have to go to lower grades.  Using that method, you can discover what level of understanding you currently have.  Begin your self-study from there.\n\nLearning those basics should help with both your confidence, and your GPA.",
              "author": "taxref",
              "created": 1638497029,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}