{
  "sid": "qt9zsf",
  "link": "/r/college/comments/qt9zsf/computer_science_no_background/",
  "title:": "Computer science - no background",
  "text": "So basically as the title says, can one major in computer science if they don’t have any background in coding/programming or anything of that sorts? \n\nI’m in my first year and hoping to pursue an applied math degree. My college needs us to pair this up with either cs/economics/statistics. \n\nOut of those three, I feel like cs would be way more employable if partnered with math so I just want to know if it’s possible to major in that too if one doesn’t have any prior experience to cs.",
  "author": "Upbeat_Ad2767",
  "created": 1636837095,
  "updated": 1637181976,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hki6rvj": {
      "link": "/r/college/comments/qt9zsf/computer_science_no_background/hki6rvj/",
      "text": "Pretty sure they anticipate those taking intro CS classes to have little to no coding experience. You’ve already got the abstractions of math out of the way so I think CS would be a good match.",
      "author": "goatboat_",
      "created": 1636839484,
      "upvotes": 7,
      "replies": {}
    },
    "hki7tej": {
      "link": "/r/college/comments/qt9zsf/computer_science_no_background/hki7tej/",
      "text": "Lots of people do! If you want to prep for it, you can always get the textbooks in advance (reach out to the prof) and do a bit of studying before the classes.",
      "author": "zifmer",
      "created": 1636839924,
      "upvotes": 3,
      "replies": {}
    },
    "hkipje3": {
      "link": "/r/college/comments/qt9zsf/computer_science_no_background/hkipje3/",
      "text": "Dude, I started college at the age of 32 with zero coding experience and I was shit at math. So I'm going from being a bartender to software engineer when I graduate in two years. It's going to take me 6 years to graduate since I work full time and can only do about 20 credits a year, plus that's all I can afford.",
      "author": "ShadowIG",
      "created": 1636847434,
      "upvotes": 3,
      "replies": {}
    },
    "hkjrx6i": {
      "link": "/r/college/comments/qt9zsf/computer_science_no_background/hkjrx6i/",
      "text": "Definitely. In my first programming class I think like half the people there had never done any coding before. If you have an applied math background, you will also be well prepared for the math classes in CS (or you may have taken them, already).",
      "author": "postmaloneismediocre",
      "created": 1636865140,
      "upvotes": 3,
      "replies": {}
    }
  }
}