{
  "sid": "qjqunv",
  "link": "/r/college/comments/qjqunv/i_keep_getting_texts_about_my_student_email_that/",
  "title:": "I keep getting texts about my student email that say my academic advisor is trying to meet with me, my student email doesn’t have any of those messages tho",
  "text": "I don’t know what to do. I’m being told there’s issues with my aid, my transfer credits, and my degree. I have looked through everything on my end, and none of that matches up to what I see. I also get these texts saying to check my student email, and there isn’t any emails that match what the texts say. I have a hard time calling my academic advisor because I have severe social anxiety, and I’m exclusively doing online right now. I’m also about to switch to another CC, but this started before I started to transfer.",
  "author": "beansyboii",
  "created": 1635691123,
  "updated": 1635779532,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hirqgwb": {
      "link": "/r/college/comments/qjqunv/i_keep_getting_texts_about_my_student_email_that/hirqgwb/",
      "text": "[deleted]",
      "author": null,
      "created": 1635692316,
      "upvotes": 6,
      "replies": {
        "hisdsuu": {
          "link": "/r/college/comments/qjqunv/i_keep_getting_texts_about_my_student_email_that/hisdsuu/",
          "text": "They have my name in them",
          "author": "beansyboii",
          "created": 1635702471,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hisk16c": {
      "link": "/r/college/comments/qjqunv/i_keep_getting_texts_about_my_student_email_that/hisk16c/",
      "text": "Sounds like you're going to have to call your advisor or the financial aid office. Make sure you're checking your official college email, as well.",
      "author": "Galactica13x",
      "created": 1635705050,
      "upvotes": 2,
      "replies": {}
    },
    "hit7zzk": {
      "link": "/r/college/comments/qjqunv/i_keep_getting_texts_about_my_student_email_that/hit7zzk/",
      "text": "Maybe write an email to your advisor telling them what's happening. If necessary, you may have to set up a phone or zoom appointment. I know anxiety can be a b*tch when it comes to stuff like this, but sometimes it just can't be avoided. The supposed things that are going wrong according to the texts are important for your degree and you have to stay on top of them, no matter what.",
      "author": "NoDryHands",
      "created": 1635715194,
      "upvotes": 1,
      "replies": {}
    }
  }
}