{
  "sid": "pr0wxb",
  "link": "/r/college/comments/pr0wxb/how_do_i_find_parties/",
  "title:": "How do i find parties",
  "text": "Im a sophmore in college, and i am yet to go to a party, the most ive done is go clubbing. I have friends, and some of them go to parties, but never seem to invite me. Ive met a lot of people in college, and have had tons of fun, but i just wish i could find and go to parites",
  "author": "Outrageous_History_2",
  "created": 1632024100,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hdflus3": {
      "link": "/r/college/comments/pr0wxb/how_do_i_find_parties/hdflus3/",
      "text": "Multiple ways you can attack this. It also depends on the college life there as well. \n\n1. Ask your friends if you can go to one of their parties. Most of the time people don't know that you actually wanted to go to, so they'll invite you. But don't be pushy on the weekends. If a person \"forgets\" about you, they aren't really a friend but more of an acquaintance. \n2. Go to the street/neighborhood that tends to host the most parties. Just drive there and walk up. Oftentimes these parties won't have a \"bodyguard\" or those \"bodyguards\" neglected their duties. \n3. Befriend a person in a fraternity or sorority. You can show up to the fraternity parties and the person there will ask \"Who do you know?\" say \"I know so-and-so\" and boom you're in. With the sorority girls, often sororities don't host their own parties but will go to the fraternities, you can tag along. If you are like the sorority's best friend and you just know everybody, you are a shoo-in. The more girls in your friend circle the more likely you are invited to parties.\n4. Join a fraternity/sorority. Sometimes entering their inner circle is the quickest way. I'm part of one, and we host one every Friday and Saturday. I don't go all the time as I do have responsibilities.\n\nI understand the appeal and sometimes it's cool to go once and a while. But college parties are nothing like they show on movies and televisions. So don't go out with over-arching expectations or you might accidentally disappoint yourself.",
      "author": "Asianati",
      "created": 1632032651,
      "upvotes": 1,
      "replies": {}
    },
    "hdfl9g8": {
      "link": "/r/college/comments/pr0wxb/how_do_i_find_parties/hdfl9g8/",
      "text": "Why don’t you just start asking your friends, “what are you doing this weekend?” And see if they invite you to tag along. The process of attending a party in college is pretty casual and random even. Don’t sit and wait to be invited, just reach out to your friends.",
      "author": "Scholarscollective",
      "created": 1632032224,
      "upvotes": 1,
      "replies": {}
    },
    "hdf9cc7": {
      "link": "/r/college/comments/pr0wxb/how_do_i_find_parties/hdf9cc7/",
      "text": "Parties aren't fun, they're gross and smell weird haha. But usually they're just word of mouth. The hosts tell their friends and it spreads that way.",
      "author": "elyse-on-reddit",
      "created": 1632024707,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634050696
}