{
  "sid": "r2ili4",
  "link": "/r/college/comments/r2ili4/i_cannot_seem_to_fit_in_in_my_university/",
  "title:": "I cannot seem to fit in in my university.",
  "text": " I recently moved to a university over 1000 kilometers from home.  However, I cannot adjust to this place. I am lonely all the time and  have barely any friends. Everyone made friends online while I did not. I  cannot communicate well, I keep fumbling and mis-speaking all the time.  There are no activities I am interested in that I can do here.  Everyone else here seems to be having fun. I don't know what to do. Please help.",
  "author": "IND_PILOT_380",
  "created": 1637915319,
  "updated": 1638206888,
  "over_18": false,
  "upvotes": 40,
  "upvote_ratio": 0.98,
  "comments": {
    "hm59o4y": {
      "link": "/r/college/comments/r2ili4/i_cannot_seem_to_fit_in_in_my_university/hm59o4y/",
      "text": "People must understand that it is normal to feel lonely at college. Given how far away you are from home, it can even make you feel lonelier without the support system of your family. Looks decieve (!!!!), and there are many people at your university in the same position.",
      "author": "apollothekitty",
      "created": 1637927599,
      "upvotes": 16,
      "replies": {}
    },
    "hm4wqc3": {
      "link": "/r/college/comments/r2ili4/i_cannot_seem_to_fit_in_in_my_university/hm4wqc3/",
      "text": "> I cannot communicate well, I keep fumbling and mis-speaking all the time\n\nOkay I know this isn’t the focus of your question and you may call me crazy but I had the same problem and my doctor fixed it. He told me to put away all technology/social media away for a day and see if that makes a difference, AND IT FUCKING DID. Basically he said that it happens when there’s too much on your mind and you try to speak and just run over some words.\n\nSpecifically social media sites like Reddit, Instagram, and Tik Tok where you just mindlessly scroll till the end of times.",
      "author": "M33RHARIS",
      "created": 1637916455,
      "upvotes": 27,
      "replies": {}
    },
    "hm5gvhl": {
      "link": "/r/college/comments/r2ili4/i_cannot_seem_to_fit_in_in_my_university/hm5gvhl/",
      "text": "In the meantime, take that as a chance to focus on your studies. You will eventually make friends since you’ll be engaging in different activities",
      "author": "JournalistDapper7098",
      "created": 1637932740,
      "upvotes": 3,
      "replies": {}
    },
    "hm8q5lu": {
      "link": "/r/college/comments/r2ili4/i_cannot_seem_to_fit_in_in_my_university/hm8q5lu/",
      "text": "Are you tall? That's the problem. Because you already learned the culture of where you grew up",
      "author": "Cylinder126",
      "created": 1637990367,
      "upvotes": 1,
      "replies": {}
    }
  }
}