{
  "sid": "qn5qm9",
  "link": "/r/college/comments/qn5qm9/an_annoying_classmate_in_my_morning_class/",
  "title:": "An annoying classmate in my morning class.",
  "text": "I’m a freshman at a community college and I enjoy my English class. The professor is really cool and he makes class pretty fun and understandable. I’m glad I’m passing his class too!\n\nThe only problem is…there’s this one classmate in there that just doesn’t shut up. On Monday, he took up 30 minutes of class talking about nonsense to our professor just to understand the example the professor used. He started to get on my nerves since last month and idk how to control that feeling. I’m ok with him, but on Wednesday he asked me if I was busy and I responded yes to him because I had to do a major project that was for one my classes I was taking at night. He told me he had nothing better to do and decided to join along with me to the library. As much as I like to socialize with people, I WANT my alone time when it comes to school work. Thankfully, I saw one of my close guy friends nearby and went to talk to him. I don’t think my classmate got the hint because he just stood there with me not doing or saying anything and was just waiting for me to finish. I think my friend noticed that I was being annoyed by him because he told him if he could leave us alone cause he had something personal he wanted to tell me. My classmate left and idk where he went after that.\n\nMost of the other students in class are really annoyed with him and how he would talk a lot in class just for whatever. My professor is even noticeably annoyed because of how much time he takes up in class. I don’t wanna be rude and tell him to be quiet or anything, but I really want this guy to not take up class time for the longest. Does anybody have advice or tips to help me shut this guy up or help me ignore him and control my feelings?",
  "author": "Surveycorps_soldier",
  "created": 1636097150,
  "updated": 1636137001,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {}
}