{
  "sid": "qqjuk1",
  "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/",
  "title:": "Commuters- how far do you drive?",
  "text": "I’m planning on driving to a college that’s 1.5 hours away every Monday and Wednesday, (only 1 semester) does that seem like too long of a drive or just about right?",
  "author": "roachincalzone",
  "created": 1636511264,
  "updated": 1636655201,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk0vjol": {
      "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk0vjol/",
      "text": "A one way 1.5 hour drive is a ridiculously long commute, you're driving 6 hours a week just to go to class and back home.",
      "author": "Sermos5",
      "created": 1636514393,
      "upvotes": 3,
      "replies": {
        "hk0wjhb": {
          "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk0wjhb/",
          "text": "Yeah I know, it’s gotta be this way bc I can’t afford the $6000 housing :/ good thing it’s only a semester",
          "author": "roachincalzone",
          "created": 1636514869,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk0wao7": {
      "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk0wao7/",
      "text": "I drive 45 min to class and 45 min home every day. Sometimes this is a primary motivator for skipping class. It's not so bad, but not so great either.",
      "author": "ImpressiveBowler5574",
      "created": 1636514751,
      "upvotes": 2,
      "replies": {
        "hk0wqql": {
          "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk0wqql/",
          "text": "Yeah I’m hoping since it’s only 2 days a week I won’t wanna skip but we’ll see",
          "author": "roachincalzone",
          "created": 1636514966,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk19avt": {
      "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk19avt/",
      "text": "In the spring I drove 1hr 15mins each way for one class because I couldn't afford an apartment yet. In hindsight it was definitely not worth it",
      "author": "VertWithStick",
      "created": 1636521832,
      "upvotes": 2,
      "replies": {
        "hk1cmq0": {
          "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk1cmq0/",
          "text": "For one class? I’d be driving for all my classes",
          "author": "roachincalzone",
          "created": 1636524016,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk4eify": {
      "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk4eify/",
      "text": "I drive about an hour but I don’t want to live in the dorms Bc I love my cat and hey free rent with parents",
      "author": "Mushy-Cryptos",
      "created": 1636580467,
      "upvotes": 2,
      "replies": {
        "hk4ork6": {
          "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk4ork6/",
          "text": "I’m glad someone else does this. Do you go everyday? And do you think you’re saving money doing the drive?",
          "author": "roachincalzone",
          "created": 1636584604,
          "upvotes": 1,
          "replies": {
            "hk4pi8t": {
              "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk4pi8t/",
              "text": "Dorms are 2,500. Plus required meal plan +1500. No cat and far from my boyfriend. Also hate people so roommates wouldn’t work out. The drive is 50 miles one way every day of the week so 500 miles a week next semester getting 31 miles a gallon…so 16 gallons a week so about $50 a week in gas…times about 16 weeks = $800 in gas throw in oil changes and maintenance let’s say +$400 =$1200. So I’d say definitely worth it  am I putting a lot of miles on my car? Yes. But I just bought this car for 12.5k with 46k miles with the intention of putting a lot of miles on it. Luckily 90% of the drive is highway sooooo",
              "author": "Mushy-Cryptos",
              "created": 1636584910,
              "upvotes": 2,
              "replies": {
                "hk4qix4": {
                  "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk4qix4/",
                  "text": "I really appreciate you replying, we are in a very similar situation so I appreciate hearing someone it’s working out for!",
                  "author": "roachincalzone",
                  "created": 1636585340,
                  "upvotes": 1,
                  "replies": {
                    "hk4qq5n": {
                      "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk4qq5n/",
                      "text": "You make it work ya know? And the drive is honestly nice to clear my mind it’s like a nice break",
                      "author": "Mushy-Cryptos",
                      "created": 1636585426,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk3dzee": {
      "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk3dzee/",
      "text": "You'd be spending close to $1000 bucks for gas alone. \n\nI commute 45 minutes and it's not bad. I've commuted for work about this far before. \n\nI still would find a way around it. You'd be losing 6 hours a week just driving. That's 6 less hours you have to study. On the days that you'll drive, you probably won't get shit done and they'll exhaust you.",
      "author": "Awkward_Mail_2786",
      "created": 1636566295,
      "upvotes": 1,
      "replies": {
        "hk3nvkl": {
          "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk3nvkl/",
          "text": "But $1000 is better than the 6k housing and 2k meal plan so idk",
          "author": "roachincalzone",
          "created": 1636570114,
          "upvotes": 1,
          "replies": {
            "hk3s6mo": {
              "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk3s6mo/",
              "text": "That's only looking at a small portion of it though. \n\nGranted, your time doesn't *cost* money but it could be making you money. I always look at my time driving as a cost and generally value it at about 10 bucks an hour. \n\nCar maintenance costs won't be trivial. That much driving will incur quite a bit of cost. If you aren't doing your own mechanic work, it'll be much more expensive to get anything done. For what it's worth, I spend about 3k a year in parts alone for my car. That doesn't include all the work I put into it. Considering that ignoring some car repairs can get you killed or junk your motor, it's a necessary thing to keep track of. Without doing my own work, I'd easily be looking at closer to 5 or 6 thousand a year on maintenance. My car is a 2009 with \\~150k miles on it and it's in excellent shape. \n\nIf you're not driving a car that's well kept, it's going to cost you a ton of money. If you haven't been keeping up on the maintenance, it'll all start piling up very quickly. \n\nMy girlfriend drives an hour and a half to work 3 times a week. It's a drain. I notice that it's something that greatly affects her. That amount of time stuck in a car sucks. Not only that, her Subaru Forester 2014 has around 60-70k miles on it and a year or two ago both rear wheel hub bearings went to shit simultaneously. It wasn't more than a month of replacing the first one that we had to replace the second one. Either way, rear wheel hub bearings are about 120 bucks a pop. We spent around 2 days replacing them. Without handling the labor, I think the quotes she was getting for replacing only one of them was above $1000. \n\nEven simple things like a ball joint going bad (as they inevitably will) can cost 100-250 bucks. That price goes for tie rod ends as well which wear out also. One day my car's gas pump died while I was coasting down the highway. Cue a 150 dollar bill to tow it home, another 50 for the CHEAPEST pump available and about 3-4 hours worth of work to get myself back on the road. It would be much more expensive if I wasn't able to cut a hole in my car to access the tank. Otherwise I'd have to drop the tank and shit. I had to replace a brake caliper that ceased up completely, that was over 100 bucks with 4 hours of work. \n\nI think it being only 1 semester is a good thing. I think it'll be fine for that. There are a ton of other associated costs with using a car that much though. They aren't cheap to maintain but they are even more expensive to have to replace out of nowhere.",
              "author": "Awkward_Mail_2786",
              "created": 1636571781,
              "upvotes": 1,
              "replies": {
                "hk4odjs": {
                  "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk4odjs/",
                  "text": "Yeah I know, we do the mechanic work in my family and I just got a new used car with 70k miles (how do you pay 3k in parts each year? That’s unheard of for me.) Everyone here is trying to convince me to not do it but it’s not really my choice. I’m not too bummed, I feel like 24 hours worth of driving a month for like 3.5 months isn’t that horrible. Saving 6k just makes sense in my situation. \n\nI should also add that I live in a small town and the nearest college is 1 hour drive so this isn’t too unheard of in my area. The nearest Walmart is about 20 miles away also lol",
                  "author": "roachincalzone",
                  "created": 1636584444,
                  "upvotes": 1,
                  "replies": {
                    "hk4v8lj": {
                      "link": "/r/college/comments/qqjuk1/commuters_how_far_do_you_drive/hk4v8lj/",
                      "text": "I have a turbo'd car. That's how I pay 3k a year. It gets driven.",
                      "author": "Awkward_Mail_2786",
                      "created": 1636587382,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}