{
  "sid": "q7jjyl",
  "link": "/r/college/comments/q7jjyl/what_is_a_twoterm_loan_and_a_threeterm_loan/",
  "title:": "What is a two-term loan and a three-term loan?",
  "text": "I can't find any definitions on Google.\n\nMy financial aid states:\n\n\"Due to Federal regulations, you may not request more than one half (of a two-term loan) or one third (of a three-term loan) of your total loan amount in the Autumn semester.\"\n\nThanks for the help :)",
  "author": "kashimelo",
  "created": 1634155776,
  "updated": 1634581668,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgiy57k": {
      "link": "/r/college/comments/q7jjyl/what_is_a_twoterm_loan_and_a_threeterm_loan/hgiy57k/",
      "text": "Call your college's financial aid office.",
      "author": "SouthernRhubarb",
      "created": 1634155836,
      "upvotes": 2,
      "replies": {
        "hgiyguq": {
          "link": "/r/college/comments/q7jjyl/what_is_a_twoterm_loan_and_a_threeterm_loan/hgiyguq/",
          "text": "I didn't want to call and wait on hold for an hour just to ask for a definition. The office has terrible waiting times",
          "author": "kashimelo",
          "created": 1634155967,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hgjh0i5": {
      "link": "/r/college/comments/q7jjyl/what_is_a_twoterm_loan_and_a_threeterm_loan/hgjh0i5/",
      "text": "If I’m understanding this correctly, are you trying to only accept part of your loan? Cause based off the type of loan, you may have to accept the full amount for the whole year. I’m graduating this fall and tried to accept only the fall semester loan but it said I had to accept it all. I called the school and they were able to sort it out for me in a way that I could get the whole amount for the one semester I needed. If you can’t get a hold of them, send an email and then call early tomorrow.",
      "author": "WickedPuffin",
      "created": 1634163846,
      "upvotes": 1,
      "replies": {}
    },
    "hgjz3wy": {
      "link": "/r/college/comments/q7jjyl/what_is_a_twoterm_loan_and_a_threeterm_loan/hgjz3wy/",
      "text": "Your loans are evenly dispersed by the semesters your enrolled. Let’s say you’re enrolled for Fall 2021 and Spring 2022 semesters. If you accepted 10k in loans for the 2021-2022 aid year you cannot receive more than 5k either semester.",
      "author": "Concerned-23",
      "created": 1634172298,
      "upvotes": 1,
      "replies": {}
    },
    "hgkepdk": {
      "link": "/r/college/comments/q7jjyl/what_is_a_twoterm_loan_and_a_threeterm_loan/hgkepdk/",
      "text": "“Term” here is just “grading period.” \n\nAssuming your school is on the semester system rather than trimesters or quarters, then a two-term loan would be a loan intended to be used over two terms, presumably the fall semester and spring semester. Half the money is disbursed at the start of the fall semester, and the other half at the beginning of the spring semester. (A three-term loan in this case could be fall semester, spring semester, and maybe either the summer semester or a winter-break mini-mester if your school does that.)\n\nIf your school is on a trimester system, then a loan would most likely be divided into three terms to begin with, and would be disbursed in thirds, one-third of the money given out at the start of each trimester.",
      "author": "themathymaestro",
      "created": 1634179857,
      "upvotes": 1,
      "replies": {}
    }
  }
}