{
  "sid": "riuddk",
  "link": "/r/college/comments/riuddk/handling_premed_stress/",
  "title:": "Handling Premed Stress",
  "text": "Premeds and former Premeds of reddit. How do you guys cope with the stress of being a premed. I've been in University for 2 years now and I had to take time off due to stress and Covid, prior to that my grades were absolute shit and I hat tons of anxiety. This was my first semester of coming back and Up until the finals my grades were really good, but getting my results back I realised my grades give me max 3.6 and is really shitty since my first year was about 2.3. I studied hours upon hours and sacrificed a lot of things this semester but achieved nothing. How do you guys cope with getting shit grades and shit results even though you try really hard? TBH I just wanna kill myself cuz I feel like I've gotten nowhere and wasted 2 years of my life not getting results. Any advice is appreciated.",
  "author": "horsesaresexy",
  "created": 1639785667,
  "updated": 1639862330,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hozzfbl": {
      "link": "/r/college/comments/riuddk/handling_premed_stress/hozzfbl/",
      "text": "First of all, suicidal thoughts are serious and you should seek help if you need it. There is no shame in taking a semester off for mental health. Some colleges allow you to petition for a late medical withdrawal due to mental health.\n\nI am pre-med and was in a similar situation. I would also work really hard through the semester and get fairly good grades, just to burn out and fail the final. After my third semester, I was so sad about my grades because I knew they weren't good for pre-med. During that winter break, I started a new medication, and ever since I've had a strong upward GPA trend.\n\nAs I've gotten older I've realized there are many different paths people take to medical school and that perspective has helped me. My neighbor who has a degree in arts decided she wanted to attend med school at 28, she is currently taking pre-med courses and hopes to apply in two years. Another friend of mine graduated with a 3.6 gpa and worked as a barista for two years before getting in.\n\nAdvice to you: Figure out why you burn out or perform poorly. Start focusing on other areas such as research and shadowing as long as it doesn't hurt your GPA.\n\nAlso, you say your grades give you a 3.6 gpa, that's a really good upward trend and med schools will take that into consideration. Also, so many people do a post-bacc or master's before med school to get more research or better GPA.",
      "author": "Longjumping_Bison368",
      "created": 1639792885,
      "upvotes": 1,
      "replies": {}
    }
  }
}