{
  "sid": "rcut87",
  "link": "/r/college/comments/rcut87/if_a_class_is_too_difficult_for_me_to_pass/",
  "title:": "If a class is too difficult for me to pass regardless of professor, what should I do?",
  "text": "Currently in a class where I thought I would be alright in but 3rd class into it and I understand nothing. Its also to do with the fact my professor isn't really even teaching us the topics either. None what is shown is class has been in homework or practice. Ontop of that, his RMP score is 20% which is insane. Unfortunately my school lacks professors for this subject so he is really the only one teaching this exact class.\n\nI am required to pass this class (even though it literally doesn't benefit me at all for the career path I want). How am I to pass college if there is this one class blocking me from passing?",
  "author": "Badawan",
  "created": 1639094047,
  "updated": 1639516778,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hnxgcvt": {
      "link": "/r/college/comments/rcut87/if_a_class_is_too_difficult_for_me_to_pass/hnxgcvt/",
      "text": "Change your major, I guess",
      "author": "GenXtreme1976",
      "created": 1639099720,
      "upvotes": 1,
      "replies": {
        "hnxh74j": {
          "link": "/r/college/comments/rcut87/if_a_class_is_too_difficult_for_me_to_pass/hnxh74j/",
          "text": "Thats the issue, no matter what major I change to, its gonna be there since its labeled a general studies course even though it shouldn't be. I am a biology major and this course in particular is a physics class. It makes zero sense why I need to learn about this, especially this one which is about electrical stuff. All i want to do is be a simple marine biologist learning about the marine life and helping them but I won't be able to do that if im stuck on this one course forever. If my school didnt screw me over by changing me to this one professor i avoided specifically for his bad reviews I may have had a better chance in it.",
          "author": "Badawan",
          "created": 1639100091,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnxzpt5": {
      "link": "/r/college/comments/rcut87/if_a_class_is_too_difficult_for_me_to_pass/hnxzpt5/",
      "text": "For some of my courses I could take a class with the community college and transfer it for credit. Professors tend to be more lenient, at least in my experience.",
      "author": "Dansii",
      "created": 1639108294,
      "upvotes": 1,
      "replies": {
        "hny0814": {
          "link": "/r/college/comments/rcut87/if_a_class_is_too_difficult_for_me_to_pass/hny0814/",
          "text": "I may have to try that if possible. Though it turns out this quarter I am ultimately f'd because I cant drop the coruse because not only do I lose my scholarship, I would have to owe the school money because of it. I cant fail the class because it would not only ruin my GPA I will as well lose my scholarship. I specifically chose classes this quarter to be semi easy on me but this professor just made this become one of the worst quarters ever.",
          "author": "Badawan",
          "created": 1639108530,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}