{
  "sid": "rir2iu",
  "link": "/r/college/comments/rir2iu/tba_under_time_for_online_class/",
  "title:": "TBA under time for online class",
  "text": "So next semester I signed up for a public speaking class. It says it’s online/virtual, but the time says TBA. I know this means to be announced, but what does it really mean? Will it get in the way of my other classes? Is it asynchronous? I genuinely have no idea. I have two classes like this next semester so I’m lost",
  "author": "sleepyyvirgo",
  "created": 1639775687,
  "updated": 1639787362,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hoyxlz3": {
      "link": "/r/college/comments/rir2iu/tba_under_time_for_online_class/hoyxlz3/",
      "text": "TBA under an online class is always async in my experience",
      "author": "maora34",
      "created": 1639776242,
      "upvotes": 4,
      "replies": {
        "hoz27cs": {
          "link": "/r/college/comments/rir2iu/tba_under_time_for_online_class/hoz27cs/",
          "text": "Same. The synchronous online classes in my school are marked as online/DL but with weekly meeting times; the asynchronous ones are DL but TBA for time.",
          "author": "blackesthearted",
          "created": 1639778115,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoyxtmd": {
      "link": "/r/college/comments/rir2iu/tba_under_time_for_online_class/hoyxtmd/",
      "text": "At my school TBA and ARR usually means it’s going to be asynch if it’s online/virtual. Even with times, I’ve had professors that have their lectures prerecorded. But please don’t quote me on that. Your prof could add a time.\n\nYou could always send a polite email asking if there will be class times.",
      "author": "Crochitting",
      "created": 1639776330,
      "upvotes": 1,
      "replies": {}
    },
    "hoyz40i": {
      "link": "/r/college/comments/rir2iu/tba_under_time_for_online_class/hoyz40i/",
      "text": "TBD/TBA at my school means it’s asynchronous. Mine still have due dates throughout the semester but there’s no class times or lectures. It requires more discipline on your part to actually read the textbook or use the materials given and learn. I like them better though. If it’s an easy course, you don’t have to waste time sitting in class",
      "author": "wafflepancake5",
      "created": 1639776848,
      "upvotes": 1,
      "replies": {}
    },
    "hoz8s5l": {
      "link": "/r/college/comments/rir2iu/tba_under_time_for_online_class/hoz8s5l/",
      "text": "Agree with everyone saying it’s probably asynchronous! I wish they’d come up with another way to tell us that but oh well I guess. You can email the prof if you’re concerned.",
      "author": "lesbyeen",
      "created": 1639780845,
      "upvotes": 1,
      "replies": {}
    }
  }
}