{
  "sid": "qor0dr",
  "link": "/r/college/comments/qor0dr/i_have_to_choose_between_two_great_colleges_and_i/",
  "title:": "I have to choose between two great colleges, and I CAN'T FRICKIN DECIDE",
  "text": "Hello everyone! I'm 18F from India. Just graduated from high school with the following subjects: Economics, Pol Sci, Maths, History, and English. Lemme give you some background about the Indian Uni system for the Humanities. You can skip the next para if you want, but reading it might give you further context to my dilemma.\n\nMost of the reputed and hence 'good' colleges are government institutes, that were established long ago. Private Universities generally tend to be an option for those who didn't get accepted into government universities. Admission to these government institutes is based purely on the aggregate percentage you've got in your final 12th-grade exam, and you have to decide before beginning uni what your major is. The norm is rote learning and traditional pen and paper exams. The professors are very similar to your average high school teacher, maybe a little better than that. There is really not much difference between the kind of education being offered at government institutes and most private universities. This was until some 6-7 years ago, a private liberal arts university was established in India. The university got some very hotshot academics to join them. The admission process is extremely holistic, and is very similar to the US, as it's based on three essays, LORs, and a panel interview. It's the first of its kind here and is slowly gaining a lot of traction. Its emergence has also led to more liberal arts institutes springing up in India.\n\nNow, I'm faced with a very difficult choice. I've gotten into the top (government) college in India for Economics (Hons), and I've also gotten into the above-mentioned liberal arts university. I'm a confused soul, so I'm not sure whether I want to do Economics or not. There is a possibility that I might end up doing it even if I go to the liberal arts college, but this could also just be my underconfident self's assumption.\n\n I'll list out the qualities of both the colleges:\n\n|GOVT COLLEGE|PVT LIBERAL ARTS COLLEGE|\n|:-|:-|\n|Old established institute, has a legacy|New, doesn't have a legacy|\n|Women's institute|Co-educational Institute|\n|Predecided major, will have to do Econ|Can decide major till the end of 3rd sem|\n|Extremely traditional pedagogy, no options to do minors/concentration in other disciplines|Can do minors/ concentration/electives in other disciplines|\n|Average Faculty|Stellar faculty|\n|Extremely selective|Not as selective|\n|3-year bachelors|4-year bachelors|\n|Very economical, INR 60,000 for the entire degree|Very expensive, INR 4,000,000 for the entire degree|\n|Academically lax|Academically rigorous|\n|Established alumni network|The Alumni network is almost nonexistent as the university is new|\n|Very limited research opportunities|Abundant research opportunities|\n|Rote learning, traditional question/answer exams|Assessment based on writing assignments, and paper submissions|\n|Better internships and jobs (at least in the corporate sector)|Job and internships opportunities are okay but not as great as the other uni|\n|Irregular classes|Very regular classes|\n|Great clubs and societies|Average clubs and societies|\n|Students are more focused on ECs|Students are more focused on academics|\n\nI've already attended 2 months of classes at the Pvt uni, and the faculty and courses really are amazing. But as soon as I got into this govt uni a couple of days ago, I've become very confused **My heart is telling me to go to the liberal arts college, but my brain is telling me to go to the govt one, What do you think is the better option?**\n\n&#x200B;",
  "author": "Cinnabonbutterfly03",
  "created": 1636299617,
  "updated": 1636655768,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjotdf7": {
      "link": "/r/college/comments/qor0dr/i_have_to_choose_between_two_great_colleges_and_i/hjotdf7/",
      "text": "This seems tough!! Have you done a tour of each to really picture yourself in the two different environments? There's definitely some pros and cons of both place, but I wanted to touch on the price. I'm not very familiar with Indian currency, how in debt is the liberal arts school going to make you? Sometimes if a school is that expensive, it's not worth putting you in debt for years when another option is available",
      "author": "ceejdrew",
      "created": 1636302042,
      "upvotes": 1,
      "replies": {
        "hjoynse": {
          "link": "/r/college/comments/qor0dr/i_have_to_choose_between_two_great_colleges_and_i/hjoynse/",
          "text": "They actually provide need based financial aid. Applied for it twice, but got rejected. Technically it’s not going to put me in any debt, because my parents have this much money in their kitty. But yeah it would make a dent in the savings, considering my brother is also pursuing an expensive education and the fact that I will definitely go abroad to study at some point.",
          "author": "Cinnabonbutterfly03",
          "created": 1636304131,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}