{
  "sid": "ptfcqy",
  "link": "/r/college/comments/ptfcqy/at_almost_24_i_am_trying_to_decide_of_i_should/",
  "title:": "At almost 24 I am trying to decide of I should drop everything and attend college and I need help",
  "text": "I am going to be 24 next month and I am working full time. I have been accepted into university for the Spring 2022 semester. 2 months ago I moved into a new job and like it here because it is very easy and quiet, unlike some other jobs I have had, and I feel like I am making decent money too. I have 30k+ across all of my investments and they are continously generating further wealth, and with my job and my low cost of living due to staying at home hours away from the university I was accepted into, I can keep putting back a decent amount of money into my investment accounts.\n\nThe problem is that life feels absolutely hollow, meaningless and I have nothing to look forward to day to day except my job and feel no real hope for the future and I am severely lonely. I feel like attending college might solve these problems but I am going to have tuition costs and living costs and buying my own groceries, utilities etc. and even 4 years of living in another city and attending classes is a serious commitment without any help. The only other option I can see is staying here and attending online classes, even at a community college and I could work on them at my job as much free time as I have but I also dont know if I should really be missing out on social events and networking as I really hope this would be a life changing thing for me, to go to college.\n\nSo I guess those would be my two options, and I was hoping for some advice on which way I should go? I know experiences will vary but maybe there are some stats on this kind of thing? I feel really bad being unable to decide all of this and put it together as I feel like as a 24 year old I should be a more sound adult and have had stuff like this figured out already.",
  "author": "Hinkanen",
  "created": 1632339809,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hdvz6c5": {
      "link": "/r/college/comments/ptfcqy/at_almost_24_i_am_trying_to_decide_of_i_should/hdvz6c5/",
      "text": "Going to college is an investment in yourself and in your future but as long as the major is worth the investment. My advice is STEM, preferably tech.\n\nIf I were you then I would take advantage of living at home and going to a community college as long as possible before transferring to a university. Make sure to pick the correct community college so that the credits will transfer to desired university later down the road. The first two years of college are all gen ed classes so no point in paying two to three times more when you can do it for a fraction of the price at a community college.\n\nI'm a non traditional student, 35 and working full time, so the whole socializing aspect does not apply to me. That's not a priority of mine, I'm in college to get my degree and the gtfo. Networking you can do when you transfer to the university since you'll start taking upper division classes and can start attending career fairs and start internships. As you move up in the program the smaller the classes get and you start noticing the same people in your classes and you could network with them on internships and classes.",
      "author": "ShadowIG",
      "created": 1632343571,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634050714
}