{
  "sid": "qrdaei",
  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/",
  "title:": "What is the best degree for people who are average but still want to make a decent living?",
  "text": "I’m considering going to college but I’d like to get a degree in something that isn’t too difficult but will lead to a decent paying career.",
  "author": "Tunakay",
  "created": 1636606515,
  "updated": 1639857427,
  "over_18": false,
  "upvotes": 170,
  "upvote_ratio": 0.97,
  "comments": {
    "hk7blzd": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7blzd/",
      "text": "This is just my advice, but I would recommend maybe going to community college for a while and thinking about possible majors. A lot of the time universities are expensive and certain degrees can be limiting if you don’t want to work inside the field",
      "author": "junocereal",
      "created": 1636639488,
      "upvotes": 136,
      "replies": {
        "hk7menu": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7menu/",
          "text": "I agree. Community colleges are an excellent place to get your feet wet in the world of academia, without spending tens of thousands of dollars. You can take various classes to see what you are interested in and if you end up deciding that you want to go to a 4 year university, then you can earn an associates, saving money and time because you now know what you want to major in. Or, you might chose to go to trade school, in which case, you would be glad that you didn’t toil away at a 4 year university only to realize that it wasn’t for you.",
          "author": "JupiterRocket",
          "created": 1636644389,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "hk665oc": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk665oc/",
      "text": "accounting",
      "author": "postmaloneismediocre",
      "created": 1636609853,
      "upvotes": 153,
      "replies": {
        "hk6hdqa": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6hdqa/",
          "text": "Read my mind.",
          "author": "LoreBloop",
          "created": 1636618093,
          "upvotes": 25,
          "replies": {}
        },
        "hk7ktu9": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7ktu9/",
          "text": "Or business, but do like a year or 2 of CC it will help prepare you for college (actually, not like high school) and figure out your major then.\n\nAlso depending on state, they can offer free community college for like income brackets.",
          "author": "ThatWhiteBoah",
          "created": 1636643698,
          "upvotes": 17,
          "replies": {
            "hk81kxv": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk81kxv/",
              "text": "community college is college",
              "author": "kapbear",
              "created": 1636650620,
              "upvotes": 1,
              "replies": {
                "hk8anl7": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8anl7/",
                  "text": "I mean college in sense of 4 year school. Where most community colleges have 101s-200-some 300s but 4 year schools have 300s and 400s which are usually a lot more difficult.\n\nCommunity college better prepares students for a 4 year school where there is more responsibility, CCs are good transitional period. Because hs is a cake walk compared to 4 year schools, hs doesn’t prepare students for college level courses.",
                  "author": "ThatWhiteBoah",
                  "created": 1636654170,
                  "upvotes": 1,
                  "replies": {
                    "hk9c3vh": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9c3vh/",
                      "text": "i’m doing my entire bachelor’s degree at a community college in washington state. it’s a thing.",
                      "author": "eilig",
                      "created": 1636669540,
                      "upvotes": 1,
                      "replies": {
                        "hk9kstf": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9kstf/",
                          "text": "It’s offered in less than half of the states in the US (23 out of 50) but it does happen. I do not live in one of those states, so I cannot speak to the experience or marketability, but depending on where OP lives that could be an option",
                          "author": "AimlessFucker",
                          "created": 1636673420,
                          "upvotes": 3,
                          "replies": {
                            "hk9kxoc": {
                              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9kxoc/",
                              "text": "it’s nice, too. my management program is very focused on job placement after graduation and supports us with networking/resumes etc. I highly recommend a program like that to anyone.",
                              "author": "eilig",
                              "created": 1636673487,
                              "upvotes": 2,
                              "replies": {
                                "hk9l4ps": {
                                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9l4ps/",
                                  "text": "I found that with my smaller university. A much smaller school, with a fantastically proactive advisor, has led me to be able to talk more with my professors and build those connections.",
                                  "author": "AimlessFucker",
                                  "created": 1636673583,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hkabroe": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkabroe/",
              "text": "experiences may vary, but my high school prepared me very well for college.",
              "author": "postmaloneismediocre",
              "created": 1636686247,
              "upvotes": 1,
              "replies": {}
            },
            "hk9klm3": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9klm3/",
              "text": "I’d advise against business as a whole (while there are some gems in the business-realm, it’s riddled with a multitude of underpaying jobs, and the market is over saturated), particularly business marketing or general business, as they are the most popular degree and also have high unemployment rates. The job fields that typically open up to them don’t typically require a bachelors degree and equate to lower salary overall. Business is an easy degree that doesn’t require much studying or dedication, and the students on average spend less time studying, writing, or reading. This is further backed up when business majors score the lowest of all majors on the GMAT exam for MBA programs. \nIf you want a well paying job, your best shot is taking up a STEM degree field (according to Georgetown University’s Center on Education and the Workforce, 23 out of 25 of the best paying degrees are in STEM fields). The only two that aren’t are business economics and economics. If you’re dead set on a business degree, accounting and economics are the top 2 I’d go for. It’s math intensive but it will payout in the long run when you’re employed and making more than the average generic business degree holder. All cases considered, if you don’t know what you want to do, do not rush into a public university. The community college route can be hit or miss, as I know plenty of people who did not have a good experience with it, but who are pleased having gone through it with all the money they saved. It’s a good intermediate phase to attempt to figure out what you’d like to do before committing to a school that’s more expensive and brings more debt.",
              "author": "AimlessFucker",
              "created": 1636673320,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "hk85ew5": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk85ew5/",
          "text": "Accounting is harder than “I just need a major”",
          "author": "uglybutterfly025",
          "created": 1636652135,
          "upvotes": 1,
          "replies": {
            "hkabxc6": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkabxc6/",
              "text": "Never said it wasn't. But most people who are around average could get an accounting degree without too many headaches if they put in the work. A major like engineering is going to be much more stressful/difficult if you are not already good at math and physics.",
              "author": "postmaloneismediocre",
              "created": 1636686321,
              "upvotes": 4,
              "replies": {}
            },
            "hkhbj3j": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkhbj3j/",
              "text": "Not as difficult as many stem degrees. But still challenging.",
              "author": "LoreBloop",
              "created": 1636826067,
              "upvotes": 2,
              "replies": {}
            },
            "hk8f6mp": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8f6mp/",
              "text": "Borderline",
              "author": "atreality",
              "created": 1636655979,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hk7eb1w": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7eb1w/",
          "text": "No, MIS",
          "author": "Atraidis",
          "created": 1636640760,
          "upvotes": 9,
          "replies": {
            "hk7jve8": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7jve8/",
              "text": "Either or is fine. Depends on what interests you.",
              "author": "pintossbm123",
              "created": 1636643274,
              "upvotes": 3,
              "replies": {}
            },
            "hk883mh": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk883mh/",
              "text": "Are you in the field already or studying?",
              "author": "Hunonedred",
              "created": 1636653171,
              "upvotes": 1,
              "replies": {
                "hk88flc": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk88flc/",
                  "text": "in the field",
                  "author": "Atraidis",
                  "created": 1636653300,
                  "upvotes": 1,
                  "replies": {
                    "hk89t1j": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk89t1j/",
                      "text": "Systems analyst? I’m fairly far from graduation, but my intention is to get internships both junior and senior years. I’d like to start as a junior systems analyst and hopefully work for a consulting company within 5 years. Good plan you think?",
                      "author": "Hunonedred",
                      "created": 1636653834,
                      "upvotes": 1,
                      "replies": {
                        "hk8bni2": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8bni2/",
                          "text": "Funny, my first FT job was as a junior systems analyst. Good plan but shoot higher. 5 years is too long to get into consulting. Do research on what they are hiring for, get certified, work on a few side projects building stuff, post to LinkedIn, update LinkedIn and resume, go for FT consulting jobs straight out of college. \n\nI'm very involved with the tech org of my alma mater and there was a few years around 2017\\~ where Power BI was so hot, I told students \"Get this cert, build two dashboards, post to your LinkedIn and I will get you a job.\" Only a few people took me up on it.\n\nThere's always a need for good entry/junior level data analysts. If what you are looking for is interesting work and great career opportunities, definitely start building your analytics skills and brand. Even 2-4 weeks worth of solid study for each of SQL, Python, Power BI, and Excel (just cause so many teams are entrenched and there's a lack of competent Excel power users also) will make you extremely marketable. Since you are in your first few years at college you have plenty of time. If software engineering is more your thing over analytics, that's a great career path too. I went with analytics and have had a great career so far ($61k > $240k annual comp in 4 years), but if I could redo I might go into SWE instead.\n\nA few consulting companies off the top of my head that I know hire college students for tech/analytics roles: Pariveda, West Monroe, Avanade, Capgemini, Sogeti, Accenture (might be hard if you don't go to a target school), Slalom. There's a ton of them out there to be honest, and if you can only get a job at a small and not well known or well regarded body shop (lower tier consulting work), that's fine too. Get a year under your belt while continuing to develop your skills and you can jump to a better company. I've exited to a tech company, but what I love most about tech consulting is that technical skills will carry you really hard even if your interpersonal skills are not the best.",
                          "author": "Atraidis",
                          "created": 1636654571,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hk6wkcn": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6wkcn/",
          "text": "still have to study and pass CPA",
          "author": "Capn_Charge",
          "created": 1636630791,
          "upvotes": 16,
          "replies": {
            "hk7dn93": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7dn93/",
              "text": "Don’t have to but it helps",
              "author": "kryppla",
              "created": 1636640457,
              "upvotes": 22,
              "replies": {}
            },
            "hk7fr9r": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7fr9r/",
              "text": "CPA isn't necessary.  But how hard is it anyways?",
              "author": "DanHassler0",
              "created": 1636641430,
              "upvotes": 16,
              "replies": {
                "hk85dpe": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk85dpe/",
                  "text": "Only 30% of people who take the tests pass",
                  "author": "uglybutterfly025",
                  "created": 1636652122,
                  "upvotes": 1,
                  "replies": {
                    "hk8i1bn": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8i1bn/",
                      "text": "If you take it multiple times and study hard then those odds honestly aren’t bad",
                      "author": "Jaxsoy",
                      "created": 1636657120,
                      "upvotes": 6,
                      "replies": {
                        "hkc4rdg": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkc4rdg/",
                          "text": "there are multiple tests though",
                          "author": "uglybutterfly025",
                          "created": 1636727976,
                          "upvotes": 1,
                          "replies": {
                            "hkd3qfa": {
                              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkd3qfa/",
                              "text": "Each test individually has over a 50% pass rate besides the FAR which is 48%",
                              "author": "Jaxsoy",
                              "created": 1636742387,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hk85wy3": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk85wy3/",
                  "text": "Lower pass rates than the BAR exam so take that as you will",
                  "author": "Andy807",
                  "created": 1636652334,
                  "upvotes": 1,
                  "replies": {}
                },
                "hkc6b0n": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkc6b0n/",
                  "text": "CPA is the only way to move up in the ranks in accounting",
                  "author": "Katiehart2019",
                  "created": 1636728663,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk94ee4": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk94ee4/",
          "text": "accounting will kick your butt, but youll get a job before you graduate unless you somehow failed out",
          "author": "Katiehart2019",
          "created": 1636666298,
          "upvotes": 4,
          "replies": {
            "hkac4k8": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkac4k8/",
              "text": "yeah. Not saying it's an easy major, but I'm confident the average person could do fine in an accounting major if they put in the work. An engineering degree is going to be very rough for someone who isn't good at math or physics.",
              "author": "postmaloneismediocre",
              "created": 1636686414,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hk90cyr": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk90cyr/",
          "text": "Thats exactly what I'm going for. Growing up I always struggled trying to figure out what I want to do as a career. I ended up just saying fuck it, I'm good at math let's go with accounting. Wish I had gone a lot sooner.",
          "author": "PurpletoasterIII",
          "created": 1636664642,
          "upvotes": 4,
          "replies": {}
        },
        "hk8oexh": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8oexh/",
          "text": "First thing that came to my mind",
          "author": "115machine",
          "created": 1636659725,
          "upvotes": 1,
          "replies": {}
        },
        "hkaj1pw": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkaj1pw/",
          "text": "Basically what I did. Didn't know what to take for an undergrad and just took accounting due to practical purposes and knowing social sciences don't pay well and I suck in STEM related subs. It's okay I guess if you're willing to learn.",
          "author": "6869mouthwash",
          "created": 1636689704,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk61jjn": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk61jjn/",
      "text": "Don't go to college (in the US) until you know WHY you are attending college.  \n\nIt's just too expensive to enroll & attend unless it's part of a reasonably solid career-plan.",
      "author": "VA_Network_Nerd",
      "created": 1636607128,
      "upvotes": 201,
      "replies": {
        "hk6ylwp": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6ylwp/",
          "text": "Just attend community college, it's such a solid choice",
          "author": "jsimercer",
          "created": 1636632249,
          "upvotes": 56,
          "replies": {
            "hk7ky5w": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7ky5w/",
              "text": "My biggest regret in college more than any choice of major is that I left community college after one year cause I thought I was too good for it.",
              "author": "No_Vegetable1055",
              "created": 1636643751,
              "upvotes": 23,
              "replies": {
                "hk7nznz": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7nznz/",
                  "text": "I feel like there is a lot of stigma with it and it sucks because its great, depending on where you live. Some probably deserve the hesitation but my experience was excellent. It's def not for everyone either but yeah it's a great option most times.",
                  "author": "jsimercer",
                  "created": 1636645079,
                  "upvotes": 11,
                  "replies": {}
                },
                "hk7sfd8": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7sfd8/",
                  "text": "bruh that was the white middle class conundrum that kind of fucked me over right there. I grew up in a household that was very anti \"blue collar\" anti service work, my parents basically stigmatized the trades until me and my brother got the impression that they were dirty. my dad also had huge beef with the corporate ladder, so IDK what exactly he was expecting us to do with our lives but anyway... off we went for our (thankfully paid for - others weren't so lucky) liberal arts degrees, which in my fourth year I realized I wanted to work in tourism and not be stuck in a library all day, and my brother impregnated his girlfriend (lol whoops). now he manages a car dealership and I'm just a tumbleweed stringing random hospitality jobs together and living in some cool places/seeing some cool stuff. it burns me to see all these tradeys making so much money who probably in high school were considered \"not good enough to go to uni\" with the rest of the thousands of kids they pushed into university level courses. when I realized that the admission average at my university was like a 60 (C) and that my first year courses were 100s of people, I knew I had maybe kind of fucked up.",
                  "author": "Klutzy-Classroom6756",
                  "created": 1636646974,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk63l9m": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk63l9m/",
          "text": "This. Colleges milk money from kids who shouldn’t really be there because they help sell everyone on the societal norm that college is essential for a successful life, a lynchpin in the maturation process, or just the mandatory “next step” in growing up. Some of those kids wind up spending extra year(s) plural just failing courses, getting bad grades, pissing away money. You don’t want to be a 23 year old fifth-year junior. Seen plenty of those. \n\nI transferred twice and took a term off partially because I had no idea what I was hoping to do. Somehow that worked out for me, I only have to do one extra quarter and it is solely for an internship requirement. It likely won’t work out that well for most.",
          "author": "Helllo_Man",
          "created": 1636608328,
          "upvotes": 55,
          "replies": {}
        },
        "hk7ts05": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7ts05/",
          "text": "I don't necessarily agree with this as long as you are not going into debt by attending college. I haven't known why I'm attending college for almost 4 years now, but it has led me down the path to a good job with a great network around me. I didn't know my major or what I wanted to do for it for a long time. I think as long as you work hard and make connections, it's definitely worth it even if you don't know the why beforehand",
          "author": "blarsh24",
          "created": 1636647530,
          "upvotes": 1,
          "replies": {}
        },
        "hk8nt6w": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8nt6w/",
          "text": "I agree that you should have a good sense of why you are attending college. It is an expensive decision and also a motivating one, too. \n\nHowever, on the other hand, many recent college grads don’t really go into the field that they majored in. There’s nothing wrong with that at all, because a degree allows you to have opportunities that you may not previously have had, even if they are not 100% related to your degree. So knowing you want a degree because you want certain kinds of opportunities (rather than just a highly specific career path) is just as important too. I’d suggest looking into jobs that require a degree versus ones that don’t (rather than a very specific type of degree), to help you evaluate whether college is the direction you want to go.",
          "author": "pumpkinator21",
          "created": 1636659478,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk7anil": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7anil/",
      "text": "Lots of people have made good points and I think I would add my classic.\n\n1. Almost any degree with get you more job options doesn’t matter how well you do in it. Study Geography, it’ll help you get a job in HR. Study biology and you’ll be more likely to a job as a project manager. The Strategy of Warfare will help you get a job in a kindergarten. \n\n2. Science/math degrees open a few more doors than and art degree. Humanities are in the middle.\n\n3. Think of a degree as skill training not job training. You learn skills like researching, writing, presenting ideas. These are useful skills in multiple jobs and in life in general.\n\nPeople seem a bit negative about college education, it seems. But my degree has given me a life-long curiosity and the skills to do several jobs, even though I’ve never used the ideas that were taught.",
      "author": "Mattos_12",
      "created": 1636639022,
      "upvotes": 20,
      "replies": {
        "hk8bvaf": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8bvaf/",
          "text": "Can I asked what you majored in, and what you're doing now?",
          "author": "soccerblonde1414",
          "created": 1636654656,
          "upvotes": 1,
          "replies": {
            "hk8r09q": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8r09q/",
              "text": "Sure, I have a BA in politics and economics with an MA in international relations and I currently teach English, math and science in Taiwan.",
              "author": "Mattos_12",
              "created": 1636660791,
              "upvotes": 21,
              "replies": {
                "hoac98k": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hoac98k/",
                  "text": "Teaching in Taiwan…. I’m a little jealous.",
                  "author": "Numerous-Activity-35",
                  "created": 1639338876,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk9201b": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9201b/",
          "text": "The thought of military vets teaching kindergarten somehow cracks me up",
          "author": "psaiko_dro",
          "created": 1636665305,
          "upvotes": 3,
          "replies": {
            "hk927br": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk927br/",
              "text": "My friend was in navy intelligence and now works teaching 2-3 year olds. There’s lots of choices in life :-)",
              "author": "Mattos_12",
              "created": 1636665388,
              "upvotes": 7,
              "replies": {
                "hk9t6zx": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9t6zx/",
                  "text": "That is so awesome!",
                  "author": "psaiko_dro",
                  "created": 1636677610,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk60ul1": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk60ul1/",
      "text": "I honestly think trade school is better for this.",
      "author": "OneUniqueUnicorn",
      "created": 1636606737,
      "upvotes": 81,
      "replies": {
        "hk612wd": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk612wd/",
          "text": "Why? Most people going to college aren’t geniuses.",
          "author": "Tunakay",
          "created": 1636606869,
          "upvotes": -75,
          "replies": {
            "hk61o9f": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk61o9f/",
              "text": "It wasnt a comment about intelligence,  but practicality. \n\nCollege degrees are expensive (I'm assuming you're in the US) and the payoff isnt generally what people think. Most industries will require at least a 4 year degree. At $30k a year (roughly the cost of a 4 year in state school), thats $120k.\n\nTrade schools are cheaper and skip gen ed requirements so your saving time and money. They aren't glamorous, but a lot of trades pay decent wages. \n\nIf your set on college, maybe take a look at a community college. They sometimes offer certificate programs that function a bit like a trade but with more gen ed requirements.",
              "author": "OneUniqueUnicorn",
              "created": 1636607201,
              "upvotes": 73,
              "replies": {
                "hk62gon": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk62gon/",
                  "text": "It’s under $7k a year where I am. CC is under $5k. This is before financial aid/scholarships.",
                  "author": "No-Heart-5871",
                  "created": 1636607662,
                  "upvotes": 17,
                  "replies": {
                    "hk62pob": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk62pob/",
                      "text": "Jesus, where are you from?\n\nCC was about $10k/yr for me (took me 5 years) and uni is $31k/yr (hopefully 2 years).",
                      "author": "OneUniqueUnicorn",
                      "created": 1636607810,
                      "upvotes": 3,
                      "replies": {
                        "hk62rdl": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk62rdl/",
                          "text": "NYC. I go to one of the CUNYs.",
                          "author": "No-Heart-5871",
                          "created": 1636607838,
                          "upvotes": 10,
                          "replies": {
                            "hk630dy": {
                              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk630dy/",
                              "text": "I don't even know what to say.",
                              "author": "OneUniqueUnicorn",
                              "created": 1636607986,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "hk6yq6k": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6yq6k/",
                          "text": "I’m in oklahoma and community college for me is about $4,000 a year too. My husband went to trade school and his tuition was more like $30,000 thankfully paid for by the VA.",
                          "author": "wovenriddles",
                          "created": 1636632334,
                          "upvotes": 3,
                          "replies": {
                            "hk7036x": {
                              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7036x/",
                              "text": "Your husband paid for trade school in Oklahoma? In NYC my union paid for college and trade school",
                              "author": "Jax_Teller2-0",
                              "created": 1636633235,
                              "upvotes": 2,
                              "replies": {
                                "hk7628h": {
                                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7628h/",
                                  "text": "The VA paid for it.",
                                  "author": "wovenriddles",
                                  "created": 1636636724,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "hk7gbxg": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7gbxg/",
                          "text": "That's just crazy! CC is about $1,200/year and University is about $13,000/year, and that's without any financial aid. With financial aid I pay $0/year",
                          "author": "jensonaj",
                          "created": 1636641688,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "hk7inj8": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7inj8/",
                          "text": "I went to a big state university in Georgia, but the state will cover your tuition if you made good grades in high school and keep them up in college, so all I had to cover was living expenses. Ofc, not all states have programs like that.",
                          "author": "Nihil_esque",
                          "created": 1636642732,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "hk8bl26": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8bl26/",
                          "text": "Wow, CC isn’t that bad in the Midwest, either. Living in dorms at uni is ~$30k/year, about $10-12k/year without. Community college was $5k/year max for people I knew.",
                          "author": "tarantulasauce",
                          "created": 1636654544,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hk620mh": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk620mh/",
                  "text": "Did you go to trade school?",
                  "author": "Tunakay",
                  "created": 1636607401,
                  "upvotes": 2,
                  "replies": {}
                },
                "hk61yzi": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk61yzi/",
                  "text": "I actually want to go to college. I don’t think I’m cut out for trades. I also want a career that pays pretty well. I don’t mind starting out at a CC but I would like to transfer to a 4 year university. I do think I’m capable of doing more than just getting a certificate at a CC.",
                  "author": "Tunakay",
                  "created": 1636607375,
                  "upvotes": 5,
                  "replies": {
                    "hk641iq": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk641iq/",
                      "text": "You might consider business or marketing. I know it’s a cliche “easy” track, but it sets you up well for a potential future MBA (one of the few graduate degrees which actually pencil out), or some sort of consulting work…generally business degrees from even an average program can open a lot of doors and are applicable in a broad array of fields.",
                      "author": "Helllo_Man",
                      "created": 1636608594,
                      "upvotes": 7,
                      "replies": {}
                    },
                    "hk624hj": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk624hj/",
                      "text": "Sounds like you know what you want - so go for it! \n\nI started 6 years ago at CC and attend a state school now. Its been really hard but worth it. Chase your dreams, yo.",
                      "author": "OneUniqueUnicorn",
                      "created": 1636607464,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hk6ag7k": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6ag7k/",
              "text": "This is a shitty take. People who go to trade schools are JUST as smart as people who attend a normal 4-year university.",
              "author": "creamy-comrade",
              "created": 1636612718,
              "upvotes": 33,
              "replies": {}
            }
          }
        }
      }
    },
    "hk6z3gk": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6z3gk/",
      "text": "This may be obvious but think about what truly interests you and make sure to weigh that into the equation pretty highly. Even if a subject is easy, if your not interested in it it’s going to be a complete drag and be way harder than expected. Because I love chemistry, my ochem classes and any material classes that other students hated and said were “so hard” were the easiest for me because I wanted to work on the hw/study because it interested me. \n\nIt makes a big difference when your in upper level classes. Good luck!",
      "author": "pfft_jackee",
      "created": 1636632583,
      "upvotes": 14,
      "replies": {}
    },
    "hk6ddjr": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6ddjr/",
      "text": "Business major is pretty easy according to my friends. You can work your way into a job through internships and club activities! And you have time to get job experience too if you never worked before.\n\nAnything related to business is useful like marketing, management, entrepreneurship, accounting, etc.\n\nYou could definitrly afford college unlike these other commenters are saying. The fact that you wanna go to college to get a decent paying job is good! Like aren’t we all in college to get a decent paying job…? Anyways, There’s community college and transfer route or going to a state school that offers tons of financial aid for in state students.\n\nOf course you might have to take out loans depending on your financial background but if you work hard in college to obtain experience, you can get a job right after college to pay off the loans",
      "author": "SooshiMoon",
      "created": 1636614891,
      "upvotes": 28,
      "replies": {}
    },
    "hk7n33y": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7n33y/",
      "text": "Healthcare, two year associates degree or optional bachelors in radio technology can net you a really good living right out the door. My mother is a radio technologist and makes around 38-45 dollars an hour working per diem.",
      "author": "citrusmayhem2",
      "created": 1636644690,
      "upvotes": 9,
      "replies": {}
    },
    "hk7uujy": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7uujy/",
      "text": "Look into respiratory therapy!! It's in the medical field. It doesn't take long and you make loads of money especially now during the pandemic.  And pre reqs you have ti take aren't that bad of difficult.  Look into it",
      "author": "Harajuku_Aj",
      "created": 1636647960,
      "upvotes": 1,
      "replies": {}
    },
    "hk6794m": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6794m/",
      "text": "Trade school. Make good money, learn a skill and pay your own way through school once you figure out what you want to major in.",
      "author": "MaTtSaWZrD",
      "created": 1636610543,
      "upvotes": 30,
      "replies": {
        "hk68bzz": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk68bzz/",
          "text": "I have no interest in doing a trade.",
          "author": "Tunakay",
          "created": 1636611243,
          "upvotes": 14,
          "replies": {
            "hk7stxj": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7stxj/",
              "text": "trades can be anything though. I think a lot of people see trades as plumber, electrician, carpenter, and those are all great, but like... massage therapy is a trade. aesthetician is a trade. graphic design/visual arts is a trade. there's lots of things that qualify as trades that don't have you up to your elbows in sewage or motor oil!",
              "author": "Klutzy-Classroom6756",
              "created": 1636647145,
              "upvotes": 4,
              "replies": {}
            },
            "hk7dtxf": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7dtxf/",
              "text": "Exactly. People on Reddit are so obsessed with the trades. Don't listen to them. Just do accounting, computer science, or engineering if you want to make money",
              "author": "Critical-Paper",
              "created": 1636640541,
              "upvotes": 16,
              "replies": {
                "hk7f9yy": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7f9yy/",
                  "text": "What's your opinion about psychology?",
                  "author": "dragon_trainer200",
                  "created": 1636641212,
                  "upvotes": 0,
                  "replies": {
                    "hk7fmzd": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7fmzd/",
                      "text": "psychology can be useful for HR manager roles or UX designer/researcher but it's strongly recommended that you go to graduate school if you have a psychology degree",
                      "author": "Critical-Paper",
                      "created": 1636641379,
                      "upvotes": 7,
                      "replies": {
                        "hk82lpu": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk82lpu/",
                          "text": "What abut physical therapy assistant major",
                          "author": "Forever_ForLove",
                          "created": 1636651030,
                          "upvotes": 1,
                          "replies": {
                            "hk84sr1": {
                              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk84sr1/",
                              "text": "that's an okay major but depends on where you are living. You might make $40-$60k a year.",
                              "author": "Critical-Paper",
                              "created": 1636651893,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hk8ebry": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8ebry/",
                  "text": "Computer science and engineering are your ideas of \"something that isn’t too difficult but will lead to a decent paying career\"?",
                  "author": "coldblade2000",
                  "created": 1636655636,
                  "upvotes": 12,
                  "replies": {
                    "hk8fxgv": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8fxgv/",
                      "text": "Well there's different things that you can do within STEM. Some things are tough a bit but you can do lots of things with a CS degree or some management as engineering. It's possible to still get the degree because it takes just hard work and effort most of the time honestly. OP can also try accounting",
                      "author": "Critical-Paper",
                      "created": 1636656277,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "hk8xf1j": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8xf1j/",
                  "text": "Computer science and engineering are very hard degrees and eat tons of time. He said something that is not difficult so accounting, information systems, or some type of IT.",
                  "author": "HowlSpice",
                  "created": 1636663430,
                  "upvotes": 5,
                  "replies": {
                    "hk8xm5j": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8xm5j/",
                      "text": "there's finance or supply chain management",
                      "author": "Critical-Paper",
                      "created": 1636663512,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hk7gt54": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7gt54/",
              "text": "Well considering you’re average, you might have to change your mind",
              "author": "diamondsam2",
              "created": 1636641905,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk7c5xy": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7c5xy/",
      "text": "All I'm really getting from this is that OP thinks trade school is below them and wants to go to a 4 year to party.",
      "author": "hugcartel",
      "created": 1636639749,
      "upvotes": 21,
      "replies": {
        "hk7wjl0": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7wjl0/",
          "text": "Lol not everyone is cut out for trades just like not everyone is cut out for college. or are you saying the work tradesmen/women do is easy peasy low effort work? Reddit acts like trades work is just the easiest thing ever and always the better choice out of high school. Going to college or trade school without having an idea of what you want is gonna end bad either way you take it.",
          "author": "Featherfy",
          "created": 1636648630,
          "upvotes": 1,
          "replies": {
            "hk7xfj9": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7xfj9/",
              "text": "Quite the opposite. I think trades involve a high level of professionalism, skill, and hard work. It appears that OP thinks they are above it for some reason, though--a diff comment OP made on this post implied trades work didn't require intelligence.",
              "author": "hugcartel",
              "created": 1636648977,
              "upvotes": 1,
              "replies": {
                "hk7xuuw": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7xuuw/",
                  "text": "Great. He also said he'd rather go to CC and then college.   Then I guess he's not cut out for the trades. Your think anyone wants to work with someone who acts like that? \n\nHe's already made his decision on college.",
                  "author": "Featherfy",
                  "created": 1636649146,
                  "upvotes": 1,
                  "replies": {
                    "hk7ziy4": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7ziy4/",
                      "text": "Tbh I wouldn't want to attend class with someone only there because they think what we're studying is the 'easiest' option either, that goes for both trades and business / education / whatever else major is decided on. Those types of students kind of drag the entire program and whatever class they're in down because there's typically no engagement, so idk if they're really an ideal fit for either path. That's just my 2 cents though.",
                      "author": "hugcartel",
                      "created": 1636649799,
                      "upvotes": 1,
                      "replies": {
                        "hk8btbs": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8btbs/",
                          "text": "They don't drag it down. The work you put in is what you get out. They only injure themselves. A low effort tradesman who does shitty work puts a bad name to the whole trade. I think a lot of people have a lot of negative things to say about shitty roofers, plumbers, electricians who've half assed their work and caused thousands more in damages or try to sell something that isn't needed. \n\nThere are a LOT of very experienced, skilled and talented people who work in the trades and a lot of very inexperienced people (who also may get in it for the money and easily cheat unknowledgeable customers), and I think there's more inexperienced than experienced which maybe gives a negative idea in people's heads that \"trades are for the dumb\". You actually need to understand a lot of math/physics/science behind what you're doing to do it right... but honestly idk what or how that is taught to apprentices.",
                          "author": "Featherfy",
                          "created": 1636654635,
                          "upvotes": 1,
                          "replies": {
                            "hk8gx1n": {
                              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8gx1n/",
                              "text": "I'm speaking from experience when I say students that aren't actually interested in the topic bring the class down. Usually it results in slower lectures, but in smaller classes which require group work and discussion, it can interfere with the material actually being taught. Aside from that I think we agree on everything.",
                              "author": "hugcartel",
                              "created": 1636656669,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hkc6h9y": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkc6h9y/",
              "text": "What is with the trade school circle jerk? lol",
              "author": "Katiehart2019",
              "created": 1636728738,
              "upvotes": 1,
              "replies": {
                "hkcc8bt": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkcc8bt/",
                  "text": "Nothing. I'm pandering to thin skinned redditors",
                  "author": "Featherfy",
                  "created": 1636731205,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk8c5gx": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8c5gx/",
          "text": "Maybe he just doesn’t have an interest in any trades",
          "author": "tarantulasauce",
          "created": 1636654770,
          "upvotes": 3,
          "replies": {
            "hk8haoq": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8haoq/",
              "text": "> \"...a diff comment OP made on this post implied trades work didn't require intelligence.\"\n\nBut yeah maybe that too",
              "author": "hugcartel",
              "created": 1636656821,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hkc6ipu": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkc6ipu/",
          "text": "Bruh where did you get that impression?",
          "author": "Katiehart2019",
          "created": 1636728755,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk7tbuw": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7tbuw/",
      "text": "Not easy but nursing. Most hospital nurses around here start around $25 an hour. It goes up quick. Plus they get unlimited OT and bonuses on top of that.",
      "author": "KamadoJonathan",
      "created": 1636647351,
      "upvotes": 3,
      "replies": {
        "hk8capj": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8capj/",
          "text": "TIL I learned I make as much as a nurse as a server. But job security must be nice",
          "author": "tarantulasauce",
          "created": 1636654828,
          "upvotes": 2,
          "replies": {
            "hk8o3ei": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8o3ei/",
              "text": "and yes the job security. I know a lot of servers who suffered last year when restaurants were forced to shut down. I even knew nurses who were laid off. However, nursing is the one career I can think of where you can close your eyes, throw a dart at the map of the US and move to wherever it lands and find a job.\n\nMight not be a great job. But a job regardless.",
              "author": "KamadoJonathan",
              "created": 1636659594,
              "upvotes": 4,
              "replies": {}
            },
            "hk8m0vr": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8m0vr/",
              "text": "That's starting out. Hospitals are giving big bonuses to their staff. One hospital gave an $800 bonus on top of overtime pay for the shift.\n\nAlso, servers work terrible hours. When I was a server/cook, I hated it. I was there every Friday and Saturday night, then back again at 8 am the next day",
              "author": "KamadoJonathan",
              "created": 1636658740,
              "upvotes": 1,
              "replies": {
                "hkd0dtj": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkd0dtj/",
                  "text": "Haha, servers work great hours compared to nurses! I have six-hour shifts either 10-4 or 4-10. It depends on the restaurant and how much prep work you have, but overall servers and even bartenders have much better schedules. Fast food, not so much :(\n\nI’m glad they’re paying nurses more, though. That’s good. You guys do really important work.",
                  "author": "tarantulasauce",
                  "created": 1636740990,
                  "upvotes": 1,
                  "replies": {
                    "hkof2ef": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkof2ef/",
                      "text": "I was at cheesecake factory. Hours were terrible for me. Sure you can make good money but it's not guaranteed. I'd rather work my 3x 12 hour shifts and be home when my kids are still awake (if I had them)  as opposed home at 2 am.",
                      "author": "KamadoJonathan",
                      "created": 1636947697,
                      "upvotes": 2,
                      "replies": {
                        "hkv5sdv": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkv5sdv/",
                          "text": "Yeah, like I said, it really depends on the restaurant and local area. I work in a Korean sushi bar which is pretty trendy right now, so it’s never famine or feast. I make a pretty steady income of 2400/month if I work at least 5 shifts a week. \n\nAt other restaurants, business is strongly seasonal and you can end up having to follow business, wherever that may be. One of my coworkers is a highly experienced bartender but he does serving here year-round because the business is so steady. He tells me when he worked other restaurants, he used to drive an hour and a half every day to bartend at this lake resort every summer. I’m lucky to have such a steady income in my line of work.",
                          "author": "tarantulasauce",
                          "created": 1637077877,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk813s2": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk813s2/",
      "text": "Anything business related. A lot of those people are mid sl getting high gpas and ending up with good jobs",
      "author": "Nicofatpad",
      "created": 1636650428,
      "upvotes": 1,
      "replies": {}
    },
    "hk7ea6r": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7ea6r/",
      "text": "MIS",
      "author": "Atraidis",
      "created": 1636640749,
      "upvotes": 2,
      "replies": {}
    },
    "hk7fgyy": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7fgyy/",
      "text": "IT",
      "author": "mans123373u2",
      "created": 1636641303,
      "upvotes": 2,
      "replies": {}
    },
    "hk7mi4k": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7mi4k/",
      "text": "Trade school",
      "author": "ampjk",
      "created": 1636644433,
      "upvotes": 2,
      "replies": {}
    },
    "hk7msmq": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7msmq/",
      "text": "There is no easy way around hard word and discipline. If not attending an institution for education, then self study! something like mathematics, and learn a coding language or few , then pursue a career in tech!",
      "author": "Vast-Focus-511",
      "created": 1636644562,
      "upvotes": 2,
      "replies": {}
    },
    "hk7v60e": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7v60e/",
      "text": "Go work entry level positions in the fields your interested in to get a birds eye view.",
      "author": "Atx0305",
      "created": 1636648089,
      "upvotes": 1,
      "replies": {}
    },
    "hk6ohsg": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6ohsg/",
      "text": "I recommend you work for now and research the fields that appeal to you the most and the hard skills that go with them, even if they sound difficult. You don’t have to be a genius to pass even the hardest classes, just a hard worker. If you study until you understand the concepts and purpose of each lesson diligently, you will most likely pass.\n\nDo what sounds the most enjoyable or bearable. Don’t pick a general course like business just because you don’t know what you want to, and most definitely don’t pick a course without knowing what career pathway you are going to follow. So many people pick psychology because they find it interesting, but have no idea what jobs they’re opened up to past being a psychologist. Have a plan of where you want to end up career wise before even thinking of college enrolment.",
      "author": "Lkj509",
      "created": 1636624261,
      "upvotes": 3,
      "replies": {}
    },
    "hk6ohtu": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6ohtu/",
      "text": "HR, accounting, teacher",
      "author": "gma2098",
      "created": 1636624262,
      "upvotes": 4,
      "replies": {
        "hk7ec5g": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7ec5g/",
          "text": "depends on what type of teacher. elem is easy but i switched to high school math and it’s kicking my ass. and ive always done good at and love math. makes me wanna switch back to elem sometimes lol",
          "author": "wildcatyorkie",
          "created": 1636640774,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hk6zrp9": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6zrp9/",
      "text": "Schools won't tell you this but you don't actually need college to have a decent living.\n\n You can make good money with trade jobs and some even pay you to go to college for free after getting hired.",
      "author": "Jax_Teller2-0",
      "created": 1636633031,
      "upvotes": 2,
      "replies": {}
    },
    "hk6297r": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6297r/",
      "text": "Psychology, in many cases you only need a MS to be a licensed therapist. $100-$200/hr\n\nPhilosophy, can set you up well for law school if you decide that in the future, yes you can get a job with this degree\n\nFinance, if you can handle the wee bit of financial math, think stocks\n\nBusiness, because you want to be Senior VP at a company",
      "author": "Optimus_Prime83",
      "created": 1636607542,
      "upvotes": -8,
      "replies": {
        "hk62ipf": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk62ipf/",
          "text": "I’ve been thinking about business because it seems to have the best pay and it’s an easier degree.",
          "author": "Tunakay",
          "created": 1636607695,
          "upvotes": -3,
          "replies": {
            "hk68yv6": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk68yv6/",
              "text": "Business isn’t an easy degree but ok 🙃",
              "author": "caligirlthrowaway104",
              "created": 1636611676,
              "upvotes": 14,
              "replies": {
                "hk6aw41": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6aw41/",
                  "text": "People who like STEM will think business is easy. It speaks volumes when they take a business class and fail due to arrogance. College is understanding that each degree uses different skills and different sets of knowledge. \n\nI get this all the time as a gender studies major lol.",
                  "author": "creamy-comrade",
                  "created": 1636613038,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            },
            "hk67rtz": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk67rtz/",
              "text": "Business is not an easy degree, just FYI. As far as majors go that aren’t related to STEM fields, business is pretty much as hard as it gets",
              "author": "LawfulnessFancy5450",
              "created": 1636610869,
              "upvotes": 6,
              "replies": {
                "hk68ury": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk68ury/",
                  "text": "I’m not saying it’s a dummy degree but it’s not difficult like CS, engineering, math degrees.",
                  "author": "Tunakay",
                  "created": 1636611598,
                  "upvotes": -1,
                  "replies": {
                    "hk6anu9": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6anu9/",
                      "text": "It literally is just as difficult, it just uses a different set of skills. \n\nI’d recommend learning openness before attending a 4 year! You seem pretty closed minded in what you consider to be a legit degree.",
                      "author": "creamy-comrade",
                      "created": 1636612871,
                      "upvotes": 7,
                      "replies": {
                        "hk6cct2": {
                          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6cct2/",
                          "text": "Bruh. A General Management degree is not as hard as an engineering degree. You pretty much just need to make sure you read the textbook multiple times bcuz you need to memorize what you are learning, do the homework, go to class, and boom there you go… 3.7+ GPA, now OP can go to a top MBA program in the future and work in consulting at Bain. And no, I’m not STEM, I am an accounting major who is also doing a minor in finance.",
                          "author": "WalmartDarthVader",
                          "created": 1636614111,
                          "upvotes": 15,
                          "replies": {
                            "hk6cuks": {
                              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6cuks/",
                              "text": "So the whole point of college is learning life skills right. So a general management degrees difficulty comes in learning how to manage people, how to maintain work balance, the process of management etc etc. a general manager has to learn the skills to manage people. \n\nAn engineering major has to learn the skills to engineer whatever it is they are engineering. They have to read a textbook, practice those skills. They aren’t taught the same skills as a gen management degree would. \n\nAn accountant doesn’t learn the same skills as an engineer would. Like you don’t have a smart take. Someone who is naturally good at STEM is going to have to work at a business/humanities degree. Someone who is naturally good at English is going to have to work at a STEM degree. The reason x degree sounds easy to you and y degree seems hard is because you’re good at the skills taught in x degree versus not at the skills taught in y degree.",
                              "author": "creamy-comrade",
                              "created": 1636614484,
                              "upvotes": 0,
                              "replies": {
                                "hk6qd6d": {
                                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6qd6d/",
                                  "text": "people who graduate with general management degrees don't manage engineers or scientists. engineers and scientists manage engineers and scientists. until you get to the top level, at which point the engineer/scientist has become an executive.",
                                  "author": "wobbletelescope",
                                  "created": 1636625900,
                                  "upvotes": -2,
                                  "replies": {}
                                },
                                "hk7p02z": {
                                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7p02z/",
                                  "text": "It's true that if you major in something business-related, you need to be good with people (reference: I am not good with people). Otherwise you will have a very hard time after graduating.",
                                  "author": "Brokenxwingx",
                                  "created": 1636645515,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hk7akmd": {
                      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7akmd/",
                      "text": "You wanna go to school and get a difficult degree just to say you did it? Lol",
                      "author": "Bosschopper",
                      "created": 1636638983,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                },
                "hk6ho4l": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk6ho4l/",
                  "text": "Trump studied business though.",
                  "author": "DrakeIsMyDada",
                  "created": 1636618332,
                  "upvotes": -2,
                  "replies": {}
                },
                "hk7mhh0": {
                  "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7mhh0/",
                  "text": "I would say that title goes to economics. At our college of business, Econometrics was considered to be the hardest class they offered.",
                  "author": "Brokenxwingx",
                  "created": 1636644424,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk7u6gq": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7u6gq/",
      "text": "Trade school.",
      "author": "Jace_Oldham",
      "created": 1636647690,
      "upvotes": 1,
      "replies": {}
    },
    "hk7veor": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7veor/",
      "text": "Coursera has a lot of in demand certificates that aren’t super expensive. This is also a good route to try things!",
      "author": "dezitrondeluxe",
      "created": 1636648182,
      "upvotes": 1,
      "replies": {}
    },
    "hk7w1my": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7w1my/",
      "text": "Or get yourself into a trade like welding or machining good money and you don't necessarily need college. You will if you want like a leadership role but you can make great money just as a machinist. Also it would help to familiarize yourself with programming CNC machines is also a major step above your typical machinist.",
      "author": "FleaBitenDrifter",
      "created": 1636648433,
      "upvotes": 1,
      "replies": {}
    },
    "hk7zyi0": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7zyi0/",
      "text": "Go to a trade school.",
      "author": "thedragoon0",
      "created": 1636649970,
      "upvotes": 1,
      "replies": {}
    },
    "hk814ni": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk814ni/",
      "text": "Finance / Accounting if you want the most traditional college experience and a fairly straightforward education plus decent employment opportunities. Or, go to trade school (electrician or dental hygenist). Nursing is not easy but is always in demand, which means you can get a job and get good pay.",
      "author": "hadielie",
      "created": 1636650438,
      "upvotes": 1,
      "replies": {}
    },
    "hk830xm": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk830xm/",
      "text": "Basically what everyone is saying in these comments are Trade school or Business which business is not easy and most trade schools (in my area) only do heat&air, beauty hair, and cars( also armyl",
      "author": "Forever_ForLove",
      "created": 1636651196,
      "upvotes": 1,
      "replies": {
        "hk8f7j1": {
          "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8f7j1/",
          "text": "Welding/plumbing/electrician. Don’t say you can’t find those in your area.",
          "author": "EbenezerMac",
          "created": 1636655989,
          "upvotes": 0,
          "replies": {
            "hk8fhc5": {
              "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8fhc5/",
              "text": "That's part of heating&air also I'm a female and I don't know much about that.",
              "author": "Forever_ForLove",
              "created": 1636656097,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hk831wo": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk831wo/",
      "text": "1. Go to community college to see if any course inspires you.\n2. If you're not overly passionate about anything, or if the things you are passionate about don't make a lot of money...\n3. Take business or accounting classes; major in Finance, that's what I'm doing. Not super passionate about it, but I'd rather make money and be comfortable than be broke doing what I love.",
      "author": "Bird_Babe",
      "created": 1636651207,
      "upvotes": 1,
      "replies": {}
    },
    "hk835ij": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk835ij/",
      "text": "Accounting? Depend on if you like to deal with number all day everyday.\n\nMaybe computer science but some would think cs is quite difficult.",
      "author": "coolrider2010",
      "created": 1636651246,
      "upvotes": 1,
      "replies": {}
    },
    "hk84bfs": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk84bfs/",
      "text": "Accounting",
      "author": "FutureConsultingMan",
      "created": 1636651704,
      "upvotes": 1,
      "replies": {}
    },
    "hk87e2g": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk87e2g/",
      "text": "Health sciences(I'm just translating word by word à field from my native tongue), you can specialise in physical therapy or a speech pathologist and other fields that might have a relatively great career future. You can always do a year or two tuition for crafts like welding (one of the field that have a surprisingly high payment if you were really good at it), if you're an American or someone who has community colleges in his country I envy you, because those colleges have lots of options for crafts that actually have a high demand and high payment",
      "author": "physics_freak963",
      "created": 1636652900,
      "upvotes": 1,
      "replies": {}
    },
    "hk87tgb": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk87tgb/",
      "text": "I think we need a little more to go off of before answering. I'm not really sure what to recommend without knowing what topics interest you. What is considered a decent living in your mind? and how do you define \"average\"?",
      "author": "NRevenge",
      "created": 1636653063,
      "upvotes": 1,
      "replies": {}
    },
    "hk8ab6u": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8ab6u/",
      "text": "Community college offer some non degree programs like insurance and real estate courses that can be done in a couple of months",
      "author": "Leticiaespino",
      "created": 1636654034,
      "upvotes": 1,
      "replies": {}
    },
    "hk8aiw1": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8aiw1/",
      "text": "Have you ever considered IT? It’s not as difficult as something like computer science, but still fun. It’s easy if you’re interested in computers. And you can go anywhere with it.",
      "author": "A7XfoREVer15",
      "created": 1636654118,
      "upvotes": 1,
      "replies": {}
    },
    "hk8bdkd": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8bdkd/",
      "text": "Anything in healthcare especially nursing",
      "author": "ommena",
      "created": 1636654460,
      "upvotes": 1,
      "replies": {}
    },
    "hk8bms1": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8bms1/",
      "text": "If you are able to, get 2 free years of Community college, see what your interests are, and go from there.\n\nBut if you want a fairly good degree that isn’t insanely difficult, then I’d recommend some form of business degree, preferably BIS or MIS (basically a mix of comp sci and business) which would really put you ahead. \n\nIt also opens you up to getting an MBA if you are interested in that route after. \n\nMake sure you also do extracurriculars, such as joining a frat and possibly  taking a leadership role, join clubs pertaining to special interests (IE: I’m an Economics major who’s a part of the Economics club here, etc.), etc etc. it’ll look great on resumes, plus they connect you with your student body and give you escapes from your coursework and other academic responsibilities.",
      "author": "RetroRPG",
      "created": 1636654563,
      "upvotes": 1,
      "replies": {}
    },
    "hk7js59": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7js59/",
      "text": "Start with your local community college to pay the lowest rates possible. Keep your grades up and you may earn a scholarship! I recommend and arts degree, music, history, language, something with minimal math.",
      "author": "WiteChalkLit",
      "created": 1636643235,
      "upvotes": -2,
      "replies": {}
    },
    "hk7sre9": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7sre9/",
      "text": "Chemical engineering",
      "author": "unfeelingsalmon",
      "created": 1636647115,
      "upvotes": 0,
      "replies": {}
    },
    "hk7t3yt": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk7t3yt/",
      "text": "admin. my roommate in Vancouver used to make well over 20$ an hour doing admin at a forestry firm.",
      "author": "Klutzy-Classroom6756",
      "created": 1636647261,
      "upvotes": 0,
      "replies": {}
    },
    "hk8ises": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8ises/",
      "text": "If you’re interested in medicine, there are lots of 2 year degrees that have great salary’s coming out. My neighbor got a 2 year respiratory therapy degree and does very well for himself.",
      "author": "Nodeal_reddit",
      "created": 1636657425,
      "upvotes": 2,
      "replies": {}
    },
    "hk8z6w0": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8z6w0/",
      "text": "Accounting",
      "author": "Toxovolo",
      "created": 1636664157,
      "upvotes": 2,
      "replies": {}
    },
    "hk8mcr5": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk8mcr5/",
      "text": "I have two degrees - BA and MA. My field doesn’t pay particularly well and I enjoyed the work…for a short time. Then I got bored (I have ADHD), and now I’m a full time bartender. The hours are long and some days really suck (like really suck), but I’m making *a lot* more than I ever thought I could and *love* my job. Like, love it. I have no plans of leaving hospitality now and am working on supervisor training. \n\nWhat I’m saying is, you don’t need to have a degree to be happy or even make a lot. Sure, bartending can be ball-busting. But dammit I’m making more than most of the people my age (lower earner than my friends but they’re the exception not the standard), but I actually enjoy going to work. Do what makes you happy basically",
      "author": "DancerKellenvad",
      "created": 1636658876,
      "upvotes": 1,
      "replies": {}
    },
    "hk97d7y": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk97d7y/",
      "text": "Community college",
      "author": "Idespisemyusername",
      "created": 1636667525,
      "upvotes": 1,
      "replies": {}
    },
    "hk9c85n": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9c85n/",
      "text": "Business management and administration studies",
      "author": "Specialist-Long6986",
      "created": 1636669594,
      "upvotes": 1,
      "replies": {}
    },
    "hk9e96r": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9e96r/",
      "text": "1. Community college \n2. Trades \n\nTwo best routes for someone in your positron",
      "author": "mihelic8",
      "created": 1636670484,
      "upvotes": 1,
      "replies": {}
    },
    "hk9rlab": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9rlab/",
      "text": "A tech school is best",
      "author": "Turbulent-Rip-5370",
      "created": 1636676851,
      "upvotes": 1,
      "replies": {}
    },
    "hk9t57g": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hk9t57g/",
      "text": "Social science and communications",
      "author": "Old_Mood_8836",
      "created": 1636677586,
      "upvotes": 1,
      "replies": {}
    },
    "hka1clk": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hka1clk/",
      "text": "[removed]",
      "author": null,
      "created": 1636681441,
      "upvotes": 1,
      "replies": {}
    },
    "hka56v3": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hka56v3/",
      "text": "Seriously, nothing except maybe medical school and law school is hard if you enjoy it. If I went into finance, it would be incredibly hard because I’d have no motivation to learn or do it. Go explore with some classes either at a community college or university and find what you can enjoy doing, and you’ll nearly always be able to make a career out of it",
      "author": "Jbooty18",
      "created": 1636683215,
      "upvotes": 1,
      "replies": {}
    },
    "hkaabmj": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkaabmj/",
      "text": "Economics. You can get a decent average salary job, probably as some sort of analyst, budget divisor, or even for a bank. And the classes, I’ve taken three, are very mid-easy to mid level. Once you take the time to understand the concepts, it’s easy. Unlike STEM.\n\nBut it’s more useful than business, which is just too general to stand out",
      "author": "DeepSpaceOG",
      "created": 1636685550,
      "upvotes": 1,
      "replies": {}
    },
    "hkaixbx": {
      "link": "/r/college/comments/qrdaei/what_is_the_best_degree_for_people_who_are/hkaixbx/",
      "text": "Average but decent living means you don’t need to go all the way for stem but also can’t do underwater basket weaving. Try something in the middle that you like to learn about or are good at, most degrees are in the good middle ground and you qualify for any area that just need a degree + the degree you got. Good middle ground degrees should also be flexible so look into things like English with a lot of soft skills but obviously look into your skills, English was just an example but good choice if you are into it!",
      "author": "Lifedeather",
      "created": 1636689648,
      "upvotes": 1,
      "replies": {}
    }
  }
}