{
  "sid": "q2pvcr",
  "link": "/r/college/comments/q2pvcr/abroad_study_in_america/",
  "title:": "Abroad study in America",
  "text": "I want to study abroad and preferably in America. The problem is, not being from there is kinda hard. The school system is a bit hard to understand. For example: here in the netherlands you can choose a study (Economics, accountancy, international bussines, etc.) And then choose an university. How does that work in the US? I want to do something with economics on university level. What schools would there be? How would you Finance it? Pay everything myself or loan? What are some of the better schools (education and after school activity)? How is school life in America? I'm still in doubt between choosing a study in America or one in the netherlands which sends me abroad for a year. I would love to study in America to feel the American school life (or something) for a while . How is university life in the US? What are the acceptance terms for an abroad student?",
  "author": "mexrel",
  "created": 1633543292,
  "updated": 1634083717,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfmzrqq": {
      "link": "/r/college/comments/q2pvcr/abroad_study_in_america/hfmzrqq/",
      "text": "[Here is a list of grad schools with top economics programs.](https://www.usnews.com/best-graduate-schools/top-humanities-schools/economics-rankings)\n\n[Here is a list of schools for top economics programs for bachelors degrees ](https://www.collegerank.net/best-bachelors-economics/)\n\nIn America, you get your bachelors (second link) then you can go to graduate school (first link). But the first link also has a list of good schools in general to get a degree from including your bachelors. Most schools have an economics program for your bachelors.\n\nYou will need to research the campus to see if you like the environment but the big name schools that have been listed have a ton of variety with activities.\n\nYou should pay everything if you can afford it but if you can’t then take out a loan.\n\nTypically unless you go to an extremely well known school such as Harvard or Cambridge, you will not be able to work in your home country if you obtain a degree in a different country (At least that’s how it is in America). So if you get your degree in the US you will have to stay and work and live in the US, or go back to school again upon your return to your home country.\n\nThe acceptance terms depend on what school you go to. If it is a top rated school it will be more difficult for everyone in general. They also sometimes have a preference for in-state/in-country applicants. Don’t be discouraged, you can still get into the school you want!\n\nUniversity is difficult. The material is hard. It can be hard to meet people even if you are from the same country but a lot of people are still very happy to meet others! It is fun and a good place to make memories!",
      "author": "shoelaceys7373",
      "created": 1633547283,
      "upvotes": 1,
      "replies": {}
    }
  }
}