{
  "sid": "qmetjk",
  "link": "/r/college/comments/qmetjk/i_want_to_give_up_pls_help/",
  "title:": "I want to give up (pls help)",
  "text": "Took a year year off after HS thinking that it would give me more incentive to work harder in uni. Turns out I was wrong. \nI started out really good but then I kept forgeting about assignments and then my mom got sent to the ICU. Thankfully, she recovered but because of that I missed almost two weeks of school. Then midterms arrived and I almost failed all of them. Resulting in me spiraling into a major depressive epsiode. Now I have midterms again and I haven't studied for any of them. I feel like I'm just disappointing everyone because I was supposed to be the \"smart one\" but all I'm doing is wasting money. \nI also haven't made any friends yet so going to classes feels isolating because everybody has already formed groups. Most of the time I don't even go to lectures because the professors just reads off slides and I end up zoning out. I really do try to focus but I just... can't. I considered switching majors (I'm currently a bio major) but I just don't know what else I would do. Dropping out isn't an option either 'cause then I would lose my loans and my sister would be left to pay all the bills by herself. \n\nIf any of y'all have any tips or advice on how to improve grades, mental health and motivation (or anything tbh) then I would really appreaciate it",
  "author": "lemon_woffles",
  "created": 1636008550,
  "updated": 1636137411,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hj9rqni": {
      "link": "/r/college/comments/qmetjk/i_want_to_give_up_pls_help/hj9rqni/",
      "text": "You need to do the assignments and study. Not studying is your problem. You absolutely need to quit skipping classes, it has a bigger impact than you imagine.\n\nThe thing is that college is relatively easy if you do the assignments and study. I am also a \"smart one\" and I also dropped out in my early 20's. \n\nI'm back at 32 and I'm getting excellent grades and I really feel like I'm not working hard. The biggest thing that's helped me be successful is discipline. I have the discipline from YEARS of working jobs. \n\nNow, I know that if I have assignments I have to get them done at some point. I can't just put them off. My stress reduces to nil if I get things done beforehand. Every time I want to do something else, I realize that I have nothing actually better to do than my school work and study. \n\nMy suggestion is right now, get everything in order. Get on top of your assignments and go to all classes. Just do what is assigned. If they give practice problems for a mid term, do all of them. You just need to start doing everything. It'll reduce your stress and depression. It's a spiral once you start getting behind.",
      "author": "Awkward_Mail_2786",
      "created": 1636026878,
      "upvotes": 1,
      "replies": {}
    }
  }
}