{
  "sid": "qvya2k",
  "link": "/r/college/comments/qvya2k/i_need_help_picking_between_two_music/",
  "title:": "I need help picking between two music gen-eds/electives (Theory of Music for Nonmajors or Music and Money)",
  "text": "I still need to take at least one more gen-ed and was wondering which one to take. My next semester will probably be my last before graduating, so I want to take a fun course.\n\nThe course descriptions for each are:\n\n* Theory of Music for Nonmajors: Elements of writing  music; melody, rhythm, intervals, chords, harmony, tone color, and  styles of musical expression. Music signs and symbols; traditional  language of tonal music, with examples drawn from popular and classical  music. No prerequisites.\n* Music and Money: Is great music the  product of inner genius, or divine inspiration? Whatever the answer may  be, many of our most celebrated composers and songwriters also use their  talents to earn a living. To discover how the basic principles of  capitalism can influence both the creation and reception of music across  a variety of genres, Music and Money takes an objective look at the  historical circumstances that have shaped the development of the modern  musical marketplace. Through a series of case studies, students will  first evaluate the kinds of economic decisions faced not only by  composers but also by performers, publishers, and audiences. Students  will then explore the professional and artistic consequences of such  decisions for musicians and for the music that they produce.\n\nThe Theory of Music for Nonmajors will probably fit into my schedule a bit better since my first class on MWF is at 2 pm and there are two sections (12 PM and 1 PM). Music and Money might be manageable, but there is a decent gap in between this class and the other class I will be taking (10:15 AM to 12:30 PM). I'm interested in learning how capitalism affects how artists make money and all that, but learning music theory may help me better understand and read sheet music. I'm not too concerned about professors unless there ends up being a bad professor for the 12 PM section.",
  "author": "ranych",
  "created": 1637152344,
  "updated": 1637181134,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl0orzt": {
      "link": "/r/college/comments/qvya2k/i_need_help_picking_between_two_music/hl0orzt/",
      "text": "If you can't already read music I would not recommend music theory. It's pretty notorious for being difficult. Even a beginning class like that is hard, I took one that was very similar as a person who has been reading music since I was 12 and still had trouble with it my first semester in college.",
      "author": "aquamarine_321",
      "created": 1637174015,
      "upvotes": 1,
      "replies": {}
    }
  }
}