{
  "sid": "pxiay9",
  "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/",
  "title:": "Anyone else having a hard time adjusting to in person class?",
  "text": "I’m a fifth year student so I have had a lot of experience with college in person exams and classes and even thought it was stressful at times, it was doable. After zoom classes, online speeches and online exams I just lack motivation to study and put forth effort. I am trying my best but I’m not dealing with the stress well at all. Anxiety has been worse with exams this week and next and I’m just counting down till I get a break. I don’t know how I did my hardest semester in person pre covid, it seems like something I could never do now. \n\nDoes anyone else relate? I’ve been seeing people say covid hurt them in terms of grades but I couldn’t feel more the opposite.",
  "author": "israelipita",
  "created": 1632870346,
  "over_18": false,
  "upvotes": 108,
  "upvote_ratio": 0.98,
  "comments": {
    "hepdc9y": {
      "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/hepdc9y/",
      "text": "Weirdly my profs are still conducting online exams despite in person classes. Honestly I’d rather have unlimited time for an in person exam compared to a short time for an online exam. In general I really dislike online exams even though I know they tend to be popular with students. However, I think it’s more of a false sense of security thing because usually you don’t have much time to look at notes so I doubt average scores are much higher.",
      "author": "lovingtolive",
      "created": 1632909169,
      "upvotes": 3,
      "replies": {}
    },
    "hep12x8": {
      "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/hep12x8/",
      "text": "I'm a junior and this semester has been the absolute worst time of my academic career. I'm taking 16 credits of all technical math/engineering courses but I'm completely burned out, have zero interest in any of my classes, and I have negative free time. I'm drowning in work and I only keep getting further behind. I'm at least a week behind in most of my classes, and yesterday I couldn't sleep till 6 AM since I broke out in itchy hives all over my ass and legs from the stress. \n\nYeah, ain't having a great time here : ^ )",
      "author": "throwmefillet",
      "created": 1632898181,
      "upvotes": 10,
      "replies": {
        "hepq5bt": {
          "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/hepq5bt/",
          "text": "Wow yeah 16 credits is too much unless 6 of them are bullshit classes",
          "author": "youngkookwojcik84",
          "created": 1632918263,
          "upvotes": 4,
          "replies": {}
        },
        "heqlsgh": {
          "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/heqlsgh/",
          "text": "Also taking 16 credits of math and engineering. It’s even worse that I just came back from a co-op so I’m super rusty.",
          "author": "vice-roi",
          "created": 1632932387,
          "upvotes": 1,
          "replies": {}
        },
        "herpiw1": {
          "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/herpiw1/",
          "text": "I was in the same situation that you were. I dropped my Mathematical Finance class to make my schedule lighter. Try dropping one of your hardest classes.",
          "author": "detray1",
          "created": 1632948516,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "heoxanp": {
      "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/heoxanp/",
      "text": "Yeah I'd say so.  I actually got used to online classes and I think overall did better grade wise.\n\nOne thing I didn't realize was how much time going to class really took up.  When things were online, a class being 1 hour really meant 1 hour.  In person class is 1 hour + 15 minutes to get there + 15 minutes to get back + another 30-60 minutes to get back into a workflow of some kind.\n\nPlanning my day has been really tough and I feel incredibly scatter brained.",
      "author": "StrangerThingsWTF",
      "created": 1632895243,
      "upvotes": 25,
      "replies": {}
    },
    "henulw1": {
      "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/henulw1/",
      "text": "I’m currently feeling the effects of not having properly learned anything during online school. I’m struggling with fundamentals that I learned during online school. So I spend most of my time properly learning that rather than any new material.\n\nIt sucks. I’m struggling and I’m tired already.",
      "author": "vice-roi",
      "created": 1632874518,
      "upvotes": 54,
      "replies": {
        "henvmlf": {
          "link": "/r/college/comments/pxiay9/anyone_else_having_a_hard_time_adjusting_to_in/henvmlf/",
          "text": "I feel for people younger than me in college. It would really be whiplash to go from online college to all in person exams and those younger than me are really struggling even more so",
          "author": "israelipita",
          "created": 1632874996,
          "upvotes": 19,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054391
}