{
  "sid": "qvh5gw",
  "link": "/r/college/comments/qvh5gw/flunked_out_the_first_time_how_do_i_go_back/",
  "title:": "Flunked out the first time. How do I go back?",
  "text": "I wasn't ready for college the first time around. I was 18, immature, and wasn't ready to put in the work. I barely hung on for a few years and finally was dismissed from my university due to poor grades.\n\nThis was about 6-7 years ago and I've grown up a lot since then. I make good money, have a good job. But a college degree is something I want to accomplish if at all possible. \n\n&#x200B;\n\nHow do I even go about getting back in school with poor grades? Do I need to go the community college route? Is it even worth it?",
  "author": "fatcheetah69",
  "created": 1637094200,
  "updated": 1637181388,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkweaoy": {
      "link": "/r/college/comments/qvh5gw/flunked_out_the_first_time_how_do_i_go_back/hkweaoy/",
      "text": "You should go to community college and seek to transfer out. 6-7 years later is a long enough time for your grades to not really be considered anymore. They know you’d have changed. And don’t see CC as a loss. People go to CC and transfer to Berkeley and UCLA. Even Cornell takes a hundred or so top-tier local CC transfers a year.\n\nStarting at CC means nothing against you. I interviewed with a big4 Sr. Manager who started at CC, but got his MS from Cornell. I myself am a CC transfer student at a fairly prestigious CA public now. \n\nSo get out there man! Sign-up and get started.",
      "author": "maora34",
      "created": 1637095364,
      "upvotes": 2,
      "replies": {
        "hkwf487": {
          "link": "/r/college/comments/qvh5gw/flunked_out_the_first_time_how_do_i_go_back/hkwf487/",
          "text": "Thanks for the advice. \n\nI'm just wondering if it's going to be worth all the work of getting my grades up at a CC, transferring, finishing up somewhere else. I'll need to do it primarily online. Also spending all the money. Just a lot to think about.",
          "author": "fatcheetah69",
          "created": 1637095681,
          "upvotes": 2,
          "replies": {
            "hkwfno1": {
              "link": "/r/college/comments/qvh5gw/flunked_out_the_first_time_how_do_i_go_back/hkwfno1/",
              "text": "It depends on what state you go to. If you’re here in CA for instance, it’s super easy as CC costs $46 a credit and there’s numerous online degree completion programs from the cal states. Also the fact that there’s a CSU within spitting distance of everywhere means you can always finish in-person, part-time.\n\nAt the end of the day, it’s up to you to decide worth. Will it boost your earnings potential or is it for personal growth? How much is the personal achievement is worth it to you? Etc etc. that’s all you man.",
              "author": "maora34",
              "created": 1637095887,
              "upvotes": 1,
              "replies": {
                "hkwgs6n": {
                  "link": "/r/college/comments/qvh5gw/flunked_out_the_first_time_how_do_i_go_back/hkwgs6n/",
                  "text": "True true.\n\nI'm torn between proving everyone wrong who said I wouldn't succeed without a degree and getting the degree for the personal achievement. \n\nThanks again for the advice- you're awesome.",
                  "author": "fatcheetah69",
                  "created": 1637096324,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}