{
  "sid": "qbvgr6",
  "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/",
  "title:": "Does your professors care about what you do on camera when they see you doing smth different",
  "text": "So I know half of you on zoom has professors who needs cameras on, for those that do, do they lecture you or tell you not to do something while in class\n\n\nLike walking around the house, opening boxes(me, 1 time.), going to the bathroom, eating, closing our cameras etc",
  "author": "amynotadoctor",
  "created": 1634715372,
  "updated": 1636177715,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hhcngdu": {
      "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcngdu/",
      "text": "Opening boxes....?\n\nThis is such a far out question. Do whatever the fuck you want. You paid for the course.",
      "author": "Awkward_Mail_2786",
      "created": 1634730986,
      "upvotes": 2,
      "replies": {
        "hhcsb7b": {
          "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcsb7b/",
          "text": "Oh OK I’m just worried because I have just one teacher who only has an issue with cameras being turned off. I’m on a full ride rn to. I have a  side business (bookstore) of selling stuff so I have to take pictures for everything.\n\nAnd thanks for your response I think if I try to do anything else on camera I’m just gonna get lectured by grown ass adult who really doesn’t have anything better to do\n\nI pretty much record her lessons because it’s annoying how she just talks and not show any PowerPoint or stuff on screen, is that normal because this is my first time. And when I say the cross is easy it’s just a class about how to handle your emotions. There’s nothing hard about that class",
          "author": "amynotadoctor",
          "created": 1634733806,
          "upvotes": 1,
          "replies": {
            "hhcslc2": {
              "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcslc2/",
              "text": "Unless your syllabus says that you MUST have your camera on, you don't owe the professor any courtesy of doing so.",
              "author": "Awkward_Mail_2786",
              "created": 1634733957,
              "upvotes": 1,
              "replies": {
                "hhcthgt": {
                  "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcthgt/",
                  "text": "Ah crap I checked it and it says **”You will be required to have your camera and microphone on for each and every class.”** I guess I’m screwed  but it doesn’t say anything about what you **do on camera** and asking other classmates for help. \n\nI’m just not sure what to say if I tell her that cause she’s going to try one upping me and “speak to me” later",
                  "author": "amynotadoctor",
                  "created": 1634734433,
                  "upvotes": 0,
                  "replies": {
                    "hhcwadi": {
                      "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcwadi/",
                      "text": "How about simply paying attention for the duration? \n\nIs it seriously that difficult not to fuck with boxes during the lecture?",
                      "author": "Awkward_Mail_2786",
                      "created": 1634735848,
                      "upvotes": 3,
                      "replies": {
                        "hhcwmgd": {
                          "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcwmgd/",
                          "text": "Nop. ADHD Ain’t work that way you can’t just tell someone who pay attention when they’re already trying ta\nEdit: also cause doing multi task works for me",
                          "author": "amynotadoctor",
                          "created": 1634736011,
                          "upvotes": -2,
                          "replies": {
                            "hhd1ec8": {
                              "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhd1ec8/",
                              "text": "I can tell you to pay attention regardless of which acronym represents your diagnosis. In fact, when you signed up for college this is a responsibility you essentially agreed to.\n\nI love how you've just essentially escaped responsibility since you have ADHD. \n\n\"okay hunny, you don't have to pay attention because you've got the \"Ay-Dee-Eighch-Dee\"\n\nIf you can't not fuck with boxes during that time period, then fuck with boxes dude. If you can't deal with what the professor *may* say, then that's on you. I imagine that their policy includes cameras on as they are trying to educate you. If you're not paying attention, they cannot do their job. \n\nFor fucks sake. This is about playing with boxes during a course.",
                              "author": "Awkward_Mail_2786",
                              "created": 1634738211,
                              "upvotes": 2,
                              "replies": {
                                "hhd932x": {
                                  "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhd932x/",
                                  "text": "Ok, kaRen\n\nI didn’t say I fucking play with boxes there’s a difference. “Do whatever you want,” just like how you probably did. Your words.Don’t try to twist my words and stop making excuses.\n\nI looked thru your post history and you’re 32 year old grown ass man and a college dropout when you were in your 20s. I’m sure you’ve gotten shit like that.  Like you said, you to signed up for the same exact Responsibilities, the first time around but then had hAd tO dropped out bc you couldn’t handle it or something happened, “OK honey you shouldn’t have dropped out.” That’s the same exact train of thought. And Life happens \n\nDo you tell a disabled person to pay attention? Do you tell someone who’s in a wheelchair, “OK honey you can’t walk because your legs don’t work” \n\nFor fucks I can’t imagine your friends ,family, kids, and the people around you having to deal with your crap. \n\nPeople like you are a shining example of a special snowflake.",
                                  "author": "amynotadoctor",
                                  "created": 1634741589,
                                  "upvotes": 1,
                                  "replies": {
                                    "hhdsl3f": {
                                      "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhdsl3f/",
                                      "text": "Yeah, those are the things I went through. I own up to them, it's cool. It doesn't matter that I took that time off. Well, it doesn't matter to me. I couldn't have thought of a better time to come back to school really. \n\nI am a grown ass man! Thank you! \n\nI did drop out because I couldn't handle the responsibilities. I kind of did the same thing you are. I blamed it on depression, anxiety and health issues I was going through at the time. That's a really long story that I don't mind sharing but I feel like this isn't the place. If you keep leaning on ADHD why you can't pay attention for the duration of an online class, you'll be in the same position I was.\n\nDo I tell disabled people to pay attention? Uh... if they should be paying attention I would. I mean, I suppose in the right situation I'd tell a person in a wheel chair they couldn't walk because their legs don't work but I really feel like they'd know that. \n\nI really feel like calling yourself disabled because you have ADHD a REAL fuckin' stretch. You're a victim of ADHD. You straight up threw out your responsibilities because you have ADHD and that's that. So far you've had enough determination to type out these posts. That's a lot of concentration.\n\nPeople don't have a problem putting up with my crap. That's because they don't generally come to me with petty problems for advice, then take my advice and say they can't do it because of their 'disability'. I mean, don't get me wrong, we've all got problems but as grown ass people, we keep them to ourselves and don't let a 4 letter acronym that's being handed out by practitioners like they are those tiny Bible's on campus. EVERYONE has ADHD. It's about as human as having 2 nipples.\n\nThe one thing about this post that drives me nuts, and I'll never be able to figure out. I've been reading the last sentence for SO LONG. I thought being a special snowflake was like... a good thing. It's like a double unique. Not only am I a snowflake, which are all unique, but I'm a SPECIAL unique snowflake. That's pretty solid, bro.",
                                      "author": "Awkward_Mail_2786",
                                      "created": 1634749400,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhcp16i": {
      "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcp16i/",
      "text": "I had a professor ask me if I had “something better to do” when I went out of view for all of 2 seconds to plug in my laptop. He didn’t require us to have our cameras on, but I was one of two people in the class with it on. I said sayonara and left it off the remainder of the semester. \n\nThe rest of my professors asked us to have them on on and didn’t give two shits whether you were out of view or not. Hell there were even people sleeping, eating, playing on their phones. No one ever said anything. I never did any of that, yet I was called out in that one class for simply dipping out for a couple seconds. \n\nSome of them are chill and others are just downright crazy over it.",
      "author": "WickedPuffin",
      "created": 1634731954,
      "upvotes": 1,
      "replies": {
        "hhcrv4r": {
          "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcrv4r/",
          "text": "Yeah exactly! And it’s distracting seeing everyone’s cameras on Imo. I did tell the professor in a zoom text that I was going to the bathroom for like a few minutes and then she went behind my back and timed me 15 when I didn’t tell her I was back or something. Which was shit. Honestly I just ate on camera but she didn’t say anything about that which was funny.\n\nAnd for the whole camera thing I think I’m just gonna do whatever I want well on screen if I’m sorting out books or just moving my desk, because one teacher of straight up got on my case about not focusing in class, and I barely even know what I did wrong. Besides asking in the chat about how everyone got their emails and then getting lectured because I was hogging all the attention and it wasn’t class related.\n\nAnd that’s a L move what ur professor did there I swear there’s a special place in hell for those kind of people, I think they just doing it because it gets them off and it’s power trippy",
          "author": "amynotadoctor",
          "created": 1634733568,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhcv0at": {
      "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhcv0at/",
      "text": "For me yes, part of my grade in my online Spanish class is how much we pay attention and participate during class. He also specifically said not be get up/do anything else during class.",
      "author": "breadom927",
      "created": 1634735216,
      "upvotes": 1,
      "replies": {}
    },
    "hhf5ktg": {
      "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhf5ktg/",
      "text": "We have to be present. We don't have to show our faces",
      "author": "TragicalKingdom",
      "created": 1634769232,
      "upvotes": 1,
      "replies": {}
    },
    "hhffi3k": {
      "link": "/r/college/comments/qbvgr6/does_your_professors_care_about_what_you_do_on/hhffi3k/",
      "text": "Do they yes ! Does they ? Lol",
      "author": "Relative-Drawing8016",
      "created": 1634773780,
      "upvotes": 1,
      "replies": {}
    }
  }
}