{
  "sid": "q1fkym",
  "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/",
  "title:": "To skip or not skip class?",
  "text": "Can I ask when you are in college how often you skip class? Do you try to attend every class.   When I went to college, it was seldom that I would skip class.  I’m certain professors care. Am I wrong.  Engineering major.",
  "author": "silvergarth1",
  "created": 1633382527,
  "updated": 1634084173,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hfekfwe": {
      "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfekfwe/",
      "text": "CS major here, i found put that I can loop video on my zoom camera like in spy movies. For last month I've been looping tha same video, but now im getting kinda worried how far will I take this",
      "author": "dedslooth",
      "created": 1633382756,
      "upvotes": 3,
      "replies": {}
    },
    "hfekvtd": {
      "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfekvtd/",
      "text": "We notice a lot more than some people think, whether we acknowledge it or follow through on it. I’m of the opinion that you are an adult and can make your own decisions, so I don’t take attendance for a grade. If you want to skip class once or twice, you might not miss anything that would substantively affect your grade. If you want to skip a lot, you’d be unlikely to pass my classes (not because I give special points to attendees or anything - it’s just how it tends to be). It all depends on how your professors are.",
      "author": "PhDapper",
      "created": 1633382924,
      "upvotes": 4,
      "replies": {
        "hfeq45k": {
          "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfeq45k/",
          "text": "Thank you, as a professor, any suggestions or approaches on how yon handle this?",
          "author": "silvergarth1",
          "created": 1633384967,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfemuud": {
      "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfemuud/",
      "text": "Hey, I am an engineering major as well. Unless I knew I was going to spend the time that I will save doing something productive, (which was usually never) I would go to the lecture. Even if I got absolutely nothing out it, at the very least I would have some idea of where the professor lost me and work from there. Not to mention you never know what nuggets of information you will get from a professor that will be helpful on an exam.",
      "author": "Traaaaaaaaap",
      "created": 1633383662,
      "upvotes": 4,
      "replies": {
        "hfepskx": {
          "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfepskx/",
          "text": "Thanks, that makes a lot of sense.   Bro is skipping classes and I’m concerned.  I’m not sure how to handle this.",
          "author": "silvergarth1",
          "created": 1633384829,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hffalg5": {
      "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hffalg5/",
      "text": "The only reason I will skip class is if I am ill.",
      "author": "patrdesch",
      "created": 1633394971,
      "upvotes": 4,
      "replies": {}
    },
    "hfel9c2": {
      "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfel9c2/",
      "text": "I don't skip classes ever if it can be helped. I skipped a lot of chemistry lectures in first year and surprise surprise I wound up failing chemistry. Attending and paying attention is good to at least be familiar with what is in the course, even if it feels like you'd be better off using the time for other work. You still need to spend a lot of time studying and looking at recommended material.",
      "author": "smellytrashboy",
      "created": 1633383065,
      "upvotes": 1,
      "replies": {
        "hfepvqt": {
          "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfepvqt/",
          "text": "Thank you.",
          "author": "silvergarth1",
          "created": 1633384867,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfelo5c": {
      "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfelo5c/",
      "text": "I was a chem major, skipped 2 classes and they were both for my self defense elective I took senior year. I had a lot going on that semester and I felt bad, but I knew I needed it to do well in my classes that really mattered. I couldn’t bring myself to skip other classes and I never had a good enough reason to either.",
      "author": "usuallyConflicted",
      "created": 1633383220,
      "upvotes": 1,
      "replies": {
        "hfeq8v2": {
          "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfeq8v2/",
          "text": "Thank you.",
          "author": "silvergarth1",
          "created": 1633385023,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfeokbn": {
      "link": "/r/college/comments/q1fkym/to_skip_or_not_skip_class/hfeokbn/",
      "text": "What are you going to do with the time saved? I recommend going to class especially for engineering",
      "author": "GoldRequest",
      "created": 1633384325,
      "upvotes": 1,
      "replies": {}
    }
  }
}