{
  "sid": "rb41y0",
  "link": "/r/college/comments/rb41y0/any_other_middle_age_female_35_n_older_an/",
  "title:": "Any other middle age female (35 n older) an aerospace engineering major?",
  "text": "Any other middle age female (35 n older) an aerospace engineering major? I'm considering going back as an aerospace engineering major. But know my classes will be mostly young males(18-26),and I'm going to be a off middle age lady in the mix.",
  "author": "2000sSilentFilmStar",
  "created": 1638898465,
  "updated": 1639517318,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hnm8mq9": {
      "link": "/r/college/comments/rb41y0/any_other_middle_age_female_35_n_older_an/hnm8mq9/",
      "text": "35? middle age?",
      "author": "herculeaneffort",
      "created": 1638899416,
      "upvotes": 2,
      "replies": {}
    },
    "hnm97hn": {
      "link": "/r/college/comments/rb41y0/any_other_middle_age_female_35_n_older_an/hnm97hn/",
      "text": "Not aerospace, but I knew a girl who had gotten an HR degree, worked in HR for 6 years and then went back and got a ChemE degree. In general, older students have more maturity, more work experience, etc. So I think you might have a keg up when it comes to networking and career opportunities if you have the grades to back yourself up. It may be harder to fit in with the students, so determine if you want to work with a study group or think you can fly solo.",
      "author": "Thelton26",
      "created": 1638899661,
      "upvotes": 2,
      "replies": {}
    },
    "hnmtgn0": {
      "link": "/r/college/comments/rb41y0/any_other_middle_age_female_35_n_older_an/hnmtgn0/",
      "text": "as a young chemical engineering girl i don’t have any advice for you besides do it!!!",
      "author": "bigtitsbabynut",
      "created": 1638908407,
      "upvotes": 1,
      "replies": {}
    },
    "hnn5mp9": {
      "link": "/r/college/comments/rb41y0/any_other_middle_age_female_35_n_older_an/hnn5mp9/",
      "text": "I’m thinking about going back and getting a stem degree. I’ve looked at Arizona state abet accredited it bachelors, osu post bacc in computer science, Arizona state abet accredited engineering management, Georgetown cybersecurity masters, and embry riddle masters systems engineering. I’m working on my 2nd masters in project management from Georgetown and think I’ll take a 5 year break from school. So I’ll be 41 before I work on getting a stem degree. I say go for it. Retirement by the time we retire won’t be till 70 so we have a lot of working years.",
      "author": "BlueOcean7987",
      "created": 1638913446,
      "upvotes": 1,
      "replies": {}
    }
  }
}