{
  "sid": "q4tluc",
  "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/",
  "title:": "Is missing a 10 point assignment enough to fail a class?",
  "text": "Long story short , I found out last minute that I had two 10 point weekly assignments and I only had enough time to submit one. I really shouldn't bother emailing my professor because Im an idiot that has has no excuse for missing an assignment and they don't accept late work\n\nAs of now, I've been making an effort to submit all of my assignments on time. If I continue to just stay on top of my work, is the missing 10 point assignment still something to worry about?",
  "author": "DerekTheNeighbor",
  "created": 1633812145,
  "updated": 1634083098,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "hg0v4uy": {
      "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg0v4uy/",
      "text": "You need to check your syllabus about how much your HW count toward your final grade. If the ratio is low, and you perform well in other parts. You can pass the class.",
      "author": "terence_peace",
      "created": 1633812240,
      "upvotes": 17,
      "replies": {
        "hg10t3x": {
          "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg10t3x/",
          "text": "The grading breakdown of the class is cumulative and adds up to 200 points. The HW/Weekly Assignments portion is worth 160 since 16 weeks of the semester times 10 points is 160.\n\nThe final exam and the attendance/participatuon grade are both worth 20, so if I manage to do well on the exam and submit all assignments with the exception of the one that missed, I imagine that I could probably make it out with a decent grade.\n\nIf there's anything I happen to miss, feel free to let me know. I know its never smart to rely on the help others rather than taking respobsibility for my own, but this is something that's been stuck on my mind as of lately, so I figured seeking advice on this sort of thing is better than living in constant worry.",
          "author": "DerekTheNeighbor",
          "created": 1633814706,
          "upvotes": 2,
          "replies": {
            "hg1l2h3": {
              "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg1l2h3/",
              "text": "The highest you can get in your class is a 95%, still an A\n\nSo if you do well with everything else you really should be fine",
              "author": "SkeezySkeeter",
              "created": 1633824364,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg0ygbj": {
      "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg0ygbj/",
      "text": "No. Unless you have a university where you must submit everything.\n\nCheck your universities regulations on missing assignments.",
      "author": "Impressive-Name5129",
      "created": 1633813671,
      "upvotes": 5,
      "replies": {}
    },
    "hg13jrv": {
      "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg13jrv/",
      "text": "You should be fine in most cases. 10 points is not a killer unless your grade is really low. I recommend you calculate your grades if you can. But I am sure you will be okay,I have missed a 10 point assignment before and came out with a A. Just remember to write your assignments on a calendar or something so you don't mess up again.",
      "author": "LowConstruction4611",
      "created": 1633815943,
      "upvotes": 3,
      "replies": {}
    },
    "hg0zn0w": {
      "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg0zn0w/",
      "text": "You learned from your error, which is the biggest part, youll do fine if you stay on top of it. Don't worry about things you cannot change.",
      "author": "guy_with-thumbs",
      "created": 1633814190,
      "upvotes": 3,
      "replies": {}
    },
    "hg2q6e2": {
      "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg2q6e2/",
      "text": "Shouldn’t be.",
      "author": "meme_mac_and_cheese",
      "created": 1633847366,
      "upvotes": 1,
      "replies": {}
    },
    "hg4mup3": {
      "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg4mup3/",
      "text": "I make an excel spreadsheet with all my due dates, and factor in a notification to go off when something is due. Saves my ass more than i like to admit\n\nI never look at the syllabus. Unless for being sick and needing to look at accommodations or rules.",
      "author": "LoreBloop",
      "created": 1633888381,
      "upvotes": 1,
      "replies": {}
    },
    "hg59mpe": {
      "link": "/r/college/comments/q4tluc/is_missing_a_10_point_assignment_enough_to_fail_a/hg59mpe/",
      "text": "the answer to this depends entirely on how that assignment is weighted",
      "author": "NaleNaiyash",
      "created": 1633897654,
      "upvotes": 1,
      "replies": {}
    }
  }
}