{
  "sid": "pxap40",
  "link": "/r/college/comments/pxap40/just_bombed_my_first_in_person_college_test_need/",
  "title:": "Just BOMBED my first in person college test need advice/experience",
  "text": "Hello, \n\nI just left the exam room and bombed my first ever college test in person for a quantitative class. I’m just feeling really defeated and disappointed in myself. I’ve never failed an exam in college, I’m used to getting As but I feel like this class will be the one that changes that. \n\nThe test was 30 MC all financial word problems involving the time value of money, etc. This class has a reputation for being really hard and it’s definitely the hardest class I’ve taken throughout college. This scares me even more because I know I bombed the exam as I had to guess on so many questions, I kept confusing myself and it led to time being wasted. I pretty much just guessed on 20/30 of the questions if I look back. I’m not sure what to do at this point.\n\nI woke up at 10 studied the entire day before the exam and even stayed up till 4AM, to wake up 4 hours later for the 9AM exam. So I slept 3ish hours and my mind is so toasted right now. When taking the exam I was tired and couldn’t think straight. Didn’t eat any food, and really don’t feel like doing anything after this fat L. Just feels so bad knowing how much I studied and still failed, makes me feel stupid tbh.\n\nSorry for the rambling, \n\nI know it’s just one exam, but has anyone recovered from failing so miserably and have any advice?",
  "author": "Agni-23",
  "created": 1632848230,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hemx5sy": {
      "link": "/r/college/comments/pxap40/just_bombed_my_first_in_person_college_test_need/hemx5sy/",
      "text": "Wait for the statistics and grades to come out, the averages may be lower and maybe you didn't do as bad as you think. When you get the test back, go over it, see what you did wrong and redo it the correct way. Learn from that, and if you're stuck go to office hours and go over it with the prof or TA. Studying all day the day before is fine, but definitely don't stay up until 4AM and get 3 hours of sleep. Go to bed at a normal time and if anything wake up a tad early for like a quick hour of review. Don't change your normal eat/sleep routine drastically.",
      "author": "NinjaLorian",
      "created": 1632859447,
      "upvotes": 1,
      "replies": {}
    },
    "hemo2xo": {
      "link": "/r/college/comments/pxap40/just_bombed_my_first_in_person_college_test_need/hemo2xo/",
      "text": "Replying because loled and feel bad. But honestly, just retake it. If that's not an option, add another course to replace it in your portfolio. I personally think learing to fail is important in life (and in academia). Being able to fail, pick oneself up and keep doing ones best is worth a lot imo. \n\n\nTreat your formal exams like a sporting event. Sleep at least 8h before. Eat well (starting the day before). Bring snacks and water. (It read like you did the exact opposite) Failing too hard on any of these points could make anyone fail anything imo. \n\n\nDo not last minute study. You need that energy to dig deep in the exam. \n\n\nIf you are an A student you allready know how to study. Try to believe in yourself, it will show in your reasoning.",
      "author": "Scrupulous-brick",
      "created": 1632855609,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634054987
}