{
  "sid": "rcu078",
  "link": "/r/college/comments/rcu078/tired/",
  "title:": "Tired",
  "text": "I’m honestly so ready to turn in my final essays today. I’ve written four and I know I have one left to do because I hadn’t saved the majority of it before my computer died. Had that not happened I would’ve been finished for the year and I’m having a very hard time forcing myself to stay focused long enough to rewrite it. I care about my grade, but it’s hard to force myself to do it again.",
  "author": "MorningstarNo",
  "created": 1639091701,
  "updated": 1639516796,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hnx04ht": {
      "link": "/r/college/comments/rcu078/tired/hnx04ht/",
      "text": "How much time do you have? If it’s not due right away, I’d suggest stepping away from it and do something relaxing before you continue. You can also consume some caffeine to help keep you awake for a few hours.",
      "author": "ranych",
      "created": 1639092452,
      "upvotes": 2,
      "replies": {
        "hnx41cj": {
          "link": "/r/college/comments/rcu078/tired/hnx41cj/",
          "text": "I requested an extension and received one but I haven’t found the time to be able to put the same amount of effort into it. I’m honestly considering how much it would affect my grade to simply not do it. I know my professor knows I did at least a portion of it because we met about it and discussed it and my ideas. I’ll give myself until tomorrow to try to finish it.",
          "author": "MorningstarNo",
          "created": 1639094159,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnxu9gi": {
      "link": "/r/college/comments/rcu078/tired/hnxu9gi/",
      "text": "is it due today? if it's not, make out a little checklist of things to do and divide ur time to like type up one paragraph tm morning, second after lunch, etc. break up ur work, don't try to tackle too much at once and get a good nights sleep. I know college is exhausting but you've got this!!",
      "author": "alwaysdream4",
      "created": 1639105844,
      "upvotes": 1,
      "replies": {
        "ho6xkgi": {
          "link": "/r/college/comments/rcu078/tired/ho6xkgi/",
          "text": "My professor took mercy on me and granted me an extension because she knew I was struggling. I’m very grateful and completing it rn",
          "author": "MorningstarNo",
          "created": 1639272399,
          "upvotes": 1,
          "replies": {
            "ho7r2rq": {
              "link": "/r/college/comments/rcu078/tired/ho7r2rq/",
              "text": "I'm glad to hear that! good job, you can do this :)",
              "author": "alwaysdream4",
              "created": 1639287594,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}