{
  "sid": "raroml",
  "link": "/r/college/comments/raroml/do_you_enjoy_college/",
  "title:": "Do you enjoy College?",
  "text": "Is it something you \"look forward to\" or is it something you have to do like a job so you tolerate it anyway? I always hear about how stressed out college students are, so I'm just wondering, do you enjoy attending university?",
  "author": "hunt2destroy",
  "created": 1638854873,
  "updated": 1639517626,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hnk7q9v": {
      "link": "/r/college/comments/raroml/do_you_enjoy_college/hnk7q9v/",
      "text": "I graduated over the summer which was great. I’m glad to be done. For me it was 50/50. I looked forward to learning and growing as a person but I tolerated assignments, homework and rules, especially those I wasn’t super excited about.",
      "author": "bleedingfartss",
      "created": 1638855602,
      "upvotes": 2,
      "replies": {
        "hnk7v17": {
          "link": "/r/college/comments/raroml/do_you_enjoy_college/hnk7v17/",
          "text": "Did you enjoy it more than high school?",
          "author": "hunt2destroy",
          "created": 1638855681,
          "upvotes": 2,
          "replies": {
            "hnk8a0b": {
              "link": "/r/college/comments/raroml/do_you_enjoy_college/hnk8a0b/",
              "text": "Definitely. High school felt like brainwashing where as in college, I feel like it’s a very open space to express yourself and lean into your interests. My advice would be to take classes (when you can) just to see if it’s something you may like or even love. I couldn’t ever go to school just for a job that’s practical, there’s got to be some sort of passion in it for me to take it seriously but that’s just me.",
              "author": "bleedingfartss",
              "created": 1638855930,
              "upvotes": 3,
              "replies": {
                "hnk9vy6": {
                  "link": "/r/college/comments/raroml/do_you_enjoy_college/hnk9vy6/",
                  "text": "Do you think it's easier to make friends and socialize in college? Sorry for all the questions but I want to know lol",
                  "author": "hunt2destroy",
                  "created": 1638856941,
                  "upvotes": 2,
                  "replies": {
                    "hnka2za": {
                      "link": "/r/college/comments/raroml/do_you_enjoy_college/hnka2za/",
                      "text": "No worries!! I think it can be a great place to make friends, but for me, I have always made more friends in a work environment where we bond over the ups and downs of a job. But this can tie in with what you want to go to school for and your job afterwards. Please ask away!!! I am an avid question asker myself",
                      "author": "bleedingfartss",
                      "created": 1638857068,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hnkgrno": {
                      "link": "/r/college/comments/raroml/do_you_enjoy_college/hnkgrno/",
                      "text": "Not the original guy you're replying to...but yes and no. Its easier in that theres a lot of people, most people are starting fresh, and you see a lot of people all the time. Easy to break ice since you're all sharing the school experience. Harder because you actually have to put in effort, and a lot of people have an expectation that friends magically appear the second you set foot. Have to keep working at relationships if you want them, and want them to stay.",
                      "author": "NinjaLorian",
                      "created": 1638861763,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnlzi6i": {
      "link": "/r/college/comments/raroml/do_you_enjoy_college/hnlzi6i/",
      "text": "I graduated in the spring and honestly loved nearly everything about it. I effectively was friendless for my last two years (transferred then Covid hit...), but I adored my classes. Some assignments were not fun, and even some classes I was glad to finish, but still enjoyed it.\n\nFor me, I went to college simply to learn. And learn I did! High school felt like memorization whereas in college I actually could think. Anything I could imagine, no matter how esoteric, I could learn the ins-and-outs of. Post-Keynesian economics? There are people interested in that! Nuclear physics? There was a reactor on campus! History of Ptolemaic Egypt? There were 3 professors who studied it! Nuclear Weapon Policy? There was a who on-campus research institute devoted to it! The list went on. Whatever I wanted to learn about, I had access to world-class professors (and I didn't even go to a super-selective university).\n\nYes, socially I was lonely and bored often, but I loved my classes. I went to college to learn, and it exceeded my expectations.",
      "author": "DrAlawyn",
      "created": 1638895375,
      "upvotes": 2,
      "replies": {}
    },
    "hnkgay6": {
      "link": "/r/college/comments/raroml/do_you_enjoy_college/hnkgay6/",
      "text": "I like the learning, at least for my in major stuff. I don't like the whole assignment/test thing, but its a necessary evil unfortunately.",
      "author": "NinjaLorian",
      "created": 1638861421,
      "upvotes": 1,
      "replies": {}
    },
    "hnnf00j": {
      "link": "/r/college/comments/raroml/do_you_enjoy_college/hnnf00j/",
      "text": "I hate every minute of it, but it's something that I have to do for the career I want so I push through it.",
      "author": "needhelpne2020",
      "created": 1638917555,
      "upvotes": 1,
      "replies": {
        "hnng8n7": {
          "link": "/r/college/comments/raroml/do_you_enjoy_college/hnng8n7/",
          "text": "What was so bad about it?",
          "author": "hunt2destroy",
          "created": 1638918116,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnoslle": {
      "link": "/r/college/comments/raroml/do_you_enjoy_college/hnoslle/",
      "text": "I've never hated anything more in my entire life.",
      "author": "troyybanks",
      "created": 1638943683,
      "upvotes": 1,
      "replies": {
        "hnossjl": {
          "link": "/r/college/comments/raroml/do_you_enjoy_college/hnossjl/",
          "text": "Why so?",
          "author": "hunt2destroy",
          "created": 1638943827,
          "upvotes": 1,
          "replies": {
            "hnovxed": {
              "link": "/r/college/comments/raroml/do_you_enjoy_college/hnovxed/",
              "text": "Look at my last post",
              "author": "troyybanks",
              "created": 1638946233,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}