{
  "sid": "qbf893",
  "link": "/r/college/comments/qbf893/extreme_boredom_with_online_classes/",
  "title:": "Extreme boredom with online classes",
  "text": "Since I started college in 2020, I’ve only done online classes because of covid. I’m doing core and bba required classes that aren’t related to my field so I already don’t like the classes. I’m mostly always home and have to read a few chapters then do a quiz for each class which in itself is not hard or time consuming. By this time in the semester though I can’t barely stay focused at all and would rather do house chores or errands than read material I don’t care about. Is there anything I can do to help stay focused and avoid my careless attitude?",
  "author": "EthanGamerKingz",
  "created": 1634661202,
  "updated": 1634750289,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hh9bmnd": {
      "link": "/r/college/comments/qbf893/extreme_boredom_with_online_classes/hh9bmnd/",
      "text": "Tbh i dont have an answer for this and i suffer from the same issue. I care a lot about my studies but I can't stop moving around during online classes. I'll get up and start pacing or spin in my seat. I hate online classes so much cuz they just don't feel occupational at all.",
      "author": "Nihilistic_girlboss",
      "created": 1634665682,
      "upvotes": 3,
      "replies": {}
    },
    "hh9hfqi": {
      "link": "/r/college/comments/qbf893/extreme_boredom_with_online_classes/hh9hfqi/",
      "text": "i wish i knew how to answer this because i deal with the same thing. it’s so hard to stay focused and i get distracted very easily. the only benefit is learning at the comfort of your own home, but the experience can’t be the same for everyone. and it’s so draining staying home almost 24/7 and doing college work. online classes are a blessing and a curse",
      "author": "etherealpjm",
      "created": 1634667968,
      "upvotes": 1,
      "replies": {
        "hh9mksf": {
          "link": "/r/college/comments/qbf893/extreme_boredom_with_online_classes/hh9mksf/",
          "text": "Yeah I've also developed a bad habit of searching up test and quiz answers online even thought I 80% of the time am correct. Hopefully next semester I'll do in person classes so I can actually meet people and be more involved with the material cause it's nice being able to do everything at your own time but if you don't like the material it's not a good time.",
          "author": "EthanGamerKingz",
          "created": 1634669984,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}