{
  "sid": "r3rlo7",
  "link": "/r/college/comments/r3rlo7/how_do_i_get_rid_of_chronic_procrastination_and/",
  "title:": "How do I get rid of chronic procrastination and lack of focus",
  "text": "\nI’m a freshman at Emory University majoring in Finance and Data Science(known as QSS here). My friends are absolutely breezing through and crushing it. I’m struggling on midterms and have chronic procrastination and lack of focus. I’m good at setting my priorities straight in terms of not going for parties or hanging out socially. I’m on my own most of the day and barely ever party or hang out so it’s not like other things are distracting me. I barely have any friends on the contrary. However despite spending all my time “studying” I’m messing up and barely getting anything done. I’m sooo unproductive. I can sit somewhere for 9 hours and do like 1.5 hours worth of work. People on the outside think Im super polished because I speak well, am ambitious, and give off those vibes but Im really a mess. Im super stressed every day and I constantly mess things up. I literally breezed through high school. I had a 3.9 unweighted GPA and a 1530 SAT without ever studying. Here despite trying I might end the semester with an abysmal 3.35-3.4 GPA. How do I get rid of this chronic lack of focus and procrastination. I just can’t seem to get rid of it. I feel really bad for wasting my parents money and sending me here if I’m not going to get a desirable outcome. I also got rejected by all the clubs. I got rejected by 17 clubs wtf. Some of them were clubs I was president of in high school. I literally have nothing on my resume. The finals are what can kind of save me but I need a way to crack them. How do I break these bad habits and reform myself. My schedule is just going to keep on getting harder and im scared of the path I’m going on. Also my goal is to go into investment banking/consulting so my GPA is important.",
  "author": "Dazzling-Tax-3591",
  "created": 1638060609,
  "updated": 1638206788,
  "over_18": false,
  "upvotes": 48,
  "upvote_ratio": 1.0,
  "comments": {
    "hmcmav3": {
      "link": "/r/college/comments/r3rlo7/how_do_i_get_rid_of_chronic_procrastination_and/hmcmav3/",
      "text": "Do some root cause analysis: when you only get 1.5 hours of work done in a 9 hour period, what’s distracting you? \n\nAre you on your phone? Do you end up playing games on your computer? Do you do unrelated things like read Wikipedia? Do you get overwhelmed by the amount of work you do and freeze? Do you get stuck and zone out?\n\nOnce you figure out what the problem is, you can start removing any distracting factors. Phone helping you get sidetracked? Turn it off and put it in your backpack. Video games causing problems? There are programs you can install to block the use of certain programs during different times; better yet, uninstall them entirely during the semester to get yourself focused. \n\nIf it’s a situation of paralysis/being overwhelmed, break tasks into smaller tasks. I find making a checklist helps because normally, I have less to do than I think I do when I’m super stressed out. The checklist is also a motivating factor because I get to check stuff off :)\n\nMake sure you have a structured organizational system for your work so that you can stay on top of it. \n\nLastly, maybe part of the reason you’re struggling to get work done is because you’re sitting down for such long periods of time with no breaks, and it sounds like you’re not finding relief or relaxation in other places. \n\nMake sure you are spending time with your friends and going out so that you’re not only working all the time. That monotony will make you less productive (on top of being terrible for your well-being, of course). \n\nAnd working for hours and hours on end is unhelpful. Sit down with a discrete set of tasks that you want to complete and give yourself X hours (probably no more than 3 to start out). Break it up into 25 minute chunks—20 minutes work, 5 minutes break—and work like that. When you finish 3 sets, give yourself a longer break. This keeps you from getting too stuck in the work and refreshes your mind.",
      "author": "OrdinaryEra",
      "created": 1638065647,
      "upvotes": 24,
      "replies": {}
    },
    "hmcf9mg": {
      "link": "/r/college/comments/r3rlo7/how_do_i_get_rid_of_chronic_procrastination_and/hmcf9mg/",
      "text": "you need a fun, more entertaining way to study. explore options like studying with friends, using websites like quizlet, or just pretending to be a teacher teaching your material to an imaginary class. also try rewarding yourself after and during studying through food or a 5-10 minute break every hour you study. you’ve got this!",
      "author": "Significant-Strike-1",
      "created": 1638062314,
      "upvotes": 8,
      "replies": {}
    },
    "hmcy5k0": {
      "link": "/r/college/comments/r3rlo7/how_do_i_get_rid_of_chronic_procrastination_and/hmcy5k0/",
      "text": "By getting tested and treated for adhd if you have it.\n\nFor a long time, I’ve tried to battle my inattention issues through so many ways but no matter I was never able to really focus until I got my medical treatment",
      "author": "Nicofatpad",
      "created": 1638071521,
      "upvotes": 6,
      "replies": {
        "hmeq77l": {
          "link": "/r/college/comments/r3rlo7/how_do_i_get_rid_of_chronic_procrastination_and/hmeq77l/",
          "text": "I agree with this! I’m literally in the same boat and I was just diagnosed with ADHD about a month ago.",
          "author": "vividvibrantladybug",
          "created": 1638113321,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmd6bn5": {
      "link": "/r/college/comments/r3rlo7/how_do_i_get_rid_of_chronic_procrastination_and/hmd6bn5/",
      "text": "Honestly I've always had this problem. I'm getting tested for adhd. I haven't even considered doing that until looking at symptoms of other people with ADHD online and realizing that they sound like me.",
      "author": "I_AMA_Loser67",
      "created": 1638075910,
      "upvotes": 5,
      "replies": {}
    },
    "hmf3uju": {
      "link": "/r/college/comments/r3rlo7/how_do_i_get_rid_of_chronic_procrastination_and/hmf3uju/",
      "text": "Pomodoro timer helped me a lot",
      "author": "Johnkapler1890",
      "created": 1638119225,
      "upvotes": 2,
      "replies": {}
    }
  }
}