{
  "sid": "q6rcux",
  "link": "/r/college/comments/q6rcux/having_doubts_about_my_major/",
  "title:": "Having doubts about my major...",
  "text": "I'm considering a general bachelors degree or a for fun major at this point. I'm awful at math, so any other more prestigious degree I can't attain.\n\nCurrently I'm majoring in virtual technology & design, it's a \"new program\" and \"always evolving\". So far first semester VTD classes are garbage, learning nothing, my questions always come back with not sure or maybe. Reading the descriptions for classes down the line doesn't give me confidence.\n\nI've been considering a studio art and design degree, film degree, creative writing degree, etc. or just a general degree so I could do parts of all. Probably a general, with many minors. But is a general degree bad to have?\n\nI'm interested in creative jobs and working with animals, but no degree seems to fit or be very useful.",
  "author": "DrSkullface8899",
  "created": 1634059974,
  "updated": 1634082551,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hgduo9d": {
      "link": "/r/college/comments/q6rcux/having_doubts_about_my_major/hgduo9d/",
      "text": "You might be interested in digital marketing or graphic design. I studied graphic/web design but now I work in digital marketing and I love it! There's a lot you can do from creating strategies, updating websites, writing content, sometimes graphic design, and website analytics. There are tons of ways to niche down too. You can focus on SEO (search engine optimization), SEM (search engine marketing), social media marketing, email marketing, and content marketing. There might be others I'm missing but I feel like those are the main categories. Or you can be a generalist and just learn a little bit of everything. I love marketing because it's analytical but also lets me be creative too, and it's a technology-focused career. It might be worth checking out.   \n\n\nTbh I would recommend marketing over graphic design but that's just me. If you can draw, like branding, and mostly being creative then graphic design might work for you but I find that it's really competitive and hard to start out unless your portfolio is amazing.",
      "author": "Altruistic-Spinach-2",
      "created": 1634063222,
      "upvotes": 2,
      "replies": {}
    },
    "hge54vs": {
      "link": "/r/college/comments/q6rcux/having_doubts_about_my_major/hge54vs/",
      "text": ">But is a general degree bad to have?\n\nIt's not bad to have this in the sense that it will add value. But it is bad to spend a lot of money and time on it, since it will add a lot less value comparatively than many other degrees. For a lot of people it comes out to be a net-negative benefit once you factor in the four years given up and tuition cost. Even if it is net-positive benefit, there are still many options that will provide more benefit at the same cost.\n\nYou'll get much more value if you have a degree that is related to a career field. Focusing on a specific field is going to give you more direction with your value builders: projects, work experience, and networking efforts. A degree is a prerequisite for most office jobs, sure, but everyone applying already has one so it really comes down to all of the value builders. It doesn't really help to have a lot of very general experience or education, employers want to see stuff that is closely related to what their workplace is doing. Would you rather hire an accountant with a financial industry certification or a four year no-major degree?",
      "author": "darniforgotmypwd",
      "created": 1634067465,
      "upvotes": 2,
      "replies": {}
    }
  }
}