{
  "sid": "rbvdi1",
  "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/",
  "title:": "How do I ask a girl to be fwd?",
  "text": "I’m(m) a freshman in college rn and I do not have any experience with girls like at all but I have a large group of friends. Recently I’ve become kinda close with one of them and she asked if she could stay in my room for a week until the end of the semester, because she’s moving to a new dorm next semester and is moving her stuff a week early.\n\nIdk if I like want to date her but she’s been pretty like “close” to me I guess and I just want to do some stuff with someone I know.\n\nSo like what do I do? How do I approach about that sort of thing? Is it like weird to ask that sort of thing?",
  "author": "jamestar1122",
  "created": 1638981909,
  "updated": 1639517288,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.22,
  "comments": {
    "hnqo2tu": {
      "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnqo2tu/",
      "text": "I know its supposed to be fwb, but I still cant get over the picture of asking a girl to be a front wheel drive.",
      "author": "AHumbleLibertarian",
      "created": 1638984356,
      "upvotes": 15,
      "replies": {
        "hnrdtz4": {
          "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnrdtz4/",
          "text": "FWD doesn’t slide as much as RWD so maybe he wants to ask her to not slide into other guys DMs",
          "author": "GuYun14",
          "created": 1638994172,
          "upvotes": 3,
          "replies": {}
        },
        "hnulha0": {
          "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnulha0/",
          "text": "Doesn't fwd mean four wheel drive lol?",
          "author": "AsleepSoil7426",
          "created": 1639056798,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnqi1rm": {
      "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnqi1rm/",
      "text": "Here for the comments.",
      "author": "balleditmoreravens",
      "created": 1638982042,
      "upvotes": 11,
      "replies": {}
    },
    "hnqq51w": {
      "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnqq51w/",
      "text": "Nah just let it happen naturally don't ask",
      "author": "elkfn2",
      "created": 1638985152,
      "upvotes": 7,
      "replies": {}
    },
    "hnqxvjb": {
      "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnqxvjb/",
      "text": "Y’all will be living in the same room. If there is something there, some shit’s going down. Just don’t be uncomfortable or at least outwardly show your discomfort",
      "author": "CaprioPeter",
      "created": 1638988090,
      "upvotes": 7,
      "replies": {}
    },
    "hnqq8zh": {
      "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnqq8zh/",
      "text": "dude really fucking stupid of you asking this question on reddit of all places. You're the only one who knows the answer to this. You've known her for a while, you're supposed to have a general idea of her perspective on stuff like this. Also, it might ruin the relationship you already have if you tell her you want to have casual sex with no actual commitment. Sure, she might be into that but what makes you think a redditor can help you out lmao",
      "author": null,
      "created": 1638985194,
      "upvotes": 14,
      "replies": {}
    },
    "hnrafcy": {
      "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnrafcy/",
      "text": "You can, but understand that you’re risking your relationship with her. She may find it awkward or even offensive. I would do it after she moved out of your room so she doesn’t feel uncomfortable sleeping near you. Is it worth the less desirable outcome? \n\nIf you want some girl’s perspective, I’ve had one guy ask me that. I mean, I surprisingly wasn’t creeped out or offended, a part of me kinda appreciated his honesty (I guess?) and asking for my consent. I said no and felt awkward around him for a while, but I didn’t flip out. Tho I guess I’m the minority of girls here in this situation that doesn’t expect guys to be able to read my mind and may have to outright ask me things, and yeah most other girls might flip out and think less of you. I’d be careful about it, or at least wait until after she moves out of your room. Just keep in mind that you’re risking your relationship with her if you do ask her. And if she says no, respect that, as in don’t keep asking her.",
      "author": "Person9183736",
      "created": 1638992869,
      "upvotes": 2,
      "replies": {}
    },
    "hnqslaf": {
      "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnqslaf/",
      "text": "Don’t ask anything, just let it happen. Also if she starts rubbin against you that’s usually the sign she’s in heat and you’re good to go.",
      "author": "jeremyfromjewel",
      "created": 1638986076,
      "upvotes": 2,
      "replies": {
        "hnqxqdy": {
          "link": "/r/college/comments/rbvdi1/how_do_i_ask_a_girl_to_be_fwd/hnqxqdy/",
          "text": "This comment is the epitome of Reddit advice",
          "author": "CaprioPeter",
          "created": 1638988036,
          "upvotes": 10,
          "replies": {}
        }
      }
    }
  }
}