{
  "sid": "q7d2me",
  "link": "/r/college/comments/q7d2me/does_anyone_else_wait_to_watch_lecturesslides/",
  "title:": "Does anyone else wait to watch lectures/slides because you can't retain anything without having an assignment in front of you?",
  "text": "If I were to just watch a 1-2 hour lecture that goes through 100+ slides, I'm not going to understand shit. Not to mention that 90% of that stuff won't be on an assignment or test, so from a practical POV I don't *need* to understand a lot of it. But if I have an assignment in front of me asking X, then I can search through the lecture and slides looking for things that will help me solve X, and in that way I actually understand what I'm doing and how to do it.\n\nIt's frustrating because it would obviously be preferable to actually understand all the material, but I just have no idea how to comprehend such a fat load of information without any way to apply it right away (i.e. 95% information, 5% examples)\n\nI guess you could call it lecture bloat, and it sucks",
  "author": "Missing_Back",
  "created": 1634137334,
  "updated": 1634590221,
  "over_18": false,
  "upvotes": 28,
  "upvote_ratio": 1.0,
  "comments": {
    "hgihni1": {
      "link": "/r/college/comments/q7d2me/does_anyone_else_wait_to_watch_lecturesslides/hgihni1/",
      "text": "I think those kinds of courses just demand a different studying approach. I hear you on the lecture bloat, I've got a class like that. \n\nThese courses always have hard exams too because it's mostly just remembering things. With all those slides, the professor is making questions for the exam from them. My course is like this, the first exam was an average of a 60% then she added a 10% curve to bring it up. I scored a 78.5%. \n\nFrom here, I've completely changed my strategy. Before, I was filling in the professors skeleton notes then going back and studying them. What I've done is stopped filling out her skeleton notes and focusing on writing questions for what she's pointing out. \n\nIf she writes down that Stainless Steel is made with at least 12% Chromium, I just formulate that straight into the question \" Stainless steel contains at least what % Chromium?\". Simple shit like that. \n\nThen I use a flashcard program to make them into flashcards. Then I sit down and run through them until I can remember them. Now I am a giant fleshy bank of facts about Materials. I understand quite a bit of it simply because I can remember the details.",
      "author": "Awkward_Mail_2786",
      "created": 1634149185,
      "upvotes": 5,
      "replies": {}
    },
    "hghwxy6": {
      "link": "/r/college/comments/q7d2me/does_anyone_else_wait_to_watch_lecturesslides/hghwxy6/",
      "text": "This is my struggle, I don’t really consume anything in a lecture. At the same time, it’s takes longer to learn because I have to teach myself from scratch afterwards",
      "author": "Casual-Economist",
      "created": 1634140959,
      "upvotes": 1,
      "replies": {}
    },
    "hglurrl": {
      "link": "/r/college/comments/q7d2me/does_anyone_else_wait_to_watch_lecturesslides/hglurrl/",
      "text": "Totally! I got all power points saved to my desktop on my laptop for quick reference lol.",
      "author": "VoiceofReason541",
      "created": 1634216874,
      "upvotes": 1,
      "replies": {}
    }
  }
}