{
  "sid": "qxryv1",
  "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/",
  "title:": "Thoughts on willingly not doing assignments?",
  "text": "Hi all. I am a second year here, almost done with my semester like everyone yay!!! So I am in two classes right now as my school does classes by quarters instead of semesters, so first quarter did two classes, this quarter two. Anyway, in one of my classes, I had like a 96% so I decided not to do an entire week of work, brought my grade down to a B, not a big deal as it will be an A at the end again. Anyway, right now another one of my classes is a 92% right now, done every assignment, 100% on all quizzes and lots of praise for the writings I have done. I have an assignment due tonight and I just have had zero energy to do it and zeor motivation. That season burn out is kicking in hardcore sadly. I do not plan to do it tonight and I am curious if you guys do any of that? I always feel kind of bad and guilty like a bad student to willingly let my grade drop because I am too tired and burnt out.",
  "author": "KingBlackthorn1",
  "created": 1637363267,
  "updated": 1637689541,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hlchxag": {
      "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlchxag/",
      "text": "Faculty here.  If you don't want to do an assignment, then don't do.  The professor certainly isn't going to spend time tracking you down to force you to do it.  But, you have to be willing to accept the consequences of your decision, which as you know will be to get a zero.  If you are fine with that and your lowered grade, then I don't think your professor is going to lose much sleep over the issue.  \n\nHowever, let me assure you that you're not the first student in history to come up with this plan, and let me warn you that it can *and does* backfire from time to time.  Students will skip one or more assignments that they don't feel like doing, and their grade will fall accordingly.  Then, later in the semester, something will *unexpectedly* go wrong - they bomb an exam they thought they would do well on, they get a bad grade on a paper, they have a bad team for a group project and receive a low grade, etc., and so their final grade in the class ends up being substantially lower than planned.  If that happens, I can guarantee that you won't get any special consideration or sympathy from a professor who can plainly see that you didn't take advantage of all the points that were offered over the semester by submitting all of the assigned work.  So, if you're willing to live with this possibility, then do or don't do assignments however you see fit.  But if you choose to skip some of the work and then later things blow up in your face, remember where the responsibility for the situation truly lies.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1637380444,
      "upvotes": 7,
      "replies": {
        "hlewv59": {
          "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlewv59/",
          "text": "To add to this: Calculate the minimum grade you'll graduate with. This is the grade you'll get if you get a zero on every assignment, test, etc. from here on out. If this grade is acceptable to you, then by all means, don't do the assignments.",
          "author": "Comprehensive-Ad3963",
          "created": 1637433307,
          "upvotes": 1,
          "replies": {
            "hleygrk": {
              "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hleygrk/",
              "text": "With the extra caveat that sometimes, regardless of your numerical grade, a class requires you to complete a certain percentage of assignments or has a requirement that you take all the tests including the final, or something like that.",
              "author": "ChemMJW",
              "created": 1637433976,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlbwtle": {
      "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlbwtle/",
      "text": "Rarely. \n\nI have a class where most of the assignments are online and take about 15 minutes to complete at best. There was an assignment that wanted me to attend an hour long lecture about ethics in business that gave the same amount of points as the online assignments. \n\nI did not do that.",
      "author": "BrownRiceBandit",
      "created": 1637370053,
      "upvotes": 5,
      "replies": {
        "hlbyrwi": {
          "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlbyrwi/",
          "text": "Oh yea quick and easy assignments I always complete. I normally always complete mine. This class I am skipping over right now I have never missed one of his assignments. They each take me like an hour, in this rare case this one would take probably two. The other class I have this quarter though… It’s like 3 hours per assignment and I have two a week that is why I skipped a full week of it lol. I always do them now though.",
          "author": "KingBlackthorn1",
          "created": 1637370939,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlca6pu": {
      "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlca6pu/",
      "text": "Sometimes to just have to be kind to yourself and prioritise other things. I had this obsession with completing every little assignment in my English class last semester, to maintain 100%. But along with my health and other classes, I realised that it's not always possible. And although it might be a bit guilt-inducing to skip one (I felt like I was disappointing my professor by not submitting it, since they always complimented my work) I decided to start skipping the ones with fewer points where I could get away with it and not lower my grade. I figured I had enough extra credit points to make up for it anyway. My example is a little extreme, but the point is that even if your grade fluctuates greatly throughout the semester, if you can manage a good grade that you're happy with at the end, that's all that matters.",
      "author": "NoDryHands",
      "created": 1637376374,
      "upvotes": 3,
      "replies": {}
    },
    "hlcmenz": {
      "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlcmenz/",
      "text": "One of the things I learned about college is that it is so much easier if you skip NOTHING. Turning everything in is super important. Missing assignments because I can is not a habit I would want to get into.",
      "author": "SlammedKraanium",
      "created": 1637382951,
      "upvotes": 2,
      "replies": {}
    },
    "hlciif6": {
      "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlciif6/",
      "text": "i never did it in high school because percentage mattered then but now if i have a lot of work and a 97% in a class where the cut off it for an A is 93% then i just dont do it. like it's the end of the semester, finals are coming up, something has to give and a low A is still an A",
      "author": "EdelwoodOil",
      "created": 1637380765,
      "upvotes": 1,
      "replies": {}
    },
    "hlf7w5s": {
      "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlf7w5s/",
      "text": "There is an assignment where I have to stand up and record myself in business attire. I really don't want to do it, I'm sure you can understand why, and I calculated the grade I would get if I didn't and I would still get a B. Any thoughts on that?",
      "author": "Smite2601",
      "created": 1637438067,
      "upvotes": 1,
      "replies": {}
    },
    "hlf81uu": {
      "link": "/r/college/comments/qxryv1/thoughts_on_willingly_not_doing_assignments/hlf81uu/",
      "text": "Don't skip assignments \n\n\n\n\nI was like you my first semester and stopped doing work and 2 of my courses went from a B to a C and fucked me up",
      "author": "elkfn2",
      "created": 1637438137,
      "upvotes": 1,
      "replies": {}
    }
  }
}