{
  "sid": "csh8ef",
  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/",
  "title:": "Alcohol - thoughts on staying alive",
  "text": "In the freshman question megathread, a redditor asked what I found to be a disturbing yet common question:\n\n>Got drunk for the first time on day 2, spent the rest of the night (read: right now) vomiting my brains out  \n>  \n>How do I like, not do this next time  \n>  \n>I suppose the obvious answer is \"just don't drink as much\" but now that that's covered I'm open to other ideas\n\nBelow is my answer to that redditor.  Please add any safety tips that you have regarding responsible use of alcohol.\n\n>Welcome to your first (and hopefully only) bout of alcohol poisoning. That shit is deadly.  \n>  \n>**DO NOT DRINK SO MUCH.**  \n>  \n>First of all, if you're underage, don't drink. I have to say that, it's a sub rule to not engage in or advocate for illegal behavior.  \n>  \n>Second of all, assuming you are of age, control your consumption. That means a few things:  \n>  \n>1. Know how many drinks are in your cup. A filled 16 oz solo cup is 1.25 beers, 4 wines, and a deathsentence of liquor.  \n>  \n>2. Know that your body can only process 1 drink per hour. A drink is a beer, a glass of wine, or an ounce of liquor. *Pace yourself.*  \n>  \n>3. Keep track of how many drinks you've had and over what period of time. Look at your phone when you start drinking, else you'll have no idea when you started. Look at it every time you get a new drink, else you'll have no idea how much time has gone by. *Pace yourself.* **IF YOU CAN'T REMEMBER HOW MANY DRINKS YOU'VE HAD, YOU'VE HAD TOO MANY AND IT'S TIME TO STOP.**  \n>  \n>4. The feeling of inebriation is, in my experience, a delayed effect. By the time you feel buzzed, if you're still drinking, you're going to get drunk. By the time you get drunk, if you're still drinking, you're going to get sick. *Pace yourself.*  \n>  \n>5. When you've had enough, and someone offers you another, for the love of God **SAY NO THANK YOU**. If you have to walk away from a game of beer pong, so be it. *Pace yourself.*  \n>  \n>2,000 college students will probably die from alcohol this year. That's twice as many people as get shot dead by police every year. This is no fucking joke. Take care of yourselves.",
  "author": "ecklesweb",
  "created": 1566222074,
  "over_18": false,
  "upvotes": 871,
  "upvote_ratio": 0.99,
  "comments": {
    "ey5h20l": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/ey5h20l/",
      "text": "[removed]",
      "author": null,
      "created": 1566831463,
      "upvotes": 1,
      "replies": {
        "ey5qicg": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/ey5qicg/",
          "text": "removing this because it sounds dubious and potentially harmful.  If you have a good reliable source, please feel free to repost.",
          "author": "ecklesweb",
          "created": 1566837977,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "exhff9i": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exhff9i/",
      "text": "and i have to say this, i drink a ton, i have friends that drink a ton, a little and dont drink at all, none of those people will ruin a party, but the guy that drinks a few too many will do... it may not be in a bad way, but you will get people worried, or it may be in a bad way and you can leave a pretty bad impresion, so drink to your pace, drink what you think you can handle, dont drink to someone elses expectations...",
      "author": "carlos_6m",
      "created": 1566303578,
      "upvotes": 1,
      "replies": {}
    },
    "exhf76l": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exhf76l/",
      "text": "There is a really easy rule to get to the ''funny'' stage of drinking and to not progress to the ''imgonnadie'' stage\n\nDrink slowly, and by this i dont mean drink like you are a sloth, just drink a beer like you would normally do, drink it, not chug it, enjoy your drink, if you know you have low tolerance, make 3 mixed drinks with less alcohol instead of making two pretty loaded, you will enjoy them more, eat a bit, chat, smoke a cigarette, play something or flirth with someone here and there between drinks that way you wont go for one drink after the other and pass the exit to funny town and end up on shitfaced trail, heading to puke town",
      "author": "carlos_6m",
      "created": 1566303381,
      "upvotes": 1,
      "replies": {}
    },
    "exh9eah": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh9eah/",
      "text": "There are 3 golden rules I follow and they generally keep hangovers away:\n1) Don't drink empty stomach.\n2) Keep drinking water between each drink.\n3) Do not 'pass out' and try to stay upright and awake for as long as possible after your last drink. Even lying down is going to make you sleepy.",
      "author": "Psychomonkey101",
      "created": 1566297605,
      "upvotes": 1,
      "replies": {}
    },
    "exh51ch": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh51ch/",
      "text": "Abstaining from drinking completely or at least severely limiting alcohol intake would solve this problem entirely. \n\nWhy do college students think its necessary to binge drink all the time? All it does is mess with your health and cognition, you do and say dumb shit that you regret or even worse put other peoples and your own lives in danger. You waste tons of money. I’ve never met a college-aged student who was also successful and responsible with their life as well as managing a crazy party-lifestyle.",
      "author": "khaleesi_onthatbeat",
      "created": 1566291621,
      "upvotes": 1,
      "replies": {}
    },
    "exh2r0m": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh2r0m/",
      "text": "Please do not drink (or at least drink very very very little) if you've had a concussion in the past six months. I can't speak for anyone but myself but I blacked out so much faster and easier (to the point that my normal buzz was black out) and everytime I came to I was having major panic attacks and pissing myself. That wasn't everytime I drank but three times coming to collapsing and screaming is three too many. I don't remember what caused the third one but the second one was because I was too drunk to feed and the first one was because someone that was keeping me safe touched my back because I was an idiot running away at dawn while absolutely trashed. Other times I've had injuries from concussion drunk (I still have scars on my feet because I couldn't feel my injuries happening.)",
      "author": "artsyChaos",
      "created": 1566288104,
      "upvotes": 1,
      "replies": {}
    },
    "exgx4kv": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgx4kv/",
      "text": "Eat!!!\n\nYou need to eat before and while you are having alcohol.Your best bet is to eat something rich in protein, and to avoid anything that will cause you to bloat. Some good sources of protein includes eggs, yogurt, and even jerky, among many others.\n\nSources:\n\nhttps://www.healthline.com/nutrition/best-foods-to-eat-before-drinking#section1\n\nhttps://www.healthline.com/nutrition/healthy-high-protein-snacks#section9",
      "author": null,
      "created": 1566279413,
      "upvotes": 2,
      "replies": {}
    },
    "exgwedb": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgwedb/",
      "text": "1. Never drink on an empty stomach. If you haven't eaten in a while, just stuff your face with as many carbs as possible.\n\n2. Drink lots of water. Keeping up with one cup of water per drink is hard, so just make sure to have a glass of water with you if you're in a private setting or take a break every couple songs to grab water in a party setting.\n\n3. Know how to calculate drinks. One drink is defined as 0.5 oz of pure alcohol. To calculate the amount of drinks you are having, just multiply total oz by % alcohol. Of course, this is imprecise when drinking out of cups, so if you're making mixed drinks just measure with shots. Shots are generally a drink, and the same with a 12 oz beer. My calculations are just for larger drinks like FourLoko or hard cider.\n\n4. Learn your limit. The first few times you drink, set a hard limit on number of drinks, erring on the side of caution. Stick to it for the night. Then, if you decide at the end of the night you didn't get drunk enough, increase that limit for next time.\n\n5. Help your friends and get help from your friends. Ask them how much they've had to drink, calculate how much is in a drink you give them, etc. If you're talking about how much you've had, you remember it better. That's I disagree with the common advice of \"don't talk about how much you've had to drink that's dumb freshman behavior\". If it helps you keep track of how much you've drank and how drunk you are, it's keeping you safe and that's a great topic of conversation.",
      "author": "Quantum_Aurora",
      "created": 1566278361,
      "upvotes": 1,
      "replies": {}
    },
    "exgplrd": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgplrd/",
      "text": "Hot tubs will literally kill you. They dehydrate you like a southern August mid day. Do not drink and be in a hot tub. You are seriously putting your life at risk. I know someone who had two budweisers over two hours in a hot tub and they had to be taken home in a wheel barrel because they were so drunk. Hot tubs man, don't do it.",
      "author": "Bigfoot722",
      "created": 1566270676,
      "upvotes": 1,
      "replies": {}
    },
    "exgmt1m": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgmt1m/",
      "text": "Take all the foods you wouldn’t usually eat for health conscious reasons, then eat that. While you’re drinking, eat more. The next morning, eat again. There is a stupid amount of calories in alcohol so just go all out and eat a weeks worth of carb loaded junk\n\nOf course I have no credibility. I stopped drinking last October because alcohol makes me break out in handcuffs. Until last month, where I got blackout drunk for the first time in my life and was horribly insanely sick the next day.",
      "author": "Garet50",
      "created": 1566268191,
      "upvotes": 1,
      "replies": {}
    },
    "exgfr0u": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgfr0u/",
      "text": "Ive never been out much but the few times I have been at college bars, really if you don't want to drink, you don't need to. Most people will notice unless the people you go with really care much.",
      "author": "MementoMori511",
      "created": 1566262913,
      "upvotes": 1,
      "replies": {}
    },
    "exgdc9u": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgdc9u/",
      "text": "Witnessed a freshman last night who looked fine but was pounding them down, everyone told her to chill but she insisted and looked fine so it was whatever, she ended up blacking out and throwing up everywhere of course. Not the best way to spend your first night at college",
      "author": "knipdaddy",
      "created": 1566261166,
      "upvotes": 1,
      "replies": {}
    },
    "exgda24": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgda24/",
      "text": "Drink water in between your drinks and DO NOT mix your alcohols. If you start with vodka, continue with vodka, etc. Also, it's inevitable that you're going to be THAT sick every time if you drink in excess. Don't underestimate the dangers of alcohol. Just because it's legal doesn't mean that it's super safe or won't kill you. It's really the best to just NOT drink so much. Pace yourself and be careful with shots...etc.",
      "author": "Urban_pixie",
      "created": 1566261121,
      "upvotes": 1,
      "replies": {}
    },
    "exgapea": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgapea/",
      "text": "As you get older you tend to realize how much your body should drink. I blacked out twice when I was 19. Now at 24 I haven't even been drunk since then.",
      "author": "conker1264",
      "created": 1566259276,
      "upvotes": 1,
      "replies": {}
    },
    "exg7flf": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg7flf/",
      "text": "Advice often overlooked:\n\nIT IS PERFECTLY OKAY TO NOT GO TO A PARTY WITH BOOZE.  IT IS PERFECTLY OKAY TO WALK AWAY FROM A PARTY WHEN YOU GET THERE AND REALIZE THERE IS BOOZE THERE AND YOU DID NOT INTEND TO DRINK.  IT IS PERFECTLY OKAY TO SAY NO TO BOOZE.  IT IS PERFECTLY OKAY TO WALK AWAY FROM A PARTY WHEN YOU ARE SAYING NO TO BOOZE DO NOT WANT TO DRINK/FEEL LIKE YOU ARE AT YOUR LIMIT AND OTHERS ARE TRYING TO EGG YOU ON TO DRINK MORE THAN YOU WANT TO.\n\nNO IS A BEAUTIFUL WORD.  NO IS A WONDERFUL WORD.  NO IS AN OKAY WORD TO USE.",
      "author": "soup_2_nuts",
      "created": 1566257156,
      "upvotes": 1,
      "replies": {}
    },
    "exg7dr4": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg7dr4/",
      "text": "I always tally the amount of shots on my hand/arm and if I make a mixy I will measure the liquor with a shot glass so I know how much I’m drinking. I’ve been going to parties and drinking for like 4 years now so I know what my tolerance is and how much I should have and where to cut myself off. Also if you have the time, try to space out each shot by 20 minutes because that’s about how long it’ll take for you to notice the effects. And don’t listen to anyone trying to get you to drink more than you’re comfortable. Chances are they’re wicked drunk and will forget that you even declined their offer. Hope this helps!",
      "author": "olivialeclerc3",
      "created": 1566257123,
      "upvotes": 1,
      "replies": {}
    },
    "exg5xco": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg5xco/",
      "text": "I just stay away from that poison in general, but that’s just me.",
      "author": "GeturSkillUP",
      "created": 1566256208,
      "upvotes": 0,
      "replies": {
        "exg78ww": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg78ww/",
          "text": "You’re not making a bad choice.",
          "author": "ecklesweb",
          "created": 1566257038,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "exg5k61": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg5k61/",
      "text": "1) don't drink on an empty stomach\n2) drink water with your alcoholic beverages\n3) keep tabs on your friends and likewise\n4) ALWAYS keep your drink IN YOUR HAND\n5) know the time you began to drink and start a timer on your phone for an allotted time.\n6) pay in cash so you aren't tempted to use your card and buy more drinks\n7) smoking dank buds and drinking WILL intensify your booze buzz.\n8 ) ALWAYS HAVE A SOBER FRIEND or TWO IN THE CLIQUE. This is important for alcohol moderation, fist fights. Most importantly it prevents people from taking advantage of those who are not as directed as you.\n\nIf you find yourself or your friends neglecting their studies and going ham on the drinking DO SOMETHING ABOUT IT. Alcoholism sucks and will fuck your life up in all levels imaginable. Don't be the one riding around on a scooter with a Cuban link chain and black shirt in East Chicago. It ain't a good look. \n\nIf you can't prevent what your friends will do, encourage to seek professional help and if it does not work, move forward.\n\nBe safe, make sure your homies are safe. Be the one to take the lead.",
      "author": null,
      "created": 1566255972,
      "upvotes": 1,
      "replies": {}
    },
    "exg2bg5": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg2bg5/",
      "text": "The last thing you drink should always be a Gatorade. Also drink half as much as you think you should. If you have zero tolerance, a little goes a long way.",
      "author": "Graggle1",
      "created": 1566253857,
      "upvotes": 1,
      "replies": {}
    },
    "exg1zjh": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg1zjh/",
      "text": "This thread has a ton of insanely important advice. It should be pinned to the top of the sub.",
      "author": "MythicalWhistle",
      "created": 1566253634,
      "upvotes": 1,
      "replies": {}
    },
    "exg1o6b": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg1o6b/",
      "text": "I just keep brown food coloring in my pocket and squeeze a few drops in my solo cup filled with water. People at parties always ask me why I'm drinking water with brown food coloring and I always say \"Because it's sterile and I like the taste.\"",
      "author": "Nullveer",
      "created": 1566253427,
      "upvotes": 1,
      "replies": {}
    },
    "exg03s3": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg03s3/",
      "text": "Take a pause every so often, if you feel yourself starting to slip and get hammered just take a break for a little while until you sober up, water helps as well",
      "author": "buck1900",
      "created": 1566252373,
      "upvotes": 1,
      "replies": {}
    },
    "exfzxxc": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfzxxc/",
      "text": "Get plenty of sleep the night before and after. If you know you’re going to go out for a tailgate Saturday, or if a bar has a college night on thursdays, plan your schedule so you get at least 8 hours of sleep. You should always eat with alcohol and not drink beyond your means, but as far as truly preparing, sleep is important.",
      "author": "00clark30",
      "created": 1566252263,
      "upvotes": 3,
      "replies": {}
    },
    "exfz11r": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfz11r/",
      "text": "Never, EVER drink if you're on medication.  For a boring introvert like myself, seizure meds are a godsend.  They are a way out of any party and I know who I can count on and who will endanger lives to try to get laid.  This information will help prevent your friends from getting raped or in the hospital!\n\n&#x200B;\n\nAnother option I did before I got on meds.  Pretend.  Bring Gatorade, or water bottles and fill up that solo cup.  Your drunk friends will still think you're partying if you say stuff like \"you can't handle this drink\" or (if it's Gatorade) \"OMG, this is getting me so thrashed, you should try this too!\" The \"hardcore\" people will drink up.\n\n&#x200B;\n\nOnce people thought I was a drug dealer because my \"meds\" worked so well.  It was Midol.  People wanted to give me $5/pill for it (\"discounted\" friend rate).  Play up to what people want to hear.",
      "author": "squeaktoy_la",
      "created": 1566251658,
      "upvotes": 2,
      "replies": {}
    },
    "exfy2hq": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfy2hq/",
      "text": "This might get buried, but when you mix drinks, mix them with non-diet sodas like regular Coke or Pepsi. The sugar will help your body break down the alchohol faster. \nWhen you go to bed after a night of drinking, even if you're on a blow-up mattress, swing a leg over the side, it will help keep the room from spinning. Also, you can sleep against a wall to get the same effect. \nEat while you drink, it will keep you from taking to many drinks at once.\n\nAlways drink with a friend, and know your limit.\nAlways be honest with yourself. If you begin to drink to much to often, it might be a good idea to talk to someone about it. College is a very stressful time for some, and alcohol doesn't really help with decision making. If you see this in others, talk to them about it.",
      "author": "Ajax_Telamonian",
      "created": 1566251020,
      "upvotes": 1,
      "replies": {
        "exgjutu": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgjutu/",
          "text": "> mix them with non-diet sodas like regular Coke or Pepsi. The sugar will help your body break down the alchohol faster\n\nThis also gets you drunk faster. So take this advice with some caution.",
          "author": "ConSave21",
          "created": 1566265954,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "exfvtyf": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfvtyf/",
      "text": "Everyone here is giving advice from the perspective of harm reduction, and that’s awesome. However, the way I interpreted the question was more “I already decided I’m going to drink a lot, how can I do it and not get sick?” I’m here to answer that question. Source: was an alcoholic through college, am more or less recovered but still drink socially. I’m just going to write these out as bullet points because I don’t want to write a novel.\n\n- don’t put yourself in a position where you will need to drive anywhere. Have a DD, an Uber, a bike even (still illegal btw, but way safer than a car) or SOMETHING. Alcohol can ruin your life on its own, but not quite as quickly as a DUI can. Please don’t get one.\n\n- eat before you drink. Not right before though. Eat, digest, drink\n\n- find a drink you like that sits well with you and stick with it. I’m a big fan of whisky and beer - specifically Coors light. I know exactly how a large amount of Coors light makes my stomach feel, and I know I’ll be able to handle it. Even if it’s Coors banquet instead of Coors light I know I need to be more mindful. Turn down the shot of tequila...unless that’s somehow your drink. In which case idk if I can help you.\n\n- drink a ton of water. Fuck all the “don’t break the seal” nonsense. be ready to piss constantly - it’s just the way she goes. I try to keep my piss as close to clear as possible. If it’s dark, I know I need to chug more water\n\n- set yourself up for hangover success. Brush your teeth, pour yourself a glass of water and leave it on your nightstand, etc. I know you will forget this sometimes, I still do occasionally, but part of the reason I stopped drinking so much is because I was sick of wasting days being hungover. Now I’ve realized that you can still get drunk and have a productive Sunday for example, you just have to prepare for it.\n\n- don’t turn it into a competition. Nobody cares how many beers you can drink. Conversely, don’t count other people’s drinks (unless you have a reason to believe they’re going to hurt themselves or someone else). It’s generally not nice. Everyone has different tolerances. Don’t brag the next day about how much you had to drink the night before. It’s not cool, and nobody cares.",
      "author": "neverq",
      "created": 1566249524,
      "upvotes": 1,
      "replies": {}
    },
    "exftsn2": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exftsn2/",
      "text": "Turned 21 not too long ago so this was helpful haha. Although I’m probably going to just try disaronno amaretto with ice cream",
      "author": "bing-no",
      "created": 1566248211,
      "upvotes": 1,
      "replies": {}
    },
    "exfsrsc": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfsrsc/",
      "text": "It’s really about having the maturity to pace yourself and deny drinks when you’re starting to feel out of control. Try not to get drunk, but rather maintain a good buzz throughout the night. Your body and mind will thank you later.",
      "author": "SrgtDoakes",
      "created": 1566247578,
      "upvotes": 1,
      "replies": {}
    },
    "exfs1dh": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfs1dh/",
      "text": "If you don’t want to drink, but want to go to the party, go to Sonic/McDonalds/etc and get a large drink. Just bring that to the party and people will think there’s alcohol in it already. People always spiked their sonic slushes when I was in school. One girl sipped my drink and thought there was alcohol in it lol.",
      "author": "chainsawcal87",
      "created": 1566247128,
      "upvotes": 7,
      "replies": {}
    },
    "exfprfe": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfprfe/",
      "text": "First, just don't binge drink. It's way more enjoyable to get a little buzz from a couple craft beers than it is to get schwasted by pounding PBR all night.\n\nSecond, if you are going to drink a lot, plan ahead. Figure out where you're going to sleep, don't drive, drink water, and pace yourself. You don't want to be that guy at the party who got hammered without a plan so everyone else has to take care of you.\n\nThird, learn about percent ABV (alcohol by volume) and \"proofs\".\n\n- The **cheap beers** are about **4%** ABV. Think PBR, High Life, Budweiser.\n\n- A **strong beer** is about **8%** ABV. That's _double_ the amount of alcohol. Think IPAs or stouts.\n\n- **Wine** is usually around **12%** ABV. That's _triple_ the alcohol of cheap beer.\n\n- **Liquors** are measured in \"proofs\" where **1 proof is 0.5% ABV**. So a 40 proof Bourbon is 20% ABV, a 100 proof Tequila is 50% ABV, and Bacardi 151 is 75% ABV. When in doubt, assume 100 proof or 50% ABV.\n\nTo figure out how much alcohol you're consuming, multiply the percent ABV by the volume. So 1 pint (16 ounces) of a 4% beer is 0.64 ounces of alcohol.\n\nThe \"1 drink per hour\" rule that OP gives is over simplified, though easy to remember. It might be better to say \"1 ounce of alcohol per hour\".",
      "author": "cbarrick",
      "created": 1566245778,
      "upvotes": 1,
      "replies": {}
    },
    "exfour9": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfour9/",
      "text": "Also don't avoid calling an ambulance if someone is literally puking up blood or passed out and not responding. Having to take a drinking reflection class because the university found out is a lot better than if the person died and they found out you did nothing.\n\nIn most cases schools have developed policies for this case. Students that are doing something illegal and need medical help for themselves or a friend will be given far lesser consequences than typical. They are doing this because many students are afraid to seek medical help due to fear of suspension.",
      "author": null,
      "created": 1566245250,
      "upvotes": 3,
      "replies": {}
    },
    "exfogjm": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfogjm/",
      "text": "Drink a lot of water. \n\nDont test how much you can drink.\n\nDont have drinking contests with your friends.\n\nHaving alcohol poisoning is NOT fun WHATSOEVER. You WILL regret drinking that much.",
      "author": "thenomadcat",
      "created": 1566245005,
      "upvotes": 3,
      "replies": {}
    },
    "exfnlyv": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfnlyv/",
      "text": "Also- make sure you’re eating! Carbs are a great way to balance alcohol. It helps absorb some of the alcohol.",
      "author": "jessica-grooms",
      "created": 1566244476,
      "upvotes": 1,
      "replies": {}
    },
    "exfnkks": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfnkks/",
      "text": "This really doesn't pertain to the user themselves, but if you're a bystander and see someone on their back, passed out, please roll them on their side. I just lost a childhood friend of mine last week because he choked on his own vomit.",
      "author": "NoChannel1",
      "created": 1566244451,
      "upvotes": 32,
      "replies": {
        "exfstl6": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfstl6/",
          "text": "Yes!! Please know how to put someone in a rescue/recovery position. It isn’t hard and it may very well save their life.\n\n\nhttps://en.wikipedia.org/wiki/Recovery_position",
          "author": "SirensToGo",
          "created": 1566247608,
          "upvotes": 9,
          "replies": {
            "exh22e3": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh22e3/",
              "text": "This! And don't be afraid to ask for help if you feel like you're about to pass out!",
              "author": "artsyChaos",
              "created": 1566287047,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "exggnjt": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exggnjt/",
          "text": "My sister boyfriend died this way. Please don’t feel embarrassed to go check on someone, it may save their life.",
          "author": "oldGilGuderson",
          "created": 1566263578,
          "upvotes": 3,
          "replies": {}
        },
        "exifav3": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exifav3/",
          "text": "A backpack full of books is another potentially lifesaving tip. Prevents them from rolling back over",
          "author": "RedditYankee",
          "created": 1566327138,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "exfn4xg": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfn4xg/",
      "text": "Don't drink too much at once. Pace yourself.",
      "author": null,
      "created": 1566244184,
      "upvotes": 3,
      "replies": {}
    },
    "exfmf85": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfmf85/",
      "text": "PLEASE DO NOT BE LIKE ME! BIG WARNING POST INCOMING.\n\n\nMy 18th birthday, ritualistic partying at the nascar races. I drank a combined amount of one bottle of water in a little over a 48 hour period. My main course -? A 30 rack and a full bottle of captains and heavy cocaine use to keep me coherent. I wake up the day after feeling like a truck ran through me. This was not an ordinary hangover, I was severely dehydrated due to the drugs and mostly alcohol in my system, and had to receive multiple EKGs, 12 bags of fluids within a couple of hours, and reversible damage to my kidneys, heart, and liver.\n\nNot everyone gets as lucky as I did. Drink water, pace yourself and go for a good time, not to get fucked up.",
      "author": "hoesmad_hoesmad_",
      "created": 1566243739,
      "upvotes": 2,
      "replies": {
        "exg0wre": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg0wre/",
          "text": "Frankly I would take getting through that as a \"second chance\". And no, it doesn't sound like a normal hangover. Your organs don't start to shut down with a normal hangover.\n\nThat amount of alcohol is above the LD50, so if you took 100 people around 50 would die from following that story.\n\nI'd hope no one would do this. Hopefully someone reading your post might be influenced positively by it.",
          "author": null,
          "created": 1566252915,
          "upvotes": 1,
          "replies": {
            "exg274y": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg274y/",
              "text": "Yea, that’s why I said it wasn’t an ordinary hangover. I knew something in my body did not feel right. It was a wake up call. I haven’t touched cocaine or any type of pills since then, and my drinking is much more limited now. \n\nIt was a real wake up call.",
              "author": "hoesmad_hoesmad_",
              "created": 1566253775,
              "upvotes": 1,
              "replies": {}
            },
            "exh2jdo": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh2jdo/",
              "text": "I've never been that far but after the night where I actively knew I was blacking out and was telling the people around me it changed the way I drink big time. I guarantee that I had alcohol poisoning, I straight up don't get hangovers other than a teeny tiny headache. I didn't get a head ache but I felt so sick everything felt wrong, I should've seen a doctor but didn't.",
              "author": "artsyChaos",
              "created": 1566287780,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "exfmaej": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfmaej/",
      "text": "It helps not to drink on an empty stomach. Food won’t prevent you from getting drunk, but it’ll slow down the process. Also, don’t try too hard to keep up with the people around you. Everyone has different tolerance levels. Just stay aware of what your tolerance is and don’t be afraid to stop drinking if you’ve been pushing yourself too much. Avoid heavy instigators if you don’t want to drink anymore. \n\nAlso from personal experience, if you go to a party with a designated driver make sure they’re responsible and keep an eye on them to make sure they’re not drinking. It’s happened too many times when me or a friend had gotten stranded somewhere because the DD decided to be an idiot.\n\nPeople can overhype overdrinking and getting fucked up drunk. It might sound fun in theory, but I’ve been to parties where we’ve had to rush people to the ER because of alcohol. It’s not fun for anyone involved. Know when to stop, because no one wants to be your babysitter.",
      "author": "ZzoZzo",
      "created": 1566243655,
      "upvotes": 1,
      "replies": {}
    },
    "exfkqg7": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfkqg7/",
      "text": "Also, step in and prevent rapes people, you can literally be paralyzed by rape and if the damage is bad (vagina usually or anuses) you might need surgery to repair and a ton of therapy. Also, if you someone got in a car while drunk and refuses to listen and not drive call the police on them. No one should have to die just because some idiot wants to drive and don't stay silent on that.",
      "author": null,
      "created": 1566242701,
      "upvotes": 9,
      "replies": {}
    },
    "exfjuhs": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfjuhs/",
      "text": "Drink for quality not quantity. Yes, it *is* fun to get a buzz, that's the whole point! Learn how much alcohol gets you to that perfect buzz, stop there, and enjoy the happy feeling. Too much alcohol isn't happy or enjoyable. It's like food. Some food is great, but if you eat too much you feel terrible.",
      "author": "Violet_Plum_Tea",
      "created": 1566242146,
      "upvotes": 1,
      "replies": {}
    },
    "exfiyta": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfiyta/",
      "text": "[removed]",
      "author": null,
      "created": 1566241591,
      "upvotes": 1,
      "replies": {
        "exfkxrg": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfkxrg/",
          "text": "Removing this because it's legal advice whose validity I am unsure about.  For what it's worth, I would have been 100% fine with just the first sentence.",
          "author": "ecklesweb",
          "created": 1566242824,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "exfgois": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfgois/",
      "text": "Don’t walk around outside of a party with a cup and don’t sit on the sidewalk or curbs/don’t let your friends do this.  Leave the pregame feeling buzzed and ready to party but if you or any of your friends leave the pregame stumbling and throwing up already, it’s not gonna be a good night. Make sure you drink water and have carbs before a night of drinking! Don’t mix dark and light liquor! Sugary drinks will make u feel like shit the next day aka 4loko, those sangria bottles that went viral for making people black out, and jungle juice. You don’t have to avoid those, just make sure u prepare for the aftermath lol",
      "author": "bananamilk28",
      "created": 1566240140,
      "upvotes": 1,
      "replies": {}
    },
    "exffxzx": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exffxzx/",
      "text": "people would shit on me and call me crazy for writing down what i drank on notes on my phone..... i never did anything outrageously stupid that hurt myself or others; i also never had that bad of a hangover and didn’t damage my liver (at least not as severely as some other idiots LOL). \n\ni would even do the same thing for my friends, and we would gauge each other and make sure everyone stopped drinking when they needed to. i just don’t know how people can be so careless about drinking when the harmful effects of it are so not worth it.\n\nanyway, you posted some great tips that might actually save some lives. it’s good for people to be reminded of this stuff!\n\nedit - spelling error",
      "author": "srd2501",
      "created": 1566239672,
      "upvotes": 2,
      "replies": {}
    },
    "exffqyj": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exffqyj/",
      "text": "If you or one of your friends is of East Asian/SE Asian descent, there’s a 1 in 3 chance that they’ll carry one or two copies of a defective gene that affects their body’s ability to metabolize alcohol (often resulting in what’s called the Asian Glow). You’ll most likely be a lightweight. Keep an eye out on yourself and others, if you get dizzy, sleepy, or your heart starts beating fast, sit down, stop drinking and get hydrated. Have someone with you to make sure you’re ok, and have them stay with you until symptoms subside. \n\nAlso, while homozygotes usually find the taste/feeling of drinking alcohol to be absolutely abhorrent, heterozygotes can become immune to this. If you drink regularly and have this gene, you have a 20x higher risk of having esophageal cancer later in life.",
      "author": "struggleknot",
      "created": 1566239552,
      "upvotes": 15,
      "replies": {}
    },
    "exffiph": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exffiph/",
      "text": "As am someone who was formerly known as that guy who was the life of the party once beyond belligerently drunk, I got one piece of advice.\n\nBE SMART.\n\nIf you're drunk and saying \"fuck it, why not\" then you've had too much. Personally, I keep a count of those fuck it moments throughout the night. 3 is my limit, because the choices get worse every time. After 3, I slow my drinking way the fuck down and drink water for a while.",
      "author": "Delivery4ICwiener",
      "created": 1566239413,
      "upvotes": 3,
      "replies": {}
    },
    "exfe7qs": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfe7qs/",
      "text": "Drink a bottle of Pedialyte before you go to bed! It's the same stuff they give sick babies, full of water and good vitamins. \n\nA pharmacist told my friend this, who told us, and we've been doing it ever since. I haven't had a hangover in 2 years since I found this out.",
      "author": "thesma11one",
      "created": 1566238610,
      "upvotes": 11,
      "replies": {
        "exgnskm": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgnskm/",
          "text": "if you have to consistently buy this you may have a problem tbh.",
          "author": "kaffeemugger",
          "created": 1566269065,
          "upvotes": 1,
          "replies": {
            "exgoihg": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgoihg/",
              "text": "Lol we're all mid or late 20's and party like twice a year, so I don't think there's a huge problem. We only pull it out for things like St. Patty's Day or New Year's.",
              "author": "thesma11one",
              "created": 1566269750,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "exfdu4n": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfdu4n/",
      "text": "I'm a 25 year old lady, and the mom of every group I've ever been friends with or hung out with. So, sorry if I sound preachy, but I've been there, done that, and can now give sage advice. \n\nDrink with someone who is looking out for your best interests. I drink with my fiancé. He's always making sure I am safe, drinking water, no one touches my drink, I'm not doing anything that will come back to bite me in the ass, and that I get home safely. The last thing you want is someone taking advantage of your intoxicated state. It could end up with someone hurting you, posting to social media, or even rape/sexual assault. Please be careful and have someone watch your back who knows what you would or wouldn't do sober, so you don't end up doing it drunk. \n\nDrinking as much water as you do alcohol will help with hangovers. Especially because it is still summer, it's warm, and you could end up very dehydrated. Please make sure you drink plenty of water. Dehydration, heat stroke, heat exhaustion, alcohol poisoning, it is not fun. I got heat exhaustion and dehydrated at a country music festival. I was puking, my head was pounding, almost passed out, and was sick in bed for days after. Now I can't be out in the heat like that anymore. Nonetheless, drinking out in the heat. Water will help flush out the toxins and make sure you are able to get out of bed the next day. Also, make sure you eat. Complex carbs. Oatmeal, breads, pasta, complex carbs. It'll soak up the alcohol, and if you do vomit, you aren't puking out just straight beer/liquor. \n\nDon't feel pressured to drink. I get it, you're out with friends and they're drinking so you want to be social. But if you don't feel like it's a good idea, listen to your gut. That party will still be fun if you have a cup of soda instead of beer. Don't keep drinking because someone offers it. Know your limit, know your line in the sand. \n\nDon't drink underaged. Don't drink and drive. Both are illegal. Being the \"lame\" one may cost you right now, but drinking underaged or driving under the influence and getting caught? That's thousands of dollars in court fees, attorney's fees, bond money, and getting a conviction on your record. I'm a paralegal for criminal defense. Please, I'm telling you from experience, it really isn't worth it. Not only that but driving while under the influence can be deadly. You could seriously injure or kill people/yourself. \n\nYou don't need to drink every night, at every party, every weekend, or every chance you get. You don't have to be stereotypical college-aged person. How long you can do a keg stand doesn't hold near as much weight as a good GPA. Be vigilant, be safe, and have fun.",
      "author": "PetiteChaos",
      "created": 1566238380,
      "upvotes": 3,
      "replies": {}
    },
    "exfb0yu": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfb0yu/",
      "text": "Something nobody has said are the other health ramifications of drinking:\n\n* **MOST IMPORTANTLY: DO NOT LET YOUR PASSED OUT FRIEND \"SLEEP IT OFF\" IN A ROOM SEPARATE FROM YOU.** Alcohol poisoning kills. If you have a friend who has been puking their brains out and passed out, SLEEP BESIDE THEM. Sure it's gross and something you don't want to do but people will choke on their puke and die. It happened to someone at my school. KNOW THE SIGNS OF ALCOHOL POISONING AND CALL 911. Nobody wants to get in trouble, I get it. However people will literally die.\n* **Both parties cannot consent to sex when drunk.** Sure there are blurred lines here I will not get into, but it is a RULE OF THUMB that if you are drunk, or the other party is drunk, they **cannot** consent to sex. If this is heterosexual relations, men will get hit with the book on this one. Pack it up, get a number, and text the next day to get breakfast if you really like the person. I promise you, you will never regret putting it aside for 8 hours. Plus, drunk sex is *not that great anyways.* \n* **When drunk, if you have sex you will make poor decisions.** If the nonconsensual part is not convincing, if you are drunk you will forget to use a condom, use it poorly, or just say \"screw it\" and not use one. You will be putting yourself (and/or your partner) at risk for STIs and pregnancy. DO NOT DO IT.\n* **If you see someone drunk and another person is making advances, be a good person and intervene.** Find their friends, strike up a conversation, sit them down and find out how to get them home and safe. There is no need for anyone to contribute to the toxic sexual assault culture - do not encourage your friends to advance on drunk parties. Read the signals and find a same-sex friend who can help them out of the situation.\n* **For the love of god do not drive drunk.** Sure we're probably talking about dorm parties but some colleges have frat houses, etc. that are off campus. Your $30 uber + $50 parking ticket will be cheaper than a DUI, manslaughter charge, or your own life. Do NOT trust your friends who have had even one drink to drive you home. Budget accordingly prior to having your first drink. ALSO, many colleges have free pick-up/bus options to encourage students to be responsible. *Please* take advantage of these. My college had one - the university police would pick you up they didn't check your age or ask any questions. \n* **Do not drink drinks that you did not pour, and watch your drinks.** There are exceptions (when you trust people unequivocally) but this is a huge problem. One party at my school had a whole punch bowl spiked and about 4 sexual assaults that night. A good way to avoid this is to prepare ahead of time and bring your own drinks, say no, and always hold your own drinks. \n\n***Safety is your number one priority when you are drinking.***",
      "author": "Katey5678",
      "created": 1566236637,
      "upvotes": 32,
      "replies": {
        "exfn0ao": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfn0ao/",
          "text": "> If you see someone drunk and another person is making advances, be a good person and intervene. Find their friends, strike up a conversation, sit them down and find out how to get them home and safe.\n\nIt really depends if the 2 person are comfortable with the situation.",
          "author": null,
          "created": 1566244106,
          "upvotes": 5,
          "replies": {
            "exfq8jp": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfq8jp/",
              "text": "If you can find that person’s friends, this is normally a great way to intervene. Just approaching someone and asking who they came with and if you can help them find them or find a ride home. I always err on the side of overprotection and it’s never failed me. In the situations where the man was someone they were dating, etc. and the person actually was sober enough to communicate to me they were thankful I checked in.",
              "author": "Katey5678",
              "created": 1566246054,
              "upvotes": 4,
              "replies": {
                "exh277i": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh277i/",
                  "text": "This is actually why I'll distract girls and bring that up. It may look like I'm just cockblocking but I've stopped a few things a handful of times. I'd rather get groped by a drunk girl than something happening to her.",
                  "author": "artsyChaos",
                  "created": 1566287256,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "exf9gb6": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf9gb6/",
      "text": "Just thought I'd put this out there: there is no shame in being a lightweight! If someone teases you for that, then fuck them. I used to be able to drink a LOT, then I started on antidepressants. It totally fucked with my tolerance. It took my too many blackouts (1 should be too many) to learn that I just couldn't drink like I used to, and that's okay! If you're a lightweight, embrace it, and do not try to drink more to impress anyone",
      "author": "6alexandria9",
      "created": 1566235651,
      "upvotes": 49,
      "replies": {
        "exf9i9m": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf9i9m/",
          "text": "Also, NEVER DRINK AND DRIVE! Not worth it, even if you think you're good at it",
          "author": "6alexandria9",
          "created": 1566235685,
          "upvotes": 31,
          "replies": {
            "exg057i": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg057i/",
              "text": "People who think they’re “good at driving drunk” piss me off so much",
              "author": "psilocybin_sky",
              "created": 1566252399,
              "upvotes": 13,
              "replies": {
                "exg20qy": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg20qy/",
                  "text": "I used to be one of those people, sadly. I'm just glad I learned my lesson before hurting/killing anyone or myself",
                  "author": "6alexandria9",
                  "created": 1566253656,
                  "upvotes": 6,
                  "replies": {}
                },
                "exg9321": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg9321/",
                  "text": "One of my first calls when i got hired as an emt was for a guy who had rammed a working truck after leaving the strip club wasted. The worker was at the top of the cherry picker, and if he hadnt been harnessed in would have no questions been killed. Guy almost killed someone just trying to do his job and fix a light before the morning commute. Fuck that guy and those like him.",
                  "author": "Demented_Liar",
                  "created": 1566258223,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "exfwtzr": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfwtzr/",
          "text": "Being a lightweight is great as long as you know how to pace yourself. Spend less money, fewer calories, not as many trips to the bathroom, etc.",
          "author": "notleonardodicaprio",
          "created": 1566250191,
          "upvotes": 7,
          "replies": {}
        },
        "exgwj7h": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgwj7h/",
          "text": "Honestly if you’re a lightweight and you feel bad that all your friends are making fun of you, brag about how much money you save by having to drink less than them. Hahaha",
          "author": "Anjunagasm",
          "created": 1566278550,
          "upvotes": 3,
          "replies": {}
        },
        "exh200h": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh200h/",
          "text": "You totally can and should brag that it means you can drink cheaper! It can make people jealous!",
          "author": "artsyChaos",
          "created": 1566286945,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "exf9fs1": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf9fs1/",
      "text": "Also eat a good meal before drinking!",
      "author": "iatesquirtle",
      "created": 1566235642,
      "upvotes": 2,
      "replies": {}
    },
    "exf9cqs": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf9cqs/",
      "text": "I use an app to keep track of how many drinks I have. It's pretty neat, and gives you BAC estimates and a way to track your habits. Every time I have a drink, I enter it in so I have a log of exactly how much I drink and a rough approximation of my BAC over time. I measure out all my drinks and I don't pull.\n\nDrinking is fun sometimes. Bringing your friend to the hospital because they're way too fucked up to not go to the hospital, not so fun.",
      "author": "FamishedHippopotamus",
      "created": 1566235590,
      "upvotes": 24,
      "replies": {
        "exfu0h8": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfu0h8/",
          "text": "What’s the app?",
          "author": "bing-no",
          "created": 1566248344,
          "upvotes": 5,
          "replies": {
            "exfyu9v": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfyu9v/",
              "text": "Right now I'm using alcodroid on Android. I haven't really gotten around to exploring the other options yet, so I can't really speak for those, but I've liked this one so far. The interface could be prettier, but it does the job.",
              "author": "FamishedHippopotamus",
              "created": 1566251535,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "exf8j1g": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf8j1g/",
      "text": "Your liver is probably already fucked, I strongly suggest you stay away from alcohol for a couple of weeks, trust me your liver will thank you in the near and distant future.",
      "author": "nateCod",
      "created": 1566235073,
      "upvotes": -5,
      "replies": {
        "exfh2l7": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfh2l7/",
          "text": "No, not from one night of heavy drinking. There are hardened, life-long, stone-cold drunks that still have functioning livers. Are you trying to scare the shit out of this kid??",
          "author": "brown2420",
          "created": 1566240386,
          "upvotes": 8,
          "replies": {
            "exgvrpr": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgvrpr/",
              "text": "maybe I went a little too far",
              "author": "nateCod",
              "created": 1566277479,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "exf8ex9": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf8ex9/",
      "text": "Alcohol related deaths in America, according to the CDC is 88,000, gun deaths is about around 40,000.\n\nBe safe.",
      "author": "you90000",
      "created": 1566234998,
      "upvotes": 29,
      "replies": {
        "exfgzei": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfgzei/",
          "text": "Wow.",
          "author": "smh_matrix",
          "created": 1566240331,
          "upvotes": 5,
          "replies": {}
        },
        "exfr0c5": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfr0c5/",
          "text": "That's accounting for suicides as well. Gun homicides are around 15k I believe",
          "author": "whitelife123",
          "created": 1566246509,
          "upvotes": 9,
          "replies": {
            "exg9w65": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg9w65/",
              "text": "11k, total homicides is 15k.\nTotal killed from all rifles: assault rifles, bolt action, lever action, pump action. \n\n400\n\n\n\nhttps://ucr.fbi.gov/crime-in-the-u.s/2017/crime-in-the-u.s.-2017/topic-pages/tables/expanded-homicide-data-table-8.xls",
              "author": "you90000",
              "created": 1566258743,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "exf7few": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf7few/",
      "text": "Drink water in between each drink, and if you can keep bottle caps/can tops for each drink as an easy way to keep track, eat plenty of carbs as well, it’ll absorb some of the alcohol and make it easier for your system to process, and when in doubt puke it out, it may be painful but it’ll keep you safer than if you were to keep it in. Also alcohol takes 15 minutes to reach its peak, so if you have a drink and don’t feel anything right away, wait before you have another or else you’re gonna have a bad time.",
      "author": "thatguynamedmike2001",
      "created": 1566234376,
      "upvotes": 2,
      "replies": {}
    },
    "exf5xwy": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf5xwy/",
      "text": "First of all, don't keep track of how much you're drinking by what you drank. Some beers have 1% alcohol, some have 8%. So saying I only had \"a beer\" means sweet fuck all. Keep track of the alcohol content. Anything above 5% is a lot of alcohol. If you have 2 full sized beers with 6% alcohol content, you've had enough to drink. \n\nIf you drink any amount, do not drive. Period. Unless you had like 1 Miller 64, but that doesn't technically count as drinking. \n\nDon't let people guilt you into drinking more. You think somebody making fun of you is bad? No explaining the ambulance bills to your parents is bad. If your friends are gonna be dicks about it, leave. \n\nDon't drink underage. I know I'm a party pooper but you really don't want to deal with an underage drinking charge. Alcohol isn't that great. Certainly DO NOT FUCKING BUY ANYTHING FOR ANYONE UNDERAGE OR ENCOURAGE ANYONE UNDERAGE TO DRINK. \n\nIf you want to be super nerdy, you can actually calculate your BAL with tools online. You just put in the number of drinks and if you're gonna go above .08-.1 BAL, it's time to stop.",
      "author": null,
      "created": 1566233414,
      "upvotes": 12,
      "replies": {}
    },
    "exf5l8m": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf5l8m/",
      "text": "Semi related, especially for less experienced drinkers:\n\n**Do not take any medication with acetaminophen (ex. Tylenol) when drinking.**\n\nBoth are processed in your liver and if it's working overtime from a night of drinking, the extra strain can really fuck it (and by extension, you) up.",
      "author": "fishfishfish",
      "created": 1566233185,
      "upvotes": 106,
      "replies": {
        "exfrq3n": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfrq3n/",
          "text": "Oh paracetamol and alcohol together is literally liver failure potion",
          "author": "Standgrounding",
          "created": 1566246940,
          "upvotes": 20,
          "replies": {}
        },
        "exgde7c": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgde7c/",
          "text": "And also: alcohol interacts with (or reduces the effects of) a lot of medications too. You’re not supposed to be drinking while taking antidepressants or stuff for anxiety. Think really carefully before you decide to mess with these drugs or mix them. They might just become ineffective, or they could be a terrible combo that makes you seriously ill.",
          "author": "NoxiousQuadrumvirate",
          "created": 1566261206,
          "upvotes": 12,
          "replies": {
            "exh125w": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh125w/",
              "text": "Plus, taking a depressant while taking antidepressants is a poor use of resources. And not a good idea.",
              "author": "RedditYankee",
              "created": 1566285503,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "exf5gms": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf5gms/",
      "text": "[deleted]",
      "author": null,
      "created": 1566233100,
      "upvotes": 50,
      "replies": {
        "exfaq5y": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfaq5y/",
          "text": "And watch your drink, especially at a large gathering. Women often know this. But men have been roofied, too (either intentionally or their drink was mixed up with a woman's).",
          "author": "era626",
          "created": 1566236452,
          "upvotes": 20,
          "replies": {
            "exgdpuo": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgdpuo/",
              "text": "My general rule (don’t know where I heard it from) is: once it leaves your hands and sight, it’s no longer yours. \n\nIf you put it down for a second to go to the bathroom, it’s no longer yours. Same thing if you gave it to a friend, really. You don’t know if they sat it down or got distracted while watching over their multiple drinks, and it only takes one moment to spike it with drugs or more alcohol. \n\nPicking up an unattended drink is kinda like licking food from the surface of a random table: best not to risk it.",
              "author": "NoxiousQuadrumvirate",
              "created": 1566261440,
              "upvotes": 6,
              "replies": {
                "exh1xjq": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh1xjq/",
                  "text": "All of this! I'm an idiot when drunk and will just grab whatever is around. A couple weeks ago that turned out to be a disaster, a couple of 21 yr olds were making mixed drinks with vodka and red bull. I stole at least two half drank cups of those. Going to sleep and half of the next day I had such bad chest pain that I thought I was dying until I realized what I must have grabbed. Now I know that I was 100% in a safe place and that no one would do anything it was still an extremely stupid and could have gone a lot worse. EDIT: This is why I don't drink in public aside from maybe one mixed drink and I'm babysat when we're at parties outside our direct circle",
                  "author": "artsyChaos",
                  "created": 1566286836,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "exfgu92": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfgu92/",
          "text": "A trick I don't know if it actually works but have been told by male friends who got roofied: if the the drink smells salty don't drink it, its been drugged.",
          "author": "smh_matrix",
          "created": 1566240240,
          "upvotes": 9,
          "replies": {}
        },
        "exfk8ae": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfk8ae/",
          "text": "[removed]",
          "author": null,
          "created": 1566242385,
          "upvotes": 1,
          "replies": {
            "exfksyk": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfksyk/",
              "text": "Removing this because it's medical advice whose validity is unknown to me.",
              "author": "ecklesweb",
              "created": 1566242743,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "exf5cln": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf5cln/",
      "text": "Also, the whole \"bread will soak up alcohol if you're too drunk\" is 10000% a myth that too many people bank on. If you're too drunk there is no instant cure.\n\nPacing yourself with your friends is also really stupid because there are so many different factors that affect how much alcohol gets you drunk.",
      "author": null,
      "created": 1566233026,
      "upvotes": 17,
      "replies": {
        "exfdj54": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfdj54/",
          "text": "Mixing in a water or several does help when you’re at that stage",
          "author": "Minn-ee-sottaa",
          "created": 1566238196,
          "upvotes": 1,
          "replies": {
            "exggptt": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exggptt/",
              "text": "Not really. \n\nTime is the most effective way to sober up. Drinking water does nothing but kill time.",
              "author": "oldGilGuderson",
              "created": 1566263625,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "exf4z8p": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf4z8p/",
      "text": "Don't try to \"keep up\" or drink as much as your friends. Everyone processes alcohol differently.  No one will be impressed with your ability to slam 14 beers then piss the bed.",
      "author": "OpenParty",
      "created": 1566232779,
      "upvotes": 123,
      "replies": {
        "exfo64w": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfo64w/",
          "text": "I totally agree!! If you cant take a shot, dont do it.",
          "author": "thenomadcat",
          "created": 1566244824,
          "upvotes": 12,
          "replies": {}
        },
        "exgk2g0": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgk2g0/",
          "text": "This one took me way too long to learn.",
          "author": "bcgroom",
          "created": 1566266108,
          "upvotes": 2,
          "replies": {}
        },
        "exgoxgr": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgoxgr/",
          "text": "Holy shit I was so confused when I pissed the bed after a heavy night of drinking. Thank God for the mattress cover, first and only time I've ever experienced that and not been like 4 years old.",
          "author": "Bigfoot722",
          "created": 1566270098,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "exf1yqq": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf1yqq/",
      "text": "[deleted]",
      "author": null,
      "created": 1566230797,
      "upvotes": 1,
      "replies": {
        "exf6c8k": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf6c8k/",
          "text": "I've had beer before liquor and liquor before beer. Both made me feel equally shitty. I didn't notice a difference. That could just be me though.",
          "author": "WhiskaMittie",
          "created": 1566233672,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "exf1w7e": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf1w7e/",
      "text": "People already said these but \n\nNVER DRINK ON AN EMPTY STOMACH & DRINK LOTS OF WATER FOR EACH SHOT (or drink) YOU CONSUME \n(Etc if you had a beer drink a glass of water too)\n\nI almost fucked up my first year of college due to bad choices with alcohol. Make sure you’re really taking it easy. As well as EAT SOMETHING BEFORE YOU GO TO BED THAT NIGHT. A MUST, if you’re going to be sick in the morning, it’s 100% better to throw up with food than bile - incredibly painful.\n\nTry to avoid it as much as you can but if not - please remember these things everyone is saying because it can seriously do harm, and I’m not even like an old adult I’m literally a rising sophomore with time to still make stupid choices.",
      "author": "elihassomethoughts",
      "created": 1566230751,
      "upvotes": 54,
      "replies": {}
    },
    "exeyev3": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exeyev3/",
      "text": "Don’t drink the day before class. Only on weekends.",
      "author": "OK__LIBTARD",
      "created": 1566228369,
      "upvotes": 41,
      "replies": {}
    },
    "exewmmg": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exewmmg/",
      "text": "You don't have to drink at parties. You definitely don't need to get drunk, which sometimes ruins the whole night.",
      "author": "dobbysreward",
      "created": 1566227131,
      "upvotes": 67,
      "replies": {
        "exfk1i8": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfk1i8/",
          "text": "Yes, this. Most of my friends are big on parties, so even though it’s not as much my scene i have often gone to parties and maybe had one or two drinks or not drank at all and just enjoyed the social aspect. Although towards the end of a party it tends not be very fun to be one of the few sober (or sober-ish) people in a sea of wasted people, so maybe leave the party early or just go chill somewhere away from the main action if it gets to be too much.",
          "author": "qtash",
          "created": 1566242267,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "exewjzl": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exewjzl/",
      "text": "One everyone seems to learn the hard way, including myself, is to drink with people who actually care about you. \n\nIt’s pretty easy to find out who your good friends are by having a bad night like the above, and if you surround yourself with people who don’t want you to die (literally or figuratively) of alcohol poisoning you’re going to have a support structure if/when you drink too much.",
      "author": "ChristsRightNut",
      "created": 1566227080,
      "upvotes": 144,
      "replies": {
        "exf6bgz": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf6bgz/",
          "text": "But then again if this is a common occurrence those 'good friends' will be gone too.",
          "author": "PonchoHung",
          "created": 1566233658,
          "upvotes": 36,
          "replies": {
            "exfgozq": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfgozq/",
              "text": "I think the point is to make it a one time event. If its a normal occurence I think that would have serious health implications.",
              "author": "smh_matrix",
              "created": 1566240148,
              "upvotes": 11,
              "replies": {}
            },
            "exfj1af": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfj1af/",
              "text": "Yes, very true. i would add to this conversation that while i love my friends, i find myself playing babysitter waaay more often than i would like to. please don’t take advantage of the kindness of your friends. i help them when they need it and when i’m able, but you shouldn’t expect to them to always be there every time — especially if your drinking is frequently excessive. sometimes your friends have their own lives too.",
              "author": "qtash",
              "created": 1566241635,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "exfgmst": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfgmst/",
          "text": "This is so so true. As many times as I have given a lecture like OP's to friends, they almost always never listen and then ended up telling me later that they had to learn the hard way. I did the same. And I always think about who helped me in that situation and who didn't. It truly showed me who my real friends were.",
          "author": "smh_matrix",
          "created": 1566240110,
          "upvotes": 7,
          "replies": {}
        },
        "exgj6kt": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgj6kt/",
          "text": "My dorm neighbor had a buddy from a different school over who was way past poisoning point, should have called the ambulance but we didn’t find out he had alcohol poisoning until a couple months later. He started throwing up in his sleep and would not wake up no matter how hard he slapped him. I blew my top (Stopped drinking after getting a misconduct for doing a naked mile around my dorm building) and sat him up, and scolded my dorm neighbor for letting him get this drunk. I actively got Manny (the kid in question) sitting up in a chair and held a garbage bag under his chin for four hours, then had my dorm neighbor take over, we got him coherent for a second with some water on his face and then got him to strip as he was soaked through with throwup. \n\nI finally told my Dorm Neighbor to lay him down and made sure he pulled an all-nighter so\nA) he didn’t lay on his back\nB) he didn’t drown in side-puke. \n\nI checked on this kid I didn’t even know every half hour until 8am where I let the dorm neighbor take over and I went to bed finally, shirt bleached from stomach acid that wasn’t mine. \n\n\n\nKnow your limits. Drinking may be a way to have fun but it’s also a waste of money and dangerous when you don’t pace yourself.",
          "author": "AidanTheAudiophile",
          "created": 1566265447,
          "upvotes": 5,
          "replies": {
            "exh9q18": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exh9q18/",
              "text": "You know, at that point it is probably time to call an ambulance.",
              "author": "ecklesweb",
              "created": 1566297996,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "exeuqbg": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exeuqbg/",
      "text": "Drink a glass of water for each alcoholic drink you consume. The worst symptoms that come with hangovers are due to dehydration (alcohol is a diuretic).",
      "author": "EleganceandEloquence",
      "created": 1566225822,
      "upvotes": 566,
      "replies": {
        "exfiuv0": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfiuv0/",
          "text": "I would consult this link. The Mayo Clinic has a really good reputation. [https://www.mayoclinic.org/diseases-conditions/hangovers/symptoms-causes/syc-20373012](https://www.mayoclinic.org/diseases-conditions/hangovers/symptoms-causes/syc-20373012)\n\nI would be aware, it's not just dehydration that causes the worst symptoms. There is also an inflammatory immune response that also causes a lot of problems. And, while drinking, your body is going to push that water out of your system as fast as possible. This is hard on your kidneys. I suggest hydrating at the end of the night while eating greasy food at Steak and Shake. \n\nAlso, dehydration symptoms are made worse by electrolyte depletion and water doesn't replace electrolytes. Hit the gatorade hard before bed and in the morning--or get some chicken soup in the morning to get sodium in your body. \n\nAnd, don't take Acetaminophen for hangovers; it's hard on your liver.",
          "author": "brown2420",
          "created": 1566241520,
          "upvotes": 40,
          "replies": {
            "exfl1vf": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfl1vf/",
              "text": "Thank you for a good source!",
              "author": "ecklesweb",
              "created": 1566242892,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "exf7w0t": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf7w0t/",
          "text": "This is not a safe way to consume massive amounts of alcohol though. It's just generally good practice even if you're only having 2-3 drinks, which frankly is as many as any sane person should drink in an evening anyway.",
          "author": "terrapinninja",
          "created": 1566234676,
          "upvotes": 140,
          "replies": {
            "exfai26": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfai26/",
              "text": "The idea is that it takes you a bit of time to drink the water, so you end up drinking less alcohol.\n\nWhether or not you're also drinking alcoholic drinks, having something in your hand also staves off the \"don't you want another drink?\" from people. If you give yourself a limit of alcoholic drinks, but stay at the party, switch over to water. (Also a good way to ensure you sober up enough to get home safe!)",
              "author": "era626",
              "created": 1566236310,
              "upvotes": 85,
              "replies": {
                "exfcyxo": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfcyxo/",
                  "text": "Another thing. If you want to seem like your drinking a lot without doing so. Refill your beer can with water. It looks like your just pounding beers but you drink a lot less and get some water in you.",
                  "author": "LordBrackets",
                  "created": 1566237857,
                  "upvotes": 30,
                  "replies": {
                    "exfjy9o": {
                      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfjy9o/",
                      "text": "I drank water every time I drank beer on my 21 birthday and I was pretty sober (had 6 drinks with 6 cups of water) and I still punk and I was fine.",
                      "author": null,
                      "created": 1566242211,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                },
                "exgo2ri": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgo2ri/",
                  "text": "Only time will make you more sober, if you still feel drunk water will just make you pee. If you’re in a college town just walk home with a friend.",
                  "author": "DargyBear",
                  "created": 1566269332,
                  "upvotes": 4,
                  "replies": {
                    "exgqyt9": {
                      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgqyt9/",
                      "text": "Yup, the idea is you stop drinking alcohol and drink water for the last hour or so to keep your hands busy/not try to get you more alcohol. Plus of course helping with dehydration and hangovers.",
                      "author": "era626",
                      "created": 1566271885,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "exfkw1x": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfkw1x/",
              "text": "I didn't mean it as a good way to drink tons of alcohol- there is no way to safely drink a large amount in one sitting as far as I'm concerned.",
              "author": "EleganceandEloquence",
              "created": 1566242795,
              "upvotes": 14,
              "replies": {
                "exfnjqc": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfnjqc/",
                  "text": "Absolutely not trying to misrepresent you. Just don't want some kid getting the wrong idea",
                  "author": "terrapinninja",
                  "created": 1566244437,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "exgd45k": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgd45k/",
              "text": "The best thing about drinking equal amounts of water is that it fills you up and you then you really won’t want to drink a heap of alcohol. Your stomach is finite, and you’re not going to drink until you fill up your throat, so the water takes up half of that space for a while and stops you from filling it with just alcohol. \n\nIf you finish one drink and don’t really feel like having a glass of water then you shouldn’t be drinking more alcohol either.",
              "author": "NoxiousQuadrumvirate",
              "created": 1566261004,
              "upvotes": 8,
              "replies": {}
            },
            "exgpiuf": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgpiuf/",
              "text": "This. 2-3 drinks is enough to get a nice chill mood, feel a small buzz, and takes long enough to drink you can be social while your drinking. If 2-3 does not do anything for you, you prob already drink to much anyway",
              "author": null,
              "created": 1566270606,
              "upvotes": 3,
              "replies": {
                "exipzsk": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exipzsk/",
                  "text": "It's different for everyone dude",
                  "author": "TiVeL",
                  "created": 1566333286,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "exfayt5": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfayt5/",
          "text": "There are easy ways to drink responsibly. For every drinking game my friends and I will always do one round with water after a round with alcohol so that we have a way to make sure that we’re drinking enough water, because when you’re drunk it can be hard to remember to drink something else",
          "author": "Bekah679872",
          "created": 1566236600,
          "upvotes": 14,
          "replies": {}
        },
        "exfn4dh": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfn4dh/",
          "text": "r/HydroHomies",
          "author": "smartguy05",
          "created": 1566244175,
          "upvotes": 5,
          "replies": {}
        },
        "exfedcd": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfedcd/",
          "text": "This is actually a common myth. Alcohol doesn’t dehydrate you to the point where you need to drink water for every cup. It works similar to caffeine, by lowering your ADH so you have a tendency to urine slightly more. So unless you need to drink a cup of water for every cup of coffee or tea you drink, it’s better to consume less alcohol than drink more water.",
          "author": null,
          "created": 1566238704,
          "upvotes": 9,
          "replies": {
            "exg6uzm": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg6uzm/",
              "text": "> So unless you need to drink a cup of water for every cup of coffee or tea you drink\n\nyeah actually i do do the same with coffee, tea, and energy drinks lol",
              "author": "TenaciousTay128",
              "created": 1566256792,
              "upvotes": 5,
              "replies": {
                "exga8t9": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exga8t9/",
                  "text": "Oh lol drink on ahead then",
                  "author": null,
                  "created": 1566258972,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "exfnz3a": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfnz3a/",
          "text": "I agree with this statement!",
          "author": "thenomadcat",
          "created": 1566244701,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "exepu5n": {
      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exepu5n/",
      "text": "Never ever ever drink on an empty stomach",
      "author": "smilingseal7",
      "created": 1566222420,
      "upvotes": 301,
      "replies": {
        "exf6jbi": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exf6jbi/",
          "text": "Learned this the hard way. This is a one-way ticket to morning vomiting.",
          "author": "Martian_Boogeyman",
          "created": 1566233800,
          "upvotes": 69,
          "replies": {
            "exfo2nb": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfo2nb/",
              "text": "night AND morning",
              "author": "thenomadcat",
              "created": 1566244763,
              "upvotes": 19,
              "replies": {
                "exfs8u8": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfs8u8/",
                  "text": "Vomiting at night is the usual. Waking up 2 hours after going to bed to vomit is its own kind of hell :|",
                  "author": "Martian_Boogeyman",
                  "created": 1566247257,
                  "upvotes": 12,
                  "replies": {
                    "exg3y36": {
                      "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg3y36/",
                      "text": "I have never vomited at night, only at morning. Yeah, sleeping three hours only to spend a long time laying in front of the toilet regretting your life choices isn't very fun...",
                      "author": "favmyheart",
                      "created": 1566254928,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "exfe2ke": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfe2ke/",
          "text": "Unless you wanna save money ( ͡° ͜ʖ ͡°)",
          "author": "vr1252",
          "created": 1566238523,
          "upvotes": 32,
          "replies": {
            "exgbdhm": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exgbdhm/",
              "text": "Save money by not eating dinner, save money by needing less alcohol, win win prove me wrong",
              "author": "repsaj33",
              "created": 1566259730,
              "upvotes": 11,
              "replies": {
                "exghglx": {
                  "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exghglx/",
                  "text": "It's the freshman -15. Easy when ur dining is gross!",
                  "author": "vr1252",
                  "created": 1566264178,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "exfo3gl": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfo3gl/",
              "text": "I cant lmfao",
              "author": "thenomadcat",
              "created": 1566244777,
              "upvotes": 3,
              "replies": {}
            },
            "exfg11g": {
              "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfg11g/",
              "text": "( ͡° ͜ʖ ͡°)",
              "author": "daddyradshack",
              "created": 1566239725,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "exfgjyy": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfgjyy/",
          "text": "This comment here is so important....I can handle 6, 7, 8 drinks in a night on an full setomach, but with an empty stomach 1-2 drinks will have me set for the night",
          "author": "aviantologist",
          "created": 1566240059,
          "upvotes": 10,
          "replies": {}
        },
        "exg3pf5": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exg3pf5/",
          "text": "I drank on an empty stomach on my 18th birthday. It wasn't my first time drinking, but it was the first time I went clubbing. \nFor whatever reason, I thought some McDonals fries were enough dinner to support too many (shit quality vodka) drinks. It wasn't. I spent the next morning vomiting while my mom was very pissed at me, and rightfully so.\nSo yeah, eat a fulfilling MEAL if you're going to drink, or else you'll regret the consequences.",
          "author": "favmyheart",
          "created": 1566254770,
          "upvotes": 6,
          "replies": {}
        },
        "exfo0vk": {
          "link": "/r/college/comments/csh8ef/alcohol_thoughts_on_staying_alive/exfo0vk/",
          "text": "retweet",
          "author": "thenomadcat",
          "created": 1566244733,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634051390
}