{
  "sid": "pwxxkk",
  "link": "/r/college/comments/pwxxkk/missed_my_chance_to_rediscover_myself_again_in/",
  "title:": "Missed my chance to rediscover myself again in college after months of indecision and depression...",
  "text": "(Sorry for the long post i had a lot to offload)\n\nSo this is really one of the worst situations of my life. I stopped studying at around march this year because i felt incredibly pressured about the academics, which is normal for all students but hear me out... since i was a kid, i was always fascinated by science. Biology, Medical Biology and all the other stuff.. i remember being so excited for it that i foolishly decided then and there that i would become a doctor.. \n\nI only had average grades in science and math  but i still worked so hard that i said to myself no matter what i would become a doctor. When i started college, i chose a STEM course that perfectly aligned with my interests then. I was around the middle of my class in terms of grades but i was so happy to study and and even had a group of friends to hang out and study with... But as around a year and a half passed i started to burn out.... \n\nThe subjects i used to love turned into subjects of grueling work and countless late nights studying for things i would never truly understand. Projects by their own i would rarely pass and projects with groups i would put the most effort in so i wouldn't bother their grades, even if it meant i couldn't get any sleep. Needless to say, i lost my love for the subjects and my passion for studying the things that matter to me was slowly dying out. I rarely replied in group chats and slowly split myself from my friends, feeling nothing but shame about my situation\n\nWhen the semester break came in, i was so relieved and so sad that in the middle of break i came out to my parents that i couldn't take it anymore and the pressure got to me. They were incredibly understanding and comforting that they told me to take my time to decide what i really wanted.\n\nAnd i did. For a  long time.\n\nWhen the \"break\" started, i just so felt relieved and relaxed that i didn't think of academics. Just watching tv shows, movies and playing games. It felt nice but with the thought of not studying made me restless and i couldn't enjoy anything that i liked. So during the recent months i would really dig deep into myself to find something else to really matter to me. I found two interests that fit me and i started by process to get back into college but because of my indecision to choose which one it would be too late.\n\nI found out recently that i missed my chance to get back to college and would have to wait until early next year to apply again. What do i do? I'm already pressured by my parents to study again, i have no friends to talk to this about because i cut myself off from them for months, i can't and won't transfer because the school i enrolled in is one of the best schools in my country and whose to say they will accept me back in if i transfer out for a few months then come back?\nI just feel even more depressed and ashamed of myself because of my indecision that i failed not just myself but my parents as well... \n\nWhat do i do?",
  "author": "VincentRed-it",
  "created": 1632800888,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {},
  "updated": 1634056798
}