{
  "sid": "qxb87q",
  "link": "/r/college/comments/qxb87q/how_should_i_promote_and_make_remote_learning/",
  "title:": "How should I promote and make remote learning permanent?",
  "text": "I have really enjoyed online learning and want it to continue post-COVID, as well as enjoy online events! How should I promote it? Right now I'm asking and people understand, but I'm curious about how to do it post-COVID for school like how companies are allowing remote and hybrid work.",
  "author": "Chris_H290",
  "created": 1637307950,
  "updated": 1639856975,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hl9m00l": {
      "link": "/r/college/comments/qxb87q/how_should_i_promote_and_make_remote_learning/hl9m00l/",
      "text": "My sense is that you're in the minority. As time passes we're going to discover that online learning is a disaster for most students. Doing both in-person and remote based on student preference is expensive and difficult, and schools will default to in-person since it's the preference of most students. This is going to be a tough sell. That said, there will be schools and programs that will cater to those who want online learning.",
      "author": "trunkNotNose",
      "created": 1637337016,
      "upvotes": 1,
      "replies": {}
    },
    "hl8aogn": {
      "link": "/r/college/comments/qxb87q/how_should_i_promote_and_make_remote_learning/hl8aogn/",
      "text": "Well you can give feedback to management. However, it’s important to keep other types of learning available- people learning through different modes.",
      "author": "votezombiez",
      "created": 1637308035,
      "upvotes": 1,
      "replies": {}
    },
    "hldqi2y": {
      "link": "/r/college/comments/qxb87q/how_should_i_promote_and_make_remote_learning/hldqi2y/",
      "text": "Online classes are a thing and were a thing before COVID.  You just have to find a school that has accredited online classes",
      "author": "PersephoneIsNotHome",
      "created": 1637413627,
      "upvotes": 1,
      "replies": {}
    }
  }
}