{
  "sid": "reixz6",
  "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/",
  "title:": "I technically cheated on my final. What will happen?",
  "text": "Ok so I took my final. The teacher gave us two attempts to complete it 3 hours each. My first attempt I did not do very well and I used the full 3 hours. I noticed upon completing the first attempt that I could see what I got right and wrong and what some of the correct answers were.\n\nSo I took the exam again  with my first attempt as a guide making sure to enter the correct answers and I did much better and finished it within 20 mins (because the deadline was in 20 mins).\n\nMy professor is not stupid so hes going to obviously see the difference in scores and time taken. \n\nI feel like this is technically cheating but I saw the opportunity and took it. I'm afraid that I'll get in trouble for academic dishonesty or something. \n\nDo you think I will?",
  "author": "Upset-Ad-3982",
  "created": 1639290517,
  "updated": 1639516532,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.93,
  "comments": {
    "ho7w607": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/ho7w607/",
      "text": "That’s on your professor tbh. Unless it’s stated in a policy or whatever, I think you should be okay. But then again, idk. Since it’s the same questions AND you can review it after you take it AND see the right answers the first time, it’s like it was planned for the students to pass. So I wouldn’t worry about it",
      "author": "KimJungUno54",
      "created": 1639290738,
      "upvotes": 29,
      "replies": {}
    },
    "ho82i9x": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/ho82i9x/",
      "text": "That doesn't sound like cheating, that sounds like either a very nice, or a very dumb professor. Either way, unless you did something weird to see what you got right/wrong, you're good",
      "author": "Guaranteed_Error",
      "created": 1639295461,
      "upvotes": 30,
      "replies": {}
    },
    "ho86ezd": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/ho86ezd/",
      "text": "I don’t think that’s considered cheating lol",
      "author": "tha_oz",
      "created": 1639298626,
      "upvotes": 4,
      "replies": {}
    },
    "ho81v0f": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/ho81v0f/",
      "text": "Does he seem like an easy-going professor? Some professors really want you to pass their class so they make final exams easy.",
      "author": "Illustrious_Care9253",
      "created": 1639294954,
      "upvotes": 3,
      "replies": {}
    },
    "ho81y2h": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/ho81y2h/",
      "text": "Also I’ve done this same thing on online quizzes and tests. I’ve never had an issue.",
      "author": "Illustrious_Care9253",
      "created": 1639295021,
      "upvotes": 2,
      "replies": {}
    },
    "ho9ktzs": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/ho9ktzs/",
      "text": "Sounds like your professor is very very generous or technically inept. If it's the generous part, Merry Christmas! If it isn't, trust me when I say if you noticed that your entire class noticed that and they all got good scores in a similar manner, he'll probably let it slide.",
      "author": "Red234234",
      "created": 1639328253,
      "upvotes": 2,
      "replies": {}
    },
    "hoadw41": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/hoadw41/",
      "text": "Seems like your professor intentionally gave you 2 tries so that you could do better on the second try. Making an answer key in the middle of it was probably a little much but idk if this is actually cheating",
      "author": "LowElectrical9168",
      "created": 1639339540,
      "upvotes": 2,
      "replies": {}
    },
    "ho97dei": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/ho97dei/",
      "text": "This is why you should always miss one or two questions intentionally..But it doesn’t sound like cheating. The professor gave you multiple attempts and made the answers visible.",
      "author": "aprss",
      "created": 1639322687,
      "upvotes": 2,
      "replies": {}
    },
    "hoawad6": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/hoawad6/",
      "text": "Prof perspective: Not with exams but I've goofed on online quiz settings before! If this were me, I would definitely *not* consider it cheating since it was my fault I accidentally checked the box to show the correct answers after each attempt. It would be tricky for me to handle as far as grades for the class (how to handle the fact that some students may not have realized, etc.), but that's all the prof's problem, not yours. In these cases, I always appreciate when a student emails me a heads-up like \"Just so you know, the answers appear after the first attempt. I don't know if that's on purpose or not.\" That way I know there's an issue I'll need to deal with.",
      "author": "puzzlealbatross",
      "created": 1639346980,
      "upvotes": 1,
      "replies": {}
    },
    "hob2drt": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/hob2drt/",
      "text": "Your professor is either technologically incompetent or super nice. Is prepare to make a case to the dean if anything comes of it",
      "author": "wafflepancake5",
      "created": 1639349529,
      "upvotes": 1,
      "replies": {}
    },
    "hob64w6": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/hob64w6/",
      "text": "Whenever people come here to \"confess\" about their cheating it's always something like this that's really in no way close to actual cheating.",
      "author": "ThroawayPartyer",
      "created": 1639351165,
      "upvotes": 1,
      "replies": {
        "hocb5xr": {
          "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/hocb5xr/",
          "text": "Every once in a while, you get the \"I copied my test off chegg, how fucked am I?\"",
          "author": "needhelpne2020",
          "created": 1639370069,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hocb0z8": {
      "link": "/r/college/comments/reixz6/i_technically_cheated_on_my_final_what_will_happen/hocb0z8/",
      "text": "That's not cheating. He has to select it so you can see your answers and see what is correct. H consciously chose to do that, meaning he knew that this would be available to students. Nobody will fault you for using the resources your professor provides.",
      "author": "needhelpne2020",
      "created": 1639370000,
      "upvotes": 1,
      "replies": {}
    }
  }
}