{
  "sid": "oyhfsl",
  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/",
  "title:": "You don't have to drink or party if you don't want to",
  "text": "Since school is starting back up again I just wanted to make this post to help and warn people. \n\nIf you're not a drinker or partier don't feel like you have to go out and do those things because \"everyone else is doing it and it's part of the experience\". Not everyone is doing it, plenty of people don't drink or go out partying and they still have fun, they still make friends and they still have great memories. \n\nDon't feel obligated to do stuff you wouldn't normally do because your roommate or friends are doing it. It's okay to tell them no!",
  "author": "elyse-on-reddit",
  "created": 1628169752,
  "over_18": false,
  "upvotes": 1678,
  "upvote_ratio": 0.98,
  "comments": {
    "hd64mmf": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/hd64mmf/",
      "text": "This!!! I don't drink or do drugs or anything like that. Not because of religious reasons or anything of that nature, just because it's just not my cup of tea. I prefer to just stay in and veg out on the couch and watch YouTube videos. I'm also an introvert so that probably explains it.\n\nI really hate the idea that society pushes on us that you have to get blackout drunk every night to be \"cool.\" (I know I'm exaggerating lol, but I do that when I rant) What, so not drinking until I lose consciousness and puke or whatnot makes me a loser???? Like I'm going to fail at life just because I'd rather watch videos than get higher than Mount Everest???? Am I going to be a social outcast for the rest of my life because I don't torture my lungs by smoking a pack of cigarettes a day???? No, I won't. That's BS.\n\nI don't have a problem with people doing that stuff if that's what they're into, as long as it doesn't affect my life (shoutout to one of my suitemates last year who would smoke in our connected bathroom, making the suite smell like pot and forcing me to leave the room just to chill on YouTube at midnight because I couldn't deal with the smell) but 1) don't be like my suitemate and 2) don't try to push your lifestyle on other people. Not everyone is into pregaming 24/7.\n\nSorry for the rant, and thanks for coming to my TED talk lol :)",
      "author": "DanielaThePialinist",
      "created": 1631852523,
      "upvotes": 1,
      "replies": {}
    },
    "hb3xnlb": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/hb3xnlb/",
      "text": "I didnt drink at all in college. From mg experience this is what ill say (im not saying my experience is the knlg experience):\n\nI agree on everything said in the post. I think your experience will  depend alot on who your friends are. I was the ionly one of my friends who didnt drink. Nobody really pressured me to drink but i was asked on a routine basis about drinking, especially when people around me were drinking and i wasnt. Even though saying no once got people to stop asking, hearing it asked by 10 different people every night did get draining and having to answer why i dont drink. Again, nobody pressured me but i sometimes thought about drinking just to avoid getting asked. I never did though.\n\nI did want to hang out and party but because i didnt drink many people never kept me in the loop on a parties especially the friends i was closest to. I called them out on it once and they told me “we thought partying wasnt your thing”. Which i felt is an excuse they told themselves to not invite me. My friends did try after that and i appreciate they did but i could defientely tell i was always the 3rd wheel of the groupI\n. I never felt like i had a close bond with them and i think because i never drank with them we never created that close bond people create when they can get drunk together. I had a good time in colege but i wouldnt say i had all the fun i couldve had. Im slightly introverted so i also didnt do as much to find things to do outside mg friend group. I think the experience i had with my friends made me self conscience about not drinking in college.\n\nIm saying this to say: make sure you get friends who if they do drink, dont mind keeping you involved and if they dont, dont be afraid to be by yourself while you find new friends.",
      "author": "ea0995",
      "created": 1630445611,
      "upvotes": 1,
      "replies": {}
    },
    "hana8ci": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/hana8ci/",
      "text": "I go to a commuter school and there's very little \"college experience\" at it so it's always crazy to see posts like these",
      "author": "LUnacy45",
      "created": 1630124967,
      "upvotes": 0,
      "replies": {
        "haod6dq": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/haod6dq/",
          "text": "I actually use to go to a CC but it was very party heavy. Even more party heavy than the 4 year I went to.",
          "author": "elyse-on-reddit",
          "created": 1630154847,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "haf2vpe": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/haf2vpe/",
      "text": "People act like this is the only way to make friends. Does anyone actually make real friends at parties?",
      "author": "OhHiMarki3",
      "created": 1629982492,
      "upvotes": 1,
      "replies": {}
    },
    "h9mgx1w": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h9mgx1w/",
      "text": "Get wasted and if you don’t, you have the rest of your life to party and have fun",
      "author": "LizardKing50000",
      "created": 1629433340,
      "upvotes": 1,
      "replies": {}
    },
    "h7yxvvo": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7yxvvo/",
      "text": "in my uni, party is obligated for freshman student (the non alcohol party, but some of them still drinking it). the party is almost every week for a whole first semester and it's organized by the student association in my faculty. the purpose is to get to know each other with other students (but i think its more like time for the seniors to show off) and there is attendance check that we can't missed it more than twice. This is very serious rules. If we break it, we can't take our Bachelor's Certificates  from uni or we have to do it over in the next year with the new freshman. it's very depressing actually",
      "author": "notreadytobe20",
      "created": 1628277402,
      "upvotes": 3,
      "replies": {
        "h7z3n44": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7z3n44/",
          "text": "Sounds like you're from the U.K? That's different then, I'm talking about keggers and frat parties mostly. Parties in the U.S and the drinking culture is much different then you guys have.\n\nWe have organized parties too but they're usually just for people in sports or high honors. No alcohol either though.",
          "author": "elyse-on-reddit",
          "created": 1628279923,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h7yio9f": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7yio9f/",
      "text": "Agree, I’m now a junior and wished people wouldn’t have talked me into drinking hard liquor. Alcoholism runs in my family and it hasn’t been an easy ride. Take care of yourselves people",
      "author": "jonray_",
      "created": 1628270911,
      "upvotes": 2,
      "replies": {}
    },
    "h7wzjlh": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wzjlh/",
      "text": "If you dont drink, dont be that one sober person that’s too cool for the party. Alcohol makes it easier to do the lame shit like say “Aye” and bounce to songs that you don’t listen to. If you aren’t gonna drink, don’t be that person in the area acting too cool, making fun of the music shit like that just be chill if you not gonna drink",
      "author": "wooski29",
      "created": 1628241849,
      "upvotes": 3,
      "replies": {}
    },
    "h7wtlnr": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wtlnr/",
      "text": "I made a lot of my early college friends through local clubs and orgs. Those are the people i prefer to have a drink with. Any random party I've been to or was invited too was boring as hell and honestly depressing no matter how fun people seem to be having.\n\nIn my experience, make friends first, then party with these people. Not the other way around.",
      "author": "ctjfd",
      "created": 1628236705,
      "upvotes": 1,
      "replies": {}
    },
    "h7wpdsm": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wpdsm/",
      "text": "Speaking as a middle aged guy who didn't like to drink and party in college, I have always regretted not partying and socialising more back in college. Take that how you will.",
      "author": "z1lard",
      "created": 1628233171,
      "upvotes": 4,
      "replies": {}
    },
    "h7wmudd": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wmudd/",
      "text": "Don’t tell people what to do. Fascist",
      "author": "jmg850",
      "created": 1628231154,
      "upvotes": -2,
      "replies": {}
    },
    "h7wlaj3": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wlaj3/",
      "text": "When my friends urge me to drink more and I don't want to, I firmly say I'm good. I strongly encourage others to do the same.\n\nObviously you should have fun, network, and be social. But remember, you are always in charge of your own consumption and productivity.",
      "author": "MissionCattle",
      "created": 1628229971,
      "upvotes": 3,
      "replies": {}
    },
    "h7wgxdy": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wgxdy/",
      "text": "It’s also okay to try things new. Still be responsible but this is the time to try new things and see what you like or don’t like to do",
      "author": "joc307",
      "created": 1628226835,
      "upvotes": 1,
      "replies": {}
    },
    "h7wbqv2": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wbqv2/",
      "text": "I just graduated college without partying or drinking once. I had so much fucking fun with my favorite people going to dinner, movies, parks, road trips, getting snacks and take out, etc. I’d do it all again. Just do what you want with the people you want to. :)",
      "author": "dreamer0303",
      "created": 1628223519,
      "upvotes": 4,
      "replies": {}
    },
    "h7w927y": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w927y/",
      "text": "My co worker could not wrap his head around the fact that I don’t drink and I’m in college. When I told him he replied in all seriousness “I guess there are other things to do”",
      "author": "emo_goth_vegan",
      "created": 1628221992,
      "upvotes": 1,
      "replies": {}
    },
    "h7w8y0y": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w8y0y/",
      "text": "Do you. Think for yourself.",
      "author": "Kono_da_Dio",
      "created": 1628221930,
      "upvotes": 0,
      "replies": {
        "h7w9ek9": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w9ek9/",
          "text": "Yes ma'am! I wrote this because kids are going back to school and I want to let them know it's okay not to party and do the stereotypical college things.",
          "author": "elyse-on-reddit",
          "created": 1628222168,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h7w46nn": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w46nn/",
      "text": "Thank You! I do not drink and I am totally not a partying type. I have fun just by making friends, talking to people and maybe playing video games together. People including my parents are telling me to get involved in so many \"activities\" so I am a sociable person. Thanks for posting this, I now feel like there are more people like me and that I do not need to do things I am uncomfortable with.",
      "author": "SaintJay41202",
      "created": 1628219452,
      "upvotes": 6,
      "replies": {
        "h7w78x9": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w78x9/",
          "text": "No problem :) I just think its important for freshmen to realize that there's more to life than just partying and that they shouldn't feel like they have to do something just because everyone else is.",
          "author": "elyse-on-reddit",
          "created": 1628221047,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h7vvbxo": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vvbxo/",
      "text": "How do you find friends who want to be chill and boring though 😥",
      "author": "afunnywold",
      "created": 1628215078,
      "upvotes": 0,
      "replies": {}
    },
    "h7vttla": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vttla/",
      "text": "i’m going to a school that’s really conservative with that stuff (we’re not allowed to drink AT ALL). i don’t have the right to complain because i knew the rules going into it, but it’s still a little intimidating. how am i ever gonna get to experience that stuff?",
      "author": "Empathetic-Pear",
      "created": 1628214343,
      "upvotes": 1,
      "replies": {}
    },
    "h7vq35k": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vq35k/",
      "text": "DONT get plastered your first week of college. You won’t be a pussy or anything people call you for taking it easy. Figure out your limit and what you’re comfortable with. People who enjoy drinking know their limits and only drink with those that they are comfortable drinking with.",
      "author": "jz20rok",
      "created": 1628212536,
      "upvotes": 4,
      "replies": {}
    },
    "h7vkh68": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vkh68/",
      "text": "Actually there’s a rule and you absolutely have to and they’ll kick you out if you don’t",
      "author": "clever_cow",
      "created": 1628209766,
      "upvotes": -1,
      "replies": {}
    },
    "h7va0au": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7va0au/",
      "text": "True story from Wayback in the ancient days. I grew up during the Nancy Reagan “just say no“ era, and at my very first college party, some guy offered me some weed. My head was racing about peer pressure and just saying no, and I said “no thanks.” And he said “cool.”\n\nBe safe, and don’t do anything you don’t want to do.",
      "author": "CreatrixAnima",
      "created": 1628204632,
      "upvotes": 9,
      "replies": {}
    },
    "h7v88tt": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v88tt/",
      "text": "The real question is, how do I get invited to a party in the first place",
      "author": "ZestyLemon289",
      "created": 1628203804,
      "upvotes": 7,
      "replies": {}
    },
    "h7v4kpd": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v4kpd/",
      "text": "Im a college junior. It took me two years to find people that still wanted to hang out with me even though I don’t drink/party. Don’t do something you don’t want to do or will regret just to make people like you because they aren’t your friends anyways.",
      "author": "ChemistryxCat",
      "created": 1628202127,
      "upvotes": 7,
      "replies": {}
    },
    "h7v45p2": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v45p2/",
      "text": "u/elyse-on-reddit I am a junior in college and am not big on partying hard, but i do enjoy a beer or two or cocktail at the end of the day. My roommate, who is super cool, is a member of the PKT (Phi Kappa Tau) fraternity. I have always told my roommate that if he is ever in a situation where he has been drinking and needs help getting back to our dorm room, that he calls me or has a trustworthy friend call me so that i can help him make it back safely.",
      "author": "DConMont505",
      "created": 1628201941,
      "upvotes": 4,
      "replies": {}
    },
    "h7v0tjp": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v0tjp/",
      "text": "Just do it. You'll regret it later. If you're not a drinker, find your limits and don't act a fool. Just be safe and have fun. College is useless otherwise.",
      "author": "CosmicMegaDonkeys",
      "created": 1628200457,
      "upvotes": -6,
      "replies": {
        "h7v85a3": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v85a3/",
          "text": "I don't know. Some people can't get good grades unless they use 100% of their time studying.",
          "author": "odd-ironball",
          "created": 1628203759,
          "upvotes": -1,
          "replies": {
            "h7v8mlv": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v8mlv/",
              "text": "College is a learning place for many different things, not just your books. Spending 100% of you time studying is unhealthy. That's all.",
              "author": "CosmicMegaDonkeys",
              "created": 1628203983,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "h7u8ehm": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u8ehm/",
      "text": "Back in my old university it was very hard to make friends. I’m an international and it was a state school so everyone knew each other, and they weren’t keen on accepting internationals to their friend group. On top of that, if you didn’t drink or party a lot of people would exclude you because most of the unvifsoty was the type of people that cared only for booze.",
      "author": "ElBarro69",
      "created": 1628188622,
      "upvotes": 6,
      "replies": {}
    },
    "h7u0nnx": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u0nnx/",
      "text": "If you do choose to party make sure you get a pair of shit shoes,  I mean a pair of shoes that look nice but you don't care if they get ruined because they will get ruined. There's a lot of spilled beer vomit and other things on various basement floors And you will be walking through it. on a side note Do yourself a favor if you want to wear heels wear boots with closed toes,  Just trust me on this more than one of my female friends has gotten unpleasant things on their feet because they wore heels to a party.. If you are going clubbing and not to frat party  You might be OK with the heels but just have a pair of flat shoes that that you think are cute but you don't give a crap about to wear to parties and that sort of thing because trust me by the end of your 2nd quarter there will be a great deal of destruction associated with o'shoes and they will be in bad condition you're probably just going to want to toss them at the end of the year and get a new pair for the following year if you choose to drink and party",
      "author": "pygmypuffonacid",
      "created": 1628185514,
      "upvotes": 26,
      "replies": {}
    },
    "h7tyyxm": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tyyxm/",
      "text": "But if you do decide to drink full send it",
      "author": "ORCA_OF_WALLST",
      "created": 1628184822,
      "upvotes": -2,
      "replies": {}
    },
    "h7txvqx": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7txvqx/",
      "text": "This is a good reminder. You can still go out and meet people, but just hold the same cup all night long or drink water or the chaser. People should not feel pressured to do more than they feel comfortable.\n\nI went to a \"party school\", where just about everyone partied. But most people knew how to turn off the switch at the right time to get stuff done. Find your own pace and don't forget why you're at school in the first place.",
      "author": "Roxybird",
      "created": 1628184378,
      "upvotes": 21,
      "replies": {
        "h7u0x3t": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u0x3t/",
          "text": "Yes! Important! Also, pedialyte and eating helps you sober up more and avoid dehydration.",
          "author": "elyse-on-reddit",
          "created": 1628185623,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h7txnq3": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7txnq3/",
      "text": "Can I add - if you DO become interested in drinking, learn some alcohol safety first. Learn how many drinks would get you tipsy then drunk based on your weight. Learn what signs are for alcohol poisoning and how to handle that kind of emergency (call 911). Drink your first time around people you trust, and just try to observe how you feel after a drink or two. Don't drink more just because you're feeling good, at a certain point drinking more doesn't increase the good, fun part of drinking, you just make yourself more at risk of getting sick or blacking out. Eat food and hydrate before you drink, drink water while you drink. Don't drink in college without friends around, it's really important to be able to look out for one another, especially at larger parties. Always keep an eye on your drink. Don't drink to cope with mental illness, instead seek out healthy coping mechanisms, therapy, etc. Never drink and drive, and never ride with someone who's had alcohol or is under the influence of any other substances. \n\nThose are just some basic tips. Good luck, and yes, you do not have to drink at all if you don't want to. Good friends won't care and will respect your choices. If you don't like being around when they drink, if they're good friends, they'll be cool with trying to do things other than party / incorporate some hangouts that aren't centered around drinking. (But if they're just having a drink or two, it really won't make much of a difference when hanging out with them. There is a difference in a casual drink and \"drinking\" as the main reason for the hangout)",
      "author": "dontcry2022",
      "created": 1628184287,
      "upvotes": 119,
      "replies": {
        "h7vng2h": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vng2h/",
          "text": "And also learn the signs of [alcohol intolerance](https://en.wikipedia.org/wiki/Alcohol_flush_reaction), or \"Asian flush\":\n\n> Nausea and vomiting.\n\n> Rapid heartbeat (tachycardia) or heart palpitations.\n\n> Hypotension (low blood pressure).\n\n> Throbbing headache, fatigue and other hangover-like symptoms.\n\n> Stuffy nose.\n\n> Diarrhea.\n\n> Worsening asthma.\n\nBasically, if you feel like utter shit after only a few drinks, and feel sorta hungover very quickly, **stop drinking**. It's a genetic condition. Your body can't process alcohol properly and you're poisoning yourself - even more than is normal. If you keep drinking, you're at significantly higher risk of cancer. And your intolerance will never go away, no matter how much you drink. It will always, always suck for you and then you will get throat cancer. \n\nIf you're East Asian, there's a 30-50% chance you have alcohol intolerance (hence the \"Asian\" part of \"Asian flush\").",
          "author": "officially_anxious",
          "created": 1628211234,
          "upvotes": 28,
          "replies": {
            "h7xc8dd": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7xc8dd/",
              "text": "I was the 100th upvoter! Great advice by the way!",
              "author": "Affectionate_Act_743",
              "created": 1628251626,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h7ukm8m": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ukm8m/",
          "text": "Try to never free pour a drink always measure in terms of shots, that way 1) you know how much your drinking and 2) what your limits are",
          "author": "jr0d1",
          "created": 1628193598,
          "upvotes": 18,
          "replies": {}
        },
        "h7u0t8w": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u0t8w/",
          "text": "Yes good advice!",
          "author": "elyse-on-reddit",
          "created": 1628185578,
          "upvotes": 14,
          "replies": {}
        },
        "h7v3xsg": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v3xsg/",
          "text": "I don't get how people even have time to party. I studied at max efficiency during my first year, and I have no free time besides for sleep",
          "author": "odd-ironball",
          "created": 1628201843,
          "upvotes": -11,
          "replies": {
            "h7v9g7z": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v9g7z/",
              "text": "You study while scrolling through Reddit and watching YouTube. How is that efficient studying?",
              "author": "sourdoughobsessed",
              "created": 1628204368,
              "upvotes": 19,
              "replies": {
                "h7vawl8": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vawl8/",
                  "text": "Are you ignoring my chat messages?",
                  "author": "odd-ironball",
                  "created": 1628205062,
                  "upvotes": -1,
                  "replies": {
                    "h7vb0qu": {
                      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vb0qu/",
                      "text": "Yes. I’ve told you not to DM me a thousand times before.",
                      "author": "sourdoughobsessed",
                      "created": 1628205118,
                      "upvotes": 15,
                      "replies": {
                        "h7vchlb": {
                          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vchlb/",
                          "text": "Then how am I supposed to talk about what you plan on doing with my life?",
                          "author": "odd-ironball",
                          "created": 1628205822,
                          "upvotes": -2,
                          "replies": {
                            "h7vcuz4": {
                              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vcuz4/",
                              "text": "I hear you agreed to stop spamming Reddit and evading bans. Is that true?",
                              "author": "sourdoughobsessed",
                              "created": 1628205996,
                              "upvotes": 12,
                              "replies": {
                                "h7ve63v": {
                                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ve63v/",
                                  "text": "Is it true that you actually plan on getting me kicked out?",
                                  "author": "odd-ironball",
                                  "created": 1628206637,
                                  "upvotes": 1,
                                  "replies": {
                                    "h7vezot": {
                                      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vezot/",
                                      "text": "Is it true you promised to stop spamming Reddit? This includes making up stats.",
                                      "author": "sourdoughobsessed",
                                      "created": 1628207052,
                                      "upvotes": 4,
                                      "replies": {
                                        "h7vglvz": {
                                          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vglvz/",
                                          "text": "No, I only promised if you be transparent of what is going on",
                                          "author": "odd-ironball",
                                          "created": 1628207846,
                                          "upvotes": -2,
                                          "replies": {
                                            "h7vh3rc": {
                                              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vh3rc/",
                                              "text": "Nothing is going on. I know enough from what you volunteered though if I want. So why don’t you stop spamming and I won’t be forced to do anything with what I know.",
                                              "author": "sourdoughobsessed",
                                              "created": 1628208090,
                                              "upvotes": 6,
                                              "replies": {
                                                "h7vi9t1": {
                                                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vi9t1/",
                                                  "text": "What do you know? Please tell me",
                                                  "author": "odd-ironball",
                                                  "created": 1628208671,
                                                  "upvotes": -1,
                                                  "replies": {
                                                    "h7vk3po": {
                                                      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vk3po/",
                                                      "text": "Dave - I don’t know anything you didn’t share yourself.",
                                                      "author": "sourdoughobsessed",
                                                      "created": 1628209580,
                                                      "upvotes": 5,
                                                      "replies": {
                                                        "h7vm8kr": {
                                                          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vm8kr/",
                                                          "text": "What are you planning on doing?",
                                                          "author": "odd-ironball",
                                                          "created": 1628210638,
                                                          "upvotes": -1,
                                                          "replies": {
                                                            "h7vnij0": {
                                                              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vnij0/",
                                                              "text": "I haven’t decided yet. But maybe if you upheld your part of the agreement and stopped lying and spamming here then it would be an easy decision.",
                                                              "author": "sourdoughobsessed",
                                                              "created": 1628211268,
                                                              "upvotes": 6,
                                                              "replies": {
                                                                "h7vohju": {
                                                                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vohju/",
                                                                  "text": "You also haven't upheld your part of the agreement of being transparent.",
                                                                  "author": "odd-ironball",
                                                                  "created": 1628211747,
                                                                  "upvotes": -2,
                                                                  "replies": {
                                                                    "h7vqea6": {
                                                                      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vqea6/",
                                                                      "text": "I just told you. I haven’t decided. That’s the truth. Stop spamming.",
                                                                      "author": "sourdoughobsessed",
                                                                      "created": 1628212686,
                                                                      "upvotes": 5,
                                                                      "replies": {}
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    },
                                                    "h7vk0dt": {
                                                      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vk0dt/",
                                                      "text": "Stop it.",
                                                      "author": "SultanofShit",
                                                      "created": 1628209534,
                                                      "upvotes": 3,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "h7v4kfs": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v4kfs/",
              "text": "At my school there's a major Greek life scene. I think it depends on your major whether you really have time. It also depends a lot on how you pursue a work-life balance. I knew a guy who every Friday after class took the whole evening off to have a break and recharge, and he continued his studies the rest of the weekend. \n\nRest is important if you wanna study efficiently! You really gotta figure out what works for you to avoid burnout and make the most of your studies. Everyone's different though, it's a lot of trial and error to see what really works.",
              "author": "dontcry2022",
              "created": 1628202124,
              "upvotes": 9,
              "replies": {
                "h7v6rcz": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v6rcz/",
                  "text": "From my own experience, I really do need all the time I can get to study. My brain is just not good at learning.",
                  "author": "odd-ironball",
                  "created": 1628203128,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            },
            "h7v5qq8": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v5qq8/",
              "text": "C'mon Dave.  You told me your study habits.  It was far from optimal and you can use some of that time you spent doing other things to socialize or party if you wanted to.  \n\nAlso, some people sacrifice sleep or study time/grades to party some of the time.  So, it's a balancing act.",
              "author": "ENDofZERO",
              "created": 1628202664,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "h7tvwt2": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tvwt2/",
      "text": "Last year I told my roommates (who I’ve never met before moving in) that I’ve never drank before and they were so shocked. I didn’t know it was such a big deal to have never drank before and because of religious and personal reasons I don’t ever plan to.",
      "author": "sunshinexxxo16",
      "created": 1628183566,
      "upvotes": 13,
      "replies": {
        "h7tzsfu": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tzsfu/",
          "text": "Don't let them shame you. Plenty of people didn't drink alcohol in high school. Plenty of people choose not to drink. You don't owe anyone an explanation. Just give other people the same respect. I think people who do drink and people who don't drink both worry that the other people will judge them, but once you get a bit older you realize drinking is common in many cultures and people have tons of reasons for choosing not to, so everyone should just be respectful.",
          "author": "dontcry2022",
          "created": 1628185159,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "h7trx7r": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7trx7r/",
      "text": "[deleted]",
      "author": null,
      "created": 1628181921,
      "upvotes": -2,
      "replies": {
        "h7tzbg3": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tzbg3/",
          "text": "Most likely these things are lies, people make stuff like that up to scare the freshmen.",
          "author": "124579-okkkkkkkk",
          "created": 1628184964,
          "upvotes": 10,
          "replies": {
            "h7u0bd6": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u0bd6/",
              "text": "[deleted]",
              "author": null,
              "created": 1628185375,
              "upvotes": -1,
              "replies": {
                "h7u0px3": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u0px3/",
                  "text": "Freshmen can’t make other freshmen do anything. Remember that! Also other girls won’t force you to take shots etc and guys won’t either because they just want girls at the party. If you’re nervous I wouldn’t go, but I did enjoy partying in college and I just graduated and don’t regret it at all. You don’t have to get blacked out and sloppy, but it can be fun! And good to learn your limits now. But really you don’t have to do anything you don’t want to do. I’ve had people shove alcohol in my face, just tell them you don’t want it.",
                  "author": "124579-okkkkkkkk",
                  "created": 1628185539,
                  "upvotes": 7,
                  "replies": {}
                },
                "h7uj5q3": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7uj5q3/",
                  "text": "But In my opinion what I have experienced is that drinking (just a little) can be also really helpful for socialising with party members, because you doing the same activity (and it makes you talkative and relaxed...)",
                  "author": "bolli187",
                  "created": 1628193001,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h7tzihe": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tzihe/",
          "text": "\"mandatory shots\"? So they don't let you in if you don't drink?",
          "author": "house_MC",
          "created": 1628185046,
          "upvotes": 4,
          "replies": {}
        },
        "h7ts5hm": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ts5hm/",
          "text": "Girl, don't go! You seem like you're uncomfortable:(",
          "author": "elyse-on-reddit",
          "created": 1628182018,
          "upvotes": 9,
          "replies": {
            "h7tt1lx": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tt1lx/",
              "text": "Must’ve been difficult to come to that conclusion yea?",
              "author": "icroc1556",
              "created": 1628182378,
              "upvotes": -2,
              "replies": {}
            }
          }
        }
      }
    },
    "h7tqwqq": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tqwqq/",
      "text": "Never feel peer pressured to drink, smoke, so drugs, or anything that makes you uncomfortable is the real message",
      "author": "Lifedeather",
      "created": 1628181506,
      "upvotes": 11,
      "replies": {}
    },
    "h7tl4iy": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tl4iy/",
      "text": "This is the basic scenario that happens all the time:\n\n“Hey we are packing a bowl outside wanna smoke?”\n\n“Nah I don’t smoke”\n\n“That’s fine man you still wanna chill with us?”\n\n“Yah 🙂”",
      "author": "nhaire123",
      "created": 1628179128,
      "upvotes": 215,
      "replies": {
        "h7u0x4i": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u0x4i/",
          "text": "That's basically every encounter I've ever had no one's going to pressure you to do shit .I have never seen that happen. And if you're at a party where people are pressuring you that is not the party you want to be at.",
          "author": "pygmypuffonacid",
          "created": 1628185624,
          "upvotes": 95,
          "replies": {
            "h7u24rg": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u24rg/",
              "text": "True and they also say “good, don’t start. It’s bad for you.”😂😂",
              "author": "nhaire123",
              "created": 1628186107,
              "upvotes": 68,
              "replies": {
                "h7u3t67": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u3t67/",
                  "text": "And that's basically  The end of the conversation while everyone no everyone does heads outside and listen to music.\n\nDoing whatever their preferences or not doing anything, Most people are pretty chill in college",
                  "author": "pygmypuffonacid",
                  "created": 1628186778,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            },
            "h7ulelj": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ulelj/",
              "text": "Can confirm that I've been to a lot of parties where people were using drugs but never bugged anyone to try it and dropped the issue once I said \"I'm good\". Shit's too expensive to hand out like candy",
              "author": null,
              "created": 1628193928,
              "upvotes": 22,
              "replies": {}
            },
            "h7v1go5": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v1go5/",
              "text": "Usually the person who keeps nagging you to drink is probably just projecting their insecurities or alcohol abuse and wants everyone to be the same",
              "author": "Fuba301",
              "created": 1628200740,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "h7ukfos": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ukfos/",
          "text": "Lol usually they just think “more for me” 😆",
          "author": "jr0d1",
          "created": 1628193523,
          "upvotes": 18,
          "replies": {}
        },
        "h7v0hzd": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v0hzd/",
          "text": "And if this isn’t what ends up happening and they encourage/pressure you to smoke/drink/whatever it is, get out of there.\n\nThey aren’t worth it.",
          "author": "fallenangel36910",
          "created": 1628200316,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "h7tiznc": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tiznc/",
      "text": "I disagree with this advice. You'll have a bad social life if you do this. Even people who aren't hard partiers will think you're weird.",
      "author": "deepad9",
      "created": 1628178240,
      "upvotes": -23,
      "replies": {
        "h7tqc10": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tqc10/",
          "text": "There's other stuff to do besides drink and party. You could join clubs and meet people with similar interests, if you play an instrument you could join the band or orchestra, try out for a sports team, find intramural sports to play, join student government, or even just talk to the people in your classes. You don't need to party to have a social life. Of course there's nothing wrong with partying, but you don't have to do it to socialize.",
          "author": "anonymoususer666666",
          "created": 1628181270,
          "upvotes": 11,
          "replies": {}
        },
        "h7trh5a": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7trh5a/",
          "text": "You need to drink to be normal? That’s the worst advice I ever heard and is really sad tbh. Just because something isn’t the social norm doesn’t mean you are weird. If anything it makes you stand out and be more unique. Social life isn’t for everyone, some people like me literally don’t give af. College is for learning and getting a job not for partying. Alcohol is nothing good for you easier, if you wanna shove down poison and die faster while throwing up and acting like a fool while wasting your money and pretending to have friends and curing your depression then go ahead.",
          "author": "Lifedeather",
          "created": 1628181738,
          "upvotes": 13,
          "replies": {
            "h7tuguo": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tuguo/",
              "text": "Strong finish on that statement. Whew.",
              "author": "JirohSalonga",
              "created": 1628182967,
              "upvotes": 10,
              "replies": {
                "h7tulst": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tulst/",
                  "text": "Thanks, I thought it was pretty good. I had to encompass all the negatives of alcohol into that one statement and sentence LOL 😂",
                  "author": "Lifedeather",
                  "created": 1628183022,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "h7tuqfl": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tuqfl/",
              "text": "Exactly, remember when smoking tobacco cigarettes was cool? Would be surprised if people still drink alcohol and become blackout drunk in a few decades knowing how toxic it is to your body",
              "author": "Auraaaaa",
              "created": 1628183076,
              "upvotes": 4,
              "replies": {
                "h7u5c6g": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u5c6g/",
                  "text": "Alcohol has been a constant for nearly all of human society. Cigarettes were around for like less than 2 centuries.",
                  "author": "dirty1809",
                  "created": 1628187394,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "h7tmc3k": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tmc3k/",
          "text": "Nope! I went to two parties my entire college career, I had a wonderful social life and nobody thought I was weird :) I was actually quite popular too.\n\nThe only ones who partied at my school were people in Greek life, other then that nobody really partied unless they were their on daddies money and went just to party.\n\nI still drank but note much and if I did it was with 2 or 3 friends in our dorm.",
          "author": "elyse-on-reddit",
          "created": 1628179626,
          "upvotes": 17,
          "replies": {
            "h7u05qw": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u05qw/",
              "text": "Got bad news for ya bud",
              "author": "KING_COVID",
              "created": 1628185311,
              "upvotes": -3,
              "replies": {}
            },
            "h7tmn2e": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tmn2e/",
              "text": ">I still drank but note much and if I did it was with 2 or 3 friends in our dorm.\n\nThen this doesn't apply to you.",
              "author": "deepad9",
              "created": 1628179752,
              "upvotes": -10,
              "replies": {
                "h7u1fhb": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u1fhb/",
                  "text": "It's kinda rude to assume everyone can drink. Some people choose not to for medical reasons (medications, family history of alcoholism, mental illness w/o healthy coping mechanisms established). So it's really gross to pass judgement on everyone who doesn't drink",
                  "author": "dontcry2022",
                  "created": 1628185830,
                  "upvotes": 8,
                  "replies": {}
                },
                "h7tn1od": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tn1od/",
                  "text": "You're essentially saying people need to drink and party to have a social life but that's not true. \n\nNot everyone wants to drink and not everyone parties, there's nothing weird with that. I had a lot of friends who didnt drink or party at all and they were having a grand time too. \n\nMy friends weren't weird and they didn't miss out on a social life.",
                  "author": "elyse-on-reddit",
                  "created": 1628179920,
                  "upvotes": 17,
                  "replies": {}
                }
              }
            }
          }
        },
        "h7txknk": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7txknk/",
          "text": "Never went to a college party, never went out drinking, and never had a problem with my social life. \n\nI knew I’d hate the party life so I just never looked for it.",
          "author": "usuallyConflicted",
          "created": 1628184252,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h7tidaq": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tidaq/",
      "text": "but but i want to feel included :(",
      "author": "charlvs",
      "created": 1628177976,
      "upvotes": 31,
      "replies": {
        "h7tmj6r": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tmj6r/",
          "text": "You will feel included even if you dont party. I didn't party and I barely drank and I was very much included and had a good time.",
          "author": "elyse-on-reddit",
          "created": 1628179708,
          "upvotes": 40,
          "replies": {
            "h7umx57": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7umx57/",
              "text": "The sober people who can hang are possibly the best people at the party.",
              "author": "vr1252",
              "created": 1628194557,
              "upvotes": 15,
              "replies": {
                "h7v8njj": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v8njj/",
                  "text": "It also is a lot funnier when you’re one of the fee sober ones at a party tbh ^",
                  "author": "wheres-the-avocados",
                  "created": 1628203994,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "h7tq4fs": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tq4fs/",
          "text": "this was my mindset too but youll soon realized those partygoers arent the one you want to feel included in. its fun for a while but in the long run youd want to be included in a circle of genuine friends (people who dont pressure you to drink and has the same interests )",
          "author": "en-chica",
          "created": 1628181185,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "h7tgref": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tgref/",
      "text": "Maybe it's more of an american thing but kids don't really do that shit where I live. No one organizes college parties here in my town, I've never heard of it, I only see these things in movies. And tbh, I've never felt obligated to do any of it. I've never felt the desire to drink or party, especially with my awful introversion and anxiety and I don't feel like I'm missing out on anything. I honestly don't understand the entire concept of partying in college.",
      "author": "ana9997",
      "created": 1628177295,
      "upvotes": 13,
      "replies": {
        "h7truan": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7truan/",
          "text": "You might not have greek life on campus",
          "author": "Gocountgrainsofsand",
          "created": 1628181889,
          "upvotes": 12,
          "replies": {
            "h7yh5om": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7yh5om/",
              "text": "yeah, we don't have that",
              "author": "ana9997",
              "created": 1628270281,
              "upvotes": 1,
              "replies": {
                "h7yt2lh": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7yt2lh/",
                  "text": "There you go",
                  "author": "Gocountgrainsofsand",
                  "created": 1628275342,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h7tescs": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tescs/",
      "text": "Recently graduated senior here (that still feels so weird to say…)\n\nDuring my four years, I was never pressured to drink or smoke when I didn’t feel like it, nor did I receive any shit from anyone for turning it down. \n\nObviously my experience isn’t the be all end all, but if you find yourself around people who are genuinely pressuring you or giving you a hard time over it, they aren’t worth it. \n\nIf you do party, drink, or try any substances during your time college, do so under your own free will. And above all else, be safe!",
      "author": "bakedpotatowcheezpls",
      "created": 1628176456,
      "upvotes": 78,
      "replies": {
        "h7v0sru": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v0sru/",
          "text": "Just want to echo this! Starting my third year of MD (done with undergrad), and I’ve never had to drink/smoke/whatever it is to have fun with friends or peers at any point. Find people who respect your choices; they’re the ones you want around you in the long run.",
          "author": "fallenangel36910",
          "created": 1628200447,
          "upvotes": 4,
          "replies": {}
        },
        "h7wtxf8": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wtxf8/",
          "text": "Not like any of this advice matters because I struggle so much with classs.",
          "author": "odd-ironball",
          "created": 1628236989,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "h7tchli": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tchli/",
      "text": "And realize the friends made partying are not always the best",
      "author": "pkelsey93",
      "created": 1628175455,
      "upvotes": 64,
      "replies": {
        "h7te45b": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7te45b/",
          "text": "i so agree with this, it might be fun while youre at it but soon theyre useless as friends 🙃",
          "author": "en-chica",
          "created": 1628176164,
          "upvotes": 25,
          "replies": {
            "h7tkxcl": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tkxcl/",
              "text": "Took me a lil while to learn this.",
              "author": "pkelsey93",
              "created": 1628179045,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "h7tc8ym": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tc8ym/",
      "text": "you shouldn't be partying or gathering pretty much at all until your college knows what's going on with the Delta Variant of COVID-19, in my humble opinion",
      "author": "ConnorCarbon",
      "created": 1628175348,
      "upvotes": 8,
      "replies": {
        "h7tsdds": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tsdds/",
          "text": "If you’re vaccinated go at it in my opinion, it’s not your fault people aren’t getting vaxed. Leave it to the people who never do anything with people *cough Redditors* to decide whether or not you’re allowed to have fun despite being vaccinated.",
          "author": "TiVeL",
          "created": 1628182106,
          "upvotes": 15,
          "replies": {}
        },
        "h7tlgo3": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tlgo3/",
          "text": "No. I am selfish and want to see my friends again. I’ve been fully vaxxed for a couple months and followed all precautions while my friends across the country didn’t give a fuck and partied. I’m tired of being in isolation. Now a year from the start of the pandemic I’m frankly tired of this, I’m going back to normal.",
          "author": "nhaire123",
          "created": 1628179266,
          "upvotes": 29,
          "replies": {
            "h7tqvcy": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tqvcy/",
              "text": "I agree with you. I haven't left my city since Thanksgiving 2020, and I didn't see anyone the entirety of last semester until this summer when I got vaxxed because my parents were strict about covid and I wore a mask everywhere I went. I'm done wasting more of my life because 30% of the US doesn't want to get vaccinated. I'm vaccinated, my schools mandating vaccines, and cdc estimates that 95%+ of people in my college town are vaccinated. We'll be fine.",
              "author": "Fubb1",
              "created": 1628181490,
              "upvotes": 10,
              "replies": {}
            },
            "h7trw8i": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7trw8i/",
              "text": "Same.",
              "author": "Gocountgrainsofsand",
              "created": 1628181910,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h7te03i": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7te03i/",
          "text": "CDC jumped the gun and declared victory too early, probably to meet Biden’s “July 4th” goal. Now cases are going up again and they’re beginning to backtrack. But now it seems like that ship has sailed and it’s going to be *very* difficult to get the general public on board with new mask mandates/social distancing guidelines.",
          "author": "MBKM13",
          "created": 1628176115,
          "upvotes": 10,
          "replies": {}
        },
        "h7tin5v": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tin5v/",
          "text": "Thank you! Someone has to say it",
          "author": "NerdPerson10",
          "created": 1628178093,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7t6f4i": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7t6f4i/",
      "text": "And if you are going to party/drink, go to house parties of people you know. If you have to search for an invite it is not worth it.",
      "author": "kripplemk",
      "created": 1628173342,
      "upvotes": 622,
      "replies": {
        "h7tinrv": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tinrv/",
          "text": "This.",
          "author": "ScubbusAstolfo",
          "created": 1628178100,
          "upvotes": 79,
          "replies": {
            "h7uxatn": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7uxatn/",
              "text": "But what if you have no friends or don't know anyone?",
              "author": "odd-ironball",
              "created": 1628198926,
              "upvotes": 39,
              "replies": {
                "h7v0c3v": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v0c3v/",
                  "text": "Join some clubs, make friends with your neighbors/dorm mates, reach out to people in your classes/major! Truth be told, it’s pretty rare that the folks you first meet at random parties are gonna become good friends. Not that they can’t, just that it’s rare.\n\nAnd there’s also the safety aspect of showing up to these parties solo, especially if you’re female :)",
                  "author": "fallenangel36910",
                  "created": 1628200241,
                  "upvotes": 107,
                  "replies": {
                    "h7v0ii3": {
                      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v0ii3/",
                      "text": "But I don't have time to make friends in college",
                      "author": "odd-ironball",
                      "created": 1628200323,
                      "upvotes": -43,
                      "replies": {
                        "h7v7zxy": {
                          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v7zxy/",
                          "text": "If you don’t have time to make friends, how are you going to have time to go to parties? Why would they invite you if you don’t have time?",
                          "author": "WhiteMexiican",
                          "created": 1628203692,
                          "upvotes": 48,
                          "replies": {}
                        },
                        "h7v44x9": {
                          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7v44x9/",
                          "text": "A lot of my friends were people I studied and did homework with. If you do something similar then you should be able to have time for friends, even if you don’t hangout outside of academics too much.",
                          "author": "Cyto_Skeletal",
                          "created": 1628201931,
                          "upvotes": 26,
                          "replies": {}
                        },
                        "h7vecrk": {
                          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7vecrk/",
                          "text": "then you don't have time to party",
                          "author": "camisrutt",
                          "created": 1628206729,
                          "upvotes": 22,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h7wikgh": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7wikgh/",
                  "text": "Greek life",
                  "author": "REEEEEforMe",
                  "created": 1628227988,
                  "upvotes": 1,
                  "replies": {}
                },
                "h7w49mj": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w49mj/",
                  "text": "Just be a bit more sociable man. You have to know people!",
                  "author": "SaintJay41202",
                  "created": 1628219493,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h7tku4d": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tku4d/",
          "text": "fully agree with this comment here",
          "author": "cherryari",
          "created": 1628179008,
          "upvotes": 15,
          "replies": {}
        },
        "h7us2gv": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7us2gv/",
          "text": "The issue is that I am never going to get invited, so I have to search",
          "author": "odd-ironball",
          "created": 1628196703,
          "upvotes": 1,
          "replies": {
            "h7ut0xb": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ut0xb/",
              "text": "Well, the best way to get invited is to socialize and make friends from people in your dorm, your class, or from you clubs. \n\nYou spend a lot of time on reddit, so you could take some of the time you spend on reddit and devote it to socializing and meeting people.",
              "author": "ENDofZERO",
              "created": 1628197108,
              "upvotes": 35,
              "replies": {}
            }
          }
        }
      }
    },
    "h7t12tp": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7t12tp/",
      "text": "yes. I'm glad someone said it. you don't have to drink or party. actually most people who are successful in college don't.",
      "author": "aguafreska",
      "created": 1628171992,
      "upvotes": 15,
      "replies": {
        "h7tam8r": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tam8r/",
          "text": "This isn’t necessarily true. Most successful people in college are sociable, balanced individuals that do attend parties while still maintaining their academics. There’s nothing wrong with not partying, but most college kids do.",
          "author": "stilldreamingat2am",
          "created": 1628174739,
          "upvotes": 62,
          "replies": {
            "h7tdezm": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tdezm/",
              "text": "I was gonna say depends on the major too. I went to an engineering college and it was very much a party hard and study hard mentality those that couldn't balance it had to reevaluate. Some people partied way too hard but still got good grades with minimal effort. But still it varies from person to person.",
              "author": "Ludicrous_Tauntaun",
              "created": 1628175858,
              "upvotes": 22,
              "replies": {}
            },
            "h7tr7iz": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tr7iz/",
              "text": "Those who party usually fail classes or end up dropping out. Not saying everyone does but a large percentage do, backed up even more so at my college as well.",
              "author": "Lifedeather",
              "created": 1628181630,
              "upvotes": -12,
              "replies": {
                "h7tszje": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tszje/",
                  "text": "This is just blatantly false, though. I partied hard and never failed a class or dropped out. In fact, mostly all of the people in my peer group (not necessarily friends, but associates) partied and all graduated roughly at the same time together. \n\nSome of my friends from high school did drop out freshman year, but ironically, they didn’t party. You can’t say that most people that attend college parties drop out because a HUGE part of the college experience is partying. That would mean that the vast majority of your average college student drops out and that’s simply not true. \n\nThere’s absolutely nothing wrong with not partying. But this whole elitist idea towards college parties from people that don’t party is just ...silly.",
                  "author": "stilldreamingat2am",
                  "created": 1628182355,
                  "upvotes": 11,
                  "replies": {
                    "h7ttcjp": {
                      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ttcjp/",
                      "text": "Yes, I did mention it did not included everyone. I said not everyone does but a majority. You can’t base it on too much of your personal experience as a student and what you seen. Don’t try to use the strawman argument either. Everywhere is different, for example in a party school my friend is at, they told me many students came to party than dropped out because they couldn’t keep up. My school to, the advisor said many students in harder majors waste time partying and can’t keep up with the rigorous academics and forced to leave since their grades so low.",
                      "author": "Lifedeather",
                      "created": 1628182503,
                      "upvotes": -8,
                      "replies": {
                        "h7ttqm9": {
                          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ttqm9/",
                          "text": "Using the terms “usually” and “large percentage” sort of implies that it happens more than not, but okay I misunderstood.",
                          "author": "stilldreamingat2am",
                          "created": 1628182664,
                          "upvotes": 9,
                          "replies": {
                            "h7tu5lh": {
                              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tu5lh/",
                              "text": "My bad for the wording as well. You are good. Just wanted to clarify and represent my view/stance.",
                              "author": "Lifedeather",
                              "created": 1628182838,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h7sxukp": {
      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7sxukp/",
      "text": "Take it this way: Yes, you do have to drink.  You don't have to drink alcohol, but just having a glass in your hand will make everybody feel better.",
      "author": "toolnotes",
      "created": 1628170492,
      "upvotes": 207,
      "replies": {
        "h7t4vy2": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7t4vy2/",
          "text": "Get a cup, fill it up with water, drink that all night. If anyone questions why your drinking water just say your pacing yourself and don’t want to puke/blackout/be hung over tomorrow.",
          "author": "saltwatertaffy324",
          "created": 1628172989,
          "upvotes": 128,
          "replies": {
            "h7tb0c3": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tb0c3/",
              "text": "Why can’t one just say, “ I’m drinking water because I like water.”",
              "author": "NoSpaceAlien",
              "created": 1628174883,
              "upvotes": 143,
              "replies": {
                "h7u7crn": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7u7crn/",
                  "text": "Asking the right questions.\n\nThe answer is: you can, and you should. You don't owe anyone anything.",
                  "author": "lingh01",
                  "created": 1628188204,
                  "upvotes": 30,
                  "replies": {}
                },
                "h7tmtyw": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tmtyw/",
                  "text": "Because then you'd look like a healthy, responsible student 😉",
                  "author": "enriqueg9031",
                  "created": 1628179831,
                  "upvotes": 67,
                  "replies": {
                    "h82o0jb": {
                      "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h82o0jb/",
                      "text": "The horror",
                      "author": "Carerx",
                      "created": 1628355692,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "h7uvdce": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7uvdce/",
                  "text": "My friends that do drugs wouldn't give a fuck if you're drinking water or not.",
                  "author": "Hfingerman",
                  "created": 1628198103,
                  "upvotes": 8,
                  "replies": {}
                },
                "h7towr6": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7towr6/",
                  "text": "because they surround themselves with garbage people. Any one with reasonable friends respect decisions of others like actual adults. I'm absolutely dumbfounded this post even needed to be posted. No wonder older people always refer to college students as \"kids\" clearly they can't even think for themselves.",
                  "author": "jhf6782",
                  "created": 1628180686,
                  "upvotes": 23,
                  "replies": {}
                },
                "h7w6z8s": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7w6z8s/",
                  "text": "r/hydrohomies",
                  "author": "escapefromreality42",
                  "created": 1628220908,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h7td26e": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7td26e/",
              "text": "Yep.. or, \"naw man I'm still recovering from last night\"",
              "author": "e4e5nf3",
              "created": 1628175704,
              "upvotes": 27,
              "replies": {}
            }
          }
        },
        "h7tylcc": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tylcc/",
          "text": "Or people can make themselves feel better by respecting others' decisions. It's really no one's business how many drinks another person has had or if they've had any at all. Parties, while they are for drinking, they're also for socializing. People can socialize a bit without drinking.   \n\n\nA bit of an aside, I was kind of uncomfortable at parties when I didn't drink just because it was weird to see everyone else drunk and talk to them when I wasn't also drunk. I still had some fun though. I think over time people who don't drink will get a feel for whether parties are the most worthwhile place to go to socialize. Everyone's different, how the experience goes depends on who all you go out with, what the vibe is, etc.",
          "author": "dontcry2022",
          "created": 1628184665,
          "upvotes": 18,
          "replies": {}
        },
        "h7tdnhy": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tdnhy/",
          "text": "Youll also be offered a drink a lot less, so if you're like me and you like to go out and you do sometimes drink but it's not really your thing you'll feel a lot less pressure/ uncomfortable not drinking.",
          "author": "flutebythefoot",
          "created": 1628175962,
          "upvotes": 22,
          "replies": {}
        },
        "h7t4tl8": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7t4tl8/",
          "text": "Get a cup, fill it up with water, drink that all night. If anyone questions why your drinking water just say your pacing yourself and don’t want to puke/blackout/be hung over tomorrow.",
          "author": "saltwatertaffy324",
          "created": 1628172974,
          "upvotes": 4,
          "replies": {}
        },
        "h7tf9e0": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7tf9e0/",
          "text": "hahahah very solid point",
          "author": "succsuccboi",
          "created": 1628176659,
          "upvotes": 2,
          "replies": {}
        },
        "h7t4uhn": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7t4uhn/",
          "text": "Get a cup, fill it up with water, drink that all night. If anyone questions why your drinking water just say your pacing yourself and don’t want to puke/blackout/be hung over tomorrow.",
          "author": "saltwatertaffy324",
          "created": 1628172980,
          "upvotes": 0,
          "replies": {}
        },
        "h7ty460": {
          "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ty460/",
          "text": "wont purposefully holding a cup of water all night seem abit rapey as if you are trying to stay sober to take advantage of people",
          "author": "iwanttodiebutdrugs",
          "created": 1628184471,
          "upvotes": -12,
          "replies": {
            "h7ubu1g": {
              "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7ubu1g/",
              "text": "No. People drink water or soda if they are the sober driver, for religious reasons, for personal reasons. If everyone  who drinks water is “rapey” then there are some bigger issues we need to address. Aside from that, water can look like white rum, vodka, silver tequila. Water is often used to slow or address the effects of alcohol as well.",
              "author": "LallybrochSassenach",
              "created": 1628189997,
              "upvotes": 10,
              "replies": {
                "h7uc1al": {
                  "link": "/r/college/comments/oyhfsl/you_dont_have_to_drink_or_party_if_you_dont_want/h7uc1al/",
                  "text": "aha yeah fair point\n\nAmerican vandal really got me overthinking parties😂",
                  "author": "iwanttodiebutdrugs",
                  "created": 1628190077,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634056021
}