{
  "sid": "rhfhjm",
  "link": "/r/college/comments/rhfhjm/who_can_i_bring_this_issue_to/",
  "title:": "Who can I bring this issue to?",
  "text": "Basically my advisor needed to approve me to register for a course. It took weeks for him to get back to me and when I emailed him the necessary information back he never replied. I checked today course is still not registered so I emailed him again (at this point its been 2 months of me trying to register for this course) an automatic reply informs me he NO LONGER WORKS AT MY SCHOOL. I email the general advising for my major with all the info to register and they basically say “sore luck there’s no spots wait and see if something opens up”. \n\nThis would be okay if I wasn’t supposed to graduate next semester. Now they are basically telling me to push back my graduation, internship and an entire cross country move for a course that they require ONLY at my specific school to graduate. I want to know who I can go to and beg them to let me take it or scream at so they have to let me? I’m just frustrated and pissed.",
  "author": "Informal_Inside4210",
  "created": 1639619677,
  "updated": 1639787828,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hoq50fm": {
      "link": "/r/college/comments/rhfhjm/who_can_i_bring_this_issue_to/hoq50fm/",
      "text": "possibly the dean of your major? might be able to pull some strings. you could also try to reach out to the prof who teaches it",
      "author": "rynpickles",
      "created": 1639619907,
      "upvotes": 2,
      "replies": {}
    },
    "how7xbg": {
      "link": "/r/college/comments/rhfhjm/who_can_i_bring_this_issue_to/how7xbg/",
      "text": "Exact same thing happened to me last semester. Needed my advisor to accept me into a class and she went and quit the university on me. I messaged the dean of the engineering department of my college and she was able to help me.",
      "author": "lootcaker",
      "created": 1639729794,
      "upvotes": 1,
      "replies": {}
    }
  }
}