{
  "sid": "ptehcq",
  "link": "/r/college/comments/ptehcq/reputable_programming_certificates/",
  "title:": "Reputable Programming Certificates",
  "text": "**TLDR:**\n\n\\------------------------------------------  \nI will be free for a whole year most likely until I'm eligible for an Access to HE in IT course. meanwhile, I want to build an ePortfolio and certificates seem to be a good choice (E.g. Microsoft's certificates/exams).  \n\n\nSo what reputable programming certificates do you recommend for someone with minimal knowledge of programming (mostly python, I can build a simple calculator or a script that organizes files depending on their extension for example)  \n\\------------------------------------------  \nHello,  \nI live in London, Harrow (just moved to harrow) my current situation goes like this:  \n\n\nI'm 18, and when I was 17 I couldn't finish the BTEC level 3 extended diploma in IT, but still got a pass for the first year because of covid so now I have a subsidiary diploma (60 credit).  \n\n\nI got depressed for a little while, but when I got back on track, I was late to apply to another college and the same college wouldn't accept me for not doing enough work. So my only option at the time was Open University. I applied for the BSc in computer science, and it went well for the first few months. I was getting 80-90/100 on my first 2 assignments and I was pretty happy with it... except it was online so I was so bored and felt like sh!t.  \n\n\nAt some point, some family conflict that was boiling reached its melting point, and the house then felt so different. I couldn't focus on anything, it was just too overwhelming to do anything. after some calming down, the family decided that moving to Sweden would be the best option, kinda like a reset button- it's too complicated to explain.  \n\n\nAt the time, it was official, we were moving, so all my stress kinda dropped and since I was late for my assignments this time, I felt like there is no use getting back to studying as we will start a new life, with a different education system that is kinder and more forgiving (apparently).  \n\n\nAfter a month in a half in Sweden trying to find a place to settle, we just couldn't find any affordable place that is right for us- that and we didn't realize how political and different Sweden was in that period (Idk if still is rn), so we were pretty much forced to get to London and instead move to a different area, so we moved to Harrow.  \n\n\nNow I had to see what I can do in terms of education, I checked Open Uni, I was still enrolled but all the assignments are past due. I asked the teacher and they told me of the deferral system, where I can restart the year on a different date and keep some of my progress. now I'm still awaiting further information on this, but this is what I know so far.  \n\n\nI checked with a University that I was going to go to after one year in Open Uni, they told me they cannot accept me with what I have, even for foundation year, and told me that my only option is doing an access course and with it, I can skip foundation year, or re-doing Open Uni and getting accepted to the second year of the Uni I want.  \n\n\nI checked colleges in my area, one that has access course for IT and they told me I'm too young and advised that I redo the BTEC level 3, so I went to the second bigger one, and they told me because my subsidiary diploma is on the old qualification or something it would be \"difficult\" to enroll for a full 2-year BTEC level 3 extended diploma for some reason and that my only options are doing a different subject (hell naw) or finding a college that is still doing the old qualification, which there isn't as far as I know.  \n\\------------------------------------------  \n**My Options TLDR:**  \n\n\nUnless the second college contacts me back telling me they were able to let me do BTEC level 3 IT there, my current options are as follows:  \n\\- do a different subject BTEC level 3  \n\\- re-do Open Uni first year  \n\\- wait until I'm 19 to do the Access to HE course, and meanwhile, build up an ePortfolio for a better chance of acceptance, which is what this post is about- finding the right things to put on my ePortfolio, hence Certificates.  \n\n\nSo, what do you think I should do? and if you have any experience with Programming Certificates (E.g. Microsoft's certificates/exams), please let me know. I have no idea where to start looking or what to do for them.  \n\\------------------------------------------  \nThank you, kind strangers.",
  "author": "WolfyGoofy",
  "created": 1632337363,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hdw1f3t": {
      "link": "/r/college/comments/ptehcq/reputable_programming_certificates/hdw1f3t/",
      "text": "I'd ask this question in:  \n\n/r/cscareerquestions   \n\n/r/learnprogramming",
      "author": "VA_Network_Nerd",
      "created": 1632345332,
      "upvotes": 1,
      "replies": {
        "hdw1nir": {
          "link": "/r/college/comments/ptehcq/reputable_programming_certificates/hdw1nir/",
          "text": "I was looking for subreddits to post this on, but didn't know where exactly so I posted in a bunch of subreddits that I think this is relevant for. I will check the ones you suggest as well.\n\nApologies",
          "author": "WolfyGoofy",
          "created": 1632345513,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdvtnus": {
      "link": "/r/college/comments/ptehcq/reputable_programming_certificates/hdvtnus/",
      "text": "create a github account and start getting a record of you making and breaking stuff",
      "author": "GoldRequest",
      "created": 1632339765,
      "upvotes": 1,
      "replies": {
        "hdw1z99": {
          "link": "/r/college/comments/ptehcq/reputable_programming_certificates/hdw1z99/",
          "text": "I was planning on doing that too, but I want to know what would be appealing? I don't want to just making things just because I wanted to or that they are fun, I want something that would seem useful or made by someone who clearly understands programming, you know?\n\nIf you know what I mean, and you have programming experience, can you suggest me projects I should make? or perhaps just program features that would be useful and functional?\n\nHonestly, I'm going into this kinda blind.",
          "author": "WolfyGoofy",
          "created": 1632345741,
          "upvotes": 1,
          "replies": {
            "hdwjmmt": {
              "link": "/r/college/comments/ptehcq/reputable_programming_certificates/hdwjmmt/",
              "text": "Personally, I think you should just make stuff you want to and think are fun. A github doesnt have to be a job resume, but it should show what type of person you are and what you like to work on.",
              "author": "GoldRequest",
              "created": 1632355531,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634056671
}