{
  "sid": "q3hnyv",
  "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/",
  "title:": "Roomate’s girlfriend is staying over all the time",
  "text": "I’m a freshman in college and it’s my third week here. I live in a triple and one of my roommates is a nice guy. Trouble is, he already has a girlfriend and she spends every waking moment in our dorm. This includes the nights. I don’t think she has ever slept in her own dorm before.\n\nI’m an introvert so I like to have my own time every once in a while so this is kind of a problem when their annoying flirting and making out is in my space. It gets even worse when I have a hard day and I’m tired and want to chill in my bed but I can’t go inside the dorm because they are having sex.\n\nAnd the girlfriend is super annoying too. She’s the type of girl who is really mean to everybody and thinks she’s the funniest person in the world when really she’s just an asshole.\n\nIt’s gotten really bad over the last couple of days. Lately she has been staying at the dorm even when her boyfriend isn’t even here. Apparently she is having trouble with her roommate so she can’t stay go to her dorm. So there is a lot of times I come in to see her sleeping in bed so I can’t just relax. My other roommate isn’t in the dorm that often so I can’t really talk to him about this because I feel like he would take her side. What is a way I can tell her to leave without sounding like an asshole or her yelling at me?",
  "author": "Ebear0702",
  "created": 1633637852,
  "updated": 1634083163,
  "over_18": false,
  "upvotes": 453,
  "upvote_ratio": 0.98,
  "comments": {
    "hfrx4sc": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfrx4sc/",
      "text": "There's usually rules in the dorm agreement about other people staying in them for more than a day or so. I would take it up with the RA.",
      "author": "NinjaLorian",
      "created": 1633640029,
      "upvotes": 523,
      "replies": {
        "hfrxdny": {
          "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfrxdny/",
          "text": "I feel like my roommate would get mad at me for “snitching” though.",
          "author": "Ebear0702",
          "created": 1633640135,
          "upvotes": 237,
          "replies": {
            "hfs0ban": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfs0ban/",
              "text": "Say you want to remain anonymous. RA should be able to figure something out.",
              "author": "SeeDontLook",
              "created": 1633641414,
              "upvotes": 225,
              "replies": {
                "hfteknx": {
                  "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfteknx/",
                  "text": "Especially if she is in the room without him.",
                  "author": "chocolatechipsims",
                  "created": 1633666107,
                  "upvotes": 95,
                  "replies": {}
                },
                "hftt3zp": {
                  "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftt3zp/",
                  "text": "Smart move. the couples would never know who reported them when OP's the only roommate they have",
                  "author": "cmvmania",
                  "created": 1633676519,
                  "upvotes": 85,
                  "replies": {
                    "hftw6jj": {
                      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftw6jj/",
                      "text": "Uhhh there is another roommate, OP said they’re in a triple",
                      "author": "RedAlderCouchBench",
                      "created": 1633679159,
                      "upvotes": 51,
                      "replies": {}
                    },
                    "hfuqiav": {
                      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfuqiav/",
                      "text": "There is another roommate. And the RA doesn’t say have to say someone reported them (that wouldn’t be a giveaway at all!), they could easily just make up something “Hey we are going around making sure everyone is in their assigned rooms” or something like that.",
                      "author": "SeeDontLook",
                      "created": 1633700765,
                      "upvotes": 36,
                      "replies": {
                        "hfuw8ht": {
                          "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfuw8ht/",
                          "text": "No, that feels like it would be either obviously or ignored.",
                          "author": "undeadpickels",
                          "created": 1633703381,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hfv1vlu": {
                  "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv1vlu/",
                  "text": "remain anonymous....in a three person room? that’s not possible",
                  "author": "ope-das-my-b",
                  "created": 1633705816,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "hfry79c": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfry79c/",
              "text": "Tough...its as much your room as it is his.",
              "author": "NinjaLorian",
              "created": 1633640486,
              "upvotes": 313,
              "replies": {}
            },
            "hfs91pv": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfs91pv/",
              "text": "Think of how much money you're paying for this room. Talk to your roommate first and be firm that you need your room as a place you can be and tell him you'll have to go to the RAs to fix it if he can't. If nothing changes think some more about how much money you're paying for this room and snitch your little heart out.",
              "author": "LandoSyztem",
              "created": 1633645324,
              "upvotes": 111,
              "replies": {}
            },
            "hftcgb9": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftcgb9/",
              "text": "If he has a problem with it he can find a different room to cause problems in.",
              "author": "whathaveyoudoneson",
              "created": 1633664838,
              "upvotes": 30,
              "replies": {}
            },
            "hfthp4c": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfthp4c/",
              "text": "Tell the RA anonymously. they will prolly assume the RA saw her spending too many nights there not that u told",
              "author": "Danaestrellavilla",
              "created": 1633668066,
              "upvotes": 18,
              "replies": {}
            },
            "hfv0pax": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv0pax/",
              "text": "Is she paying to stay in your room? I didn’t think so. Tell the RA.",
              "author": "genz027",
              "created": 1633705314,
              "upvotes": 12,
              "replies": {}
            },
            "hftxu0j": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftxu0j/",
              "text": "There's more to it than that it's all about an open line of communication",
              "author": "WaRzXAttack",
              "created": 1633680677,
              "upvotes": 9,
              "replies": {}
            },
            "hftkmzg": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftkmzg/",
              "text": "It's not snitching if the situation is affecting your personally.",
              "author": "themagicalasianhobo",
              "created": 1633670041,
              "upvotes": 18,
              "replies": {}
            },
            "hfup69k": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfup69k/",
              "text": "Ultimately it’s a case of either man up and make it stop or just Stfu and deal with it",
              "author": "Jmc_da_boss",
              "created": 1633700124,
              "upvotes": 3,
              "replies": {}
            },
            "hfusuj4": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfusuj4/",
              "text": "I would too. Talk to him and establish rules, if he's a cool guy as you say I'm sure he will understand",
              "author": "Gustave_B",
              "created": 1633701855,
              "upvotes": 2,
              "replies": {}
            },
            "hfv8scu": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv8scu/",
              "text": "The room is yours too.",
              "author": "----NSA----",
              "created": 1633708720,
              "upvotes": 1,
              "replies": {}
            },
            "hfvp4sc": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfvp4sc/",
              "text": "Have you talked to him first?",
              "author": "guy_with-thumbs",
              "created": 1633715493,
              "upvotes": 1,
              "replies": {}
            },
            "hfvxr9p": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfvxr9p/",
              "text": "Then he can be mad and wrong lol. That’s his problem. There are rules. You didn’t agree to a 4th roommate.",
              "author": "OutsmartedTheAdmins",
              "created": 1633719166,
              "upvotes": 1,
              "replies": {}
            },
            "hfw04fc": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfw04fc/",
              "text": "I was an RA and had to deal with situations like this all the time and could most likely figure out an anonymous way to approach this. That being said, you should learn how to communicate with whoever you’re living with. The RA is there to help facilitate if someone is consistently breaking rules or being unreasonable. So if you haven’t talked to him about it, do that. If he doesn’t listen, it’s not snitching. He’s disregarding your campus housing policies on top of not respecting the space you are paying for or listening to your reasonable boundaries\n\nEdit: all of you, including the gf, need to communicate with your roommates. Her roommate problems are not yours to solve they are hers and she is impeding on your space. If she tells you it’s no use, tell her she should request the help of an RA. \n\nA tip for asking her to leave: say you want to take a nap, say you want to be alone, you need a quieter less populate space for hw, or you need to make a private phone call. If she tries to argue tell her it’s your room and you’re asking her to leave please. If she doesn’t that’s when you can let her know you can and will make a complaint to the RA. She has to know she’s wrong for staying there when it’s not her room. Any argument she makes is automatically trumped by the room being yours.",
              "author": "Former_Afternoon9662",
              "created": 1633720135,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hfv3d8h": {
          "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv3d8h/",
          "text": "You most likely signed some sort of roommate contact that included something along the lines of how many nights a week a guest can stay or something about asking permission before having a guest over. At the very least make him agree to a couple nights a week where you have time to yourself, that’s fair considering he has asked you stay out of the dorm so he can have sex. \n\nI had a bad roommate my first semester of college, it’s not an excuse to be living out of someone else’s dorm.",
          "author": "anonymous_gam",
          "created": 1633706452,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfs9smx": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfs9smx/",
      "text": "Talk to your roommate. You signed up for 2 roommates not 3. They are crossing a boundary. It’s not her room, period. If she is having roommate problems then she needs to figure that out for herself instead of making a rift in your living situation. I went through something similar when I was in the dorms and it only got worse the longer it took me to say something.",
      "author": "rynpickles",
      "created": 1633645676,
      "upvotes": 272,
      "replies": {
        "hfthtgx": {
          "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfthtgx/",
          "text": "she's probably the 'roommate problem' at her place too",
          "author": "Maxisorgan",
          "created": 1633668143,
          "upvotes": 117,
          "replies": {
            "hfv3hcf": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv3hcf/",
              "text": "She probably has a roommate who said no to having the bf basically live there so she’s now playing victim and saying her roommate is bad.",
              "author": "anonymous_gam",
              "created": 1633706501,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "hfuty6t": {
          "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfuty6t/",
          "text": "He lives in a triple, but the point still stands.",
          "author": "Brewdrizy",
          "created": 1633702361,
          "upvotes": 7,
          "replies": {
            "hfuxnfp": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfuxnfp/",
              "text": "yep. him + 2 roommates makes a triple",
              "author": "paisleyboxes",
              "created": 1633703998,
              "upvotes": 11,
              "replies": {}
            },
            "hfv37b5": {
              "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv37b5/",
              "text": "Yes, he lives in a triple: OP has one bedroom and he has two roommates who have the other two bedrooms. Therefore, he has two roommates. The girlfriend makes three.",
              "author": "MrsRadarOreilly",
              "created": 1633706383,
              "upvotes": 2,
              "replies": {
                "hfv3s4x": {
                  "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv3s4x/",
                  "text": "I confused myself. Carry on.",
                  "author": "Brewdrizy",
                  "created": 1633706628,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfsyl7s": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfsyl7s/",
      "text": "find a time to talk to your roommate (pull him aside while he’s home and ask to speak in private, or text him to see when he’s available to talk, etc), if you want things to stay nice then maybe be casual about it, tell him to talk to his girlfriend, but if the problems don’t fix after talking to him, you’re going to have to be more firm or just get the RA involved\n\ni’m dealing with similar stuff with my roomie right now (but we’re girls and she just has her boyfriend over all the time, he’s practically living with us), it hasn’t been as big of a deal just because i’m used to having siblings and don’t mind someone constantly being in my space, but even with that, i still had to lay some ground rules with my roommate about how much he can be over and what i’m comfortable with them doing in the room (i’m not okay with being sexiled from my own room, and i made that clear)",
      "author": "holdontoyoursoul",
      "created": 1633657772,
      "upvotes": 62,
      "replies": {
        "hftgn4k": {
          "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftgn4k/",
          "text": "\"Sexiled\" lol...I hadn't heard that one before.",
          "author": "EternityNotes",
          "created": 1633667400,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "hft63u1": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hft63u1/",
      "text": "I dealt with a similar situation to this in sophomore year of college. My roommate at the time wasn’t having sex in the dorm room but he had guests over constantly, to the point where there was a couch in the middle of the room for a few weeks. \n\nMy advice would be to sit down with your roommate at a time when his girlfriend is not around and tell him your not comfortable with her being around so much, and you have the right to feel comfortable in the room your paying for. \n\nIf he responds badly, then I’d say go to the RA or a staff member you trust for help navigating the situation.",
      "author": "DCEUrocks222",
      "created": 1633661443,
      "upvotes": 21,
      "replies": {}
    },
    "hfsp9mg": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfsp9mg/",
      "text": "You have infinitely more right to your dorm room than she does. You need to sit down your room mate and tell him that you are not Ok with his girlfriend being over all the time: you have the right to comfortably use the room you are paying for. This really should have been made clear in your room mate agreement, that's why they exist after all.",
      "author": "patrdesch",
      "created": 1633653259,
      "upvotes": 56,
      "replies": {}
    },
    "hft57xt": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hft57xt/",
      "text": "be honest and kind like you are trying to solve a problem and maintain a good realationship w roomate. tell them that you want some time to yourself every once and a while and you feel like ur not getting it with all the time they hangout in the dorm or room. tell them you think it would make you feel better if they choose to spend time together in her dorm instead of solely in your guy’s dorm. be clear about how much time you think is a good idea and be prepared to maybe get some push back and work things out. i would be verbally clear that obviously ur roomate is always entitled to go in the room/dorm unless youre having a girl over in the room or whatever but you feel like the gf coming over to hangout the vast majority of the week is too much and you want to communicate this and work something out so its not a big deal later on. btw dont apologize for inconveniencing them if you feel like youve done nothing wrong. just be prepared to brainstorm solutions and be open to stuff like them sleeping in the dorm’s common space or whatever and as time goes on if you feel like you are having more issues w this work out your feelings and plan a conversation internally so you can communicate and solve the problem before it festers and it feels like you are under attack when they think they are doing nothing wrong. goal oriented communication is key. rememeber this is the guy that sleeps next to you so try your hardest to always be on good terms. and dont let issues fester and become bigger than they need to. also dont be afraid to do something nice randomly. like pick up an extra bit of free food from the caf and share w them if ur mealplanned up. if you party at all you could enjoy some alcohol or weed with them on you if you think thatd be fun. if someone did something nice for you, you may be more inclined to return the favor. dont make it transactional but you know what i mean, we all like it when people do nice little things for us. anyway good luck and hope this gets sorted out easily",
      "author": "AsUcanseebythisgraph",
      "created": 1633661030,
      "upvotes": 11,
      "replies": {}
    },
    "hftjkwu": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftjkwu/",
      "text": "Honestly just go to the RA and ask them to find a creative way to find out on their own.  Don’t bother talking to the roommate.  No reason to make yourself the enemy when they can and should just direct that at the ra.",
      "author": "redactedname87",
      "created": 1633669312,
      "upvotes": 11,
      "replies": {}
    },
    "hfunfo4": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfunfo4/",
      "text": "Switch rooms w her and stay w her roommate.",
      "author": "Bambieyedbiotch",
      "created": 1633699264,
      "upvotes": 11,
      "replies": {}
    },
    "hft5bz6": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hft5bz6/",
      "text": "If she is there when your roommate isnt. I would ask her to leave. \n\nI would tell my roommate that you are requesting she is does not sleep over more than one night a week and that he ask you in advance. If he can't do that, you will report to the RA. \n\nGrow some balls and set some boundaries. You have a right to your space.",
      "author": "calmbythewater",
      "created": 1633661085,
      "upvotes": 16,
      "replies": {
        "hftgz1g": {
          "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftgz1g/",
          "text": "Honestly, the thing that would piss me off the most would be her being there when he isn't. How is homeboy supposed to get some self care done if there's always someone in the space? At the very least she's gotta figure out somewhere else to be when bf isn't around.",
          "author": "EternityNotes",
          "created": 1633667609,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "hfted60": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfted60/",
      "text": "Just go in while they have sex and they will get annoyed",
      "author": "Material-Zone4685",
      "created": 1633665979,
      "upvotes": 16,
      "replies": {}
    },
    "hfta068": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfta068/",
      "text": "you gotta set boundaries w your roommate, and it’s usually not as bad as a conversation you’d think it would be, you j gotta find common grounds — like we sexile each other all the time lmao but ain’t no way one of us gotta leave the room for the entire night/ a girl can stay when the other person needs to be alone",
      "author": "hamstergangster123",
      "created": 1633663465,
      "upvotes": 6,
      "replies": {}
    },
    "hftxwiz": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftxwiz/",
      "text": "Yea the rule at many colleges is 3 days. Some say they won't enforce it if the Roomate doesn't complain but you clearly have issues. Either talk to him or go complain to the RA and let them address it.  Seriously annoying and frankly not acceptable because you can get out of shower naked or almost naked. If he isn't there then she should definitely not be there! \n\nYou can always start sitting around in your underwear or saying you want to have sex, hey even by yourself! I mean come on this girl has her own room!",
      "author": "jetclimb",
      "created": 1633680740,
      "upvotes": 3,
      "replies": {}
    },
    "hfuxgmn": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfuxgmn/",
      "text": "Get the RA involved- way easier to mediate when someone else is there",
      "author": "kojilee",
      "created": 1633703917,
      "upvotes": 3,
      "replies": {}
    },
    "hfu58r3": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfu58r3/",
      "text": "You have every right to be in your dorm. She does not. Do not forget this. Just don't even talk to her just do your own thing",
      "author": "undeniably_confused",
      "created": 1633687431,
      "upvotes": 2,
      "replies": {}
    },
    "hfucyp6": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfucyp6/",
      "text": "I have had this same problem before. What I recommend is you tell you’re Roomate that it makes you uncomfortable that she’s over all the time. She isn’t banned from the dorm but she also can’t be there every single day. It’s as much your space as it is your roommates and you have a say in what goes on there. \n\nDealing with stuff like this made me stop being to shy and being more direct. Still have roommates but now I make sure to talk out any issues we have. And if nothing changes then you’re just forced to talk to someone higher up. Don’t worry if your roommates doesn’t like you then, you didn’t come to college yo be buddies with everyone. You have the right to your space and he’s showing a lack of care in not thinking of you and your other roommates space.",
      "author": "BigLizardBrain",
      "created": 1633693344,
      "upvotes": 2,
      "replies": {}
    },
    "hfuhn9w": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfuhn9w/",
      "text": "This sounds like shit, but it is kinda common. Lots of people who are living with roommates for the first time do not understand boundaries, and having three people stuffed into one room does not make it any better. \n\nFirst course of action is to just have a serious talk with your roommate. If that doesn't work out then ask the RA to intervene. Their job is largely about resolving disputes exactly like this. Is it going to irritate your roommate? Yes. But I'm afraid that's just the card you've been dealt here - your roommate is the one causing the problems here, *not* you.\n\nI would also try to see your other roommate's opinion on the matter. If problem roommate can see that both of you AND the RA are pissed off then *maybe* he will realize he is being an asshole. \n\nIf I were the RA here I would try to find a student in a single dorm and see if they are willing to swap with your roommate. Then you get to stay, roommate and his girlfriend get to bone in peace, and she won't be bothering anyone by staying over.",
      "author": "LiarVonCakely",
      "created": 1633696211,
      "upvotes": 2,
      "replies": {}
    },
    "hfuungx": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfuungx/",
      "text": "It may be difficult, but have a talk with your roommate, like a serious sit down kind of talk with just you and him. Tell him about how you feel and that you aren't against them but it's affecting you and be respectful about it. Try and lay down some ground rules or something, and if that doesn't work then take it up with someone else like an RA.",
      "author": "jsimercer",
      "created": 1633702681,
      "upvotes": 2,
      "replies": {}
    },
    "hfv3n69": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv3n69/",
      "text": "I see plenty of people on here giving you mixed opinions, so I'll chime in. My freshman year I didn't like the dorm situation I had at all. My dorm was pod style, so there were three rooms to a pod. Basically, I had 5 roommates. I liked to wake up early, while they stayed up and did hw because they procrastinated. I tried to accommodate and be understanding of their loud noise, but at the end of the day, I was there to get an education and get some sleep. I confronted them multiple times because I knew we wouldn't be friends after freshman year. Do what you need to do, if they haze or harass you for speaking up, then report them again. \n\nOn a side note, I'm sorry that you are going through this. Hope it gets better!",
      "author": "ftrdr2021",
      "created": 1633706569,
      "upvotes": 2,
      "replies": {}
    },
    "hfwj5o6": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfwj5o6/",
      "text": "Go in while they’re having sex and eat a bag of chips really obnoxiously while making eye contact with them. Assert your dominance because it’s your home, not the girls.",
      "author": "TepidT0ast",
      "created": 1633728035,
      "upvotes": 2,
      "replies": {}
    },
    "hfux5kz": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfux5kz/",
      "text": "Snitch her snitch her fuck normies fuck sex-havers",
      "author": "Beybladeer",
      "created": 1633703783,
      "upvotes": 3,
      "replies": {}
    },
    "hfu4xzz": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfu4xzz/",
      "text": "ask to be moved.",
      "author": "ObjectiveAnalysis643",
      "created": 1633687173,
      "upvotes": 1,
      "replies": {}
    },
    "hftzrf7": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hftzrf7/",
      "text": "Talk with ur roommate",
      "author": "barnedall",
      "created": 1633682464,
      "upvotes": 1,
      "replies": {}
    },
    "hfudog0": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfudog0/",
      "text": "That's tight situation",
      "author": "SugarMommy_Heather",
      "created": 1633693810,
      "upvotes": 1,
      "replies": {}
    },
    "hfv8vzw": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv8vzw/",
      "text": "Start with trying to talk to your roommate about it. You’re paying for that dorm room not their girlfriend. If they don’t respect your wishes then take it up with the ra.",
      "author": "lmaohaenah",
      "created": 1633708763,
      "upvotes": 1,
      "replies": {}
    },
    "hfv937h": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfv937h/",
      "text": "Honestly you just gotta talk to him about it and if nothing changes, tell an ra or rhd. It sucks but it’s pet of college life when you share a room and resentment will just fester and grow the longer you wait. I’ve been there. Good luck, fingers crossed for ya🤞",
      "author": "angora44",
      "created": 1633708845,
      "upvotes": 1,
      "replies": {}
    },
    "hfva59s": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfva59s/",
      "text": "Ask her if you can go stay in her dorm and if her roommate is cool with that. Easy clap.",
      "author": "EpicIcyInferno",
      "created": 1633709288,
      "upvotes": 1,
      "replies": {}
    },
    "hfvd9bo": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfvd9bo/",
      "text": "You just gotta deal with it they are their own person",
      "author": "Seekistguy",
      "created": 1633710586,
      "upvotes": 1,
      "replies": {}
    },
    "hfvdjr8": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfvdjr8/",
      "text": "Don't tell her to leave, talk to your roommate about how she needs to and tell him they need to spend more time in her dorm and to give you some space regardless of her roommate issues. If that doesn't work go to the RA, and if the RA doesn't do anything call your roommates gf out and tell her to get the fuck out of YOUR dorm you're sick of her being your fourth roommate, it'll probably piss her off and her bf off enough that she won't want to be around you anyways",
      "author": "pussyslayerguy",
      "created": 1633710705,
      "upvotes": 1,
      "replies": {}
    },
    "hfvkse3": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfvkse3/",
      "text": "Hold a vote between the 4 of you on who needs to go. Everyone must have a bag packed, no speaking allowed, and the loser must immediately leave.\n\nCatch is you have to vote for yourself so it isn't suspicious.",
      "author": "Scoots1721",
      "created": 1633713705,
      "upvotes": 1,
      "replies": {}
    },
    "hfvpd6w": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfvpd6w/",
      "text": "Bring in a bunch of your friends one day, and the next day go talk to your RA, if your roommate suspects it's you who complained you can just blame your other friends who they don't know.",
      "author": "OutlandishnessTop266",
      "created": 1633715593,
      "upvotes": 1,
      "replies": {}
    },
    "hfwblyt": {
      "link": "/r/college/comments/q3hnyv/roomates_girlfriend_is_staying_over_all_the_time/hfwblyt/",
      "text": "Everybody said to talk to them or snitch on them but there is a 3rd option... check out if her roomate is cute, and if its up to your prefrence make a joke about her taking her back or you moving in in her place and see what happens 👀",
      "author": "NinjaBarrel",
      "created": 1633724843,
      "upvotes": 1,
      "replies": {}
    }
  }
}