{
  "sid": "ri7ixf",
  "link": "/r/college/comments/ri7ixf/whats_a_phd_in_statistics_like_is_it_worth_it_for/",
  "title:": "Whats a PhD in statistics like? Is it worth it for non-academic pursuits?",
  "text": "I’ve asked parts of this question in other forms before but never as a collective so here it is. \n\nSome preface:\n\nMy brother-in-law was doing a PhD from the #1 university in the world in a STEM-related field. However, watching him over the course of this year, I could see he was absolutely miserable and he ended up dropping with just a masters, despite knowing that a PhD from such a university would open so many doors for him. He described his experience as reading countless papers, being lonely and isolated (apart from seeing his advisor), expected to work over time, and not having any work-life balance. He also mentioned that it just wasn’t worth it when taking into consideration his mental health vs how many more opportunities a phd would open. \n\nThat scares me because even though I love statistics, I wouldn’t wanna put myself through 5 years of that. I’m definitely a people’s person and thrive off of socializing. I’m not sure I could survive half a decade of minimum opportunities of socializing. So my question is, is a PhD usually like that, especially in statistics? Maybe he just had a bad advisor and the university had expectations that were just too high, not sure though. I’ve also heard of some people treating it like a 9-5 and being perfectly content while making significant progress in their research still. \n\nAlso, is a PhD in statistics even worth it if your goal is industry? I always get very mixed responses to this one because there seems to be this sentiment that PhDs should exclusively be reserved for aspiring academics (perhaps there’s a response bias here) which I honestly don’t understand/agree with. On the other hand, many people say a PhD in statistics is unique because it genuinely is worth it for industry jobs since it earns you autonomy when working on models and projects. Also, many high-earning/senior positions are reserved for PhDs only, such as data scientists at FAANG, pharmaceuticals, and even some operations/quantitative research heads at hedge funds. Plus, many top PhD programs themselves mention that their program is also tailored towards industry needs (eg: Harvard). \n\nPersonally, I would love to do a PhD in statistics because I genuinely enjoy the subject and want to become an expert at it. However, if a PhD is usually as brutal as people describe it and the return on it for non-academic jobs is minuscule, I suppose I could settle for a masters. But I really do need some input on those two!",
  "author": "mowa0199",
  "created": 1639710567,
  "updated": 1639787683,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hovbsa8": {
      "link": "/r/college/comments/ri7ixf/whats_a_phd_in_statistics_like_is_it_worth_it_for/hovbsa8/",
      "text": "A PhD is brutal. I don’t know anyone who has done one who would disagree, including me.\n\nIf your goal is industry, the PhD is likely not a good idea. Industry does not care about PhDs unless they need researchers, typically in the hard sciences.\n\nThe only reason I would suggest people do a PhD is if they want a tenure track position at a university. Only 25% of PhDs end up with tenure track positions; it is hyper-competitive.",
      "author": "HoodedRoot",
      "created": 1639711239,
      "upvotes": 3,
      "replies": {
        "hoxhmm9": {
          "link": "/r/college/comments/ri7ixf/whats_a_phd_in_statistics_like_is_it_worth_it_for/hoxhmm9/",
          "text": "I'm in statistics. In statistics, there are industry jobs that you simply are not going to land without a PhD. I'm most familiar with pharma, but my understanding but the same goes for big tech. There is a significant industry demand for researchers and the bottom line is that if you're a statistician and you want to do research then you're realistically going to need a PhD. I've heard that in rare cases you can land a researcher job without a PhD, but that this is due entirely to market forces and that it's quite unusual. If you're a master's level statistician applying for a research job and anyone with a PhD applies, the chance you're getting the job is close to nothing.",
          "author": "HumanDrinkingTea",
          "created": 1639756005,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoxgmqi": {
      "link": "/r/college/comments/ri7ixf/whats_a_phd_in_statistics_like_is_it_worth_it_for/hoxgmqi/",
      "text": "I'm shooting for a PhD in statistics and this isn't going to be a satisfying answer, but the answer to all your questions is pretty much \"it depends\" because it depends on you and what you're looking for as well as the program you join if you do a PhD. \n\nA PhD in statistics *is* different than other PhD's in that there are a ton of research positions in industry. So u/HoodedRoot's comment needs to be amended. If your goal is industry and you don't want to be a researcher, then don't do a PhD. BUT if your goal is industry *and* you want to be a researcher, then yes, the PhD is more or less essential. \n\nIn other words, ask yourself if your life goal if to become a researcher. If the answer is yes, then you're realistically going to need that PhD. Otherwise, you don't need it. \n\nAll PhD's are \"brutal,\" yes, but your experience will vary depending on where you are. The best school to attend is the school that's the \"best fit.\" For the most part, this means you want a school whose research interests align with yours and you want a great advisor, with the latter being more important than the former (but both are very important). Don't worry about school rank if industry is your goal-- it won't matter (it does matter for academia). \n\nMore on the advisor thing: You want someone who is both a good personality fit and is a good mentor. A good advisor is everything. You rely on them for so much that the \"fit\" of the advisor is going to significantly influence whether or not your PhD experience is a good one or a bad one. Focus on this rather than school rank.\n\nIf you're currently an undergrad and unsure about a PhD, consider doing a (thesis-based) master's first. This will give you a bit of a taste of what to expect while also furthering your education and giving you time to think about what you want out of life. Entry level in statistics jobs are more or less with a master's anyway, so you should be looking in this direction regardless.\n\nEdit: To address something else you said, I do think a PhD in statistics is rough for an extrovert. I'm an introvert, and even I get lonely sometimes while doing research (although to be fair covid made it worse), so that's definitely something to consider. Most extroverts I know end up having a tough time during their PhD program because they want to spend more time socializing.",
      "author": "HumanDrinkingTea",
      "created": 1639755616,
      "upvotes": 2,
      "replies": {}
    }
  }
}