{
  "sid": "q2etvi",
  "link": "/r/college/comments/q2etvi/ipad_for_college_even_though_i_have_a_macbook/",
  "title:": "iPad for college even though I have a MacBook?",
  "text": "i am currently a freshman looking to buy an ipad for note taking purposes (and maybe some casual drawing or doodling on the side). i currently have a 2020 m1 MacBook pro that I need for my major, and I have been doing most of my notes in a large notebook that i carry with me to every class. I was thinking of buying an iPad next semester or next year to use for notes to replace the notebook. my main reasonings for it are that it seems more organized, easier to complete practice problem sets with, and will be good for premed classes because it’s easier to insert diagrams/pictures into my notes. i can definitely see myself using it a lot if I get one, and would probably use it at least through all of undergrad and part of medical school if it holds up. \n\ni’m just wondering if you guys think the investment is worth it? in addition, if you were to recommend an ipad, would you recommend the newest ipad (9th gen) or the iPad air (4th gen)? cost isn’t an issue but i don’t want to spend too much money unnecessarily if the extra features don’t matter as much.",
  "author": "gitway",
  "created": 1633502441,
  "updated": 1634083749,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hfszxuq": {
      "link": "/r/college/comments/q2etvi/ipad_for_college_even_though_i_have_a_macbook/hfszxuq/",
      "text": "I definitely think it would a worthwhile investment, since you are already able to list off a whole bunch of ways you plan to use it. And given your line of study and plans for med school, it's pretty much guaranteed that you'll get a lot out of it. If you haven't already, you can check out videos on YouTube on how people use their iPads for note taking.\n\nIn terms of having a MacBook already, if you choose to get and iPad, it would be perfect since the main note taking apps that people use/talk about the most (e.g. GoodNotes) are synced very well across the two devices, so you'd be able to access your notes and use your devices together seamlessly.\n\nSince money isnt too big of a deal, I would recommend the iPad Air 4, mainly due to the screen size since more real estate will allow for better and easier note taking. The cute colour options are also a bonus!\n\nI know I sound like an Apple salesperson right now, but I feel like you've already made up half your mind about it so I just wanted to point out some benefits and give some advice, since I've been through the same process!\n\nGood luck with your choice :)",
      "author": "NoDryHands",
      "created": 1633658451,
      "upvotes": 1,
      "replies": {}
    }
  }
}