{
  "sid": "pxkg14",
  "link": "/r/college/comments/pxkg14/professor_not_responding_to_emails/",
  "title:": "Professor not responding to emails",
  "text": "I had a major glitch during a timed test, basically a Chrome extension wouldn't let me see the questions. I emailed my professor right away, asking for it to be reset. His syllabus says he responds to emails within 24 hours. I waited 24 hours, emailed Blackboard support and CC'd him. Tech support said they'd contact him. It has now been 5 days, I sent a follow up email, they still haven't gotten a response from him,and he hasn't answered their phone calls.. Should I go to the department chair, my advisor?  or what are my next steps? It dropped my grade by a full letter and I spent hours studying for this test.",
  "author": "Aggravating-Impact-1",
  "created": 1632877645,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "heo3arc": {
      "link": "/r/college/comments/pxkg14/professor_not_responding_to_emails/heo3arc/",
      "text": "Do you have any other way of contacting your professor, such as phone or in person at office hours? Have you checked that you didn’t typo the email address? \n\nDepartment chair is the next step after you’ve tried the above. Show them the evidence of trying to contact your prof.",
      "author": "AceyAceyAcey",
      "created": 1632878611,
      "upvotes": 3,
      "replies": {
        "her1u9x": {
          "link": "/r/college/comments/pxkg14/professor_not_responding_to_emails/her1u9x/",
          "text": "He specified in his syllabus that his preferred contact is email. Unfortunately,  I'm distance learning, and can't visit during office hours. I have sent a Zoom invitation, and the technical department has attempted to reach him multiple times. I didn't want to go over his head or be perceived as stepping out of bounds, but I guess the department chair is the next step. Thanks!",
          "author": "Aggravating-Impact-1",
          "created": 1632938846,
          "upvotes": 1,
          "replies": {
            "hermadl": {
              "link": "/r/college/comments/pxkg14/professor_not_responding_to_emails/hermadl/",
              "text": "You’ve tried everything this prof said. It’s time to escalate.",
              "author": "AceyAceyAcey",
              "created": 1632947203,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634055934
}