{
  "sid": "q39tnd",
  "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/",
  "title:": "Have you ever missed a class and felt awful?",
  "text": "personally i have never missed a class, until now. my class is at 8:30 and i woke up at 8:21. my alarm was set 50 mins before class started but i must have rolled on top of my phone and turned it off. i have never missed a class since starting college two years ago. i feel scared!! like i’m going to miss something very important. i struggled with the hw material last night and we have an exam in 2 weeks. attendance isn’t required & it is a flipped classroom. what do you guys do if you miss a class?",
  "author": "weeee123pokes",
  "created": 1633615505,
  "updated": 1634083475,
  "over_18": false,
  "upvotes": 70,
  "upvote_ratio": 0.97,
  "comments": {
    "hfqex38": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfqex38/",
      "text": "If you still have an option it’s better to be 20 minutes late than miss the whole thing. But life happens.",
      "author": "SirSaladHead",
      "created": 1633617607,
      "upvotes": 67,
      "replies": {
        "hfqqt1q": {
          "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfqqt1q/",
          "text": "no if u miss a whole ass semester like i did thats pretty bad imo at least",
          "author": "Moteoflobross7",
          "created": 1633622602,
          "upvotes": 17,
          "replies": {
            "hfqxz44": {
              "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfqxz44/",
              "text": "Relatable",
              "author": "z_tranquil",
              "created": 1633625488,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hfqd8ph": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfqd8ph/",
      "text": "yea..I missed class about two times, and honestly it was nothing. I'm a perfectionist and I literally do my best to get the best grades and never be absent in classes, but missing a few classes did not give a huge impact on the results. I still received As and got on the dean's list. just ask some classmates to share their notes and if you're really concerned then go reach out to the professor. They would generally try to help u. it's totally fine to miss a few classes, you're not a robot. just do better with the remaining quizzes and hws. Good luck with your exam :) You'll do great.",
      "author": "disneyotakuforsure",
      "created": 1633616867,
      "upvotes": 16,
      "replies": {}
    },
    "hfqqnuf": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfqqnuf/",
      "text": "haha i missed a whole semester \n\ni thought i dropped a course which surpise i didnt \n\nI appealed the F coz i never signed in then i got approved now i dont have a f in sociology i had a B for my final grade",
      "author": "Moteoflobross7",
      "created": 1633622543,
      "upvotes": 29,
      "replies": {
        "hfrrcg4": {
          "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfrrcg4/",
          "text": " Am I reading that right? How did you appeal an f in a class you never showed up for and get a B?",
          "author": "Content_Balance3150",
          "created": 1633637600,
          "upvotes": 11,
          "replies": {
            "hfrs1er": {
              "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfrs1er/",
              "text": "So I signed up for the soci course for the summer 1 may to June and I didn’t want to take it I wanted to relax instead that month \nAnd I had signed up for psych for august and I decided to check if the prof posted anything(psych) and I saw a bunch of noties for soci and I was like wtf and then I was like OH FUCK OH FUCK OH FUCK and then I emailed the soci teacher to get that appealed \nThen I retook that course with a different teacher in 2020 \n\nBasically I took another course with another teacher sorry if the story doesn’t make sense I sometimes don’t make sense 🤡",
              "author": "Moteoflobross7",
              "created": 1633637896,
              "upvotes": 7,
              "replies": {
                "hfu3xkd": {
                  "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfu3xkd/",
                  "text": "🤡",
                  "author": "Lifedeather",
                  "created": 1633686262,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hfryvzx": {
          "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfryvzx/",
          "text": "I literally have regular nightmares where this exact scenario happens lmao glad to hear it turned out fine in the end",
          "author": "quintessentialquince",
          "created": 1633640778,
          "upvotes": 2,
          "replies": {
            "hfrz4sc": {
              "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfrz4sc/",
              "text": "No but I failed the psych course by forgetting to turn in the final paper that I worked hard on and I remembered like a year later lmfao I am dumb af sometimes",
              "author": "Moteoflobross7",
              "created": 1633640886,
              "upvotes": 3,
              "replies": {}
            },
            "hfsvlc6": {
              "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfsvlc6/",
              "text": "Same I always have dreams of me forgetting about a class. Like I only focus on 2 class the 3rd class is just there in the background. I sometimes worry what if I have a class that I’m forgetting about.",
              "author": "nathani3l0g",
              "created": 1633656318,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hfr16wi": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfr16wi/",
      "text": "Few weeks ago, had a class start at 9:20. I woke up at 10:30. The overwhelming guilt that presided over myself when I woke up, and the utter stupidity that I had felt in missing this class was immense. I have perfect attendance and never missed a class until that day. I felt like a loser, and a bum. Literally was on the verge of tears. \n\nI look forward to class. Hate missing a single lesson. Hate holidays where school is off. **HATE IT!!!** I will be at school ALL day if I can get away with it.",
      "author": "Fight_For_Socialism",
      "created": 1633626808,
      "upvotes": 6,
      "replies": {}
    },
    "hfqya6s": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfqya6s/",
      "text": "As long as it doesn’t become a habit, missing a couple classes per semester is negligible unless you miss a test or lab or something that you don’t have the option to make up. I wouldn’t let it eat at me",
      "author": "115machine",
      "created": 1633625610,
      "upvotes": 5,
      "replies": {}
    },
    "hfqdopp": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfqdopp/",
      "text": "Don’t feel bad, this will happen to the majority of people. I usually feel really guilty if I miss a class too but the chances of something groundbreaking happening in an hour long lecture is low. Ask someone who sits next to you for notes your next class, you’ll be okay!!",
      "author": "rynpickles",
      "created": 1633617063,
      "upvotes": 2,
      "replies": {}
    },
    "hftcfqo": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hftcfqo/",
      "text": "Yes I missed probably over 90% of my classes sophomore year. My ADHD was still undiagnosed and was unhinged at that point. I also had chronic fatigue so I slept through pretty much every single class. Still got A's in all of them. Obviously this very much depends on the class, your professor, and how well you're able to teach yourself. I rarely learned anything when I was in class anyways because I got too distracted, so I honestly did better just teaching myself. \n\nDon't beat yourself up about it. You would be incredibly hard pressed to meet a junior/senior who hasn't skipped a class ever. Shit happens. Life happens. You'll be fine. You can try to go to your professors office hours if they're available if you have questions.",
      "author": "yersodope",
      "created": 1633664829,
      "upvotes": 2,
      "replies": {}
    },
    "hfqre0q": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfqre0q/",
      "text": "Go to office hours and talk to the teacher about what you missed and about your homework/general questions",
      "author": "shoelaceys7373",
      "created": 1633622835,
      "upvotes": 0,
      "replies": {
        "hfrfa3x": {
          "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfrfa3x/",
          "text": "Do not do this. This is what the syllabus is for",
          "author": "HateInAWig",
          "created": 1633632583,
          "upvotes": 1,
          "replies": {
            "hfroux3": {
              "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfroux3/",
              "text": "While I don’t disagree that the syllabus is there for that. It couldn’t hurt to talk the the professor since they are already not understanding certain material. I’m addition I’ve had it where professors put no effort into the syllabus and it doesn’t provide important information. Maybe op can text a friend with what they missed.",
              "author": "megaozojoe",
              "created": 1633636562,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hfrh403": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfrh403/",
      "text": "All my classes are online and at home. No reason to miss any classes ever..unless I am deathly ill",
      "author": "TragicalKingdom",
      "created": 1633633339,
      "upvotes": 1,
      "replies": {}
    },
    "hfs310y": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfs310y/",
      "text": "You must have enough self confidence to know that you can pass by studying on your own. Chill, just try and get someone's notes or maybe ask the professor what topics they talked so you can study them on your own.",
      "author": "Fuba301",
      "created": 1633642597,
      "upvotes": 1,
      "replies": {}
    },
    "hftraiz": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hftraiz/",
      "text": "It happens. I once set my alarm for pm instead of am. I was mortified but it wasn’t the end of the world.",
      "author": "SinfullySinatra",
      "created": 1633675050,
      "upvotes": 1,
      "replies": {}
    },
    "hfyv5gq": {
      "link": "/r/college/comments/q39tnd/have_you_ever_missed_a_class_and_felt_awful/hfyv5gq/",
      "text": "Bruh 😂 there’s some classes you‘re better off missing, especially if you’re the type who likes to learn from books. Personally, I hate the flipped classroom / “active learning” format, so I tend to skip those. My current M.O. is to read the books, attempt the homework, and then go to office hours if I have questions.  If the prof is particularly cool or engaging then I will go to lecture… but if they’re just meh or they don’t care about teaching, I skip 😂",
      "author": "civis_romanus",
      "created": 1633776612,
      "upvotes": 1,
      "replies": {}
    }
  }
}