{
  "sid": "rcxp0m",
  "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/",
  "title:": "i hate my major but i can’t switch out",
  "text": "long story short, i hate my major. like, absolutely despise it. i’m not a science person, i’m not interested in anything i’m learning, and my major is too hard to bullshit through.\n\nhowever!! my parents have high expectations for me and want me to graduate with a degree in stem (despite me not being good at it). a lot of the people i’ve talked to have told me to switch my major since it’s my life and not theirs, but i don’t want to be happy at the cost of their happiness. my parents have done so much for me, the least they deserve is a daughter who isn’t a burden, both emotionally and financially. \n\nsoooooo what do i do?",
  "author": "Significant-Name6555",
  "created": 1639102897,
  "updated": 1639516691,
  "over_18": false,
  "upvotes": 57,
  "upvote_ratio": 0.93,
  "comments": {
    "hnxnssi": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxnssi/",
      "text": "Eventually you’re going to have to learn to become an independent person that cares for your own desires and needs. You need to push yourself now to live for yourself, or else you’ll be bitter and angry in the future that you lived your entire life for someone else.",
      "author": "Snappylobster",
      "created": 1639103023,
      "upvotes": 99,
      "replies": {
        "hnxqnpw": {
          "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxqnpw/",
          "text": "i think this is actually very solid advice lol thank you. i still need to work up the courage to even consider switching to something else but i think i’d rather be bitter and angry at myself in the future than at my parents for forcing to stay in this major",
          "author": "Significant-Name6555",
          "created": 1639104260,
          "upvotes": 8,
          "replies": {
            "hny5nmu": {
              "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hny5nmu/",
              "text": "no. you won’t rather be bitter and angry at yourself. you need to do what you *want* to do, not what *others* want you to do. that’s something you have to learn in life. if not, you’ll be miserable because you’ve lived *your* life for others.",
              "author": "GirICorpse",
              "created": 1639111101,
              "upvotes": 22,
              "replies": {
                "hnya4dp": {
                  "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnya4dp/",
                  "text": "i actually agree with you!! i meant it more with regards to jobs, as in even if i major in what i love and don’t get a high paying job, it would be better than hating my parents for forcing me to continue with my current major (even if it results in a rly good job) not sure if this makes sense but it made sense in my head lol",
                  "author": "Significant-Name6555",
                  "created": 1639113420,
                  "upvotes": 5,
                  "replies": {
                    "hnywwbz": {
                      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnywwbz/",
                      "text": "I mean, stem is by no means a golden ticket to a good job (Especially if you hate it, you'll be shown up by people that love it), and there's good career paths in almost every major",
                      "author": "StarvinPig",
                      "created": 1639129444,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnxqx0r": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxqx0r/",
      "text": "You can't make your parents happy by trying to follow their path for your life. All parents eventually have to accept that children grow and make their own decisions in the natural course of life. It's unhealthy for both parties to try to preserve a relationship of parental authority that's better suited for childhood once childhood ends.",
      "author": "Melodic_Echidna",
      "created": 1639104374,
      "upvotes": 21,
      "replies": {
        "hnxtdmk": {
          "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxtdmk/",
          "text": "you are very right! i just don’t know how to grow out this phase of wanting to constantly please my parents since it’s all i’ve ever known. i have a moderately good relationship with them so i value their opinions a lot and the guilt of not listening to them would eat me alive",
          "author": "Significant-Name6555",
          "created": 1639105450,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hny7hql": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hny7hql/",
      "text": "Keep in mind that there are many corners in STEM. Really take a deep dive and maybe you'll find something you love",
      "author": "GriIIedCheesus",
      "created": 1639112011,
      "upvotes": 8,
      "replies": {
        "hnypk9v": {
          "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnypk9v/",
          "text": "Yeah, like if you’re into arts there are architectural engineering, architecture, and design engineering. There is also math if that’s the art that interests you. If you like law then you can get an engineering degree and then go to law and become a patent law person. If you like business, Engineering is a great route. If you like ethics and philosophy then looking into computer science and then ethics of that is interesting. Also genetics for that one. If you like reading then maybe something with research since that apparently require reading lots of stuff. That one might be a stretch. If you like the environment or nature then you can study a lot in stern about that and get a job where you can go out in the field. If you like graphic design work or film or photography then you can maybe apply that to computer science and computational things or just photograph, film, and write about science. Lots of good journalists with knowledge in Science are needed. We can’t have polarized America on science when a deadlier pandemic comes along. Media must help people fully understand and trust. I’m not sure of all the possibilities obviously but I believe you can relate anything to stem.",
          "author": "Arya_19",
          "created": 1639123359,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnxwun3": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxwun3/",
      "text": "Your life is your life.\n\nThere’s wanting what’s best for you, which is what a parent should do, but this sounds a bit ridiculous. They shouldn’t make you feel bad, especially when you said the degree is political science or business.\n\nIf you’re aware that it can be harder to find a job in those fields, and you’re willing to take that risk and pay for college, then that’s on you. They don’t have to like it, but they should still support it.",
      "author": "NeedsMoreJava",
      "created": 1639106998,
      "upvotes": 6,
      "replies": {}
    },
    "hnxnrlk": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxnrlk/",
      "text": "In the same boat homie...a degree is a degree. Depends on how close you are to finishing but i recommend doing what makes you happy by changing a major or complete the degree you hate and decide on one you love",
      "author": "Great_Dane2017",
      "created": 1639103010,
      "upvotes": 6,
      "replies": {
        "hnxqbue": {
          "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxqbue/",
          "text": "i’m a sophomore right now! i already signed up for my classes for next semester so it would be a lil hard to switch into a major that’s not in the college of sciences, i’m just feeling rly lost and don’t know if i should just suck it up for the last 2 years or risk not being able to graduate on time",
          "author": "Significant-Name6555",
          "created": 1639104115,
          "upvotes": 2,
          "replies": {
            "hnxrnc8": {
              "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxrnc8/",
              "text": "You can usually switch classes up to the first week of a new term without too much trouble. You might run into popular classes being full, but shouldn't have trouble joining any class that still has room at this point (you might need to meet with your advisor about it though).",
              "author": "Melodic_Echidna",
              "created": 1639104689,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hnxoibh": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxoibh/",
      "text": "How far in are you?\nWhat’s an alternative?\nThey probably want you to get the hardest degree possible so you maximize your options. Make a list and justify the change.",
      "author": "sometimes-iwill",
      "created": 1639103322,
      "upvotes": 5,
      "replies": {
        "hnxsv64": {
          "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxsv64/",
          "text": "i’m a sophomore rn! i had an alternate in mind and i discussed it with my parents a couple of weeks ago but they felt that it would be hard to get a well-paying job after graduation and i honestly agreed with them. there aren’t many other options within the college of science that i find interesting but also good for a future career😭",
          "author": "Significant-Name6555",
          "created": 1639105225,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnxtexs": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxtexs/",
      "text": "How far are you on credits ? What if you switched to a minor ? And majored in something you loved?",
      "author": "bun3750",
      "created": 1639105466,
      "upvotes": 9,
      "replies": {
        "hny594k": {
          "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hny594k/",
          "text": "that’s actually a pretty good solution. if my parents and i could compromise so i minor in what i’m majoring in right now, it would take a lot of stress off my back tbh but i just don’t know if i can graduate on time if i switch to something else now since i’m already a sophomore",
          "author": "Significant-Name6555",
          "created": 1639110904,
          "upvotes": 3,
          "replies": {
            "hny7kgh": {
              "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hny7kgh/",
              "text": "Hey! I’m also in my second year with a double major and a minor but I’m graduating a year early! It’s totally possible. \nHere’s the compromise with your parents: \n\nDo you know how much the law field ( based on your Interest’s) would love someone who has enough of a science background to understand scientific language ? \n\nYou could get a job so easy! Study what you want, minor in what they want, and job security! Boom!",
              "author": "bun3750",
              "created": 1639112051,
              "upvotes": 4,
              "replies": {
                "hny8dsh": {
                  "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hny8dsh/",
                  "text": "i’m gna be honest i think this is the most helpful advice i’ve gotten regarding this topic and i’m a lil mad i didn’t think of it myself lol but thank you so much!! this gives me a lot of hope and i’ll definitely sit down and discuss this as an option with my parents when i go home for break!!!",
                  "author": "Significant-Name6555",
                  "created": 1639112484,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnxuox7": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxuox7/",
      "text": "I mean if it were'nt for your current major what would you want to study?",
      "author": "skedadadle_skadoodle",
      "created": 1639106038,
      "upvotes": 3,
      "replies": {
        "hnxv3wh": {
          "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxv3wh/",
          "text": "probably poli sci or something in business! poli sci because i love reading and classes related to law, business because it’s the easiest way to get a high paying job right out of undergrad",
          "author": "Significant-Name6555",
          "created": 1639106223,
          "upvotes": 1,
          "replies": {
            "hnxvvod": {
              "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxvvod/",
              "text": "I mean, business and law and stuff like that is still a pretty solid major. Just tell your parents how you feel about your current what your plans are with what you would rather study.",
              "author": "skedadadle_skadoodle",
              "created": 1639106571,
              "upvotes": 7,
              "replies": {}
            },
            "hnyozyp": {
              "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnyozyp/",
              "text": "There's tons you can do with a polisci major! You won't be getting the 6 figures straight out of college, but you will have plenty to pick from in government, business, politics, legal, etc.\n\nIf you have an interest in STEM, see if you can find a major or minor to compliment that degree which will work for you. Also consider taking a few stats classes, it will do you well. Law schools, paralegals, and so on *love* to see someone who understands scientific literature and it could help you get into patent law.",
              "author": "greyeverything",
              "created": 1639122922,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hny7apm": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hny7apm/",
      "text": "Why don’t you schedule an appointment with an advisor and see your options? I think this is a good first step",
      "author": "soccerfan1993",
      "created": 1639111909,
      "upvotes": 3,
      "replies": {}
    },
    "hnye2a9": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnye2a9/",
      "text": "Change your major… as someone who’s struggled with severe depression. Changing my major was one of the best things I could have done for myself. Just talk to them, it’ll be okay. If they’re critical, just tell them to deal because you want to be happy. Believe me, I was terrified of my mom for years, but once I started talking to her she understood my reasoning for changing. Your parents might not but that’s okay. Y’all lead different lives and don’t have to agree.",
      "author": "AStruggling8",
      "created": 1639115690,
      "upvotes": 3,
      "replies": {}
    },
    "hnyifn9": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnyifn9/",
      "text": "as somebody who lived to make their dad happy and most of my educational aspirations were to make him happy, i get how stressful it is. today i changed my major and didn’t tell him until afterwards and he asked me “is that really what you want?” and truly yes it was, i’m so happy with the change and feel relieved. \n\ni think you’ll benefit more do something that you want to do, not what they want, it’s your future and your life. it’s okay to put yourself and your happiness first, it’s not selfish to want what’s best for you and your happiness. \n\nif you can, speak with an advisor, see what your options are. you’re not a burden for doing something you enjoy or have interest in. truly explore your options and don’t live your life for somebody else, do it for you",
      "author": "summergem",
      "created": 1639118366,
      "upvotes": 2,
      "replies": {}
    },
    "hnyn3gg": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnyn3gg/",
      "text": "See, your never gonna be happy In life and plus your gonna die one day so like do what makes you happy",
      "author": "Man7172",
      "created": 1639121490,
      "upvotes": 2,
      "replies": {}
    },
    "hnyz556": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnyz556/",
      "text": "Not to sound harsh but....\n\n&#x200B;\n\nBoth of your parents, being human, are going to pass one day. When they inevitably do, they will be leaving you behind, working in a job you will most likely hate, having studied in a major you also hated. Their happiness won't matter then and you will be left alone and miserable. You will probably end up blaming them after they are gone and despising them. Remember, assuming they are good parents they do actually want you to be happy. \n\nIsn't that the reason why they want you to do stem in the first place? The alternative is not necessarily being financially dependent on them. You have lots of options. They will warm up to the idea soon enough and your relationship with them will probably be better off if you do what you want in this situation since there will be less bitterness later on in life towards them.\n\nGood luck!",
      "author": "bhimjisal",
      "created": 1639131330,
      "upvotes": 2,
      "replies": {}
    },
    "hnzjuc8": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnzjuc8/",
      "text": "this is a short sighted if view of young kid, the 30 or 40 year yourself will thank you for getting marktable stem degree.\n\nthats why people in their 30s and 40s go back to college for stem degrees, after they have grown up and realized their useless degrees make them unhireable",
      "author": "ghostmode342",
      "created": 1639144828,
      "upvotes": 2,
      "replies": {}
    },
    "hnxpyz8": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxpyz8/",
      "text": "don't switch duh! 🙄",
      "author": null,
      "created": 1639103958,
      "upvotes": 5,
      "replies": {
        "hnxsvq5": {
          "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnxsvq5/",
          "text": "lol good advice",
          "author": "Significant-Name6555",
          "created": 1639105232,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnybz9g": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnybz9g/",
      "text": "Are they paying for tuition? If so, then prepare to either have to have multiple discussions/ arguments over you switching majors. And you should also expect them to say, \"I'm not paying for a bullshit degree. If you want it then pay for it yourself\".\n\nSo you might be paying out of pocket or get into debt if you switch. But if you have a scholarship then study whatever the fuck you want, they got no say in what academic path you choose. They should help and guide, not demand.\n\nThere's also a third option, you don't say anything at all. When you graduate you'll have the degree you want and they won't know until you're done. But I wouldn't advise this, I'm not a fan of lying and it could ruin your relationship with them.\n\nDo you perhaps have an older sibling, cousin, aunt or uncle that could help you sit your parents down and articulate a good explanation and reason behind your decision to switch? Preferably someone in the same field, and if not then someone that's attended college.",
      "author": "ShadowIG",
      "created": 1639114471,
      "upvotes": 1,
      "replies": {}
    },
    "hnyel9c": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnyel9c/",
      "text": "A degree is something you don't want to regret getting. If what you major in impacts the people around you enough to have to worry about, you need to help them re-evaluate what really matters.",
      "author": "shytries",
      "created": 1639116010,
      "upvotes": 1,
      "replies": {}
    },
    "hnzlyju": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnzlyju/",
      "text": "Uh, if your parents need you to graduate with this specific degree or it's the end of their happiness, they're psychotic. I don't see how graduating in a field you're good at and have a talent for would burden them.  If you mean that the only way you can feed yourself is innthe science field and you may well end up back at home if you pursue another degree? That is more likely if you fail out of a rigorous stem program or graduate at the bottom of your class and are competing for jobs with people who actually like the field. I'd suggest pursuing a field that you have an aptitude for and ignoring all these hypothetical scenarios in your head.",
      "author": "SemanticBattle",
      "created": 1639145832,
      "upvotes": 1,
      "replies": {}
    },
    "hnzxpaf": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnzxpaf/",
      "text": "You can switch it.  You are a prisoner of your own mind.",
      "author": "GenXtreme1976",
      "created": 1639150995,
      "upvotes": 1,
      "replies": {}
    },
    "ho026hk": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/ho026hk/",
      "text": "I would bet your parents just want to make sure youre going to be financially okay and that they have a lot of (possibly too much) faith in STEM.\n\nVisit your career development services office and start working in finding a viable careee path in something you WANT to do.\n\nWhen youre ready, you can go to your parents with your ideas, plans for career, ROI, salaries, where jobs are, etc.",
      "author": "judashpeters",
      "created": 1639152827,
      "upvotes": 1,
      "replies": {}
    },
    "ho0hls8": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/ho0hls8/",
      "text": "“Don’t ask for permission, ask for forgiveness.” So I kinda forgot the actual quote but I say, change your major first, and when your parents find out, just tell them: “This path is more right for me, I hope you can understand.”",
      "author": "justin_v12",
      "created": 1639158918,
      "upvotes": 1,
      "replies": {}
    },
    "ho0i4p5": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/ho0i4p5/",
      "text": "[removed]",
      "author": null,
      "created": 1639159120,
      "upvotes": 1,
      "replies": {}
    },
    "ho0jajy": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/ho0jajy/",
      "text": "Damn, i relate to this so much",
      "author": "Bilguun-M-0409",
      "created": 1639159572,
      "upvotes": 1,
      "replies": {}
    },
    "ho0k16d": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/ho0k16d/",
      "text": "Switch majors, if you hate the major I can’t imagine how you will feel about the job. You are delaying the inevitable, change now while you still can. Your life is also your own, there is a higher chance you will regret not changing than you would not staying. Just don’t major in something stupid like theatre and you should be fine.",
      "author": "morchorchorman",
      "created": 1639159864,
      "upvotes": 1,
      "replies": {}
    },
    "ho0pgye": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/ho0pgye/",
      "text": "My Love, switch your degree before it buries you and destroys you GPA. My mom is a baby-g of a doctor, my dad is a finance king, both wanted me to follow it their footsteps. I did for a while, I HATED IT, and then decided to go to law school. I love dying for this degree! Everyday I learn more and it’s perfect. I used to hate going to class, now I love it. Switch, My Love. ❤️ Switch and be happy. They will understand.",
      "author": "a_christmas_tree",
      "created": 1639162023,
      "upvotes": 1,
      "replies": {}
    },
    "ho0q6n1": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/ho0q6n1/",
      "text": "WHAT MAJOR?",
      "author": "OlympicAnalEater",
      "created": 1639162311,
      "upvotes": 1,
      "replies": {}
    },
    "ho20s97": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/ho20s97/",
      "text": "You could double major in what you want to do.",
      "author": "Kohldsmoke",
      "created": 1639181340,
      "upvotes": 1,
      "replies": {}
    },
    "hnyogc6": {
      "link": "/r/college/comments/rcxp0m/i_hate_my_major_but_i_cant_switch_out/hnyogc6/",
      "text": "I’m glad there are empathetic people on here who will help you because I won’t. I’m just here to say I’m happy not everyone in these STEM majors are taking their careers with passion. Just means less competitors and less competition for me when getting research positions or internships or getting a job. \n\nYou’ve been promoted from competitor to friend. Good luck!",
      "author": "Arya_19",
      "created": 1639122504,
      "upvotes": -2,
      "replies": {}
    }
  }
}