{
  "sid": "ps2eim",
  "link": "/r/college/comments/ps2eim/notes_for_tutoring/",
  "title:": "Notes for Tutoring",
  "text": "Hey guys, I'm thinking of tutoring some high school and middle school students in English/writing and math. How much should I charge as my hourly rate and has anyone here ever bought or borrowed any \"lesson plans\" for tutoring? I don't want to just make it up as I go along - maybe re-using existing lesson plans would be beneficial for student and my time too!",
  "author": "TheMeekos",
  "created": 1632167652,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hdms7l7": {
      "link": "/r/college/comments/ps2eim/notes_for_tutoring/hdms7l7/",
      "text": "When I was coming up with my prices for tutoring I looked at the prices most companies were charging in my area to get an idea of what people would pay. Typically tutoring is under the table (not taxed) so we can get away with charging less independently. I mainly tutored high school math and would charge around $30-40 per hour depending on the grade, tutoring companies in my city charge about $55, by undercutting their rate it gives students a reason to choose me over a big company. \n\nAs for lesson plans what I would typically have the student send me any assignment questions they would like to go over a day or two in advance so I have time to solve them myself and come up with a related activity/ worksheet for us to go through together. I find most students don’t need someone to sit and ‘lecture/teach’ them as they get that in class but they get a lot more value from going through practice questions with me so we can get them practicing more. And then I will explain more in depth and teach any areas we come upon during that practice that they need clarification. \n\nLike if I’m tutoring math 10 and they are working on solving equations, the day before I’ll prepare worksheets on elimination, substitution, some general notes, and some practice problems. Then during the session I have a variety of things prepared but can tailor the session to my students needs.",
      "author": "Chikynugg",
      "created": 1632168473,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634056136
}