{
  "sid": "qtx93l",
  "link": "/r/college/comments/qtx93l/what_is_your_schools_workload_like/",
  "title:": "What is your school’s workload like?",
  "text": "I am a sophomore attending a fairly prestigious liberal arts college, double majoring in philosophy and psychology.  An average course load here is four classes, totaling sixteen credits. I’m curious to know how my workload compares to that of students in other schools, particularly the amount of writing I do. Could you all describe or name their school, write their major and year, and give a summary of what your workload is like, particularly in regards to amount of writing?\n\nI’m currently taking ethics class that assigns three 4 page papers, one 8-10 page paper as a midterm, and one 12-14 page paper for a final. Another of my classes in the politics & law department requires four 5 page papers and a take-home, short answer final. Two other classes in the psychology department have final exams, one of which is also take-home and composed of short answer questions. Both frequently assign smaller, 1-5 paragraph writing pieces. \nAll four of my classes are at the 200 level. Would this be considered low, average, or high relative to other colleges?",
  "author": "realityisconscious",
  "created": 1636917883,
  "updated": 1637181763,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkmimie": {
      "link": "/r/college/comments/qtx93l/what_is_your_schools_workload_like/hkmimie/",
      "text": "I’m an engineering technologist student in Canada. I’m in my third term of a 2 year program. \n\nWe write 2-3 labs a week at 15-25 pages per lab of that at least half the pages are writing. 2-3 assignments at 1-2 pages each. \n\nAs for exams, Our exams are 10-15 pages of short answer theory and application questions. \n\nDepending on the topic though I wouldn’t be able to put more then 1-2 pages together. Yes we wrote a lot but a lot of it is from studies conducted, experiments, research, codes and standards etc etc.",
      "author": "skippy5433",
      "created": 1636918402,
      "upvotes": 1,
      "replies": {}
    }
  }
}