{
  "sid": "qaxop7",
  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/",
  "title:": "Is 25 too old to start college and attend a party school? At what age are you towing the line?",
  "text": "I didn’t go to college right after high school, and decided to work and save up money instead. Now I’m older, and I’m thinking about going to college. The thing is, I’m getting kind of old and I’m interested in going to a party school. I feel like it would be extremely weird to start school at my age. I probably shouldn’t expect the full college experience right? I’m probably going to be around a bunch of 18 year olds and things might be awkward.\n\nEdit: I’m actually 23 right now, and I turn 24 at the end of March of next year. By the time I transfer from a community college, I’ll be 25 or so.",
  "author": "Angelinapatina",
  "created": 1634596336,
  "updated": 1636177646,
  "over_18": false,
  "upvotes": 95,
  "upvote_ratio": 0.86,
  "comments": {
    "hh66533": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh66533/",
      "text": "As an adult the bar is a great place to meet people for party's. A bowling league or casual league sport may bring some more solid friendships. There's tons of activity clubs around the city",
      "author": "FilletOfZero",
      "created": 1634600751,
      "upvotes": 69,
      "replies": {
        "hh674oq": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh674oq/",
          "text": "I guess I could try to get out more. I live in California/ the Bay Area. My city is overpopulated but super unfriendly. What are these activity clubs you speak of? I’ve gone to some meetup groups. Those have changed a lot and mostly cater to 30-40 year olds.",
          "author": "Angelinapatina",
          "created": 1634601230,
          "upvotes": 17,
          "replies": {
            "hh81v77": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh81v77/",
              "text": "Go to college bars?",
              "author": "kapbear",
              "created": 1634645262,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh6ebzg": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6ebzg/",
      "text": "Ah! I can answer this!\n\nSo I did undergrad right after HS and, at 24, decided that I wanted to get an additional bach degree since my job gave annual education stipends. I ended up back in undergrad at 25 and nobody thought that I stuck out or didn't fit in but let me tell you....\n\nThese were children.\n\nWe may have looked very similar, but I actually dropped out before the semester was over because it was quite frankly uncomfortable. NO judgment, it was just 18 year olds being 18 year olds, but these are teenagers that have never voted, are living away from their parents for the first time (not even all of them), have never paid taxes, etc.\n\nWhen you watch college movies, remember that those are 30+ year old actors pretending to be 18 year olds. While you will visibly fit in and probably even be pretty cool, consider that the difference between a senior prom and a college party is \\*months\\* . Most college students can't legally drink and a half the freshman class are virgins. It's a MASSIVE 7 year difference.\n\nThe likelihood of you \"meeting people\" that you want to hang out with and develop a long term friendship with will be pretty slim. These aren't peers, generally.",
      "author": "NY_VC",
      "created": 1634604714,
      "upvotes": 97,
      "replies": {
        "hh6ww0s": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6ww0s/",
          "text": "Thanks for the well thought-out reply! \n\nOh no, you dropped out. Well at least you already had a degree under your belt at that point. \n\nAnd yeah I know...there will be a huge age gap. I’m just going to focus on school and if I meet some cool people along the way  (around my age) then that’s cool too.",
          "author": "Angelinapatina",
          "created": 1634613863,
          "upvotes": 19,
          "replies": {
            "hh8l1o4": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8l1o4/",
              "text": "I'm gonna counter their post here and give some differentiating points:\n\nI'm 25 and will be 26 next semester when I graduate my accelerated master's program (both my Bs and Ms of Comp Sci). At a party school, nonetheless. \n\nYes, there is most definitely a maturity gap, nobody is going to deny that. However, college isn't meant as a form of socialization. You aren't there to make friends, meet a significant other, etc. Are they perks on the side? Absolutely, for most people. They might not be for you, and that's ok. You're there to learn and to progress your future.\n\nEven then, you'll still meet people you enjoy talking to/occasionally grabbing a beer with. One of my closest college friends is 35 years old and returned to get another degree himself. I have other close college friends that'll check in on my cats when I'm out of town or on vacation. \n\nUltimately, this is something only you can decide on.",
              "author": "WCPitt",
              "created": 1634654766,
              "upvotes": 21,
              "replies": {
                "hh9m705": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9m705/",
                  "text": "I don’t view this as in conflict with the post. OP keeps mentioning wanting to party and go to a party school. The social element is exactly what will be lacking and is what she is seeking. She notes in a different comment that the reason she wants to go to a party school is to party and have the “college experience”.\n\nNo one is too old for education. 100% agreed. But OP’s question is specific to social.",
                  "author": "Impressive_Spring139",
                  "created": 1634669831,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh5xu7u": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh5xu7u/",
      "text": "I never saw much value in college parties. Imo you’d be best off going to a community college for a couple years then transferring but to each their own.",
      "author": "Cocainefanatic",
      "created": 1634596764,
      "upvotes": 73,
      "replies": {
        "hh5yh6h": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh5yh6h/",
          "text": "I also want to meet people. I took a couple of semesters at a community college and it sucked. The social aspect just wasn’t there.",
          "author": "Angelinapatina",
          "created": 1634597070,
          "upvotes": 20,
          "replies": {
            "hh6atim": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6atim/",
              "text": "I went to community College before uni at a similar age. I met plenty of people. I worked on campus so that made it much easier to connect with other students",
              "author": "SenorTonto",
              "created": 1634603019,
              "upvotes": 8,
              "replies": {
                "hh6cf3y": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6cf3y/",
                  "text": "Got cha, so far it hasn’t been that pleasant. Everyone seems to be more focused on school than meeting people.",
                  "author": "Angelinapatina",
                  "created": 1634603797,
                  "upvotes": 3,
                  "replies": {
                    "hh6lz5v": {
                      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6lz5v/",
                      "text": "Key word \"seems\". There's plenty of students with a balance. You just have to be social and try",
                      "author": "SenorTonto",
                      "created": 1634608339,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "hh81z1f": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh81z1f/",
                  "text": "I have never lived at school, but when I went to CC I have never felt more comfortable and in place. I met the most friendly amazing people. Uni sucks",
                  "author": "kapbear",
                  "created": 1634645328,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hh6533r": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6533r/",
              "text": "To be honest I think you missed the boat. I would look at meeting people through other avenues",
              "author": "iiAnthony",
              "created": 1634600241,
              "upvotes": 29,
              "replies": {
                "hh6611p": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6611p/",
                  "text": "Yeah, I should have gone to college right after high school. Now I’m just like I needed that experience. I also really need my degree so I’m going to have to do school regardless.",
                  "author": "Angelinapatina",
                  "created": 1634600695,
                  "upvotes": -5,
                  "replies": {
                    "hh67aaw": {
                      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh67aaw/",
                      "text": "No you didn’t need to go to college after HS - you chose what was best for you at the time. I think it is worth to focus your energy on other things other then dumping a ton of money into going to a party school - what would 18 year old you think about a 25 year old trying to dorm/ asking to go party with them",
                      "author": "iiAnthony",
                      "created": 1634601306,
                      "upvotes": 32,
                      "replies": {
                        "hh68c23": {
                          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh68c23/",
                          "text": "That’s a good point. I’m not that judgmental. 25 Is still fairly young, but not everyone will of course have the same opinion. Do you think the best route would be to just finish community college, go to whatever school I can and just focus on getting my degree? I def don’t want to be stuck at a dead end job. I want more for myself. I’m really jealous of other people who went straight to college, are more cultured because of it, and get to enjoy their 20’s.",
                          "author": "Angelinapatina",
                          "created": 1634601824,
                          "upvotes": 7,
                          "replies": {
                            "hh69yzm": {
                              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh69yzm/",
                              "text": "That’s what I would do, you’re 25 you can go to bars/clubs if you really want to party. And I know everyone doesn’t share the same opinion, but you’d be lying to yourself if you think you’ll get the same experience. You would definitely make friends in class no doubt, but you do what you want  as long as you make the decision for yourself",
                              "author": "iiAnthony",
                              "created": 1634602611,
                              "upvotes": 8,
                              "replies": {
                                "hh6c4gv": {
                                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6c4gv/",
                                  "text": "Nope, I definitely wouldn’t get the same experience. Not that it matters too much but lol I’m actually 23, and I turn 24 at the end of March of next year. By the time I transfer from community if I take that route, I’d be 25. \n\nI’ll just get my associates and then go from there. Bars will still be around so....",
                                  "author": "Angelinapatina",
                                  "created": 1634603656,
                                  "upvotes": 4,
                                  "replies": {
                                    "hh6e31x": {
                                      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6e31x/",
                                      "text": "Yeah, that would be best imo",
                                      "author": "iiAnthony",
                                      "created": 1634604595,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hh9b83u": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9b83u/",
                  "text": "How? There are tons of ppl in college in their 20s that still party. They just know how to party better and more responsibly than everyone else.",
                  "author": "UrbanGuerrilla0",
                  "created": 1634665522,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hh7rlri": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7rlri/",
              "text": "College isn’t much different, most of the time. People go to classes and go home. Most people don’t initiate a conversation unless invited to. If you live in dorms then it’s a different story.",
              "author": "mich366",
              "created": 1634637819,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh717gf": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh717gf/",
      "text": "Might get downvoted for going against the grain here but 25 really isn’t that old, especially among transfers. I transferred from CC when I was 20 and I was literally the baby of the group. Most of my friends were 22 to 26 at the time. We still partied and had a great time. Went to a few off campus things and no one really cared how old you were. Granted, I didn’t go to a huge party school but I did go to a school in the UC system. I wanted that “college” experience and I feel that I got it (even if COVID and the strikes at my college affected the majority of my time there). I went to parties, bars in town, threw my own parties, did dumb “college kid” stuff, joined a frat, etc. \n\nCollege is just what you make of it. If you’re worried about people thinking that you’re too “old” then it’s highly likely they are frosh and not worth hanging around. Yes, you’re right that transferring isn’t the true “college” experience we all see on tv, but that doesn’t mean that you won’t have a good time. It’s all about mindset and the people you surround yourself with. If anything, just being a transfer will allow you to connect with other people who are just like you and you won’t have to deal with petty shit that should’ve stayed in high school.\n\nIf you’re worried about meeting others who are closer in age to you see if the colleges you’re interested in offers transfer student housing. My UC pretty much dedicated an entire dorm building at each college to transfer students so I def got the dorm experience lol.",
      "author": "suspiciouschonker",
      "created": 1634616282,
      "upvotes": 15,
      "replies": {
        "hh73g3i": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh73g3i/",
          "text": "Thanks for the words of encouragement bud. This definitely makes me feel a lot better. I think some people on this post are making it seem like I only want to do school to party and that’s simply not true. Of course I’m in school, so I can get my degree and earn more. This doesn’t mean I want to end my fun days or life at 25. When I’m 30, I don’t want to have any regrets. Like oh I wish I would have “gone out more or done this” etc.. Life is too short for that. \n\nI probably won’t end up at a party school. It was kind of a theoretical thing. I just want to transfer somewhere decent and affordable.",
          "author": "Angelinapatina",
          "created": 1634617690,
          "upvotes": 3,
          "replies": {
            "hha00th": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha00th/",
              "text": "Exactly! You can totally have a social life and still have decent grades in school. I recently graduated with a 3.9 GPA, worked, and had a social work so it’s definitely possible (even if it wasn’t easy). \n\nI saw from another reply that you’re also in the Bay Area so I would totally take advantage of the TAG program for UCs and whatever direct entry CSUs your CC has an agreement with if you’re interested in any of them. Takes off a lot of stress when acceptances come out. I tagged into Santa Cruz and went there. They were a great school for transfers since it offered tons of resources that were specific to transfer students (even offered 23 and up apartments for housing on campus), but if you’re not getting financial aid or on a scholarship, I wouldn’t recommend it since it’s INSANELY expensive to live there. Beautiful campus, though. Finding parties takes a little more effort since greek life isn’t huge on campus due to some policies the school has but they do occur off campus or deep in the forest. Tons of kickbacks if that’s more your speed, as well.\n\nI wouldn’t worry about the age gap (if you could even call it that) too much. My partner’s housemates are all in their late 20s and we’re all still good friends. If anything, most people will probably just think you’re the same age as them and have your shit together. And, yes, I agree that life is too short to have regrets :)",
              "author": "suspiciouschonker",
              "created": 1634675257,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hh6ww14": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6ww14/",
      "text": "Don't go to parties. There will probably be underage drinking and you don't want to be the adult who has to deal with that. Plus sometimes underage highschoolers will show up/tag along with their older siblings and you do NOT want to tangle with underage.\n\nLike other people said go to bars and clubs.\n\n(Also I'm 23 and currently attending cc to go to four year. Good luck!)",
      "author": "baichan98",
      "created": 1634613863,
      "upvotes": 11,
      "replies": {}
    },
    "hh6myd3": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6myd3/",
      "text": "i feel like at 25 it's kinda strange to be worrying that much about college parties but do you",
      "author": "freshguy2002",
      "created": 1634608818,
      "upvotes": 28,
      "replies": {
        "hh7rrrm": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7rrrm/",
          "text": "I think he just wants to know what it’s like to experience college parties. Honestly they are hella overrated. You’ll likely just end up standing around for a bit and that’s about it",
          "author": "mich366",
          "created": 1634637958,
          "upvotes": 14,
          "replies": {
            "hh8edxw": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8edxw/",
              "text": "And the under 21 crowd won't stop hounding him for beer",
              "author": "EveryDisaster",
              "created": 1634651826,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh6hw3m": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6hw3m/",
      "text": "Nah, I feel like if you're chill enough you'd be able to, but I do know people will judge you a little. Im 24, and I feel too old for my classmates, but sometimes I forget my age.",
      "author": "guy_with-thumbs",
      "created": 1634606404,
      "upvotes": 9,
      "replies": {
        "hh6j8qg": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6j8qg/",
          "text": "Yeah, there’s always going to be judgmental people.",
          "author": "Angelinapatina",
          "created": 1634607040,
          "upvotes": 3,
          "replies": {
            "hh6jjze": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6jjze/",
              "text": "I never really cared what others think though, hey only judge until they meet me, but it was obligatory to state.",
              "author": "guy_with-thumbs",
              "created": 1634607184,
              "upvotes": 3,
              "replies": {
                "hh6k74c": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6k74c/",
                  "text": "Thanks...I needed to hear this. Me sitting here wishing I was 18 again lol. What year are you in?",
                  "author": "Angelinapatina",
                  "created": 1634607490,
                  "upvotes": 2,
                  "replies": {
                    "hh6ks8d": {
                      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6ks8d/",
                      "text": "I think im a junior? Been in college since 2015. Been a rough ride, not all full time, either.",
                      "author": "guy_with-thumbs",
                      "created": 1634607772,
                      "upvotes": 1,
                      "replies": {
                        "hh6lj85": {
                          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6lj85/",
                          "text": "Oh so you’ll be done soon....I just want to get my degree and have some fun along the way.",
                          "author": "Angelinapatina",
                          "created": 1634608134,
                          "upvotes": 1,
                          "replies": {
                            "hh6r1kv": {
                              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6r1kv/",
                              "text": "Yeah, I've got about a year left after this semester. And thats understandable. Im sort of in the same boat, but I don't have time. I work part time and im in the military. In about a year ill either have a really nice car or go on a really nice vacation.",
                              "author": "guy_with-thumbs",
                              "created": 1634610879,
                              "upvotes": 2,
                              "replies": {
                                "hh7cahm": {
                                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7cahm/",
                                  "text": "Pretty cool, I didn’t know you could be in the military and do school at the same time! You’re almost done lol I’m jealous.",
                                  "author": "Angelinapatina",
                                  "created": 1634624121,
                                  "upvotes": 1,
                                  "replies": {
                                    "hh83ze8": {
                                      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh83ze8/",
                                      "text": "Yeah, im in the reserves. Active duty doesn't give you much time, but it is possible to take a couple classes each semester. And yeah, im almost done, but im so busy i haven't had an off day. Its a trade off.",
                                      "author": "guy_with-thumbs",
                                      "created": 1634646522,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hhao2jy": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhao2jy/",
          "text": "\"but sometimes I forget my age\"\n\nSame. I hang out with 18-19-year-olds and I'm 22. The age gap is not that huge, but social engagement is different compared to spending time with your age group.\n\nPartying with a bunch of 18-19-year-olds is kinda weird, and I cannot really relate to them. Remember, I am 22.",
          "author": "frozenmonkeys",
          "created": 1634685710,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hh6acuf": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6acuf/",
      "text": "A 25 year old hanging around college parties with 18 year olds will be a bit weird, yes. The ship has kind of sailed for the \"college experience.\" You should go to school for the career benefits, not for the parties. You're too old for that, to be blunt.",
      "author": "wetbogman2",
      "created": 1634602795,
      "upvotes": 32,
      "replies": {}
    },
    "hh6hw7n": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6hw7n/",
      "text": "There is no too old too be in college age there are people in my classes older than me and I’m in my 20’s",
      "author": "_clownsocks",
      "created": 1634606406,
      "upvotes": 6,
      "replies": {
        "hh6jvgv": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6jvgv/",
          "text": "What about when it comes to parties/gatherings? I honesty feel like you’re never too old to party, but then again, I don’t think I can party with a bunch of 18-19 year olds. I’m not too old to party, but I am too old to party with teenagers lol.",
          "author": "Angelinapatina",
          "created": 1634607337,
          "upvotes": 0,
          "replies": {
            "hh6lj5j": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6lj5j/",
              "text": "It seems like you’re more interested in college parties than in college. Which is kinda weird. I don’t think you realize how much more mature you are than 18 year olds drinking 4lokos in college dorms and frat houses. Part of that appeal is being free from parents for the first time.\n\nGo to college for the education. And go to raves, music festivals, etc for more age appropriate partying.",
              "author": "Impressive_Spring139",
              "created": 1634608133,
              "upvotes": 10,
              "replies": {}
            },
            "hh6jzn4": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6jzn4/",
              "text": "To be fair my first experience of a gathering was at a campus and I didn’t know everyone’s age so I can’t entirely answer that",
              "author": "_clownsocks",
              "created": 1634607392,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hh6xg1f": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6xg1f/",
      "text": "Just so you know there are a ton of people that go to college via the non traditional route - and the number has only climbed the past 20 years. I'm 46 and returning to finish my bachelor's. Now given your pov however you're wondering if you're just a smidge outside of typical social experience at a party school and I'd wager you're going to have to feel that out on a case by case basis. Objectively there isn't a huge age gap for you but qualitatively you may find that your perspective diverges because either you have spent more time outside of the normal 4 yr scenario supporting yourself or just because there are tiny differences between you and the slightly younger cohort. I'd say just go with an open mind that your enjoyment will vary and ultimately remember you're going to earn a degree to pave the way for your future.",
      "author": "comfort_fiend",
      "created": 1634614145,
      "upvotes": 7,
      "replies": {
        "hh7c6lz": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7c6lz/",
          "text": "Thanks for the response my dude.",
          "author": "Angelinapatina",
          "created": 1634624035,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh6qqou": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6qqou/",
      "text": "The “college experience” is so dumb to me, just go and get your degree. By all means Make friends but don’t go to college just to party. Especially if your 25",
      "author": "Majestic_Singer_9704",
      "created": 1634610727,
      "upvotes": 15,
      "replies": {}
    },
    "hh6glk9": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6glk9/",
      "text": "Why people go to college to party in the first place is beyond me. I stopped partying hard at age 20. Partying is just the same thing over and over again, and it just got old. From 18 to 20, I was partying all over the country too, and it still got boring. \n\nIf you are 25 years old, and you are going to put yourself in debt to party, you probably aren't making power moves. My advice: get into the best school you can afford, make some friends who share both academic and personal interests, work hard and get good grades, and learn and grow. If there are good parties to attend, hit em up! But don't choose a school based on the party atmosphere, and don't let it get in the way of why you are there. You don't need to spend tens of thousands to go to a good party unless you're dumb as cork.\n\nAlso, if it's any consolation, I'm 25 and just started my undergrad anew. I had a whole career before, and have decided to make a change. So don't feel bad about starting late. Its probably better that you took some time until you knew you were ready. Many kids go to school right after HS and waste money by taking something they hate by accident or not focusing on their GPA and opportunities. Use your maturity to your advantage.",
      "author": "Harnne",
      "created": 1634605789,
      "upvotes": 14,
      "replies": {
        "hh6vybf": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6vybf/",
          "text": "This is really good advice thanks. The plan is definitely to choose a school I can afford to transfer to.",
          "author": "Angelinapatina",
          "created": 1634613380,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hh6k1d2": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6k1d2/",
      "text": "Every time I see these posts I’m like damn it kinda makes me self conscious. I’m 24 and my husband is 26. I am graduating in a few years and him in 4 years. You’ll find people in their 60s or various ages starting college.",
      "author": "stardusttree",
      "created": 1634607415,
      "upvotes": 7,
      "replies": {
        "hh6l15d": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6l15d/",
          "text": "Yeah I don’t think I’m too old for college, I just think I’m too old to go to parties but I want to you know? Do you guys ever go to social functions? I feel like most parties would be filled with a bunch of teenagers so I wanted to see what other people thought. You and I are pretty much the same age.",
          "author": "Angelinapatina",
          "created": 1634607890,
          "upvotes": 3,
          "replies": {
            "hh6loui": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6loui/",
              "text": "Nope if we do any social functions they’re pretty laidback and lowkey because we don’t really party anymore at our ages. We are having a Halloween bash but it’s really just a get together with people we usually hang out with and vibing. The only time I interact with the student body is through any organizations or classes.",
              "author": "stardusttree",
              "created": 1634608206,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh6lu7y": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6lu7y/",
      "text": "Ummm, I don’t completely know. It’s all about how you present yourself. You could present yourself as an old person that it’s only different from the rest because of the age gap, or you could present yourself as an experienced person that knows the ins and outs of things, a person that happens to be older because of how much experience they’ve got. Or perhaps you present yourself as something else. I’m not trying to say that you must create a persona for college, no. I’m saying, the way you perceive yourself affects how others perceive you. It really all comes down to your personality, your hobbies and your passions. Also how smart, aware, and how experienced you are in social settings/events. Sure, I can bet that some people might think you are weird because of your age straight out of the gate. Also the topics of conversation might lack. But maybe that changes when they get to know you, if they are open to get to know you of courses. If you don’t have any ill, deceiving, manipulative, or evil motives when it comes  to socialize with people, I think you will be mostly fine. You won’t have the same college experience as a 18-year-old, but that does not mean you can’t have a good college experience. Your experience might be different from the rest, but still be good. You must know what you like and what you don’t like. If you are in college, doing the things you like, you are most likely to socialize and bond with people that do the same things as you. The interaction would be based on the activity, not the age, the age would not be crucial. Example: let’s say  there is a lake near the school, let’s say you like fishing and swimming and all lake-related activities, you are likely to bond with people that also like lake-related activities. Age wouldn’t be the catalyst for the interaction with someone else, the lake would. So, do what you truly like, be confortable, don’t have ill motives, and be honest and kind.",
      "author": "2Browneyes2",
      "created": 1634608274,
      "upvotes": 7,
      "replies": {}
    },
    "hh6srtz": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6srtz/",
      "text": "College isn't exactly the best place to meet people i would say, its mostly just work with strangers that are too busy working/taking notes to chat most of the time",
      "author": "daltonoreo",
      "created": 1634611741,
      "upvotes": 4,
      "replies": {}
    },
    "hh6gpvf": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6gpvf/",
      "text": "I joined a frat at 24 and had a swell time. Do your best to avoid the freshmen and sophomores and you’ll be fine.",
      "author": "Gioborg",
      "created": 1634605849,
      "upvotes": 2,
      "replies": {
        "hh6inru": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6inru/",
          "text": "Nice, yeah...I don’t see myself hanging out with teenagers. Hopefully I can hang with the grad students. I look pretty young, so I think people will be surprised to know that I’m grown as hell. It’s cool that you got the opportunity to join a frat. Were there others around your age? I had wanted to join a sorority. I think it’s too late for me to rush though. I feel like guys have it easier when it comes to that. Guys are a lot more chill",
          "author": "Angelinapatina",
          "created": 1634606765,
          "upvotes": 1,
          "replies": {
            "hh6rjzz": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6rjzz/",
              "text": "Depends on the party culture and what your degree is in. Some fraternities and sororities will not allow graduate students to join, and thus they may not be a place where you can hang out or party with any grad students period. And that trend is pretty standard. It would also surprise me if a university *allowed* a grad student to join a sorority or fraternity, considering some do not allow their grad students to even have an extraneous job beyond their duties in their grad school and whatever TA-ship they may have. Especially considering that some studies indicate that cheating is more prevalent in fraternities (Bonjean & McGee, 1965; Goldsen et al., 1960; Harp & Taietz, 1966; Stannard & Bowers, 1970), and being directly associated with someone who may be a TA (for research/grad funding) and would have answers to tests or other work, or be responsible for grading other members work, could be a direct conflict of interest. I also never joined a sorority in college, and don’t plan on it. It costs a pretty penny (think about a couple hundred to a grand or more). And after overhearing my dorm-neighbors talk shit about other girls rushing their sororities my freshman year, I decided I just didn’t want to be friends with those girls, I didn’t want to be around them *at all*. Why would I pay so much to be surrounded by bitches that would force a drunken smile to my face but tear me down to other members behind my back? I’ve paid far less for people like that in my life and I’m not looking to go out of my way to meet any more. I’m also not at school to party. I’m here to get my degree and that’s my main focus. If the fact that a school is a party school is the main reason it speaks to you, or even is the top contender for why you pick one school over another, then you need to reevaluate your intentions with school. Setting yourself up for success means understanding that academics and academic resources for your particular degree are far more important than if there’s a Greek life that speaks to you. That’s how you set yourself up for success. Your social life is important but will happen regardless. But I’ve always found that friends made sober are far better than those that drink to go lie to my face.",
              "author": "AimlessFucker",
              "created": 1634611135,
              "upvotes": 1,
              "replies": {}
            },
            "hh8y671": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8y671/",
              "text": "I will admit that frats are far more chill than sororities but don't feel like you're barred from being able to join. Give it a try and find out for certain! I've met some sorority girls around 24 years old. \n\nIn terms of others my age, I was the only one over 21 in my pledge class, so that was rough, but the upperclassmen showed me quite a bit more respect and didn't view me as a naive pledge. I was the 3rd from oldest in the frat, believe it or not. There was a 27 and 26-year-old when I was 24, and one tied with me.",
              "author": "Gioborg",
              "created": 1634660279,
              "upvotes": 1,
              "replies": {
                "hh9yguo": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9yguo/",
                  "text": "If anything, you’d be less naive being older. Oh wow a 27 year old. I also hear that frats and sororities are pretty hard to get into, and they can be expensive. Imagine spending a bunch of money on pledging only to find out you can’t get in. This happened to my partner’s friend who’s actually really cool. I think he payed almost a thousand.",
                  "author": "Angelinapatina",
                  "created": 1634674630,
                  "upvotes": 1,
                  "replies": {
                    "hha5ppg": {
                      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha5ppg/",
                      "text": "Yeah, they're expensive. It's an open secret that cute girls can get into any party, so I guess if you want to party you don't have to join a sorority at all.",
                      "author": "Gioborg",
                      "created": 1634677549,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hh79tvz": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh79tvz/",
      "text": "I’m gonna be in college in my late 30’s, timelines ain’t linear dude",
      "author": "yonosetr3s",
      "created": 1634622191,
      "upvotes": 2,
      "replies": {
        "hh7cbjx": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7cbjx/",
          "text": "This is true",
          "author": "Angelinapatina",
          "created": 1634624145,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh7esvt": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7esvt/",
      "text": "OP I was 23 when I went back to college and did my 2 years at CC before transferring to a 4 year Uni where I’m at right now. I’m 25 and this is my first semester here and I’m going to be honest at this age you’re not going to want to really hang out with 18/19 year olds. I strike up conversations with them in class and I’m sure they think I’m younger than I look but the maturity levels is just real different. \n\nThat’s not to say you won’t enjoy your college experience there will be clubs on campus that you’ll be able to join and make friends through that avenue but at this age I’d forget about dorm life/ sororities etc. You can still go to bars/clubs and have a good time though. \n\nLike everyone else is saying the biggest value for you is to network and get internships so that when you graduate you’ll have a job lined up.",
      "author": "FinalArm8187",
      "created": 1634626183,
      "upvotes": 2,
      "replies": {}
    },
    "hh7gowv": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7gowv/",
      "text": "I’m finishing my Bach by 25, this makes me feel less weird about it. Nah, have fun man.",
      "author": "tarrintomytino",
      "created": 1634627848,
      "upvotes": 2,
      "replies": {}
    },
    "hh7gz2c": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7gz2c/",
      "text": "I went to college right after high school and stopped my third year. Now, a year and a half after I stopped. I’m about to graduate from a community college and transfer back to a university at 25 years old.\n\nI’ve been reading some of your responses, and here’s my 2¢. \nWhen I started college, I had a handful of friends that where 23-26 years old going to parties sometimes, but they always put their education first. They’re more focused on finishing their degrees and starting a good career. And I finally get that at this age. But what I am saying is it’s okay to go to parties, just be mindful of what type of parties you go to. From my experience there are event parties(Birthdays, Holidays, etc.)/rangers, and regular weekend parties or kickbacks these are the parties you want to go to if you want to socialize. If you really want to make a connection, meeting people from class, school events, clubs and activities are your best shot. Most of the friends I made are with the people I see and struggle with everyday. People you meet at the party are usually those you have one class with then say “I guess I’ll see you around”",
      "author": "lostboy222",
      "created": 1634628099,
      "upvotes": 2,
      "replies": {}
    },
    "hh7kvj4": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7kvj4/",
      "text": "j saw your post history and colleges aren’t even gonna let you in if you’re an anti-vaxxer - im being entirely serious here. \n\ncollege kids are a mixed bag and i have had friends who are 25, and ive had friends who are 18. it definitely will be odd if you go to a frat / students may very well feel uncomfortable, but you can always go to a club/bar to party (again…if you get a vaccination bc colleges are not going to really let someone unvaccinated in their community, at least in my experience)",
      "author": "lemonrices",
      "created": 1634631698,
      "upvotes": 2,
      "replies": {
        "hh9cb9k": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9cb9k/",
          "text": "I've known college frat dudes who are 28. It wasn't weird at all, no body cared or noticed.",
          "author": "UrbanGuerrilla0",
          "created": 1634665951,
          "upvotes": 0,
          "replies": {}
        },
        "hha3wae": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha3wae/",
          "text": "Dude, I’m not anti-vax. I got my vaccine just recently. I posted about being afraid of the covid vaccine because it only took them a year to create it. Was I hesitant to get it? HELL YEAH.... a lot of people were. What is it with Redditors looking at post history? I never think about doing that because I don’t care.",
          "author": "Angelinapatina",
          "created": 1634676809,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hh7w800": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7w800/",
      "text": "Most of my classmates were over 20 when I started college. A few were closer to 40, they wanted to change their career. Funnily enough I felt a bit weird for getting in right after highschool as a 18-year-old, since usually people kept a gap year. In Finland this is quite normal.",
      "author": "MySocksAreLost",
      "created": 1634641525,
      "upvotes": 2,
      "replies": {}
    },
    "hh812ki": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh812ki/",
      "text": "i’m not a party person, but i just started college at 25. i look young, so they probably all think i’m fresh out of high school like them. my college actually has a pretty high school-y vibe and i’m not a big fan of it, but at least i can’t be singled out for my age.",
      "author": "-saturdays",
      "created": 1634644769,
      "upvotes": 2,
      "replies": {}
    },
    "hh8cd2g": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8cd2g/",
      "text": "I'm started undergrad at 27.. even with a full beard, everyone assumed I was around 20-21. I fitted in just fine and made friends.",
      "author": "Savage_Robot_",
      "created": 1634650870,
      "upvotes": 1,
      "replies": {}
    },
    "hh7374x": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7374x/",
      "text": "Why do you care about a party school?\n\nIf you study what you love, you'll find a great group to party with.",
      "author": "StrobeRogers",
      "created": 1634617527,
      "upvotes": 2,
      "replies": {}
    },
    "hh7axrh": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7axrh/",
      "text": "Dude can I be Frank with you I'm a 4th year right now.... And you wouldn't really stick out at all you would have more life experience than most of the other people just starting fresh manure but there are a few guys that like joined the military and just got and just got out who were like 2122 after doing there for years and are now using their GI bill and are starting out is freshmen. We had a guy last year pledged my fraternity who was 22 and a freshman he fits in just fine... In general if you are going to be like in the 25 year old category but transferring in you would be technically classified I think as a junior which isn't too unusual you may make some more friends with lspend with like the juniors and seniors at the University which every year people make new friends shouldn't be a problem or maybe you would maybe fit in a bit more with the grad students which you can interact with students without a problem both graduate and undergraduate. Some universities mix graduate students with undergraduate students for 405 100 level courses upper level classes so you should be able to meet some grad students or juniors and seniors without a problem.\n\nYou will have some more life experience but you won't be that much more experienced than people that have a few years of college under their belt it's not too unusual for people to be working part or full time in going to school these days.\n\nThe freshman may feel like a little younger than you expect just because yeah they did just graduate high school but they tend to lose the high school annoying annoying factor around the end of their 1st semester or quarter whatever once they get into the swing of things with college.\n\nBut if you were translating if you were transferring from a community college with 2 years under your belt you would technically be walking in to college as a junior not a freshman so you would be in classes with people closer to your own age... Oh there's a guy in my fluids class That is 35 getting his undergrad hes a cool dude we hang out sometimes... A 25 year old at a college party isn't really an issue in any case.. His grad students come to frat parties just as much as undergraduates... So people are just looking to have fun just don't judge other people and you should be good.... Everyone is in college for their own thing so just most people don't really care how old you are so long as you're chill and you're just there to study like everyone else lol\n\nKeep in mind most people on a college campus are between the ages of like 17 and 35 Alice students at at least for students so you should be fine fine",
      "author": "pygmypuffonacid",
      "created": 1634623046,
      "upvotes": 1,
      "replies": {
        "hh7ervt": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7ervt/",
          "text": "Yeah, once I transfer I’ll be a junior. There does seem to be a mixed bag age wise. Especially at the community college I attend. Not sure what uni’s going to be like but I hope it’s similar. I really appreciate you taking out the time to respond. This really does make me feel a lot better.",
          "author": "Angelinapatina",
          "created": 1634626160,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh7itvu": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7itvu/",
      "text": "Hm going to a party school, for the sole purpose of partying, seems to be a waste of money for me. Not to mention that maybe you won't find your peers, and you end up hating the party scene. \n\nPerhaps consider just partying abroad (I'm sure you can find a group of party people that'd welcome you)? Or perhaps choosing something you truly want to study, so even if the party aspect doesn't happen, you still grow and learn a lot. Tbh, and maybe it's unpopular, I really enjoyed the learning aspects in college and made lifelong friends from all around the world, and I can physically feel my worldview shifts and widens a lot so I think either way it's still a good experience as long as you study what you want to study",
      "author": "healingsoul24",
      "created": 1634629806,
      "upvotes": 1,
      "replies": {}
    },
    "hh7506p": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7506p/",
      "text": "I would go to the school with the best job connections and internships. Try to find a community college with a co op built into the program. That way you have job experience in the field you're studying. Either that or as suggested do some credits at a college and then transfer to university. \n\nIn terms of the partying it depends what you study you may not even have time.",
      "author": "AfricanTurtles",
      "created": 1634618715,
      "upvotes": 1,
      "replies": {}
    },
    "hh7gpnu": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7gpnu/",
      "text": ">I’m probably going to be around a bunch of 18 year olds and things might awkward\n\nI'm almost 25. Yeah it's gonna be a bit awkward. I feel like a grown up surrounded by high schoolers when I'm on campus. Personally, I'm just here to get my degree, so it doesn't really matter to me. And honestly, at 25 I don't think you'd want to party with a bunch of teenagers anyways. I know I wouldn't",
      "author": "Almadine1997",
      "created": 1634627866,
      "upvotes": 1,
      "replies": {}
    },
    "hh7k4w0": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7k4w0/",
      "text": "If you really want the college experience u will get it. looks wise u might not even be distinguishable, a ton of freshman look way older and they probs won’t even realize unless u tell them.\n\nsince u r older and been working u may find them a bit immature but other than that i don’t see it’ll be a problem",
      "author": "trackxdreams",
      "created": 1634631015,
      "upvotes": 1,
      "replies": {}
    },
    "hh7onr9": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7onr9/",
      "text": "[removed]",
      "author": null,
      "created": 1634635172,
      "upvotes": 1,
      "replies": {}
    },
    "hh7t233": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh7t233/",
      "text": "Stop caring about age",
      "author": "NFC818231",
      "created": 1634639054,
      "upvotes": 1,
      "replies": {}
    },
    "hh829de": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh829de/",
      "text": "bruh why will you go to college? for party or study?",
      "author": "Lawfulness-bot",
      "created": 1634645504,
      "upvotes": 1,
      "replies": {
        "hh9byll": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9byll/",
          "text": "What's wrong with both? Party on Friday nights, study the rest of the time.",
          "author": "UrbanGuerrilla0",
          "created": 1634665813,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh85o3x": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh85o3x/",
      "text": "I went to school at 21 but it was fine.",
      "author": "favnh2011",
      "created": 1634647462,
      "upvotes": 1,
      "replies": {}
    },
    "hh8ej8y": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8ej8y/",
      "text": "NO NEVER TO OLD TO GO BACK TO COLLEGE",
      "author": "crochet_cupid",
      "created": 1634651895,
      "upvotes": 1,
      "replies": {}
    },
    "hh8gv0j": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8gv0j/",
      "text": "Yes",
      "author": "midwest_corn",
      "created": 1634652964,
      "upvotes": 1,
      "replies": {}
    },
    "hh8h76b": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8h76b/",
      "text": "Uh... again",
      "author": "astonaidan",
      "created": 1634653117,
      "upvotes": 1,
      "replies": {}
    },
    "hh6eyjd": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh6eyjd/",
      "text": "Realistically, as long as all your bodily function is still good",
      "author": "redjoker5319",
      "created": 1634605009,
      "upvotes": 0,
      "replies": {}
    },
    "hh9degw": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9degw/",
      "text": "Absolutely never too late. Do what you want",
      "author": "RockOnTheMoon",
      "created": 1634666380,
      "upvotes": 4,
      "replies": {}
    },
    "hh8kbfg": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8kbfg/",
      "text": "When I was in undergrad, I knew people your age and even older (one was 28) that still joined fraternities even, I don’t know how it would feel on your end (it might feel weird being around a bunch of people that are barely out of high school) but the “traditional college age” students usually won’t care/be bothered by the fact that you’re a little older. \n\n(So like, it might feel awkward for you but probably won’t feel awkward for them, so if you can deal with it or get used to it, I wouldn’t worry about it)",
      "author": "caffa4",
      "created": 1634654457,
      "upvotes": 2,
      "replies": {}
    },
    "hh8ozp8": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8ozp8/",
      "text": "Why go to a party school specifically?\n\nI’m at a local private school with a tame party life. They still happen, but it’s nothing crazy and it feels way more mature than some of the parties at the big schools. It’s also nice because a lot of under age students barely drink and those who are of age prefer going to the bars, which would likely be more enjoyable for someone of your age anyways. My school also has lots of adult transfer students and half of my friends during my first year were older than 23.. one was even in his 40s. I don’t think any of us really cared or thought about age because we all felt like adults.",
      "author": "cabbage-soup",
      "created": 1634656437,
      "upvotes": 2,
      "replies": {
        "hha1mt3": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha1mt3/",
          "text": "I’m probably not! It was a theoretical thing. I’m going to transfer somewhere affordable. I just want to make sure it’s not a completely boring school if that makes sense.",
          "author": "Angelinapatina",
          "created": 1634675909,
          "upvotes": 2,
          "replies": {
            "hhabesa": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhabesa/",
              "text": "Tbh no school is boring. I thought my school was going to be boring before I started (mainly because of how small it is), but now my schedule is filled with 5-6 different events every week. It does take the initiative to get involved though, any school can be boring if you just approach it with the ‘im going to class and getting my degree and that’s it’ mentality. People aren’t going to randomly come up and invite you to be friends and hangout either. I learned that pretty quickly during my freshmen year- the moment I got involved with different campus organizations my social life boomed.",
              "author": "cabbage-soup",
              "created": 1634679960,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh8pqej": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8pqej/",
      "text": "Hi, I’m 29 and I just got my bachelors degree. I started at a CC when I was 18, got my associates, and then didn’t go back for 7 years (I started up again at 27). Couple of things to note here:\n1. Nobody cared or noticed that I wasn’t 19. They just thought that I was their age with my shit together. \n2. You work harder because you’re less distracted by the social stuff. \n3. I still made friends. I didn’t go to parties because I lived 45 minutes away and the school is in a sleepy town, but I promise you that you can make friends if you’re willing to put in the effort. \n\nI’m not going to sugar coat it, going to college later is kind of a bitch. You’re balancing a job and getting your life on track with a full credit load in front of you. You’re going to want to quit multiple times. The question is- how bad do you want it?\nAlways bet on yourself. You can do anything with the right attitude. Be confident, be friendly, and you will do fine. I wish you the best of luck.",
      "author": "Kamposita",
      "created": 1634656749,
      "upvotes": 2,
      "replies": {
        "hha1bil": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha1bil/",
          "text": "Wow, that’s amazing!! and kudos to you for having the willpower to go back. Your story is pretty inspirational and I’m saving your comment! \n\nWhen I feel like I can’t do it anymore, I’m going to look back at your response. If you can do it, then I’m hoping I can to. So far, school has not been a walk in the park. I suck at writing so this is something I need to work on. Essays are not my thing, sadly. Sometimes I feel like I’m not smart enough for school. I guess I have to try and fake it til I make it. \n\nI hope you got a job you enjoy! Everyone deserves that.",
          "author": "Angelinapatina",
          "created": 1634675784,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh8vqff": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8vqff/",
      "text": "No one cares. I'm 36 and went to a couple of homecoming parties. There were even some professors there. No one cared at all.",
      "author": "LikelyWriting",
      "created": 1634659260,
      "upvotes": 2,
      "replies": {
        "hh9yzj5": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9yzj5/",
          "text": "Thanks dude",
          "author": "Angelinapatina",
          "created": 1634674839,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh96xea": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh96xea/",
      "text": "To simply put it! Go! You will be glad that you did. I was in your boat as well! 23 applying to my university. long story short I am 26 in my Junior year.  Do not get too hung up on age. Also you will come across many non traditional college students. Good luck.",
      "author": "95xander",
      "created": 1634663819,
      "upvotes": 2,
      "replies": {
        "hh9xbrp": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9xbrp/",
          "text": "Thanks man",
          "author": "Angelinapatina",
          "created": 1634674182,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hh99w7f": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh99w7f/",
      "text": "Nope! But if you do end up “dating”, try for someone as close to your age as possible (if possible, not a requirement but just saying). Also there’s some people that like guys slightly on the older side because they seem to have life more figured out than others. Hope this helped! 😀",
      "author": "TheMtndewdude",
      "created": 1634665002,
      "upvotes": 2,
      "replies": {
        "hh9wn5x": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9wn5x/",
          "text": "Thanks, I’m a lady and I’m not looking to date lol!",
          "author": "Angelinapatina",
          "created": 1634673912,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh9alxu": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9alxu/",
      "text": "You'll fit in just fine man. There are plenty of ppl around that age at college who still party, all the people saying that \"you've missed the boat\" or whatever are idiots. You can totally still party if you want to, it wont be weird. You just may not like the parties that are going on because they can get very juvenile and immature.. drunk chicks and drunk douchebag dudes are very annoying.. but no need to worry, I'm sure thier will be plenty of other party options available. \nYou'll find alot of mid-20 something year olds entering college for the first time who also have the same worry as you, in reality nobody cares or will notice your age. You'll seem like a cooler, more mature kid. The girls will likely find this to be a very attractive trait.",
      "author": "UrbanGuerrilla0",
      "created": 1634665281,
      "upvotes": 2,
      "replies": {
        "hh9wb3z": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9wb3z/",
          "text": "Thanks for your perspective. I think a lot of people’s lives end at 25 and for other people, their lives are just beginning. I want to make it count. I’ve spent a lot of time after high school working my butt off at shit jobs. It’s time for a change. I can’t live like this forever. Btw I’m a lady lol!",
          "author": "Angelinapatina",
          "created": 1634673779,
          "upvotes": 1,
          "replies": {
            "hh9ys5o": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9ys5o/",
              "text": "Yeah, there are tons of people who do that. Especially in the states where education is very unaccessible so plenty of people need time to save up money before starting school. You will have no problem making friends with people younger and older than you. 25 is well within the common college age range. \nI asked a family member about this subject awhile ago and this is what they said \n\"I really don't understand young people these days, believing that 25 is too old to party and attend college, life isn't beholden to a time line. I only went to college for the first time after getting out of prison in the 80s when I was 25. You can bet your ass i went to frat parties, even back then there were plenty of people in thier 20s in college who still partied.\" \n\nI agree, I think young people take life too seriously these days and eventually trap themselves by focusing too much on careers. You 20s are time to explore, experience, make mistakes, learn and have fun. You have your whole life to work, don't rush into a career, even if it's one you know you'll love. Travel, party, learn and make friends. You'll fit in just fine there are going to plenty people around your age in the same boat you are. Don't worry!",
              "author": "UrbanGuerrilla0",
              "created": 1634674756,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh9amy0": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9amy0/",
      "text": "I'm 25, and I started this fall. Granted, I definitely outgrew the partying part of my life. Whether or not you want to hangout with a bunch of drunk teenagers is completely up to you. They'll probably be all about it since you can buy alcohol. As far as age, there's  people in my classes way older than me, and also people younger, so that doesn't matter. Your experience is gonna be whatever you make it to be. My biggest advice tho would be to live off Campus, and only get roommates around your age, as living with someone that young is a completely different game than hanging out with them.",
      "author": "ticklemejesus420",
      "created": 1634665292,
      "upvotes": 2,
      "replies": {
        "hh9ux9q": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9ux9q/",
          "text": "Thanks for the advice. Yeah I plan on living off campus. I can’t imagine living in a dorm room.",
          "author": "Angelinapatina",
          "created": 1634673231,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hh9dswd": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9dswd/",
      "text": "I’m 20 and I’m one of the youngest people in all of my classes. A friend from there is actually in his mid 40’s and starting his first year.  It’s never too late!!",
      "author": "CaptivatingLabyrinth",
      "created": 1634666558,
      "upvotes": 2,
      "replies": {}
    },
    "hh9nxsw": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9nxsw/",
      "text": "man I'm in my 30s and I live in a community of a lot of young people and I think it's great. they can be goofy af but they have a lot of enthusiasm and things have really changed socially between my early 20s and theirs, so it's great to get their perspectives on things. give it a go, 25 is NOT that old :) best years of your life tbh",
      "author": "Klutzy-Classroom6756",
      "created": 1634670527,
      "upvotes": 2,
      "replies": {
        "hh9u7p0": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9u7p0/",
          "text": "Hahaha thanks dude!",
          "author": "Angelinapatina",
          "created": 1634672957,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hha3act": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha3act/",
      "text": "Might I just say, you working and saving up money for college before going is a POWER MOVE! Props to you fam. 25 is not too old at all (a lot of people Ik from school are acc around that age range). Honestly your age doesn’t matter as much as your stamina to “party” does. Some people get past that drinking/smoking weed till you’re out phase but if you’re not past that, a party school would be the way to go. I would suggest you still go tho. Better than not going and wondering what could’ve happened when you’re acc old and don’t have the opportunity.",
      "author": "gis68",
      "created": 1634676564,
      "upvotes": 2,
      "replies": {
        "hhayfks": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhayfks/",
          "text": "Haha thanks, school is expensive so I had to work. I’ll probably start working part time instead of full time since I’m taking a full course load. I don’t think it’s wise to work full time and do school full time. I would never graduate doing that so...I’m trying to speed up this process so I graduate from cc at 25 instead of 26. Next semester I’ll probably end up having to take 18 credits. Wish me luck, this shit’s going to be hard. I’m probably going to have to pull a bunch of all nighters to make this happen. \n\nI’ll probably end up at a regular school once I transfer. Maybe I don’t need to go to a rowdy school to still have fun. My education is the most important thing, but I at least want to spend the other 10% of the time doing lit shit.",
          "author": "Angelinapatina",
          "created": 1634690590,
          "upvotes": 1,
          "replies": {
            "hhbts8i": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhbts8i/",
              "text": "Haha The hustle never stops for you. Good luck with everything! It’ll be great and I’m sure you’ll have a fantastic time. Enjoy every bit of it, even the all nighters. College passes by so fast",
              "author": "gis68",
              "created": 1634706943,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hha7aef": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha7aef/",
      "text": "25? Really? It is never too late or no one is ever too old to pursue a college education. Never.",
      "author": "kittymama25",
      "created": 1634678208,
      "upvotes": 2,
      "replies": {}
    },
    "hhagzco": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhagzco/",
      "text": "No, my roommate in college was 26 and was cool as shit. Just don’t be buying those under 21 alcohol.",
      "author": "SnooLentils5596",
      "created": 1634682437,
      "upvotes": 2,
      "replies": {
        "hhayzyp": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhayzyp/",
          "text": "Yeah no I’m cool, but not that cool lol. I won’t be buying anyone alcohol",
          "author": "Angelinapatina",
          "created": 1634690858,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhahyvq": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhahyvq/",
      "text": "Depends on your personality if you will fit in well",
      "author": "tshaan",
      "created": 1634682878,
      "upvotes": 2,
      "replies": {}
    },
    "hh8v5fr": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8v5fr/",
      "text": "28 and still get drunk every week",
      "author": "FowlersCapt",
      "created": 1634659016,
      "upvotes": 2,
      "replies": {
        "hh9yrtm": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9yrtm/",
          "text": "Hilarious are you still in school?",
          "author": "Angelinapatina",
          "created": 1634674753,
          "upvotes": 0,
          "replies": {
            "hhbdvhn": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhbdvhn/",
              "text": "Unfortunately yeah 😂",
              "author": "FowlersCapt",
              "created": 1634697871,
              "upvotes": 1,
              "replies": {
                "hhbu2kv": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhbu2kv/",
                  "text": "Not unfortunately....you’re doing the damn thing!",
                  "author": "Angelinapatina",
                  "created": 1634707146,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh8y517": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh8y517/",
      "text": "the cutoff age for partying is when don’t feel like partying anymore, as long as you don’t let it consume your life. Age doesn’t matter all that much, there will also be plenty of 20-23 year olds im sure, also plenty of postgrad kids to chill with",
      "author": "bigzim420",
      "created": 1634660265,
      "upvotes": 1,
      "replies": {}
    },
    "hh9052r": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9052r/",
      "text": "Just hurry the hell up and do it before 30. At 25 you are the senior citizen of the crowd, but you can still relate to the people around you.",
      "author": "Virophile",
      "created": 1634661074,
      "upvotes": 1,
      "replies": {
        "hh9xkmw": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9xkmw/",
          "text": "Awesome advice, thanks",
          "author": "Angelinapatina",
          "created": 1634674281,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh94ji0": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh94ji0/",
      "text": "I'm in college & have ppl older than you in my classes. So no. Its not weird. & its never too late to start school no matter what the stigma is. What is weird is wanting to go to a known party school. College parties are no all what they're cracked up to be. It can get out of control & unless you know how to handle yourself at one it can get 😬 intense. I'm pretty sure there are more clubs in your area that are not filled with college students drinking away their midterm papers & homework due at 11:59. Plus local clubs are more monitored. College parties equal underage drinking & drugs & no knowing who is putting what into what. Cops show up all yall gettin arrested. Use your college time to get your education. It's what you're paying for.",
      "author": "OneOfScottsTots4",
      "created": 1634662846,
      "upvotes": 1,
      "replies": {}
    },
    "hh99kts": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh99kts/",
      "text": "Dude im in collage and most of my fellow students are in their 30's or 40's and have kids. So 25 is fine😂",
      "author": "Short_Principle",
      "created": 1634664877,
      "upvotes": 1,
      "replies": {
        "hh9x969": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9x969/",
          "text": "Hahaha thanks",
          "author": "Angelinapatina",
          "created": 1634674154,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh9kqa9": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9kqa9/",
      "text": "No, not at all. I'm 51 studying to be a lawyer, your only limited by your own boundaries, I'm not limited by age, i have dreams/goals, and this point in my life I'm \"ready\" to pursue them. If anything you have knowledge/experience that will help many as to what to expect going forward. It will give you insight as to how those younger than you view the world, & all that's going on it right now, it's a lot to absorb, even overwhelming at moments. As far as partying what's your concerns? Have you checked out the college before applying? I'm asking to get a baseline & to not assume anything.\nI wish you blessings/success & just enjoy the journey.",
      "author": "NerdyGurl4life",
      "created": 1634669252,
      "upvotes": 1,
      "replies": {}
    },
    "hh9vrrq": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9vrrq/",
      "text": "It's toeing. Like there's a line you're not meant to cross so if your toe is on it you know you body isn't across because the toe is in front. Look, you can go out to bars and drink at your age. Go to college if you want an education/certifications.",
      "author": "LandoSyztem",
      "created": 1634673566,
      "upvotes": 1,
      "replies": {}
    },
    "hh9xvrw": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hh9xvrw/",
      "text": "Are you planning on being a 25 year old student and focusing on your studies or are you planning on being a 25 year old that wants to party with children? The latter would be weird.",
      "author": "WannabeIT_guy",
      "created": 1634674403,
      "upvotes": 1,
      "replies": {}
    },
    "hha0cta": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha0cta/",
      "text": "25 isn't to old to go out to bars, etc. I'm 27 and in grad school and I still go out to bars. You'll just need to pick and choose the bars/parties you go to.",
      "author": "NoRadish5386",
      "created": 1634675393,
      "upvotes": 1,
      "replies": {}
    },
    "hha0wpq": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha0wpq/",
      "text": "For sure go. \n\nI’ll be real, it probably will be weird if you’re hanging out with fresher type people out of high school partying. \n\nBut...there’s more people than that a university. I got like 5 years on you and I’m in school, and I’ve found other 25-30 year olds in undergrad and in graduate school that I’ve been able to hangout with. You’re not alone out there. There’s plenty of non traditional people as well.\n\nThat said, don’t be a dick to the younger people either. Let them be. I haven’t had any problems really with them they’re just in a different chapter of their lives. It’s actually funny some times, because inevitably you’ll have to work with some of them through school. But yeah, just chill & be who you are. \n\nI say party school because any school will give you academics. Any school will have some other people there as well. But not every school is a party school or has the social infrastructure and planning history behind it, in that regard, to be a party school. And if your prospective institution is also a sports school, then stack on that not every school has invested so much into building that brand to have had attracted enough attention on a national level to support a decent sports program. That stuff takes years and years to do and a lot of money. The benefits of these types of schools is that they provide more options for the students to have a social life and they directly stimulate that aspect of school, to where it isn’t just doing assignments & getting grades. There is something to look forward to outside of class! Or there is at least an option of something to do on a Friday night! That’s pretty nice & convenient honestly.\n\nMy school doesn’t have the above stated environment. Instead it completely lacks any student life. The institution had decided research & marketing to international students was the way to grow and their probably not wrong, but that means in the meantime until it gets large enough (fairly newer institution) it will have a social drought and be only that. Lots of academic type folks. Lots of talk of research & job skills, seminars all that, etc. these are the “things to do” here. Aka more work haha. Avoid these types of schools if you can. Best way to do so is do your research!!! Really, ask people that go to those schools about their student life and visit the schools. Really dig in. Because every school’s marketing team will say the same thing, “this school is the best” lol of course it is! That’s the 1000th school I’ve come across that’s apparently the “best”, wow tough decision lol. They’re all the best, guess it doesn’t matter right? Wrong. It does. Choose wisely lol",
      "author": "pekkalacd",
      "created": 1634675618,
      "upvotes": 1,
      "replies": {}
    },
    "hha1myo": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hha1myo/",
      "text": "I made a friend who was 27 when I started uni at 18. Unless you hit on barely legal teens all the time (sexually speaking) I don't find anything strange in making friends younger than you and I wouldn't persinally care that you were there, I didn't care with my friend at least.",
      "author": "cegalleta",
      "created": 1634675910,
      "upvotes": 1,
      "replies": {}
    },
    "hhy9zix": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hhy9zix/",
      "text": "I've thought of this too. I'm now 29, but graduated at 24 from a commuter college that was super lame and had none of the party campus environment that you see in the movies. Plus I was mainly focused on grades etc.\n\nNow that I'm changing fields to IT, since I couldn't find a job with my first degree of Kinesiology, I'm debating whether to go for cheap at an online school that would only cost around 8000-11000. Or to go back in person to a big public university for 2 years which could be anywhere from 20-40k, plus driving in, parking, more book expenses, and I would have to switch from working full time to part time.\n\nNot much dating in my town so I was thinking of applying to a big uni for more dating opportunities that my first college did not provide. Or would it be better to go with the cheaper and quicker online option, while keeping my full time job and save more money?",
      "author": "ElectricOne55",
      "created": 1635137968,
      "upvotes": 1,
      "replies": {
        "hi17pzi": {
          "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hi17pzi/",
          "text": "Mmm, wow I was actually thinking about studying Kinesiology. What sort of jobs were you looking at? I might have to re-evaluate what I want to study in that case. \n\nIf I’m being honest, online school really really sucks. I’m currently doing online school because I live in the Bay Area and people are terrified to return to campus (mostly professors) It’s crazy because we have the vaccine now yet professors are afraid to come back. People can’t be afraid of COVID forever. Things need to go back to normal. \n\nIf you feel like you would do well with online school then do that. With online school though, you won’t meet anyone and you probably won’t learn that much. Also think about whether or not you would enjoy sitting on the computer for hours on end lol. \n\nWould you be able to afford rent while going to a big uni and working part time? \n\nIn person is way better than online school. When you go to a big uni, you’re paying for that social aspect and just a better education overall.",
          "author": "Angelinapatina",
          "created": 1635195739,
          "upvotes": 1,
          "replies": {
            "hi187wg": {
              "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hi187wg/",
              "text": "I know the online one at WGU is 4000 for a 6 month semester, and I already have 1 degree so I probably could finish the program in 1 maybe 2 semesters max. Whereas, if I went to Georgia University the closest state school near me it'd be 25000 just for tuition I would have to go 2 1/2 years minimum that's if they transfer my classes, and I would have to quit my job and move cities. My other option would be the state school near me, but even then that would be 22000 and 2 1/2 yrs and I'd probably have to switch part time because I work 11:30 am to 7:30pm, and I'd have to spend more $ on gas driving to classes too.",
              "author": "ElectricOne55",
              "created": 1635195947,
              "upvotes": 1,
              "replies": {
                "hi198pa": {
                  "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hi198pa/",
                  "text": "Is this Western Governors? I would just do that since you’d be done with school way faster. I’ve never heard of being able to get a degree in less than a year. That’s amazing!",
                  "author": "Angelinapatina",
                  "created": 1635196371,
                  "upvotes": 1,
                  "replies": {
                    "hi1degl": {
                      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hi1degl/",
                      "text": "Ya, I already have a degree and 3 comptia certs so it should be fairly quick to finish",
                      "author": "ElectricOne55",
                      "created": 1635198135,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hi5c7zq": {
      "link": "/r/college/comments/qaxop7/is_25_too_old_to_start_college_and_attend_a_party/hi5c7zq/",
      "text": "In the general education requirements for the first two years, you'll be with mostly 18 and 19-year-olds. When you start your classes for your major in the 3rd year, the quality of the company gets better no matter what age you are surrounded by.  Once you get out of community college and start at a university, there will be more opportunities to find the people you have things in common with whether it's a party school or not. Speaking from experience, community college is good because it's affordable, but it's not good for getting a full college experience.  Once you transfer for your third year, you'll be surrounded by more students of all ages so I don't think that you'll notice your age as much by then. I hope this helped. There is no age that you're [towing](https://www.delandtowing.com) the line as long as what you're doing is worth getting the experience you want.",
      "author": "Equivalent-Wish2181",
      "created": 1635273963,
      "upvotes": 1,
      "replies": {}
    }
  }
}