{
  "sid": "rioe9n",
  "link": "/r/college/comments/rioe9n/is_a_prof_telling_someone_to_publish_a_common/",
  "title:": "Is a Prof telling someone to publish a common thing?",
  "text": "I recently did a literary critical analysis over Fahrenheit 451 for Comp 2. My professor asked if he could share my paper with colleagues and future students and told me I should look into publishing it. He told me my analysis was insightful and a new perspective he hadn’t heard before. Is this as big of a compliment as I’m making it out to be or is it common? I’m a college freshman so I’ve never had experience with this kind of thing and to me this is a huge compliment coming from a professor.",
  "author": "SoftReputation_",
  "created": 1639767863,
  "updated": 1639787347,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hoye6t5": {
      "link": "/r/college/comments/rioe9n/is_a_prof_telling_someone_to_publish_a_common/hoye6t5/",
      "text": "It is not common.",
      "author": "skeeg153",
      "created": 1639768458,
      "upvotes": 2,
      "replies": {}
    },
    "hoygbbc": {
      "link": "/r/college/comments/rioe9n/is_a_prof_telling_someone_to_publish_a_common/hoygbbc/",
      "text": "It's quite flattering. If you want to know if he means it, follow up and ask him for suggestions for appropriate publications. Then you'll know if \"you should publish this\" means \"I want to pay you a compliment\" or \"let's get a first-year student a legit publication,\" which would be a real coup. Good luck!",
      "author": "trunkNotNose",
      "created": 1639769293,
      "upvotes": 1,
      "replies": {}
    },
    "hoyt3cw": {
      "link": "/r/college/comments/rioe9n/is_a_prof_telling_someone_to_publish_a_common/hoyt3cw/",
      "text": "Congratulations! That is incredibly uncommon. Even if it was more a generic compliment than something to be seriously pursued, that is amazing! \n\nLook into it! It is generally not too hard to at least send it for review (I had a few articles published as an undergraduate and even worked at a journal so I kind of know the process). Undergraduate academic journals on literary analysis would be your first place to look. They don't have to be large or prestigious (and all legitimate ones are free). Your own university might have one, many are student-run. Some only take submission from their own university, others take submissions from anywhere. Submit it to one and wait, they might reject it, recommend changes, or accept it. If it gets rejected, don't worry, some undergraduate academic journals are super selective. The vast majority of undergraduates never have a professor say they should publish something, and even less actual submit something to be published, and an even smaller number ultimately get published during undergraduate.",
      "author": "DrAlawyn",
      "created": 1639774416,
      "upvotes": 1,
      "replies": {}
    }
  }
}