{
  "sid": "qul2vu",
  "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/",
  "title:": "Have you ever studied really hard for a test and still feel like you messed up afterwards?",
  "text": "I spent like a good 6 hours studying for my Calc midterm with a friend. We went over all of the material the gave us and thought we had a good understanding of it. The test wasn't has hard as I thought, but afterwards I realized I goofed up some easy questions. I feel really stupid now and am having trouble keeping calm until I get my scores back because I really don't want to retake Calc.",
  "author": "M_183",
  "created": 1636995904,
  "updated": 1637181434,
  "over_18": false,
  "upvotes": 28,
  "upvote_ratio": 0.98,
  "comments": {
    "hkr3qum": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hkr3qum/",
      "text": "I studied really hard for an exam before and I got like a D or something. It sucked ass and I definitely cried. Especially because I felt so confident afterwards.",
      "author": "Peachy_Pastel",
      "created": 1637002488,
      "upvotes": 13,
      "replies": {}
    },
    "hkrgxy2": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hkrgxy2/",
      "text": "Yup. Literally a few hours ago. I was feeling so good about it and then suddenly half of the questions weren’t even on the study guide (which have so far been very similar to the tests). I just pray that It’s better than I think. Hope all goes well OP!",
      "author": "JupiterRocket",
      "created": 1637007714,
      "upvotes": 8,
      "replies": {}
    },
    "hkrj6ah": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hkrj6ah/",
      "text": "Absolutely, I just took an economics exam last week which I studied for so long. But when I took the exam it's like I basically forgot everything I studied...",
      "author": "aanuma",
      "created": 1637008578,
      "upvotes": 3,
      "replies": {}
    },
    "hkrqf1h": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hkrqf1h/",
      "text": "It has happened a few times, never with a bad grade per say but way less than what I expected.\n\nAlso, in college I stopped trusting my guts regarding to how an exam went and the grade. I remember an exam I thought I completely flunked and I got an okay-grade in the end.",
      "author": "Matrozi",
      "created": 1637011404,
      "upvotes": 3,
      "replies": {}
    },
    "hkru0hd": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hkru0hd/",
      "text": "Yep, and it was also Calculus (plus an astronomy course). The sciences and maths are definitely the ones I'm always critical about. I'm never truly confident that I did well despite basically understanding the material enough and studying for hours. There's been times that I was right in my doubt and there's been times that I should have been more confident. It really is a gamble, no matter how hard you study, if you'll do well sometimes.",
      "author": "dyingBi",
      "created": 1637012809,
      "upvotes": 2,
      "replies": {}
    },
    "hks41ki": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hks41ki/",
      "text": "all the time",
      "author": "OswaldNovember",
      "created": 1637016896,
      "upvotes": 2,
      "replies": {}
    },
    "hkt479z": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hkt479z/",
      "text": "I've never studied in my life, but I often feel as if I totally bombed a test. Sometimes it isn't as bad as I assumed it would be though.",
      "author": "asscarnage",
      "created": 1637032899,
      "upvotes": 1,
      "replies": {}
    },
    "hkuwgn7": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hkuwgn7/",
      "text": "Yes, I just took my second college algebra exam, and one of the questions show a synthetic division. The question asked where the divisor was in the problem, and my dumb-a chose the dividend. I feel so dumb because those are the easy questions that should be a no brainer.  I just hate that I missed out on easy points.\n\nJust try and brush it off, and stay confident.",
      "author": "Texas_Rangers17",
      "created": 1637073937,
      "upvotes": 1,
      "replies": {}
    },
    "hks3tfq": {
      "link": "/r/college/comments/qul2vu/have_you_ever_studied_really_hard_for_a_test_and/hks3tfq/",
      "text": "6 hours are a joke i study months for exams",
      "author": "Raymond_K_Hessel2000",
      "created": 1637016801,
      "upvotes": 0,
      "replies": {}
    }
  }
}