{
  "sid": "qi54hm",
  "link": "/r/college/comments/qi54hm/college_is_so_lonely/",
  "title:": "College is so lonely",
  "text": "I’m outgoing and everyone is out partying. I’m literally going alone to the parties tomorrow because no one wants to go with me. I have friends, but none of them check in on me or ask me to do anything. I always ask them how they are and if they want to eat. Is it too late to even find friends? Idk it really hurts at this point.",
  "author": "Useless_Goose",
  "created": 1635483536,
  "updated": 1635779804,
  "over_18": false,
  "upvotes": 100,
  "upvote_ratio": 0.96,
  "comments": {
    "hihd9to": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hihd9to/",
      "text": "Relatable. I talk to people in classes occasionally but don’t hang out with them. Everyone is already with friends and I’m just in my dorm watching Netflix lmao",
      "author": "TylerMoy7",
      "created": 1635488345,
      "upvotes": 62,
      "replies": {
        "hiho5w7": {
          "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiho5w7/",
          "text": "I love the internet for moments like this. It helps to know there are others in your situation. I don't mind being alone, but I am looking for friends at my dorm. I talk to people but haven't had anything substantial.",
          "author": "Theoneandonlyboy",
          "created": 1635497554,
          "upvotes": 44,
          "replies": {}
        },
        "hikzvvd": {
          "link": "/r/college/comments/qi54hm/college_is_so_lonely/hikzvvd/",
          "text": "There’s also the implication that you befriend people in class but unless you go to a small school or you’re roommates or in the same major, you’re probably never gonna see them again. For me it’s a blessing and a curse: if I don’t like somebody, the chances of being forced to interact with them are slim to none.",
          "author": "CapriciousSalmon",
          "created": 1635552946,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hih834x": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hih834x/",
      "text": "Do you not make friends at the parties if you’re so outgoing?",
      "author": "RobloxianNoob",
      "created": 1635484559,
      "upvotes": 26,
      "replies": {
        "hihbcep": {
          "link": "/r/college/comments/qi54hm/college_is_so_lonely/hihbcep/",
          "text": "They leave me on open when I try to talk to them. Guess they were only nice to me because they were drunk.",
          "author": "Useless_Goose",
          "created": 1635486882,
          "upvotes": 27,
          "replies": {
            "hihglsv": {
              "link": "/r/college/comments/qi54hm/college_is_so_lonely/hihglsv/",
              "text": "Just keep moving forward. You’ll find the right people or someone eventually. You have to. But then again don’t forget to work on yourself too.",
              "author": "fuck_rockstar_honest",
              "created": 1635490981,
              "upvotes": 17,
              "replies": {
                "hiho7tq": {
                  "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiho7tq/",
                  "text": "Working on yourself is a big one. Being happy by yourself and being your own friend is godly.",
                  "author": "Theoneandonlyboy",
                  "created": 1635497604,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiiducm": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiiducm/",
      "text": "At least you know a party to go to unlike me",
      "author": "Clarinetist123",
      "created": 1635514266,
      "upvotes": 21,
      "replies": {
        "hil04vr": {
          "link": "/r/college/comments/qi54hm/college_is_so_lonely/hil04vr/",
          "text": "This happened to me. Because it’s Halloween, the frats were allowed to throw parties but I didn’t know until they were happening. I tried to get in but they had capacity limits and wouldn’t let me in, saying I should’ve gotten there early. How was I supposed to know?!",
          "author": "CapriciousSalmon",
          "created": 1635553067,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hii4988": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hii4988/",
      "text": "i actually made friends through discord- they have servers you can make for specific schools and i was able to meet some cool ppl on there",
      "author": "GhostlySlime",
      "created": 1635509531,
      "upvotes": 13,
      "replies": {}
    },
    "hii411p": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hii411p/",
      "text": "I feel you. I'm in my second year now and the only \"friends\" I have are my basketball teammates who I don't even talk to outside of basketball. It gets very lonely",
      "author": "ZipKip",
      "created": 1635509403,
      "upvotes": 11,
      "replies": {}
    },
    "hiii7eh": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiii7eh/",
      "text": "I completely feel you I haven’t made any friends in 2 years of university ( covid didn’t help) and I really used to make me feel bad, and it still hurts cause it’s rly hard. But lately I try to find the « good » things to being alone. It means all the time you have is for you and I’ve been using it to work on myself (going to the gym improving my grades taking time for the things I love ect…). But being always alone is still really hard ngl so good luck.",
      "author": "JAZZ_O_MAX",
      "created": 1635516200,
      "upvotes": 7,
      "replies": {}
    },
    "hiij1w6": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiij1w6/",
      "text": "I started  attending an activity that was completely different and it helped a bit. It's not a time to sit an mope but try something new.",
      "author": "leoh96",
      "created": 1635516562,
      "upvotes": 7,
      "replies": {}
    },
    "hiksacq": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiksacq/",
      "text": "Lmao I've been in colleges for 2 years and I've given up on finding a friend group.",
      "author": "aanuma",
      "created": 1635549356,
      "upvotes": 6,
      "replies": {}
    },
    "hiituhy": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiituhy/",
      "text": "Yeah, I never managed to find anyone that really wanted to talk from a party. Most of my current friends came from clubs or just random campus stuff, like suitemate and classmate. Having to put effort in sucks, but it's the nature for some relationships",
      "author": "kingmatt119",
      "created": 1635520987,
      "upvotes": 4,
      "replies": {}
    },
    "hijlt9f": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hijlt9f/",
      "text": "I’m looking for a friend.",
      "author": "OnewaytoOTschool",
      "created": 1635531870,
      "upvotes": 4,
      "replies": {}
    },
    "hikc96y": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hikc96y/",
      "text": "I relate so much... Lost a lot of friends & growing apart from others while my only really good friends live in another city (with the exception of one person still in my town)\nCan't wait to graduate and get the fuck outta here :(",
      "author": "cay-jett",
      "created": 1635542380,
      "upvotes": 5,
      "replies": {}
    },
    "hiieq98": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiieq98/",
      "text": "RSOs have been where I’ve been meeting people that I get along with outside of class",
      "author": "unmotivatedapplicant",
      "created": 1635514671,
      "upvotes": 3,
      "replies": {}
    },
    "hijxzzo": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hijxzzo/",
      "text": "I’m so sorry you are feeling this way. I don’t know if it’s any consolation but I think a lot of people are having similar experiences. \n\nKeep in mind, if you grew up in one area, you may have gone to school with kids for up to 12 years. Of course those friendships will be different from people you have only known for a short time. \n\nOne thing that helped me was to get involved in a club whose cause was important to me. It helped because I was focused on the issue and actively trying to make a difference — and I was surrounded by people with similar values. We bonded over shared activities, not just partying.",
      "author": "inflewants",
      "created": 1635536697,
      "upvotes": 3,
      "replies": {}
    },
    "hil2kax": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hil2kax/",
      "text": "Dude, totally down to be your friend. I'm in my fourth year  and got no friends in college. It sucks but its always cool to make friends when you can",
      "author": "TheSadWanderer",
      "created": 1635554226,
      "upvotes": 2,
      "replies": {}
    },
    "hiiirof": {
      "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiiirof/",
      "text": "Why don’t you make friends at the parties you go to? I met one of my closest homies smoking ganja outside a party chillin bro I rolled by myself to it too. I also met some friends doing fencing this semester. Get into a club sport or somethin dude don’t be doom and gloom",
      "author": "hopderp17",
      "created": 1635516441,
      "upvotes": -2,
      "replies": {
        "hiiqm0r": {
          "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiiqm0r/",
          "text": "Because you need to get invited to get into parties in 2021?",
          "author": "ComprehensiveFeed56",
          "created": 1635519676,
          "upvotes": 9,
          "replies": {
            "hil0i10": {
              "link": "/r/college/comments/qi54hm/college_is_so_lonely/hil0i10/",
              "text": "That or you have to get there early. I live next to the frats but didn’t know they threw a Halloween party until right as they were happening. they told me I should’ve gotten in early but how was I supposed to know there was a party to begin with?",
              "author": "CapriciousSalmon",
              "created": 1635553239,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hiq3j6p": {
          "link": "/r/college/comments/qi54hm/college_is_so_lonely/hiq3j6p/",
          "text": "It’s easy for you to say, I dislike sports and all the friends I make at parties don’t respond to me the next day.",
          "author": "Useless_Goose",
          "created": 1635650912,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}