{
  "sid": "jp5ey8",
  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/",
  "title:": "Is it rude to leave a class if a professor is still speaking?",
  "text": "If its 10 sharp and the class ends at 10, I am logging off the zoom meeting. I’m on a schedule. Sometimes professors like to go over the class time.",
  "author": null,
  "created": 1604670737,
  "over_18": false,
  "upvotes": 1227,
  "upvote_ratio": 0.97,
  "comments": {
    "gbjiqcg": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbjiqcg/",
      "text": "In my opinion, I think it's rude in principle, but I understand it. It's your choice.",
      "author": "SquigglyHamster",
      "created": 1604804116,
      "upvotes": 1,
      "replies": {}
    },
    "gbg4flr": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbg4flr/",
      "text": "no, i have a professor that always goes over time and if i dont leave i will be late to my next class",
      "author": "purple_snails",
      "created": 1604752288,
      "upvotes": 1,
      "replies": {}
    },
    "gbfngbq": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbfngbq/",
      "text": "you should just leave if they go over time if ur in a hurry.  Had that happen when a professor went 10 mins over his time, even at the 10 min mark, he continue to talk.  I took off and went to work as fast as i can, was 4 mins late... :(\n\nprofessor at the next class was apologetic about going over class time and says whomever that took off needed a note, he would provide one...",
      "author": "Albort",
      "created": 1604734777,
      "upvotes": 1,
      "replies": {}
    },
    "gbfeeyu": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbfeeyu/",
      "text": "If I have to leave early, for example, if I have a business meeting starting at 10 sharp, I write the professor an apology for leaving.",
      "author": "chesterfielders",
      "created": 1604726812,
      "upvotes": 1,
      "replies": {}
    },
    "gbfatcw": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbfatcw/",
      "text": "It's rude to show up late to your later commitments.  \n\n\nIn order to remain punctual for all of my commitments, I am obligated to respect the hard cutoff times for earlier commitments. Any professor who is a functional adult respects and understands that.",
      "author": "darkapplepolisher",
      "created": 1604724208,
      "upvotes": 1,
      "replies": {}
    },
    "gbf7az7": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbf7az7/",
      "text": "No, and honestly, who cares?",
      "author": "Strawberries53",
      "created": 1604721904,
      "upvotes": 1,
      "replies": {}
    },
    "gbf5bl6": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbf5bl6/",
      "text": "Remind them of the time first but if they're just ranting then I'd head out",
      "author": "_theatre_junkie",
      "created": 1604720688,
      "upvotes": 1,
      "replies": {}
    },
    "gbf2vme": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbf2vme/",
      "text": "Professor of 8 years here. Yes, some will be offended. They shouldn’t be. Watch your time, respect your students. Some get this idea they are the center of the collective academic universe. That said, it’s not like you are walking out of a physical room. You are probably fine and won’t be noticed.",
      "author": "averagetalldude",
      "created": 1604719215,
      "upvotes": 1,
      "replies": {}
    },
    "gbevf2x": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbevf2x/",
      "text": "I ask my students to tell me when I'm at or over time and it looks like I'm not winding down. Sometimes I just get so excited I don't notice the time. I'm also not offended when someone leaves on time.",
      "author": "Cjb3z4",
      "created": 1604714817,
      "upvotes": 1,
      "replies": {}
    },
    "gbeojry": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbeojry/",
      "text": "Yes it’s inappropriate to leave early just easier to hit the leave button. No different than leaving a classroom early when professor is still speaking.",
      "author": "flipturnca",
      "created": 1604710846,
      "upvotes": 1,
      "replies": {}
    },
    "gbelwvz": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbelwvz/",
      "text": "Just had a high school flashback: \"the bell doesn't dismiss you! I dismiss you!\" Thanks Mrs. Peterson.",
      "author": "CliffyClaven",
      "created": 1604709363,
      "upvotes": 1,
      "replies": {}
    },
    "gbei3xw": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbei3xw/",
      "text": "I don’t see this as an issue as long as you’re not interrupting the other students when making your exit. We all were students once before and know how there is a limited amount of time in between each class (especially with larger campuses).  At the end of the day, you paid for the course and we’re getting paid to teach it.  Just remember that most of us spend several hours, if not days, preparing lectures in advance on our own time.  We also don’t get paid all that well either.",
      "author": "apl2291",
      "created": 1604707241,
      "upvotes": 2,
      "replies": {}
    },
    "gbegg87": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbegg87/",
      "text": "Professor here. Going over your allotted time is rude and disrespectful to your students. Full stop. If you are sufficiently qualified to teach a college class, learn how to read a damn clock. \n\nA few years ago I taught in a classroom immediately after a habitual late-ending professor. There were 10 minutes between classes. I routinely had to enter the room when he was five minutes over and start getting out my notes, organizing handouts, etc. My students loitering in the hallway would take my entrance as their cue that it was ok to enter and start taking seats. It was hilarious to watch the other professor try to figure out how to finish his endless thoughts when his class was getting up to leave and I was literally taking over the teaching area. \n\nDon’t be that guy. If you ever teach, end your damn class on time!",
      "author": "fredprof9999",
      "created": 1604706312,
      "upvotes": 3,
      "replies": {}
    },
    "gbeeqsc": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbeeqsc/",
      "text": "No.",
      "author": "xxxLilJune",
      "created": 1604705381,
      "upvotes": 1,
      "replies": {}
    },
    "gbedjpf": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbedjpf/",
      "text": "Nah, rude would be interrupting them and saying you are late for you butt appointment",
      "author": "Nullveer",
      "created": 1604704735,
      "upvotes": 1,
      "replies": {}
    },
    "gbe8ss2": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbe8ss2/",
      "text": "if you have to leave then leave, otherwise I'd stay because they could say something important. I have a few professors who go over class time by like 10-20 minutes every class and when they start too see a bunch of people drop from the zoom they realize they need to end class. But a lot of my professors use the last couple minutes to go over what we need to do for the week so I have to stay.",
      "author": "mmccnnmm",
      "created": 1604702234,
      "upvotes": 1,
      "replies": {}
    },
    "gbe1icl": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbe1icl/",
      "text": "Idk about everyone else but I have one professor that randomly gives “attendance quizzes” because he knows that some students leave halfway through or early in general, makes me nervous to leave 😂😂",
      "author": "KrisTheBrit489",
      "created": 1604698553,
      "upvotes": 1,
      "replies": {}
    },
    "gbe1hws": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbe1hws/",
      "text": "Idk about everyone else but I have one professor that randomly gives “attendance quizzes” because he knows that some students leave halfway through or early in general, makes me nervous to leave 😂😂",
      "author": "KrisTheBrit489",
      "created": 1604698547,
      "upvotes": 1,
      "replies": {}
    },
    "gbe1hq4": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbe1hq4/",
      "text": "It's rude yes but should you actually care is the real question?",
      "author": "mloclamX",
      "created": 1604698544,
      "upvotes": -2,
      "replies": {}
    },
    "gbe0ia1": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbe0ia1/",
      "text": "You paid a hella amount for the class, and your prof is getting paid... I don’t see why not lol",
      "author": "Lusthetics",
      "created": 1604698071,
      "upvotes": 2,
      "replies": {}
    },
    "gbdzid5": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdzid5/",
      "text": "Personally, if I absolutely have to go because I have something else to do, I will send the prof a message that says something like, “Thank you! I have to log off as I have something else right now. Have a good day.” If not, I’ll stick around until the professor wraps up.\n\nI do think it’s a little rude when the prof is wrapping up and people just log out right at the moment the class should end without thanking the professor, but that’s just a pet peeve of mine.",
      "author": "SLynch0000",
      "created": 1604697597,
      "upvotes": 1,
      "replies": {}
    },
    "gbdrbrb": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdrbrb/",
      "text": "Reach out to your professor ahead of time. Let them be in know of your reasoning for suddenly logging off. Apologize ahead of time. This shows them that you have at least considered them.",
      "author": null,
      "created": 1604693793,
      "upvotes": 2,
      "replies": {}
    },
    "gbdqovr": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdqovr/",
      "text": "I mean I think it is a bit rude, but I dont think you are wrong either.",
      "author": null,
      "created": 1604693492,
      "upvotes": -1,
      "replies": {}
    },
    "gbdnzzy": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdnzzy/",
      "text": "Their problem if they go over time. We all got stuff to do so just leave if you need to.",
      "author": "RedHeadMexican4",
      "created": 1604692199,
      "upvotes": 1,
      "replies": {}
    },
    "gbdl6px": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdl6px/",
      "text": "your loss Mr cool guy lmao. i guarantee you have 3 minutes to spare in your oh-so busy life.",
      "author": "Chayse_21",
      "created": 1604690828,
      "upvotes": 1,
      "replies": {}
    },
    "gbdkbxd": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdkbxd/",
      "text": "I normally try to stick around for a couple minutes just in case something important comes up. My classes are pretty small and could see immediately leaving as being seen as rude but like others said they shouldn't be going over the specified class time.",
      "author": "potato123789",
      "created": 1604690419,
      "upvotes": 1,
      "replies": {}
    },
    "gbdiuhz": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdiuhz/",
      "text": "Shit i don't even attend lectures anymore so you're doing better than me and a lot of students by just attending class",
      "author": "Roastprokbun",
      "created": 1604689704,
      "upvotes": 1,
      "replies": {}
    },
    "gbddxav": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbddxav/",
      "text": "Even in-person, the professor can’t make you stay. If you’re on a schedule, then you’re on a schedule. You’re an adult, and you have obligations. Anybody with a heart knows this. If anyone has a problem with it, then take it up with HR.\n\nIf you’re afraid of missing anything, email your professor about why you hd to leave and ask if they can catch you up to speed on what you missed.",
      "author": "WingsofRain",
      "created": 1604687387,
      "upvotes": 2,
      "replies": {}
    },
    "gbdbqqd": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdbqqd/",
      "text": "Dude just mute him and close out the tab once it's actually over if u care so much, really no problem here",
      "author": "littlemessi101",
      "created": 1604686349,
      "upvotes": 1,
      "replies": {}
    },
    "gbda356": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbda356/",
      "text": "what really bothers me is professors who start class 5 minutes late & then expect us to stay 5 minutes late to make up for it. i'm sorry but i have classes back to back all week, i literally do not have an extra 5 minutes to spare after every class! i feel like they sometimes forget we have other classes to get to & that they also need to be respectful of our time by starting & ending class on time. i can't believe how many of my teachers are consistently late to their own classes while all of their students sit & wait for them.",
      "author": "lyndsay0413",
      "created": 1604685582,
      "upvotes": 2,
      "replies": {}
    },
    "gbd8tqw": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd8tqw/",
      "text": "I would leave a message in Chat saying you have another thing scheduled.",
      "author": "AcademicDifficulty",
      "created": 1604685003,
      "upvotes": 1,
      "replies": {}
    },
    "gbd7af0": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd7af0/",
      "text": "Yes, if I were a professor I'd consider it incredibly rude. Think about it like this, the teacher's devoted all that time to transfer their knowledge over to you and you demonstrate how little you care by leaving mid-sentence.",
      "author": "MiddleGuilty",
      "created": 1604684295,
      "upvotes": 4,
      "replies": {}
    },
    "gbd4ntr": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd4ntr/",
      "text": "I have a 8:30 class that ends at 9:50 and then I have a 10 class right after. My prof for the 8:30 class will regularly go 5-10 minutes over and I consider that rude. Like I've got to take a dump or get something to eat before I have to sit for another hour and a half and digging into my 10 minute break is annoying.\n\nI just shut off and leave unless she's wrapping up a slide.",
      "author": "B0_SSMAN",
      "created": 1604683099,
      "upvotes": 2,
      "replies": {}
    },
    "gbd1zf8": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd1zf8/",
      "text": "No not at all. Im sure they'd be understanding of it.",
      "author": "LarJanus69",
      "created": 1604681879,
      "upvotes": 1,
      "replies": {}
    },
    "gbd0yzr": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd0yzr/",
      "text": "As an educator and a graduate student, I do think it is very rude; however, I also understand if a student needs to leave class. \nFor me, I poured my heart and soul into my lessons. I did my best for the students because that is my expectation and no less than what the students deserved. It can feel like an uphill battle if students blatantly disrespect your efforts; however, the majority of students are attentive, excited, and engaged in elementary music or high school band class.\nIf you need to leave class, leave class without feeling guilty. You are an adult that has priorities and expectations outside of the classroom. Unless you consistently disrupt and leave during class time, you do not owe them an explanation. At that point, extend a small courtesy and let them know what is up--just to be nice.\n\nEDIT: It is perfectly okay for you to leave class time or a Zoom meeting if the professor holds you over. They need to respect YOUR time, just as you respect their time.",
      "author": "magnolias4lyfe",
      "created": 1604681427,
      "upvotes": 4,
      "replies": {}
    },
    "gbcx0o4": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcx0o4/",
      "text": "It could potentially come off as a bit rude, especially depending on your class size. Perhaps you should send your professor an email explaining that you're on a tight schedule and have to leave by a specific time in order to attend to whatever your next obligation is. I know that everyone says this, but communication is key!\n\n Back when school was in person, I used to just tell my professors at the start of the semester that I might arrive late to class or have to leave early due to my on-campus job, which was halfway across campus. We had an understanding and they never penalized me for it.",
      "author": "Staticfair",
      "created": 1604679637,
      "upvotes": 4,
      "replies": {}
    },
    "gbcwtvp": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcwtvp/",
      "text": "Lately a lot of my friends have profs that go over 30-40 mins over on zoom. It’s ridiculous. I’d say to PM them privately in the chat saying you’re leaving bc you have work/class/etc, and if you don’t trust them to post important info online maybe try and ask someone else in the class if possible later on? Ive seen some classes make discord channels for their class and they include the TA (sometimes) so that could be an option if they’re willing haha.",
      "author": "thatsdoughshit",
      "created": 1604679551,
      "upvotes": 2,
      "replies": {}
    },
    "gbcv7cr": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcv7cr/",
      "text": "I would be ok with it because I try to never go over. If I do, it's by accident!",
      "author": "whats_it_to_you77",
      "created": 1604678797,
      "upvotes": 3,
      "replies": {}
    },
    "gbcuwwv": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcuwwv/",
      "text": "As a professor, I expect students have lives outside my class.  If people log off early or on-time, it is no skin off my back.  I ALWAYs try to get done on time.  I think profs that go over in time don't respect their students and it pisses me off.  So log off if you want or need to.  If they announce things outside of your class period because they routinely go late, I would complain to the chair (not that I am a big fan of students complaining to the chairpersons as they are getting it from loads of students right now).",
      "author": "Amateur_professor",
      "created": 1604678659,
      "upvotes": 6,
      "replies": {}
    },
    "gbcul83": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcul83/",
      "text": "I haven't used zoom lately, but if it has a chat window you could just type out a quick \"sorry Dr. whatever, it's 10 and I have to run, but I'll see you next time!\"",
      "author": "vesperIV",
      "created": 1604678506,
      "upvotes": 2,
      "replies": {}
    },
    "gbcuefr": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcuefr/",
      "text": "If you have to leave, you have to leave.  If I have to leave right on time because of a scheduling issue, I tend to just post a \"TY, I have to go to a meeting/lab/whatever\" because it: A) shows I care about the class at least a little (even if I don't, it still gives the impression that I do and you never know who you're going to need a favor from down the road) and B) provides a record that I was there and that I have a valid reason to leave if the professor is one of THOSE that takes attendance at the end",
      "author": "LadyWolfshadow",
      "created": 1604678419,
      "upvotes": 2,
      "replies": {}
    },
    "gbctpnn": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbctpnn/",
      "text": "I have online classes as well right now. They run from 1-3 pm. My professor has a test every class from 1-1:30. They will then go on to lecture from 1:30 till about 4pm due to breaks and talking way over schedule. I usually just sign off at 3 or skip lecture entirely. They have continued to show no respect for our schedule and I have better things to do with my time.",
      "author": "AbruptAbsurdity",
      "created": 1604678102,
      "upvotes": 2,
      "replies": {}
    },
    "gbcsyw9": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcsyw9/",
      "text": "Who cares lol no ones paying you to be there",
      "author": "Grant_w1999",
      "created": 1604677757,
      "upvotes": 2,
      "replies": {}
    },
    "gbcsroq": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcsroq/",
      "text": "If we have to go before the lecturer is finished, we just send s message to all in the chat and excuse us, something like 'I have to go, thanks for the lecture. Have a nice day all.' and then we go. This way we can leave if we need to without being too rude",
      "author": "CombatWombat994",
      "created": 1604677664,
      "upvotes": 5,
      "replies": {}
    },
    "gbcryum": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcryum/",
      "text": "No. I'm paying to be there, it is not my problem if the professor can't time management his classes properly. My time is just as valuable. If it becomes a problem I would absolutely go over his head and if he's the department chair I would go to the next person above him. For me if a professor runs late and I have to choose between listening to him and picking up my daughter from daycare I'm absolutely going to be picking up my daughter from daycare because I cannot afford the $5+ a minute.I am a non-traditional adult student so maybe I have a different perspective on professionalism.",
      "author": "Mchaitea",
      "created": 1604677288,
      "upvotes": 2,
      "replies": {}
    },
    "gbcrah1": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcrah1/",
      "text": "Prof here. If I run over time, you have every right to log. However, if I leave 5 minutes at the end of class for wrap-up, reminders, and questions, and I'm still speaking and you choose to log, well, thats just rude AF.",
      "author": "white_wren",
      "created": 1604676970,
      "upvotes": 21,
      "replies": {}
    },
    "gbcr0q2": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcr0q2/",
      "text": "I have a professor who's constantly going 5 minutes past the end of class time when we only get 10 minutes between classes. It only really sucks if that's a Zoom class day for them and the class I have after it is in person that day.",
      "author": "depressed_jewel",
      "created": 1604676841,
      "upvotes": 2,
      "replies": {}
    },
    "gbcor06": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcor06/",
      "text": "My zoom lectures have a lot of people. And there’s a lot of connectivity issues so sometimes I or other people log off and on throughout class because our internet dropped. So I don’t think professors notice much when you leave. And all my lectures are recorded so if you’re worried about what you miss at the end maybe yours are recorded too and you can just go back and listen to those last few minutes later",
      "author": "ajbear01",
      "created": 1604675756,
      "upvotes": 3,
      "replies": {
        "gbd7onu": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd7onu/",
          "text": "Professor here.  I run a Zoom report so can see who attends and who is only there for ten minutes.  It is also fairly obvious who has connectivity issues.  The report tracks the log in and log out times and I can sort by student. \n\nAs to the OP, I think a short email to the professor letting them know that you have another commitment after the scheduled class ending time and is there a way to obtain the homework assignment by the scheduled ending time so you can ensure you are able to complete the assignment js appropriate.   I start and finish my classes on time - at times they go over of students have questions but I do acknowledge the end time of the class and tell students they are free to stay on or leave.  I remain until the last student leaves the session which is why it is obvious which students just log in and then leave to do something else.  I do not understand why students do this as they certainly are not learning anything by logging in and doing something else and I do not take attendance.  It is up to the student if they want to learn.  I care as much about the success of the student as they do.",
          "author": "SlightScholar1",
          "created": 1604684477,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gbcnqwo": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcnqwo/",
      "text": "If you don't have somewhere else to be, it's rude. \n\nIf you *really* have to leave, I'd say it's fine.",
      "author": "deamagna",
      "created": 1604675274,
      "upvotes": 7,
      "replies": {}
    },
    "gbcmqxg": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcmqxg/",
      "text": "I don’t think it is. Sometimes they go a little bit over. If you have to leave for a class you have to leave for a class. My schedule is set up to where I have 15 minutes in between classes, so if they go over I am usually willing to stick around for 10 extra minutes in case there is any valuable last minute information.",
      "author": "AUGSOME47",
      "created": 1604674781,
      "upvotes": 5,
      "replies": {}
    },
    "gbcm8qg": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcm8qg/",
      "text": "It's college man. If you gotta do something/go somewhere then just leave. I doubt they'd care that much if at all.",
      "author": "Aperax",
      "created": 1604674535,
      "upvotes": 20,
      "replies": {}
    },
    "gbclors": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbclors/",
      "text": "If you’re concerned, put a sign off in the chat. “Sorry, I have to leave, my next class is starting”",
      "author": "ChallengedPharmer",
      "created": 1604674269,
      "upvotes": 47,
      "replies": {
        "gbcpsn8": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcpsn8/",
          "text": "Yeah, a guy in one of my classes does this, I don't really see much point in it.",
          "author": "TrekkiMonstr",
          "created": 1604676257,
          "upvotes": 10,
          "replies": {
            "gbdjj20": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdjj20/",
              "text": "Let's the professor know why you have to go (and that you aren't just leaving for no reason) and why they need to stay on time",
              "author": "B_Rad15",
              "created": 1604690029,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "gbclep2": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbclep2/",
      "text": "I think it depends. Usually if I have another class right after, I’ll just say thank you and explain that I have to leave because I have another class. If I don’t and they’re just saying nothing important or relevant, I don’t see why I can’t leave since class is technically over.",
      "author": "RadiantAntelope",
      "created": 1604674133,
      "upvotes": 6,
      "replies": {}
    },
    "gbcl3ie": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcl3ie/",
      "text": "I have one professor who ALWAYS goes over time. And not by 2-3 minutes, but by 10-15 minutes, and the very end of that is when he tells us our homework. It's bullshit",
      "author": "Kaitlin33101",
      "created": 1604673980,
      "upvotes": 198,
      "replies": {
        "gbcpr1z": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcpr1z/",
          "text": "Someone should remind him that class is ending 5-10 mins before so he can wrap up.",
          "author": "LucilleTheDino",
          "created": 1604676236,
          "upvotes": 83,
          "replies": {
            "gbcpxt1": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcpxt1/",
              "text": "Oh that would not go over well. He's the head of the department and someone you don't wanna mess with. He'll hold a grudge for the rest of your college experience and call you out way more in class",
              "author": "Kaitlin33101",
              "created": 1604676326,
              "upvotes": 83,
              "replies": {
                "gbcr779": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcr779/",
                  "text": "He does need to respect y'all's time though. Regardless of his status. And as a teacher, he needs to do so to properly teach. If everyone has to leave for their next class without knowing their assignments, they're gonna fail. He can't prioritize his class over other's either. If he does, you'd need to talk to someone above him.",
                  "author": "LucilleTheDino",
                  "created": 1604676926,
                  "upvotes": 69,
                  "replies": {
                    "gbcrlaf": {
                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcrlaf/",
                      "text": "I 100% agree. Thing is, no one has another class immediately after his so he thinks it's okay. I also don't know who's higher up than him. I don't wanna go to the president of the university, but my professor is the head of my department",
                      "author": "Kaitlin33101",
                      "created": 1604677112,
                      "upvotes": 17,
                      "replies": {
                        "gbcrvlo": {
                          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcrvlo/",
                          "text": "Dean of students probably. You could ask one of your other professors though. They might know who's over the department heads and may be able to help you through the situation and how to properly escalate.",
                          "author": "LucilleTheDino",
                          "created": 1604677247,
                          "upvotes": 22,
                          "replies": {
                            "gbcs9du": {
                              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcs9du/",
                              "text": "If you can, keep records of the things he does. Note on paper when classes start and end each day. Note the comments he's made towards students and who. Note what assignments he assigns after class ends and at what time he informs you of them. Get all that as evidence incase you bring it to someone higher up. And find another student who can back you up and verify your evidence if not a few people.",
                              "author": "LucilleTheDino",
                              "created": 1604677425,
                              "upvotes": 9,
                              "replies": {}
                            },
                            "gbcs10e": {
                              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcs10e/",
                              "text": "Oh true. I just have to find a professor that isn't scared of him who would be able to help me",
                              "author": "Kaitlin33101",
                              "created": 1604677316,
                              "upvotes": 7,
                              "replies": {
                                "gbcsqmt": {
                                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcsqmt/",
                                  "text": "Or someone in another department. I'd assume all the department heads report to the same person. You don't have to tell them what it's for or you can remain vague to get the info you need from another professor if you're worried they won't help you.",
                                  "author": "LucilleTheDino",
                                  "created": 1604677650,
                                  "upvotes": 5,
                                  "replies": {
                                    "gbcswvs": {
                                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcswvs/",
                                      "text": "That's true. I just don't see a point to report right now considering next week is our last for that class. I'll advise the freshman to report in the spring",
                                      "author": "Kaitlin33101",
                                      "created": 1604677732,
                                      "upvotes": 7,
                                      "replies": {
                                        "gbctz0i": {
                                          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbctz0i/",
                                          "text": "Yup. Advise them to first tell him that class is ending 5-10 minutes before and if he retaliates against them to start the process of reporting him. Collecting evidence, finding who's above him. That whole thing. That's probably close to proper procedure for this.",
                                          "author": "LucilleTheDino",
                                          "created": 1604678222,
                                          "upvotes": 9,
                                          "replies": {
                                            "gbcu7vh": {
                                              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcu7vh/",
                                              "text": "Yeah I'll definitely be making sure they keep an eye on him. I'm also thinking about doing a few short free clinics for the freshmen over winter break to prepare them a bit because the professor sucks at explaining what he's teaching. I don't want them to fail because the professor sucks at his job",
                                              "author": "Kaitlin33101",
                                              "created": 1604678335,
                                              "upvotes": 3,
                                              "replies": {
                                                "gbcuiw0": {
                                                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcuiw0/",
                                                  "text": "That would be awesome! I was thinking about doing something like that for calc classes in the summer. I barely passed my last calc class and learned most of it after. It would've been great to have had some structured learning before going into calc.",
                                                  "author": "LucilleTheDino",
                                                  "created": 1604678476,
                                                  "upvotes": 3,
                                                  "replies": {
                                                    "gbcuyxl": {
                                                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcuyxl/",
                                                      "text": "Yeah the class I'm talking about is actually a music class, Solfege, but the professor rushes with teaching music theory which is difficult enough and he also explains it wrong. I took AP Music Theory in high school, and if I hadn't, I would've failed his class last semester",
                                                      "author": "Kaitlin33101",
                                                      "created": 1604678686,
                                                      "upvotes": 2,
                                                      "replies": {
                                                        "gbd7hle": {
                                                          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd7hle/",
                                                          "text": "That's good. So you're majoring in music? That must be hard. I sucked when I was in middle school band. But I also didn't like to practice",
                                                          "author": "LucilleTheDino",
                                                          "created": 1604684388,
                                                          "upvotes": 2,
                                                          "replies": {
                                                            "gbd8j0x": {
                                                              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd8j0x/",
                                                              "text": "Yeah and I hate practicing as well lol. My major is music industry and I plan to work in a music studio and produce music",
                                                              "author": "Kaitlin33101",
                                                              "created": 1604684866,
                                                              "upvotes": 2,
                                                              "replies": {
                                                                "gbd8sz8": {
                                                                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd8sz8/",
                                                                  "text": "Oooo! That's cool! Have you produced music before? My major is basically ship design",
                                                                  "author": "LucilleTheDino",
                                                                  "created": 1604684994,
                                                                  "upvotes": 1,
                                                                  "replies": {
                                                                    "gbd9p91": {
                                                                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd9p91/",
                                                                      "text": "I haven't, but I want to. Music is really expensive to work in, so I need to save a few hundred dollars before I can start creating music. I'm currently waiting for a friend to finish fixing my electric guitar to learn to play",
                                                                      "author": "Kaitlin33101",
                                                                      "created": 1604685404,
                                                                      "upvotes": 1,
                                                                      "replies": {
                                                                        "gbd9uu8": {
                                                                          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd9uu8/",
                                                                          "text": "Gotcha. Electric guitar? Like they use in rock bands? Or acoustic?",
                                                                          "author": "LucilleTheDino",
                                                                          "created": 1604685476,
                                                                          "upvotes": 2,
                                                                          "replies": {
                                                                            "gbda3wt": {
                                                                              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbda3wt/",
                                                                              "text": "Well I have both kinds, but I'd love to learn to play electric because I love rock. But electric isn't only in rock music, it's in many genres and a very important instrument to know",
                                                                              "author": "Kaitlin33101",
                                                                              "created": 1604685592,
                                                                              "upvotes": 1,
                                                                              "replies": {
                                                                                "gbdaavu": {
                                                                                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdaavu/",
                                                                                  "text": "True. I wish I could play even one instrument. I've forgotten notes and don't have the lung capacity for woodwinds anymore.",
                                                                                  "author": "LucilleTheDino",
                                                                                  "created": 1604685680,
                                                                                  "upvotes": 2,
                                                                                  "replies": {
                                                                                    "gbdbsaq": {
                                                                                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdbsaq/",
                                                                                      "text": "It's all about practice. Hell, voice is considered an instrument. If you get time, I'd recommend trying guitar, piano, or ukelele. It's not like you'd have to be an expert or anything, but being able to play a few simple songs reduces so much stress",
                                                                                      "author": "Kaitlin33101",
                                                                                      "created": 1604686369,
                                                                                      "upvotes": 2,
                                                                                      "replies": {
                                                                                        "gbdbx6p": {
                                                                                          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdbx6p/",
                                                                                          "text": "I think I will. Thank you!",
                                                                                          "author": "LucilleTheDino",
                                                                                          "created": 1604686433,
                                                                                          "upvotes": 2,
                                                                                          "replies": {
                                                                                            "gbdc3nb": {
                                                                                              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdc3nb/",
                                                                                              "text": "Of course! Also, Youtube is a gold mine for music lessons of all kinds",
                                                                                              "author": "Kaitlin33101",
                                                                                              "created": 1604686516,
                                                                                              "upvotes": 2,
                                                                                              "replies": {}
                                                                                            }
                                                                                          }
                                                                                        }
                                                                                      }
                                                                                    }
                                                                                  }
                                                                                }
                                                                              }
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "gbd6exn": {
                              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd6exn/",
                              "text": "Go to the Dean of Faculty or the Dean of Students (Source: worked at a college for several years)",
                              "author": "babesdoitbetter",
                              "created": 1604683897,
                              "upvotes": 4,
                              "replies": {
                                "gbd7kqa": {
                                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd7kqa/",
                                  "text": "^^ Def this. I've not been involved enough to know chain of command yet",
                                  "author": "LucilleTheDino",
                                  "created": 1604684428,
                                  "upvotes": 2,
                                  "replies": {
                                    "gbdaox1": {
                                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdaox1/",
                                      "text": "Fun fact: Colleges are incredibly political and it is (slightly) important for students to understand the political landscape of their institution if they have issues they need to navigate. For example, I worked at a small private college in which faculty held majority of the power (faculty and students had a say in the governance, and staff were not included, which is typical). So it was usually easier for students to navigate issues if they built rapport with faculty leadership, as it actually led to significant policy changes.",
                                      "author": "babesdoitbetter",
                                      "created": 1604685862,
                                      "upvotes": 2,
                                      "replies": {
                                        "gbdb489": {
                                          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdb489/",
                                          "text": "Yeah. I'm finding this to be increasingly true during my time in SGA, but I wish I had a mentor for all of this. I get tid-bits of information from people who have been around longer, but I've yet to piece even half of the bigger picture together. I'm planning on sticking around for another degree if this one goes well, so it's probably important that I figure it out.",
                                          "author": "LucilleTheDino",
                                          "created": 1604686058,
                                          "upvotes": 2,
                                          "replies": {
                                            "gcylebk": {
                                              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gcylebk/",
                                              "text": "Feel free to DM me with questions!",
                                              "author": "babesdoitbetter",
                                              "created": 1605893929,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gbevb7k": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbevb7k/",
                  "text": "I recommend a lawyer. That solved my problems.",
                  "author": "GennaroIsGod",
                  "created": 1604714754,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbcmnke": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcmnke/",
          "text": "I used to have a professor keep us an hour late!! In retrospect it was a freshman class so none of us could’ve known much better but I should’ve complained to somebody or asked for help. I would cry afterwards or during from exhaustion.",
          "author": "Dansii",
          "created": 1604674734,
          "upvotes": 39,
          "replies": {
            "gbcmshr": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcmshr/",
              "text": "Holy shit. I'm a sophomore so I know better, but at the same time, we need to know our homework",
              "author": "Kaitlin33101",
              "created": 1604674803,
              "upvotes": 19,
              "replies": {
                "gbcq96t": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcq96t/",
                  "text": "I’d report it but it’s intimidating and easier said than done. I only get a fifteen minute break between classes so I couldn’t afford that missed time and I think it’s horrible that your professor is taking time when students should be socializing, eating, relaxing to continue talking.",
                  "author": "Dansii",
                  "created": 1604676476,
                  "upvotes": 10,
                  "replies": {
                    "gbcqf7t": {
                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcqf7t/",
                      "text": "Well next week is our last of classes for that course, so it's the freshmen's problem now haha",
                      "author": "Kaitlin33101",
                      "created": 1604676556,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gbd2kh8": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd2kh8/",
          "text": "I’d try to get around that by asking him 5 minutes before class ends what the homework is.\n\nMaybe “Professor I’m sorry to interrupt but I have a question, what’s our homework?”\n\nAnd if they ask why, tell them you have work maybe? Lol\n\nAlternatively, like another user posted below, you could put it in the chat. Basically my point is if you stress that you must be somewhere else and that staying late is not an option, you’d probably be okay.",
          "author": "Actual-Gap-9800",
          "created": 1604682144,
          "upvotes": 10,
          "replies": {
            "gbd2qly": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd2qly/",
              "text": "He wouldn't listen if I said something, and he also has chat disabled",
              "author": "Kaitlin33101",
              "created": 1604682222,
              "upvotes": 3,
              "replies": {
                "gbd40rt": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd40rt/",
                  "text": "Hmmm...ya know, at that point I’d just leave and complain. I could maybe see 5 minutes every time, but 15 every time? Nah, that’s rude. Time is money in the real world. Your professor needs to get his head out of the clouds.",
                  "author": "Actual-Gap-9800",
                  "created": 1604682810,
                  "upvotes": 6,
                  "replies": {
                    "gbd8peo": {
                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd8peo/",
                      "text": "Yeah I know. We only have 2 classes left though so I'm just powering through",
                      "author": "Kaitlin33101",
                      "created": 1604684949,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gbd0i4i": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd0i4i/",
          "text": "Some professors do this to make sure people are actually attending and not just using a script/zoom background",
          "author": null,
          "created": 1604681215,
          "upvotes": -3,
          "replies": {
            "gbd1340": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd1340/",
              "text": "That's fair, but he calls on us randomly throughout class and it's obvious when you weren't paying attention. We HAVE to have our cameras on or he'll take off points. He knows we're engaged (out of fear of him) and he still holds us in class late",
              "author": "Kaitlin33101",
              "created": 1604681479,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "gbcklm3": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcklm3/",
      "text": "They need to respect your time as well. When you are in the corporate world, meetings need to stay on schedule out of respect for everyone.",
      "author": "the_battousai89",
      "created": 1604673734,
      "upvotes": 30,
      "replies": {
        "gbcl6wg": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcl6wg/",
          "text": "What magical world do you work in?",
          "author": "greydrifts",
          "created": 1604674027,
          "upvotes": 23,
          "replies": {
            "gbclbzr": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbclbzr/",
              "text": "lol I work for a very large defense company.",
              "author": "the_battousai89",
              "created": 1604674096,
              "upvotes": 5,
              "replies": {
                "gbdj79a": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdj79a/",
                  "text": "Same and our 15 minute scrums regularly go over time",
                  "author": "B_Rad15",
                  "created": 1604689873,
                  "upvotes": 5,
                  "replies": {}
                },
                "gbcqku7": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcqku7/",
                  "text": "I work in higher education and boy howdy it isn’t often that everyone attending is punctual!",
                  "author": "vicemagnet",
                  "created": 1604676631,
                  "upvotes": 8,
                  "replies": {}
                },
                "gbcmtch": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcmtch/",
                  "text": "I agree and I work in healthcare",
                  "author": "jennsamx",
                  "created": 1604674813,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gbckawv": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbckawv/",
      "text": "I do think it’s a bit rude for professors to run past their class time regularly, but if it only happens a few times, you should consider what you could be missing out on by leaving early. I totally understand if you have to run immediately after class is finished but if you have a few minutes to spare it’s probably worth sticking around.\nedit: misspelled a word",
      "author": "adabbadon",
      "created": 1604673585,
      "upvotes": 423,
      "replies": {
        "gbd3ngd": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd3ngd/",
          "text": "A professor who usually does not go over time must have important information to share if they run long.",
          "author": "Piglet03",
          "created": 1604682641,
          "upvotes": 105,
          "replies": {
            "gbd7c5z": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd7c5z/",
              "text": "Usually that is the case but then there's the professors who make it a habit of ending class later then scheduled.. Very upsetting when you have work or something right after then end up being late to that also...",
              "author": "MixonEPA",
              "created": 1604684317,
              "upvotes": 43,
              "replies": {
                "gbetixr": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbetixr/",
                  "text": "I had a professor who did this. Yeah before the lockdowns it was just a minute or two, but I had a class across campus ten minutes after, so I was basically sprinting to get there on time. \n\nWhen we switched to zoom, she wouldn’t just go over one minute, she would go on for more than ten minutes. I ended up withdrawing, best decision I ever made.",
                  "author": "CapriciousSalmon",
                  "created": 1604713723,
                  "upvotes": 3,
                  "replies": {}
                },
                "gbfrr5x": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbfrr5x/",
                  "text": "My calc professor does this, and I have a French class literally scheduled 10 minutes afterwards... It's fine now, but the first time I ended up 20 minutes late because I couldn't get the zoom link for French to work",
                  "author": "Alise_in_Wonderland",
                  "created": 1604739199,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbdbgdk": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdbgdk/",
          "text": "What about if an instructor has had to go to a hybrid model where he meets each half of the class one time a week, giving them the same info, but relying on them to watch the other online lesson video, but they don’t watch the lessons? I have frequently gone over 5 and 7 minutes this semester, but only because I’m trying to force all the content into half the time. But they also don’t have to come and entirely second day of the week (originally, they thought they’d be coming twice a week, now only once, but they still won’t watch the extra online content I’ve hand made).",
          "author": "chrisrayn",
          "created": 1604686216,
          "upvotes": 7,
          "replies": {
            "gbdch8j": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdch8j/",
              "text": "If your students have agreed to that arrangement with the understanding that you may run late sometimes, I don't think there's anything wrong with it. It's more frustrating when you have a tightly packed schedule and a professor consistently runs past their scheduled time (especially professors who frequently run over and get angry at people who try to leave when the scheduled class time is finished). I do feel like professors have a responsibility to respect their students time and many plan their lessons to have an extra bumper of time, which I deeply appreciate and respect.",
              "author": "adabbadon",
              "created": 1604686693,
              "upvotes": 1,
              "replies": {
                "gbdkm2e": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdkm2e/",
                  "text": "Yeah my issue is that I don’t get angry when they leave...I completely understand...but I have trouble shutting up when I know I have more to say. It’s not a way I usually am...this semester is just fucking bulllllshiiiiiiiiiit man. Like fucked.",
                  "author": "chrisrayn",
                  "created": 1604690554,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gbck72g": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbck72g/",
      "text": "In my experience if a professor goes over time it’s usually to give an important bit of information, so I usually stick around... unless I absolutely have somewhere to be. Also, in my experience, most professors won’t give a shit if you leave when class is supposed to be over.",
      "author": "DarudeKatstorm",
      "created": 1604673532,
      "upvotes": 235,
      "replies": {
        "gbcmq3t": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcmq3t/",
          "text": "In my experience it’s never more important than anything else. Some professors just don’t care",
          "author": "kapbear",
          "created": 1604674770,
          "upvotes": 45,
          "replies": {
            "gbcwrl4": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcwrl4/",
              "text": "And some think it’s ok to turn up twenty minutes late and add the time at the end.",
              "author": "alicecooperunicorn",
              "created": 1604679522,
              "upvotes": 20,
              "replies": {}
            }
          }
        }
      }
    },
    "gbck6jo": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbck6jo/",
      "text": "it is but it's also rude to go over. i had classes back to back soooooo keeping me from attending my scheduled class is not good",
      "author": "pseudoname123",
      "created": 1604673525,
      "upvotes": 83,
      "replies": {
        "gbcq0dx": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcq0dx/",
          "text": "The prof who teaches in the classroom before me always goes over time. I have to set up a ton of tech to teach a class where half the students are online and half and in person. It is SO RUDE and I’m over it",
          "author": "crimbuscarol",
          "created": 1604676360,
          "upvotes": 21,
          "replies": {
            "gbdgnwg": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdgnwg/",
              "text": "Yes, I once had this colleague who did this to me. Before, a hundred or so colleagues who finished on time, or if they didn't, they would be super appologetic. This one, when I asked 5 minutes before I started (so, 10 minutes over time) if she was almost done, had the AUDACITY to be angry with me for interrupting her classroom. We never became friends.",
              "author": "Marky_Marky_Mark",
              "created": 1604688681,
              "upvotes": 4,
              "replies": {}
            },
            "gbcsbbl": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcsbbl/",
              "text": "Absolutely! Even tho I was studying online, I had to set up certain environments for my computer which easily took 10 min.",
              "author": "pseudoname123",
              "created": 1604677450,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "gbcezaw": {
      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbcezaw/",
      "text": "If you HAVE to go, you HAVE to go. If you don’t, even a few minutes of fuck around time, you could receive crucial last minute information",
      "author": "Pooper69Scooper",
      "created": 1604670809,
      "upvotes": 1454,
      "replies": {
        "gbd8sxf": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbd8sxf/",
          "text": "Most last minute info is super important (test tips, announcements, and other info you don’t get to know otherwise). Totally worth to stay until the last minute unless necessary imo.",
          "author": "Na2Cr2O7",
          "created": 1604684993,
          "upvotes": 400,
          "replies": {
            "gbdb4py": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdb4py/",
              "text": "I’m a prof, and I’m definitely guilty of trying to tell my students every little intricate detail of how to do well on the assignments, while leaving out little important details that would help. But, when I see it’s time and people are starting to leave. I release those little details in a flurry. So, yeah, we don’t mean to, but sometimes that last second info is really important.",
              "author": "chrisrayn",
              "created": 1604686065,
              "upvotes": 198,
              "replies": {
                "gbdgbj1": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdgbj1/",
                  "text": "I highly respect your profession. I’ve never understood, however, why professors omit (intentionally or negligently) crucial information for succeeding on assignments. It seems to reward students that take an interest in the professor rather than the subject material. That’s not an absolute rule, but I’ve anecdotally witnessed my peers receive higher grades for seeking info outside of the classroom (e.g. going to office hours, etc.). Do you agree (at least partially)?",
                  "author": "NewtNootNewtNoot",
                  "created": 1604688519,
                  "upvotes": 58,
                  "replies": {
                    "gbe2dpy": {
                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbe2dpy/",
                      "text": "I would guess that your peers who are attending office hours and such are not, in fact, getting higher scores because they \"showed an interest\" in your professor. Instead, I think it's likely they were going to office hours because they were very invested in thoroughly understanding the subject matter and that their higher level of investment and interest in the class was likely reflected in the quality of their assignments. Just my two cents as someone who attends office hours for the classes that really interest me!",
                      "author": null,
                      "created": 1604698979,
                      "upvotes": 38,
                      "replies": {
                        "ge9eap5": {
                          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/ge9eap5/",
                          "text": "Ya wtf lol. Going to office hours isnt to hang out with your professor and ask about their weekend while they slide you pictures of the next exams answers. It's to clarify complex topics or get temporary 1 on 1 tutoring for a specific question or two.\n\n> I’ve anecdotally witnessed my peers receive higher grades for seeking info outside of the classroom (e.g. going to office hours, etc.).\n\nNo shit going to tutoring is going to raise your grade compared to just attending lectures.",
                          "author": null,
                          "created": 1606832831,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gbdl6o4": {
                      "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdl6o4/",
                      "text": "Hmm...I can’t vouch for other instructors. I teach composition, and my assignments are heavily detailed and provide more freedom over the course of the semester, but every assignment comes with the assignment sheet itself, a “cheat sheet” of common problems for each topic, and a sample essay. Basically, when I was a student as a millennial, the most frustrating thing for me was that professors had exact requirements but wrote none of them down. There was a list of hundreds of mistakes you could make in their heads, but the assignment was “write an essay about a thing” written in chalk on the board. So, my class is approached in the opposite way. There’s tons of info on each assignment so you can do as well or as poorly as you want. My students this semester have said that, on the days we have lessons, they would prefer if I prioritized assignment lectures over content lectures, so that’s what I’ve done.",
                      "author": "chrisrayn",
                      "created": 1604690827,
                      "upvotes": 17,
                      "replies": {
                        "gbeonho": {
                          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbeonho/",
                          "text": "As a student, a professor that has learned to accept constructive criticism from your students is almost always a better professor than a professor that throws the information at the students.",
                          "author": "coffeeuniverse",
                          "created": 1604710913,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gbdt0ii": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdt0ii/",
              "text": "Yep, the beginning and end of lectures have the most info.",
              "author": "aj_thenoob",
              "created": 1604694603,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "gbdsui4": {
          "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbdsui4/",
          "text": "That’s the thing that bothers me. \n\nI’m taking four classes, two of them should meet twice a week and two of them only meet once a week. Except because of remote learning now they’re all only meeting once a week. \n\nI’m expected to still grasp the information in an hour and a half instead of a total of 3 hours a week. I’m still expected to be on track following the syllabus even if were behind on schedule. \n\nOn thursday i have a 930-1015am class then another at 430pm. If my 930 is running late I’m annoyed. I don’t have anywhere to be or anything to do, but I want to work on my homework that’s always piling up. \n\nSimilarly I have 2 back to back classes on Friday, 2-315pm and 330-615pm. If my 2pm class runs past 315 I’m not really sticking around. I have 15 mins to feed myself, use the bathroom, grab extra water, briefly speak to my boyfriend, then back to class. \n\nThe ONLY GODDAMN REASON I stay after when they go over is for last minute crucial information, but it fucking sucks doing that. It’s worth staying bc it’s always a good point to leave off on, but it’s infuriating.",
          "author": "borderline_cat",
          "created": 1604694523,
          "upvotes": 8,
          "replies": {
            "gbfd6xt": {
              "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbfd6xt/",
              "text": "You’re missing the other 9-12 hours of time you’re supposed to spend studying the material each week. You’re not supposed to understand everything perfectly the first time around. If you’re having trouble with it after lecture, it’s on you to take the next steps to close that gap. This means spending time studying, virtual office hours, etc.",
              "author": "tode909",
              "created": 1604725902,
              "upvotes": 4,
              "replies": {
                "gbgh4nn": {
                  "link": "/r/college/comments/jp5ey8/is_it_rude_to_leave_a_class_if_a_professor_is/gbgh4nn/",
                  "text": "Nah I know. And I do study. It’s just some classes are harder to completely absorb on my own. Most my teachers are recording lectures and putting them online, the one class that isn’t is the class I actually need it up (child psych)",
                  "author": "borderline_cat",
                  "created": 1604761108,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634054221
}