{
  "sid": "r0dsd2",
  "link": "/r/college/comments/r0dsd2/what_has_your_experience_been_with_being_a/",
  "title:": "What has your experience been with being a college student with a learning disability (or any disability)? Do professors give you your full accommodations and work with you? Do you have any negative experiences?",
  "text": "I have had both positive and negative experiences at college. I have had some great professors who respect my accommodations and remember to give them to me every time. BUT, there have been many times where they forget and are harder to work with. \n\nI would appreciate it if you shared your experiences! Thanks!",
  "author": "RefrigeratorNo2025",
  "created": 1637675816,
  "updated": 1639847913,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlrp81z": {
      "link": "/r/college/comments/r0dsd2/what_has_your_experience_been_with_being_a/hlrp81z/",
      "text": "I have had great experiences so far with using accommodations. Sometimes they are kinda hard to honor, like extended due dates, but my professors always seem to work with me. Especially because I have a case manager that helps with talking to them and making sure that they actually follow it. Reaching out to them and sometimes reminding my profs is needed just to make sure that they remember them though.",
      "author": "Sad-Mathematician485",
      "created": 1637676806,
      "upvotes": 1,
      "replies": {}
    },
    "hlurdvi": {
      "link": "/r/college/comments/r0dsd2/what_has_your_experience_been_with_being_a/hlurdvi/",
      "text": "Have adhd and the answer is no. One actually thought I was making excuses and just needed to study more.",
      "author": "Camaroni1000",
      "created": 1637723120,
      "upvotes": 2,
      "replies": {}
    },
    "hltxo3m": {
      "link": "/r/college/comments/r0dsd2/what_has_your_experience_been_with_being_a/hltxo3m/",
      "text": "Great experiences mostly - professors are really understanding about my health and I make sure to ask ahead of time for any deadline extensions. I also make sure not to abuse it and only ask when I really need it. \n\nOne bad experience was when a professor was adamant that they wouldn't extend my deadline without penalty, even when my accomodation specifically meant that an extension would be without penalty. They said that they were granting my accommodation by allowing me to submit later with a reduced grade. The whole situation was really shitty and the professor was unfortunately unrelenting in their incorrect stance. But I worked through the pain and made sure to let them know that I did. Their response was a snarky \"you should have started earlier\", as if I can predict when my chronic illness is going to act up. \n\nOther than that, all of my other professors have been really helpful and understanding.",
      "author": "NoDryHands",
      "created": 1637709285,
      "upvotes": 1,
      "replies": {}
    }
  }
}