{
  "sid": "ri9xfl",
  "link": "/r/college/comments/ri9xfl/i_failed_my_classes_and_its_too_late_to_drop_them/",
  "title:": "I failed my classes and it's too late to drop them, I feel like everything's over",
  "text": "Right now I'm in community college. I only took two classes this semester but I ended up failing both of them. It's way too late to drop them now. I have like a 40% in both of them. Probably even lower now. I did take a college prep class, 8 week course, and got an 85%. But I don't know if that'll help. If I turn things around and start making better grades next semester will I be ok or is it over for me?",
  "author": "ClemFem",
  "created": 1639718427,
  "updated": 1639787370,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 1.0,
  "comments": {
    "hovrcho": {
      "link": "/r/college/comments/ri9xfl/i_failed_my_classes_and_its_too_late_to_drop_them/hovrcho/",
      "text": "Just failed a class for the first time and feeling extra shitty rn we’re in this together 🥲",
      "author": "typingrandom",
      "created": 1639718833,
      "upvotes": 4,
      "replies": {}
    },
    "hovs6f6": {
      "link": "/r/college/comments/ri9xfl/i_failed_my_classes_and_its_too_late_to_drop_them/hovs6f6/",
      "text": "It’s never over! If you can, it’s okay to take the classes over if need be. You are not the only person struggling this semester. I’m in there with you. What I can tell you is that now that it’s over give yourself some down time and when you are ready think about the next steps you need to take to finish your academics.",
      "author": "Mother_Possibility_5",
      "created": 1639719310,
      "upvotes": 3,
      "replies": {}
    },
    "how43oi": {
      "link": "/r/college/comments/ri9xfl/i_failed_my_classes_and_its_too_late_to_drop_them/how43oi/",
      "text": "You’re not alone, I for sure failed my chemistry class and am in really low spirits😕. Let’s try being more studious next time, we can both get through the rough patches of college and one day graduate 🙂.",
      "author": "__Y8__",
      "created": 1639726931,
      "upvotes": 3,
      "replies": {}
    },
    "hoy0y4p": {
      "link": "/r/college/comments/ri9xfl/i_failed_my_classes_and_its_too_late_to_drop_them/hoy0y4p/",
      "text": "No it is not over! Hope my award helps 💓",
      "author": "Forsaken_Touch_6621",
      "created": 1639763373,
      "upvotes": 1,
      "replies": {}
    }
  }
}