{
  "sid": "rh9lec",
  "link": "/r/college/comments/rh9lec/got_a_d_in_calculus_and_a_c_in_physics/",
  "title:": "Got a D in Calculus and a C in Physics",
  "text": "Hey guys, I feel a bit defeated. I got a D in calculus even though I got almost all A’s on the first few exams. I recently became homeless and was dealing with abuse, which really impacted me. Physics was in the same class (it was 2 classes in 1) and the teacher was incredibly unkind. No stupid questions type of person. My entire class dropped, I was one of the last 6 left. I tried so hard. People would come to me for my notes after class, I did all the homework, but these last few weeks took a toll on my last exam and my final. I feel awful. I am in community college finishing my second semester (I did spring and summer, All A’s so far) and then this happened. My other two classes this semester were A’s and I aced both finals. I am majoring in Biophysics. I feel like I’m too stupid to do this major, even though it’s all I ever wanted. (Started college late due to homelessness as well) I guess if there is anyone with some advice, please let me know. I really just struggled the last few weeks due to life hitting me like 10 trucks at once. \n\nAlso, as a child in highschool, despite taking all honors math and other courses, i finished with a 2.0. (depression from the abuse+medications for this) a university actually accepted me full ride out of hs. They were so kind. i was unable to attend due to no transportation and only being 17 (parents just laughed in my face) so i know its possible to keep going, realistically. i just had such high hopes for myself, i feel like a failure.",
  "author": "Riaxuez",
  "created": 1639603015,
  "updated": 1639787858,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hop82ni": {
      "link": "/r/college/comments/rh9lec/got_a_d_in_calculus_and_a_c_in_physics/hop82ni/",
      "text": "There are very few people I know (including myself) that could even do half of the things you’re doing with your circumstances. It’s normal to be disappointed in yourself, but also acknowledge that you’re doing your best in a very hard situation. You got this, your parents suck, and you can rub your happiness in their face when this is all over. Biophysics is hard as hell, so props to you for sticking through it. Take some time to find ways to cope with your mental health, find any method to better your living situation, take a quick breather in some way cause you need one, and attack the next semester with a good start. You’re not a faliure. You just have high expectations for yourself which is good. But don’t use those expectations as a weapon to put yourself down. You got it big dog!!",
      "author": "a__nsah",
      "created": 1639605523,
      "upvotes": 5,
      "replies": {}
    },
    "hoq54r8": {
      "link": "/r/college/comments/rh9lec/got_a_d_in_calculus_and_a_c_in_physics/hoq54r8/",
      "text": "Considering how many people dropped out of your physics class, it's not you, it's your professor. College is also about failure, it's normal, it happens to everyone. Don't feel alone.",
      "author": "rollllllllll_",
      "created": 1639619961,
      "upvotes": 2,
      "replies": {}
    }
  }
}