{
  "sid": "rd9xkk",
  "link": "/r/college/comments/rd9xkk/apparently_im_too_dumb_for_my_major_what_are_my/",
  "title:": "Apparently I'm too dumb for my major. What are my options?",
  "text": "I opted for computer science. I'm passing most of my classes except for math (algebra to be specific). I've HONESTLY TRIED just about everything under the fucking sun. Tutoring, office hours, study groups, online videos (hours worth!) and yet I still manage to pull a 62% or lower on ALL of my stupid exams. NOTHING SEEMS TO CLICK.\n\nI guess software development will remain a side hobby because my entire college experience has just proven to me that I'm not built for computer science.\n\nAnd before you math majors slide into the thread and go \"just git good!!!1! math always makes sense!!!1! you're just not studying hard enough!!1!! blah blah blah\" please... just spare me of those types of comments. If I had a dollar for each and every time someone told me these things, I'd have a million dollars and probably wouldn't be sitting here on Reddit bitching about how I can't pass a stupid math class.\n\nWhat are my options as a student with ADHD, absolutely god awful at math, and has no other interests, passions, or skills?",
  "author": "Ace-of-Spxdes",
  "created": 1639146756,
  "updated": 1639516682,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.82,
  "comments": {
    "hnzoqk0": {
      "link": "/r/college/comments/rd9xkk/apparently_im_too_dumb_for_my_major_what_are_my/hnzoqk0/",
      "text": "Are you sure you don't have dyscalculia? If you do, traditional methods of study may not help. You probably also need accomodations for test taking at your school for ADHD.\n\nIf I were in your shoes, as a fellow ADHDer and heavy interest in technology, I would look at seeing if more traditional IT work requires that level of math.",
      "author": "SouthernRhubarb",
      "created": 1639147105,
      "upvotes": 8,
      "replies": {}
    },
    "ho0l35v": {
      "link": "/r/college/comments/rd9xkk/apparently_im_too_dumb_for_my_major_what_are_my/ho0l35v/",
      "text": "You have options!\n\n1) Change to a software engineering major. At my uni, this major requires less math than the Computer Science major. It's related enough to CS that potential employers likely won't care what it's called (job listings usually say they want CS *or related* majors, of which software engineering is one)\n\n2) Get ADHD treatment. Find a doctor. Get a prescription. Get therapy.\n\n3) Get accommodations from your college's disability office. You'll need proof of your diagnosis, so get a doctor's note, a copy of your high school Individualized Education Plan or 504 plan, or a copy of your accommodations letter from a previous college.",
      "author": "Comprehensive-Ad3963",
      "created": 1639160284,
      "upvotes": 3,
      "replies": {}
    },
    "ho0d2i5": {
      "link": "/r/college/comments/rd9xkk/apparently_im_too_dumb_for_my_major_what_are_my/ho0d2i5/",
      "text": "Awful at math and has ADHD? Hm depends on how your ADHD diagnosis materializes. I have ADHD as well myself but it’s more my thoughts firing at 1,000 thoughts per second. I’m a biotechnology major but am only good with maths that have direct connections to science in some way, like correlational statistics",
      "author": "cass32109",
      "created": 1639157140,
      "upvotes": 2,
      "replies": {}
    },
    "ho0nlfz": {
      "link": "/r/college/comments/rd9xkk/apparently_im_too_dumb_for_my_major_what_are_my/ho0nlfz/",
      "text": "Get tested for dyscalculia and get academic accommodations for ADHD",
      "author": "InconsistentToaster",
      "created": 1639161274,
      "upvotes": 2,
      "replies": {}
    },
    "ho0psmr": {
      "link": "/r/college/comments/rd9xkk/apparently_im_too_dumb_for_my_major_what_are_my/ho0psmr/",
      "text": "Two-year cybersecurity, IT, or getting programming certificates.",
      "author": "zifmer",
      "created": 1639162155,
      "upvotes": 2,
      "replies": {}
    },
    "ho2wq99": {
      "link": "/r/college/comments/rd9xkk/apparently_im_too_dumb_for_my_major_what_are_my/ho2wq99/",
      "text": "I think there’s a business tech degree that’s less math. I think it requires stats 1 and 2 though.",
      "author": "BlueOcean7987",
      "created": 1639196041,
      "upvotes": 1,
      "replies": {}
    },
    "hnzwdyr": {
      "link": "/r/college/comments/rd9xkk/apparently_im_too_dumb_for_my_major_what_are_my/hnzwdyr/",
      "text": "Why did you choose Computer Science?  \n\nProbable answer:  \n\n*Because I want to get paid lots of money to solve business problems using software.*  \n\nYou can basically do the same thing, you just have to change the word \"software\" with \"technology\".  \n\n\nInformation Systems.  \n\n*Because I want to get paid lots of money to solve business problems using ~~software~~ technology.*",
      "author": "VA_Network_Nerd",
      "created": 1639150450,
      "upvotes": -2,
      "replies": {}
    }
  }
}