{
  "sid": "qb494t",
  "link": "/r/college/comments/qb494t/does_graduating_with_honors_really_benefit_you_as/",
  "title:": "Does graduating with honors really benefit you as far as job opportunities or salary?",
  "text": "I’m asking for help for my boyfriend. He’s not sure wether doing the extra work to graduate with honors is actually going to matter after he graduates. He’s getting his degree in computer science. His mom suggests he does the extra work, but he doesn’t know if her advice stems from more of a social status point of view. He had a chat with a guy that he wants to do an internship with, and the guy said that future employers look more at job experience and certifications.\n\nI think his ordeal is both wanting to please his mom, as well as worrying about how much more successful he’d be if he had the honors. Does anyone know if future employers care that much about this? Do they actually look at wether someone was an honors student? Straight out of college, do they look more at work ethic, gpa, and certifications? Would being an honors graduate be a big factor in salary or job opportunities? \n\nAny help or advice would be greatly appreciated!",
  "author": "Complex-Low-14",
  "created": 1634619093,
  "updated": 1634654386,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh769nt": {
      "link": "/r/college/comments/qb494t/does_graduating_with_honors_really_benefit_you_as/hh769nt/",
      "text": "No one at any job gives a fuck about someone graduating with honors. When you look at successful businessmen, engineers, and CEOs they don't say \"I got this job because I graduated with honors.\" \n\nGraduating with honors just gives you a fancy cord or plaque you can hang on your office wall. It's really just a reminder to yourself that you can accomplish things.\n\nEmployers are really just looking for evidence of prior experience (previous jobs and internships) and work ethic (references).",
      "author": "catsinbananahats",
      "created": 1634619591,
      "upvotes": 4,
      "replies": {
        "hh7f9qe": {
          "link": "/r/college/comments/qb494t/does_graduating_with_honors_really_benefit_you_as/hh7f9qe/",
          "text": "Omg dude I saw your username, never met a fellow cat in a hat 💕",
          "author": "catsnothats",
          "created": 1634626586,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hh76k5c": {
      "link": "/r/college/comments/qb494t/does_graduating_with_honors_really_benefit_you_as/hh76k5c/",
      "text": "It really will only potentially help for the first job after college and even at that it’s iffy.",
      "author": "IckyHasFallen",
      "created": 1634619797,
      "upvotes": 1,
      "replies": {}
    },
    "hh7f88k": {
      "link": "/r/college/comments/qb494t/does_graduating_with_honors_really_benefit_you_as/hh7f88k/",
      "text": "Computer science tutor here with a CS bachelors. Also grew up in Silicon Valley, with my dad at many of the big companies. Honors themselves don’t matter much, but a lot of the big companies *do* have a headhunting / preferred gpa threshold that often coincides with getting honors (often they look for above 3.7-3.8). This is both for internships and entry jobs as far as I’m aware. \n\nHOWEVER there are several things that make it less important. It usually stops mattering after ONE job. Good gpa (3.5ish) is still better than like a 3.0, but jobs matter wayyyyyy more. So you can start at a smaller company and then change in a year or two. ALSO having side projects that show actual interest in coding (usually  put on GitHub) can be way more important. I actually lost an interview or two for that despite honors and a 3.8 gpa. \n\nGood gpa is more of a foot in the door early on than anything.\n\nAlso, if you want to pm me or have him pm me, I’m happy to email or message with him more advice. All this accumulated knowledge is better put to use than just hanging out in my head",
      "author": "catsnothats",
      "created": 1634626548,
      "upvotes": 1,
      "replies": {}
    },
    "hh7945r": {
      "link": "/r/college/comments/qb494t/does_graduating_with_honors_really_benefit_you_as/hh7945r/",
      "text": "No, it doesn't.",
      "author": "IzzyValentiiina",
      "created": 1634621650,
      "upvotes": 0,
      "replies": {}
    }
  }
}