{
  "sid": "qc9d3z",
  "link": "/r/college/comments/qc9d3z/on_the_importance_of_an_american_degree/",
  "title:": "On the importance of an American degree",
  "text": "Hello. I am aiming to get a job in computer science in the United States, but will there be an issue if my degree is foreign? I am a resident of the states and have citizenship.\n\nThank you",
  "author": "Milkdromeda01",
  "created": 1634759564,
  "updated": 1634849276,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhg44ja": {
      "link": "/r/college/comments/qc9d3z/on_the_importance_of_an_american_degree/hhg44ja/",
      "text": "As someone who once hired people for jobs that required a college degree/higher education besides American High School Diploma/ GED, I noticed it was a smoother process if applicants who completed their education (regardless of level) in a country outside the USA submitted a physical copy of their diploma, a transcript, and any other way to document this institution and proof of attending it.",
      "author": "beepbopboopbop69",
      "created": 1634785247,
      "upvotes": 1,
      "replies": {
        "hhgam2r": {
          "link": "/r/college/comments/qc9d3z/on_the_importance_of_an_american_degree/hhgam2r/",
          "text": "But in terms of hiring preference, would you have preferred American over foreign degrees for whatever reason?",
          "author": "Milkdromeda01",
          "created": 1634788699,
          "upvotes": 1,
          "replies": {
            "hhggyfn": {
              "link": "/r/college/comments/qc9d3z/on_the_importance_of_an_american_degree/hhggyfn/",
              "text": "Honestly, it really depends on the position. For technical roles that are more based on specific work experience, non-US degrees don't impact the decision much. \n\nFor positions related more to business or more broad fields, I'd say American colleges are preferred only because they're more familiar to recruiters. \n\nReally, I'd argue job experience and ability to problem-solve are more important than where you got your degree. It just helps in some instances. \n\nJust be prepared for recruiters/companies taking longer to process your application in some instances because some background checking companies take longer on non-US education/documentation.",
              "author": "beepbopboopbop69",
              "created": 1634792659,
              "upvotes": 2,
              "replies": {
                "hhhtxmk": {
                  "link": "/r/college/comments/qc9d3z/on_the_importance_of_an_american_degree/hhhtxmk/",
                  "text": "Ah that's reassuring. Thank you!",
                  "author": "Milkdromeda01",
                  "created": 1634826872,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}