{
  "sid": "q2dfyc",
  "link": "/r/college/comments/q2dfyc/dealing_with_regret/",
  "title:": "dealing with regret",
  "text": "i deeply regret not living with friends. i had the chance to back in march, but at the time i backed out. i found an apartment so late, i thought to rush into whatever i could find. i got lucky because most of my friends live at this complex, so they're all around me. i have my own room and it's comfortable in my own space. but i really just don't have anything in common with the two others i live with. we disagree often and i wish i lived with my close friends. i don't feel at home in this space. \n\nhow do i move on? i constantly feel so sad. i always hear and see people who have best friends as roommates. they do everything together. i don't have that and it hurts - i feel like i missed out on a huge amazing experience that could've been mine. i don't think i'll get over this for as long as i live here... and i don't want to be here for a year. i regret my past so much. i partially blame the pandemic for making it hard for me to decide earlier. but i blame myself more for getting out of something that i would've loved now. i'm so unhappy i can't stand it.",
  "author": "ComfortableCollard",
  "created": 1633496147,
  "updated": 1634083746,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfkrsst": {
      "link": "/r/college/comments/q2dfyc/dealing_with_regret/hfkrsst/",
      "text": "I think you may be overthinking this with also anxiety playing a roll. Talk to a therapist. Go out and do stuff with your roommates like getting a bite to eat or playing sports or something. You at least have your friends in the complex as well, so why not visit them as much as you can. As for me all of my friends are in socal while im stuck in nor cal with a mostly online class. Finding somebody is a struggle but alteast you still got them.",
      "author": "Tricky-Leadership-38",
      "created": 1633502719,
      "upvotes": 1,
      "replies": {}
    }
  }
}