{
  "sid": "qfxjgk",
  "link": "/r/college/comments/qfxjgk/school_incident/",
  "title:": "School Incident",
  "text": "Hi! so this is my first time posting my real life problems here... right now I was caught in a cheating incident and I'm so scared of it My teacher sent our case already in the SWC and they told me to give them an explanation on why I should not get a sanction like that. I don't know how to defend myself because I know that I'm guilty of it. But in anyway, can I get some advice on how will I answer their question? 🥺",
  "author": "Spirited_Courage_21",
  "created": 1635218640,
  "updated": 1635302741,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi2ntgj": {
      "link": "/r/college/comments/qfxjgk/school_incident/hi2ntgj/",
      "text": "Admit what you did and apologize. There's not usually any defending yourself. You are infinitely more likely to get mercy if you fess up than if you lie.",
      "author": "wetbogman2",
      "created": 1635219882,
      "upvotes": 3,
      "replies": {}
    },
    "hi2qb1o": {
      "link": "/r/college/comments/qfxjgk/school_incident/hi2qb1o/",
      "text": "Just own up to what you did. They probably get so many sob stories so I doubt they'll feel pity on what made you want to plagiarize.",
      "author": "SadWater7",
      "created": 1635221351,
      "upvotes": 3,
      "replies": {}
    },
    "hi3zjx0": {
      "link": "/r/college/comments/qfxjgk/school_incident/hi3zjx0/",
      "text": "If you're guilty of it than don't defend yourself. State everything you did and don't lie. Any deviation from 'just the facts' will reflect poorly on you. Apologize, show remorse, and make it clear you want to succeed in college, but this was just a bad mistake that you will not repeat.",
      "author": "hdorsettcase",
      "created": 1635254073,
      "upvotes": 2,
      "replies": {}
    },
    "hi5egoz": {
      "link": "/r/college/comments/qfxjgk/school_incident/hi5egoz/",
      "text": "They aren't asking you to say you didn't do it.\n\nThey are asking you to give them a reason why they shouldn't give you the worst punishment",
      "author": "PersephoneIsNotHome",
      "created": 1635274837,
      "upvotes": 1,
      "replies": {}
    }
  }
}