{
  "sid": "a2jpv5",
  "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/",
  "title:": "Just a reminder. Even though you are taking your finals, don't forget to evaluate your professors as well.",
  "text": "Title says the point.\n\nSemester is ending and you're about to move on and forget your current professors.  Somebody else still needs to take the course you you just finished.  Pass on what you learned.  \n\nUse your school's feedback surveys (most schools push them or even require them). Use RateMyProfessor.  Just share your experience.  Did the professor torture you by treating their 3 credit humanities course like it was a 6 credit monster worth 30 hours per week?  Was you Bio professor awesome and deserves recognition?  \n\n\nThis matters.  When I go to register for classes, I check my professors ratings.  If there are 3 or less ratings, then it's useless to me.  I would rather take a 3.9 professor with 40 reviews than a 5.0 with 1 review.  You should all be checking these and leaving feedback afterwards. If you aren't reading any sort of reviews prior to registering, it's kinda your own fault when you are stuck with the most difficult professor on campus. \n\nThere.  Said my peace.  Do whatever you want.  We're all adults. Most of us at least.  ",
  "author": "Inactive_Account",
  "created": 1543800920,
  "over_18": false,
  "upvotes": 1130,
  "upvote_ratio": 0.96,
  "comments": {
    "eb44gw7": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb44gw7/",
      "text": "Evaluations literally mean nothing. Nobody is gonna give a fuck about what some 20 something year old salty ass student is gonna say about a prof, when they probably saying some bad shit because they failed? ",
      "author": "your_simpleton",
      "created": 1543979158,
      "upvotes": 0,
      "replies": {
        "eb461gs": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb461gs/",
          "text": "Careful with all that edge there. \n\nSome of us are capable of distinguishing the shitty reviews from pissed off teens and the useful reviews that actually give insight.\n\nYou look for trends.  20 people say the teacher relies heavily on the text book, then its probably true. 1 person says it's the hardest class ever, I'll have my doubts. ",
          "author": "Inactive_Account",
          "created": 1543980445,
          "upvotes": 1,
          "replies": {
            "eb466k2": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb466k2/",
              "text": "20 people out of what? Besides what do evaluations even do. They just go to the prof. And the prof 9/10 don’t give a damn (some do, those are the good ones). ",
              "author": "your_simpleton",
              "created": 1543980563,
              "upvotes": 0,
              "replies": {
                "eb47ph4": {
                  "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb47ph4/",
                  "text": "Well, username checks out.\n\nThey dont just go to the professor.  \n\nThey go to the department. Your course reviews help determine what is good/bad with the class.\n\nLet's say 3 teachers teacher Calc 1. They each have 100 students.  End of semester rolls around and they each have vastly different distributions of grades. That's something the department needs to address.  Student feedback helps here.  If 50 of the 100 complete feedbacks and over half of them say the same thing, then it probably isn't just some salty 20 year old.  \n\nSame goes for online reviews at ratemyprofessor. If 30 people submit reviews, and 20 of the reviews say the professor is always late, then I wouldnt be surprised if the professor is always late.\n\nIt's exactly the same as reading review when you are shopping.\n\n",
                  "author": "Inactive_Account",
                  "created": 1543981920,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "eb1eg68": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb1eg68/",
      "text": "My school actually sends us all evaluation docs for all of our instructors and hounds us until we complete them. ",
      "author": "rlev",
      "created": 1543884785,
      "upvotes": 1,
      "replies": {}
    },
    "eb16yki": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb16yki/",
      "text": "Yes, check ratemyprofessor. I did not use the site signing up for my first semester and I regret it. Now that I’ve had an opportunity to use it while registering for my second semester, I figured I would check what my first semester profs got.  And now I realize why that physics course was so damn hard. 30% would take again, 1.9 quality, and 4.3 difficulty. Now I’m praying I’ll pass the class",
      "author": "Evil_MrMuffinz",
      "created": 1543878234,
      "upvotes": 1,
      "replies": {}
    },
    "eb10wzw": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb10wzw/",
      "text": "You’re right. Thank you for this",
      "author": "Eteacles",
      "created": 1543873638,
      "upvotes": 1,
      "replies": {}
    },
    "eb0pvl5": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb0pvl5/",
      "text": "At my school, the school's feedback surveys aren't required but they affect whether or not that professor gets tenure. So I do them honestly.",
      "author": "DamascusSteel97",
      "created": 1543866028,
      "upvotes": 1,
      "replies": {}
    },
    "eb0igsn": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb0igsn/",
      "text": "My reviews are based upon the personal experiences I have had with the professor. If you have caused me a significant amount of unfair stress that was due to you as a professor and not something self-inflicted, I'm review bombing the heck out of you and going into explicit detail with the problems that I had. If you are a terrible teacher, I will say it and rate you accordingly, regardless of I got a great grade and had a cakewalk passing.",
      "author": "ThatNerdyRedneck",
      "created": 1543860911,
      "upvotes": 2,
      "replies": {}
    },
    "eb001lk": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb001lk/",
      "text": "As an entitled jerk my evaluations are strictly based on my grade. If I ace the class my evaluation will be “strongly agree” is I get a “c” my review will be harsh but detailed. ",
      "author": "Carl2011",
      "created": 1543846491,
      "upvotes": -1,
      "replies": {}
    },
    "eazyujh": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazyujh/",
      "text": "At my collage you had to give your name and student id to leave any feedback, and one teacher told us they can read the feedback and see the persons name, so nobody would say anything negative for fear of being marked harder\n\nWe also could not pick with the prof we wanted",
      "author": null,
      "created": 1543845225,
      "upvotes": 2,
      "replies": {
        "eb0dcz8": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb0dcz8/",
          "text": "This is wired.",
          "author": "Miladmd",
          "created": 1543857414,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eazya8s": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazya8s/",
      "text": "Nice try, Professor....",
      "author": "Lg71199",
      "created": 1543844605,
      "upvotes": 3,
      "replies": {}
    },
    "eazxaru": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazxaru/",
      "text": "My professor is dropping a homework and rounding all our grades up if 50% of us did our evaluations so you best believe we were on that",
      "author": "destructor_rph",
      "created": 1543843473,
      "upvotes": 5,
      "replies": {}
    },
    "eazpjhr": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazpjhr/",
      "text": "While I admit I will continue using ratemyprofessor to check for ratings before enrolling in classes, I have to admit how inaccurate many of these ratings are.\n\nI’ve had to take two different classes from very lowly rated professors before and was pleasantly surprised at how lovely these two were as educators and people in general.\n\nMy advice is: don’t be so quick to judge a professor/class based on RmP ratings and instead, at least take the first week of class to get a feel for the class syllabus and professor before committing to take or drop the class.",
      "author": "skinneykrn",
      "created": 1543830815,
      "upvotes": 6,
      "replies": {
        "eazpuyw": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazpuyw/",
          "text": "Not a bad idea if your finances are flexible. I'm a GI Bill student, so I need to be registered 30 days before the first day of the semester. Otherwise payments arent made on time. ",
          "author": "Inactive_Account",
          "created": 1543831475,
          "upvotes": 1,
          "replies": {
            "eazro1r": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazro1r/",
              "text": "Ah, you’re right! I didn’t take into account the financial part of enrolling.",
              "author": "skinneykrn",
              "created": 1543835188,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "eazg63q": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazg63q/",
      "text": "Sweet tip for using reviews to select a prof: \n\nread the reviews, don't look at the numbers, they're often meaningless/arbitrary. \n\nYou can usually \"average\" people's input to formulate a reasonable impression of a professor. And, you can decide for yourself what is and isn't important that others took issue with. \n\n\nI.e. if everyone complains a professor assigns too much reading/doesn't teach, you can assume that it's a big workload but you have a high level of control over your own grade, because they're likely lazy and give you carbon-copy exams of formulaic questions that reading will have prepared you for. \n",
      "author": "Thoughtbuffet",
      "created": 1543815578,
      "upvotes": 4,
      "replies": {}
    },
    "eazfjkh": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazfjkh/",
      "text": "Can you ask me to do this in like 3 weeks? I’m busy with finals lol",
      "author": "mackys",
      "created": 1543814825,
      "upvotes": 6,
      "replies": {
        "eazfwbs": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazfwbs/",
          "text": "Can't blame you there.  Creating/checking this post has been my own way of procrastinating studying for my final tomorrow.  ",
          "author": "Inactive_Account",
          "created": 1543815247,
          "upvotes": 6,
          "replies": {
            "eazg1m9": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazg1m9/",
              "text": "At my school, our evaluations are due before finals. I understand the reasoning but us students cannot afford to waste those 30-60 mins",
              "author": "mackys",
              "created": 1543815425,
              "upvotes": 4,
              "replies": {
                "eazgrl1": {
                  "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazgrl1/",
                  "text": "Another issue with them being due before finals is that some students fear repercussion.",
                  "author": "Inactive_Account",
                  "created": 1543816320,
                  "upvotes": 3,
                  "replies": {
                    "eazgszc": {
                      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazgszc/",
                      "text": "Our school assures us that professors cannot view the results until after final grades have been entered, finalized, and sent in, thankfully.",
                      "author": "mackys",
                      "created": 1543816368,
                      "upvotes": 6,
                      "replies": {
                        "eazgyb4": {
                          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazgyb4/",
                          "text": "And that's probably true just about everywhere, but some people just don't trust it.  Not me though, my reviews to the school and ratemyprofessor have been in for a few days now.  ",
                          "author": "Inactive_Account",
                          "created": 1543816562,
                          "upvotes": 3,
                          "replies": {
                            "eazh0zn": {
                              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazh0zn/",
                              "text": "I’m hoping to get around to it this week. One of my professors seriously deserves tenure. I need to find her higher up and request she gets a permanent job at the university.",
                              "author": "mackys",
                              "created": 1543816656,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eazfj8z": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazfj8z/",
      "text": "The main things I look for when I check RateMyProfessor is if they're passionate and show enthusiasm about the subject. Getting a teacher who is not interested in their subject is the worst.",
      "author": "NaiadoftheSea",
      "created": 1543814815,
      "upvotes": 4,
      "replies": {}
    },
    "eazb0q1": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazb0q1/",
      "text": "Totally agree, but as an aside I would encourage you to take Ratemyprofessor with a grain of salt. It may be useful in some cases, but they are now removing negative reviews. Either at the request of the bad professors or on their own. Idk. Either way, talk to upperclassmen and use other resources when you're planning your schedule. \n\nOne of the worst professors I've ever had, who previously had a score of like 1.5 and many, many negative reviews, now has a score of 5 because the only remaining review is the one positive one he received.",
      "author": "LordMudkip",
      "created": 1543810283,
      "upvotes": 15,
      "replies": {
        "eb06zs6": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb06zs6/",
          "text": "I don't know which is worse: salty students leaving bad reviews on ratemyprofs because the prof didn't hand them good grades on a silver platter, or the website admins/profs removing negative reviews to make their scores look good. \n\nThere's one PT I almost interned with, but he was a pompous, egotistical asshole that backed out of my internship at the last minute because it was \"too much paperwork\", so I decided to leave a negative review about my experience. Not even two hours later, he emailed my program's coordinator and reached out to all of my professors asking for me to receive academic punishment and bullied me to take down the review, which I did at the request of my school. \n\nI'm not the only one who had a bad experience, either, but he still manages to have 54 five-star reviews. Not a single review of his is a four, three, two, or one-star; they are all five stars, and I'm almost positive it's that way because he does the tactics that looks like now ratemyprofs is doing. ",
          "author": "lucialunacy",
          "created": 1543852533,
          "upvotes": 7,
          "replies": {}
        },
        "eazi20j": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazi20j/",
          "text": "I'm tempted to create a website for my school specifically, so no one can modify posted reviews. ",
          "author": "REVIGOR",
          "created": 1543817996,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "eazal01": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazal01/",
      "text": "On ratemyprofessor good reviews= the class is an easy a and bad reviews = the class is not an easy a. You can have someone with good reviews but the teacher could not be that good but people overlook it because the class was an easy grade.",
      "author": null,
      "created": 1543809866,
      "upvotes": 27,
      "replies": {
        "eazbfiu": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazbfiu/",
          "text": "They have 2 ratings.  One for overall and one for difficulty.   \nWhat you are saying usually only applies if the overall is high and the difficulty is low or vise versa.\n\nI only take them if the difficulty is at least a 3.0",
          "author": "Inactive_Account",
          "created": 1543810642,
          "upvotes": 13,
          "replies": {}
        },
        "eazlhlq": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazlhlq/",
          "text": "Can be true but I don't find it to be true universally, we have some hard classes at my school but the really good professors for those classes are rated well, while the not so good ones are rated poorly. ",
          "author": "ggadget6",
          "created": 1543823077,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "eazaje9": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazaje9/",
      "text": "My professor was encouraging us all to do the evals, he was saying at our university they’re important and he’s seen professors denied tenure because of it. So yeah I’m gonna do them for sure!",
      "author": "erikaa21",
      "created": 1543809824,
      "upvotes": 28,
      "replies": {}
    },
    "eazaj3y": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazaj3y/",
      "text": "Useless at my school but I’m gonna do it anyway because I see it like voting. At least your voice is out there.plus it’s a good way to vent about what you would never say to your professors face (within reason of course). My professors go at 200 mph which makes it hard for me as a student to absorb all the learning so I’m definitely going to account for it in my survey",
      "author": "haichewjichoo",
      "created": 1543809817,
      "upvotes": 30,
      "replies": {
        "eazba6j": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazba6j/",
          "text": "If the 200 mph problem is common for you, consider online courses.  Recorded lectures that you can pause were a lifesaver for me, especially in math courses.",
          "author": "Inactive_Account",
          "created": 1543810506,
          "upvotes": 8,
          "replies": {
            "eazbe6f": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazbe6f/",
              "text": "Honestly recorded lectures make to worse for me. The teachers in my major even advise us to stay away from the recorded lectures unles we really need it because it takes up study time. If my courses were all online I would most likely fail like most people. When people don’t come to class they do significantly worse. ",
              "author": "haichewjichoo",
              "created": 1543810609,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "eaz8ucc": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz8ucc/",
      "text": "Ratemyprofessor is so sucky in so many strange ways. Unless the comments go into a lot of details, they seem to be worthless. \"I don't understand their accent!!!\" with a horrible rating for so many professors who I thought didn't even have an accent at all. And then there's the \"she's disorganized\" comments that seem to be on every female teacher I get. The worst one I saw was a paragraph of \"I was *enamored* with ____ I looked forward to her class and was early every day,\" and \"She's *charming, smart, beautiful* and the class made my heart race, etc \" like yikes, teacher, do the police know about this kid?\n\nMy mom teaches at my uni and for a while she was my ride so I had to sit in her class a lot. She was the only prof I've seen that was always early. Sure enough, two ratemyprofessor comments had something like \"SHE'S ALWAYS LATE!!!\" I have no idea what would make a student so mad think that lying is better than even being honest about what they thought was a problem\n\nThen there's evaluations. I always feel one way or the other of two extremities: either it doesn't mean shit or it will potentially ruin someone's career. Look, I did my fair share of joking around. On an old professor's eval I left a numbered list of suggestions to make the class completely focused on volcanoes as a joke(and yes, it was obviously a joke). Then I met my bf, who's with a phd and now is at that horrible period afterwards where no one's hiring you. I didn't know before I met him that for a lot of places evaluations aren't an optional way to show off. Even if I really dislike a teacher, I will now never use an eval to potentially harm their career. The fact that a person's career could be hurt because of input from someone no one but the teacher knows, all without the teacher's ability to provide their own argument, is bullshit. It's a failure of academia and another reason why it's just becoming a large joke.\n\nSo, teachers, either sell out or get out.",
      "author": "Komodo_Madre",
      "created": 1543808283,
      "upvotes": 19,
      "replies": {
        "eazc69i": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazc69i/",
          "text": "Ratemyprofs actually already delete TONS of reviews all day every day. I’ve actually had totally thoughtful, legitimate ones disappear for no reason (even ones that were 100% positive), which is especially confusing considering there are tons of low effort ones like you mentioned that stay up. \n\nI use to totally think out a quality, thoughtful review for every teacher and graduate assistant I had but will probably stop this term since there seems to be no method to the madness on that place.",
          "author": "weepypolecat",
          "created": 1543811352,
          "upvotes": 18,
          "replies": {
            "eazcx7q": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazcx7q/",
              "text": "lol I had no idea they did that! I know they try to make sure that the commenters actually took the class, but I didn't know they were deleting comments now.\n\nEven from the beginning it was a platform ready for problems. I'm so glad I didn't see people rating how hot my own mother is on there when thst used to be an option! \n\nI think it's totally legitimate for a student today to go to university solely because their job in the future depends on it and not just to learn and join academia necessarily. So if some students believe that giving all a's is more important than being challenged then ratemyprofessor is great—and that's not wrong in a society where degrees are pretty much mandatory for doing anything. But it sucks because that philosophy can't really coexist with one that desires academic integrity in itself. I've had teachers give two evals: one for the department and one just for them(both anonymous). I think that's probably a way to go, despite the fact that it's basically an admission of how useless everyone thinks evals are.\n\nTl;dr ratemyprofessor is fine given what uni is now but it's not reasonable to try and make such a platform meaningful",
              "author": "Komodo_Madre",
              "created": 1543812014,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "eaz9wny": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz9wny/",
          "text": "[deleted]",
          "author": null,
          "created": 1543809258,
          "upvotes": 6,
          "replies": {
            "eazbexa": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazbexa/",
              "text": "True, but I think that the amount of nerves it gives teachers and the whole idea of it to be pretty stupid. It's basically a testimony to the university system's new status as a job farm where giving students less obstacles for their future is more important than education itself.",
              "author": "Komodo_Madre",
              "created": 1543810628,
              "upvotes": 4,
              "replies": {
                "eb1fur9": {
                  "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb1fur9/",
                  "text": "Dude if the prof taught well, students would rate them high. It’s as simple as that. I don’t know why you’re trying to defend profs who don’t explain things simply, don’t have clear grading standards, don’t show students the application of the subject etc. Theres not a single reason why someone would get a bad rating if they were helpful. So cry a river with all that “oh evals hurt careers.” Guess what, grades can hurt careers and if the prof doesn’t give a crap about how students are doing , then they should face consequences too.",
                  "author": "lilsmoothie23",
                  "created": 1543886030,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "eaz6rtj": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz6rtj/",
      "text": "But if they have really good reviews at least you know the lazy people are passing",
      "author": "Oof101Oof",
      "created": 1543806400,
      "upvotes": 76,
      "replies": {
        "eazb24j": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazb24j/",
          "text": "That's why I'm glad they have two ratings.  Overall and difficulty.  If they are high overall, but low difficulty, then it's so easy that the lazy folks can pass.\n\nIf they are both high, then it's a challenge but worthwhile.\n\nIf rating is low and difficulty is high, then I tend to avoid it.  Could be a bad teaching method.  Could be a lack of charisma.  Could be a teacher that changes grading criteria mid semester.\n\nJust gotta try to understand the trends.",
          "author": "Inactive_Account",
          "created": 1543810316,
          "upvotes": 47,
          "replies": {}
        },
        "eb00rd0": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb00rd0/",
          "text": "In many schools you have access to the average grades in previous semesters for every class and instructor. You could increase your chances of passing the course by choosing the instructor with the higher average grades.",
          "author": "Miladmd",
          "created": 1543847188,
          "upvotes": 3,
          "replies": {
            "eb1jy0z": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb1jy0z/",
              "text": "lol what schools are these? ",
              "author": "ISpeakWhaleDoYou",
              "created": 1543889493,
              "upvotes": 3,
              "replies": {
                "eb1kw91": {
                  "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb1kw91/",
                  "text": "Many schools report grade distributions every semester. Contact office of the registrar at your school. This is for Texas A&M:\n\nhttp://web-as.tamu.edu/gradereport/",
                  "author": "Miladmd",
                  "created": 1543890299,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "eb0syen": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb0syen/",
          "text": "I’ve given a 5 star rating for a professor where I got a C in the class. It was a fascinating, well taught class but I should have put in more effort. I’ve also given a 1 star rating for a class I got an A in because the teacher was shit and the class was a joke. They do matter, even if it is on ratemyprofessors or the school’s evaluation form. ",
          "author": "787seattle",
          "created": 1543868175,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eaz54hv": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz54hv/",
      "text": "I do my schools feedback survey. Usually they're biased but if they have enough complaints on the same teacher Dean's and other people will evaluate their classes more or even sit in to see how they teach. ",
      "author": "thinkB4WeSpeak",
      "created": 1543804994,
      "upvotes": 46,
      "replies": {
        "eazarpn": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazarpn/",
          "text": "Thanks for sharing that.  So many folks think that schools would fire professors after a single bad review.\n\nThey don't seem to understand that schools compile the evidence and review trends before they take any action.  And any action taken would follow some form of progressive discipline, not immediate termination.",
          "author": "Inactive_Account",
          "created": 1543810046,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "eaz2q13": {
      "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz2q13/",
      "text": "There's a lot of research showing that these evaluations are completely useless and are not good predictors of how much students learn in class. Hate to say that  but students are exteremely biassed when evaluating their professors.",
      "author": "Miladmd",
      "created": 1543802953,
      "upvotes": 365,
      "replies": {
        "eaz3ti3": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz3ti3/",
          "text": "[deleted]",
          "author": null,
          "created": 1543803892,
          "upvotes": 126,
          "replies": {
            "eazegzq": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazegzq/",
              "text": "And there's nothing quite like the feedback that all contradicts itself!\n\nOne review says you need to do more examples, and another review in the same class says you need to do fewer. One person thinks you talk too fast, another person thinks you talk too slow. \n\nGood luck learning anything of value from *that*. \n\nI can only work with feedback that is constructive and actionable. There's absolutely no point saying the class is too hard or too easy because I don't know what that means. We need to know precisely what you want improved, and precisely how you want us to do that. And even then, if the class is split 50/50 on the issue then we can't change anything. \n\nIt's easy to believe that your personal opinion of the class is shared by everyone else, but that's rarely the case. In most cases, your classmates believe the exact opposite about the class. \n\nEdit: also, the best professor I ever had in undergrad had one of the lowest ratings on RMP (I think it was 1) and some horrible comments. Yet he has a lot of good awards for teaching, has an office that's decorated with letters from grateful students, is fondly remembered by a lot of people, and was just a plain good professor. But his class was notoriously difficult, and a lot of people would fail because they underestimated how much work they had to do. So the review absolutely did not line up with reality in that class, but happy students don't really leave comments. ",
              "author": "NoxiousQuadrumvirate",
              "created": 1543813608,
              "upvotes": 21,
              "replies": {}
            },
            "eb0r70s": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb0r70s/",
              "text": "Sorry I feel I’m entitled to having my professor have a good grasp of the English language when I paid $2000 to take his class.",
              "author": "metaltrite",
              "created": 1543866944,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "eazb141": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazb141/",
          "text": "That is true but only on occasion. What would we do without other students evaluating professors? We’d have to guess. \n\nBesides, you can generally tell by the way that a person leaves their review whether they took the class serious or not.\n\nReviews such as “Terrible teacher don’t take” are usually disregarded by me, that’s why it IS valuable to have as MANY reviews as possible, so you even have the opportunity to filter them out",
          "author": "_Iroha",
          "created": 1543810293,
          "upvotes": 21,
          "replies": {}
        },
        "eazaivu": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazaivu/",
          "text": "That's true for any form of rating or review.  Many people only leave reviews after a bad experience and then they exaggerate.  \n\nI'm guilty of that myself. I buy tons of stuff on Amazon, but only leave reviews when something is terrible quality.",
          "author": "Inactive_Account",
          "created": 1543809810,
          "upvotes": 47,
          "replies": {
            "eazcah0": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazcah0/",
              "text": "And research shows a bias against women and PoC in evals. I know I've seen a lot of evaluations that target physical appearance in women, for example. ",
              "author": null,
              "created": 1543811459,
              "upvotes": 11,
              "replies": {
                "eazzr5u": {
                  "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazzr5u/",
                  "text": "True. Have a female friend who teaches classes with dominantly female students. Someone wrote in their review \" She is too short\".",
                  "author": "Miladmd",
                  "created": 1543846184,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "eaz9bow": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eaz9bow/",
          "text": "I agree with you, but it matters to me whether or not those reviews are consistent. I have taken a class with a professor with mixed reviews (mostly negative) and had an absolutely great time and an A in the class. However, if the reviews are across the board positive or negative, there's probably a good reason for that. ",
          "author": "AssTasticBooty",
          "created": 1543808724,
          "upvotes": 22,
          "replies": {}
        },
        "eb00718": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb00718/",
          "text": "Most evaluations are completely worthless and have to be considered based on the actual quality of the criticism being levied. Most people are terrible at reviewing things. \n\nPart of the problem is that pathetic character limit on ratemyprofessor, and the multiple choice nature of the actual evaluations at schools. Sure, I'm not going to spend a lot of time reviewing professors who give me an A and don't do dumb shit. But writing evaluations for the outliers, good and bad, takes time. I'm a shittalking computer science major with A.D.D, I express my opinions in either 20 words or 2,000 with no in between. ",
          "author": null,
          "created": 1543846646,
          "upvotes": 7,
          "replies": {}
        },
        "eazwylh": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazwylh/",
          "text": "Best predictor of the evaluation score is what the student expects to get for their grade.",
          "author": "bl1y",
          "created": 1543843071,
          "upvotes": 5,
          "replies": {}
        },
        "eazhg4a": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazhg4a/",
          "text": "Learning? Sure, I can see that. I’ve normally used everything to determine how much I’m going to want to shoot myself in the foot during the semester. ",
          "author": "Rockerblocker",
          "created": 1543817198,
          "upvotes": 3,
          "replies": {
            "eazxh9j": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazxh9j/",
              "text": "The assumption is that learning is the ultimate goal of attending college. Even if you don't care about learning and just want to get your degree with a high GPA and with minimal effort, evals are still misleading.\n\nI know some profs who cannot care less about their students yet have very good evals. Most of them cheat for getting those good reviews.",
              "author": "Miladmd",
              "created": 1543843683,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "eb0ndl5": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb0ndl5/",
          "text": "A standard professor just wrote a blog about how for minorities and women are scored lower compared to others.",
          "author": "bytematic",
          "created": 1543864302,
          "upvotes": 3,
          "replies": {}
        },
        "eazzj0m": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazzj0m/",
          "text": "The reviews help me get a sense of what type of work is involved though. I ignore the opinions expressed, but pay attention to if it’s heavy writing, weekly assignments, more exam driven, etc. If theres a bunch of people complaining about weekly reflection papers, I’m more interested in the class because I like those. If people complain about big exams being important, it worries me more. ",
          "author": "NotDido",
          "created": 1543845950,
          "upvotes": 6,
          "replies": {}
        },
        "eazcb1q": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazcb1q/",
          "text": "One of my professors this semester jokingly said he’d offer us candy the day of our evaluations since it’s been statistically proven that doing so increases evaluation ratings significantly. You really can’t trust any student evaluations much",
          "author": "dhesswfb26",
          "created": 1543811474,
          "upvotes": 4,
          "replies": {}
        },
        "eazxgql": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eazxgql/",
          "text": "Source?",
          "author": "Laurasaur28",
          "created": 1543843666,
          "upvotes": 3,
          "replies": {
            "eb08m08": {
              "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb08m08/",
              "text": "Not sure if these are the exact studies OP is referring to, but here are a few studies related to the topic:\n\n* [Bias Against Female Instructors](https://www.insidehighered.com/news/2016/01/11/new-analysis-offers-more-evidence-against-student-evaluations-teaching)\n\n* [Meta-analysis of faculty's teaching effectiveness: Student evaluation of teaching ratings and student learning are not related](https://www.sciencedirect.com/science/article/pii/S0191491X16300323)\n\n* [Student evaluations of teaching (mostly) do not measure teaching effectiveness](https://www.scienceopen.com/document?vid=818d8ec0-5908-47d8-86b4-5dc38f04b23e)",
              "author": null,
              "created": 1543853793,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "eb23isk": {
          "link": "/r/college/comments/a2jpv5/just_a_reminder_even_though_you_are_taking_your/eb23isk/",
          "text": "Yes but a lot of feedback is helpful “this teacher has a thick accent” stuff like that",
          "author": "ALostPaperBag",
          "created": 1543912083,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050392
}