{
  "sid": "rekesx",
  "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/",
  "title:": "To Double Major or to not Double Major",
  "text": "Hey guys! I am currently in community College and I plan on transferring in fall of 2022. I really don't know what I want to do but I know I have two majors in mind; art and history. But I honestly have no idea which to choose, so I was considering double majoring once I get into uni. My reasoning for that is so I can get a taste of both majors to see what is best suited, as I am equally passionate for both. I love the history majors schools have to offer as well their programs, classes, and study abroad options (very important to me). Whereas with art is much harder to find research about programs that aren't from dedicated art schools. The big plus about going into art is that I might be able to get connections and land a job I want. I was also considering getting my bachelors in art and then if I don't like it get my masters in history alongside and perhaps a PhD. I still can do both on the side. I can always work on my own art while in history, and still immerse myself in research while in art. Any thoughts would be appreciated!",
  "author": "Lunaeriii",
  "created": 1639296519,
  "updated": 1639516567,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho85ihb": {
      "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/ho85ihb/",
      "text": "Have you looked into interdisciplinary studies?",
      "author": "bermuda__",
      "created": 1639297873,
      "upvotes": 2,
      "replies": {
        "ho9jx88": {
          "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/ho9jx88/",
          "text": "Whenever I look at that major option, I am always confused on what it entails. Can you give me some more info? Does it have something to do with teaching? Because that's something I am not to sure if I want to do yet... (but honestly talking about something I'm passionate about for 1 1/2+ hours does sound fun).",
          "author": "Lunaeriii",
          "created": 1639327886,
          "upvotes": 1,
          "replies": {
            "hoan0cp": {
              "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/hoan0cp/",
              "text": "Its a combination of two related majors. Like English and history.",
              "author": "bermuda__",
              "created": 1639343204,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho8rjca": {
      "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/ho8rjca/",
      "text": "Have you considered art history? It usually requires some studio art courses as well as all that history you love. There aren't a lot of careers, but like any liberal arts major, you learn transferrable skills. Take a minor in business to give yourself even more options.",
      "author": "jatineze",
      "created": 1639315299,
      "upvotes": 1,
      "replies": {
        "ho9jjmz": {
          "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/ho9jjmz/",
          "text": "Nah, I am in a art history class and I'm not enjoying it all. If art history classes require you to describe artworks for long essays then I'm out. I'm not very good at it nor do I enjoy the process. I prefer to keep them separate. I do like to learn about the history of art but rather in my own time.",
          "author": "Lunaeriii",
          "created": 1639327734,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ho9i2l2": {
      "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/ho9i2l2/",
      "text": "Well you’re at a community college. Why don’t you take some art and history classes now to experiment ?",
      "author": "Immediate-Duck3929",
      "created": 1639327134,
      "upvotes": 1,
      "replies": {
        "ho9j0to": {
          "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/ho9j0to/",
          "text": "I already did, and I do not like it. I would like to keep them separate. I prefer to learn about art history on my own time. I am currently finishing up art history atm and I am not a fan. Describing art works for long papers, is not my Forte. In class I was more interested in the history aspect rather than the art aspect. So I know that is something I am not interested it at all.",
          "author": "Lunaeriii",
          "created": 1639327521,
          "upvotes": 1,
          "replies": {
            "hoa43jn": {
              "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/hoa43jn/",
              "text": "I’m not saying art history. I’m saying have you taken some art classes (such as intro to art) and history classes (such as history of the U.S)",
              "author": "Immediate-Duck3929",
              "created": 1639335752,
              "upvotes": 1,
              "replies": {
                "hoa4w7z": {
                  "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/hoa4w7z/",
                  "text": "Ah I am sorry, I have misunderstood. Yes and I am taking a history class in spring semester. I have already taking drawing one and deisgn one, which I loved. However, I found myself having no time or drive to finish works on time for design one. I literally did my final the night before it was due (and worked on during class time). It might have something to do with my course load (4 classes) and my mental mindset. I'm trying again next semester and taking a digital illustration course.",
                  "author": "Lunaeriii",
                  "created": 1639336045,
                  "upvotes": 1,
                  "replies": {
                    "hoa5718": {
                      "link": "/r/college/comments/rekesx/to_double_major_or_to_not_double_major/hoa5718/",
                      "text": "4 courses is a normal course load. Definitiely expeirment with that history class next semester and make a decision after that class",
                      "author": "Immediate-Duck3929",
                      "created": 1639336156,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}