{
  "sid": "qzeawi",
  "link": "/r/college/comments/qzeawi/i_think_im_realizing_i_hate_my_major/",
  "title:": "I think I'm realizing I hate my major",
  "text": "I am a first year neuroscience major, and I can't tell if I hate it or not, I guess. I LOVE the brain, but I am drowning in my science classes. I got a 26/100 on my CHM exam because it's literally just not clicking, and I have to take all the way up to OChem. I am pre-med, (loosely) but I don't understand how I'm supposed to make it all the way up to med school if I can't even understand resonance structures. I've tried tutoring, hours of studying, but it's just not clicking for me. I don't understand what we do in lab, and I go over what we do in lecture each day and it literally just isn't clicking for me. \n\nI just don't know what I want to do, and I didn't in High School either. I want to somehow do social work, political science, environmental science, neuroscience and anthropology at once.  I feel like it's just going to get worse.",
  "author": "1fuzzybird",
  "created": 1637559933,
  "updated": 1639848511,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.82,
  "comments": {
    "hlm4x1g": {
      "link": "/r/college/comments/qzeawi/i_think_im_realizing_i_hate_my_major/hlm4x1g/",
      "text": "work past it or quit, there's are your only two options.",
      "author": "wobbletelescope",
      "created": 1637566206,
      "upvotes": 13,
      "replies": {
        "hlmxmi3": {
          "link": "/r/college/comments/qzeawi/i_think_im_realizing_i_hate_my_major/hlmxmi3/",
          "text": "I like you. \n\nYou're 100% correct. \n\nOP, if you're doing all the studying and tutoring, why are the exams still so difficult? Is it the way the professor sets up exams?\n\nI've found that certain professors want certain things. For example, I went from 70% grades on physics lab reports to 100% constantly because I tailored by reports to what the professor wants to see. \n\nHe wasn't concerned with anything other than knowing that you understood the material. I was worried about being too wordy and format getting out of hand. \n\nOnce I got a shitty grade, I sent a few emails to the professor and figured out that he wants the questions he asks on the lab manual to be explicitly answered and the rest should just give him the idea that you understand the course material. \n\nAll professors are different and all of them are searching for some sort of indicator that their teaching works. For large sets of multiple choice questions (non-math), I'm a huge fan of flash cards. It's the most efficient way to cram information into your head for recall type exams. \n\nI had a similar experience adjusting my studying habits for a Materials and Manufacturing class. First exam went relatively poorly, so I changed how I studied. I went from using her skeleton notes to ignoring them altogether in order to spend class time making flash cards. The second exam went so much better. I was the first one finished and scored 15% above the class average. \n\nYour professors are clients and they get what they want. Try and read what they are after. Try and figure out how they are writing the exam questions. The more you can see where they are coming from, the better you can adjust accordingly to deliver what they want.",
          "author": "Awkward_Mail_2786",
          "created": 1637588302,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hlpqin6": {
      "link": "/r/college/comments/qzeawi/i_think_im_realizing_i_hate_my_major/hlpqin6/",
      "text": "It’s going probably going to get worse. Before completely changing your major, try taking courses that might interest you.",
      "author": "DramaQueen100",
      "created": 1637631515,
      "upvotes": 3,
      "replies": {}
    },
    "hlm8c8j": {
      "link": "/r/college/comments/qzeawi/i_think_im_realizing_i_hate_my_major/hlm8c8j/",
      "text": "I am a chem major and I do struggle with ochem too. The resonance structures are definitely hard... I mean all topics in ochem are hard. The one thing I do is really just research and research more about the topic by watching videos, revisiting video lectures (since we're still in online class) and patience. It is definitely hard but in the end, all your hardwork will be worth it. It's such a good feeling. Remember that no major is easy, we really need to struggle.",
      "author": "Fast_Investigator437",
      "created": 1637568927,
      "upvotes": 2,
      "replies": {
        "hlmh5k3": {
          "link": "/r/college/comments/qzeawi/i_think_im_realizing_i_hate_my_major/hlmh5k3/",
          "text": "good luck in pchem",
          "author": "FangZ-",
          "created": 1637576693,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlsjel7": {
      "link": "/r/college/comments/qzeawi/i_think_im_realizing_i_hate_my_major/hlsjel7/",
      "text": "No matter what major you choose, the hard work will always be the same in the sense that you may not enjoy it because that’s what it is, extremely hard work. Schoolwork is also different than the career you choose so keep that in mind. If the career is truly what you want, you have to push through the difficult parts.",
      "author": "Bi_Maintanence",
      "created": 1637689273,
      "upvotes": 1,
      "replies": {}
    }
  }
}