{
  "sid": "r1ttve",
  "link": "/r/college/comments/r1ttve/how_do_people_decide_what_the_fuck_their_doing_i/",
  "title:": "how do people decide what the fuck their doing, I took a gap Semester / year and i still can’t figure it out",
  "text": "I went from : Horrendous student (9th), okay student (10th), to pretty okay (11th and in Apsuh and Ap Lang), to in 12 grade basically losing my fucking mind working 25-32 hours per week + all online classes + Grappling with the fact i’m trans. It wasn’t fun. The only reason why I graduated is because my Apush, Ap Lit, and my new Ap Stats teacher all got together to vouch for me, so the school asked the state if i could graduate anyway and they said yes. \n\nSo i took a gap semester (At this point it’s probably a Gap Year) because i needed to mentally recover from everything that happened. Now idk what I should be doing because I don’t think I’m stupid, i just don’t know if im intelligent at all for college. I don’t even know what I want to do, because i love fucking everything. It sucks please shoot me",
  "author": "I_Just_Killed_A_Man",
  "created": 1637836704,
  "updated": 1638206964,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.85,
  "comments": {
    "hm1camf": {
      "link": "/r/college/comments/r1ttve/how_do_people_decide_what_the_fuck_their_doing_i/hm1camf/",
      "text": "What do you do on your free time or wish you had more time to do. Also no disrespect on anyone but there are majors in college that have a great payout that pretty much any average person could succeed in. Even then you never know your full potential until you try. I quite fairly think I am a total idiot , but I love engineering and so far with hard work I have been getting through it. College is not for everyone either, have you had your first job yet? Ideally you would have done some exploration as a kid but its never too late to start.",
      "author": "1DankoMemo",
      "created": 1637850521,
      "upvotes": 3,
      "replies": {}
    },
    "hm1ga2z": {
      "link": "/r/college/comments/r1ttve/how_do_people_decide_what_the_fuck_their_doing_i/hm1ga2z/",
      "text": "**Long text incoming**\n\nI can feel you. I'm about to graduate collegue and realized there are two types of people: those who know they don't know what the hell they are supposed to do, and those who are yet to realize it. The first type of people eventually learn how to live with that fact and, knowing things can change, try to do what makes them happy. Back in my second semester I told myself \"God save me from working in a Bank\" and here I am about to happily start internship in a big Bank. You will probably make mistakes, which is totally fine and is supposed to happen, you have never lived through this life so how are you supposed to know what to do? Sometimes it is at the end of things that we realize what is it that we learned. Maybe we said no for the first time, maybe we felt something new for the first time. How we interpret, learn and give meaning to all this experiences is what shapes us as people and makes us build character to know what we want. \n\nMental health is underrated these days and giving yourself time to heal and find your self is extremely brave and you should be proud of it, you are placing yourself in the center of your life despiste everything that is going in. Unfortunately, I can't talk much on this because I don't know you but more important its YOUR life. So be sure to heal, prioritize the events you are going through and get to know yourself on your own way. You are breaking schemes, status quo and perceptions, so even though it is rough, just know you'll be a better and very admired person. Discover what you like, what you don't like, what makes you happy, what motivates you, etc. People like me tend to rush life because everyone is doing it (or they seem to) and at some point end lost without any purpose to continue what we are doing and basically regret all that lost time just because we were not living our lives. This first step should help you give the next step towards collegue or whatever is it that you want to do next. You are your best ally in the random paths of life so be sure its you who is walking them, no one can take away the pleassure of making yourself happy with your own decisions.\n\nIf there is something I would have wanted to hear before going to collegue is that no one is too dumb for collegue, glad to hear you are not stupid, so go and try challenging yourself in it to find out how intelligent can you make yourself in it. It somehow is fun and opens many doors for you. \n\nEveryone is always learning, be it for their professional life or personal life, so be patiente and keep rolling the dice, you will eventually hit jackpot. Life is too big to and random to worry about, so work hard on yourself and enjoy and learn at every point of it. It ain't easy but totally worth it.\n\nHope you find sometjing useful in all this text. Cheers and best of success to you!",
      "author": "Marihuazzz",
      "created": 1637852482,
      "upvotes": 2,
      "replies": {}
    },
    "hm1k59j": {
      "link": "/r/college/comments/r1ttve/how_do_people_decide_what_the_fuck_their_doing_i/hm1k59j/",
      "text": "Loving everything is a great strength. So many people spend years switching majors because they can't find something they love. So if I was you, I'd go the engineering/computer science for because it is reliable, stable, and will pay well. And when you have disposable income, you can try all these other hobbies and passions. I literally choose my major because I thought I wanted to be an engineer, and chemistry was my favorite class high school, so chemical engineer I became.",
      "author": "Thelton26",
      "created": 1637854306,
      "upvotes": 2,
      "replies": {}
    }
  }
}