{
  "sid": "qhh2ny",
  "link": "/r/college/comments/qhh2ny/would_it_be_alright_to_take_a_gap_year_in_this/",
  "title:": "Would it be alright to take a gap year in this current time?",
  "text": "Heyo, sorry if this question has been asked multiple times on here! But for context, I'm a high school junior and I will be graduating in 2022. Recently, I had a sit-down talk with my auntie about college. She is a nurse who is around 50 years old and just paid off her student loan debt which is a great achievement. However, she has said how taking a gap year isn't a good thing and that she doesn't understand why a lot of people are doing it right now. I didn't necessarily agree or disagree with her stance on those two things, but it did leave me feeling conflicted about what I have to do after I graduate high school. I'm considering taking a gap year so I can take up a full time job to save up money while also figuring out what I want to do in college, all with no rush. But I don't want to let some of my family members down with that choice and have them think I will just want to work my whole life. At the same time, I'm unsure if the choice I am considering making will be viable, specifically for me, especially during this pandemic. I would love to hear anyone's thoughts or experiences on taking a gap year!",
  "author": "shhejd",
  "created": 1635404023,
  "updated": 1635457019,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hicwvq7": {
      "link": "/r/college/comments/qhh2ny/would_it_be_alright_to_take_a_gap_year_in_this/hicwvq7/",
      "text": "The problem with a gap year is that you ideally want to accomplish something with that year rather than sitting on the couch playing X-box.\n\nHowever, taking a gap year is a whole lot better than showing up to a college you shouldn't be going to in the first place because your head isn't in the right place to succeed.\n\nIn terms of getting a job, you might stop to consider what job you'll be getting. About the only worthwhile jobs that hire inexperienced 18-year-olds are either hard, physical jobs or jobs at Daddy's firm. The money you're going to be making from most jobs you could get isn't going to make a dent in tuition costs.\n\nNor are the jobs going to help you figure things out. About all you'll learn spending a year working at McDonald's is that you don't want to work at McDonald's for the rest of your life.\n\nWhat you might consider doing is joining the military. They'll take anyone who is physically fit, many of the rates/MOS have useful civilian applications (IT, yes; infantry, not so much), it'll pay for college and you'll have lifelong benefits as a result.",
      "author": "ViskerRatio",
      "created": 1635410531,
      "upvotes": 2,
      "replies": {}
    }
  }
}