{
  "sid": "r0bj3a",
  "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/",
  "title:": "How are you guys able to afford college?",
  "text": "Hey there, I’m not exactly from America but I live here now with my partner in Oregon.\nWe both make minimum wage and realistically cannot pay for college let alone, have him not work and go to school while we struggle to pay rent.\nWe both don’t really have parents/ money or anything most people have as a gateway into financial aid since it’s hard to even apply and qualify unless you are on the border of poverty in this state.\n\nI worry from what most have told us that going to college will only cripple our finances with overwhelming debt and the worry of jobs with this overpriced degree will be even less easier to obtain after the fact. Since job scarcity has been a factor.\n\nIf anything it sickens me to see that prices for schooling has only inflated this year..\nIt seems like the options are either live paycheck to paycheck on minimum wage or be thrown with crippling debt for your future with the possibility of a higher paying job.\n\nMost advice I’ve been given is just save money, but that alone would take years if you acknowledge rent and day to day living.",
  "author": "SoyDanBoy",
  "created": 1637668264,
  "updated": 1639849166,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hls7sb9": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hls7sb9/",
      "text": "Community college to get my courses unrelated to my degree out of the way, work, financial independence, vocational rehab, picking a school that while not in my state considers my county close enough to offer instate tution, and the government's desperation to get me off SSDI.",
      "author": "StoriesByScot",
      "created": 1637684767,
      "upvotes": 1,
      "replies": {}
    },
    "hlrg6kj": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlrg6kj/",
      "text": "I worked a minimum wage job in college. I paid off my $24,000 in student loans within 5 years of graduating with my bachelor's degree in Political Science.\n\nThe people who tell you that you can't do it may have ineffective financial management skills.",
      "author": "2ndChance_1stMistake",
      "created": 1637671958,
      "upvotes": 1,
      "replies": {}
    },
    "hlrkbed": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlrkbed/",
      "text": "Well, multiple things. Assuming you guys are legally independent, that should put you in low income brackets that would allow for government based aids/fafsa. Other than that, save whatever cash you have left without using up your emergency fund. If you can qualify for any scholarships, apply to those as well.\n\nAlso, after all of this, make sure you’re not overspending. Go to a college you can afford, and don’t stretch your finances too thin to go to ‘that’ school. As someone that graduated in a high in demand degree (comp sci) at a top 20 US school, what honestly matters more than anything is your work ethic, not the school you go to. You’re probably thinking ‘easy for you to say’, but honestly, a smart student at a less smart school will do far more than the other way around. I know plenty of people from no name schools get good jobs. I also had 70k in debt after I left college, but was fortunate enough to get a job that allowed me to pay it off in a year. If anything, go to a cheap community college for 2 years, get that GPA up, and transfer out. It’ll save you tons of money. \n\nLast but not least, go to college knowing what you want. When finances are tight, I would strongly urge against going to college when you have ‘no idea’ what you want to do. It’ll save time and money. Also, as much as following a passion is strong, you want to go to college not only to find something you enjoy, but because you want to set yourself up for potentially a better life and income. I.e. Don’t spend 100k going college only to major in gender studies and expect a good job. Research high paying fields that would align with your passions! Nonetheless best of luck, you got this!",
      "author": "MrRandomNonsense",
      "created": 1637674301,
      "upvotes": 1,
      "replies": {
        "hlus2k9": {
          "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlus2k9/",
          "text": "Facts, on a reddit post 😳. Nah jokes aside, this is hands down the best advice I’d follow if I was back in high school, or a working adult looking for a career/life shift.",
          "author": "itzjustal",
          "created": 1637723448,
          "upvotes": 12,
          "replies": {
            "hlva9x4": {
              "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlva9x4/",
              "text": "Thanks for the kind words stranger!",
              "author": "MrRandomNonsense",
              "created": 1637733157,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hlw2dat": {
          "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlw2dat/",
          "text": "Solid points, and absolutely on-point",
          "author": "ChaosCoordinatorCO",
          "created": 1637754344,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlrsftb": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlrsftb/",
      "text": "College options can be really hard. Public colleges are almost always cheaper, and many times now you can get need or merit based scholarships on a wide scale. It’s also worth looking to see if a community college would be cheaper for two years and then transferring! keep looking though, there may be local programs to help pay! and student loans may be a good option if it’s available to you, but do be careful, they can make things worse once payments start.",
      "author": "rhysthehuman",
      "created": 1637678305,
      "upvotes": 1,
      "replies": {}
    },
    "hlrvakg": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlrvakg/",
      "text": "I go to a CC right now. While I am full-ride in a state scholarship, CC then transferring is a more affordable and realistic option for many. \n\nMany people will work while in CC to save money toward colleges. But there are also scholarships you can apply to as well. Many websites will provide information on them.",
      "author": "kizeltine",
      "created": 1637679568,
      "upvotes": 1,
      "replies": {}
    },
    "hlry5z5": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlry5z5/",
      "text": "You either get scholarships (this is how most pay for it and by far the easiest way to do it), have your parents pay for it (Literal RNG), or you get fucked and hope you can pay it off later.",
      "author": "Dchaney2017",
      "created": 1637680823,
      "upvotes": 1,
      "replies": {}
    },
    "hlry8um": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlry8um/",
      "text": "It depends where you go to school, and for what.\n\nCollege is not the only way to improve your financial situation; there are skilled trades, for example, and people with a strong sales personality can do well in sales. In fact, it's only in recent decades that college has been seen as some kind of vocational training; for most of history, it was about inculcating a common culture that helps you debate ideas with other members of the elite.\n\nThat said, I think a college degree is a worthy goal, and there are ways to go about it that are affordable.\n\n* One of the most common paths is through military service. If you serve for three years in the U.S. military and are honorably discharged, the government will pay your educational expenses plus a stipend for room and board through the GI Bill. On the officer track there is the ROTC, which pays for your education, and you are commissioned as an officer after graduation and typically do four years of service after school. Of course, it's been argued that if you have military experience, you can often get a decent job without completing additional school, depending on how ambitious you are.\n* Depending on your income and savings, you probably qualify for financial aid from the federal or state government or from the institution itself. The calculation for this includes not only tuition, but living expenses like food and rent. Some of this will be grants, some will be loans, and some will be in other programs like work-study (where the government subsidizes your wages, to make it easier to get a campus job).\n* Most federal loans can be repaid under an \"income-based repayment\" plan, so your loan payments are based on your income. You can also discharge federal loans after making steady payments on them [if you work for the government or a nonprofit](https://studentaid.gov/manage-loans/forgiveness-cancellation/public-service).\n* In many states, community college credit is accepted for transfer to a state university, so if you can attend community college for a couple of years (which tends to be cheaper and to have more evening/weekend classes for working people), you can save a lot.\n* Ironically, many wealthy schools have \"need-blind\" admissions; being wealthy schools, they make up for shortfalls in government aid through private scholarships or other financial aid. My school does not offer any athletic or music or other merit scholarships, but they will work to give you direct grants and loans, so attending a $75,000/year school comes out to be cheaper than attending a $20,000/year school.\n* There is lots of money in private scholarships that you can apply for. This is a lot of work, as usually the scholarship is only $1000 here and $1000 there. But there are millions and millions of dollars that go unclaimed every year.",
      "author": "corneliusvancornell",
      "created": 1637680857,
      "upvotes": 1,
      "replies": {}
    },
    "hls0uzo": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hls0uzo/",
      "text": "You can take out public and private student loans. If you're worried about debt, do your research and pick a good major and you won't have to worry about finding a job or paying back your loans. \n\nA lot of what makes college scary is that most people do not do their research as to what majors are worth it and what steps they need to take in order to secure jobs before graduation.",
      "author": "-Avira",
      "created": 1637681944,
      "upvotes": 1,
      "replies": {}
    },
    "hlsbw12": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlsbw12/",
      "text": "Parents paid my tuition 😎",
      "author": "elkfn2",
      "created": 1637686393,
      "upvotes": 1,
      "replies": {}
    },
    "hltlgwq": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hltlgwq/",
      "text": "Low income funding, state school, and commuting.",
      "author": "lootcaker",
      "created": 1637704174,
      "upvotes": 12,
      "replies": {}
    },
    "hlu4m15": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlu4m15/",
      "text": "My school district gives everyone who graduates free tuition to any in-state college, and some private universities.",
      "author": "onthatime",
      "created": 1637712421,
      "upvotes": 8,
      "replies": {
        "hlud3dp": {
          "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlud3dp/",
          "text": "Bro what that’s insane",
          "author": "Sicktitsbruh",
          "created": 1637716379,
          "upvotes": 4,
          "replies": {
            "hlud7jo": {
              "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlud7jo/",
              "text": "I’d say it’s the one thing about going to that district. I wouldn’t be where I am without it.",
              "author": "onthatime",
              "created": 1637716433,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "hlulqui": {
          "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlulqui/",
          "text": "What's the district?",
          "author": "Royal-Progress",
          "created": 1637720454,
          "upvotes": 3,
          "replies": {
            "hlumduc": {
              "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlumduc/",
              "text": "Cleveland, OH",
              "author": "onthatime",
              "created": 1637720759,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hlzojgh": {
          "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlzojgh/",
          "text": "Bro what thats crazy good",
          "author": "ManateeSquid",
          "created": 1637811300,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlu7wfe": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlu7wfe/",
      "text": "I take 1 or 2 classes at a time so I can afford to pay it off all at once instead of dealing with a big loan at the end of school. Gonna take way longer but it's what I can afford.",
      "author": "ChowChowMeowMeow9",
      "created": 1637713953,
      "upvotes": 6,
      "replies": {
        "hlvg5ue": {
          "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlvg5ue/",
          "text": "How much is the average tuition in the US? (I’m Canadian and it’s about $300 per course (3 credit hour) at my school but the average is about $600(3 credit hour)).",
          "author": "jenniferrook9",
          "created": 1637736904,
          "upvotes": 1,
          "replies": {
            "hlvpuox": {
              "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlvpuox/",
              "text": "The average cost per credit hour in the US is just under $600, and the most common sizes of a class are 3 or 3 credit hours, so the average across the country is $1800-$2400, but many universities are much more expensive than this, the most expensive school is the university of Chicago at a whopping $1,921 per credit hour, there you'll expect a class to cost between $5,736 and $7,684",
              "author": "Tandemdonkey",
              "created": 1637744227,
              "upvotes": 2,
              "replies": {}
            },
            "hlx3i7c": {
              "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlx3i7c/",
              "text": "I was paying about $650 for a 4 or 5 credit course at a community College in Oregon, but then moved to Cali and am now paying out of state tuition at $1250 for a 4 credit class at a community College.\n\nIn a year I'll be considered a resident and won't have to pay so much. The annoying part is I'm from Cali originally and just moved away for a couple years only to come back to pay out of state tuition fees! \n\nThis isn't including books.",
              "author": "ChowChowMeowMeow9",
              "created": 1637772417,
              "upvotes": 1,
              "replies": {
                "hlxq54k": {
                  "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlxq54k/",
                  "text": "It’s about 600 for a 3 credit course in Canada’s top schools (some schools are more but they are mostly private Christian/catholic schools). It also doesn’t matter where in Canada you are from, it’s the same for all domestic students. It’s weird to me that American schools have different tuition for citizens because they live in a different state.",
                  "author": "jenniferrook9",
                  "created": 1637781239,
                  "upvotes": 2,
                  "replies": {
                    "hlyjl2o": {
                      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlyjl2o/",
                      "text": "That's awesome. I've always heard Canada was cool!",
                      "author": "ChowChowMeowMeow9",
                      "created": 1637792915,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hluemv0": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hluemv0/",
      "text": "Because my parents couldn’t/wouldn’t provide fafsa information, I filed as independent and get the full amount of financial aid available via that. I also work part time around 20-30 hours a week and full time over the breaks. Going to a public school will leave me in about 25k in debt at the end, which still sucks but it’s mostly for my housing as of right now, on campus. It’s manageable if you live cheap, don’t expect to have 0 debt, and learn to manage your time so you can work while going to classes.",
      "author": "maccreally",
      "created": 1637717109,
      "upvotes": 5,
      "replies": {}
    },
    "hlullrg": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlullrg/",
      "text": "I use the Pell Grant. I also have a 3 year scholarship.",
      "author": "Royal-Progress",
      "created": 1637720388,
      "upvotes": 3,
      "replies": {}
    },
    "hlumfug": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlumfug/",
      "text": "If you're able to move, do it. Oregon has a pretty high cost of living. I live in the south in a smaller city. I go to school full time (I was fortunate to score a fantastic scholarship to my university, but my school also prides itself on being one of the top return-on-investment schools in the country), but I also work about 40 hrs/wk between 2 jobs. Hourly, I make less than any of my friends who work. We're all college students working part time jobs, mind you. But what I make is still enough to be completely financially independent and comfortable.\n\nWages here are high compared to the cost of living. There's plenty of places in the US like this. Going to school while supporting yourself will be so much easier if you're able to move to the south (Alabama, Tennessee, Mississippi, etc). I'm sure there's places outside of the south like this too, but I don't know where.",
      "author": "Panashda",
      "created": 1637720786,
      "upvotes": 2,
      "replies": {}
    },
    "hlupdwd": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlupdwd/",
      "text": "I got a free first year to a community college from my high school when I graduated. From my ranks and filling out FAFSA I ended up getting the next year free from the college I’m at now. I’ll graduate in the spring without having to dip in my pockets at all. Definitely a blessing that I’m grateful for.",
      "author": "cluelesswond3r",
      "created": 1637722183,
      "upvotes": 2,
      "replies": {}
    },
    "hlupmxy": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlupmxy/",
      "text": "army",
      "author": "ghostmode342",
      "created": 1637722300,
      "upvotes": 2,
      "replies": {}
    },
    "hlutriz": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlutriz/",
      "text": "I robbed some gas stations and took out some loans",
      "author": "1atimmons1",
      "created": 1637724270,
      "upvotes": 2,
      "replies": {}
    },
    "hlthgsw": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlthgsw/",
      "text": "tbh parents",
      "author": "tha_oz",
      "created": 1637702576,
      "upvotes": 2,
      "replies": {}
    },
    "hlu2dfz": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlu2dfz/",
      "text": "Wealthy parents.",
      "author": "juanchorules",
      "created": 1637711393,
      "upvotes": 1,
      "replies": {}
    },
    "hlunptm": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlunptm/",
      "text": "I mostly afforded it through academic scholarships and living with my parents. Also, if I had waited a year my tuition would be fully covered under the new student scholarships for those who graduated 2020 and later. So now is probably a better time than ever to start college, that is if you’re fresh coming out of high school.. my best recommendation for people who aren’t coming straight out of high school is to start in community college",
      "author": "cabbage-soup",
      "created": 1637721386,
      "upvotes": 1,
      "replies": {}
    },
    "hluqwxe": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hluqwxe/",
      "text": "Have you tried applying for FAFSA? I at least $3k per semester, and my tuition is about half that (12 credits). On top of that if you qualify for any other scholarship or grant, that's extra money in your pocket. I suggest saving as much as you can.",
      "author": "Ph03n1x_5",
      "created": 1637722905,
      "upvotes": 1,
      "replies": {}
    },
    "hlurjyl": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlurjyl/",
      "text": "Check and see if the company you work at offers tuition reimbursement.",
      "author": "BipolarNarwhal20",
      "created": 1637723199,
      "upvotes": 1,
      "replies": {}
    },
    "hlusai5": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlusai5/",
      "text": "Can you explain your situation a bit more so I can offer a more detailed suggestion? What are you majoring in? How far along are yall in your academic programs? GPA?",
      "author": "Secret_Agent_Tempest",
      "created": 1637723554,
      "upvotes": 1,
      "replies": {}
    },
    "hluw5xc": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hluw5xc/",
      "text": "The company I work for pays for 100% of my degree.  Look for companies that will either pay for the degree entirely or partially through tuition reimbursement. Target, Walmart, and Starbucks are examples of this.",
      "author": "sevsimone",
      "created": 1637725449,
      "upvotes": 1,
      "replies": {}
    },
    "hluwdw5": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hluwdw5/",
      "text": "I sleep outside in the woods near my college and have people swipe me in to our cafeteria cause I look homeless. It really works. Save about 18k a year doing this.",
      "author": "Burger-King-Covid",
      "created": 1637725556,
      "upvotes": 1,
      "replies": {}
    },
    "hluwec1": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hluwec1/",
      "text": "Florida gives full tuition if you are a decent student. People trash florida but that's amazing. Even a $1200 a year stipend for things like a computer etc. just extra cash. Then there are grants etc. but the florida one has been easy to qualify for.",
      "author": "jetclimb",
      "created": 1637725562,
      "upvotes": 1,
      "replies": {}
    },
    "hlv2cda": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlv2cda/",
      "text": "I went to undergrad in Oregon no family to relay on and I started from being an assistant manager at subway. I took out loans and worked full time for 1/2 the year total in spurts. So I would do 3 month working spurts for the summer and Winter. I ended up with 60k in loans for 6 years but it get the job done. Keep in mind I was unmedicated bipolar so I would crash and drop everything so work was harder and school took me longer. If I could redu everything I would find an employer that pays for school like Starbucks work part time and go to school full time. I would take more courses at once and try to limit my loans to subsidized. I also would keep the path of community college to state school. Ask your career advisor for an aptitude test to find out what your good at. \n\nOnly take classes that get you on the path towards your goal degree and therefore job. Apply to internships when you get to upperclassman. I now have my graduate degrees paid for by my employer. The biggest battle is paying the high cost of living in Oregon it costs so much to even exist. If I was smarter I would have taken advantage of food banks and gotten on food stamps but I was prideful and my loan balance is mostly rent and food. Schools often have food banks. Schools have scholarship but Oregon also has a state scholarship board that you can apply to a bunch at once. There’s also independent scholarships you can lookup. Apply to all 3. https://oregonstudentaid.gov/scholarships.aspx Fafsa is great too, it’s all grant money meaning you don’t pay it back.",
      "author": null,
      "created": 1637728629,
      "upvotes": 1,
      "replies": {}
    },
    "hlv2npo": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlv2npo/",
      "text": "Lots of good advice in here. My dad is a CPA and he’s hired two of the children of people we regularly employ (a hairdresser and our maid of several years) who are interested in accounting. They don’t have college degrees yet but they’re working, getting tons of experience, and paying for school while they do it (earning way more than minimum wage). Networking through religious groups, community, or work can be really helpful. It has helped me get jobs too as someone coming out of a decent but not amazing program and with no connections through family this has been huge.",
      "author": "cantreadshitmusic",
      "created": 1637728798,
      "upvotes": 1,
      "replies": {}
    },
    "hlv4smy": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlv4smy/",
      "text": "Got lucky. Pure and simple.",
      "author": "ElonMuskIs_God",
      "created": 1637729977,
      "upvotes": 1,
      "replies": {}
    },
    "hlv6c0w": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlv6c0w/",
      "text": "Back up to the first question: Do you need to go to college? Or would a trade suit you?",
      "author": "ROIIs360",
      "created": 1637730840,
      "upvotes": 1,
      "replies": {}
    },
    "hlvop6c": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlvop6c/",
      "text": "Based on what I have seen here, it would not be more expensive for you to move to Europe. There are many countries here, that have free higher education, even in prestigious universities. You can find plenty of work here. The downside is, education here can be hard. Like, so much harder, that when I meet my American cousins, and they tell me what they do in college, it's laughable.",
      "author": "Alternative-Mango-52",
      "created": 1637743282,
      "upvotes": 1,
      "replies": {}
    },
    "hlw3dfz": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlw3dfz/",
      "text": "Not from America either, but now an American. So, I totally understand, the American college system is confusing and expensive.\n\nWhen my husband was AD Air Force I went back to school, and we were classed as low income - I qualified for FAFSA Pell grant and it covered my Associates degree to an online school. I went to Columbia Southern University. People don't give it enough credit, I know it's not regionally credited, but it requires a lot of dedication and prioritization. I am now back at the same school to get my B.S. in Organizational Leadership. I am 6 classes away from graduating, I work full-time (around 50 hrs a week) and I am still getting it done as a parent too. This time around I didn't qualify for FAFSA because I make too much, but it is seriously $1300 for each term (which is 8 weeks, 2 classes, 6 credits). I get a military discount also. I have had ONE employer ask about the school. No-one else has given a shit about the name of the school especially my current employer. I also had a previous employer help with tuition reimbursement too. It is doable.",
      "author": "ChaosCoordinatorCO",
      "created": 1637755058,
      "upvotes": 1,
      "replies": {}
    },
    "hlwc5sw": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlwc5sw/",
      "text": "Military.",
      "author": "Rare-Policy355",
      "created": 1637760492,
      "upvotes": 1,
      "replies": {}
    },
    "hlxw0h1": {
      "link": "/r/college/comments/r0bj3a/how_are_you_guys_able_to_afford_college/hlxw0h1/",
      "text": "As someone who’s gone to college in Oregon I have lots of advice!! My #1 is to go to community college. Also apply for FAFSA and you will likely get the Pell grant, which can make community college free depending on the local CC’s requirements and any programs they offer. After that, look into any “transfers finish free” programs. I know portland state has one where if you’re Pell grant eligible and transfer from a CC after getting a GPA of 2.25 (or 2.0 if you get the AAOT or OTM), you get free tuition!\n\nLet me know if you have my other questions and I’d be happy to help!",
      "author": "greenpotatosoup",
      "created": 1637783545,
      "upvotes": 1,
      "replies": {}
    }
  }
}