{
  "sid": "chwi31",
  "link": "/r/college/comments/chwi31/orientation_sucked/",
  "title:": "Orientation Sucked",
  "text": "I made a ton of new friends, got a huge amount of snapchats and Snapchat groups and really enjoyed most of the people I met. However, I felt so alone. I felt like that school wasn’t for me and that I was an outsider. I’m not sure if it’s because all the staff and leaders put on this face, or that the only time you could have conversation was during meaningless icebreakers, but I just felt lost. I felt like I chose the wrong school. It was that “vibe” but I’m not sure if I should trust it. \n\nIs that just how orientation is? I want to believe that it is just kind of a facade and that real life college will actually be great, but that feeling is really sticking on to me.",
  "author": null,
  "created": 1564104651,
  "over_18": false,
  "upvotes": 586,
  "upvote_ratio": 0.98,
  "comments": {
    "evquod6": {
      "link": "/r/college/comments/chwi31/orientation_sucked/evquod6/",
      "text": "Orientation went the exact same way for me. Ngl, finding friends was tough, but ultimately it’s better to make sure you like yourself before other people like you. I know that sounds like some self help bullshit but just in the sense that like if you feel generally comfortable with yourself, you find people will be willing to hang out with you a lot more.",
      "author": "mardfet",
      "created": 1564697611,
      "upvotes": 1,
      "replies": {}
    },
    "evb8u4x": {
      "link": "/r/college/comments/chwi31/orientation_sucked/evb8u4x/",
      "text": "I had the same feeling during orientation.  Long story short I ended up extremely depressed by the time I graduated.  It held me back professionally and I regret not getting help for it earlier.  \n\nGo see a therapist regularly.  The school has resources and if they are not what you need find one that is covered by health insurance.  Please do not try to cope on your own.\n\nIf you keep a positive attitude and live your best life friends will be attracted to you.",
      "author": "CrankyUnionCarpenter",
      "created": 1564369293,
      "upvotes": 1,
      "replies": {}
    },
    "ev9cuzv": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev9cuzv/",
      "text": "College/university is quite a transition from highschool and unless the other new students you met during the day came with many of their highschool friends to keep them company I would suspect they were feeling similar to yourself.\n\nHere's a few tips I wish I had known when I started 3 years ago:\n\n1. Your tutors/teachers are people not so different from yourself so if you enjoy their classes treat them as if it were you standing at the front of the room and don't be afraid to ask for advice as they were once in your position.\n2. People are shy and this shyness can lead to very quiet tutorials that are uncomfortable for everyone. Therefore, don't be afraid to speak up in class and ask questions even if it's scary at first as it will get the ball rolling and allow others to overcome the same fear.\n3. Attend all of your tutorials/classes and lectures! I don't care if it's easier to watch the recorded lectures in your own time because chances are that the time wont come. Attending tutorials is a great way to meet a variety of different people and find the ones you click with and they will keep you on track with your studies.\n4. Join a club or society you're interested in. This can help you meet people with common interests and find out what people like yourself do for fun.\n5. READ!! One of the best pieces of advice I have ever received was to read non-fiction books that interest me. Reading can really help with your writing and it also allows you to develop and critically reflect on yourself the world around you.\n6. Finally, I know it may be boring buuut... read the textbook. Although it may seem tempting to rely on the lectures for the course content there is only so much a powerpoint can educate. The earlier you push yourself to read the textbook, the easier assignments become and the faster you will be able to read.\n7. Finally, finally... read the referencing guide and practice correct referencing from your first assignment. It only gets easier and will save you from losing a lot of marks in the long term.\n\nFor the record, I'm only 20 and I still have much to learn but I  guarantee that this will make university/college a rewarding experience for you. I wish I had similar tips when I was new as it's been a bumpy road figuring it out for myself.\n\n&#x200B;\n\nGoodluck!!!",
      "author": "nickjcreed",
      "created": 1564317291,
      "upvotes": 1,
      "replies": {}
    },
    "ev34lq7": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev34lq7/",
      "text": "Orientation is just a show basically. When I had my orientation some staff and student leaders were basically putting on a show. Some head coach was like telling everybody she was glad people selected the school, which I bet you she says that every single year.  I know some people that got those jobs when they feel the complete opposite of the school. My vibe of the school definitely changed when I saw how many in state people were attending the school. My school hid things from me. So, basically a show to make people come.",
      "author": "travelwaves",
      "created": 1564189139,
      "upvotes": 1,
      "replies": {}
    },
    "ev2rfwj": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev2rfwj/",
      "text": "I did orientation last month and I really couldn’t see myself be friends with any of the people I talked to.\n\nBut I realize that there are more orientation dates and there’s going to be people from my actual major coming to those too. So there’s got to be someone I’ll have something in common with.",
      "author": "Olivia_Anthro",
      "created": 1564182422,
      "upvotes": 3,
      "replies": {}
    },
    "ev2evt5": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev2evt5/",
      "text": "Oh, I wouldn’t worry about. My orientation sucked, but when I actually got to school...it still sucked. Never mind 😐",
      "author": "uhohmykokoro",
      "created": 1564175621,
      "upvotes": 3,
      "replies": {}
    },
    "ev25za4": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev25za4/",
      "text": "I think this is common for a lot of people—including myself",
      "author": "thespitspot",
      "created": 1564171071,
      "upvotes": 1,
      "replies": {}
    },
    "ev22187": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev22187/",
      "text": "Honestly orientation is fake as hell, and run by fake people. Hopefully you'll meet great people in your department like I did",
      "author": "BakerNowitzki",
      "created": 1564169091,
      "upvotes": 1,
      "replies": {}
    },
    "ev20ezt": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev20ezt/",
      "text": "Orientation sucked for me too, you’re so not alone. My roommate for the weekend was so anti social and the groups that I paired up hardly talked to me. It didn’t help that I was awkward and had a hard time talking to people. Everything feels really fake and the ice breakers are just the worst. I really hated how they herded us around like sheep and treated us like we were in elementary school. \n\nChin up though! Things will more than likely get better once you get settled in for the year. I made more friends in clubs and classes than anything else. It’ll be awkward for the first few weeks of the semester, guaranteed, but power through it! You got this!",
      "author": null,
      "created": 1564168281,
      "upvotes": 1,
      "replies": {}
    },
    "ev1zubs": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev1zubs/",
      "text": "I hated orientation. It just wasnt my scene. It was a whole weekend with forced activities that I wasnt into. The one good thing that came of orientation was my best friend from college. Wr bonded over biycotting the activities. Dont let it discourage you about the school. Give it a couple months before you truly decide if it's not for you.",
      "author": "Lizzywads",
      "created": 1564167994,
      "upvotes": 1,
      "replies": {}
    },
    "ev1zk91": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev1zk91/",
      "text": "that is exactly how orientation was for me ! I went in nervous but thinking that it was going to be a lot of fun, and ended up leaving the complete opposite. It had me starting to second guess my choice of going to that specific school & people in my group just didn’t seem like the friendliest. I had gotten extremely homesick and the orientation leaders seemed super fake and not able to accommodate me in anyway. take it from someone who just finished their freshman year at the sucky orientation and I had a great year. sometimes orientation is not a true representation of the school and though it should be a good time it isn’t.",
      "author": "smileyblondie",
      "created": 1564167852,
      "upvotes": 1,
      "replies": {}
    },
    "ev1ymsn": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev1ymsn/",
      "text": ">Is that just how orientation is?\n\nYes. I only kept in touch with one person from orientation and that’s only because we have a class together.",
      "author": "mysuperusername7689",
      "created": 1564167394,
      "upvotes": 3,
      "replies": {}
    },
    "ev1oi5p": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev1oi5p/",
      "text": "Never talked to one person I met at orientation when school started. I also had a ton of “group chats” which died after about a week. It’s really a dumb idea and OAs probably hate it too.\n\nOrientation usually sucks unless there is drinking or something (which never happens). The first week of school is when you should be talking with people bc you hang out with them a lot more.",
      "author": "Wlpxx7",
      "created": 1564162479,
      "upvotes": 3,
      "replies": {}
    },
    "ev1mwxq": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev1mwxq/",
      "text": "Same here. Just don't worry about it,",
      "author": "CrimzonShardz",
      "created": 1564161605,
      "upvotes": 1,
      "replies": {
        "ev1n39x": {
          "link": "/r/college/comments/chwi31/orientation_sucked/ev1n39x/",
          "text": "I accidentally hit post. I meant Same here. Just don't worry about it, most orientations aren't very genuine, it's normal. You'll know you made the right or wrong decision about a semester or year in and if you fell you made the wrong one, it won't be the end of the world. Just play it as time goes on it'll be alright",
          "author": "CrimzonShardz",
          "created": 1564161704,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ev1azzr": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev1azzr/",
      "text": "In general all schools are mostly the same and orientation is always fake.\n\nThe thing is you don't come to college to make friends. You come to learn and get a degree.\n\nFocus on that and friends will likely appear to you over the years in your classes and clubs.",
      "author": "peregrin5",
      "created": 1564155267,
      "upvotes": 1,
      "replies": {}
    },
    "ev19s6v": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev19s6v/",
      "text": "Orientation is dumb. And that is coming from a campus student representative. You’ll never see most those people again, and OLs are too chipper for no reason. I went to two events on the first day and skipped the rest of the week. Never got called out for those “mandatory” events I missed. I love my university, am a thriving upperclassman, and still hated orientation.\n\nGive the semester a shot and see what you think of the classes, your TAs and professors, and your major. Go to the club fair  and sign up for at least two: a club related to your major and a club for something fun you enjoy. Orientation is not a representation of your school. If the school is really not for you and you still don’t want to be there later this fall, you can look at places to transfer that meet your needs better.",
      "author": null,
      "created": 1564154688,
      "upvotes": 1,
      "replies": {}
    },
    "ev19ek1": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev19ek1/",
      "text": "I didn’t talk to a single person in my orientation group once it was over, I made friends once classes started and I started getting involved in clubs. Things will pick up.",
      "author": "SoybeanEgg",
      "created": 1564154497,
      "upvotes": 3,
      "replies": {}
    },
    "ev18leu": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev18leu/",
      "text": "The only good parts of orientation are getting your student id and taking a first ride on the bus system. Scoping out the cafeterias.",
      "author": "nooutlaw4me",
      "created": 1564154112,
      "upvotes": 1,
      "replies": {}
    },
    "ev17eeu": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev17eeu/",
      "text": "Im sure that feeling will go away",
      "author": "weird_waynee",
      "created": 1564153539,
      "upvotes": 1,
      "replies": {}
    },
    "ev14t7v": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev14t7v/",
      "text": " We had an overnight orientation and I still made no friends. I was from 16 hours away, and I never felt so alone before. But luckily for me, school was a totally different story. It was nothing like orientation",
      "author": "Lalaluc",
      "created": 1564152279,
      "upvotes": 1,
      "replies": {}
    },
    "ev13i57": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev13i57/",
      "text": "The first 2 months of college were horrible. They were Hell. I was so lonely. I’d go to bed at 10 most nights because I felt so isolated and alone (I’m an introvert and a tad socially awkward, too). I considered accepting that I won’t ever make friends and to be happy with that. I don’t need friends. Who does?\n\n\nThen by winter break I found I had a close-ish group of friends. We missed each other and exchanged gifts even.\n\n\nMy advice is to study in open areas and join clubs. That’s how I met my friends.",
      "author": "ferdous12345",
      "created": 1564151626,
      "upvotes": 4,
      "replies": {}
    },
    "ev0w4rf": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0w4rf/",
      "text": "I just graduated from college in May.  Orientation is strange, to say the least. I started my freshman year of college at one school, but finished at another.\n\nThe school I started at had a one day orientation with really nothing but presentations from all of these administrators that we would probably never actually see. It was very strange. Being a lonely student from out of state and having an obscure major at that particular school, I tried to make some friends at orientation but wasn’t given any time to do so. There, I made friends by talking to people who lived in my dorm. \n\nI can’t speak much to the freshman orientation at my alma mater, because I transferred mid-year. I can say, however, that a great way to make friends is through involvement or others that you kind of know. It gets easier, and college is a great time where you will really learn a lot about yourself. Hang in there and enjoy it, you’ll miss it when you’re done!",
      "author": "rcarmody96",
      "created": 1564147761,
      "upvotes": 1,
      "replies": {}
    },
    "ev0w463": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0w463/",
      "text": "Can someone explain what an orientation actually is?",
      "author": "Flyfires1",
      "created": 1564147752,
      "upvotes": 1,
      "replies": {
        "ev1rx5l": {
          "link": "/r/college/comments/chwi31/orientation_sucked/ev1rx5l/",
          "text": "Varies with schools, but for the most part, it’s introducing students to the university and what to expect. They meet up with advisors to pick out classes and learn the ropes of other stuff they have to do at college. They also have the chance to ask any questions to any representatives (housing, financial aid, etc.) and go see dorms for the most. (Some universities have overnight orientations where they can see how sleeping at a dorm is like).",
          "author": null,
          "created": 1564164112,
          "upvotes": 2,
          "replies": {
            "ev37y6i": {
              "link": "/r/college/comments/chwi31/orientation_sucked/ev37y6i/",
              "text": "Does it usually take place the summer before school starts? Cause I think mine is like 3 days before school starts",
              "author": "Flyfires1",
              "created": 1564190702,
              "upvotes": 2,
              "replies": {
                "ev3890t": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/ev3890t/",
                  "text": "Again, honestly depends. For my school, we officially start in March through late July. However we had a couple in December (of the year before, not when that upcoming year has started) and January. We’re currently getting ready to do transfer orientations and international orientations which are all the week classes start. So I don’t think it’s that weird your orientation is 3 days beforehand especially if you’re the one who picked the date.",
                  "author": null,
                  "created": 1564190834,
                  "upvotes": 2,
                  "replies": {
                    "ev3i7es": {
                      "link": "/r/college/comments/chwi31/orientation_sucked/ev3i7es/",
                      "text": "Ah thanks for info!",
                      "author": "Flyfires1",
                      "created": 1564195506,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ev0tuqm": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0tuqm/",
      "text": "And, remember, you're not there to make friends.",
      "author": "Archipelago12",
      "created": 1564146483,
      "upvotes": 1,
      "replies": {}
    },
    "ev0trie": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0trie/",
      "text": "This is normal!\nI almost quit!\nDon't turn back now!\nYou will be o.k.!",
      "author": "Archipelago12",
      "created": 1564146431,
      "upvotes": 3,
      "replies": {}
    },
    "ev0t61y": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0t61y/",
      "text": "It's going to take a few months. The first few weeks I constantly was questioning whether or not to stay at my college and didn't have any friends, but after everyone gets over the freshman frenzy, you'll find your group. Second semester of freshman year, my friends looked back and realized how fake they were trying to impress everyone.",
      "author": "Xiaotang01",
      "created": 1564146091,
      "upvotes": 1,
      "replies": {}
    },
    "ev0pdb4": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0pdb4/",
      "text": "The first school I went to thought it was a great idea to make their orientation a whole weekend long with 12+ hours of mindnumbing teambuilding activities per day and it was all mandatory via an id swipe at each activity. There was maybe 2 hours total devoted to actually learning about the campus and what we would need to be successful there. Once I transferred I skipped orientation all together cuz it was optional and the first one was so painful.",
      "author": "katkaturian",
      "created": 1564143844,
      "upvotes": 1,
      "replies": {}
    },
    "ev0lrqb": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0lrqb/",
      "text": "> However, I felt so alone. I felt like that school wasn’t for me and that I was an outsider......I felt like I chose the wrong school.\n\nIf you have problems making friends at college, it is NOT due to the college and changing schools will not make things better.",
      "author": "wolf2600",
      "created": 1564141591,
      "upvotes": 1,
      "replies": {}
    },
    "ev0lqu6": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0lqu6/",
      "text": "My orientation was so cringey. For one, at the very start of orientation, they had every incoming student separate for the day from their families, which I didn't really mind. After that, a group of upperclassmen shuffled into the room and awkwardly sang a song for like 5 minutes while doing a coereagraphed dance. I still shudder and cringe. After what seemed like and eternity of that, they separated us into small groups relative to our majors. I was the only music theory major, so I kept getting pointed out during the ice breakers and I was kind of at the center of every joke because I was alone. On small group icebreakers I had to awkwardly join another group that had nothing to do with my major. The icying on the cake was when class scheduling started. One by one everyone got called into an office to setup their classes. I was the very last person, and the reason why was because my counselor didn't show up to orientation. So everyone except for me scheduled their classes at orientation, and I had to end up paying a $200 late sign up fee and had to scramble to get everything situated. Got told there was no double bass instructor, and had the schools double bass instructor (who had worked there for 15 years) call me and ask why I wasn't set up for solo practice. I ended up dropping out after my first semester because the entire experience was much of the same and I didn't want to continue paying all my money to such a goat fuck of a school.",
      "author": "PR0MI5CU0U5_FI5H",
      "created": 1564141574,
      "upvotes": 3,
      "replies": {}
    },
    "ev0j7ux": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0j7ux/",
      "text": "Orientation sucked at my school too. Seems like there's not much they can do to make it fun lol",
      "author": "Monic_maker",
      "created": 1564139879,
      "upvotes": 1,
      "replies": {}
    },
    "ev0j5oc": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0j5oc/",
      "text": "I don’t think many people became friends with people they met in orientation. Pretty much everyone I knew and myself included majority of their friends in clubs/organizations and in classes related to our major. \n\nI’m not sure if they do this where you attend school but since I went to a very large university they had a fair for all of the clubs/orgs and you can find out their first meeting. I can’t guarantee you’ll join the first club you go to but I certainly think you can find one you click with really well.",
      "author": "_DooDooDaggers",
      "created": 1564139832,
      "upvotes": 2,
      "replies": {}
    },
    "ev0ghaq": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0ghaq/",
      "text": "Orientations are always trash. It's a law or something. Meet your roommates, join some clubs, if you already know what you want to major in, you'll meet people in your program with whom you will already have several thing in common baked in. you'll have your space to belong in no time :)",
      "author": "GoneZombie",
      "created": 1564138221,
      "upvotes": 1,
      "replies": {}
    },
    "ev0etmm": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev0etmm/",
      "text": "You're not alone, I've been to two orientations. The first one was at some private school and had \"teambuilding exercises\" and icebreakers for 8-9 hours straight, I couldn't stand it and it really left a sour taste in my mouth until my classes started, then it was a completely different experience as I enjoyed going and being on campus. My most recent one was for a giant university and while the orientation program itself wasn't bad, the facade that the leaders and faculty put on was horrible but its mostly just to make the school seem wholesome to parents and isn't geared much toward the students but that's just my thought on it. I start again this Fall and I'm excited to see how it goes but outside of the orientation, I love the atmosphere of the campus and everything it has to offer.\n\nDon't fret, because orientation isn't representative of the actual experience. Everything is going to be just fine and if you decide you don't like the school, explore other options. I understand what you're feeling though.",
      "author": "DankBeansBrother",
      "created": 1564137190,
      "upvotes": 1,
      "replies": {}
    },
    "ev099yl": {
      "link": "/r/college/comments/chwi31/orientation_sucked/ev099yl/",
      "text": "Hey, it’ll be okay. I loved orientation, but I don’t talk to any of the people I met that day, anymore. I also cried the first day of school for the same reason you posted and some really nice girls talked to me. That made me feel better. It’s a big step, though. I hope you find your place!",
      "author": "K_A_W_A_I_I",
      "created": 1564134104,
      "upvotes": 3,
      "replies": {}
    },
    "euztyiq": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euztyiq/",
      "text": "I felt the same way. A year later, I love my school. I recommend giving it a little time before making any snap judgements",
      "author": "abrightong",
      "created": 1564126330,
      "upvotes": 1,
      "replies": {}
    },
    "euzpfrm": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzpfrm/",
      "text": "Thread: Everyone hates orientation.\n\nIt'll be ok :)",
      "author": "Schnives",
      "created": 1564123952,
      "upvotes": 5,
      "replies": {}
    },
    "euzoskp": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzoskp/",
      "text": "You're not alone. Orientation always sucks. College started this week and I'm pretty lonely as well. I'm attracting all the annoying loser kids because I'm not best friends with anyone rn, and I hate it. I love when classes start because then the only thing I have to focus on is the teacher and the most exciting part is getting attendance marked because that's basically why everyone comes to college. You'll find a nice group of friends in due time. Don't even stress about that. As for me, I'll be joining a society in my college. That particular society's members must do 120 hours of social work for the public in a year, and I think it'll be great for bonding with fellow members and I'll also have a government approved certificate to write in my resume.",
      "author": "manas962000",
      "created": 1564123618,
      "upvotes": 1,
      "replies": {}
    },
    "euzmid1": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzmid1/",
      "text": "I felt the opposite, didn’t really meet people, but I realized how nice the campus was.",
      "author": "Prit717",
      "created": 1564122446,
      "upvotes": 3,
      "replies": {}
    },
    "euzishf": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzishf/",
      "text": "A bit late to the party but I felt the same way last year! I felt super alone at orientation and didnt really talk to anyone. I've had social anxiety for a long time so that already didnt help. All those ice breakers and such do not really help with the actual experiences I had during my freshman year. I ended up making some amazing close friends, not a single one from orientation. I met them through my major and so on. Do not let orieantion discourage you from having a great first year!",
      "author": "ariel11563",
      "created": 1564120422,
      "upvotes": 1,
      "replies": {}
    },
    "euzi0bt": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzi0bt/",
      "text": "Me too. I literally left orientation while everyone was sleeping and just stayed a hotel. I didn’t even come back to sign up for classes. :( College isn’t for me I guess.",
      "author": "oiTysim",
      "created": 1564120005,
      "upvotes": 3,
      "replies": {}
    },
    "euzhxlk": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzhxlk/",
      "text": "Orientation in the summer isn't really for making friends, at least with my experience. Even when we broke off into groups for our specific schools, I never saw those people again. I got to schedule classes and have a Q&A. The time between when you move in and when classes start are where I made most of my friends",
      "author": "lukestr2002",
      "created": 1564119963,
      "upvotes": 2,
      "replies": {}
    },
    "euzdilv": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzdilv/",
      "text": "i cried in a bathroom for 45 minutes during my orientation but i ended up loving college!! keep ur chin up",
      "author": "styrofoam-plates",
      "created": 1564117617,
      "upvotes": 3,
      "replies": {}
    },
    "euzbt2v": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzbt2v/",
      "text": "They always do",
      "author": "ikilledtupac",
      "created": 1564116750,
      "upvotes": 1,
      "replies": {}
    },
    "euzbhos": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzbhos/",
      "text": "Go Greek, that could help",
      "author": "j0relyoup",
      "created": 1564116587,
      "upvotes": 1,
      "replies": {}
    },
    "euzbanf": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euzbanf/",
      "text": "Orientations can be awkward because they are totally forced. Keep your head up, the real friendships will happen when you don’t expect them",
      "author": "ScoobertDoobert34",
      "created": 1564116490,
      "upvotes": 2,
      "replies": {}
    },
    "euz90w3": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz90w3/",
      "text": "Congratulations, that feeling you're having is called homesickeness and/or culture shock! It happens to everyone, trust me, it just seems like you're the only one going through it because the human brain is bad at telepath, but the human face is great at hiding emotions. You're in a new environment with new people, places, sounds, smells, etc. You likely don't really know anyone, and you've left a place you were previously comfortable in. Don't worry, it'll pass. It takes the human mind time to adjust to a new environment and become comfortable. Just try to settle into a routine, meet some new people, and distract yourself. 2-4 weeks, everything will feel just as natural as it did back home.",
      "author": "lmirise",
      "created": 1564115354,
      "upvotes": 3,
      "replies": {}
    },
    "euz8rh6": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz8rh6/",
      "text": "Hi, I know a lot about college and have been participating in orientations for over a decade. All y'all need to do with orientation is:\n\n1. Grin and bear it. I know it's stupid. There are a bunch of people in charge who have no idea what a good time looks like. Many of them are parents with kids 7 years younger than you, and they seem to think what their 11 year old finds fun is a good idea for you. Sound like what you experienced today? They do all this to make the main purpose (unsuccessfully) more palatable:\n\n2. Get what you need out of it. Walk around with your group and get acquainted with where you will be spending the next few years of your life. Ask questions when you can if you have them (and you should). Ask how long it takes to get from your first class to your second class on the other side of campus. Ask about what you need to know about parking your first few weeks (it will be terrible). Get familiar with how the rooms feel. Are they cold? Bring a hoodie your first day. Are they burning up? Still bring a hoodie, they may crank the AC. Ask the hours at the gym. If they don't mention a campus app, ask about it. \n\n3. Everyone was there today for #2. You are as likely to make awesome friends during orientation as you are in the line at a  Starbucks you visited once. It's possible, but unlikely. People are too focused on #2 and being forced to do #1. Time for interactions will come soon.",
      "author": null,
      "created": 1564115228,
      "upvotes": 1,
      "replies": {}
    },
    "euz8jxh": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz8jxh/",
      "text": "I just graduated college in May.. I remember I didn’t make a single friend in my orientation group, it all just felt so awkward and forced.  During the actual school year I made my best friends who I ended up living with every year after that.  It is such a weird experience in the beginning and you can really second guess yourself- but just stick with it and give it your all being yourself and you will be surprised how things may end up.",
      "author": "44cook44",
      "created": 1564115123,
      "upvotes": 2,
      "replies": {}
    },
    "euz8i8w": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz8i8w/",
      "text": "Oh man this is the day last day of orientation week and I feel so alone but only cause I suck at socialising and most of the new people here have got girlfriends already like wtf it makes me feel so depressed plus it doesn’t help I suck at socialising way too much so it’s been a super rough week for me",
      "author": "ravinglt0",
      "created": 1564115100,
      "upvotes": 1,
      "replies": {}
    },
    "euz8dk1": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz8dk1/",
      "text": "That's exactly how I felt. I made friends with a crowd of people that I don't see myself being friends with except maybe 2 of them. This is part of the reason why I'm not too excited because it will be hard to fit in with the right crowd for me at my school",
      "author": null,
      "created": 1564115033,
      "upvotes": 1,
      "replies": {}
    },
    "euz7rto": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz7rto/",
      "text": "I wouldn't worry about it if I were you. I had a wonderful first year and made lots of good friends, but talked to literally nobody that I met at orientation",
      "author": "zachb237",
      "created": 1564114742,
      "upvotes": 3,
      "replies": {}
    },
    "euz7g42": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz7g42/",
      "text": "Orientations are awkward and boring and often painful to go through. You've older classmen trying to break you out of your shell while in all honesty you're waiting for the hours to tick down so you can just go back home or to work, same cam be said for the speakers. Dont worry. Orientation is not the highlight or the cap for the college experience.",
      "author": "whtca_denae",
      "created": 1564114583,
      "upvotes": 5,
      "replies": {}
    },
    "euz4zvr": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz4zvr/",
      "text": "My orientation fucking sucked. They had us do this scavenger hunt all over campus looking for clues and stuff all to spell out a pep phrase. This would have been fine but it was like 90+ degrees outside and we all felt like we were dying. I never saw anyone from that orientation again afterwards. Real college will be nothing like the orientation or what they tell you it will be like there. It’s all just a show really. One of the biggest reasons it exists is to get you in a room with advisors to get your first schedule figured out.",
      "author": "xthatguy339x",
      "created": 1564113408,
      "upvotes": 3,
      "replies": {}
    },
    "euz33fk": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz33fk/",
      "text": "I hated my orientation. I barely talked to anyone and was so sick of all the staff and student workers being overly enthusiastic. However, once the semester started, I got used to my classes and started meeting new people, I felt so much better and found great people. I felt like I made the wrong decision too at first, but it got better and it will get better for you too. Good luck this upcoming school year! You will do great!",
      "author": "Rosie_22",
      "created": 1564112500,
      "upvotes": 3,
      "replies": {}
    },
    "euz2m4r": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz2m4r/",
      "text": "The school they show you during orientation actually isn’t an accurate representation of how school will be for you. I hated orientation and didn’t connect with the people in my group at all and hated the vibe of the school. But I love it there now, have a group of super close friends, and have had a great experience. Don’t freak out over orientation. And honestly people probably aren’t loving orientation as much as they say they are. Social media only tells part of the story.",
      "author": "sharon-cake",
      "created": 1564112277,
      "upvotes": 9,
      "replies": {}
    },
    "euz0ccx": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz0ccx/",
      "text": "I went to orientation back in 2010 and I still cringe at thinking about my experience. It was terrible. Everything about the orientation leaders was fake. I talked to maybe five different people for the three days I was there.  The highlight of the trip was when some girl started crying during an ice breaker because someone said they hate people from Boston. Nobody was interested in me because I was a commuter. I went through four years of college and made no friends, but I was (and still am) okay with it. I was there to get an education and a job. I drank/partied with my real friends at home on the weekends. \n\nI ended up getting into a top tier accounting firm and was asked by HR to help out at career fairs at my college. The funny thing is at the career fairs, students were lining up to talk to me and other people from the firm, but this time I was the fake one because I had to lie about my true work life balance at the firm. Crazy right lol",
      "author": "Slim_Chim",
      "created": 1564111222,
      "upvotes": 14,
      "replies": {}
    },
    "euz01pv": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euz01pv/",
      "text": "College is all about what you make of it. Don't let anyone tell you how to live your life. Orientation is  unfortunately just the college suggesting to you how they want you to live. I personally enjoyed Orientation because it was a really casual time to get to know more faces and I also find cheesy ice breakers fun. It'll take a little bit for deeper relationships to start to form, so it's understandable that you felt alone, but everyone else is feeling the same way. Even though it certainly felt like it, there isn't even a group for you to be an 'outsider' of. Everyone felt just as much as outsider as your, they just express it in different ways. Don't convince yourself that you chose the wrong school just because the vibe of orientation felt off.",
      "author": "iambendv",
      "created": 1564111092,
      "upvotes": 1,
      "replies": {}
    },
    "euyzhd8": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euyzhd8/",
      "text": "Orientation is not college.",
      "author": "thejappster",
      "created": 1564110828,
      "upvotes": 2,
      "replies": {}
    },
    "euyx7vg": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euyx7vg/",
      "text": "That's just what orientation *is*. It's a load of shit and I'm not entirely convinced that anyone truly enjoys it. I'd be more concerned if you'd thought it was amazing.\n\nYou don't really know anyone, you don't know where things are, and whatever activities they get you to take part in are going to be awkward because of it. No one knows what to say or do, so everyone stands around with their hands in their pockets. \n\nAnd just to get it out of the way: those \"friends\" you think you made aren't real friends, at least not yet. It takes time to form solid friendships, and it'll still be awkward with them for a few months yet. That's normal. You're not supposed to feel like a member of the community on day 1 because you aren't a member of the community yet. Get to know your classmates and professors, learn the campus, join clubs, and *then* you'll start to feel like you belong.",
      "author": "NoxiousQuadrumvirate",
      "created": 1564109799,
      "upvotes": 6,
      "replies": {}
    },
    "euywh7v": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euywh7v/",
      "text": "Just got back from orientation yesterday and I completely agree. I think it’s just because it’s a new environment and I’m not used to it yet.",
      "author": "trumpetpizza1",
      "created": 1564109465,
      "upvotes": 4,
      "replies": {}
    },
    "euyw3vv": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euyw3vv/",
      "text": "I tried talking to one girl, we exchanged numbers but never actually texted after orientation. Felt extremely nervous the entire time and overall didn’t participate in anything because of it. I heard a lot of the student helpers saying they didn’t talk to anyone etc etc but orientation is not like normal school life, so hopefully we will be ok stranger!",
      "author": null,
      "created": 1564109298,
      "upvotes": 2,
      "replies": {}
    },
    "euyvreb": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euyvreb/",
      "text": "[deleted]",
      "author": null,
      "created": 1564109141,
      "upvotes": 38,
      "replies": {
        "ewiozam": {
          "link": "/r/college/comments/chwi31/orientation_sucked/ewiozam/",
          "text": "Same here. I got sick as a dog during my first week and that really fucked up my ability to make friends, but by sophomore/junior year I actually found my clique.",
          "author": null,
          "created": 1565453863,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "euyusqt": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euyusqt/",
      "text": "Welcome to the real world.  It takes a long time to feel confident in your own skin.  That is part of what college is about.  If you are a sensitive person, you may have also been feeling everyone else's apprehension.  Just shake it off, tell yourself you are going to be fine and then carry on.",
      "author": "simonsays6464",
      "created": 1564108711,
      "upvotes": 12,
      "replies": {}
    },
    "euyug4u": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euyug4u/",
      "text": "I made one friend\n\nThe girl I was rooming with left and roomed with someone else \n\nIt wasn’t super fun but it wasn’t the worst.\n\nI’m glad you made friends but college classes aren’t going to have ice breakers and all that shit",
      "author": "Realistic_Pass",
      "created": 1564108555,
      "upvotes": 16,
      "replies": {}
    },
    "euytdw3": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euytdw3/",
      "text": "You're going to be okay!!\n\nI saw your post in one of the replies that you visited your first choice school, loved it, but ultimately couldn't afford it so you had to settle for where you are now. I was in this *exact* scenario last year and I can absolutely relate to how you feel. When I was at orientation all I could think of was how much better orientation and the people would have been at the other school. A year on and I can honestly say that I LOVE where I am. Ultimately I never spoke to the people I met at orientation again and that's okay and perfectly normal! Instead, I met the real friends that made my first year so great by joining tons of extracurriculars and forming study groups with people in my classes that I felt I could get along with. If this doesn't work, there is ZERO SHAME IN TRANSFERRING!!\n\nEither way, orientation is no way an indicator of how college will go, but if you make it to the end of this semester and feel the same way, consider transferring.",
      "author": "rllyuncomfy",
      "created": 1564108081,
      "upvotes": 7,
      "replies": {}
    },
    "euyr48u": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euyr48u/",
      "text": "> Is that just how orientation is? I want to believe that it is just kind of a facade and that real life college will actually be great, but that feeling is really sticking on to me.  \n  \nNope, you're totally correct. I felt the same way and was relieved to get to campus in the fall and find out that actual college life was nothing *at all* like orientation.",
      "author": "TrafficConeJesus",
      "created": 1564107074,
      "upvotes": 50,
      "replies": {}
    },
    "euyqtwi": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euyqtwi/",
      "text": "I am sorry that orientation wasn’t what you hoped it would be. My orientation is a hazy memory now (2014) but I remember I didn’t talk to a single person. I basically just signed up for classes and left. Definitely didn’t make a single friend there... I ended up having a fantastic experience! I wouldn’t let this color your perception of anything. I bet your feelings are a lot more common than you think. You’ll have many more chances to make friends when your classes start. Best of luck to you!",
      "author": "greenyoshis",
      "created": 1564106950,
      "upvotes": 40,
      "replies": {}
    },
    "euynxae": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euynxae/",
      "text": "Orientations kind of a farce, tbh. They do icebreakers with people you probably wont be friends with in a month and dont need ice broken with. I stayed even acquaintances with literally 1 person in my orientation group and thats because they lived on the same floor as me in my dorm.\n\nIts really not a time for making lasting friends, if thats what youre worried about. That comes during the real school year.",
      "author": "ScyllaGeek",
      "created": 1564105671,
      "upvotes": 660,
      "replies": {
        "euz8voj": {
          "link": "/r/college/comments/chwi31/orientation_sucked/euz8voj/",
          "text": "“That comes during the real school year.”\n\nWell fuck my freshman year",
          "author": "Basically_Zer0",
          "created": 1564115286,
          "upvotes": 204,
          "replies": {
            "euzba7j": {
              "link": "/r/college/comments/chwi31/orientation_sucked/euzba7j/",
              "text": "Me too. But now that I know what it’ll be like I should be able to make plenty more friends this time around",
              "author": "big_billford",
              "created": 1564116484,
              "upvotes": 51,
              "replies": {
                "euzchiq": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/euzchiq/",
                  "text": "I’m stressing over how much harder it’ll be since most everyone is already in established friend groups.",
                  "author": "Basically_Zer0",
                  "created": 1564117099,
                  "upvotes": 29,
                  "replies": {
                    "euzfhns": {
                      "link": "/r/college/comments/chwi31/orientation_sucked/euzfhns/",
                      "text": "Except all the incoming freshmen. :) Plus, most people aren’t opposed to talking to other students in class. Even if it’s a lecture, there’s still plenty of time to exchange a few words with the guys around you. \nAnother thing is that once you do find a friend, chances are they’ll invite you to hang out with their friend group, at least that’s what happened to me.",
                      "author": "big_billford",
                      "created": 1564118641,
                      "upvotes": 26,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "euzjzc9": {
              "link": "/r/college/comments/chwi31/orientation_sucked/euzjzc9/",
              "text": "[deleted]",
              "author": null,
              "created": 1564121065,
              "upvotes": 19,
              "replies": {
                "ev00ext": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/ev00ext/",
                  "text": "Look on the bright side, you got a cat! Cats are better than people and they happen to be a great topic for conversation if you’re feeling people out.",
                  "author": "DeathMyBride",
                  "created": 1564129690,
                  "upvotes": 20,
                  "replies": {}
                },
                "euzmabd": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/euzmabd/",
                  "text": "Hey, the ppl who kicked u out for being “too depressed” showed you their true colors. Cheer up dude, go talk to the school psychologist or therapist. This was a gain for u and a loss for them. :)",
                  "author": "bigdipper24",
                  "created": 1564122328,
                  "upvotes": 17,
                  "replies": {
                    "ev07qus": {
                      "link": "/r/college/comments/chwi31/orientation_sucked/ev07qus/",
                      "text": "I mean you can't really blame people for not wanting to be around someone who emits depression and self pity 100% of the time. If they tried helping him but it didn't work out, why should they keep around someone who makes everyone else feel awkward all the time. I have a friend like this, and the problem is that he always beats himself up about how nobody likes him and how depressed he is all the time, but I guess he doesn't realize that saying those things just makes people want to talk to him less. Not saying it's right, but it's the truth.",
                      "author": "TiVeL",
                      "created": 1564133302,
                      "upvotes": 16,
                      "replies": {
                        "ev0iiid": {
                          "link": "/r/college/comments/chwi31/orientation_sucked/ev0iiid/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1564139429,
                          "upvotes": 6,
                          "replies": {
                            "ev0uojp": {
                              "link": "/r/college/comments/chwi31/orientation_sucked/ev0uojp/",
                              "text": "Dude your user name is theanxiousantisocial. If you make that your identity, it's what you're going to be. It seems like your friends tried to help and didn't know what to do when you wouldn't take it, so they got frustrated and left you because it was too much to deal with.",
                              "author": "TiVeL",
                              "created": 1564146955,
                              "upvotes": 15,
                              "replies": {
                                "ev0v0fp": {
                                  "link": "/r/college/comments/chwi31/orientation_sucked/ev0v0fp/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1564147143,
                                  "upvotes": 5,
                                  "replies": {
                                    "ev0y45u": {
                                      "link": "/r/college/comments/chwi31/orientation_sucked/ev0y45u/",
                                      "text": "You said you weren't ready for therapy, but I don't know what other kind of help you could get that would be consistently useful or reliable. What kind of help do you look for in friends?",
                                      "author": "TiVeL",
                                      "created": 1564148836,
                                      "upvotes": 4,
                                      "replies": {
                                        "ev0ym5c": {
                                          "link": "/r/college/comments/chwi31/orientation_sucked/ev0ym5c/",
                                          "text": "[deleted]",
                                          "author": null,
                                          "created": 1564149096,
                                          "upvotes": -1,
                                          "replies": {
                                            "ev1nn6i": {
                                              "link": "/r/college/comments/chwi31/orientation_sucked/ev1nn6i/",
                                              "text": "You really should try again till you find a therapist you feel comfortable with. They can help you culture real relationships and help you gain confidence. At the end of the day it sounds like you need someone to just listen and validate you. What better person to listen than someone who literally makes it their job? Maybe you should try finding a good therapist before dismissing it as useless to you? Good luck in this journey",
                                              "author": "sshygurl",
                                              "created": 1564162012,
                                              "upvotes": 4,
                                              "replies": {}
                                            },
                                            "ev1737j": {
                                              "link": "/r/college/comments/chwi31/orientation_sucked/ev1737j/",
                                              "text": "You need to give therapy time to work. One session with the wrong therapist isnt going to do shit for you, and you cant just force a group of friends to become your therapists. Friends should support each other, but not have to deal with every issue that you face. Your old friends tried to support you, you wouldn't let them, so they left you.",
                                              "author": "xanfire1",
                                              "created": 1564153391,
                                              "upvotes": 5,
                                              "replies": {
                                                "ev18s37": {
                                                  "link": "/r/college/comments/chwi31/orientation_sucked/ev18s37/",
                                                  "text": "[deleted]",
                                                  "author": null,
                                                  "created": 1564154205,
                                                  "upvotes": 0,
                                                  "replies": {
                                                    "ev19qev": {
                                                      "link": "/r/college/comments/chwi31/orientation_sucked/ev19qev/",
                                                      "text": "Sounds like if they were trying to get you to see a therapist then you definitely are lying at least a little bit. Only the most supportive friends I've ever had have tried to get me to go see a therapist, but hey. It's your life, have a ball with your cat",
                                                      "author": "xanfire1",
                                                      "created": 1564154663,
                                                      "upvotes": 3,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "ev0i61z": {
                      "link": "/r/college/comments/chwi31/orientation_sucked/ev0i61z/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1564139238,
                      "upvotes": 2,
                      "replies": {
                        "ev1nk98": {
                          "link": "/r/college/comments/chwi31/orientation_sucked/ev1nk98/",
                          "text": "It takes time man, trust the process!",
                          "author": "bigdipper24",
                          "created": 1564161966,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ev1eom1": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/ev1eom1/",
                  "text": "If it makes you feel better, I only talk to one friend from freshman year (he was a high school friend). I have a ton of amazingly close friends now. I really recommend joining clubs to meet people",
                  "author": "turtlechef",
                  "created": 1564157005,
                  "upvotes": 4,
                  "replies": {}
                },
                "ev0025q": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/ev0025q/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1564129525,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "ev1ap18": {
          "link": "/r/college/comments/chwi31/orientation_sucked/ev1ap18/",
          "text": "Sounds contrary to all the stories of people going “I made a lot of friends during orientation and they stayed my friends forever!” Lol",
          "author": null,
          "created": 1564155121,
          "upvotes": 7,
          "replies": {
            "ev1tva7": {
              "link": "/r/college/comments/chwi31/orientation_sucked/ev1tva7/",
              "text": "Probably depends on the size of the school. I had more like u/ScyllaGeek's experience. I met some people at orientation, the school was enormous, I rarely if ever saw them again in the vast sea of people that was my school. Most of the people I actually became friends with were through my dorm, classes, extracurriculars, or mutual friends I'd met through those things.",
              "author": "greeneyedwench",
              "created": 1564165054,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "ev1yv1e": {
          "link": "/r/college/comments/chwi31/orientation_sucked/ev1yv1e/",
          "text": "I added over 15 people on Snapchat and talked to many more during my orientation and did not talk to anybody ever again except one girl at a party like a month into school",
          "author": "AlphaBoy06",
          "created": 1564167507,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "euynwth": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euynwth/",
      "text": "Honestly I felt the exact same during my orientation. I felt really alone and I cried on the phone to my mom I think on the first night. Orientation is just a weird vibe to begin with because they're throwing all these people who don't know each other together. Everyone is feeling the exact same stress and nerves that you might be feeling. I know for me the feeling of being an outsider went away gradually and I think you just need more time than orientation to really get to know people and get used to the school. Once everything new starts to settle I think you might feel less alone/ like an outsider",
      "author": "WHY_NOT_MOTHER",
      "created": 1564105666,
      "upvotes": 92,
      "replies": {
        "euyobcr": {
          "link": "/r/college/comments/chwi31/orientation_sucked/euyobcr/",
          "text": "I cried to my brother about it too and I felt like everyone else was so excited and loving it and it makes you feel like a complete outsider. Thank you so much that really helps a ton.",
          "author": null,
          "created": 1564105843,
          "upvotes": 30,
          "replies": {
            "euypmfh": {
              "link": "/r/college/comments/chwi31/orientation_sucked/euypmfh/",
              "text": "Yeah totally, that was the way I was feeling too like everyone is loving it why do I feel so out of it and stuff like that. If anything after I really got to know people during the semester it was reassuring to hear that they felt similar during orientation. It's very easy to feel alone just know someone is thinking along the same line as you. I really hope your experience there only goes up from here",
              "author": "WHY_NOT_MOTHER",
              "created": 1564106413,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "euynwg4": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euynwg4/",
      "text": "Lmao did I ghost write this",
      "author": "peterisfrosty1",
      "created": 1564105661,
      "upvotes": 187,
      "replies": {
        "euyopf2": {
          "link": "/r/college/comments/chwi31/orientation_sucked/euyopf2/",
          "text": "I felt so alone feeling like this so hello you’re my new best friend",
          "author": null,
          "created": 1564106015,
          "upvotes": 80,
          "replies": {
            "euyp4wt": {
              "link": "/r/college/comments/chwi31/orientation_sucked/euyp4wt/",
              "text": "Straight up, I had the WORST time at orientation. I went into it very optimistic and the vibes were horrible, I hated being herded around and told to sit and stay like a kindergartener, everything seemed fake, and the school felt wrong. I cried during the dinner hour and almost didn’t sign up for classes the next day. I felt like “what am I doing here?” I sincerely felt that I didn’t belong, and I still feel that way. I get a tight, anxious feeling in my chest when I think about the fact that I did end up signing up for classes. \n\nYou’re not alone!",
              "author": "peterisfrosty1",
              "created": 1564106205,
              "upvotes": 88,
              "replies": {
                "euz4afo": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/euz4afo/",
                  "text": "That definitely describes orientation. You guys will be fine - it is absolutely not an accurate representation of your school and peers. You're anxious which is normal. Don't let it eat you alive before your first day. Trust me it's so much different (in a very good way) once you become acclimated to your new environment :)",
                  "author": "not_its_father",
                  "created": 1564113066,
                  "upvotes": 39,
                  "replies": {
                    "ev3ixbe": {
                      "link": "/r/college/comments/chwi31/orientation_sucked/ev3ixbe/",
                      "text": "Today's my orientation and this really helped me a lot.. Thanks kind stranger",
                      "author": "Why_So_Seriou5",
                      "created": 1564195849,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "euypa1w": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/euypa1w/",
                  "text": "I sincerely hope that was just orientation itself. Good luck to both of us",
                  "author": null,
                  "created": 1564106269,
                  "upvotes": 11,
                  "replies": {}
                },
                "euz8h8x": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/euz8h8x/",
                  "text": "That's just homesickness bud. You'll get over it soon enough. It's a new environment, new people, new information, a new lifestyle. It takes time to adjust and get used to it. People generally start feeling comfortable in a new surrounding after 2-4 weeks. Happened to me in basic training, then it happened again in AIT, then it happened again when I came home, again for community college, again for the new apartment I moved into. I expect it'll happen again after I transfer to a 4-year. My advice: go distract yourself, go meet people, find something to do. Once you get settled into a routine, you'll think you were being ridiculous for feeling out of place.",
                  "author": "lmirise",
                  "created": 1564115086,
                  "upvotes": 22,
                  "replies": {
                    "euz93kc": {
                      "link": "/r/college/comments/chwi31/orientation_sucked/euz93kc/",
                      "text": "I mean, it’s not homesickness when I still live in my dream apartment with my boyfriend completely independent from everyone, but I could see how that might be the case for most other students especially if they live on campus. For me a lot of it was culture shock.",
                      "author": "peterisfrosty1",
                      "created": 1564115388,
                      "upvotes": 7,
                      "replies": {
                        "euz9yic": {
                          "link": "/r/college/comments/chwi31/orientation_sucked/euz9yic/",
                          "text": "Sorry, I default to assuming most people on this sub around this time are straight out of high school, and haven't experienced this kind of thing before. You should know the drill by now: it sucks because it's new, and the human brain doesn't like new. Still, I do hope you feel better, and I'm glad you've found a good apartment and a fulfilling relationship, congratulations!",
                          "author": "lmirise",
                          "created": 1564115820,
                          "upvotes": 10,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ev1cced": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/ev1cced/",
                  "text": "I started crying at my orientation, refused to leave my mom, and had a panic attack in the bathroom and had to redo the entire orientation another day. I think I win this round lol",
                  "author": null,
                  "created": 1564155908,
                  "upvotes": 3,
                  "replies": {}
                },
                "ev0q89p": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/ev0q89p/",
                  "text": "Ay me too! Then I transferred and skipped that orientation and now I feel much better about where I'm at. While it's not my dream school it's a much better fit for me than my old school. Wait it out for a month and if you still hate it look into transferring for spring semester.",
                  "author": "katkaturian",
                  "created": 1564144362,
                  "upvotes": 1,
                  "replies": {}
                },
                "ewe07u6": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/ewe07u6/",
                  "text": "I always feel like this going into to orientation and other similar events. I went to a residential summer camp for like two months and it was my first time being away from home and I legit cried so much the first two weeks and then accidentally made a friend. Idk it’s just hard until it’s not.",
                  "author": "marissasaba",
                  "created": 1565311481,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "ev1gdcp": {
              "link": "/r/college/comments/chwi31/orientation_sucked/ev1gdcp/",
              "text": "[deleted]",
              "author": null,
              "created": 1564157887,
              "upvotes": 1,
              "replies": {
                "ev1kydh": {
                  "link": "/r/college/comments/chwi31/orientation_sucked/ev1kydh/",
                  "text": "Me? UWM.",
                  "author": "peterisfrosty1",
                  "created": 1564160493,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "euynjo5": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euynjo5/",
      "text": "I had that same exact experience when I went to my orientation. Even though I made a few friends the school didn’t feel right for me. But for me it was never really a school I wanted to go to in the first place so when I felt that way at orientation it was kind of a confirmation of my feelings. I told my parents that I didn’t think it was the university for me and they supported my choice and instead I went to a community college instead. I still stand by my choice today because I wouldn’t have wanted to force myself to go to a university I hated because it would’ve ruined my entire college experience. Another reason I almost forced myself to go was because of the stigma (at least where I live) about going to a community college instead of a 4 year, but that shouldn’t be a deciding factor for where you go to school. Hope this helps",
      "author": "liventio",
      "created": 1564105508,
      "upvotes": 10,
      "replies": {
        "euyoj11": {
          "link": "/r/college/comments/chwi31/orientation_sucked/euyoj11/",
          "text": "Exactly. I’m in a bit of a different situation where I went to my top choice school for like a week visit, and it was the most amazing experience. I loved it. However, way to expensive for a independent independent student like me. So it felt like I had settled, just like you felt. If this semester doesn’t go good, I’ll definitely come back to your advice. Thank you it helps a ton",
          "author": null,
          "created": 1564105939,
          "upvotes": 5,
          "replies": {
            "euz952x": {
              "link": "/r/college/comments/chwi31/orientation_sucked/euz952x/",
              "text": "The one thing that most students seem to regret about college is taking out too much in loans. Your primary goal is to get an education, and it is good to not lose focus of that. If the school you are attending has your major, you will be fine. I have to disagree with people who encourage moving to a more expensive school. It's 4 years. Only 4. You'll be paying those loans back for years.",
              "author": null,
              "created": 1564115407,
              "upvotes": 5,
              "replies": {}
            },
            "euyp56s": {
              "link": "/r/college/comments/chwi31/orientation_sucked/euyp56s/",
              "text": "Glad I could help! I hope everything works out for you!",
              "author": "liventio",
              "created": 1564106208,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "euymrzi": {
      "link": "/r/college/comments/chwi31/orientation_sucked/euymrzi/",
      "text": "I could relate to this.... Don't really see how we can change anything at this point",
      "author": "UnluckyBrilliant-_-",
      "created": 1564105168,
      "upvotes": 1,
      "replies": {
        "euyomio": {
          "link": "/r/college/comments/chwi31/orientation_sucked/euyomio/",
          "text": "That’s exactly how it feels. At least if it persists we can always transfer by 2nd semester",
          "author": null,
          "created": 1564105980,
          "upvotes": 3,
          "replies": {}
        },
        "euz9mg0": {
          "link": "/r/college/comments/chwi31/orientation_sucked/euz9mg0/",
          "text": "Buck up, it'll be fine. What you're feeling now is just the mild panic attack your brain is going through trying to suddenly adjust to a new environment. It takes a bit for things to feel natural. There were logical reasons you went to this school instead of another one, what you're feeling now is just an emotional bout of homesickness, culture shock, and uncomfortability. 2-4 weeks, and you'll be fine, your brain will adjust and you'll feel just as comfortable as you used to back home. My advice would be to start some routines; the brain craves predictable patterns, and having a routine will make you feel better. It'll also naturally distract you, and lead you to meeting new people.",
          "author": "lmirise",
          "created": 1564115651,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634055337
}