{
  "sid": "f2u7h4",
  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/",
  "title:": "What’s the dumbest thing that university officials have done that affected you?",
  "text": "Mine was just this week when I informed my teachers that I would be missing my specific college’s job fair. Literally every single class I’m in had a “Job Fair Attendance” completion assignment. So I received a zero for all but one class for that assignment. The reason I missed the job fair was because I had an actual interview with an engineering firm in a different city. Left me extraordinarily annoyed. Got the job tho.",
  "author": "SpicedCokeAndRum",
  "created": 1581526623,
  "over_18": false,
  "upvotes": 1837,
  "upvote_ratio": 0.99,
  "comments": {
    "fk2xlb8": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fk2xlb8/",
      "text": "When I applied for graduation at  University (University of Alaska) I received 5 phone calls, 3 in one hour, all which gave me different information about if I could graduate or not. 1) no, you need another Art. 2) wait, we forgot the Art class from a different campus, yes. 3) no, you need another English. 4) yes, we forgot a transfer from your first Univ. 5) yes, and you can drop one of your English classes you are in now. \n  \nTHEN my capstone Prof refused to meet w me in person because everyone else was off island and couldn't face to face. And he couldn't firm a coherent email so all our correspondence was confusing. (I was working a full time job at the time, 8-4.30, and he refused to talk on the phone outside of 2x 3 hour long office hours.) When I presented my final project he got up and left in the middle of it. \nI graduated, walked, shook his hand and said thanks for helping me through it. And was notified 48 hours post graduation that he had failed my final project. \n\nTLDR: Univ of Alaska sucks. I have project PTSD now. And this is just for my bachelor's. My Masters story is just as bad. \nGo WGU!!  Its a good school!",
      "author": "BaschaW",
      "created": 1583811647,
      "upvotes": 1,
      "replies": {}
    },
    "fiu6e9o": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fiu6e9o/",
      "text": "Called the police to have me locked up for 6 days for considering self harm under the stresses of collage. Got out to find out the counselor had not even told my professors and had dropped me out of my C programming class. A week before exams and I get a W for the class after all my work. Had to take again.",
      "author": "CannabisLupus",
      "created": 1582735926,
      "upvotes": 1,
      "replies": {}
    },
    "fis8sme": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fis8sme/",
      "text": "Going into my last semester of college, my wife and I got married. Our small Christian school historically had housing specifically for married couples. We inquired about this, only to be informed that married couples were no longer permitted to live on campus. \n\nThis change came as a part of our school’s religious Title IX exemption, which gave them the right to discriminate based on sexuality, gender (read: transgender), and marital status (read: gay marriage). They decided to end housing for all married people so they wouldn’t have to deal with the difference between straight married couples and gay married couples. \n\nThis forced us to move off campus and manage a dire financial situation in our first married months because my wife was student teaching and couldn’t work. I worked two, sometimes three jobs and we somehow scraped by. We still love our alma mater but we definitely won’t forget when they put bigotry over their students.",
      "author": "3HSgZ0IOG3GSZ",
      "created": 1582680206,
      "upvotes": 1,
      "replies": {}
    },
    "fiorkgz": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fiorkgz/",
      "text": "Not proessing my AA from the local community college and having to spend 4 semesters taking my humanities classes again.",
      "author": "omgitscheeseomg",
      "created": 1582589332,
      "upvotes": 1,
      "replies": {}
    },
    "fimpn95": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fimpn95/",
      "text": "At my community college, my Spanish professor was horrible. She taught us nothing and was cruel. However, I needed 2 semesters of a language to graduate. I knew I wouldn’t be prepared for Level 2 Spanish, which you basically needed to be fluent to take. I asked my advisor “Can I switch to taking Italian 101 the second semester and have that count as two semesters?” “Oh of course.”\n\nIt was a lie. You needed two semesters of the same language to graduate. So, I had to take an extra semester to finish my language requirement.",
      "author": "madammayorislove",
      "created": 1582541679,
      "upvotes": 1,
      "replies": {}
    },
    "fi6241c": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fi6241c/",
      "text": "My advisor told me to take a class I didn't need. I asked a million times if I really needed it, a million times she said yes. A year later I realized I'm missing one class because I took an EXTRA class I didn't need. It was that class the advisor said I needed.\n\n\nFought tooth and nail for a whole semester until I got a full refund and took the missing class for free. Still graduated a semester late.",
      "author": "shitheadboot1122",
      "created": 1582176540,
      "upvotes": 1,
      "replies": {}
    },
    "fhy7pri": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhy7pri/",
      "text": "i was told by a faculty member that i couldn’t march at a game because i had fake nails. so i did what she said, didn’t attend the game because of my nails, and the following week, they kicked me out of marching band for not attending the game.",
      "author": "nikespike",
      "created": 1581970337,
      "upvotes": 1,
      "replies": {}
    },
    "fhy7jr3": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhy7jr3/",
      "text": "I met with my advisory multiple times per semester to check that I was on track to graduate on time. He assured me many times that I was \"right on track\". I even have email proof where we talked about it. He ended up leaving for another University and when I spoke with my new advisory he told me that I was going to have to stay a minimum of 2 years extra to complete my major. So I definitely do NOT trust what they say and make sure you check everything yourself. It has been a shit show for sure.",
      "author": null,
      "created": 1581970237,
      "upvotes": 1,
      "replies": {}
    },
    "fhic5nu": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhic5nu/",
      "text": "Back when I was in community college, I almost got screwed out of graduating on time. I had been going for the AS in Liberal Arts, to which a first year adviser told me it needed 3 credits/1 class. I went ahead and took said course, then thought nothing of it. When I applied to graduate, they said that I still had one more math course left. Turns out that I needed 6 credits and the adviser had told me the wrong thing. Luckily, another adviser (not a first year) tried to help me out and tried to bypass that requirement. After getting yelled at by financial aid for trying to bypass said requirement, the adviser switched my major to General Ed and all of the language proficiency classes I had taken just for the Liberal Arts requirements went to waste.",
      "author": "NootFlix",
      "created": 1581621886,
      "upvotes": 1,
      "replies": {}
    },
    "fhhwodt": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhwodt/",
      "text": "TL;DR STEM schools and Liberal Arts colleges do not merge well...\n\nSo, I use to attend a smaller, predominantly STEM focused university. The powers that be decided to merge my university with a much larger Liberal Arts college in my state for \"reasons\". This move literally destroyed our campus culture. Our small campus life and traditions that had been around for decades were abolished with the stroke of a pen and my school hasn't been the same since, especially after they, from my vantage point, decided to relocate the entirety of the social scene to the larger campus. Our small campus is practically a graveyard now...\n\nGone are the days where you could just decide to test your project designs; now you must navigate the, seemingly, endless amount of red tape and bureaucratic BS, just to be told, you can't do it, for \"reasons\". Doing anything just about requires advance planning weeks prior for the simplest of events, including scholarly ones. Spontaneity is quite dead, and the innovative spark that you would assume those in power would seek to engender has been all but stamped out. \n\nGreek life, which may have been problematic at some universities, was quite tame. We had our issues with the administration prior to the merger, which Greek organization didn't? However, we had our own roles to play. The Greeks were instrumental in continuing the traditions of our smaller school, it was a responsibility that, while unspoken, was faithfully executed. Now, we are at war with an unsympathetic administration that seem just as keen on eradicating Greek culture, in its entirety, just as they did on our small campus.\n\nIt has honestly been frustrating, if that hasn't been obvious, but I cannot envision myself graduating from this institution, except, perhaps out of spite. Those who succeed after university sometimes donate to their alma mater, I cannot see those who graduated after the merger being all too sympathetic decades from now.",
      "author": "lain_h",
      "created": 1581613230,
      "upvotes": 5,
      "replies": {}
    },
    "fhhwg9p": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhwg9p/",
      "text": "Not ensuring the school keep up maintenance of the campus's very few handicapped- accessible doors. Their ADA compliance is scraping the bare minimum at best. Only one dorm on campus is actually equipped to be handicapped accessible and half of the time, the main elevator of that dorm is broken.\nMy disability left me with a crippled arm- I only have one functioning arm so if I'm carrying something, I'm constantly running late to classes and events because I have trouble opening doors and often have to wait for someone to come along and open it. I spilled coffee all over myself trying to open a door with a full hand and now I'll have scars from the resulting scalding and heat rash.\nIf it is this bad for me, I cant imagine how horrible it is for someone on crutches or a wheelchair.",
      "author": "Nat_Log3982",
      "created": 1581613105,
      "upvotes": 1,
      "replies": {
        "fkaawc1": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fkaawc1/",
          "text": " Can't you sue for that?",
          "author": "Jirrarh",
          "created": 1583999546,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fhhw2i1": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhw2i1/",
      "text": "There was a group fight in my class and I was a bystander who just happened to get injured during it. School officials interrogated everybody but couldn't get the story straight so they just gave everybody strike one and some charges to pay including me. There were 13 people in this.",
      "author": "taeoh666",
      "created": 1581612890,
      "upvotes": 3,
      "replies": {}
    },
    "fhhlcy2": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhlcy2/",
      "text": "During my last week of undergrad, after being approved for graduation by my advisor and having a job set up, my dean called me into his office and told me I wouldn’t be allowed to graduate because I hadn’t met all the qualifications.",
      "author": "luckyjack2000",
      "created": 1581606760,
      "upvotes": 2,
      "replies": {}
    },
    "fhhlb0j": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhlb0j/",
      "text": "Not me, but my best friend. Graduated from a major state university with a STEM degree after the fall semester. Shortly thereafter gets a job in a lab at the same university in the same field while he looks at, applies to, and waits to enter grad school the next fall. The background check could not verify that he had graduated with his Bachelor’s and told the potential job that. So cue my friend running around trying to get some sort of official document stating he graduated from the very same university he was trying to apply to a job at. “Diplomas won’t be sent out for a few months, here’s a preliminary transcript, etc.” None of it was good enough for the woman at the background check company. After delaying starting a job (and making an income) for probably 8 weeks longer than planned, he finally got some sort of official letter with a seal on it that stated he graduated. Why a job at the university required getting this extremely simple piece of information through a third party instead of just going through their own channels, I will never know.",
      "author": "IAMYourFatherAMAA",
      "created": 1581606728,
      "upvotes": 2,
      "replies": {}
    },
    "fhhiadg": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhiadg/",
      "text": "They raised parking prices by 150% and we now have the second highest parking rates for a college in the United states",
      "author": "ancientrelics",
      "created": 1581604840,
      "upvotes": 1,
      "replies": {}
    },
    "fhhhqm6": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhhqm6/",
      "text": "My admissions advisors convinced me term after term to withdraw more loans. When 1 maxed out they would set me up with another. I now owe 3 different lenders $40k each and have a BFA in Visual Effects to show for it. I’m now an entry level data analyst and don’t use my six-figure degree. I pay $1,000+ per month in loans.",
      "author": "SirBraaapAlot",
      "created": 1581604484,
      "upvotes": 1,
      "replies": {}
    },
    "fhhc9nf": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhc9nf/",
      "text": "I was taking a final and my professor never showed up and some other random professor showed up who had no idea at all about accounting. She was no help at all for clarifying questions or anything.\n\nI emailed the Dean later that day and all the Dean said was, “Keep your professor in your thoughts because she is sick. I hope you did well on your exam.”\n\nI was infuriated with the whole interaction and the class",
      "author": "ImAlex_ImReallyCool",
      "created": 1581600602,
      "upvotes": 1,
      "replies": {}
    },
    "fhhbzb2": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhbzb2/",
      "text": "Apparently I got accepted to the school but I was never notified. I never received an acceptance nor rejection letter. My online portal didn't say anything. \n\nYes, I did call the school. No one really answered and they would always at times I absolutely couldn't answer. They never responded to my emails.",
      "author": "phantom9088",
      "created": 1581600384,
      "upvotes": 1,
      "replies": {}
    },
    "fhharf8": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhharf8/",
      "text": "I once missed an important lecture where a test took place to attend my nan's funeral. When I explained the reason why I'd be missing the test, they asked me to bring the funeral booklet as evidence, which I refused. Took the test again and got the minimum grade, the highest you can score. Ludicrous behaviour.\n\nAlso got called in a plagiarism meeting to discuss the comic book (creative writing degree) I'd submitted, where the only copy I'd included were famous quotes. Waited three weeks and as I waited to enter a room with six people in suits, somebody came out and apologised before sending me on my way.",
      "author": "WriterDudee",
      "created": 1581599427,
      "upvotes": 1,
      "replies": {}
    },
    "fhhaomj": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhaomj/",
      "text": "cut my teams scholarships and p much destroyed team morale. i miss my freshman year team and now half of them are gone because the drama is really intense because the uni keeps sticking their hands in it. \n\nblah.",
      "author": "hub_batch",
      "created": 1581599366,
      "upvotes": 1,
      "replies": {}
    },
    "fhh9vf5": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhh9vf5/",
      "text": "Closing our library until 2024. They found asbestos so at first they were just gonna take it put this semester but then decided they wanted to do a full renovation. It's pretty much the only building with study spaces and they've barely added any more. The temporary library is an asbestos-filled building that was supposed to begin construction this semester.",
      "author": "dontlikemangoes",
      "created": 1581598682,
      "upvotes": 1,
      "replies": {}
    },
    "fhh0ajm": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhh0ajm/",
      "text": "By waiting until the day before move in to delay it because of a incoming hurricane.\n\nI used to live about 11 hours away from my college and I come from a low income family so I would fly in for the semester every year to get settled in. However I had to fly in a day early because none of the other flights would get me there on time. Well I am boarding my second flight after a layover and I check my phone before I turn it off only to be greeted with a text telling me move has been canceled until the tropical storm (at the time) had passed. Of course it later turned into a hurricane so move in needed to be delayed anyway but the issue was they waited until LATE in the day the day before move in to say don’t come (most people who were coming from out of town were already there).",
      "author": "Mindqueen95",
      "created": 1581587625,
      "upvotes": 1,
      "replies": {}
    },
    "fhgzah1": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgzah1/",
      "text": "LITERALLY ME, RIGHT NOW.\n\nLast semester, I wanted to take a class at my old CC because it was supposedly the teacher's last semester teaching, but I dropped it same week (prior to drop-payment deadline) because I don't go to school there anymore and needed to make room for my actual classes. I guess something happened on their end where it didn't actually drop, so I still owe them.\n\nSo they're trying to bill me for a class I didn't take and couldn't take.\n\nThey gave me the petition form, I filled it out and even provided a copy of my course schedule from my primary institution and the screenshot from the Google search I made saying \"College College drop class.\"\n\nMy petition was just rejected this week, meaning I now have to pay for this class. I'm beyond angry, I've already been having a shitty year so far between getting fired and other shit that's going on, and I refuse to pay for a class I didn't take.\n\nI actually came to this sub right now to post about it, too.",
      "author": "musiclovermina",
      "created": 1581586201,
      "upvotes": 1,
      "replies": {}
    },
    "fhgxirb": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgxirb/",
      "text": "I needed a form stating that I completed all of my coursework and only had my final thesis left to do so I could properly job hunt (I'm self-funded). Sent countless emails to various persons who kept recommending each other as the right person to send an email to; no one felt responsible. \n\nSomeone pointed out to use the self-service online thing which gives you a document listing all completed coursework, on the top saying in bold letters \"MAY NOT BE USED AS OFFICIAL DOCUMENT, FOR STUDENT INFORMATION PURPOSES ONLY\". \n\nI used that together with a printout of one email stating that although they could clearly see I did every course and had only one thesis left, they could not give me a document saying exactly that. Worked. \n\nBeautiful, bureaucratic Germany.",
      "author": "kimjalina",
      "created": 1581583704,
      "upvotes": 1,
      "replies": {}
    },
    "fhgx944": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgx944/",
      "text": "This week. Normally, when writing a dissertation,  you can work for the university at .75FTE (i.e. 75% of a full time job), equivalent to 30 hours per week (theoretically it's 30 hrs... but that's a different tangent on how instructors get fucked over) .  \n.75FTE is the minimum amount you can work if you want your student loan payments to count toward the 120 payments required for the federal loan forgiveness program.  So YAY! I'm on track to not have to use social security checks to pay off student loans!\nRecently, the provost decided we couldn't be employed at .75FTE, so the department just hired us at .74FTE.   No big deal, right? Wrong. Now I have an additional year of $500 student loan payments. \n\nTLDR: big bosses decided I should work 24 fewer minutes per week. Will cost me $6,000",
      "author": "papayankeetango",
      "created": 1581583324,
      "upvotes": 1,
      "replies": {}
    },
    "fhgwmb3": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgwmb3/",
      "text": "I was told it was a two year wait list to get into the program I wanted, so I moved to a completely different city to take it at a different school. Then when I was talking to my friend they said their girlfriend got into the program and didn’t have any problems. She had no idea there was even a wait list",
      "author": "nrvsnss_",
      "created": 1581582446,
      "upvotes": 1,
      "replies": {}
    },
    "fhgvd0t": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgvd0t/",
      "text": "Through a mixup between my term GPA and my overall GPA, I nearly lost my very good scholarship.  It ruined my Christmas, and only got rectified when I emailed the president of the school begging him for help or I wouldnt be able to return to school.  I heard back from the scholarship office a few days later.\n\nI'm also perpetually being fucked over by my student worker office due to me switching jobs.  It's taken a month to figure out my first job never got terminated, to get it terminated, and to get my new job put into the system.  And even though I keep checking to make sure things are in order and I am assured that they are, something is always out of sorts.  I'm so tired of it.",
      "author": "kiwibird_99",
      "created": 1581580782,
      "upvotes": 1,
      "replies": {}
    },
    "fhgtfsu": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgtfsu/",
      "text": "I needed three classes to graduate. Two of them only had one of each class going that semester, and they were on the same days at the same time.\n\nI informed the whoever’s office and they told me I’d have to take one of them the next time it’s offered. Those classes were only offered every other Spring semester, so I’d have to wait TWO YEARS to take the one last class for my degree requirement.\n\nThat was like 12 years ago and I still need 3 classes to graduate.",
      "author": "mrbrown1980",
      "created": 1581578400,
      "upvotes": 2,
      "replies": {}
    },
    "fhgsdtj": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgsdtj/",
      "text": "Falsely refused by graduation paperwork just before graduation. After the dean had already left for the holidays. :/ I was almost refused from walking at the ceremony.",
      "author": "Ryugi",
      "created": 1581577190,
      "upvotes": 1,
      "replies": {}
    },
    "fhgrgy3": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgrgy3/",
      "text": "Mostly its just some incompetence at my school and in my residence complex. Namely our hot water has been broken for two weeks and wont be fixed for another 3 (my building is new). We have had an accumulative total of 20 fire alarms since the start of the school year but only one fire. The sad part of that is all those alarms have happened at 2 am and mainly constituted people pulling the alarms and running away(also my residence building is 20 stories tall). The admin thought it would be a great idea after 17 of the alarms to put dye in the pull stations but refuse to do anything else but put up posters that say \" Don't pull the fire alarm, make a meme instead\".",
      "author": "BoredEngineer15",
      "created": 1581576180,
      "upvotes": 2,
      "replies": {}
    },
    "fhgreoe": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgreoe/",
      "text": "This just happened last week. On Wednesday I told my calculus teacher that I'd be missing class on Friday because I had to go to court over a ticket (I got my case dismissed) and I asked if I could get the in-class assignment for that day. I was told that being in court was not a valid reason to miss class so I had to take a zero on the assignment. Well Monday rolls around and I ask my friend what the assignment was, so he tells me that it was a worksheet and that our teacher wasn't even in class that day. She was too hungover to teacher Friday, so she left the assignment with another teacher to hand out then class was dismissed. So I was given a zero for having a valid reason for not showing up but she wasn't even there in the first place",
      "author": "matt_wright2001",
      "created": 1581576113,
      "upvotes": 1,
      "replies": {}
    },
    "fhgr5qj": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgr5qj/",
      "text": "I had a \"professor\" who didn't have a college degree \"teaching\" failed 98% of all students",
      "author": "Dusty246",
      "created": 1581575850,
      "upvotes": 4,
      "replies": {}
    },
    "fhgocai": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgocai/",
      "text": "Literally just today, I went to the Financial Aid office to see about a student loan check I signed a month ago. Turns out the lady that was there a month ago that gave me the check to sign just put it right back in the folder where it was before, instead of having it processed for deposit. The funds I need to pay the bills were in limbo for no reason at all.\n\nHad I not been proactive about this, I probably would have been on the street before graduation.",
      "author": "cruisetheblues",
      "created": 1581573042,
      "upvotes": 1,
      "replies": {}
    },
    "fhglov3": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhglov3/",
      "text": "I got screwed out of graduating on time. \n\nI found out that I missed one class I was supposed to take this semester. When I handed in my graduation application I asked to see an advisor just to make sure I was good. The receptionist said I didn't need an advisor. So I didn't get one and found out way too late in the semester I was missing one class. Now I'll have to wait longer to graduate.",
      "author": "britcop1212",
      "created": 1581570676,
      "upvotes": 2,
      "replies": {}
    },
    "fhgj45t": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgj45t/",
      "text": "Mine was the opposite. Engineering department head, conveniently my teacher, wouldn't let me skip class for the career fair. Even scheduled 2 quizzes so people wouldn't skip. I still did skip because I care more about a job than I do an A.",
      "author": "gbeegz",
      "created": 1581568533,
      "upvotes": 1,
      "replies": {}
    },
    "fhgdiuw": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgdiuw/",
      "text": "Require 6 credits of computer science.\nAs a freshman the intro course that was 3 credits didn’t count towards the 6 credits.\nThis year they changed it so that now the intro course counts towards the 6 credits and that screwed everyone who took the intro course before this year.",
      "author": "GlitteringBeyond1",
      "created": 1581564383,
      "upvotes": 2,
      "replies": {}
    },
    "fhgb356": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgb356/",
      "text": "I went to a community college that had notoriously limited parking at one of it's campuses. So they petitioned the students for a year about raising tuition to pay for a dedicated parking garage for students!\n\nEveryone commuted and were all for it. We got it, it'd be a bit more a semester (like $50 nothing super crazy).\n\nThen they built this fucker and the first 4 (of 6) floors were teacher parking only. I drove every day and not once was there anyone parked on the 3rd or 4th levels meanwhile levels 5 and 6 were always full. People were pissed.",
      "author": "General_Lee_Wright",
      "created": 1581562719,
      "upvotes": 9,
      "replies": {}
    },
    "fhgaqef": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgaqef/",
      "text": "I had to fill out forms to do a retroactive withdrawal after a suicide attempt and part of that was meeting with a counselor in the school health center. She asked why I stopped midway and I told her I thought my dad would be mad they’d have to pay to rip up the carpeting. She told me my suicide attempt wasn’t serious and that if I really was “sick” I should’ve gone through with it.",
      "author": "M_Rose52",
      "created": 1581562486,
      "upvotes": 11,
      "replies": {}
    },
    "fhg754n": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg754n/",
      "text": "[removed]",
      "author": null,
      "created": 1581560120,
      "upvotes": 17,
      "replies": {
        "fhgp5y1": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgp5y1/",
          "text": "“Okay officer, I’ll make sure I don’t leave anything for you to steal” \n\n😒 asshole",
          "author": "Slothfulness69",
          "created": 1581573816,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "fhg72n3": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg72n3/",
      "text": "The grad students at my uni rn are striking.\nOur chancellor and president make a million dollars when you combine their income, not to mention their housing stipends because they dont want to like in their houses that we have for them on campus.\nThe administration keeps sending some pretty threatening emails to the International grad students, the city police (and police all the way from San Francisco), have riot gear and have been threatening to tear gass students. They are peacefully protesting about having a cost of living adjustment (COLA).\nThey have been passive since last fall, this quarter they upped their gamble ans have not been T.A-ing their classes since Monday.",
      "author": "P_poperah",
      "created": 1581560078,
      "upvotes": 14,
      "replies": {
        "fhgp2vn": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgp2vn/",
          "text": "It’s funny they think SFPD is gonna do anything. They don’t even arrest people shooting up fucking heroin in broad daylight. One time I was in the city and some homeless lady got up in a cop’s face yelling about “I don’t feel protected! ACAB!” And the dude did nothing. Didn’t even acknowledge her. They’re literally useless, like they’re just there so SF can say they have a police department.",
          "author": "Slothfulness69",
          "created": 1581573734,
          "upvotes": 6,
          "replies": {
            "fhgqut8": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgqut8/",
              "text": "Well today about 17 people got arrested, a few were injured. You can follow what's happening at cola4all, and paymoreucsc on IG",
              "author": "P_poperah",
              "created": 1581575526,
              "upvotes": 3,
              "replies": {
                "fhgr4qd": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgr4qd/",
                  "text": "Oh yeah, I’m not trying to make light of the situation. I don’t doubt that Santa Cruz PD is actually capable of hurting people for no good reason, I just thought it was funny they tried intimidating the people on strike with SFPD. That’s like the opposite of a threat lol. \n\nBut yeah I heard Berkeley is also having a similar strike. Good for all of y’all, honestly, demanding fair pay.",
                  "author": "Slothfulness69",
                  "created": 1581575820,
                  "upvotes": 6,
                  "replies": {
                    "fhgrahr": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgrahr/",
                      "text": "It's been a wild week",
                      "author": "P_poperah",
                      "created": 1581575989,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fhg5xng": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg5xng/",
      "text": "Spent weeks in a back and forth trying to get graduate credit for an independent study I'd enrolled in without double checking. Fully admitted my mistake (could only accrue a certain number of graduate credit hours for independent studies) but was told the independent study might be approved, given certain paperwork. Back and forth turned into weeks. I wasn't sure when I'd be able to make the hours up, and was dreading adding onto my already full schedules. Eventually I realized that a random course I was already in was cross-listed.... Meaning it could've been counted for graduate credit the whole time. A fact no one in this process realized before me. And definitely not before I'd been charged for the independent study.",
      "author": "357847",
      "created": 1581559342,
      "upvotes": 2,
      "replies": {}
    },
    "fhg5pkd": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg5pkd/",
      "text": "They put me on the wrong catalog year. I went to college my senior year of HS as an \"Early Admit\" in 2016 and was assured that my catalog year would be 2016. I even double checked this when I had to declare a concentration my junior year. But guess what? I graduated on the 2017 catalog year. This mistake caused me to take 18 hours during my last semester because a 2017 requirement became an elective for 2018. I guess if I'd paid attention to the curriculum for 2017 *specifically*, instead of the latest curriculum, I'd have known not to register for so many classes, but still...",
      "author": "Reflexive-Honesty",
      "created": 1581559192,
      "upvotes": 5,
      "replies": {}
    },
    "fhg5p8z": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg5p8z/",
      "text": "Asked for a homework question to be explained better on a Facebook group that my teacher just happened to be a part of . So they failed me the whole class and made me pay over 1k more to take it , not only that but kicking me out of morning classes and making go to nights pushing my graduation back months. All over a homework question that I already had the answer too, I was asking for more explanation.",
      "author": "Dantal1on",
      "created": 1581559186,
      "upvotes": 5,
      "replies": {}
    },
    "fhfz1z8": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfz1z8/",
      "text": "Big brain \"go-to job fair to get a job\" *gets job* teacher, *fat 0*",
      "author": "TheDarkSwann",
      "created": 1581554720,
      "upvotes": 1,
      "replies": {}
    },
    "fhfyvaw": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfyvaw/",
      "text": "[deleted]",
      "author": null,
      "created": 1581554592,
      "upvotes": 0,
      "replies": {}
    },
    "fhfvyaf": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfvyaf/",
      "text": "Nearly was not allowed to attend my study abroad program. I had already been accepted and had paid for everything a few months out. A month before I was supposed to leave, I got an email from the program director saying she was rescinding the acceptance because I had not sent a letter of referral from my academic advisor. I forwarded the email the academic advisor had sent me confirming that she had forwarded my recommendation, but it turns out she had sent a recommendation for another student instead. When I asked them why they accepted me and cashed the check if they were missing application materials, they said it was it was an “understandable oversight” but that there was no more room in the program for me, and that it would take 3-6 months to refund my money. When I told them that was theft and that I’d be filing a police report, they somehow magically “found accommodations” for me and offered the spot again. The kicker is all 3 parties (the academic advisor, the program director and accounts receivable) worked for the same university but would NOT speak to each other. I had to coordinate between them.",
      "author": "but_who_is_she",
      "created": 1581552581,
      "upvotes": 32,
      "replies": {}
    },
    "fhfvg3f": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfvg3f/",
      "text": "During the summer, the university issued a new traffic rule. They said  that “if you park in the opposite direction of the other cars it will be an automatic ticket” so regardless of what kind of parking spots you are in: diagonal, parallel , or the standard spots and you park in any direction that isn’t what the majority is you’re getting a ticket. The school was hot. People complained and the university dropped the new rule.",
      "author": "ellen_water-melanin",
      "created": 1581552240,
      "upvotes": 13,
      "replies": {
        "fhgjyt2": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgjyt2/",
          "text": "So like, no backing into spaces if everyone else had pulled in normally?",
          "author": "growinwithweeds",
          "created": 1581569231,
          "upvotes": 5,
          "replies": {
            "fhgkjl1": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgkjl1/",
              "text": "Correct.",
              "author": "ellen_water-melanin",
              "created": 1581569703,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fjv0yj5": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fjv0yj5/",
          "text": "Did they ever give any reasoning for that rule?",
          "author": "IaniteThePirate",
          "created": 1583622146,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fhfujce": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfujce/",
      "text": "Not a school official (I’m at community college right now) but my sociology professor is making us volunteer at least 3 hours somewhere for a project worth the equivalent of a test. \n\nI work/go to school full time and dedicate my weekends to household chores I neglected during the week and do homework. The only courses on this campus so far that understands students have actual jobs are my business classes and my English 101 class. I’m working very hard to maintain my low A to make up for past poor grades and it’s frustrating that I may have to take a day off of work and lose pay just to complete assignments. \n\nMy dad who’s gone back to school (WSU) and he’s facing the same issues with professors.",
      "author": "JDMOokami21",
      "created": 1581551626,
      "upvotes": 4,
      "replies": {
        "fhgng9r": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgng9r/",
          "text": "3 hours a week or 3 hours a single time? If the former, and it wasn't in the syllabus, complain. If the latter, then tbh 3 hours volunteering is a lot less time than studying for a test (although this should also have been in the syllabus).",
          "author": "era626",
          "created": 1581572233,
          "upvotes": 6,
          "replies": {
            "fhgqmzq": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgqmzq/",
              "text": "Just three hours total. I honestly think I got it confused with an extra credit assignment that’s almost identical. I think I’ll still make a complaint in the course evaluation. I may have to take some time off of work just to be able to do the assignment. She’s also having us do a lot of extra stuff to include in this project just to “prove” we’ve actually done the volunteer work such as taking pictures of ourselves working and obtaining a letter of our hours or certified timesheets signed by the supervisor on duty. It’s really not ideal for working students and I don’t like that my grade could suffer because I work.",
              "author": "JDMOokami21",
              "created": 1581575301,
              "upvotes": 2,
              "replies": {
                "fhh9dbx": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhh9dbx/",
                  "text": "So you’ve got a whole semester to volunteer for a total of 3 hours?",
                  "author": "SolidTotoro",
                  "created": 1581598250,
                  "upvotes": 1,
                  "replies": {
                    "fhhoej3": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhoej3/",
                      "text": "I’m on a quarter system. My quarter ends in the middle of March",
                      "author": "JDMOokami21",
                      "created": 1581608540,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "fhhbtu3": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhbtu3/",
                  "text": "Do you normally not have time for your homework? 3 hours is a very small amount of time to spend  I worked part time during undergrad, too.",
                  "author": "era626",
                  "created": 1581600267,
                  "upvotes": 1,
                  "replies": {
                    "fhhp2gn": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhp2gn/",
                      "text": "I don’t normally have a lot of time. I work from 8-5 M-F and usually in class 5:30-7:40 M-TH. It varies. I might have some times in the evenings to do homework but usually not a lot. The problem I’m facing is I can work some things around and do some volunteering on the weekend but I’m running into some problems with the organizations available are either pretty far of a drive and/or accept volunteers in the evening usually during the week. Others have availability during my work hours.",
                      "author": "JDMOokami21",
                      "created": 1581608914,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fhftxcm": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhftxcm/",
      "text": "Someone in my dorm smeared poop on the walls of a bathroom. They Resident Director decide to take away all the toilet paper in the bathrooms for a week as punishment. Not sure why they thought that was a good plan because we also had a curfew and we got in trouble if we were out later than 12am. Many late night runs to over bathrooms to take a piss or shit trying to avoid security. Dumbest punishment ever. Just made everyone mad it lasted three days and then they figured out who it was and punished them. So stupid.",
      "author": "Hiddenbear515",
      "created": 1581551217,
      "upvotes": 15,
      "replies": {}
    },
    "fhftflz": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhftflz/",
      "text": "Our university system's president gave himself a 40% pay raise.",
      "author": "_34_",
      "created": 1581550891,
      "upvotes": 31,
      "replies": {}
    },
    "fhfsasb": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfsasb/",
      "text": "After applying to a certain state school, I requested a form that allowed access to the gym if I filled it out. I wasn’t interested in the school anymore so I never accepted the application fee or that other form.\n\n\nMonths later I receive a call that I owe $250 because I was being charged for that specific gym use form.\n\nThe initial charge was $170 and I was charged $250 after a late fee.\n\nyou get charged for even requesting a form and not filling it out wtf?",
      "author": "joelhamptn",
      "created": 1581550136,
      "upvotes": 23,
      "replies": {}
    },
    "fhfsard": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfsard/",
      "text": "For my entrance exams to see if I needed remedial classes, my grade for writing was flipped. I had a passing grade that would've been put me straight into a college literature class.\n\nIt wasn't pointed out to me until after our first exam, I did very well and that made my professor curious as to why I was in the remedial class. I could no longer drop the class so money down the drain.",
      "author": "ileeny12",
      "created": 1581550135,
      "upvotes": 11,
      "replies": {}
    },
    "fhfrr2k": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrr2k/",
      "text": "During the Thomas fire, it was finals week at my university. They refused to cancel finals until near the end of finals week. So, all week long everyone is sitting inside while the fire comes ever closer to campus and we cannot leave because we would fail our classes. Not to mention all the people with asthma and other lung related illnesses just skipped town and said fuck it because they'd rather live than pass their classes.\n\nAs I was taking finals everyone was wearing the N95 masks to block particulates as there was visible ash in the air as well as accumulation on tables and chairs in classrooms. Oh yeah, student health ran out of surgical masks and the nearby stores like Costco also ran out of the N95 masks so most people by the end were just using scarves to cover their mouths and noses. Some professors had their homes burn down and they still were there to administer finals too.",
      "author": "imushmellow",
      "created": 1581549779,
      "upvotes": 42,
      "replies": {
        "fhfyuhr": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfyuhr/",
          "text": "All I can picture is the school officials saying \"Everything is fine\" while surrounded by fire.",
          "author": "PastelPeaches",
          "created": 1581554576,
          "upvotes": 35,
          "replies": {}
        },
        "fhgkklx": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgkklx/",
          "text": "Was this Pepperdine by any chance? That's awful!",
          "author": "chiicha",
          "created": 1581569726,
          "upvotes": 4,
          "replies": {
            "fhi36hd": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhi36hd/",
              "text": "UC :)",
              "author": "imushmellow",
              "created": 1581616908,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fhludll": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhludll/",
          "text": "Hello fellow Gaucho!👋🏻",
          "author": "4Blu",
          "created": 1581704786,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fhfrq5u": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrq5u/",
      "text": "A fight broke out in one of the dorms and their solution was to lock all side doors to all buildings after 11 “for safety purposes”. This means we have to walk half a mile around most buildings from their parking lots to the front most doors. To any logical person this is stupid, but to our admin, this is brilliant.",
      "author": "OhItsReallyNoah",
      "created": 1581549762,
      "upvotes": 11,
      "replies": {}
    },
    "fhfriag": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfriag/",
      "text": "Went to a four year university in a rural state. Saw a class advisor every semester, if not multiple times a semester. Got to my senior year, graduated, walked at graduation and everything. I got a letter 2 weeks after I received my diploma that it was invalid and I didn’t have enough credits to graduate. \n\nMy advisor had recommended me a class that wasn’t in the right category. I had enough credits to graduate, I was one single credit short in an upper level science category. I think fine, guy made a mistake, I’m still living near campus, I’ll get something next semester. I sign up, and my tuition is $1,000 for a single credit seminar. I was an out of state student, and my scholarship expired after 4 years. So I appeal, seeing as it was my advisors fault, and naturally get denied. \n\nTLDR: \n\nClass advisor made a mistake on my schedule. I don’t graduate in time. University makes me take an extra class that costs $1,000 even though not a single part of this was my fault.",
      "author": "ardesofmiche",
      "created": 1581549619,
      "upvotes": 18,
      "replies": {}
    },
    "fhfri4j": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfri4j/",
      "text": "My academic advisor didn't respond to my email about requesting a time to meet before class registration until 3 weeks after class registration. I registered for the wrong classes because of our missed meeting.",
      "author": "ga_mcm",
      "created": 1581549615,
      "upvotes": 8,
      "replies": {}
    },
    "fhfqbgg": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfqbgg/",
      "text": "School sent the dorm room a little cardstock flyer thing that said something about a sexual abuse violation that occurred. The way it was worded and looked had us panicked that we had committed some sort of sexual abuse. We called like 10 people about it (including the number on the paper) and nobody knew what it was. Finally, when we met with a school police officer they said that it was to make us aware of one that happened around our dorm room in one of the adjacent rooms or halls. Caused us 5 days or panic at the start of our first semester. \n\ntl;dr: school sends paper to dorm talking about a sexual abuse issue. worded poorly, thought it was accusatory. called lots of university staff, ended up being a “public awareness” thing. caused lotsa panic",
      "author": "potatosharkbait",
      "created": 1581548848,
      "upvotes": 3,
      "replies": {}
    },
    "fhfp2pm": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfp2pm/",
      "text": "For admission to my school, everyone has to choose a \"first-year program\" to apply to, including an intended major. You get accepted based on competition for the first-year program you chose. Then, AFTER you are accepted and have completed your first semester or two, you have to apply AGAIN, in a competitive process, to the specific major you want. It pits everyone against each other and many people end up having to transfer to get the degree they wanted. The school could hire more faculty and offer more classes for the in-demand majors, but instead they thrust this painful, incredibly stressful process upon students.",
      "author": "PooYouToo",
      "created": 1581548050,
      "upvotes": 13,
      "replies": {}
    },
    "fhfowcw": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfowcw/",
      "text": "The school I go to now didn't give me my acceptance letter the first time I got in. It got lost in the mail or something. I only knew I got in because I got an email about it. I couldn't register for classes because I needed info in the letter and the school wouldn't give me the info. They just kept saying I needed the letter and wouldn't make an exception for me. So, I couldn't attend class that semester.\n\nI then asked them to roll over my acceptance to the next semester, since it was their fault I couldn't sign up for class. They wouldn't do that, so I had to apply again. Thankfully, I got the letter the second time around!",
      "author": null,
      "created": 1581547939,
      "upvotes": 38,
      "replies": {}
    },
    "fhfonds": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfonds/",
      "text": "Dumb counselor didn’t tell me what classes I needed to take for my comm major. I’m now stuck havinng to take a class at my far ass sister school because my counselor didn’t tell me I needed this class and hat they only offer it at my school in the fall. I hate him. He also is condescending and cuts me off.",
      "author": "GetYourselfAHapa",
      "created": 1581547781,
      "upvotes": 7,
      "replies": {}
    },
    "fhfljm5": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfljm5/",
      "text": "Tldr at bottom.\n\nI go to a branch campus in a smaller town. The main campus is planning to raise the cost of parking passes there from (I think) $270/semester to $300/semester. That's insane just for parking in a college that basically uses the entire town, but it gets better.\n\nSince supposedly people at the main campus have complained about pricing and costs, the administration is planning to \"make it even for everyone\", by instituting parking pass fees at all campuses, even the ones that don't have shortages of parking space (like mine).\n\nTldr: Administration is raising parking pass fees even higher at one campus, people complain, so Administration makes everyone at all campuses pay parking fees even at places where it's not needed.",
      "author": "Jenneke42",
      "created": 1581545861,
      "upvotes": 15,
      "replies": {}
    },
    "fhfl66g": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfl66g/",
      "text": "Used to get 2+ grand in need based aid grants per semester from the college, not FAFSA. But you only qualify as a freshman and sophomore. Due to my AP credits from high school, I entered my 2nd semester of college a pre-junior, whatever that means. So I no longer qualified for the aid and I lost it. Now if these credits actually accelerated me in my program, I would understand them cutting the grants, but almost all of these classes don't do anything for me in my major and never will, they just sit in our system inflating my class for no reason. Not to mention my tuition will always be the full time rate as I have to be a full time student anyways, so my bill will never be cheaper because of these useless credits. When I called our aid office I was told they can't just drop the useless credits, but oh, my loan cap will go up. Because loans and need based grants are interchangable.",
      "author": "bghaus",
      "created": 1581545636,
      "upvotes": 20,
      "replies": {}
    },
    "fhfkvse": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfkvse/",
      "text": "Declared my major in October and still haven't been assigned an advisor. Had to go to my Latin professor to help me choose classes for the next semester, and I'm trying to transfer so she helped me out with all of that too. Could've really used some advising",
      "author": "elkj13",
      "created": 1581545462,
      "upvotes": 15,
      "replies": {
        "fhgoioi": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgoioi/",
          "text": "Can you check the catalog yourself to figure out what to take? Honestly, advisors are pretty useless even when they “help” you figure out classes. It’s better if you do it yourself.",
          "author": "Slothfulness69",
          "created": 1581573202,
          "upvotes": 6,
          "replies": {
            "fhhkk4w": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhkk4w/",
              "text": "Yeah.  i always needed the head of the dept to sign off on things anyway so no need to see the random advisor. i didn't really know who my advisor was till i needed to get stuff signed to graduate.",
              "author": "424f42_424f42",
              "created": 1581606275,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fhfreie": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfreie/",
          "text": "You don't pick your advisor when you declare?",
          "author": "skelechel",
          "created": 1581549550,
          "upvotes": 1,
          "replies": {
            "fhfrkxu": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrkxu/",
              "text": "At my school they're assigned to us, I'm not sure if it works that way at other places. I think there's only one advisor for my major so I'm not sure I'd have much of a choice anyways",
              "author": "elkj13",
              "created": 1581549667,
              "upvotes": 3,
              "replies": {
                "fhfu3kk": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfu3kk/",
                  "text": "I would go in person to the dept head of whatever department you will be most involved in. (Math major then go to the head of the math dept etc). If you keep going up the chain of command you will find someone who cares and at that point they will make those under them care. And honestly if there really is only one figure out who it is and show up to their office and make them advise you.",
                  "author": "SpicedCokeAndRum",
                  "created": 1581551334,
                  "upvotes": 4,
                  "replies": {}
                },
                "fhfrn6j": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrn6j/",
                  "text": "Can the registrar help you?",
                  "author": "skelechel",
                  "created": 1581549708,
                  "upvotes": 2,
                  "replies": {
                    "fhfrxpb": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrxpb/",
                      "text": "I went to them and they told me to go to the advising center. I went to the advising center and they said it should be automatic but they'll look into it. Haven't heard back. I've emailed them again recently and still haven't gotten a response. I would care more if I wasn't transferring, but since I am it's not a huge problem anymore",
                      "author": "elkj13",
                      "created": 1581549898,
                      "upvotes": 2,
                      "replies": {
                        "fhfs2f4": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfs2f4/",
                          "text": "That's insane, but I can understand that. My credits are messed up on my program evaluation and my registrar won't fix it, but I made a women handwrite my file correctly so they couldn't stop my graduation. Sometimes you gotta fight or let it go.",
                          "author": "skelechel",
                          "created": 1581549984,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fhfklnh": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfklnh/",
      "text": "Reclassified about half of my department with MFAs as having the highest degrees in their field but waited a couple years to give everyone else (the adjuncts) the same classification. Exact same degrees teaching the exact same classes but somehow it's the highest degree for some but not for others.\n\nEnded up costing me about $3000. Union managed to get back only $550.",
      "author": "bl1y",
      "created": 1581545294,
      "upvotes": 2,
      "replies": {}
    },
    "fhfhkp7": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfhkp7/",
      "text": "I've suppressed this memory because it makes my blood boil but: Last Spring semester I dropped below full-time for mental health reasons. Of course, this meant that my scholarships, which required full-time status, were in jeopardy. I submitted an appeal to retain them, and you can bet that I did a ton of research on my university's policies. I met with the Dean of my program (at the time). I met with the Scholarship Appeals lady. Not even a day or two after I met with the program Dean, I get an email from Scholarship Appeals lady telling me my scholarships will not be reinstated.\n\nI was confused because she just simply said, \"you weren't full-time, blah blah blah\". Why allow me to submit an appeal in the first place? She said that when I met with her, she said I could either submit medical documentation or something from my Advisor. That was untrue, she never stated that. If she had, I would have done so. Also she said that since my account was still under my old major, it didn't show reasons for me dropping classes to pursue a different career. (Didn't she know that changes like that can't happen within 1 or 2 days?)\n\nI sent her back a professionally-worded but emotionally reflective essay about how angry I was. And I still am. I hate mindless drones who stick to formalism and I hate being (let's be honest here, uni's want $$$) purposefully misled.\n\n\\*rant over\\*",
      "author": "FreezingDemon",
      "created": 1581543517,
      "upvotes": 48,
      "replies": {
        "fhg5m0f": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg5m0f/",
          "text": "This reminds me of a time when i was working full time and just taking one class. \n\nWell, that class was calc 1, and it was pretty rough on me. So i decided to drop it and take it again the next semester. \n\nWell the school had no idea how to unenroll me without kicking me out of school, because people never dropped all their credits but wanted to come back the next semester. I was in non degree seeking status, so i could do whatever i wanted like that. \n\nAnyway, i got passed around from office to office. Stoping by one office, having them call another office, walking to that office, and having them tell me they’re the wrong office. \n\nAfter going in circles about 3 times from these 4 offices, finally one office decided they WERE the right office for me to get things resolved. \n\n\nAnd i had to make an appointment 4 weeks out with an advisor there to actually get my issue fixed... \n\nAfter that ordeal i finished calc the next semester and transferred schools asap.",
          "author": "ZEOXEO",
          "created": 1581559127,
          "upvotes": 9,
          "replies": {
            "fhgidkz": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgidkz/",
              "text": "Oh that’s awful. I hate wild goose chases and for some reason universities are plagued with them. So much red tape and a lack of being able to help or something. I don’t blame you for transferring. After my ordeal, I was SO close to doing so.",
              "author": "FreezingDemon",
              "created": 1581567951,
              "upvotes": 8,
              "replies": {}
            },
            "fhhzj3h": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhzj3h/",
              "text": "Going in circles like that is such a systemic problem at my university that it has a semi-official name: The Shepherd Shuffle. Students get stuck in it, professors get stuck in it, even administrators get stuck in their own loops. It happens to me two or three times per semester.",
              "author": "zaxophone_bswv",
              "created": 1581614844,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fhfhcw9": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfhcw9/",
      "text": "Well, it happened in my HS, not in college (yet). I was so sleep deprived from studying, they thought I was under influence of drugs or something and sent me to the nurse. She did some basic tests and let me go.",
      "author": "feynry",
      "created": 1581543395,
      "upvotes": 16,
      "replies": {
        "fhgyrag": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgyrag/",
          "text": "Lmao similar thing happened to me, except it actually was drugs.\n\nExcept I got these drugs from the on-campus pharmacy because I had a back/leg injury to where I couldn't walk.",
          "author": "musiclovermina",
          "created": 1581585452,
          "upvotes": 4,
          "replies": {
            "fhiahrl": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhiahrl/",
              "text": "Sounds bad. But you shouldn’t be able to get non prescription drugs without, well, prescription. And if it was non-prescription, than you should have been fine :) In our school they would not give me Ibuprofen without having my parents signature (at the beginning of the year online thing).",
              "author": "feynry",
              "created": 1581620932,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fhffexg": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhffexg/",
      "text": "Charged $300 for a mental health visit. Also I'm an RA, I have to submit my hours electronically AND in print/signed. I took my hours to the HR manager, gave them to her by hand. Then the next week when my pay didn't go through she told me I never handed them in. She made me fill out a time adjustment form (which apparently those make her super super pissed), then that paycheck took 3.5 weeks to arrive",
      "author": "poopoojerryterry",
      "created": 1581542293,
      "upvotes": 77,
      "replies": {}
    },
    "fhfep1g": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfep1g/",
      "text": "Kicking me out after a year over not meeting a transfer gpa requirement by .1. Then denying the appeal.",
      "author": "fadedrejoice",
      "created": 1581541884,
      "upvotes": 30,
      "replies": {
        "fhhzxzn": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhzxzn/",
          "text": "That's disheartening. This year I lost my state's major merit-based scholarship because my GPA was too low by 0.02 points.",
          "author": "zaxophone_bswv",
          "created": 1581615080,
          "upvotes": 4,
          "replies": {
            "fhiq4rv": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhiq4rv/",
              "text": "So ridiculous! Im sorry that happened to you",
              "author": "fadedrejoice",
              "created": 1581629636,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "fhfpckb": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfpckb/",
          "text": "I never heard of that before",
          "author": null,
          "created": 1581548223,
          "upvotes": 5,
          "replies": {
            "fhg7x7u": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg7x7u/",
              "text": "Never had I",
              "author": "fadedrejoice",
              "created": 1581560632,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fhfdwd5": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfdwd5/",
      "text": "Idk if this counts but I was in a serious car crash my first semester and it took almost a month to get an appointment with the disability center to talk about letting me park closer to my dorm so I could walk to the car I was borrowing. \n\nThe first week, I ate the only food I had in my dorm (chocolate soy milk, dried seaweed, and Malto Meal). By the second week, I was brave enough to venture outside for classes and managed to make it to a convenience store where I would get a bag or two of chips at a time because I was too weak to carry anything yet (including my backpack). By the third week I made it to the parking lot and just brought the car up to my dorm lot. They ticketed me almost every day that week totaling up to over $200 in fines and wouldn’t revoke it when I did get my disability accommodations. \n\nDid I mention I was in drug withdrawal the whole time, attempted suicide, and had my OCD onset? \n\nA lot of people tell me “oh it’s fine, the first semester is always the hardest” and I just smile, but no one really understands how bad it was for me. I felt really isolated from my peers",
      "author": null,
      "created": 1581541431,
      "upvotes": 71,
      "replies": {
        "fhfm17x": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfm17x/",
          "text": "Wow. Hope everything is better now.",
          "author": "WizardApple",
          "created": 1581546160,
          "upvotes": 24,
          "replies": {
            "fhfm5k9": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfm5k9/",
              "text": "Thanks, it is. Therapy is going nowhere but I’m physically fine now, and that makes it all so much easier to deal with. If you don’t have your health, you don’t have anything.",
              "author": null,
              "created": 1581546232,
              "upvotes": 21,
              "replies": {}
            }
          }
        }
      }
    },
    "fhfdtrw": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfdtrw/",
      "text": "Told me to take an intro to chem class as a prerequisite for the following class even thought he curriculum is almost identical for the two classes and it was never a prerequisite. Learned that day to always get a second or third opinion",
      "author": "gameofbowls",
      "created": 1581541389,
      "upvotes": 8,
      "replies": {}
    },
    "fhfcf8q": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfcf8q/",
      "text": "It is important to understand why there is a job fair requirement.\n\nCompanies will only come to the school if they can get access to the top students.  These are their top candidates.\n\nNot all top students (like yourself) will need the job fair.  But by being there you may learn about some places you hadn't considered which means that the company might be able to hire some top students.\n\nBut why does the school care?\n\nThey want the employers to come because when they do come, they often hire students who are not top students as well.  They will find some students that they liked who wouldn't stand out on paper.\n\nThis leads to more students getting hired through the opportunities provided by the school.  And these things are marketed to attract even more high quality students to apply to the school.\n\nIn short, they need to put a hard push on to ensure the top students attend.",
      "author": "fu-depaul",
      "created": 1581540595,
      "upvotes": -4,
      "replies": {}
    },
    "fhfbkp9": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfbkp9/",
      "text": "[deleted]",
      "author": null,
      "created": 1581540116,
      "upvotes": 84,
      "replies": {
        "fhhp401": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhp401/",
          "text": "Why wouldn't you send your transcripts to the new school and ask for a determination on your credits to transfer?\n\nThe new school is the one that decides if they will transfer, not the old school.",
          "author": "fu-depaul",
          "created": 1581608938,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "fhf8vxw": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf8vxw/",
      "text": "So this past semester was easily one of the hardest I’ve had to deal with. I had a late class on Tuesdays from 5pm-8ish with my day starting at 9am. One day I found myself to be extremely tired and was yawning a little more than usual in class, my teacher called me out on it called me disrespectful even had me leave the classroom to talk “more in private” as we were outside she faked yawned in my face to show me how to properly yawn in public, she asked me to either do that, stop, or leave the class whenever I had to yawn. I told her that was a lot and if it was distracting I could happily just leave class altogether. Which I did. The following morning I started receiving emails from the Dean of Students about meeting with them and discussing why I was tired and what I was doing that was making me so tired. Unnecessarily but whatever I kept it pushing until the next class she gave me a 23/100 evaluation allegedly based on 3-4 weeks worth of classes. When I spoke to her about it I got no real explanation and she said I disrespected her on multiple occasions in a matter of minutes the one day.",
      "author": "shes-a-g3m",
      "created": 1581538580,
      "upvotes": 153,
      "replies": {
        "fhfe23y": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfe23y/",
          "text": "Holy shit your prof is crazy",
          "author": "dat-CosmosNova75",
          "created": 1581541520,
          "upvotes": 79,
          "replies": {
            "fhfgjsg": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfgjsg/",
              "text": "Most def! I was ready to fight her every class after that",
              "author": "shes-a-g3m",
              "created": 1581542933,
              "upvotes": 42,
              "replies": {
                "fhgdujo": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgdujo/",
                  "text": "What grade did you get? She give you a bad grade or did you have that removed from your transcript?",
                  "author": "RandomDataUnknown",
                  "created": 1581564611,
                  "upvotes": 10,
                  "replies": {
                    "fhge9o4": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhge9o4/",
                      "text": "It eventually got removed but I had to jump through so many hoops. At one point in the semester all my work had to be reviewed by another professor to make sure I was being graded fairly.",
                      "author": "shes-a-g3m",
                      "created": 1581564907,
                      "upvotes": 27,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fhf8i0g": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf8i0g/",
      "text": "I got told by my spanish department that they wouldn’t allow me to use my iPad in class for notes and textbook. I’ve had two surgeries (nuss bar for severe deformity) and I can’t carry more than 5 lbs, I cannot carry the textbook or a notebook at all.",
      "author": null,
      "created": 1581538363,
      "upvotes": 116,
      "replies": {
        "fhfacqi": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfacqi/",
          "text": "Was this recently and in the US? You can totally get help because of a disability and teachers/school have to follow suit.",
          "author": "houseofprimetofu",
          "created": 1581539420,
          "upvotes": 94,
          "replies": {
            "fhfak4i": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfak4i/",
              "text": "I went to disability services, I’m having to have my disability form rewritten and re-emailed to every professor specifically saying I can’t lift more than 5 lbs and I won’t carry shit to class but my iPad and a super light notebook.",
              "author": null,
              "created": 1581539538,
              "upvotes": 67,
              "replies": {}
            }
          }
        }
      }
    },
    "fhf80en": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf80en/",
      "text": "Small Christian college so the dorms are separated by girls and boys. For some reason, they put all of the freshmen girls in 2 dorms with RA’s and they mix the boys dorms with upperclassmen and freshmen. This leads to the girls having a harder time to find older girls for advice and to be friends with. I only know freshmen through clubs. I’m so jealous of the boy’s culture.",
      "author": "FaeryMaiden982",
      "created": 1581538084,
      "upvotes": 27,
      "replies": {}
    },
    "fhf6y8j": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf6y8j/",
      "text": "My fraternity was suspended because we brought a pledge to the hospital after he got overly intoxicated in his dorm room. Good Samaritan policy didn’t apply because we didn’t “call” an ambulance. I was President of the fraternity.",
      "author": "thirstywalls",
      "created": 1581537470,
      "upvotes": 267,
      "replies": {
        "fhfyvkl": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfyvkl/",
          "text": "The first time I went to college my friend nearly got a public intoxication ticket because we decided to walk him from our residence to the hospital when he took some bad  MDMA. It was litteraly the next building over, with only a bike path between the two parking lots. \n\nA bike cop happened upon us and when we thought we found help, we really just hit a brick wall. Cop called back up, back up took 15 minutes to show up before they started searching us and all that because we had someone who had admitted to taking drugs. 25 minutes after the cop first found us, my friend started having a seizure and the cop at first accused him of faking it.\n\nSolid night. Luckily we managed to bring him to the emergency room and he was okay after some IV fluids and being monitored.",
          "author": "crownamedcheryl",
          "created": 1581554597,
          "upvotes": 104,
          "replies": {
            "fhg0570": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg0570/",
              "text": "Ya, I feel ya. Over the next 3 months after the incident occurred, we were constantly accused by hospital, university, and public safety officials, of forcing him to butt-chug grain alcohol (no, I’m not joking), when it was fairly clear that he was drinking heavily in his dorm room (several open containers were found in there, along with a STOCKED mini fridge). \n\nIt was a fun time descending into depression, while constantly being falsely accused of something pretty horrific.",
              "author": "thirstywalls",
              "created": 1581555466,
              "upvotes": 53,
              "replies": {
                "fhg0hqr": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg0hqr/",
                  "text": "Yeah we all had a meeting with residence admins in like a board style interview, it was clearly them trying to intimidate us. We would go in one at a time infront of 8 admins and 3 of the 5 police officers on the scene. \n\n2 of our group were litteraly unrelated strangers who just tagged along to make sure he was okay and were treated like criminals.",
                  "author": "crownamedcheryl",
                  "created": 1581555702,
                  "upvotes": 23,
                  "replies": {}
                },
                "fhgnc2m": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgnc2m/",
                  "text": "How did the situation work out? Did the officials quit being dumb or did they still end up blaming you?",
                  "author": "Slothfulness69",
                  "created": 1581572127,
                  "upvotes": 5,
                  "replies": {
                    "fhjpsdf": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhjpsdf/",
                      "text": "We appealed to no avail, can’t really say anymore about the situation other than it was pretty fucked. Goes to show who has the ultimate power.",
                      "author": "thirstywalls",
                      "created": 1581652267,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fhf5643": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf5643/",
      "text": "My school didn't give me my financial aid plan (including federal aid, etc.) until 2 weeks after I started classes and then tried to tell me I had to take out more loans to make up for it and then threatened to drop me because I hadn't paid the full amount. I'm just glad they finally figured it out",
      "author": "aquamarine_321",
      "created": 1581536443,
      "upvotes": 115,
      "replies": {
        "fhfs41v": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfs41v/",
          "text": "[deleted]",
          "author": null,
          "created": 1581550013,
          "upvotes": 56,
          "replies": {
            "fhftdx4": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhftdx4/",
              "text": "I’m in the National guard and also have deployed, so I have a weird hodgepodge of benefits that all hit my student account in a different order. The only thing is I’m in a midwestern university where there is ALOT of military veterans. So every semester I would get into my own version of stare down about paying my bill before benefits would hit, I thought I was kinda alone in the fight until my Veterans Affairs office threatened to file a class action lawsuit for harassment of veteran students because the cashiers office couldn’t figure out that we have no control of when the benefits hit and they kept bugging us individually.",
              "author": "SpicedCokeAndRum",
              "created": 1581550860,
              "upvotes": 41,
              "replies": {}
            }
          }
        },
        "fhgn03m": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgn03m/",
          "text": "must be nice, fasfa denied me and now i have loans that r ruining my credit score",
          "author": "isabella14773",
          "created": 1581571828,
          "upvotes": 1,
          "replies": {
            "fhgyjz3": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgyjz3/",
              "text": "k",
              "author": "mister_bmwilliams",
              "created": 1581585164,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fhf3ppg": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf3ppg/",
      "text": "No longer allowing internships during the summer.",
      "author": "pawinas",
      "created": 1581535587,
      "upvotes": 119,
      "replies": {
        "fhf9dwp": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf9dwp/",
          "text": "That is so crazy. How can they control what you do over the summer?",
          "author": "SheelaGreen",
          "created": 1581538865,
          "upvotes": 72,
          "replies": {
            "fhfxohd": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfxohd/",
              "text": "When I started college I was in mechanical engineering and our program required 3 internships, one on each off semester. I'd imagine it's like that except they didn't give credit for them. Sounds like something my old school would have done.",
              "author": "GeneralTree5",
              "created": 1581553772,
              "upvotes": 18,
              "replies": {}
            },
            "fhhydoq": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhydoq/",
              "text": "I'm guessing pawinas means that they won't give college credit for a summer internship.",
              "author": "zaxophone_bswv",
              "created": 1581614193,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fhfkiwc": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfkiwc/",
          "text": "How do they stop you?",
          "author": "Relrik",
          "created": 1581545247,
          "upvotes": 24,
          "replies": {}
        },
        "fhfmz15": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfmz15/",
          "text": "If you take something entirely unconnected to the university, how would they even know?",
          "author": "manondessources",
          "created": 1581546733,
          "upvotes": 22,
          "replies": {}
        },
        "fhfoor0": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfoor0/",
          "text": "Lol what? I’m curious as to how that’s even enforceable.",
          "author": "siouxwhatever",
          "created": 1581547804,
          "upvotes": 9,
          "replies": {
            "fimp7xm": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fimp7xm/",
              "text": "You could do an internship, but they won’t count it towards your grade unless you do it during their selected  time frame. I had this issue with volunteer hours, had to do them twice because they refused to accept my summer hours.",
              "author": "madammayorislove",
              "created": 1582541077,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fhg0f9b": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg0f9b/",
          "text": "I need to do an internship before I graduate and it has to be done in the fall or spring. We used to be able to do it in the summer. So, now I'm graduating in 2021.",
          "author": "pawinas",
          "created": 1581555657,
          "upvotes": 6,
          "replies": {
            "fhhu8cd": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhu8cd/",
              "text": "Does the campus offer the internship or do you have to somehow find and get accepted for one or they hold your degree hostage?",
              "author": "Relrik",
              "created": 1581611857,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fhf9o3b": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf9o3b/",
          "text": "Mine doesn't allow internships during winter term. Ridiculous.",
          "author": "lemonaderoses",
          "created": 1581539027,
          "upvotes": 5,
          "replies": {}
        },
        "fhfn7k3": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfn7k3/",
          "text": "Wtf why",
          "author": "bigthotstatus",
          "created": 1581546880,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fhf30q3": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf30q3/",
      "text": "Once my advisor told me to pick up on a Physiology class during my first semester as a freshmen. I was legit one of the few freshmen in the class of like 300 and it was a super intense weed out class for dentistry, med school, and nursing majors. Apparently there was no requirement and I technically didn’t need to take it until Junior year. It fucked my GPA hard and I switched my major the next semester",
      "author": "toastytowels",
      "created": 1581535181,
      "upvotes": 343,
      "replies": {
        "fhfxovl": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfxovl/",
          "text": "I hope you threw hands with your advisor.",
          "author": "LiquidDio",
          "created": 1581553780,
          "upvotes": 116,
          "replies": {
            "fhg2ua7": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg2ua7/",
              "text": "I didn’t but I got out of that major fast af",
              "author": "toastytowels",
              "created": 1581557298,
              "upvotes": 54,
              "replies": {}
            },
            "fhgmy61": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgmy61/",
              "text": "Advisors are so useless. I made a one-hour appointment to talk to mine so we could plan out the rest of my degree (3 semesters at that point) and I was asking what order to take some classes in cuz of pre reqs. \n\nThis lady had no idea what I was talking about. She started saying some BS about “oh, general ed classes are easier, so maybe work those into your schedule” cuz I had my upper division gen ed classes left. I was like wtf, that’s not my question. I ended up leaving literally 8 minutes into the appointment, looking up the university catalog, and mapping out my degree myself 🙄",
              "author": "Slothfulness69",
              "created": 1581571780,
              "upvotes": 59,
              "replies": {}
            }
          }
        },
        "fi26bqd": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fi26bqd/",
          "text": "Well it did weed you out...",
          "author": "LeanardoNoCaprio",
          "created": 1582072483,
          "upvotes": 3,
          "replies": {
            "fi4gpp1": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fi4gpp1/",
              "text": "Lmfao ouch",
              "author": "toastytowels",
              "created": 1582140839,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fhwaw55": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhwaw55/",
          "text": "[deleted]",
          "author": null,
          "created": 1581910857,
          "upvotes": 2,
          "replies": {
            "fhy0cu6": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhy0cu6/",
              "text": "Damn that’s wild",
              "author": "toastytowels",
              "created": 1581965938,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fhf1cq8": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf1cq8/",
      "text": "[deleted]",
      "author": null,
      "created": 1581534194,
      "upvotes": 3,
      "replies": {
        "fhf9vax": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf9vax/",
          "text": "Principle of the deal I guess, I shouldn't have had to do anything other than tell my teachers why I would be missing and that should have been the end of it.",
          "author": "SpicedCokeAndRum",
          "created": 1581539143,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fhf07md": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf07md/",
      "text": "We had some weather issues last week, light snow but LOTS OF ICE. Instead of cancelling they delayed classes till 10 AND THEN cancelled classes at 11. After everybody already bumped/wrecked into each other driving here. They closed the library at midnight but didn’t think to cancel classes later on till we all got there in 14 degree weather >:(",
      "author": "knic143",
      "created": 1581533513,
      "upvotes": 269,
      "replies": {
        "fhf0lni": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf0lni/",
          "text": "Dude. Last year when the Midwest had those -40 degree days, we ended up having a petition passed around to cancel school. They didn't cancel school until like 3 hours before classes were supposed to start and it left people stranded who were commuters. My friend crashed in my room for three days. There were a lot of colleges in Indiana who were threatened with lawsuits for endangerment if they did not cancel classes.",
          "author": "ArtemisTater",
          "created": 1581533744,
          "upvotes": 161,
          "replies": {
            "fhf0tjs": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf0tjs/",
              "text": "Geez, no wonder there were threats. In Texas just a little is usually enough to cancel but I can’t imagine those kinds conditions. That’s just blatant carelessness on the school’s part.",
              "author": "knic143",
              "created": 1581533876,
              "upvotes": 55,
              "replies": {
                "fhf0z4y": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf0z4y/",
                  "text": "Oh man. Ball State, IU, Purdue, Trine, Notre Dame, they all got threatened. Hard. Our school even had shuttles running around every hour to get us to the cafe if we needed to eat. You walk out in that for 5 minutes and you're toast.",
                  "author": "ArtemisTater",
                  "created": 1581533969,
                  "upvotes": 51,
                  "replies": {
                    "fhg31mq": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg31mq/",
                      "text": "Western Michigan too\n\nWe had a whole week of classes canceled and the one day they didn't cancel (a Thursday) all the professors themselves canceled.",
                      "author": "ImpulseDecider",
                      "created": 1581557437,
                      "upvotes": 12,
                      "replies": {}
                    },
                    "fhgubdc": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgubdc/",
                      "text": "A kid at the U of Iowa died walking to a friends dorm 6 minutes away during that cold snap.",
                      "author": "shannon_busse",
                      "created": 1581579473,
                      "upvotes": 8,
                      "replies": {
                        "fhk4t80": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhk4t80/",
                          "text": "Oh wow that's horrible",
                          "author": "ArtemisTater",
                          "created": 1581666842,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fhfhe90": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfhe90/",
                  "text": "Which part? We got some snow in Austin last week and my uni did not cancel classes",
                  "author": "itsjosh18",
                  "created": 1581543416,
                  "upvotes": 3,
                  "replies": {
                    "fhfioon": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfioon/",
                      "text": "Lubbock",
                      "author": "knic143",
                      "created": 1581544160,
                      "upvotes": 1,
                      "replies": {
                        "fhi7g20": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhi7g20/",
                          "text": "Ah yeah I heard yall got a little snow up there.",
                          "author": "itsjosh18",
                          "created": 1581619180,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fhfqnx3": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfqnx3/",
              "text": "Our classes never got cancelled, because they assume enough of us lived on campus that it didn't matter (unless commuting we have to live on campus all four years). It was my internship in another city that called me afraid for my safety and told me not to come.",
              "author": "skelechel",
              "created": 1581549071,
              "upvotes": 18,
              "replies": {
                "fhfr0h8": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfr0h8/",
                  "text": "I'm afraid to ask, what school?",
                  "author": "ArtemisTater",
                  "created": 1581549297,
                  "upvotes": 5,
                  "replies": {
                    "fhfr1qy": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfr1qy/",
                      "text": "Wittenberg, so Ohio actually",
                      "author": "skelechel",
                      "created": 1581549320,
                      "upvotes": 7,
                      "replies": {
                        "fhfr8uf": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfr8uf/",
                          "text": "Not too far away then. But yikes. That's rediculous.",
                          "author": "ArtemisTater",
                          "created": 1581549449,
                          "upvotes": 1,
                          "replies": {
                            "fhfrbk9": {
                              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrbk9/",
                              "text": "No one was happy about it, and right now we're getting 4 inches of snow and 4 additional inches of freezing rain. Will be a fun trip to class tomorrow!",
                              "author": "skelechel",
                              "created": 1581549498,
                              "upvotes": 1,
                              "replies": {
                                "fhfrh8u": {
                                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrh8u/",
                                  "text": "Ha. Same! Good old northeast Indiana. 🙄 I'll probably slide across the parking lot.",
                                  "author": "ArtemisTater",
                                  "created": 1581549599,
                                  "upvotes": 3,
                                  "replies": {
                                    "fhfrkox": {
                                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrkox/",
                                      "text": "I'm not even kidding, I'm jealous that you HAVE a parking lot. We have one student lot with 15 spots next to my building, and people get ticketed there for no reason constantly, so were forced to park on the roads 😭😭",
                                      "author": "skelechel",
                                      "created": 1581549662,
                                      "upvotes": 1,
                                      "replies": {
                                        "fhfrnhq": {
                                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrnhq/",
                                          "text": "We have lack of space in ours. Makes me more greatful tbh hearing about your situation",
                                          "author": "ArtemisTater",
                                          "created": 1581549714,
                                          "upvotes": 2,
                                          "replies": {
                                            "fhfrors": {
                                              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrors/",
                                              "text": "Where do you go, if I may ask?",
                                              "author": "skelechel",
                                              "created": 1581549737,
                                              "upvotes": 1,
                                              "replies": {
                                                "fhftwih": {
                                                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhftwih/",
                                                  "text": "Trine",
                                                  "author": "ArtemisTater",
                                                  "created": 1581551202,
                                                  "upvotes": 2,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "fhfavtu": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfavtu/",
              "text": "Yeah I nearly crashed several times one night coming back to my house from Evansville (literally almost slid into a gas station and then about slid past a turn on a highway) and they still had classes the next day. I just messaged my professors and told them I wasn't showing up.",
              "author": "TheDoodleDudes",
              "created": 1581539723,
              "upvotes": 9,
              "replies": {
                "fhfbg5e": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfbg5e/",
                  "text": "Wow that's awful! I remember earlier this year I actually tried to park outside of my dorm and my car was sliding all over the place. It was pure ice the next morning and I told my professors nah on class because I tried to step outside and landed on my back.",
                  "author": "ArtemisTater",
                  "created": 1581540044,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "fhgdsf0": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgdsf0/",
              "text": "I go to school in Iowa and my school only shut down because 2 of the other main schools in the state decided to shut down, like that was the only reason, they were willing to keep it open even though it was so dangerous. They also tried to make my roommate go to work, they worked in a dining hall, and then got mad when they said they couldn't come in because the buses weren't running and that it was about a 20 minute walk in good weather and there was no way they were going to make it during the vortex (The dining center had enough people living in the dorms that physically connected to it that they would have enough workers so its not like they had a short supply)",
              "author": "tiredcollegekid2",
              "created": 1581564569,
              "upvotes": 4,
              "replies": {
                "fhgudpj": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgudpj/",
                  "text": "Odds you go to ISU and you’re talking about either Windows, Storms, or Seasons?",
                  "author": "shannon_busse",
                  "created": 1581579553,
                  "upvotes": 0,
                  "replies": {
                    "fhia3ti": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhia3ti/",
                      "text": "Seasons",
                      "author": "tiredcollegekid2",
                      "created": 1581620698,
                      "upvotes": 2,
                      "replies": {
                        "fhin34n": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhin34n/",
                          "text": "Yeppp, had this problem when I worked at convos.",
                          "author": "shannon_busse",
                          "created": 1581627962,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fhfm0ai": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfm0ai/",
              "text": "IU?",
              "author": "SkullCow",
              "created": 1581546143,
              "upvotes": 3,
              "replies": {
                "fhfmet0": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfmet0/",
                  "text": "Nah. Smaller school.",
                  "author": "ArtemisTater",
                  "created": 1581546389,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fhgl2yx": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgl2yx/",
              "text": "I went to school in St. Louis and we had one of those petitions last year too! Only got down to -20 wind chill so they never canceled class lol. That wasn't a fun walk in the morning",
              "author": "alienbanter",
              "created": 1581570150,
              "upvotes": 2,
              "replies": {
                "fhgm1ph": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgm1ph/",
                  "text": "I'd imagine not. I'm a baby when it gets below 20.",
                  "author": "ArtemisTater",
                  "created": 1581570986,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "fhg4liu": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg4liu/",
              "text": "We had that weather here in montana for about 2 weeks last year too. \n\nMost k-12 and colleges stayed open. \n\nI walked to class every day. My beard got really icy. \n\nIts common weather here and schools don’t close because people know how to dress.",
              "author": "ZEOXEO",
              "created": 1581558463,
              "upvotes": 1,
              "replies": {
                "fhg5s54": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg5s54/",
                  "text": "It’s not just about knowing how to dress, it’s about having the proper clothing/gear for it as well. Schools in Edmonton have that all the time, but everyone owns snowmobile suits and face masks. My students don’t even have the proper clothing for normal Michigan winters often enough and many can’t afford to get it either.",
                  "author": null,
                  "created": 1581559240,
                  "upvotes": 6,
                  "replies": {
                    "fhg8d4d": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg8d4d/",
                      "text": "Yep. The contrast is pretty interesting i think. \n\nThats the same reason places down south close with just a possibility of snow, because the lack the infrastructure to clear the snow, not because they don’t know how to handle the snow. \n\nIt happens so infrequently that they can’t justify the cost of snow tires and snow removal equipment for something that only happens one day every 6 years.",
                      "author": "ZEOXEO",
                      "created": 1581560927,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fhf246a": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf246a/",
          "text": "Really? During that storm, my classes were cancelled at least 18 hours in advance IIRC in Colorado. That was a snowy year.",
          "author": "uhRomeo",
          "created": 1581534646,
          "upvotes": 9,
          "replies": {
            "fhf9eoi": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf9eoi/",
              "text": "Yeah for whatever reason Indiana likes to think it's big and tough.",
              "author": "ArtemisTater",
              "created": 1581538877,
              "upvotes": 20,
              "replies": {
                "fhfb0ad": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfb0ad/",
                  "text": "As a Hoosier it probably thinks it isn't gonna get hurt cause it's on too much meth for that level of self-awareness",
                  "author": "TheDoodleDudes",
                  "created": 1581539794,
                  "upvotes": 12,
                  "replies": {
                    "fhfb722": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfb722/",
                      "text": "As a Hoosier myself, I can definitely tell you it's either that or because we drink too much and wander cornfields so much we think we are immune to anything.",
                      "author": "ArtemisTater",
                      "created": 1581539901,
                      "upvotes": 13,
                      "replies": {
                        "fhfciks": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfciks/",
                          "text": "Yep can't win no matter where ya go in this state. Nearly got beaten up by some dumbass pill popper working fast food a year months ago, had to work late on Halloween with a meth head the week after, just moved to the city and within a few days of that I had a drunk guy fall into my bus. Dude then proceeded to spend like 20 minutes crawling towards me of all people while the police were on their way to pick him up. Gives me some interesting stories at least 😂",
                          "author": "TheDoodleDudes",
                          "created": 1581540647,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fhf18h1": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf18h1/",
          "text": "Cornell?",
          "author": null,
          "created": 1581534122,
          "upvotes": 5,
          "replies": {
            "fhf1aat": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf1aat/",
              "text": "Nope, TTU",
              "author": "knic143",
              "created": 1581534153,
              "upvotes": 3,
              "replies": {}
            },
            "fhh6qg2": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhh6qg2/",
              "text": "Ayyy fellow ticked off Cornellian!",
              "author": "luminous_moonlight",
              "created": 1581595800,
              "upvotes": 1,
              "replies": {
                "fhhxiro": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhxiro/",
                  "text": "Ayyy! I'm a Cornell AAP dropout!",
                  "author": "zaxophone_bswv",
                  "created": 1581613707,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fhg0cm7": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg0cm7/",
          "text": "Tech kinda sucks, doesn’t it?  - an equally annoyed Tech student",
          "author": "LegitNerd125",
          "created": 1581555608,
          "upvotes": 5,
          "replies": {
            "fhg0ppy": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg0ppy/",
              "text": "It could def be better but I still love it :) just not the staff rn",
              "author": "knic143",
              "created": 1581555852,
              "upvotes": 1,
              "replies": {
                "fhg1xsx": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg1xsx/",
                  "text": "I agree with that",
                  "author": "LegitNerd125",
                  "created": 1581556684,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fhgkrzm": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgkrzm/",
          "text": "Lol do you go to texas tech too. Let's throw handssss",
          "author": "keriekat",
          "created": 1581569896,
          "upvotes": 2,
          "replies": {
            "fhgopfw": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgopfw/",
              "text": "Lmaooo fr fr",
              "author": "knic143",
              "created": 1581573377,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fhfrij7": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfrij7/",
          "text": "That's ridiculous.",
          "author": "Halomast123",
          "created": 1581549623,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fheypqp": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fheypqp/",
      "text": "I signed up for nighttime classes 3 months before the semester. A week before they start they get cancelled due to low inrolment. But they offered me the same classes except in the mounring.... and those classes where full. So a week before the semester starts I ended up changing community colleges completely. \n\nMy parents got a full refund and now I’m going somewhere better, yet cheaper. So it all worked out in the end.",
      "author": "Pocus_Codis",
      "created": 1581532635,
      "upvotes": 130,
      "replies": {
        "fhgpkg9": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgpkg9/",
          "text": "I know that /u/CameraHack came across as a heartless asshole, but I’m seriously curious: Is English your native language? If so, do you know what spelling and grammar errors you’re making? (If not, do you know how to correct them?)",
          "author": "_The_Professor_",
          "created": 1581574218,
          "upvotes": -4,
          "replies": {
            "fhgt2tt": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgt2tt/",
              "text": "Honestly, this is quite embarrassing lol. English is indeed my first language. I just have a few learning difficulties, so correct spelling and grammar mess me up sometimes. I’m trying to get better though. Just takes practice... but thank you for asking, and no you aren’t rude at all.",
              "author": "Pocus_Codis",
              "created": 1581577977,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "fhf1nje": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf1nje/",
          "text": "How was the enrollment though? Have you thought about majoring in spelling?",
          "author": "CameraHack",
          "created": 1581534372,
          "upvotes": -146,
          "replies": {
            "fhf72rr": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf72rr/",
              "text": "Imagine being this much of a cunt for no reason",
              "author": "Krock01",
              "created": 1581537544,
              "upvotes": 90,
              "replies": {
                "fhfd6cf": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfd6cf/",
                  "text": "Look at their comment history. They only want downvotes, it seems.",
                  "author": "Wingedbirdie",
                  "created": 1581541018,
                  "upvotes": 21,
                  "replies": {
                    "fhflub3": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhflub3/",
                      "text": "That's CameraHack's secret \"hack\": be a dick and get downvoted.",
                      "author": "WizardApple",
                      "created": 1581546043,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                },
                "fhg0me4": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg0me4/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1581555790,
                  "upvotes": -12,
                  "replies": {
                    "fhg1mau": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg1mau/",
                      "text": "A cunt is a pussy😂😂😂",
                      "author": "Sunbeam777",
                      "created": 1581556465,
                      "upvotes": 4,
                      "replies": {
                        "fhg1p12": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg1p12/",
                          "text": "Can’t get anything past r/college",
                          "author": "CameraHack",
                          "created": 1581556518,
                          "upvotes": -9,
                          "replies": {
                            "fhg8bli": {
                              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhg8bli/",
                              "text": "Ass u kan c, Im knot teh olny 1 tht thinx u r a mouron",
                              "author": "Krock01",
                              "created": 1581560898,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fheybio": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fheybio/",
      "text": "We have a concern system at our school. We get them if something seems off or if a student misses class without an explanation for more than three days consecutively. It's to help prevent issues such as suicide, because unfortunately that has happened before. I recently more or less found out they are usually a joke. I've had a few because of chronic illness. I got told to \"grow up\" and that \"I needed to be more responsible\". Like okay is this like being sent to the principal's office or something? I guess someone said something because now campus safety will basically barge in on anyone missing for more than three days.",
      "author": "ArtemisTater",
      "created": 1581532398,
      "upvotes": 295,
      "replies": {
        "fhf3fju": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf3fju/",
          "text": "That's bullshit. I'm glad I live off campus.",
          "author": "msief",
          "created": 1581535423,
          "upvotes": 87,
          "replies": {
            "fhf3i6e": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf3i6e/",
              "text": "Wish I had the option. It's too expensive.",
              "author": "ArtemisTater",
              "created": 1581535467,
              "upvotes": 27,
              "replies": {
                "fhf482x": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf482x/",
                  "text": "Here it's cheaper to live off campus because on campus they force you to have a meal plan.",
                  "author": "msief",
                  "created": 1581535885,
                  "upvotes": 57,
                  "replies": {
                    "fhf4vz5": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf4vz5/",
                      "text": "I wish. My area charges an arm and a leg for just rent.",
                      "author": "ArtemisTater",
                      "created": 1581536278,
                      "upvotes": 11,
                      "replies": {
                        "fhfv4fe": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfv4fe/",
                          "text": "Same man. A single at my college is prob cheaper than a shared off campus apartment",
                          "author": "Off_again0530",
                          "created": 1581552018,
                          "upvotes": 8,
                          "replies": {}
                        }
                      }
                    },
                    "fhy830a": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhy830a/",
                      "text": "Living in the dorm alone doubles my tuition. Not counting the meal plan that is mandatory if you live on campus.",
                      "author": null,
                      "created": 1581970556,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fhgcugd": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgcugd/",
          "text": "What school you at?",
          "author": "RandomDataUnknown",
          "created": 1581563913,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fhevfbq": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhevfbq/",
      "text": "So there was an incident on MLK day a few years ago. A group of students decided it would be funny to put nooses and cotton on the doors of black basketball players ( they all stay in one wing). The dean of students thought the dorm’s director decision to kick them out of them dorms and basically bar them from reapplying  was too harsh. I was on call when this happened. But after threats of withdrawal of funding from the rich folks from the islands they were expelled.",
      "author": "LittleHaitian",
      "created": 1581530710,
      "upvotes": 197,
      "replies": {
        "fhexa7o": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhexa7o/",
          "text": "Holy shit that’s horrible. Glad they were expelled after the intervention of the money holders but shouldn’t have taken them intervening in the first place.",
          "author": "SpicedCokeAndRum",
          "created": 1581531794,
          "upvotes": 107,
          "replies": {}
        },
        "fhf2bhw": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf2bhw/",
          "text": "I'm guessing this was in the Southeast somewhere?",
          "author": "meatshudder",
          "created": 1581534765,
          "upvotes": 48,
          "replies": {
            "fhf2de5": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf2de5/",
              "text": "sadly...",
              "author": "LittleHaitian",
              "created": 1581534797,
              "upvotes": 22,
              "replies": {
                "fhf2mo4": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf2mo4/",
                  "text": "I moved to this region from the PNW a few years ago and I still get aghast when I see roads named Neuse or sub divisions called something plantation. So ridiculous.",
                  "author": "meatshudder",
                  "created": 1581534948,
                  "upvotes": -5,
                  "replies": {
                    "fhf5fpw": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf5fpw/",
                      "text": "...How is that what you’re concerned about? Neuse is a common place name that has nothing to do with nooses. I have never heard of anyone being offended by the Neuse River.\n\nGetting upset about plantation is understandable, but if an area was historically dominated by a plantation, it makes sense for that name to persist unless there’s some driving force for it to be changed. It’s the way language has evolved.\nRacism is undeniably still a problem in the southeast, but I think it’s a thicc stretch to call the geography of all things racist. \n\nOn another note, I’m in New York state for college, and I’ve heard white guys drop the N-bomb without hesitation more times in the past year here than I have in my entire life growing up in North Carolina. I’ve also noticed a lot of my friends who grew up in the northeast seem guarded around and hesitant to interact with black men (but not black women) both on campus and downtown, compared to people in my age range back home.",
                      "author": "Millibyte_",
                      "created": 1581536599,
                      "upvotes": 46,
                      "replies": {
                        "fhggfhk": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhggfhk/",
                          "text": "This. While the South definitely has a racist past, most of the younger generation of white people really aren't that racist, simply because they've spent their whole lives growing up around black people. You don't get used to saying the N-word as a white guy when half the kids at your high school are black. It's the people from (essentially) white-only regions that are the really bad ones.",
                          "author": "Dj_White_Gold",
                          "created": 1581566471,
                          "upvotes": 13,
                          "replies": {}
                        },
                        "fhgxh0x": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgxh0x/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1581583635,
                          "upvotes": 1,
                          "replies": {
                            "fhhfats": {
                              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhfats/",
                              "text": "I go to RPI in Troy, not a SUNY. Overwhelming majority of students are from NYC, Long Island, other northeastern states, or mainland China. \n\nMy experience with locals here has been a shock though too because they’re even worse than the people in rural areas on the coast (where slavery was rare and the majority is white) back home lol. You’re right about it being more similar than most people realize.",
                              "author": "Millibyte_",
                              "created": 1581602804,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "fhh6v06": {
                              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhh6v06/",
                              "text": "^^^ exactly",
                              "author": "luminous_moonlight",
                              "created": 1581595929,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fhhpgpz": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhpgpz/",
                      "text": "Plantation isn't a racist term. \n\nhttps://www.dictionary.com/browse/plantation",
                      "author": "fu-depaul",
                      "created": 1581609140,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fhepbqo": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhepbqo/",
      "text": "got “wellness checks” twice, once for accidentally pushing all the shit off my desk as I was trying to move it (neighbors heard it and reported it as a self harm incident) and the second time for not noticing that my roommate was in the toilet stall and turning of the lights while she was still in there. The second time was more serious, I didn’t even get told what I was reported for and threatened to “take action on my file” if I did not meet them at the appointed time. Only got out of it intact when I explained to the psychiatrist that our shared bathroom has a public bathroom style stall and you can’t really see under it if you’re just standing/brushing teeth at the sink. \n\nIt honestly just makes me not want to use school mental health services if they’re going to treat me like a criminal or operate exactly like a punishment-based department like honor council or campus police. I’ve been tearing down the helpline/“wellness reporting” posters on campus whenever I can.",
      "author": null,
      "created": 1581527140,
      "upvotes": 609,
      "replies": {
        "fhf1i2y": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf1i2y/",
          "text": "Wow those two incidents could have been easily resolved by your neighbor or roommate talking to you. It's weird they just reported you w/o saying anything\n\nAlso, in my experience some people tend to over exaggerate when they file complaints/reports so staff takes it very seriously or more urgently. It really sucks that pushy  ppl cause trouble for others like that",
          "author": "SheelaGreen",
          "created": 1581534283,
          "upvotes": 286,
          "replies": {
            "fhf3n3f": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf3n3f/",
              "text": "Yeah. She really thought that shitting in darkness and then calling a psychiatric SWAT team on me was easier than like...saying something so I knew she was in there?\n\nHonestly the scariest part of this is how I didn’t even know these procedures/departments existed within the school until I was in them. Mental health services is pretty open about having counselors and appointments but it seems like they’re intentionally hiding the more aggressive disciplinary branch of their operations.",
              "author": null,
              "created": 1581535545,
              "upvotes": 190,
              "replies": {
                "fhgvbkq": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgvbkq/",
                  "text": "Sounds like your roommate who was in the can and didn’t say anything is a fucking moron.",
                  "author": "Plastiqinone",
                  "created": 1581580730,
                  "upvotes": 10,
                  "replies": {}
                },
                "fhfc4nc": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfc4nc/",
                  "text": "Please leave that university before anything escalates. I’ve been in multiple situations were the school hides their wrong doings.\n\n\nEdited: there to there because of grammar police. Thank you for being concerned about my education level.",
                  "author": "AkwardEncounter",
                  "created": 1581540429,
                  "upvotes": 49,
                  "replies": {
                    "fhfcawt": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfcawt/",
                      "text": "I’m graduating pretty soon and spending less time on campus so hopefully I’ll avoid anything seriously physically dangerous",
                      "author": null,
                      "created": 1581540529,
                      "upvotes": 29,
                      "replies": {
                        "fhgdco2": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgdco2/",
                          "text": "What school is this?",
                          "author": "RandomDataUnknown",
                          "created": 1581564264,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "fhfcrbb": {
                          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfcrbb/",
                          "text": "I hope this all works well for you.",
                          "author": "AkwardEncounter",
                          "created": 1581540783,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    },
                    "fhh7f2v": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhh7f2v/",
                      "text": "Hides where wrong doings?",
                      "author": null,
                      "created": 1581596478,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fhf7a5x": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhf7a5x/",
              "text": "In my experience, not so much this stuff but social experiences, people can be really fucking weird about going to a higher authority rather than talking to you about it. The toilet thing shouldn't be hard, \"hey im in here, pls turn on the lights\". Ok no problem. In execution, it turns into a \"hey Chapstick was a horrible person and turned off the lights and im upset\" which is absurd. But, people are weird.",
              "author": "Spader623",
              "created": 1581537661,
              "upvotes": 35,
              "replies": {
                "fhfr5uw": {
                  "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfr5uw/",
                  "text": "I older I get in life, the more people seem to avoid confrontation, it's pretty interesting.",
                  "author": "Abell379",
                  "created": 1581549394,
                  "upvotes": 13,
                  "replies": {
                    "fhi72hg": {
                      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhi72hg/",
                      "text": "We live in a society where we don’t really have to interact with people in person though. Honestly, last night I laughed at myself for calling my friend when I arrived to her house rather than knocking on the door. I thought knocking was too confrontational. We are taught at work to report anything to Human Resources & not to handle it personally. At school to report incidents and don’t take them into your own hands.",
                      "author": "meeggaannnnn",
                      "created": 1581618975,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fhgrfzq": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhgrfzq/",
              "text": "You should check out r/college sometime. At the beginning of the fall semester it becomes overrun with anxious Freshmen telling eachother to resolve any conflict by avoiding the person they have an issue with and taking the issue directly to their RA (for roommate issues) or Department Chair (for everything else).",
              "author": "smaller_fries",
              "created": 1581576152,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "fhhnck9": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhnck9/",
          "text": "My brother made a joke about like taking all the pain killers because he had a headache and that’s how bad it hurt (he’s not good at jokes) and his roommate reported him and he had to spend 3 days in psych on suicide watch 🙄",
          "author": "mngirl29",
          "created": 1581607940,
          "upvotes": 12,
          "replies": {
            "fhhso6m": {
              "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhhso6m/",
              "text": "Suicide watch? Jesus christ that shit is basically jail but you can’t even get people out on bond",
              "author": null,
              "created": 1581610979,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "fhfz0si": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhfz0si/",
          "text": "Holy crap, I have the same problems with my campus’s mental health services. It’s almost a farce.",
          "author": null,
          "created": 1581554698,
          "upvotes": 10,
          "replies": {}
        },
        "fhghfny": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhghfny/",
          "text": "But the whole point of public bathroom style stalls is that one person can use the sink while the other might be using the toilet... I don’t understand your roommate",
          "author": "toiavalle",
          "created": 1581567227,
          "upvotes": 6,
          "replies": {}
        },
        "fj51n4k": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fj51n4k/",
          "text": "I'm sorry but that second one is funny to me. I just picture someone mid poop with the lights off, I can't imagine what they said to get you in trouble and the idiot who went though with it. Shoot if that happen to me I would have natural thought the power went off.",
          "author": "skaiyly",
          "created": 1583022069,
          "upvotes": 1,
          "replies": {}
        },
        "fn9lnuc": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fn9lnuc/",
          "text": "Damn the bathroom thing sucks. My roommate turned the lights off while I was showering several times. It's just an accident, seems like a dumb thing to get in serious trouble for. I'm sorry you got in trouble for something so inconsequential and insignificant",
          "author": "FaceMeetsGround",
          "created": 1586777622,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fheolyp": {
      "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fheolyp/",
      "text": "Props on getting the job tho",
      "author": "dubwpo",
      "created": 1581526723,
      "upvotes": 194,
      "replies": {
        "fhesiut": {
          "link": "/r/college/comments/f2u7h4/whats_the_dumbest_thing_that_university_officials/fhesiut/",
          "text": "Thank you!",
          "author": "SpicedCokeAndRum",
          "created": 1581529024,
          "upvotes": 71,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634052209
}