{
  "sid": "rg13uv",
  "link": "/r/college/comments/rg13uv/professor_suddenly_requiring_respondus_lockdown/",
  "title:": "Professor Suddenly Requiring Respondus Lockdown Browser",
  "text": "Throughout the semester we have not been required at all to use this program, and there has been no mention from our professor in the syllabus, verbally, or even through messages that we will be required to use it. A classmate of mine found out that our final on Thursday says it requires Respondus Lockdown Browser. She found this out after going to take the exam (before she found out it was locked) and seeing it on the exam page. As I said before there has been no mention of requiring it throughout the semester and our professor still hasn’t mentioned anything since she posted the exam on Monday. I am just sort of peeved we were given no warning or mention about this and still have not been told directly by our professor about it and the exam is in a few days. From what I understand, usually professors will let students know well in advance that way the students can make sure they have access to a device that is compatible with the software when the exam rolls around. However this was not the case with this class.",
  "author": "peculiargrey",
  "created": 1639462873,
  "updated": 1639516039,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hohl2xe": {
      "link": "/r/college/comments/rg13uv/professor_suddenly_requiring_respondus_lockdown/hohl2xe/",
      "text": "Respondus is compatible with Windows, Mac, ChromeOS, iPadOS, and requires at most 2GB of ram. The installation takes less than 5 minutes with wifi. I don’t know what kind of computer user you are, but unless Repondus is going to prevent you from cheating, I don’t see how this is a problem.",
      "author": "BusyGene",
      "created": 1639469316,
      "upvotes": 3,
      "replies": {
        "hoho4k4": {
          "link": "/r/college/comments/rg13uv/professor_suddenly_requiring_respondus_lockdown/hoho4k4/",
          "text": "I am fine with using the software. I just didn’t like how there was absolutely no warning ahead of time.",
          "author": "peculiargrey",
          "created": 1639471770,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  }
}