{
  "sid": "mjw8p4",
  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/",
  "title:": "Class full. University won’t let me graduate or open more spots. Advisor told me to “just change my major” after 5 years of hard work and passion 😰",
  "text": "The class I need to take to graduate is full and my university (large but good US college) won’t let me graduate or override it. I talked to my advisor and he said there’s nothing he can do and told me to “change my major” after 5 years of hard work and passion to get the degree I want😭. The Dean is ignoring my email. I already tried to get into this class last semester but couldn’t.... and this semester it’s full again. I’m worried I won’t graduate. My family and I are really poor and can’t afford to pay tuition + rent if I don’t graduate. What can I do?",
  "author": "Agitated-Flatworm903",
  "created": 1617542880,
  "over_18": false,
  "upvotes": 1572,
  "upvote_ratio": 0.94,
  "comments": {
    "gu0kwe1": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gu0kwe1/",
      "text": "Is it possible to take an online class from a different school and have that class tacked onto your current college if you transfer it over during this current year? Say, you did the fasa for your current school only (you can't use the fasa for 2 schools) and you used the aid for an elective and then did an online school for the class you needed (like math but without the fasa you would have to pay for it but their are some cheep school transfer agreements). \n\n&#x200B;\n\nIdk if it's possible to attend 2 schools while receiving financial aid if you only apply said financial aid to one college. But that might work.",
      "author": "Embarrassingleader7",
      "created": 1618032540,
      "upvotes": 1,
      "replies": {}
    },
    "gtp954o": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtp954o/",
      "text": "Take it next semester, enroll as soon as you are able to.",
      "author": "troynotaboy",
      "created": 1617811227,
      "upvotes": 1,
      "replies": {}
    },
    "gthz6uo": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gthz6uo/",
      "text": "Can you take a different class for the requirement and do a class replacement? Check with your Registrar office.",
      "author": "veanell",
      "created": 1617657992,
      "upvotes": 1,
      "replies": {}
    },
    "gtgtsy4": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtgtsy4/",
      "text": "Email the professor(s) with some information regarding their class and your need to graduate. Then email the registrar. Worked for me and I hope it’ll work for you.",
      "author": "bluesteel424",
      "created": 1617639126,
      "upvotes": 1,
      "replies": {}
    },
    "gtg0q8q": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtg0q8q/",
      "text": "Damn that’s trash, sometimes I’m thankfully I’m in a major nobody really picks....\n\nWell I hope they can force you in somehow, seems rather inconvenient and heartless of them to just cast you aside knowing you’re literally one step away from graduating.",
      "author": "ThatOneTy",
      "created": 1617624001,
      "upvotes": 1,
      "replies": {}
    },
    "gtfhwhs": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtfhwhs/",
      "text": "Check if your university has exchange programs or whatever equivalent they might call it. Most reputable universities typically has \"partner universities\" and what this means is that you could do that course or an equivalent course in another nearby university and your university would accept it and transfer it, hence fulfilling the course requirement. My university is relatively small (hence limited course options) and some students have done this in the past.  \n\n&#x200B;\n\nGood luck and don't change your major simply because of one course.",
      "author": "bassaleh",
      "created": 1617607097,
      "upvotes": 1,
      "replies": {}
    },
    "gtffkds": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtffkds/",
      "text": "Definitely fictional. No advisor would suggest you practically start over with a new major just bc you can’t take one class to graduate with your current major.",
      "author": "maddymckay",
      "created": 1617604939,
      "upvotes": 7,
      "replies": {}
    },
    "gtfctbe": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtfctbe/",
      "text": "Have you tried asking for your advisor to change the catalog year for your degree plan? This may be an option only on TX, because my school did it (university as well.) Not sure if this will help your situation but I was in a similar spot last semester where I needed just one class to graduate but it was full and I didn’t have any other classes to take but that one so my advisor was able to switch me to the 2013/2014 catalog of my degree plan since I had started taking college classes in high school instead of the current year. By changing the year, I no longer needed that one class that was full and unavailable and I was able to take a different class that still fulfilled that requirement of my degree. I hope your university/advisors can do something similar. Good luck!",
      "author": "sadbutbad",
      "created": 1617602511,
      "upvotes": 1,
      "replies": {}
    },
    "gtf8jl2": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf8jl2/",
      "text": "I would assume that since you have gone to this school for 5 years you would have had priority registration over many other students. The best advice I have is to email the professor and try to crash the course. Maybe if someone drops you can take the spot.. unless there’s a wait list then you’ll have to spend an extra semester at this college.",
      "author": "bexsimplex",
      "created": 1617599041,
      "upvotes": 1,
      "replies": {}
    },
    "gtf8atw": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf8atw/",
      "text": "worst case senario, just do one course and begin working next semester. Let jobs know the situation",
      "author": null,
      "created": 1617598854,
      "upvotes": 1,
      "replies": {}
    },
    "gtf4cvb": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf4cvb/",
      "text": "go to provost or president maybe even board of directors",
      "author": "deathworld123",
      "created": 1617596035,
      "upvotes": 1,
      "replies": {}
    },
    "gtf41ip": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf41ip/",
      "text": "Is this a U.S. public university, and are you in the country legally?\n\nAre you at a school in your state?\n\nIf the answer to all of those questions is yes, I’d find the names of the state senator and representative for your legal address and ask them for help. \n\nIf you’re going to a public school out of state, I’d talk to the staff of the state Senate or House committee that’s in charge of university budgets for your state. \n\nIf it’s a private school out of state, then I’d find out which accreditation agency accredits CS at your university. If the accreditor doesn’t help, I’d start the process of suing the accreditation agency for accrediting a university that doesn’t make it possible for CS students to finish CS degrees in a timely fashion. \n\nActually, I’d sue both your university and the accreditor for tuition plus living expenses plus the estimated wages resulting from you being out of the workforce while finishing your degree.",
      "author": "podkayne3000",
      "created": 1617595824,
      "upvotes": 1,
      "replies": {}
    },
    "gtez4wg": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtez4wg/",
      "text": "I needed a class for the semester we are currently in to stay on track for graduation, my advisor basically told me to kick rocks so I literally looked up the information for the professor that taught the course, emailed them and asked if they could put me in the class. I explained that it was important and the only class I needed and they ended up putting me in. I recommend trying that way, professors are sometimes better than your own advisor or dean!",
      "author": "jettaturabby",
      "created": 1617592635,
      "upvotes": 1,
      "replies": {}
    },
    "gtexv6n": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtexv6n/",
      "text": "Could you take this class at a different university/college and transfer it over?",
      "author": "nineteenagain",
      "created": 1617591838,
      "upvotes": 1,
      "replies": {}
    },
    "gtewcqg": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtewcqg/",
      "text": "Talk to your advisor about taking that class somewhere else and transferring it to your college. My college allowed that for certain major requirements",
      "author": "NoMoreBadRomances",
      "created": 1617590918,
      "upvotes": 1,
      "replies": {}
    },
    "gtevgee": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtevgee/",
      "text": "Have you tried contacting the professor of the class? Sometimes if you beg hard enough they sometimes allow a spot - based on personal experience.",
      "author": "rollllllllll_",
      "created": 1617590388,
      "upvotes": 1,
      "replies": {
        "gtevjkl": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtevjkl/",
          "text": "nvm just read your response to another comment.",
          "author": "rollllllllll_",
          "created": 1617590438,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gtesb6s": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtesb6s/",
      "text": "Another possibility perhaps.  Some Universities, when a required class is chronically full and missing it can affect graduation, will sometimes allow an independent study with a professor, in lieu of the class.  This of course means you would also need to convince a professor to go along this path as well.  Doesn't always happen, but seen it done in more than one institution. \n\nAlso, if you have no luck with your majors dean nor your advisor, try reaching out to your dean of students, student ombudsman, or whatever title the position is at your campus, and calmly, and logically, lay out your case. \n\nAt the end of the day, schools, in general are judged by their graduation rates. If you have a good record at the school, and this is the only thing preventing your graduation, they may just find a way around the problem.\n\nAll this presumes you are telling the whole truth here.  If there were things under your control you did not take advantage of, such as missing the 1st day of enrollment for a student of your standing, etc, you may get less sympathy",
      "author": "Cherveny2",
      "created": 1617588548,
      "upvotes": 1,
      "replies": {}
    },
    "gteri00": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteri00/",
      "text": "Ombudsman.  You want to call and email the ombudsman of the college the class is listed under.  They could possibly help you.  Usually for when you have a major issue with a high ranking professor.",
      "author": "CozmicOwl16",
      "created": 1617588077,
      "upvotes": 2,
      "replies": {}
    },
    "gteifpi": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteifpi/",
      "text": "email the professor and maybe try to find someone who is willing to drop it",
      "author": "_deathitself",
      "created": 1617582915,
      "upvotes": 2,
      "replies": {}
    },
    "gteftgm": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteftgm/",
      "text": "Often if you email the professor, they can petition to expand the class. Explain your situation and make a case as to why you need the class!! See if the professor can help.",
      "author": "retromoonbow",
      "created": 1617581442,
      "upvotes": 1,
      "replies": {}
    },
    "gtedvlq": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtedvlq/",
      "text": "In general, universities can't do this. You need to complain as far up the chain as you can go. Even though you can't afford it, hint strongly that you'll be seeking legal representation. I had a similar issue and a friend of mine dressed right up in a fancy suit and tie, went to the admin office with a briefcase in hand, said they were representing me over my final course that I couldn't take to graduate, never said they were a lawyer or anything, and school freaked and found room for me. It can be done, but you need to persist. Work on it every day.",
      "author": "Derpwaed",
      "created": 1617580335,
      "upvotes": 0,
      "replies": {
        "gtes5kx": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtes5kx/",
          "text": "I mean, they could, but the university gains far, far more by having another graduate than letting other people into the class. There's far more to OP's story than what they've written.",
          "author": "acm2033",
          "created": 1617588458,
          "upvotes": 3,
          "replies": {
            "gtf1na7": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf1na7/",
              "text": "They can't because it's technically false adverditing to offer a major you can't actually take. But a lazy course advisor won't tell you this. I agree, though, there is more to this since it's very unlikely to happen 2 years in a row unless the poster is constantly late to enrol, doesn't have the grades, etc. \n\nThat said, if they are struggling financially it's important to know that an educational institution cannot just stonewall you into not completing a programme.",
              "author": "Derpwaed",
              "created": 1617594234,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "gtedjbj": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtedjbj/",
      "text": "One of the many issues with college...",
      "author": "kurtap12",
      "created": 1617580138,
      "upvotes": -3,
      "replies": {}
    },
    "gte5ofa": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gte5ofa/",
      "text": "Sound like a solid UCLA",
      "author": "Vocadofries",
      "created": 1617575743,
      "upvotes": 1,
      "replies": {}
    },
    "gte3a58": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gte3a58/",
      "text": "See if you can take an equivalent at another university as a non-degree seeking student or transient student.",
      "author": null,
      "created": 1617574459,
      "upvotes": 1,
      "replies": {}
    },
    "gtdvf7h": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdvf7h/",
      "text": "I would email the professor taking it and see what he says. Also a lot of students drop the class during the first week of school and you can see if you can be one of the firsts added to it when that happens",
      "author": "JMR3898",
      "created": 1617570290,
      "upvotes": 1,
      "replies": {}
    },
    "gtdurnx": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdurnx/",
      "text": "\"top US school\"\n\nSee that's where you went wrong, nobody gives a fuck about you at the big universities. I go to a small college and am on a first name basis with my advisor, provost, and president. \n\nTransfer to a smaller school where they'll actually help you to get your degree. You're transcripts will still say you took 95% of your classes at a \"top US school\" so you can still feel better about yourself because you paid way too much money for a name.",
      "author": "cortez_brosefski",
      "created": 1617569947,
      "upvotes": -11,
      "replies": {
        "gtepu3d": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtepu3d/",
          "text": "“Top US school” does not mean the school is large. Dartmouth and the top liberal arts colleges come to mind. If OP is from a poor family they probably get significant financial aid that only top schools provide.",
          "author": "Queasy_Repair251",
          "created": 1617587123,
          "upvotes": 2,
          "replies": {
            "gterkvd": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gterkvd/",
              "text": "Dartmouth has 6,500 students, my college has 1,200. Just because a college isn't ridiculously large doesn't mean it's not big. Also OP is a computer science major, they aren't going to a liberal arts college. There are 50 people in the class they're trying to get into and 70 people on the waiting list, that is a big school. \n\nDid you even read the post? They said they aren't going to be able to afford tuition or lodging, whatever financial aid they had is not helping them anymore. They can pay $25,000 a semester to stay at their college or go to a smaller college for $5,000-$10,000",
              "author": "cortez_brosefski",
              "created": 1617588124,
              "upvotes": 0,
              "replies": {
                "gtesc6n": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtesc6n/",
                  "text": "Plenty of liberal arts colleges offer computer science majors. At some top schools you only get 8 semesters and then they toss you, so I wouldn’t expect OP to get financial aid for a sixth year. It would be a horrible idea financially for OP to transfer for their sixth year of college. They’d lose courses and it’d be a mess. And I don’t know of any small private college that, for TRANSFER students, is “only” $10,000/yr. Transfer students don’t get much in financial aid or scholarships.\n\nI attended a private college with 2,000 students and it was suffocating. Students each had 1 advisor (sometimes more). That advisor stayed with you all four years and literally watched you like a hawk. Want to add a course (any course) to your schedule even if you are under the max credit limit? Must get written approval!",
                  "author": "Queasy_Repair251",
                  "created": 1617588565,
                  "upvotes": 1,
                  "replies": {
                    "gteud7a": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteud7a/",
                      "text": "You just made my point for me, top schools don't give a fuck about you. I never said to transfer to a private school, my school isn't private. I pay $2,500 a semester in tuition and get as good of an education as any \"top school\" I'm just not gonna wow anybody with the name on my degree. But computer science is computer science, they're teaching me the same shit they teach OP at their school and when employers look at my transcripts they're not gonna care that I didn't go to dartmouth or the flagship state school. \n\nEveryone's situation is different, but OP should be able to find a school that accepts most if not all of their credits for transfer. Two or three semesters at a small school could be less expensive than one at OP's current school. With no aid it would in no way be a \"horrible idea financially\". What would be a horrible idea financially is to pay full tuition and room+board at their current college for one class because the school didn't care enough to help them out",
                      "author": "cortez_brosefski",
                      "created": 1617589749,
                      "upvotes": 0,
                      "replies": {
                        "gteukc3": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteukc3/",
                          "text": "I can’t think of a single public school within hours of me that has only 1,200 students, but maybe OP can. And not many employers with even give your transcript the time of day. They’ll  look at your school name, experiences (ex. research, which mostly happens at big schools), and perhaps your GPA.",
                          "author": "Queasy_Repair251",
                          "created": 1617589867,
                          "upvotes": 1,
                          "replies": {
                            "gtevz61": {
                              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtevz61/",
                              "text": "Nor would I expect you to, as I said everyone's situation is different. But less than 10,000 students would be much better than the likely 25,000+ students at the school OP currently at, there OP could find people actually willing to help them. I can guarantee there is a public school with 3,000-7,000 students within hours of you that you probably  wrote off because it's not \"University of State you live in\" or some school known nationally like dartmouth or brown.",
                              "author": "cortez_brosefski",
                              "created": 1617590697,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gtdtni5": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdtni5/",
      "text": "man, this shit should be illegal\n\nOP, this isn't the ideal way, but I've seen people in similar scenarios as you post on group chats begging/pleading/offering to pay money for people in that class to give up their spot. It may be worth a shot, good luck",
      "author": "purplepiccolo",
      "created": 1617569357,
      "upvotes": 0,
      "replies": {}
    },
    "gtdsjmn": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdsjmn/",
      "text": "Can you get put on a waitlist? At my uni, students that don't really need the class but are taking it because idk they need the extra credits or need a placeholder for something else usually drop out on their own (so just relax and keep checking) or they're prevented from joining the class in general because of some sort of priority system. \n\nThere's also the option of potentially taking the class at another institution, but then you'll REALLY need your Dean to respond.\n\nI'm sorry this is happening though, good luck! Don't lose out hope.",
      "author": "NoodleEmpress",
      "created": 1617568779,
      "upvotes": 1,
      "replies": {
        "gtes1oq": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtes1oq/",
          "text": ">...\n>There's also the option of potentially taking the class at another institution, but then you'll REALLY need your Dean to respond.\n\n\nFor everyone reading this, look up \"residency requirement\" in your catalog.",
          "author": "acm2033",
          "created": 1617588394,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gtdou1j": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdou1j/",
      "text": "Isn't it all on Zoom? What the fuck, tell them to add a spot.",
      "author": "CH705-807",
      "created": 1617566840,
      "upvotes": 0,
      "replies": {
        "gte5l6h": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gte5l6h/",
          "text": "Classes may be on Zoom, but for exams, homework, etc each extra student adds on that much more work for the professor for grading, office hours, etc. According to OP the class size is already 50 which is pretty substantial.  \n  \nOP, I hope you're able to find an alternative solution. I understand your frustration, and it doesn't sound like the adviser and the dean are taking you seriously.",
          "author": "author124",
          "created": 1617575695,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gtdknw9": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdknw9/",
      "text": "This sounds like bullshit.  An entire major doesn’t hinge on a single class.  Walk and take it after, continue to raise hell, or wait.",
      "author": "Texadoro",
      "created": 1617564672,
      "upvotes": 3,
      "replies": {}
    },
    "gtdk2e3": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdk2e3/",
      "text": "Email the professor and see if they can open a seat on your behalf",
      "author": "Putsam",
      "created": 1617564361,
      "upvotes": 1,
      "replies": {}
    },
    "gtdgy2d": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdgy2d/",
      "text": "Can you email the professor explaining your situation, and ask if they’ll work with you as a late-add? Then usually you just have to communicate with the registrar.",
      "author": "Big_Lab_883",
      "created": 1617562731,
      "upvotes": 1,
      "replies": {}
    },
    "gtdaod8": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdaod8/",
      "text": "My first thing would be to communicate directly with the professor who is teaching that class and present your situation. Ask if he/she would be willing to open up one spot for you.",
      "author": "Apprehensive_teapot",
      "created": 1617559480,
      "upvotes": 3,
      "replies": {}
    },
    "gtd917n": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd917n/",
      "text": "Wait, is this for the fall 2021 semester? If so there’s a very likely chance someone will drop the course. If that isn’t good enough, email the professor and explain your situation.",
      "author": "DonMurray1",
      "created": 1617558641,
      "upvotes": 2,
      "replies": {}
    },
    "gtd6r2y": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd6r2y/",
      "text": "Email the professor for the course. Sometimes they have permission codes that allow an additional student. I would explain (very politely) your situation.",
      "author": "Kikirox98",
      "created": 1617557484,
      "upvotes": 0,
      "replies": {}
    },
    "gtd6487": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd6487/",
      "text": "Have you emailed the Professor of that class? They have the power to let you in their class if its full.\n\nThis is truly fucked up. Definitely try emailing the Professor if you haven’t and let them know your situation.",
      "author": "Megadog3",
      "created": 1617557164,
      "upvotes": 1,
      "replies": {
        "gtf3qow": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf3qow/",
          "text": "They said the professor wants to let them in but being a big uni the pet is with the management who is not allowing it.\n\nhttps://www.reddit.com/r/college/comments/mjw8p4/_/gtcjx69",
          "author": "peterfun",
          "created": 1617595622,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gtd4u6z": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd4u6z/",
      "text": "When’s the class start? Next September? I can almost guarantee that there’ll be so much turn around that you’ll get in by then. What place are you on the waitlist?",
      "author": "kapbear",
      "created": 1617556511,
      "upvotes": 2,
      "replies": {}
    },
    "gtd4hpj": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd4hpj/",
      "text": "That's crazy. I needed one last class too and both classes were full. My advisor, who was also one of two professors offering the class, made room for me.",
      "author": "LikelyWriting",
      "created": 1617556333,
      "upvotes": 3,
      "replies": {}
    },
    "gtd3pgv": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd3pgv/",
      "text": "Call the dean and keep talking to anyone in the school bureaucracy who will listen till you get some kind of help or suggestion. Being a nuisance has helped me out with school problems before. Always call and talk to a human if you can",
      "author": null,
      "created": 1617555934,
      "upvotes": -2,
      "replies": {}
    },
    "gtd24mz": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd24mz/",
      "text": "Something doesn't add up here... did you miss registration by a few hours? Seniors get priority when registering for classes to try to avoid these exact issues. I can't believe that your advisor would tell you to change majors over 1 class, mine would try his hardest to squeeze me into the class if I was in this situation. \n\nIf the dean is ignoring your emails, try emailing your schools retention coordinator, they are great people to know and can help you because it's literally their job to keep students on track for graduation.",
      "author": "spencefunk",
      "created": 1617555130,
      "upvotes": 99,
      "replies": {
        "gtd7wzg": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd7wzg/",
          "text": "Yeah, graduate rates/degree completion are pretty important to schools. I don’t buy that an advisor would tell a fifth-year student to change majors over one class.",
          "author": "nlh1013",
          "created": 1617558074,
          "upvotes": 38,
          "replies": {}
        },
        "gtd8b7e": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd8b7e/",
          "text": "This and also aren’t you supposed to apply for graduation way beforehand?",
          "author": "hlaiie",
          "created": 1617558277,
          "upvotes": 27,
          "replies": {}
        },
        "gtf44qw": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf44qw/",
          "text": "Yeah something isn’t adding up. No good reputable college would do this to one of their students.",
          "author": "GodOfThunder101",
          "created": 1617595883,
          "upvotes": 6,
          "replies": {}
        },
        "gte7ohu": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gte7ohu/",
          "text": "I’m thinking this.",
          "author": "AltArea51",
          "created": 1617576840,
          "upvotes": 5,
          "replies": {}
        },
        "gtf4037": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf4037/",
          "text": "some universities have people who can register for classes before seniors",
          "author": "deathworld123",
          "created": 1617595797,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gtd1c4l": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd1c4l/",
      "text": "Assuming this story is legit, you should first seek immediate attention from your university’s psychological counseling department. Call student health and get directed to the appropriate number for crisis counseling. Don’t wait for an appointment. Go in and tell them you’re causing harm to yourself and need help. If you can’t go in, call them or call one of the 24/7 crisis hotlines available on google. You cannot be causing harm to yourself because you can’t get into a class. None of this stuff is that important and you should primarily focus on protecting your health and addressing your coping skills before you worry about minor problems like not being able to reach your dean or escalate your concerns with the academic advising hierarchy to smooth this over. Seriously, prioritize your health right now. Deal with this school issue once you’ve addressed these self-harming behaviors.",
      "author": "asuhdude01",
      "created": 1617554728,
      "upvotes": 12,
      "replies": {}
    },
    "gtd0mdv": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd0mdv/",
      "text": "you're leaving something out here, because if its really the last class you need to graduate you should have had priority registration to sign up much in advance. Also doesn't make sense for any advisor to say that, along with emailing the dean (of the college? the university?)",
      "author": "Leeerrrooyyyjennkins",
      "created": 1617554364,
      "upvotes": 48,
      "replies": {
        "gtd0x2r": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd0x2r/",
          "text": "I have 6 classes left for my last semester. I got into 5 but not this one class. I go to a big public university where I’m not important enough to be given a spot to graduate",
          "author": "Agitated-Flatworm903",
          "created": 1617554516,
          "upvotes": -40,
          "replies": {
            "gtd2f6m": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd2f6m/",
              "text": "You're still not answering some of the key questions. Are you not given priority during class registration? Things aren't adding up here. In our school (also a big public school) you also apply for graduation a semester before. Have you done that?",
              "author": "gargar070402",
              "created": 1617555282,
              "upvotes": 63,
              "replies": {
                "gtdfhdu": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdfhdu/",
                  "text": "I also went to a large public university (35k students). After applying for graduation I had zero problems getting whatever classes I wanted.",
                  "author": "bradnod",
                  "created": 1617561973,
                  "upvotes": 21,
                  "replies": {}
                }
              }
            },
            "gtdeue1": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdeue1/",
              "text": "When was your registration date and when did you actually try to register? As a senior you get registration priority.",
              "author": "MyHeartIsByTheOcean",
              "created": 1617561641,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "gtczllr": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtczllr/",
      "text": "Email whoever the professor for this class is.  Explain who you've already tried to contact, that this has been a multi-semester issue, and why it's so important that you take the class this semester.  I know at my university it wasn't an uncommon occurrence for professors to bend the size rules a bit to allow for students to graduate on time.",
      "author": "JSD12345",
      "created": 1617553849,
      "upvotes": 7,
      "replies": {}
    },
    "gtczl5w": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtczl5w/",
      "text": "Will your university approve for you to take a different class in its place, like a substitution?\n\nHave you tried contacting the professor of the course to get added? \n\nIf it was me, I would keep going up the chain with your request to take the class. Make a stink. You’ve worked hard and deserve to finish your degree in a timely manner. Intentionally keeping students from graduation over one class is awful.",
      "author": "Balls300",
      "created": 1617553842,
      "upvotes": 9,
      "replies": {}
    },
    "gtcz69x": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcz69x/",
      "text": "Contact the professor of the class, explain the situation to them and ask them to let you in.",
      "author": "Blackberries11",
      "created": 1617553628,
      "upvotes": 2,
      "replies": {}
    },
    "gtcxkdt": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcxkdt/",
      "text": "You likely need to escalate this to the university ombudsman’s office. If you’re literally one class away from boosting their persistence numbers, I can see you being successful escalating the issue. If anything, demand a waiver to take the class elsewhere if they won’t accommodate you. This does mean applying to, and being accepted at, another school. If it’s a more general class, find an equivalent at a community college. It’s cheaper, you can still use financial aid, and they have an almost universal acceptance rate.",
      "author": "world-shaker",
      "created": 1617552810,
      "upvotes": 18,
      "replies": {}
    },
    "gtcwlji": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcwlji/",
      "text": "I faced a similar situation (the clas I needed wasn’t offered in my last two semesters). I was able to do an independent study with a professor to cover the course requirements.",
      "author": "keithhannen",
      "created": 1617552312,
      "upvotes": 35,
      "replies": {}
    },
    "gtcwg9k": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcwg9k/",
      "text": "Can you speak to the professor of the class?  At my school, professors can add students over cap limit.",
      "author": "jayswaz",
      "created": 1617552236,
      "upvotes": 14,
      "replies": {
        "gters4d": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gters4d/",
          "text": "That's not always up to the instructor.",
          "author": "acm2033",
          "created": 1617588239,
          "upvotes": 2,
          "replies": {
            "gtf4nre": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf4nre/",
              "text": "But sometimes it is so it can't hurt to try.",
              "author": "PonchoHung",
              "created": 1617596243,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gtd23zg": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd23zg/",
          "text": "yes, I would definitely email the professor!! Someone I know in one class insisted with the professor that they take the class and just did not leave. I know it seems like kind of a not nice thing to do but you are paying for that education - definitely send the professor an email and ask to speak with them as well.",
          "author": "alphabetcarrotcake",
          "created": 1617555121,
          "upvotes": -1,
          "replies": {
            "gtgv867": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtgv867/",
              "text": ">I know it seems like kind of a not nice thing to do but you are paying for that education\n\nThat doesn't give anyone the right to harass someone else. Class caps exist for a reason. Lastly, paying tuition isn't paying for the class, it's paying for the opportunity to obtain a degree, which doesn't entitle anyone to specific classes.",
              "author": "AstuteYetIgnored",
              "created": 1617639760,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gtcw9bg": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcw9bg/",
      "text": "My school gave priority to seniors about to graduate. Sorry about this situation, sheesh",
      "author": "yblehs16",
      "created": 1617552138,
      "upvotes": 74,
      "replies": {}
    },
    "gtcw7p5": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcw7p5/",
      "text": "For the time being take up an internship/job to gain experience related to your field. During this keep in contact with your advisor and ensure they understand your situation. With tens of weeks of advance notice there is no way they should not be able to get you in!",
      "author": "Kerisma123",
      "created": 1617552115,
      "upvotes": 1,
      "replies": {}
    },
    "gtcw2hc": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcw2hc/",
      "text": "You can't go straight to the dean if you haven't worked your way up yet. Contact the program director and department head. If they ignore you, then you'll have a strong argument for the dean.",
      "author": "Emayfss",
      "created": 1617552040,
      "upvotes": 43,
      "replies": {}
    },
    "gtcuswb": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcuswb/",
      "text": "what's his logic if you did change majors *only to be told the class would be full then??* I swear they dont think about the outcomes here. but I would look into if you can taking the course at a Junior college and transferring it in. look at your academic AND graduation policies (with the registrar & school) about any stipulations. \n\nMy experience was that I retook a freshman-level class and didn't get the right grade for my gpa, did not graduate then took advantage of the pandemic and took it at a junior college to transfer it in ( I asked ahead of time and they said it was okay) . I do that only to be told my institution GPA is not fullfilled by degree requirements and the only solution was to change my minor to something else. ugh I cant stand that school to be honest.",
      "author": "AXXII_wreckless",
      "created": 1617551388,
      "upvotes": -9,
      "replies": {}
    },
    "gtcshmw": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcshmw/",
      "text": "Try talking to the President of your university. I have done that before, when I couldn't get help from others in the school. They would be more than understanding, and may help you get into a class or give you permission to gain the credit at another institution.",
      "author": "SpaghettiTacoSpencer",
      "created": 1617550189,
      "upvotes": -15,
      "replies": {
        "gtcwa4k": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcwa4k/",
          "text": "You must have had a really kind/understanding President, went to a smaller and/or private university, or both. In most situations you would e-mail \"their\" public e-mail address, or call their public phone number, which would be replied to by an admin assistant directing you to the appropriate office(s) for whatever the concern is.",
          "author": "purple_ombudsman",
          "created": 1617552148,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "gtcs154": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcs154/",
      "text": "You may want to go into the registrar and ask about your problem there. Many school's registrar have forms that allow you to register for a class even though it's full. Typically to do this you'll need to show that it's a course needed to graduate and you'll need to get a signature from the professor teaching the course saying they're cool with another student being added to the class.",
      "author": "Kenga97",
      "created": 1617549949,
      "upvotes": 13,
      "replies": {}
    },
    "gtcn5s9": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcn5s9/",
      "text": "You can't wait to take it in summer or next fall? I understand this will delay your graduation but this is better than changing your major; this is even doesn't make any sense to change your major because one class ls full or you can even take it in another university and transfer it to your university. This is possible in many universities",
      "author": "Life-Administration8",
      "created": 1617547342,
      "upvotes": 28,
      "replies": {}
    },
    "gtcn0xh": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcn0xh/",
      "text": "Why would the advisor tell you to switch majors because you’re missing one class?",
      "author": "armhad",
      "created": 1617547269,
      "upvotes": 783,
      "replies": {
        "gtctjsv": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtctjsv/",
          "text": "Does not make sense.",
          "author": "Truebesobedooo",
          "created": 1617550738,
          "upvotes": 409,
          "replies": {
            "gtcviyv": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcviyv/",
              "text": "This feels like a very incomplete story or a fictional story.",
              "author": "yostreed",
              "created": 1617551762,
              "upvotes": 502,
              "replies": {
                "gtcw9a9": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcw9a9/",
                  "text": "nope, this might be UCF. Big universities are literally trash. My major had 4 different advisors in my 3 years there.",
                  "author": "A_Moment_in_History",
                  "created": 1617552137,
                  "upvotes": 173,
                  "replies": {
                    "gtd7jqs": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd7jqs/",
                      "text": "I’m not sure how all schools are, but I go to one of the largest schools in my state and there’s probably 6 or 7 advisors for the business school alone. I don’t think anyone’s assigned to one advisor, you just book an appointment for the one you prefer or whoever is available first.",
                      "author": "throwaway13630923",
                      "created": 1617557886,
                      "upvotes": 42,
                      "replies": {
                        "gtf3wq8": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf3wq8/",
                          "text": "ironically thats exactly how it worked at ucf haha",
                          "author": "__under_score__",
                          "created": 1617595735,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    },
                    "gtec9e5": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtec9e5/",
                      "text": "U Can't Finish",
                      "author": "IntelligentBakedGood",
                      "created": 1617579408,
                      "upvotes": 13,
                      "replies": {}
                    },
                    "gtcyfvj": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcyfvj/",
                      "text": "Not all. This sounds like a UCLA thing, etc.\n\nI go to a big school, UVA, and they are very very good about opening spots if folks need to graduate.",
                      "author": "rain6304",
                      "created": 1617553253,
                      "upvotes": 103,
                      "replies": {
                        "gtdc32j": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdc32j/",
                          "text": "UCLA would never. Keep that slander outta here",
                          "author": "chill_antelope",
                          "created": 1617560210,
                          "upvotes": 21,
                          "replies": {
                            "gtde2ea": {
                              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtde2ea/",
                              "text": "Really? Because I know people directly who weren’t able to get classes there they needed to graduate and the school didn’t give a damn.",
                              "author": "rain6304",
                              "created": 1617561234,
                              "upvotes": 38,
                              "replies": {}
                            },
                            "gteqag1": {
                              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteqag1/",
                              "text": "UCLA has a pretty low 4 year grad rate compared to schools of its caliber precisely because it does this. That’s not slander.",
                              "author": "Queasy_Repair251",
                              "created": 1617587379,
                              "upvotes": 12,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gtd1ylq": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd1ylq/",
                      "text": "little schools do this as well",
                      "author": "alphabetcarrotcake",
                      "created": 1617555044,
                      "upvotes": 13,
                      "replies": {}
                    },
                    "gtfgzb7": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtfgzb7/",
                      "text": "I had it happen for my associates at a state CC and then for my undergrad at the state flagship school, they don’t care",
                      "author": "cadilks",
                      "created": 1617606217,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "gtd1c8l": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd1c8l/",
                  "text": "University rules are trash, it’s believable",
                  "author": "mcatpremedquestions",
                  "created": 1617554730,
                  "upvotes": 27,
                  "replies": {
                    "gtd1u3j": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd1u3j/",
                      "text": "Sure, I could believe the bad rules... in isolation. But not the bad rules, the advisor that just says \"change majors\", the dean that doesn't reply, the poor family with no financial aid, AND the school being a top-ranked US school.  \n\n\nThe student is not a stats major because they are spinning a yarn with nearly a dozen unlikely events all in a row. Without a lot more information, I don't believe this story.",
                      "author": "yostreed",
                      "created": 1617554981,
                      "upvotes": 49,
                      "replies": {
                        "gtd2ohd": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd2ohd/",
                          "text": "I literally fit all these boxes lol. So I believe the story",
                          "author": "mcatpremedquestions",
                          "created": 1617555411,
                          "upvotes": 19,
                          "replies": {}
                        },
                        "gtdcuh1": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdcuh1/",
                          "text": "This shit happens in the UC system all the time, especially with really competitive majors like EE/CS. I go to a much smaller private school that pays more attention to advising and whatnot but one of my majors is still so poorly managed that I wasn't able to start taking classes related to that major until I became a junior and I was able to jump over all the random premeds wanting electives.",
                          "author": null,
                          "created": 1617560608,
                          "upvotes": 4,
                          "replies": {}
                        },
                        "gtd78bp": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd78bp/",
                          "text": "I’ve been CS for 5 years. My school has a policy that allows anyone to switch majors whenever they want. Computer Science became so popular the past 2-3 year so almost everyone switched to CS. And now the school can’t support all the students switching to CS. There’s not enough professors to teach CS classes because it’s in demand. And Do you not know any poor students going to top schools like UC Berkeley, UCLA, UMICH? Your world must be very small.",
                          "author": "Agitated-Flatworm903",
                          "created": 1617557724,
                          "upvotes": -5,
                          "replies": {
                            "gtd8jpd": {
                              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd8jpd/",
                              "text": "What school are you referring to? Why are you hiding this information? 1 class, I have felt with a handful of Southern California university, private / state / UC sector ... none of them would hold back a graduation for 1 class and none of them would truly recommend you switch majors if you couldn’t fulfill 1 class. Hurting yourself is never the answer and will only compound a problem you already have. \n\nAn advisor told my 1st baby mom sister that she would never get into USC with her grades and so on, she was crying and crying, well she graduated form USC 3 years later after her support system said F0ck that advisor, MAKE YOUR OWN PATH, it’s your life.",
                              "author": "Truebesobedooo",
                              "created": 1617558396,
                              "upvotes": 19,
                              "replies": {}
                            },
                            "gtd9aox": {
                              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd9aox/",
                              "text": "I was a poor student at the University of Michigan for my undergrad. I'm pretty sure Michigan accepts FAFSA.  \n\n\nEvery school allows students to change majors. You're honestly trying to tell me a school has a class required for graduation that is hard-capped at 50 per semester, it is taught in both the fall and the spring semester, and yet the department has well over 100 students trying to graduate a year? I honestly don't believe that for a hot second. There are layers of curriculum committees and admin that would flag and correct that problem.  \n\n\nWhat else is there to this story?",
                              "author": "yostreed",
                              "created": 1617558774,
                              "upvotes": 38,
                              "replies": {
                                "gtda29f": {
                                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtda29f/",
                                  "text": "If you’re not trying to help and just trying to make me feel worse can you exit my post? You’re not me and I’m not you. You don’t know who I am so don’t judge me like that. I haven’t done anything to you.\n\nCS has track that I was working toward. If I don’t get into that class and take another class just to graduate instead my major on the diploma will be math major. While you can say it has some similarity to “CS”, It’s not the degree I want.",
                                  "author": "Agitated-Flatworm903",
                                  "created": 1617559168,
                                  "upvotes": -27,
                                  "replies": {
                                    "gtdasbu": {
                                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdasbu/",
                                      "text": "Ah ha, there is it. Your advisor isn't telling you to change your major, they suggested a different track within your major. There is a huge difference there!\n\nWhile I'm not in CS, I do have a PhD in a STEM field. In my experience, no one really cares what your official degree is called. When applying for jobs/positions, just call your degree a Computational Math degree with a strong focus in CS on your cover letters. It honestly doesn't change anything about you as a person.",
                                      "author": "yostreed",
                                      "created": 1617559536,
                                      "upvotes": 57,
                                      "replies": {
                                        "gtdg5pz": {
                                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdg5pz/",
                                          "text": "How do you really make that distinction though? Because in my school that would be a change of major not a change of track within a major. If its a bachelor of science degree, a major in computational math and computer science can be different, though the distinction isn't major in terms of qualifications.",
                                          "author": "SensitiveWeb8",
                                          "created": 1617562320,
                                          "upvotes": 11,
                                          "replies": {
                                            "gtdiepk": {
                                              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdiepk/",
                                              "text": "That is why I don't fully believe and/or understand the situation as presented by OP.",
                                              "author": "yostreed",
                                              "created": 1617563495,
                                              "upvotes": 5,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "gtfbrni": {
                                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtfbrni/",
                                      "text": "We ARE trying to help, but we can't if you keep ommitting important details from the full picture! What you described really doesn't make sense under most schools' policies, so we really need to understand your full situation to help you here. We can't help you if you aren't helping yourself.",
                                      "author": "gargar070402",
                                      "created": 1617601635,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "gteq3iv": {
                              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteq3iv/",
                              "text": "Only a very very small % of college students nationally attend UCB, UCLA, or UMich.",
                              "author": "Queasy_Repair251",
                              "created": 1617587271,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gtd7u1m": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd7u1m/",
              "text": "(Top US school) made me roll my eyes so hard that I’m just gonna believe it’s fictional.",
              "author": "Thrillkilled",
              "created": 1617558032,
              "upvotes": 24,
              "replies": {}
            }
          }
        },
        "gtdpid8": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdpid8/",
          "text": "Idk I’ve met some pretty crummy advisors. Unfortunately, I’m not surprised.",
          "author": "peachyypeachh",
          "created": 1617567200,
          "upvotes": 22,
          "replies": {
            "gtdvqpl": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdvqpl/",
              "text": "Yeah, my first word of advice to people who attend my college is that they need to be individually responsible to ensure that they know where to look up their required classes for graduation, and the prerequisites/schedules for those.\n\nToo many horror stories of people who take what advisors say at face value without the slightest bit of consideration that they should actually validate/verify all that for themselves.",
              "author": "darkapplepolisher",
              "created": 1617570457,
              "upvotes": 28,
              "replies": {
                "gteqxs8": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteqxs8/",
                  "text": "I wish more students took this advice.  I'm an advisor and have had so many students transfer to my major with a totally borked course plan of study because they stumbled into a bad advising session, misunderstood something, didn't get referred to the right department, etc.  For example, in my area, there are two similar-looking sets of classes.  One counts for our degree and the other does not.  Multiple advisors were telling students they could get around having to formally see me for advising by taking the other classes and it would be fine.  Then, when they should have been at the end of their college careers and had to see me for a permit for our final course, I had to be the bad guy and tell them they couldn't graduate with that degree.  :(  When called out on it, the other advisors were like, \"Oh?  It doesn't count?  That sucks.\" like they hadn't just wasted $6,000 of a student's money, plus time and effort.",
                  "author": "TheKwongdzu",
                  "created": 1617587754,
                  "upvotes": 12,
                  "replies": {
                    "gtggugk": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtggugk/",
                      "text": "This happened with one of my classes, luckily it was an arts elective from a CC. I would be extremely mad if it was a university class in both price and rigour. Transferring from a CC is so rough but some people just have to do it because of cost.",
                      "author": null,
                      "created": 1617633133,
                      "upvotes": 1,
                      "replies": {
                        "gtiybl4": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtiybl4/",
                          "text": "I'm glad for your sake it was just an elective!  These were five upper-division University courses.",
                          "author": "TheKwongdzu",
                          "created": 1617675820,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gtcynan": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcynan/",
          "text": "I think the mods need to consider banning or heavily moderating these “story” posts. Half of them are BS and the other half are from people that are too chicken shit to just go to the department head or the dean. They are adding nothing to the subreddit.",
          "author": "Jakeremix",
          "created": 1617553356,
          "upvotes": 62,
          "replies": {
            "gtd4mvl": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd4mvl/",
              "text": "almost all of these problem stories could be solved with just going up the chain of command. A lot people talk to the advisor and just stop there for some reason.",
              "author": "WWalker17",
              "created": 1617556406,
              "upvotes": 14,
              "replies": {
                "gtdbe8w": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdbe8w/",
                  "text": "i mean he just said the dean is ignoring him",
                  "author": "coldblade2000",
                  "created": 1617559850,
                  "upvotes": 5,
                  "replies": {
                    "gtdbu3y": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdbu3y/",
                      "text": "Then go to the Provost? The Dean isn't the end-all-be-all of academic authority.",
                      "author": "WWalker17",
                      "created": 1617560082,
                      "upvotes": 17,
                      "replies": {
                        "gtf1dlv": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf1dlv/",
                          "text": "Exactly. Physically take yourself to the Dean’s office and park yo ass in a chair until you cannot be ignored. Go and FIX the situation. These are the [stuck on an escalator](https://youtu.be/VrSUe_m19FY) people. It’s learned helplessness, and I have little sympathy. Jesus, learn to be a self advocate.",
                          "author": "IthacanPenny",
                          "created": 1617594056,
                          "upvotes": 5,
                          "replies": {}
                        },
                        "gtf1193": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf1193/",
                          "text": "This, and be sure to mention how situations like this impact the institution's on time graduation rate.",
                          "author": "fixtobreak",
                          "created": 1617593829,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gtczh31": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtczh31/",
              "text": "Exactly. 75% of people need to be told to take a deep breath and go write an email. The other 25% are just whining and can’t be helped. r/CollegeRant exists for a reason...",
              "author": "GreyStomp",
              "created": 1617553784,
              "upvotes": 36,
              "replies": {}
            }
          }
        },
        "gthgm00": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gthgm00/",
          "text": "The same thing happened to me! My major was being phased out (boo), none of the students were notified, and a whole bunch of courses disappeared, so the courses that remained were full. Some of us were told to switch degrees, meaning an extra 1-2 YEARS of school. Turns out, that was a big lie, the course counselor had the power to get us into courses that could allow us to graduate, but it was a lot of work on their part, so they simply didn't want to do it. I put up a big stink (by that I mean I had a panic attack at a meeting lol) and was put into the courses I needed to to graduate. After that I saw a different course counselor . . .",
          "author": "eggsistoast",
          "created": 1617649452,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gtckp4j": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtckp4j/",
      "text": "If it’s one class, are you able to still walk and then take the class next semester? Universities also usually have a priority system such that those who need a class to graduate get priority, though there are other factors involved, as well.",
      "author": "PhDapper",
      "created": 1617545959,
      "upvotes": 820,
      "replies": {
        "gtcz7r0": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcz7r0/",
          "text": "This.\n\nthe last class i needed to get my undergrad degree only had 3 students enrolled in it.. they only offered it because i needed it to graduate.\n\nit’s surprising to me they won’t allow you to enroll/didn’t give you priority considering you needed it",
          "author": "miguelmathletics",
          "created": 1617553650,
          "upvotes": 423,
          "replies": {}
        },
        "gte2h0t": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gte2h0t/",
          "text": "My friend walked without realizing she had 2 classes left. She was able to take those two classes during summr and recieved her diploma in summer.",
          "author": "jessisgonz",
          "created": 1617574024,
          "upvotes": 90,
          "replies": {
            "gtf4oxy": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf4oxy/",
              "text": "How the hell do people not know what classes they need? I check like 4 times a semester lol",
              "author": "needhelpne2020",
              "created": 1617596265,
              "upvotes": 57,
              "replies": {
                "gtf5y9m": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf5y9m/",
                  "text": "probably \"I was just going by what my advisor told me\"\n\nCan you tell I've been screwed over by the college advisors in the past?",
                  "author": "symmetrical_kettle",
                  "created": 1617597132,
                  "upvotes": 44,
                  "replies": {
                    "gtfm328": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtfm328/",
                      "text": "Oof my advisor emailed me 7 days before this semester (my last one) started to tell me I wouldn’t graduate unless I added a freshman science 101 class onto my schedule💀  this was after continuous meetings and reassurances that I was good to go",
                      "author": "Useful_Bread_4496",
                      "created": 1617611241,
                      "upvotes": 15,
                      "replies": {}
                    },
                    "gtfp0qy": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtfp0qy/",
                      "text": "Glad I’m not the only one who had awful experiences with their advisors!!",
                      "author": "cactusjaci420",
                      "created": 1617614182,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "gtflgtp": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtflgtp/",
                  "text": "I know in my case, our university is terrible at updating the online graduation requirement check so there are classes listed that haven't been offered in at least 2 years. I just had to submit a lot of course substitution forms and hope they all go through before next month.",
                  "author": "chocolatechipsims",
                  "created": 1617610623,
                  "upvotes": 5,
                  "replies": {
                    "gtgwb6o": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtgwb6o/",
                      "text": "oh man that sucks",
                      "author": "needhelpne2020",
                      "created": 1617640245,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "gtg80ms": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtg80ms/",
                  "text": "Bad advice from advisors, computer errors, random “gotchas” from administration \n\nIt happens to almost everyone",
                  "author": "tlacct",
                  "created": 1617628501,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gtckgnr": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtckgnr/",
      "text": "Is it possible for you to take the class through a different university and transfer the credit over by the end of the semester? I’ve had to do this before, but it was a 100 level class, which I assume is not the level class you are taking.",
      "author": "Apprehensive-Gur1619",
      "created": 1617545826,
      "upvotes": 530,
      "replies": {
        "gtcx9oo": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcx9oo/",
          "text": "OP: If you go this route you’ll almost certainly need a waiver from your dean. If this is for summer or fall, the time to ask is now. This does mean you’ll have to apply to, and be accepted at, another school. If this is an elective style course you’re likely to find anywhere, take it at a community college. It’s cheaper and they have an almost universal acceptance rate.",
          "author": "world-shaker",
          "created": 1617552656,
          "upvotes": 191,
          "replies": {}
        },
        "gtcw21l": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcw21l/",
          "text": "Many universities require that your last handful of credits (it’s 30 at my university) are taken on site and cannot be transferred. So if you go this route, OP, make sure you look into the rules.",
          "author": "morose_bug",
          "created": 1617552034,
          "upvotes": 133,
          "replies": {
            "gtdbmot": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdbmot/",
              "text": "Same mine requires 45.. that policy definitely screwed a lot of people over during covid. Seniors and juniors didn't get the choose to take online classes at a CC.",
              "author": "elocinkrob",
              "created": 1617559973,
              "upvotes": 20,
              "replies": {}
            },
            "gter1ru": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gter1ru/",
              "text": "Look up \"residency requirement\" in your catalog.",
              "author": "acm2033",
              "created": 1617587817,
              "upvotes": 8,
              "replies": {}
            },
            "gteqmx1": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteqmx1/",
              "text": "Most universities do, however they aren’t going to make someone who forget to take a university-required 100 level class onsite rather than at a cc as a senior just because of that sort of rule. Usually it’s # of credits that can be transferred in, not last # of credits must be taken in order onsite.",
              "author": "Queasy_Repair251",
              "created": 1617587578,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gtcj5dt": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcj5dt/",
      "text": "Join the wait list if they have one and check the class every day to see if someone drops it. Contact the professor of that class as well. A week into the class sometimes people drop the class, see if you can join then by talking with the professor.",
      "author": "sadgurI",
      "created": 1617545053,
      "upvotes": 107,
      "replies": {
        "gtcjx69": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcjx69/",
          "text": "The waitlist is also full. The class has 50 spots (full). Waitlist has (70 spots) but also full.....\n\nThe professor has no problem taking me into the class but she isn’t allowed to. It’s a big university and professor has 0 power. Everything is hierarchical and centralized",
          "author": "Agitated-Flatworm903",
          "created": 1617545511,
          "upvotes": 80,
          "replies": {
            "gtcvi2h": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcvi2h/",
              "text": "That's odd... typically schools will give registration priority to students who are closer to graduation over students who still have more classes to complete.\n\nIf you just have a single class to complete, you ought to have been allowed to register for classes super-early before the class and wait-lists filled up.  Unless all 120 students ahead of you are also 1 class away from graduation?  Did you get priority registration?  Did you try to sign up for the class as soon as your registration window opened, or did you wait to register?\n\nI'd suggest talking to the registrar and seeing if they can enroll you in the course early for next semester, etc.  Before general registration even opens.\n\nWhat is the class?  Is it like a \"senior thesis\" course, or is it a lower division general ed?",
              "author": "lupineblue2600",
              "created": 1617551749,
              "upvotes": 116,
              "replies": {
                "gtdgxaa": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdgxaa/",
                  "text": "Hey uh, is hating minorities still working out for you?",
                  "author": "ohik9615",
                  "created": 1617562720,
                  "upvotes": -36,
                  "replies": {
                    "gtdkom1": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdkom1/",
                      "text": "You wanna provide some evidence to support your laughable premise?",
                      "author": "lupineblue2600",
                      "created": 1617564682,
                      "upvotes": 12,
                      "replies": {
                        "gtdnmm7": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdnmm7/",
                          "text": "[https://www.reddit.com/r/FuckTheS/comments/kiezw3/do\\_you\\_guys\\_hate\\_autistic\\_people\\_or\\_something/](https://www.reddit.com/r/FuckTheS/comments/kiezw3/do_you_guys_hate_autistic_people_or_something/) you deeply and passionately hate the disabled",
                          "author": "ohik9615",
                          "created": 1617566211,
                          "upvotes": -18,
                          "replies": {
                            "gtdohy0": {
                              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdohy0/",
                              "text": "Oh sweetie, if you thought ANY of the replies in that thread (or that entire sub) are anything other than sarcastic, you may be on the spectrum.\n\nThe /r/FuckTheS sub is LITERALLY built around sarcasm and mocking those who are too dense to detect sarcasm without it being explicitly stated.  Did you not pick up on that?  Did you not anticipate that comments in that sub may not be serious?  Did someone firmly and deeply press on your soft spot when you were an infant?\n\nI guess if you consider stupidity to be a disability, then your statement would be true.  Has the DSM-IV added it yet?  I'm sure it's just a matter of time.",
                              "author": "lupineblue2600",
                              "created": 1617566664,
                              "upvotes": 14,
                              "replies": {
                                "gtf5bm8": {
                                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtf5bm8/",
                                  "text": "This is really rude. You got your point across and yeah they were in the wrong but from their confusion itself you can pretty clearly tell this commenter is neuroatypical. Why berate someone for their autism? Your invective and over the top condescension is gross.",
                                  "author": "Remarkable-Ad-3950",
                                  "created": 1617596691,
                                  "upvotes": -5,
                                  "replies": {
                                    "gtg8k3z": {
                                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtg8k3z/",
                                      "text": "> but from their confusion itself you can pretty clearly tell this commenter is neuroatypical.\n\nJust because someone takes the internet too seriously and doesn't pick up that comments are sarcastic is not in itself indicative of autism.  I prefer to not make assumptions of a person's mental health.\n\nThat said, I suspect most redditors are neuroatypical, for various reasons.",
                                      "author": "lupineblue2600",
                                      "created": 1617628800,
                                      "upvotes": 0,
                                      "replies": {
                                        "gtgxclh": {
                                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtgxclh/",
                                          "text": "I agree that people shouldn't make assumptions about who is/isn't neurodivergent, but...you were still kind of rude even after they said they were autistic and said why they were reacting the way they did. You don't have to fall over yourself apologizing or anything like that, but it doesn't take that much effort to be like, \"I recognize that you were offended because you didn't realize it was sarcasm and that you had a good reason for not realizing it was sarcasm, I can assure you that any and all comments I have ever made along those lines are entirely sarcastic,\" even if you think they should have known better.",
                                          "author": "author124",
                                          "created": 1617640715,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                },
                                "gtdp6mg": {
                                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdp6mg/",
                                  "text": "1. you literally said you hate the disabled and I'm not dense it is part of my disability\n2. I am autistic\n3. your being super rude and I just wanted to talk to you on something more recent (this is why I hate reddit)\n4. I'm not going to argue with an adult.",
                                  "author": "ohik9615",
                                  "created": 1617567028,
                                  "upvotes": -23,
                                  "replies": {
                                    "gtdqjow": {
                                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdqjow/",
                                      "text": "1) Just because you are incapable of understanding sarcasm doesn't mean that sarcastic statements are no longer sarcastic.\n\n2) Congratulations.\n\n3) *you're, as in \"you are\".  I'd say I'm being more \"flippant\" than \"rude\", but either way: so what?\n\n4) It appears you are.  But do you prefer to argue with children?  Is that easier for you?",
                                      "author": "lupineblue2600",
                                      "created": 1617567740,
                                      "upvotes": 16,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gtcz6ms": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcz6ms/",
              "text": "Sounds like they really need to open up more sections if it’s that hard to get into",
              "author": "sanguinesecretary",
              "created": 1617553634,
              "upvotes": 23,
              "replies": {}
            },
            "gtd2sxw": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd2sxw/",
              "text": "[deleted]",
              "author": null,
              "created": 1617555475,
              "upvotes": 18,
              "replies": {
                "gtd6p0i": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd6p0i/",
                  "text": "My school has a policy that allows anyone to switch majors whenever they want. Computer Science became so popular the past 2-3 year so almost everyone switched to CS. And now the school can’t support all the students switching to CS. There’s not enough professors to teach CS classes I think...",
                  "author": "Agitated-Flatworm903",
                  "created": 1617557456,
                  "upvotes": -18,
                  "replies": {
                    "gtdcefg": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdcefg/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1617560372,
                      "upvotes": 38,
                      "replies": {
                        "gtem0dp": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtem0dp/",
                          "text": "And also the higher level courses usually have less enrollment. My senior classes were usually less than 20 people.",
                          "author": "BlkGirl181",
                          "created": 1617584941,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gtd3xc9": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd3xc9/",
              "text": "I'm amazed they wouldn't add another class if over 70 students want in. Something doesn't add up here.",
              "author": "DanHassler0",
              "created": 1617556045,
              "upvotes": 28,
              "replies": {
                "gtd6rdd": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd6rdd/",
                  "text": "My school has a policy that allows anyone to switch majors whenever they want. Computer Science became so popular the past 2-3 year so almost everyone switched to CS. And now the school can’t support all the students switching to CS. There’s not enough professors to teach CS classes I think...",
                  "author": "Agitated-Flatworm903",
                  "created": 1617557489,
                  "upvotes": -6,
                  "replies": {
                    "gtdaer8": {
                      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtdaer8/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1617559345,
                      "upvotes": 43,
                      "replies": {
                        "gteuqoj": {
                          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gteuqoj/",
                          "text": "Smells super fish chief.",
                          "author": "LSDMTHCKET",
                          "created": 1617589973,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gtcksmp": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcksmp/",
              "text": "In that case, just keep checking and waiting. Is this the last and only class you need to graduate? Take a semester off, do some internships, take a break, and when the next semester registration opens at the exact date and time, you need to be the first to register for that class. They get full quickly and it's important to do it the second the classes open registration.",
              "author": "sadgurI",
              "created": 1617546014,
              "upvotes": 21,
              "replies": {}
            },
            "gtcvdox": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcvdox/",
              "text": "That’s pretty messed up, with that many people on a waitlist they should open up another section",
              "author": "datznotracist",
              "created": 1617551686,
              "upvotes": 13,
              "replies": {}
            },
            "gtd7twg": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd7twg/",
              "text": "Listen friend, if you need this class as badly as you say and will have financial repercussions if you don't get to take it this semester, take this past the dean. Take it all the way to the school president if you have to. Depending on how much time you have left before the class starts, ideally send your emails and give 1-2 business days before moving up the ladder until you get a \"yes\" from someone. \n\nHaving students not graduate looks bad for the school. Having students not be able to afford living expenses after not being able to access a class doesn't look good. Write these hardships out in your emails and say you need help getting into the course and that the teacher is willing to teach you if you're given a spot in the class. If you can tack on a letter or two of recommendation from previous teachers to these emails, that'd be good too.",
              "author": "auntruckus",
              "created": 1617558031,
              "upvotes": 16,
              "replies": {
                "gth4hb1": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gth4hb1/",
                  "text": "Professors aren't teachers.",
                  "author": "AstuteYetIgnored",
                  "created": 1617643921,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "gtd4y4f": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd4y4f/",
              "text": "I’m surprised. Usually it’s up the professor to let people in",
              "author": "kapbear",
              "created": 1617556568,
              "upvotes": 4,
              "replies": {
                "gth4dkb": {
                  "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gth4dkb/",
                  "text": "Might have something to do with Covid.",
                  "author": "AstuteYetIgnored",
                  "created": 1617643875,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gtcgizg": {
      "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcgizg/",
      "text": "Keep trying to get in contact with the dean and when you are able to do so, make sure you say something about your advisor. Your advisor should look out for your best interest. Hope this helps.",
      "author": "Orkney_",
      "created": 1617543347,
      "upvotes": 9,
      "replies": {
        "gtcjr4o": {
          "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcjr4o/",
          "text": "Thank you. I contacted the Dean about a week ago but didn’t get a reply",
          "author": "Agitated-Flatworm903",
          "created": 1617545411,
          "upvotes": 4,
          "replies": {
            "gtcti9l": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcti9l/",
              "text": "If you don't hear back soon, you may need to contact your ombudsperson.",
              "author": "ReluctantAcademic21",
              "created": 1617550715,
              "upvotes": 10,
              "replies": {}
            },
            "gtcy4pl": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtcy4pl/",
              "text": "Can’t the associate deans and the secretary as well. Contact the chair and the professor of the class. Tell them it’s a special situation and it’s urgent",
              "author": "PersistantBlade",
              "created": 1617553098,
              "upvotes": 1,
              "replies": {}
            },
            "gtd02hz": {
              "link": "/r/college/comments/mjw8p4/class_full_university_wont_let_me_graduate_or/gtd02hz/",
              "text": "You need to talk to the chair of the department your program is in",
              "author": "Blackberries11",
              "created": 1617554082,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634050651
}