{
  "sid": "rfyj3v",
  "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/",
  "title:": "I can’t help but feel I’m a failure to my parents. Any advice would be helpful.",
  "text": "Tldr: my parents worked really hard to try and set me up to go to a top school in the country (eg Ivies, MIT, Caltech, Stanford, etc) and I only ended up going to the basic state school. Title explains the rest.\n\nThrowaway account here. When ive voiced these feeling in person I’m often told I’m elitist, vain, conceited, etc. and I’m sorry if it comes across that way but I really don’t mean to be - I’m genuinely typing this up while crying because ive been upset about this for the past 3 years.\n\n3 years ago when I was applying to colleges, I applied to roughly 13 different schools for engineering, with my state school being my safety/last choice. I got rejected from every school except that state school, and ended up going there. My parents had put in a lot of effort to push me to go to any one of those other 12 schools, and they really expected me to get in (1500+ sat, 750+ on the subject tests, 4.2 gpa, you get the idea). My father definitely took the news better than my mother, who said I was a failure that disappointed her by not working hard enough. Frankly I agree, I do feel like a failure who took her hard work for granted.\nFast forward to today (end of first semester of my junior year) where she just heard that my cousin who she considers an “idiot” (barely broke a 1300, smokes weed, spent the last few years trying to make it as a SoundCloud rapper with no success) just got into an Ivy for Environmental Science. Naturally she calls me up upset, complains about my cousin, tells me I’m stupid for going to this school, and that im a failure. Not wanting to hear it I say “I’m sorry I go to a shitty school mom, and I’m sorry I’m a disappointment”, then tell her I’m busy and politely hang up. I then start to cry because I do feel like a failure and I know I’ve disappointed her, and I hate this stupid school that everyone from my high school went to and no matter how well it does rankings wise or whatnot, I still feel like I’ll always be embarrassed of it.\n\nAny advice? I’m so tired of being a student here, and I already tried to transfer out - no success. I don’t plan to go to my graduation in a year and I don’t think I’ll ever not feel ashamed of going to this school. I already know I’ll never hang my diploma up because I feel like in the eyes of everyone who matters to me, I might as well wipe my ass with it so it’ll at least be useful for something.\nAnd no, please don’t say something like “oh well ur moms a bitch lol”, I love my mother and I do feel she only wants better for me. I’m just so sad that I’m incapable of not disappointing her. My father tries to be supportive but I know I made him sad too. The difference is that he’s said he feels they both failed me as parents because I didn’t go somewhere better. I’m honestly super happy for my cousin and don’t feel any bitterness towards him, I just wish in my parents eyes I wasn’t a failure and a disappointment.",
  "author": "Used-Shift-6284",
  "created": 1639454144,
  "updated": 1639516056,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hoh1y1c": {
      "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/hoh1y1c/",
      "text": "I'm not going to call your mom a bitch but she's being really cruel and she doesn't understand how this shit works. After your first job, once you have the work experience, where your degree is from doesn't matter except in some relatively niche fields. All that matters is that you have one and that you can do that job.",
      "author": "SouthernRhubarb",
      "created": 1639456819,
      "upvotes": 6,
      "replies": {}
    },
    "hogxe4v": {
      "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/hogxe4v/",
      "text": "Very sorry to hear you're going through this.  Are your parents from an immigrant background, by any chance?  (To be clear, I have some experience with this.)",
      "author": "SuperHiyoriWalker",
      "created": 1639454568,
      "upvotes": 3,
      "replies": {
        "hogxl8p": {
          "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/hogxl8p/",
          "text": "They are, but they’ve been in the country long enough that they both went to college here - my dad went to high school here too.",
          "author": "Used-Shift-6284",
          "created": 1639454662,
          "upvotes": 2,
          "replies": {
            "hogzlk5": {
              "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/hogzlk5/",
              "text": "That's what I figured.  It always struck me as strange that counter to what one might think, it's usually the immigrant moms who take it harder than the immigrant dads when the child doesn't have a fancy job/alma mater, marries outside the culture, etc.\n\nIn any case, I know this is rough, but once you graduate and start building your life, the whole parental pissing contest with aunties/uncles is going to become less and less relevant.  Good luck finishing the semester!",
              "author": "SuperHiyoriWalker",
              "created": 1639455628,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hoh37o1": {
      "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/hoh37o1/",
      "text": "Wow, that is absolutely ruthless my friend. Remember, college isn't the end goal, it's a stepping stone to something greater. At the end of the day it doesn't matter what school you went to, it's the connections and opportunities you gained along the way to help you in the future. Best if luck, keep you head up.",
      "author": "crusaderofcereal",
      "created": 1639457489,
      "upvotes": 3,
      "replies": {}
    },
    "hoh5abu": {
      "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/hoh5abu/",
      "text": "MIT, Ivy Leagues, etc. are lotteries. These colleges get too many applicants to seriously review all of them. Seriously the proof is right there, your cousin with worse grades was admitted when you weren’t.\n\nI’m of the opinion that it doesn’t make much difference whether you get into a top-level college or any other decent college, except for your resume. Unless your state school is actually bad i don’t think your education is much different. If you go to grad school, your grad university is much more significant.\n\nWhat do you want to do in life? What were you planning to do when you got into an Ivy League? That’s what’s important.",
      "author": "armchairwarrior13579",
      "created": 1639458626,
      "upvotes": 3,
      "replies": {}
    },
    "hoh4kdm": {
      "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/hoh4kdm/",
      "text": "I'm so sorry you're going through this op. You don't sound conceited at all. I don't want you to think you are a failure cause you are not. The fact that you are going to be graduating from college with a major in engineering is a huge accomplishment. You should be super proud of yourself. Go to your graduation and don't let anyone, including yourself, ruin a memorable experience. Good luck op and please remember to take care of your mental health!",
      "author": "SchlapaBtch",
      "created": 1639458222,
      "upvotes": 2,
      "replies": {}
    },
    "hoinifd": {
      "link": "/r/college/comments/rfyj3v/i_cant_help_but_feel_im_a_failure_to_my_parents/hoinifd/",
      "text": "Drop ur mom she fucking sucks",
      "author": "Formal_Candle6789",
      "created": 1639494409,
      "upvotes": 1,
      "replies": {}
    }
  }
}