{
  "sid": "d3qac2",
  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/",
  "title:": "I have already forgotten some subjects.",
  "text": "Does this happen to everyone, or am I not doing this college thing right. I tried to solve my Calculus II midterm paper which I aced a couple of months ago (got a 93) and to my surprise I had forgotten nearly everything. I am certain that if I took the same test today I would barely pass.\n\nAm I not studying right? Should I re-read those previous lessons to keep myself fresh now that I have the time to do so?",
  "author": "Teabx",
  "created": 1568385936,
  "over_18": false,
  "upvotes": 739,
  "upvote_ratio": 0.99,
  "comments": {
    "f0ghpyu": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f0ghpyu/",
      "text": "Calc is like that. I've got a BS in math and a PhD in stats, and I will most definitely fail a surprise Calc II quiz. \n\nHowever, since you've learned it already, it should be much easier for you to pick it up again.",
      "author": "AcademicDifficulty",
      "created": 1568599837,
      "upvotes": 1,
      "replies": {}
    },
    "f08w3o8": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f08w3o8/",
      "text": "I took calc 2 in high school and haven't ran into a sitruation where i need to do taylor series. Better use of your time is to learn and refresh yourself on software or tools you may use in your career.",
      "author": "BuildingRealism",
      "created": 1568489070,
      "upvotes": 1,
      "replies": {}
    },
    "f07s93g": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f07s93g/",
      "text": "Who cares, you got your degree.",
      "author": "lastshitbag1995",
      "created": 1568467906,
      "upvotes": 1,
      "replies": {}
    },
    "f07c0px": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f07c0px/",
      "text": "I spent 4+ months on break between Pre-u (Grade 12) and university (undergrad). I went from having an 84% average to failing my entire first semester.\n\nIf you don’t use it, you loose it. (Like someone else in the thread said)",
      "author": "Cloudly_Water",
      "created": 1568457297,
      "upvotes": 1,
      "replies": {}
    },
    "f071o1i": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f071o1i/",
      "text": "meh, six months into my career and i've lost about 70% of everything I learnt because I've not needed to use it.",
      "author": "postygal",
      "created": 1568450666,
      "upvotes": 1,
      "replies": {}
    },
    "f06os0j": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06os0j/",
      "text": "Edit: Note: I'm copying my child comment as a parent comment\n\n\n\nThe purpose of introducing subjects to students in college is to tell them what that niche looks like in real study and they get 4ish months to master that niche field up to a certain level, depending on background.\n\nIt's not the goal to remember everything, the purpose is that if the subject interests you as a possible career or project or paper or thesis opportunity, you continue with it. That way you'd be in touch with it and won't be forgetting things.\n\nThough you don't quite remember the information right now, practicing those problems have given you a type of skill set which has altered the structure of your brain. That's why it'd be easier for you to re-learn a skill or subject than learning it the first time.",
      "author": "Reddit_is_therapy",
      "created": 1568442446,
      "upvotes": 1,
      "replies": {}
    },
    "f06fkiw": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06fkiw/",
      "text": "Pretty common. Happens to me too, and it's not really a big deal. The one thing that you have going for you though: if you try to relearn the subject or even just go over your old notes, you'll probably start remembering it really quickly.",
      "author": "ggadget6",
      "created": 1568436732,
      "upvotes": 2,
      "replies": {}
    },
    "f0615qa": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f0615qa/",
      "text": "Honestly, if you don't keep at it it's gone. I learned piano intensely for 5 years but for the past 3 I have barely had time to play. Also these days just because you took a class in something doesn't mean that you're gonna use it/need it forever.",
      "author": "ReachandCrackTheSky",
      "created": 1568425842,
      "upvotes": 1,
      "replies": {}
    },
    "f060yf1": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f060yf1/",
      "text": "I took Calc AB and BC in high school so that I wouldn’t have to take any math in college. I just graduated from college a couple of months ago and found some old math tests while I was cleaning out my room. \n\nNot to brag, but I had perfect scores on most of the tests but looking back at them they looked like gibberish, I couldn’t even do a single problem. I guess that’s what happens when you don’t do any real math for 5 years.",
      "author": "clutchutch",
      "created": 1568425660,
      "upvotes": 1,
      "replies": {}
    },
    "f05s6p1": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05s6p1/",
      "text": "Yes and it doesn't matter. You'll never use most of what you learn anyways, unless its something like engineering... I haven't.",
      "author": "lastshitbag1995",
      "created": 1568418124,
      "upvotes": 1,
      "replies": {}
    },
    "f05rwgc": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05rwgc/",
      "text": "Calc ii is just a bunch of memorization. Calc I was a lot more conceptual, so I remember it better. I know nothing about sequences and series lmao",
      "author": "whitelife123",
      "created": 1568417891,
      "upvotes": 0,
      "replies": {}
    },
    "f05p4g1": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05p4g1/",
      "text": "It is called Retention Deficit Disorder. I have it, anything complicated I learn but don't use. I completely forget it later.",
      "author": "Alpha2110",
      "created": 1568415664,
      "upvotes": 2,
      "replies": {}
    },
    "f05mlha": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05mlha/",
      "text": "that is natural, you don't remember 75% of the stuff you learn in college unless u actively use it",
      "author": "ilovemymemesboo",
      "created": 1568413695,
      "upvotes": 3,
      "replies": {}
    },
    "f05kd70": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05kd70/",
      "text": "I aced all three classes in the general chemistry series and if u asked me a titration question rn id have nothing for ya",
      "author": "Dory105",
      "created": 1568411980,
      "upvotes": 4,
      "replies": {}
    },
    "f05hihq": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05hihq/",
      "text": "When studying for an exam you learn things for the exam so after the exam you subconsciously put away those knowledge bc you will take new lessons and you should give your attention to them. \n\nHuman memory has 4 stages, if you need to learn something well you have to put that data to stage 4 of your memory bank. When you learn something new, if you dont repeat that information in the next 24hours that data wont pass to the stage 2. Then in order to acces stage 3 you have to repeat that information in the next 3-4 days and then you have to repeat it again. But even this doesnt secure that that data will remain in your permanent memory. You see memory is not one place in brain. All emotions and senses have their own memory, using other memory types to learn something makes easier to recall an information and helps you learn better. \n\nThe reason I explained this in a long way instead of saying 'just repeat' is because you learn better if you know the causes. Now, you know and understand why repeating is important. Good luck with your lessons.",
      "author": "YeolsansQ",
      "created": 1568409910,
      "upvotes": 3,
      "replies": {
        "f05k53d": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05k53d/",
          "text": "Thank you for explanation. The way I understand it is that I haven't studied, I have been preparing for tests. Those were the same thing for me, but because of the way you put it, I now know they are not. This was kind of important to me because I am going to start my second year in college and this year I will be having subjects that are actually very important in my career of choice (not saying calculus is not important, but I won't be applying that knowledge that much in my field). \n\nKnowing that i forgot courses that I took just a while back so soon got me to thinking that I am not studying right. I am going through college to actually learn things that are going to help me in my future. It's obviously a waste of time if i forget those things right after I take my diploma, even if I graduate with high results.\n\nI am going to take a different approach this year. Every new lesson that I take on each subject, I will try to understand it first before I learn it to prepare for my assignments. I am hoping this will make my college years more worthwhile than they already are.",
          "author": "Teabx",
          "created": 1568411815,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f05akos": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05akos/",
      "text": "No. See, you still have something that most people don't have - familiarity. True, you've forgotten most of it. But it would take you a fraction of the time it took to learn it to re-familiarize yourself. Compared to someone like me who has never taken Calculus, who would need to take that class before being able to do that.\n\nReal life isn't like a college exam. On an exam, they limit your tools to make sure you actually absorbed something. In real life, you have access to calculators, dictionaries, etc. Anyone can just look up the textbook. But not everyone can look it up and understand how to use that information.",
      "author": "ST_the_Dragon",
      "created": 1568405525,
      "upvotes": 15,
      "replies": {
        "f061iij": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f061iij/",
          "text": "does familiarity apply to languages too? i'm one of those students who spent literally 8 years (elementary thru high school + a summer abroad) learning spanish and was doing pretty great at it, then didn't practice for 2 years and  was shocked when i bombed my placement test for an intermediate course i wanted to take this semester. it was humiliating and i'd really like to come back from it, but my speaking ability is more or less toast.",
          "author": "Instrvmentality",
          "created": 1568426158,
          "upvotes": 3,
          "replies": {
            "f09b3ir": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f09b3ir/",
              "text": "I'm not an expert, but I would guess that you just need to practice. You shouldn't need another 8 years, that's for sure.\n\nAny kind of exam will be extra strict on this, though. In high school I was in French class with a girl who had spoken French her entire life, and she was having trouble preparing for exams to get credit for the lower levels.",
              "author": "ST_the_Dragon",
              "created": 1568497401,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f059fnp": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f059fnp/",
      "text": "OP when I wanted to be an accountant I took three accounting classes at my CC. I don't remember a damn thing. Other users have said use it or lose it and I believe that",
      "author": "C-Weed622",
      "created": 1568404751,
      "upvotes": 3,
      "replies": {}
    },
    "f0599xp": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f0599xp/",
      "text": "calculus in particular is hard to retain info on. i can remember the plots of every book ive read on english, but struggle to remember how to integrate weird functions",
      "author": "rat_rat_rat_rat_rat",
      "created": 1568404645,
      "upvotes": 4,
      "replies": {}
    },
    "f053plq": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f053plq/",
      "text": "dude I aced all my calculus classes last year, now I cant even do basic integration lmao",
      "author": "mrprofessor88",
      "created": 1568401923,
      "upvotes": 7,
      "replies": {
        "f055xd7": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f055xd7/",
          "text": "Integrate 2x^2",
          "author": "kdrdr3amz",
          "created": 1568403007,
          "upvotes": 1,
          "replies": {
            "f05aapp": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05aapp/",
              "text": "I'd rather take your deravtive so I can lie tangent to your curves.",
              "author": "icroc1556",
              "created": 1568405334,
              "upvotes": 9,
              "replies": {
                "f05kwv2": {
                  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05kwv2/",
                  "text": "I’m a dude..",
                  "author": "kdrdr3amz",
                  "created": 1568412398,
                  "upvotes": 2,
                  "replies": {
                    "f05mnls": {
                      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05mnls/",
                      "text": "what is the issue there sir 😍😍😍😍👅👅💦",
                      "author": "ilovemymemesboo",
                      "created": 1568413741,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "f05kxyf": {
                      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05kxyf/",
                      "text": "You saying you don't have curves?",
                      "author": "icroc1556",
                      "created": 1568412421,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f053ef1": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f053ef1/",
      "text": "I'm a senior in college and haven't learned anything useful. Everything I learned that matters to me I learn on youtube or on my own",
      "author": "sonicbillymays",
      "created": 1568401769,
      "upvotes": 5,
      "replies": {
        "f0629tg": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f0629tg/",
          "text": "What major and school?",
          "author": null,
          "created": 1568426836,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f051paf": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f051paf/",
      "text": "It depends on what you are doing. I have almost never used series or sequences and I'm entering my fourth year. I use integrals all the time, and I am sure you will remember how to do those. Anything more complex than a polynomial integral is simply put on Wolfram or Symbolab. The same goes for differential equations and derivatives.",
      "author": "DieSchungel1234",
      "created": 1568400725,
      "upvotes": 9,
      "replies": {
        "f054mjs": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f054mjs/",
          "text": "I do remember a couple of things about differential equations but I think that's mostly because those were towards the end of my second semester and once we got that lesson we had them in every assignment/exam after. I tried digging up my notebooks and looking at some of the lessons and I gave a quick look and it started coming back to me (well sort of, let's just say I am not entirely clueless right now). It's very interesting to think that there is so much information that lays dormant in our brains waiting for some trigger to bring it up.",
          "author": "Teabx",
          "created": 1568402343,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "f04zw7x": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04zw7x/",
      "text": "It might not be fresh in your head right now, but if you spent a few hours reviewing old notes you'd remember 80-90% of all the material.\n\nAlso, unless you need to apply it in another class or in your job, why do you even care?\n\nI forgot a lot of Calc 2 because it's useless to me and I'll never need it again. If I do I'll just review it",
      "author": "psilvs",
      "created": 1568399505,
      "upvotes": 38,
      "replies": {}
    },
    "f04zaul": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04zaul/",
      "text": "I’m like 6 semesters deep and honestly the only things I truly remember are class structure and how to get the work done... other than that specific material based questions? I don’t remember anything lol",
      "author": "LonelyCactus420",
      "created": 1568399111,
      "upvotes": 2,
      "replies": {}
    },
    "f04ypj9": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04ypj9/",
      "text": "It happens to everyone, especially with math. There's \"superficial\" learning to pass a test, which unfortunately most learning in school ends up being, and then there is \"deep\" learning where you are still able to use and apply the knowledge you have learned even years after you have first learned it. The thing is, I think forgetting has to be a part of the learning process in order to turn superficial learning into deep learning, and I don't think enough people talk about it. If you go through a syllabus for the class, how much do you remember, and how much did you forget? The stuff you remember well is the stuff you learned deeply, and you can use that as a context for the stuff you learned superficially to relearn the material.",
      "author": "dreamsofaninsomniac",
      "created": 1568398713,
      "upvotes": 84,
      "replies": {}
    },
    "f04vjfn": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04vjfn/",
      "text": "This is me. Studied the fuck out of the subject, get a decent score on said subject, sem break rolls in and my memory is wiped and ready for new subjects.\n\nIt works well until now where I have to start my thesis and I can barely remember how to SPSS.",
      "author": "denial_central",
      "created": 1568396602,
      "upvotes": 58,
      "replies": {
        "f05e2q2": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05e2q2/",
          "text": "What is SPSS?",
          "author": "LongNL",
          "created": 1568407710,
          "upvotes": 3,
          "replies": {
            "f05s5iu": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05s5iu/",
              "text": "Statistical Package for the Social Sciences. It's one of the software programs used in disciplines like psychology and sociology to do math on data.\n\nedit to add: R is another, similar software program. Those are the \"big two,\" from my understanding.",
              "author": "tehzephyrsong",
              "created": 1568418097,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "f04tmxi": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04tmxi/",
      "text": "Unfortunately, it's a common phenomenon. It's why I prefer project based learning or some form of applied learning.",
      "author": null,
      "created": 1568395348,
      "upvotes": 12,
      "replies": {}
    },
    "f04ihk2": {
      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04ihk2/",
      "text": "An illustration of \"use it or lose it.\"\n\nWhat you don't use is quickly forgotten. Lots of people spend two, three, or four years in foreign language class and a few years later they can't speak more than a few sentences. \n\nSame with higher math. By the time the kids enter high school math classes, many parents that took calculus have a problem with algebra I and geometry, unless that parent is a high school math teacher.\n\nTalk with many people in their thirties and beyond and they remember very little of what they learned in college.",
      "author": "Kimmybabe",
      "created": 1568388210,
      "upvotes": 474,
      "replies": {
        "f04kzlq": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04kzlq/",
          "text": "So it is normal for people to forget stuff if they don't practice it. But isn't my case a little extreme? I had these lectures a couple of months ago, not years ago. It feels weird not remembering things you knew off the top of your head just a while back.",
          "author": "Teabx",
          "created": 1568389819,
          "upvotes": 142,
          "replies": {
            "f04ugl8": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04ugl8/",
              "text": "I took pre-calc last year and I forgot everything. If you handed me the final exam I probably would not get one thing right. Once I get into college for my next mathematics class, I will have to use resources such as khanacademy and youtube to re-learn everything!",
              "author": "mywoess",
              "created": 1568395892,
              "upvotes": 106,
              "replies": {
                "f05kmxw": {
                  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05kmxw/",
                  "text": "I feel you. I took calculus in high school two years ago, and now I'm taking calculus again in university. Pretty much the same course, but no way I'd get any question right without relearning.",
                  "author": "Cliff9786",
                  "created": 1568412185,
                  "upvotes": 23,
                  "replies": {}
                },
                "f069gwj": {
                  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f069gwj/",
                  "text": "I also took pre-calc last year but i remeber a lot of things from the course and after a quick little week long review i pretty much had everything all down very quickly and i remebered most of it. Granted it was a college class taken at a highschool level so its likely diffrent (had precalc for a whole year instead of just a semester and class was also easygoing) heres to hoping ill do calculus just as good",
                  "author": "KebDoesTheStuff",
                  "created": 1568432598,
                  "upvotes": 3,
                  "replies": {}
                },
                "f06dlkv": {
                  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06dlkv/",
                  "text": "Thank the Lords for khan academy lol",
                  "author": "Brother_Budda22",
                  "created": 1568435494,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "f04w8mv": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f04w8mv/",
              "text": "If you were to hear the same lecture again, I bet you could predict what the professor will say next because it should come back to you relatively quickly.",
              "author": "GoodLifeWorkHard",
              "created": 1568397062,
              "upvotes": 36,
              "replies": {}
            },
            "f05jovr": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05jovr/",
              "text": "Yes it is normal for students to forget. These are a few examples:\n\nDuring the summer break, on average students lose about a month of what they learned the previous year. Some more others less.\n\nAround seven years ago, the son of a major partner at the law firm where my daughters and son in laws were working asked my youngest son in law if he could figure out why his very bright son was failing several classes in his first semester at one of our state's flagship universities. He asked son in law because son in law is very adroit at school and learning issues. The son had graduated from a very high end private prep school with $40,000 a year tuition. (Son in law graduated from local public high school.) Long story short, the kid had finished all the AP calculus classes, got a 5 on the AP tests, by end of junior year and took no math classes until university. The solution was dropping two classes, going back and retaking two calculus classes, going to summer school to catch back up, etcetera. \n\nGoogle up the name Kathleen Sullivan bar exam failure. Kathleen graduated from Harvard law school, was a professor at Harvard law school, was a professor and Dean at Stanford law school. (Yale, Harvard, and Stanford are always ranked in the top 3 of the 203 ABA approved law schools and Dean is the top person at a law school.) Kathleen decided to join a very high end law firm and needed to pass the California bar exam,  which is widely understood to be the hardest bar exam in the nation. For good reasons. The pass rate for first time test takers who graduated from ABA approved law schools is 60% in California. Most states the pass rate is 80% or higher. Kathleen flunked the California bar exam  and passed it five months later. Her problem was probably the same as Hilary Clinton and Michelle Obama who both failed their first bar exams. All three probably figured they could wing it and not do the prep work of studying all those subjects from first year of law school that they had forgotten parts of.",
              "author": "Kimmybabe",
              "created": 1568411482,
              "upvotes": 12,
              "replies": {}
            },
            "f05g1na": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05g1na/",
              "text": "Nope. I forget EVERYTHING by the next semester (only for math). \n\nEvery other subject sticks with me. It's probably because I'm actually interested in all of it except math lol",
              "author": "Jleebeans_",
              "created": 1568408897,
              "upvotes": 12,
              "replies": {
                "f05vftw": {
                  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05vftw/",
                  "text": "I love math and I still forget stuff. Except it isnt forgetting, it’s just that my brain has taken that knowledge and froze it in ice. Once I get back on the math grind, the engine heats up and the ice starts to melt",
                  "author": "6292106938819425",
                  "created": 1568420873,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "f056wle": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f056wle/",
              "text": "I feel like if youve learned it properly, when you brush up on topics it will come back very quickly. I dont remember how to solve every differential equation off the top of my head, but looking back at past notes helps a lot. A lot of engineering in general isnt about memorizing but being able to reference back to many different things effectively",
              "author": "davvidho",
              "created": 1568403499,
              "upvotes": 21,
              "replies": {}
            },
            "f05dbbj": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05dbbj/",
              "text": "Personally my brain has a tendency to completely dump any useful info I had learned previously over the course of the summer which just a few month like you said. But while I can’t remember the exact info right away, the concept click significantly faster than when I first learned the material. I’m sure if you were to go back and look at the textbook you figure stuff out fairly quick.",
              "author": "gyoung24",
              "created": 1568407269,
              "upvotes": 7,
              "replies": {}
            },
            "f05umgr": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05umgr/",
              "text": "Completely normal imo. However, you never know when you might need it. Take good notes and make them easy to understand (include stuff in parentheses that is obvious, but would likely be forgotten if read months later). Keep those notes forever. I myself plan on keeping them so I can look back on all the things I learned in school.",
              "author": "6292106938819425",
              "created": 1568420178,
              "upvotes": 3,
              "replies": {}
            },
            "f05xgak": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05xgak/",
              "text": "Do you know how to take a basic derivative, integral, and do basic trig? If the answer is yes, you're good.",
              "author": "msief",
              "created": 1568422605,
              "upvotes": 1,
              "replies": {}
            },
            "f06opl7": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06opl7/",
              "text": "The purpose of introducing subjects to students in college is to tell them what that niche looks like in real study and they get 4ish months to master that niche field up to a certain level, depending on background.\n\nIt's not the goal to remember everything, the purpose is that if the subject interests you as a possible career or project or paper or thesis opportunity, you continue with it. That way you'd be in touch with it and won't be forgetting things.\n\nThough you don't quite remember the information right now, practicing those problems have given you a type of skill set which has altered the structure of your brain. That's why it'd be easier for you to re-learn a skill or subject than learning it the first time.",
              "author": "Reddit_is_therapy",
              "created": 1568442396,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f054xwb": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f054xwb/",
          "text": "Haha yup that’s me. 6 years of Spanish. Now you’ll get a Que es esto? At the most.",
          "author": null,
          "created": 1568402493,
          "upvotes": 9,
          "replies": {
            "f05mqf8": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05mqf8/",
              "text": "Your have my deepest condolences! I also suffered through several years and recall very very little of it.\n\nYoungest son in law was sitting in gifted and talented 7th grade when the district explained all the wonderful opportunities that they would have in 8th grade thought 12th grade, which would include 4 years of foreign language, 4 plus years of calculus and higher math, and lots of pesky AP classes. He had already figured out that he was going to law school and did not care to spend 4/6 of a year of his life in a foreign language that he would never use and would quicky forget. Ditto wasting 4/6 of a year in calculus and above math classes. He looked around the classroom to see if there was anything besides his pencils, back pack, and coat that he would like to take with him. Spotting our daughter, he asked her to join him in testing out and over regular 8th grade to join our oldest daughter and his pal, our oldest son in law, in regular 9th grade the following year. \n\nYes he is lazy about doing anything that he sees no value in doing. His vision was to take lots of dual enrollment classes and graduate early from local state university. The four of them did high school and college in FIVE years, not eight years.",
              "author": "Kimmybabe",
              "created": 1568413800,
              "upvotes": 4,
              "replies": {
                "f05whep": {
                  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05whep/",
                  "text": "I'll be honest, I don't really understand the sentiment behind seeing classes as \"useless\". People really seem to love branding foreign language classes in particular as useless. Maybe I'm a bit biased as I love learning foreign languages and study a highly globalized field, but almost all fields benefit from interdisciplinary knowledge. So all learning can be extremely beneficial regardless of the subject. If people realized this, instead of acting like education is something they have to \"suffer\" through, I think we'd all be a little happier.",
                  "author": "ReguardMerle",
                  "created": 1568421774,
                  "upvotes": 9,
                  "replies": {
                    "f05yfrw": {
                      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05yfrw/",
                      "text": "It's useless if you never use it, which most people don't. Same with calculus if you don't go into a stem carrier. \n\nSomewhere on this thread I mentioned a son in law who viewed four years of foreign language as 4/6 of a year of his life that he wanted to invest elsewhere. Likewise with four years of calculus and above math that would be 4/6 years of his life that he wanted to invest elsewhere.  (A side part of that is that he is traveling through life with a mildly dyslexic pal, our other son in law, that doesn't need the added burden of a second language added to his load.)\n\nForcing a mass number of people to take classes they will never use is not a very wise use of of education funds.",
                      "author": "Kimmybabe",
                      "created": 1568423461,
                      "upvotes": 1,
                      "replies": {
                        "f06bf53": {
                          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06bf53/",
                          "text": "First of all, it is extremely useful (and you WILL end up using it in all parts of the country) to (truly) know a language such as Spanish. Second of all, what is wrong with education for the sake of education? If people want a specific big $$ career without having to \"suffer\" through learning other academic subjects, then they should probably go to a two-year technical school.",
                          "author": null,
                          "created": 1568434173,
                          "upvotes": 6,
                          "replies": {
                            "f06tdx9": {
                              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06tdx9/",
                              "text": "Yes a foreign language can be useful, but not if it is forgotten as it is in most cases.\n\nNothing wrong with people choosing to study a particular subject like a foreign language. However, requiring subjects that are not relevant to a person's goals can end up a waste of that person's time and money. Also the public high school and public university's money because providing it costs more than tuition.\n\nThere are some academics that believe that large amounts of education should be eliminated. Failing Law Schools by a former law school dean of several law schools suggests that law school should be reduced from three years to two years with the possibility that the third year should be spent working as an inturn under a practicing attorney, much like becoming a CPA requires a year of work experience under a CPA.  The case against education: why the education system is a waste of time and money by Bryan Caplan makes the point that much of college and graduate school should be eliminated, along with portions of high school. The son in law that I mentioned on this thread made that calculation in 7th grade. However, after university and law school, son in law did lead his pal and our daughters on to get LLM and MBA degrees, so essentially he used those three years of high school study that they escaped from to get the LLM and MBA degrees that they think have more value to them than forgotten Spanish and calculus would have for them.",
                              "author": "Kimmybabe",
                              "created": 1568445355,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f05c9ks": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05c9ks/",
          "text": "foreign language got me. I'm a transfer student with an assoc degree and despite the gen-eds being waived my school still forces me to do 2 semesters of foreign language (you can test out of it) and did the 101 class in the spring and 3 months later I'm doing 102 an don't remember anything. The prof is taking 3 weeks as a crash course for us which is nice but it still sucks since I never had to use it in home or real life.",
          "author": "RolfIsSonOfShepnard",
          "created": 1568406669,
          "upvotes": 6,
          "replies": {}
        },
        "f05o682": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05o682/",
          "text": "I took one semester off in Spanish and after 2 years I'm still relearning on the fly.",
          "author": "havingfun89",
          "created": 1568414914,
          "upvotes": 2,
          "replies": {}
        },
        "f05u8xq": {
          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05u8xq/",
          "text": "I'd still like to know what the cause of this is. Seems like if one isn't consistently keeping themselves up to speed on formulas every day of the week for their entire life, it's gone. Almost like they never learned it all. Sounds like a question for the \"tell me like I'm five\", but it seems like the brain just automatically rewrites itself like a hard drive.",
          "author": "bentstrider83",
          "created": 1568419852,
          "upvotes": 1,
          "replies": {
            "f05x58h": {
              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f05x58h/",
              "text": "I don't know the why, but I know that most people suffer from such. Some few people have something like \"perfect autobiographical memory\" where they can remember what they were doing everyday of their life. Like what TV shows they watched on a particular day. What they were thinking about a particular person on a date in high school or college. Things like where they parked and what they did while parked, etcetera. Things that most of us would like to not remember! LOL\n\nMost of us have phone numbers that were very much in our memory, but no longer are. Names of people that we no longer recall. Hubby recalls being on a college trip for two weeks and every evening some guy would ask him what some girl did that day. Hubby remembers the girls name but not the guys name. Lol\n\nI suspect that part of the not  remembering a foreign language problem is that most people don't think in the second language, rather they are translating into that second language, which is earlier to forget, but I have no clue.",
              "author": "Kimmybabe",
              "created": 1568422339,
              "upvotes": 2,
              "replies": {
                "f0657ew": {
                  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f0657ew/",
                  "text": "I seem to only have this problem with math. I'm taking an Intermediate Algebra class at the moment. But was forced to wait a semester to take it after the Spring class was canceled due to low enrollment. Some material I remember from the past two decades of \"fail/repeats\", the rest of it just gets wiped from my memory after little use.\n\nKhan Academy and other sites are quite good. I just wonder if there's an actual, free site that allows you to work out random problems from any level as often as you need. Kind of like that feature of the Pearson math site where you click for a similar problem to the one you just finished.",
                  "author": "bentstrider83",
                  "created": 1568429550,
                  "upvotes": 2,
                  "replies": {
                    "f066y7s": {
                      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f066y7s/",
                      "text": "Kahn is an excellent source and is funded by the Bill and Malinda Gates Foundation. Bill, like allot of parents, had a kid struggling with math and Bill couldn't figure out how to help, when he ran into the videos on the internet. Kind of nice to know that really bright and rich parents struggle with the same problems as us regular folks do.",
                      "author": "Kimmybabe",
                      "created": 1568430791,
                      "upvotes": 1,
                      "replies": {
                        "f06a450": {
                          "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06a450/",
                          "text": "It definitely is, not questioning its validity at all. One just has to kind of thumb through the lessons they need and follow up with some random, practice questions to get them through. Of course I could only do much of this at home and the time I could get in the tutoring center at the local CC. \n\nI'm just trying to get past college algebra and maybe calculus 1. This engineering pursuit I've been stuck on since 18(36 now) has been mentally and pocketbook draining. Decided to just aim for a less math intensive degree just to have one.",
                          "author": "bentstrider83",
                          "created": 1568433202,
                          "upvotes": 1,
                          "replies": {
                            "f06uihe": {
                              "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06uihe/",
                              "text": "I'm among the 9 out of 7 people that are math challenged. (Yes I said 9 out of 7 people are math challenged. LOL) it can be a major slog through college.",
                              "author": "Kimmybabe",
                              "created": 1568446075,
                              "upvotes": 2,
                              "replies": {
                                "f06w1op": {
                                  "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f06w1op/",
                                  "text": "Also, I'm just feeling more tired than normal these days. Between work and trying to stay healthy at my age, even two classes is daunting for me.\n\nNot to mention the fact that I barely graduated high school. When it comes to academics, I compare it to a river. I'm the guy in a dinghy while everyone else is seemingly speed boating along. Add to the fact that I truly have no idea what to pursue as a \"final career\", and the drive is even lower.\n\nThis isn't intended as a rant. If anything it's a personal observation. Why I quit, and then decide to come back for more after sitting it out.",
                                  "author": "bentstrider83",
                                  "created": 1568447019,
                                  "upvotes": 1,
                                  "replies": {
                                    "f08o76h": {
                                      "link": "/r/college/comments/d3qac2/i_have_already_forgotten_some_subjects/f08o76h/",
                                      "text": "Some people have an easier path than others. Some of those who struggle the most succeed the most because of that struggle. \n\nLincoln lost a half dozen elections and his popularity on the last morning of his life was down with the slugs on the street. in his position on the night of his death was a news article from the New York Times that some person wrote about how Lincoln would ultimately be ranked with the great presidents like Washington and Jefferson. How correct that article was.",
                                      "author": "Kimmybabe",
                                      "created": 1568484607,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634051221
}