{
  "sid": "q5m2ug",
  "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/",
  "title:": "We need to talk about the awkward transition between college and true adulthood…",
  "text": "I just graduated from uni in May. I took every moment of those four years for granted. I had so many friends and I was involved in so much. I never felt alone. Now, I am in a city four hours from my college town. I have next to no friends. \n\nIt’s so difficult relating to people and making friendships once college is over. I was so unprepared for how hard it would be. I work full time too, so by the time I am off from work, I just want to go home and sleep. I have no social time anymore. On the weekends, I am exhausted and I take that time to do for myself if I can. \n\nIt’s just so lonely and I feel like this topic is not talked about enough before uni graduation. I miss my college friends everyday. My few closest friends are still in school. I miss the atmosphere and it’s just difficult.",
  "author": "artsyvonnie",
  "created": 1633918686,
  "updated": 1634082958,
  "over_18": false,
  "upvotes": 96,
  "upvote_ratio": 0.95,
  "comments": {
    "hg798ri": {
      "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/hg798ri/",
      "text": "I feel this. It didn't help at all that COVID took away almost two years of our college experience too. I was socially off after being isolated for a year, and even then most of my friends moved back home cuz of the pandemic and I only saw them for graduation before everyone went and did their own thing. Shit, even my long distance relationship fell apart when I moved to a new city to be with them. But at the end of the day I feel it's really part of a process, it's what you can make of it. Making friends is something you have have to actively do or it won't work. Find events and go to them by yourself. I do the whole 9-5 thing too but everyweek after work I have something going on. I go to events, attend piano class, try a new restaurant, go to local concerts. I've made quite a few friends from those things.",
      "author": "Piggy145145",
      "created": 1633934321,
      "upvotes": 21,
      "replies": {}
    },
    "hg7zlpe": {
      "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/hg7zlpe/",
      "text": "This is why it was so easy for me to come back to college after a decade of terrible jobs. College is an absolute breeze. The real world is not. \n\nIt's crazy how much this feeling you're referencing parallels freshman coming from high school. There's so many posts on here about the loneliness of starting college.\n\nThe thing is, it'll get better and chill out. I really don't have friends either and never did through work. I've got some that I see every so many months because they live in my hometown 300 miles away. \n\nJust hang in there. It'll improve. Life is pretty strange. I still say 6 months to settle in and 12 months to feel like home. It's been about that for every place I've ever lived and I've lived quite a few places over the years.",
      "author": "Awkward_Mail_2786",
      "created": 1633955729,
      "upvotes": 12,
      "replies": {
        "hg7zmoo": {
          "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/hg7zmoo/",
          "text": "300 miles is 482.8 km",
          "author": "converter-bot",
          "created": 1633955745,
          "upvotes": 5,
          "replies": {}
        },
        "hg8j6h5": {
          "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/hg8j6h5/",
          "text": "I would love to be back in school. i’m looking towards going to law school in the future and as crazy as this sounds, I can’t wait. I love the educational environment.",
          "author": "artsyvonnie",
          "created": 1633965254,
          "upvotes": 2,
          "replies": {}
        },
        "hg8odt1": {
          "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/hg8odt1/",
          "text": "Covid is making things hella harder too. I've been living in my current town for about a year, it took 8 months to find decent housing (ended up moving in with a friend and his cat when his roommates moved out), and 12 months to find a job I like and start enjoying my time. but socializing and making friends has been super challenging.",
          "author": "Klutzy-Classroom6756",
          "created": 1633967447,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg6yqth": {
      "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/hg6yqth/",
      "text": "r/lifeafterschool basically. I'm sorry you are going through that. Idk It feels like bars and clubs are the only places people socialize.",
      "author": "KookieKutter",
      "created": 1633927004,
      "upvotes": 24,
      "replies": {
        "hg87bb9": {
          "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/hg87bb9/",
          "text": "This becomes more true as you get older. You will find things involve a lot more alcohol, you're just not getting fucked up every night. Once you hit a certain age your life just becomes a little... Boring. You don't have nearly as much free time to do your hobbies and a lot of people just watch netflix.",
          "author": "IamGeorgeNoory",
          "created": 1633959878,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hg8hn8l": {
      "link": "/r/college/comments/q5m2ug/we_need_to_talk_about_the_awkward_transition/hg8hn8l/",
      "text": "That awkward moment when you realise you live in an after school life without even having graduated lol",
      "author": "jose_belt",
      "created": 1633964587,
      "upvotes": 4,
      "replies": {}
    }
  }
}