{
  "sid": "r44g9i",
  "link": "/r/college/comments/r44g9i/what_do_you_do_when_youre_failing_so_miserably_in/",
  "title:": "What do you do when you’re failing so miserably in college?",
  "text": "I’m not failing-failing, but I don’t get good grades. My transcript is littered with B’s, C’s, and the rare A’s (usually only for gen eds). I’m a bio major and a senior. I’m supposed to know things by now according to professors and even just the way my fellow classmates handle school. I was a great, high-achieving student in high school. I even was great (straight A’s) my freshman year, but that’s because I had mostly gen eds. It seems like learning in my core classes is just … pure misery. I enjoy what I learn at times, but everything in my major in general is just difficult for me to register. I feel so stupid. My grades make me sad and more unmotivated. I’ve been trying to be positive and pick up great study habits since my sophomore year, but here I am as a senior not knowing anything I am being taught, unhappy, and feeling clueless about what I’ll do after college because I genuinely don’t even feel good enough for grad school. I don’t even know if I can make it into grad school at this point. It just truly sucks because I know I’m a capable person, but … I really don’t know what’s wrong. I don’t know what to do with myself at this point.",
  "author": "hesitantvisionary",
  "created": 1638106537,
  "updated": 1638206749,
  "over_18": false,
  "upvotes": 28,
  "upvote_ratio": 0.95,
  "comments": {
    "hmeka8j": {
      "link": "/r/college/comments/r44g9i/what_do_you_do_when_youre_failing_so_miserably_in/hmeka8j/",
      "text": "C’s get degrees my friend. C’s and B’s mean that you are performing averagely, not failing. Give yourself some credit. The transition into post-secondary is difficult and requires leaning new skills, growing up, and taking personal accountability (all things you are doing by the sounds of it). Don’t give up. You can get into grad school, it will just take more work. Remember to focus on the end goal, post-secondary is an amazing experience, but it’s only a short time of your life designed to get you somewhere else. You have almost completed an entire degree in Biology. You are one of the smartest, most educated beings in the known universe. Who cares what grade a professor gave you in English literature 101, don’t let it define you. Plenty of successful people out there with a lot less. At the very least, I believe in you. You can do it.",
      "author": "JonnywirelessCDN",
      "created": 1638110440,
      "upvotes": 19,
      "replies": {
        "hmfrkd1": {
          "link": "/r/college/comments/r44g9i/what_do_you_do_when_youre_failing_so_miserably_in/hmfrkd1/",
          "text": "In the age of grade inflation, Cs are absolutely not average",
          "author": "Low-Cheetah-1106",
          "created": 1638128720,
          "upvotes": 3,
          "replies": {
            "hmfxfuy": {
              "link": "/r/college/comments/r44g9i/what_do_you_do_when_youre_failing_so_miserably_in/hmfxfuy/",
              "text": "C is probably the mean, but not the median.",
              "author": "g0ballistic",
              "created": 1638131091,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hmenirf": {
      "link": "/r/college/comments/r44g9i/what_do_you_do_when_youre_failing_so_miserably_in/hmenirf/",
      "text": "The real question is what you want to be doing after college. I got into grad school (bio) with a barely-adequate GPA. Actually, the professor I'd been doing some undergrad research with had to write me an exemption because I was at 2.9 instead of 3.0.\n\nIf you're going to do anything with your Biology degree, you need to be starting now. Get in with a prof's lab, fix your studying, slow down and take some extra time if you can. You don't HAVE to graduate in four years. \n\nOtherwise, Biology might not be what you want to do, and that's okay. If you think you may be interested in something else, see if you can switch without too much additional time. Or just finish your degree, take some time away from college working, and think on it for a while. Either way, get that degree since you're so close. A bachelor's is always better than \"some college\" on a job application.",
      "author": "vesperIV",
      "created": 1638112043,
      "upvotes": 4,
      "replies": {}
    },
    "hmg0gtb": {
      "link": "/r/college/comments/r44g9i/what_do_you_do_when_youre_failing_so_miserably_in/hmg0gtb/",
      "text": "> because I genuinely don’t even feel good enough for grad school. I don’t even know if I can make it into grad school at this point.\n\nHonestly, it doesn't sound like you should even think about grad school, and not because you didn't get straight As (literally no one will care about that). It's more because it doesn't sound like it's the right environment for you, neither in the sense of academic content or what graduate school actually entails. \n\nA lot of people just *don't know* what graduate school is and think it's just \"more school.\" It's not. It's doing independent research. You aren't *not capable* of it. It just may not be what interests you, and that's perfectly okay! Spend more time thinking about what *does* interest you. It doesn't have to do with biology. What you study and what you end up doing as a career do not always line up, and that's perfectly okay too!",
      "author": "kingkayvee",
      "created": 1638132290,
      "upvotes": 2,
      "replies": {}
    },
    "hmhsd15": {
      "link": "/r/college/comments/r44g9i/what_do_you_do_when_youre_failing_so_miserably_in/hmhsd15/",
      "text": "I think your grade point average in college doesn't mean that much in most situations after college. the most important thing is finishing the degree.",
      "author": "Signal_Mind_4571",
      "created": 1638160294,
      "upvotes": 1,
      "replies": {}
    }
  }
}