{
  "sid": "edddyy",
  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/",
  "title:": "My Professor played an EPIC prank on us for finals [Help]",
  "text": "My professor said several times the past couple weeks that we had four hours to take our final in a 400 level circuits class. Anyways come finals time today two hours in he walks up to me and says, \"the reaper cometh\" and starts collecting finals. Me and everyone else are like wtf because we thought we still had two hours left but he said he was 'joking'. Now all finals are scheduled in 2 hour slots but we all thought he was giving us extra time to be nice if we needed it. Not once before or during the final did he say we only had 2 hours instead of 4 and never warned us our time was almost up. This man has been teaching the course for years and is tenured, how the hell do you get this far as a professor acting so childish and unprofessional? \nWho can I contact to file a complaint about this, me along with several other people may have failed the course because of this.\n\ntl;dr my professor said we had 4 hours for a final in a 2 hour time slot but collected finals after 2 hours saying he was joking. No one finished because we thought we had extra time. What should I do?",
  "author": "DiggityDiglett",
  "created": 1576863882,
  "over_18": false,
  "upvotes": 1170,
  "upvote_ratio": 0.98,
  "comments": {
    "fc5g5m4": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fc5g5m4/",
      "text": "If it’s a test designed for 2 hours then don’t blame your slacking on the professor. He was probably just seeing who would take the time to relax",
      "author": "pheonix03",
      "created": 1577456645,
      "upvotes": 1,
      "replies": {}
    },
    "fbsczqo": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbsczqo/",
      "text": "Driving by your college right now. Made me think of this. Any updates?",
      "author": "7up_yourz",
      "created": 1577053547,
      "upvotes": 1,
      "replies": {}
    },
    "fbjgm2w": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjgm2w/",
      "text": "This is good there is a lot of lazy people in college.",
      "author": "papichuloswag",
      "created": 1576933073,
      "upvotes": -2,
      "replies": {}
    },
    "fbirjcc": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbirjcc/",
      "text": "Posts like this make me nervous to go to a university 😬 Just got an associates degree and never spent more than 40 minutes on an in class test.",
      "author": null,
      "created": 1576911074,
      "upvotes": 1,
      "replies": {}
    },
    "fbimmj2": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbimmj2/",
      "text": "Call the dean, get other students to collaborate your story.",
      "author": "Redpanther14",
      "created": 1576905787,
      "upvotes": 3,
      "replies": {}
    },
    "fbim4i9": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbim4i9/",
      "text": "Did anyone in the class finish the exam? The professor could grade the questions that were answered and skip all the questions no one got to. So the grades will be fine. Or they will just add a massive curve, basically give out As. Either way your grade would be fine \n\nIf you try to report this to the chair before you get your grade it can actually work against you and the entire class. Let's say this *was* all a joke to your professor and he was planning on giving everyone A's on the final. You go to the chair/dean/etc complaining before you ever get your grade and they might make the professor grade the exams a certain way or make the class retake the exam or etc. Now, you're all getting lower grades when you would have gotten all A's. \n\nOf course if you do get your grade and its bad and everyone else in the class did just as bad, that's when you go up the chain",
      "author": "stathicus",
      "created": 1576905294,
      "upvotes": 3,
      "replies": {}
    },
    "fbiguu2": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbiguu2/",
      "text": "Builds character mate",
      "author": "kendebvious",
      "created": 1576900608,
      "upvotes": -3,
      "replies": {}
    },
    "fbi6ri3": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi6ri3/",
      "text": " > has been teaching the course for years and is tenured, how the hell do you get this far as a professor acting so childish and unprofessional?\n\nYou answer your own question. He's tenured, so he's almost impossible to fire. He can do whatever he wants, mostly.",
      "author": "mikeblas",
      "created": 1576892388,
      "upvotes": 6,
      "replies": {
        "fbmqq59": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbmqq59/",
          "text": "Tenure is not immunity. The school will likely limit his teaching exposure. This prof would probably consider that a reward rather than a punishment. My professors at my school have pulled similar stunts to get away from undergrads.",
          "author": "Otherwise-Positive",
          "created": 1576987735,
          "upvotes": 1,
          "replies": {
            "fbngpnn": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbngpnn/",
              "text": "It might not be immunity, but it's remarkably strong resistance. (Note that I said \"*almost* impossible\", not \"impossible\".)",
              "author": "mikeblas",
              "created": 1576997525,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fbi5j4p": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi5j4p/",
      "text": "[deleted]",
      "author": null,
      "created": 1576891384,
      "upvotes": 4,
      "replies": {
        "fbi6mvp": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi6mvp/",
          "text": "Yup, go look at the final schedule in your school websites. There’s probably some language that states the schedule is set in stone and that professors are not allowed to change it.",
          "author": "Ultra_dc",
          "created": 1576892285,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fbi2cal": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi2cal/",
      "text": "This’s my advice\n\nFirst go with a group of students to the teacher and tell him that you guys thought for real you’ll get 4 hours// or sent an anonymous email so if things didn’t work he won’t know who did a complement about him, see his replay, if things didn’t work go to second place you would go is students/teaching affairs, make sure a group not you alone, if it still nothing changed go to the dean of your major.",
      "author": "Kira-0",
      "created": 1576888789,
      "upvotes": 1,
      "replies": {}
    },
    "fbhyjw4": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhyjw4/",
      "text": "I’d use common sense for this, this situation seems tricky. The professor is either abusive, or this is a harmless joke. Regardless, I personally don’t feel a professor should do this at all because it might severely hinder some students.",
      "author": "legend_kda",
      "created": 1576885762,
      "upvotes": 4,
      "replies": {}
    },
    "fbhvlro": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhvlro/",
      "text": "Wait to see what happens with your grade before going up the COC.",
      "author": "soyuz_throwaway",
      "created": 1576883485,
      "upvotes": 5,
      "replies": {}
    },
    "fbht26l": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbht26l/",
      "text": "I understand where you are coming from but since you knew that final exams are scheduled for 2 hour time blocks you should've known.\n\nWith that said that is one hell of a prank. I'd love to have that professor.",
      "author": "legot83592",
      "created": 1576881608,
      "upvotes": -1,
      "replies": {}
    },
    "fbhsgbe": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhsgbe/",
      "text": "Please post an update on this situation in the future if you take any action on this.",
      "author": "Str8_up_Pwnage",
      "created": 1576881168,
      "upvotes": 6,
      "replies": {}
    },
    "fbho4w9": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbho4w9/",
      "text": "Talk to your professor first. Its possible hes giving you all As. If not forward his answer to your email to the department head.",
      "author": null,
      "created": 1576878321,
      "upvotes": 3,
      "replies": {}
    },
    "fbhnqsj": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhnqsj/",
      "text": "A prankster like this, I expect he will grade all you have done and only that.",
      "author": "par5ul1",
      "created": 1576878049,
      "upvotes": 1,
      "replies": {}
    },
    "fbhn6in": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhn6in/",
      "text": "I was waiting for the prank to turn out to be him taking the papers, and he would end up giving it back to you all",
      "author": "maliwhalee",
      "created": 1576877658,
      "upvotes": 2,
      "replies": {}
    },
    "fbhm3ac": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhm3ac/",
      "text": "Nightmare fuel 😭",
      "author": "littlekatthesnack",
      "created": 1576876917,
      "upvotes": 8,
      "replies": {}
    },
    "fbhlj8d": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhlj8d/",
      "text": "I thought this was gonna have a happy ending, like he picked them up and just gave you all As or something",
      "author": "BlackJezus27",
      "created": 1576876537,
      "upvotes": 27,
      "replies": {
        "fbi6mbb": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi6mbb/",
          "text": "He might have. The OP hasn't said.",
          "author": "mikeblas",
          "created": 1576892272,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fbhksx2": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhksx2/",
      "text": "[deleted]",
      "author": null,
      "created": 1576876033,
      "upvotes": 9,
      "replies": {
        "fbhm2ot": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhm2ot/",
          "text": "No, no he was pretty horrible the entire time. Was super easy to get lost in his lectures. He was funny and personable but an absolute 'i want to kill you' type of professor when it came to test difficulty and never assigned homework even remotely as difficult as our test problems were, so every time you kinda went in blind.",
          "author": "DiggityDiglett",
          "created": 1576876905,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "fbhkfqx": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhkfqx/",
      "text": "[deleted]",
      "author": null,
      "created": 1576875779,
      "upvotes": 9,
      "replies": {
        "fbmshyx": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbmshyx/",
          "text": ">Nothing else matters.\n\nLmao that's such nonsense. A syllabus is not a legal contract, nor is the \"policy for exam allotted time\" (whatever that is). \n\nBottom line: Deans run a tight ship. They don't like it when air-headed professors play stupid games. When the Dean hears about this, he/she isn't going to shrug  and say \"*aCcTuAAllly, the syllabus says xyz and the prof can lie whenever he wants because fuck you*\" \n\nThere's going to be consequences for this whether or not OP sees them.",
          "author": "Otherwise-Positive",
          "created": 1576988351,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fbhjlvo": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhjlvo/",
      "text": "Everyone will be graded on 2hrs of work and curved appropriately.  Don't worry about it.",
      "author": "wolf2600",
      "created": 1576875216,
      "upvotes": 42,
      "replies": {
        "fbmurb1": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbmurb1/",
          "text": "How exactly can you curve this *appropriately* without throwing out the test completely? It's not like everyone does a perfectly linear amount of work each minute. The students who worked the fastest will be rewarded, and the students who worked slowly with an expectation that they had 4 hours will be punished. There's no honest defense for this. The best you can say is \"*oh well, that's just how life is. People lie. Fuck you for taking a break, or taking extra time to check your work before moving on\"*",
          "author": "Otherwise-Positive",
          "created": 1576989112,
          "upvotes": 2,
          "replies": {
            "fbpzgue": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbpzgue/",
              "text": "> How exactly can you curve this appropriately without throwing out the test completely?\n\nJust because you don't understand how to grade an exam based on partial work doesn't mean it's not possible.",
              "author": "wolf2600",
              "created": 1577026836,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fbhiy4b": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhiy4b/",
      "text": "Ok I don't know what the deal is here in the comments but let me tell you - you need to make a big deal about this. Get with the other students and bring this up to the dean or whoever you can get in touch with.",
      "author": "YouMcFuckedup",
      "created": 1576874764,
      "upvotes": 13,
      "replies": {
        "fbhxxyo": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhxxyo/",
          "text": ">Get with the other students and bring this up to the dean or whoever you can get in touch with.\n\nDepartment chair first. Don't break the chain or it can cause all sorts of headaches. Things that can be easily fixed by a chair can get fucked up really quickly when the dean president, or chancellor gets involved.  I'm a department chair and know this from experience.",
          "author": "SnowblindAlbino",
          "created": 1576885286,
          "upvotes": 9,
          "replies": {}
        },
        "fbhpv3a": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhpv3a/",
          "text": "I don't agree s/he should wait to see their grade first.",
          "author": "Kalsifur",
          "created": 1576879551,
          "upvotes": 3,
          "replies": {
            "fbmrdh3": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbmrdh3/",
              "text": "Can professors do whatever they want, so long as you get an A??\n\nBesides, grading takes forever. OP should contact the professor and ask him what the plan is, then decide whether to escalate.",
              "author": "Otherwise-Positive",
              "created": 1576987961,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fbhippv": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhippv/",
      "text": "Did anyone in the class finish at all??? This is fucked up man!! If nobody finished the exam at all then you could play this into your argument. I’d talk to he professor first before stepping up the chain of command. But if he said it was a joke when you talk with him 1 v1 then  tell him how is your grade comes funny. I’d start talking to the department head and the dean after that conversation because this extremely fucked up and not funny. Please keep us updated man! Good luck!!",
      "author": "Tres345789",
      "created": 1576874605,
      "upvotes": 6,
      "replies": {}
    },
    "fbhii3g": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhii3g/",
      "text": "I have professors do the same or make the finals extremely difficult, from my experience they do it to curve the overall grade (the less people that get a good score the higher the curve).",
      "author": "andrezMolina",
      "created": 1576874457,
      "upvotes": 39,
      "replies": {
        "fbijnah": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbijnah/",
          "text": "Same here. Just had a class where the top final grade was an 80% and passing was a 50%",
          "author": "rea1l1",
          "created": 1576903014,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fbhhit8": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhhit8/",
      "text": "I understand your plight and sympathize with you but \n\n> \"the reaper cometh\" \n\nis just too funny. \n\nMaybe you'll all get As. Back when I was an undergrad, I took an incredibly difficult class that people were dropping out of even as late as right before the final. The final was difficult as shit too, but everyone who took the final ended up with an A lol.",
      "author": "A-Dumb-Ass",
      "created": 1576873793,
      "upvotes": 768,
      "replies": {
        "fbi1quz": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi1quz/",
          "text": "Ngl that's actually kind of awful for everyone because nothing done in the class by people putting in hours is recognized, and the kids who might have even been doing okay but dropped out got shat on.",
          "author": "IgnoreTheKetchup",
          "created": 1576888305,
          "upvotes": 162,
          "replies": {
            "fbi3bxy": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi3bxy/",
              "text": "That actually happened. There was a guy who had a 4.0 GPA and didn’t want to mess up his GPA so dropped it right before the final (dropping didn’t affect GPA at my uni). Another guy didn’t know how to drop the class and was shitting his pants before final, but he ended up with an A while the 4.0 guy ended up with a W.\n\nEdit: this was also the most rigorous undergrad course and the prof was the most high profile prof at the uni, so when it was time to apply for grad school, I’m ashamed to admit that that A helped me a lot lol.",
              "author": "A-Dumb-Ass",
              "created": 1576889590,
              "upvotes": 77,
              "replies": {
                "fbi59tz": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi59tz/",
                  "text": "I mean I *could* see his perspective on the idea that if you stick things through, things will get better. He might have wanted to reward those who learned the material more as a priority instead of worrying about failing the class. Not saying anything about this is right. \n\nI don't think it was the right approach though...",
                  "author": "elefish92",
                  "created": 1576891173,
                  "upvotes": 33,
                  "replies": {
                    "fbjdc9h": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjdc9h/",
                      "text": "This is straight out of Naruto where anyone who chooses to take the exam passes.",
                      "author": "Edywang",
                      "created": 1576931056,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fbisrhs": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbisrhs/",
          "text": "My Calculus III professor did something similar. Halfway through the test he stopped us, collected our exams and gave us all a 95% on the final. I got an A in that class.\n\nThis semester I took him for Computer Science I (C++) thinking he was the man and this did NOT happen. I got a C 🙃",
          "author": "Burnsy112",
          "created": 1576912577,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "fbhfaap": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhfaap/",
      "text": "you fucked up, sorry!",
      "author": "soup_2_nuts",
      "created": 1576872277,
      "upvotes": -28,
      "replies": {
        "fbk1c4n": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbk1c4n/",
          "text": "How did they fuck up? They were told by their instructor that they had 4 hours to take the exam multiple times. Should students stop believing this instructors??",
          "author": "americangothic2610",
          "created": 1576943287,
          "upvotes": 2,
          "replies": {
            "fbkh62f": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbkh62f/",
              "text": "When your alloted 2 hours and teacher says four hours ask questions",
              "author": "soup_2_nuts",
              "created": 1576950278,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "fbhf7bn": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhf7bn/",
      "text": "Pretty normal where I study (France) it’s because there’s too many students and they want to filter those that can definitely work under such stress. It’s called the concourse in France.",
      "author": "ViktorVaughnLickupon",
      "created": 1576872220,
      "upvotes": 12,
      "replies": {
        "fbhhl2u": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhhl2u/",
          "text": "They lie to you about how much time you have for the final?  That is fucked up.",
          "author": "jackfrost2013",
          "created": 1576873836,
          "upvotes": 32,
          "replies": {
            "fbhot3f": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhot3f/",
              "text": "I didn’t say that it was ethically right, but they have done that before.",
              "author": "ViktorVaughnLickupon",
              "created": 1576878793,
              "upvotes": 3,
              "replies": {
                "fbhvy1b": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhvy1b/",
                  "text": "I am just impressed people put up with shit like that.  Like tell me the rules and if I like them I will play the game but start changing the rules mid-game and we have a problem.",
                  "author": "jackfrost2013",
                  "created": 1576883746,
                  "upvotes": 9,
                  "replies": {
                    "fbhwk6c": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhwk6c/",
                      "text": "It’s not illegal so they have to put up with that. I expect this to happen in areas like medical school and philosophy with hard classes and many applicants.",
                      "author": "ViktorVaughnLickupon",
                      "created": 1576884218,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fbhhsn1": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhhsn1/",
          "text": "How does that make sense? Telling the class that they would have more time would make them less stressed.",
          "author": "MrPumpkin_Eater",
          "created": 1576873976,
          "upvotes": 20,
          "replies": {
            "fbhouux": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhouux/",
              "text": "No, if the teacher tells them 10min remaining they will get super stressed.",
              "author": "ViktorVaughnLickupon",
              "created": 1576878827,
              "upvotes": 2,
              "replies": {
                "fbhq64u": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhq64u/",
                  "text": "I find this really hard to believe. You are saying they want to filter people who can't work under stress, then saying giving them the time causes stress? Googling says  **Concours Général** is an academic contest where usually only one student per school participates.",
                  "author": "Kalsifur",
                  "created": 1576879758,
                  "upvotes": 2,
                  "replies": {
                    "fbhs1j4": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhs1j4/",
                      "text": "There’s thousands of students that participate and less than ten succeed.",
                      "author": "ViktorVaughnLickupon",
                      "created": 1576880865,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "fbhsex2": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhsex2/",
                      "text": "But it’s probably just in years with more students like the boomers etc. That makes more sense. I have been told that by teachers. I’ve not seen that myself. I apologize for not clarifying that in the first place. However, they definitely don’t get that idea out of thin air.",
                      "author": "ViktorVaughnLickupon",
                      "created": 1576881139,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fbhjomx": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhjomx/",
          "text": "A la fac ? Ou genre dans les prépas ?",
          "author": "marinewauquier",
          "created": 1576875268,
          "upvotes": 3,
          "replies": {
            "fbhorg8": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhorg8/",
              "text": "Pour clarifier, je suis allé à l'école en France et je suis actuellement en terminale mais nos professeurs d'orientation nous ont dit que c'est un moyen standard de sélection. Classe préparatoire. Après la préparatoire y a plus de concours comme au début.",
              "author": "ViktorVaughnLickupon",
              "created": 1576878762,
              "upvotes": 2,
              "replies": {
                "fbhqovy": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhqovy/",
                  "text": "Je t'avoue qu'à priori, c'est des légendes urbaines. La plupart de mes amis ont fait prépa, dont certaines très prestigieuses, et je n'en ai jamais entendu parler. Ils mettent beaucoup de pression, et il y a parfois des coups bas, mais mentir sur la durée d'une épreuve, jamais. \n\n(et juste une note -après la prépa il y des concours, le but de la prépa c'est de t'y préparer!). \n\nTu penses t'orienter vers quoi?",
                  "author": "Linaleli",
                  "created": 1576880067,
                  "upvotes": 2,
                  "replies": {
                    "fbhs9sx": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhs9sx/",
                      "text": "Philosophie. Et oui, peut-être c’est une légende urbaine. Et peut-être mes profs mon dit pour me faire peur mais ça dépend toujours au prof.",
                      "author": "ViktorVaughnLickupon",
                      "created": 1576881034,
                      "upvotes": 1,
                      "replies": {
                        "fbhsu6l": {
                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhsu6l/",
                          "text": "Mon petit frère est en train de faire philo, ça lui plaît énormément! C'est un bon choix ;) \nJe pense qu'ils ont du vous dire ça pour vous mettre un coup de pression pour les DS et le bac. Ne t'inquiète pas, les études supérieures c'est vraiment enrichissant et (personnellement en tous cas) bien mieux que le lycée.\nBon courage!",
                          "author": "Linaleli",
                          "created": 1576881447,
                          "upvotes": 3,
                          "replies": {
                            "fbhtvho": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhtvho/",
                              "text": "Oui, y a beaucoup dés mythes et beaucoup de stresse dès prof, mais si tu veux vraiment apprendre tu vas réussir.",
                              "author": "ViktorVaughnLickupon",
                              "created": 1576882203,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fbi5bym": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi5bym/",
          "text": "[deleted]",
          "author": null,
          "created": 1576891222,
          "upvotes": 2,
          "replies": {
            "fbj7scf": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbj7scf/",
              "text": "It’s a once every couple of years thing. There are much better stress testing methods such as super long exams etc.",
              "author": "ViktorVaughnLickupon",
              "created": 1576926992,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fbhetft": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhetft/",
      "text": "Do you have any records of the professor saying 4 hours? If yes use that as proof to go up department head or dean.",
      "author": "zoe_doan",
      "created": 1576871962,
      "upvotes": 185,
      "replies": {
        "fbhkh79": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhkh79/",
          "text": "Or at least multiple student witnesses. We had a similar issue happen but all we had was our words against the professors. It worked",
          "author": "Ms_Photon",
          "created": 1576875807,
          "upvotes": 132,
          "replies": {}
        },
        "fbiynpy": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbiynpy/",
          "text": "I hope OP sees this. Department head is definitely the first place to go. They should be able to solve the problem. If they can't solve your problem, they'll at least be able to bring it up with more ease and believability to the next person in the academia totem pole.",
          "author": "Th3FunkyChick3n",
          "created": 1576919599,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "fbhc8qi": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhc8qi/",
      "text": "I would go up the chain of command. Start with the department head, then the dean of the college, and maybe the dean of the school. Maybe nothing would happen because the school already laid out the finals schedule in 2 hour time slots.",
      "author": "lankysmart",
      "created": 1576870244,
      "upvotes": 213,
      "replies": {
        "fbhhubi": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhhubi/",
          "text": "I think if everyone in the class was lead to believe the final was four hours long it doesn't really matter what was written anywhere.  At the very least it should be grounds for a retest.",
          "author": "jackfrost2013",
          "created": 1576874007,
          "upvotes": 129,
          "replies": {
            "fbk0zfu": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbk0zfu/",
              "text": "I have a feeling it wasn’t “the whole class”. That’s a common claim IME, but often reflects a small minority. And if the exam was scheduled for 2 hours, it was ridiculous no one bothered asking if that was really the case. \n\nI’ve never been at a university where faculty had discretion to double the time of in class finals during finals week. Rooms are tightly scheduled.",
              "author": "urnbabyurn",
              "created": 1576943134,
              "upvotes": 5,
              "replies": {
                "fbmniof": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbmniof/",
                  "text": "You can't fault the students for failing to second guess the professor's own words. Why should the onus be on the class to assume the professor would lie about his time slot for finals? \n\nFurthermore, at most institutions, faculty are able to reserve rooms as they see fit (within reason, and if available). If my professor told me the final was 4 hours long, I would assume he had this worked out with facilities prior. You would too, even if you won't admit it.",
                  "author": "Otherwise-Positive",
                  "created": 1576986407,
                  "upvotes": 3,
                  "replies": {}
                },
                "fbn93ts": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbn93ts/",
                  "text": "Our finals are generally the length that professors choose for them, though this might be because finals week is **two** weeks instead of one",
                  "author": "Lonely_Boii_",
                  "created": 1576994382,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fbhlkn3": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhlkn3/",
          "text": "Just wait and see how the grades break before you start filing grievances. This sounds like a poorly-run class, but maybe the prof is going to quietly make this right without a fuss. Drawing attention to the situation could backfire unless you're certain that you've been damaged by the exam.",
          "author": "galileosmiddlefinger",
          "created": 1576876563,
          "upvotes": 42,
          "replies": {
            "fbmpteb": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbmpteb/",
              "text": "I think that's a little too opportunist, and could just as easily backfire. At a certain point grades are expected to be finalized and you're just burning your own runway by waiting to submit complaints.\n\nI would immediately reach out to the professor, and depending on his response, decide whether to escalate the issue to higher-ups. My assumption is this guy is going to \"set things right\" with a curve, not a bunch of free A's. If that's the case then complaints need to be submitted regardless of how the curve affects you as a student. Because really, this a botched exam. You can't intentionally mislead students about how much time they have on an exam. If this happened to me and I knew no matter what I was getting an A, I would still complain out of principle. Professors shouldn't be using their students as punchlines for a joke, especially when the joke adversely affects *final* *exam scores*.",
              "author": "Otherwise-Positive",
              "created": 1576987349,
              "upvotes": 3,
              "replies": {
                "fbr22yi": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbr22yi/",
                  "text": "Reaching out to the professor =/= filing a complaint up the chain of command. The advice upthread is to start with the department head. Speaking as a department head, once you come to me we're in official grievance mode and have to follow institutional policy. That will probably greatly restrict the number of better outcomes that could be otherwise worked out directly with the professor.",
                  "author": "galileosmiddlefinger",
                  "created": 1577038222,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fbhtnca": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhtnca/",
          "text": "[deleted]",
          "author": null,
          "created": 1576882036,
          "upvotes": 25,
          "replies": {
            "fbhwckz": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhwckz/",
              "text": "That is good advice.  The prof may throw a heavy curve on it to avoid having to retest the whole class.",
              "author": "jackfrost2013",
              "created": 1576884053,
              "upvotes": 14,
              "replies": {}
            },
            "fbmqcoe": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbmqcoe/",
              "text": "Why would that be stupid? Students should be scored against their merits, not by how they abide with stupid games. \n\nBetter idea: **just ask the professor directly what the gameplan is,** then decide if it needs to be escalated",
              "author": "Otherwise-Positive",
              "created": 1576987573,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fbhn9z9": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhn9z9/",
          "text": "He can actually continue this chain all the way to meet the president.",
          "author": "1Darude1",
          "created": 1576877722,
          "upvotes": 9,
          "replies": {
            "fbhz4mj": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhz4mj/",
              "text": "Or the state board of education",
              "author": null,
              "created": 1576886212,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fbhbul7": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhbul7/",
      "text": "I don't think anything much can happen. The school will probably say \" if you look at the schedule it says two hours. It is always two hours no matter what anyone says\"",
      "author": "creed_1",
      "created": 1576869981,
      "upvotes": 55,
      "replies": {
        "fbhizka": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhizka/",
          "text": "It’s incompetent to tell your students you have a 4 hour slot when in reality it’s 2 hours.\n\nWhat the teacher did is not normal or professional. He’s playing with peoples grades. Something can definitely be done",
          "author": "BeanNCheeze",
          "created": 1576874792,
          "upvotes": 55,
          "replies": {
            "fbhjhys": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhjhys/",
              "text": "I think of it more like the teachers that have it hidden on a test that says only fill in your name. Then people do the whole test only to find out they shouldn't and get 0s. Teachers don't get in trouble for that and I can see this being very similar. Schools tend to be on the side of their professors so I don't believe much will come of this",
              "author": "creed_1",
              "created": 1576875141,
              "upvotes": 15,
              "replies": {
                "fbhke9q": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhke9q/",
                  "text": "what kind of school would do this???",
                  "author": "alexandrini",
                  "created": 1576875752,
                  "upvotes": 17,
                  "replies": {
                    "fbhkips": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhkips/",
                      "text": "I had a few high school teachers do it because students weren't reading instructions in the test. So they did it to prove to students that they had to do it. One of my college professor did it my freshman year but I think almost everyone only wrote their names",
                      "author": "creed_1",
                      "created": 1576875836,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                },
                "fbhnibu": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhnibu/",
                  "text": "> Teachers don't get in trouble for that\n\nThis is so wrong. If a professor did this, they would get in *so much* trouble. Pulling that kind of crap is serious ground to lose accreditation, which is pretty much the worst thing that can happen to a university. This isn't high school.",
                  "author": "Penglingz",
                  "created": 1576877883,
                  "upvotes": 10,
                  "replies": {
                    "fbhxri1": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhxri1/",
                      "text": ">Pulling that kind of crap is serious ground to lose accreditation,\n\nYeah, no. It's extremely hard to loose accreditation and they are not looking at things on this granular a level. I've been involved with accreditation many times over the years and in my experience the reviewers don't even look at individual syllabi, much less the actions of a single professor in a single course.\n\nNo need for hyperbole here. This was unprofessional but there aren't going to be any consequences for the institution, the department, or the instructor.",
                      "author": "SnowblindAlbino",
                      "created": 1576885150,
                      "upvotes": 3,
                      "replies": {
                        "fbidhr9": {
                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbidhr9/",
                          "text": "My alma mater recently went through accreditation, and at least 2 courses I took were required to collect and save every single test and homework for potential review.",
                          "author": "1millionbucks",
                          "created": 1576897866,
                          "upvotes": 1,
                          "replies": {
                            "fbiet63": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbiet63/",
                              "text": "> ...for potential review\n\nYes, sure. But the visiting team didn't look at them; they never do. Accreditation self-studies usually end up with thousands of pages of information collected and the visiting team is typically on campus for a few days. They didn't look at your papers.",
                              "author": "SnowblindAlbino",
                              "created": 1576898945,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        },
                        "fbj6lck": {
                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbj6lck/",
                          "text": "> are not looking at things on this granular a level\n\nO...kay? The point is that administration don't want professors doing this kind of thing at all. It's bad, it looks bad, and if it happens enough, it gets the entire university into trouble.",
                          "author": "Penglingz",
                          "created": 1576926084,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "fbiwnsj": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbiwnsj/",
                      "text": "It would be easy to sue the professor & school for it as well. Damages? Tuition, hours in class, hours studying, book costs, supply costs. Simply bringing a suit to them would make them offer a retest if it isn't fixed.",
                      "author": "xodus989",
                      "created": 1576917712,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "fbhnol6": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhnol6/",
                      "text": "I literally said a professor did it too and they are still at the school teaching the same course.",
                      "author": "creed_1",
                      "created": 1576878006,
                      "upvotes": 1,
                      "replies": {
                        "fbho3ol": {
                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbho3ol/",
                          "text": "Yeah, I don't believe that at all. It sounds like some hearsay that students passed around in first year. Nobody who wants to keep their job would pull this. \n\nAnd if a professor *did* do this, just because they're still teaching the same course doesn't mean they didn't get into a shitload of trouble.",
                          "author": "Penglingz",
                          "created": 1576878298,
                          "upvotes": -4,
                          "replies": {
                            "fbho702": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbho702/",
                              "text": "I never once heard that in school. Only thing most first year students said was \" if the Prof isn't here in the first 15 minutes, we can leave\"",
                              "author": "creed_1",
                              "created": 1576878362,
                              "upvotes": 2,
                              "replies": {
                                "fbiom47": {
                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbiom47/",
                                  "text": "First years? Students of most or all years at my college say this. I had one teacher who was 8 minutes late to the final exam and everyone was talking about that rule. I had another exam where the professor was 3 minutes late and people started talking about that rule. It seems that as soon as the rule is brought up, the professor shows up lol.",
                                  "author": "SuperDogBoo",
                                  "created": 1576907824,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fbhnwbx": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhnwbx/",
          "text": "I wouldnt accept such an answer.",
          "author": null,
          "created": 1576878157,
          "upvotes": 3,
          "replies": {
            "fbho3co": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbho3co/",
              "text": "You don't have to accept it but that doesn't mean the school changes it? That's like someone saying they don't accept a sentencing in court. The court doesn't go oh okay let me change it to accommodate you. A lot of schools are pretty fd up these days with how the run things. You fail a class they get paid, and then you have to take the class again and they get paid again.",
              "author": "creed_1",
              "created": 1576878292,
              "upvotes": 2,
              "replies": {
                "fbhocyf": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhocyf/",
                  "text": "A university doesnt have supreme power like a court does. If youre paying 20,000 a year and they tell you you have 4 hours on the final then you have 4 hours on the final. The university doesnt want the bad publicity either so they should work with you if you make it in their best interest to do so.",
                  "author": null,
                  "created": 1576878478,
                  "upvotes": 3,
                  "replies": {
                    "fbhz2b5": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhz2b5/",
                      "text": "> A university doesnt have supreme power like a court does. If youre paying 20,000 a year and they tell you you have 4 hours on the final then you have 4 hours on the final.\n\nIf they say you have 4 hours, then the prof says actually just 2 hours, and the department head says the prof is allowed to do that and the dean sides with the department head, then that's the result you've got.",
                      "author": "bl1y",
                      "created": 1576886161,
                      "upvotes": 1,
                      "replies": {
                        "fbi0ntg": {
                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi0ntg/",
                          "text": "And if they actually do that, which they wont because they know better, then you go to your local news station with the story.",
                          "author": null,
                          "created": 1576887426,
                          "upvotes": 2,
                          "replies": {
                            "fbiwvd1": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbiwvd1/",
                              "text": "Skip the news station and go to court. You can easily sue for just under 10k in damages.",
                              "author": "xodus989",
                              "created": 1576917928,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "fbi12he": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi12he/",
                              "text": "Your local news station probably won't give a shit. If there was video with a heated confrontation, they'd air it, but a student complaining about being treated unfairly? It's not news.",
                              "author": "bl1y",
                              "created": 1576887751,
                              "upvotes": 1,
                              "replies": {
                                "fbi19aw": {
                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi19aw/",
                                  "text": "I dont know where you live but where I do local news stations eat up outrage stories. Especially evil big universities.",
                                  "author": null,
                                  "created": 1576887906,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fbhoj1i": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhoj1i/",
                      "text": "They should doesn't mean they will. But also you have to think what if a person has an exam right after the normal two hour slot. If the professor gives the 4 hours said that person that gets only 2 hours to take their exam is shafted compared to the rest. Just expect it to be only 2 hours and then if the Prof does give you more time then great. If not then you're prepared.",
                      "author": "creed_1",
                      "created": 1576878598,
                      "upvotes": 0,
                      "replies": {
                        "fbhpg5l": {
                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhpg5l/",
                          "text": "The professor shafted his entire class by telling them they had 4 hours. I think youve lost perspective.",
                          "author": null,
                          "created": 1576879251,
                          "upvotes": 2,
                          "replies": {
                            "fbi68m5": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi68m5/",
                              "text": "But finals are not scheduled by professors. It’s set by the university so that you don’t have conflicts. If there is a change on the location or time for a final, you confirm it with your department at a minimum.",
                              "author": "Ultra_dc",
                              "created": 1576891965,
                              "upvotes": 1,
                              "replies": {
                                "fbi6mep": {
                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi6mep/",
                                  "text": "If the professor, who you are paying to teach you life skills and grade your work, tells you that you have 4 hours onnthe final, and then goes \"psych, you thought\" and you just accept that as acceptable thats ridiculous.\n You will never get far in life if you just accept it when other people screw you over.\n\nIf the professor made a mistake about the times then he made a mistake. No big deal. But it should not be the students paying many thousands that are the ones to take the fall for the proffessors mistake.",
                                  "author": null,
                                  "created": 1576892274,
                                  "upvotes": 4,
                                  "replies": {
                                    "fbi7kuc": {
                                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi7kuc/",
                                      "text": "If you’ve gone through 4 years of college and you haven’t learned to trust but verify the information you get, then this is a good lesson to learn for that class. If the due date changes, you check to see if there is a conflict.",
                                      "author": "Ultra_dc",
                                      "created": 1576893055,
                                      "upvotes": -1,
                                      "replies": {
                                        "fbi8bd6": {
                                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi8bd6/",
                                          "text": "Youre such an appologist its actually gross.",
                                          "author": null,
                                          "created": 1576893651,
                                          "upvotes": 2,
                                          "replies": {
                                            "fbi8oz4": {
                                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi8oz4/",
                                              "text": "I have no sympathy for such a gullible group. They were fine with fucking over the next class using that room to take a final.",
                                              "author": "Ultra_dc",
                                              "created": 1576893955,
                                              "upvotes": -3,
                                              "replies": {
                                                "fbi9b1a": {
                                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi9b1a/",
                                                  "text": "Yeah yeah whatever. Just remember when an authority figure in your life inevitably unjustly screws you over, and you arent getting any help or sympathy from others, you can look at those people and remember you are also one of them.",
                                                  "author": null,
                                                  "created": 1576894453,
                                                  "upvotes": 3,
                                                  "replies": {
                                                    "fbi9k1w": {
                                                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi9k1w/",
                                                      "text": "I have and that’s why I’ve learned to trust but verify. Document everything! Send an email to confirm what was discussed if a change was provided verbally.",
                                                      "author": "Ultra_dc",
                                                      "created": 1576894656,
                                                      "upvotes": -1,
                                                      "replies": {
                                                        "fbia4us": {
                                                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbia4us/",
                                                          "text": "Or maybe, just maybe, professors at an academic institution should only profess what is FACT. Distrusting everyone isnt the rational anwser here, trust is the entire reason society in general works.\n\nIf the institution sides against the students and basically says \"yeah you know this guy that you are paying thousands of dollars to get information from...yeah, well maybe dont trust everything he says\" then think about the message that sends.",
                                                          "author": null,
                                                          "created": 1576895132,
                                                          "upvotes": 3,
                                                          "replies": {
                                                            "fbikjmp": {
                                                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbikjmp/",
                                                              "text": "You’re right, professors are never wrong and you should never question what they say or do. They never make mistakes.",
                                                              "author": "Ultra_dc",
                                                              "created": 1576903818,
                                                              "upvotes": -1,
                                                              "replies": {
                                                                "fbke4kp": {
                                                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbke4kp/",
                                                                  "text": "What you are saying is that professors should not be held accountable for their own mistakes.",
                                                                  "author": null,
                                                                  "created": 1576948907,
                                                                  "upvotes": 1,
                                                                  "replies": {}
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        },
                                        "fbiwti2": {
                                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbiwti2/",
                                          "text": "If the professor says a final has a certain time limit, then that is what I would expect. The instructor needs to be held accountable in this case unless he was playing a joke and giving everyone a pass on the final.",
                                          "author": "xodus989",
                                          "created": 1576917872,
                                          "upvotes": 1,
                                          "replies": {
                                            "fbjqw6k": {
                                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjqw6k/",
                                              "text": "Why would you expect the professor to tell you how long the final is when it’s the universes job to schedule that to avoid conflicts. If the professor changes the time, I’m questioning it. If this was a freshman class then I would be sympathetic but this is a senior class who have gone through so many finals. \n\nYou people need to take ownership before you start to blame everyone around you.",
                                              "author": "Ultra_dc",
                                              "created": 1576938513,
                                              "upvotes": 1,
                                              "replies": {
                                                "fbjrzs3": {
                                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjrzs3/",
                                                  "text": "It's that he told them how long they had, not that they expected him to. Once he gives a time frame for his test, it moves on from being an asshole to negligence.",
                                                  "author": "xodus989",
                                                  "created": 1576939046,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "fbjvg5r": {
                                                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjvg5r/",
                                                      "text": "The professor can’t change the time so why would you believe him?",
                                                      "author": "Ultra_dc",
                                                      "created": 1576940679,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "fbjvqf5": {
                                                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjvqf5/",
                                                          "text": "Because he is speaking as a representative of the school and therefore is responsible for only being truthful. If his lies cause damages, then he is being negligent with his position of power.",
                                                          "author": "xodus989",
                                                          "created": 1576940810,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "fbjwhgm": {
                                                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjwhgm/",
                                                              "text": "it the responsibility of the student to know their final schedule. That’s set by the school by the beginning of the semester. Why are the students not responsible?",
                                                              "author": "Ultra_dc",
                                                              "created": 1576941144,
                                                              "upvotes": 1,
                                                              "replies": {
                                                                "fbjwr0l": {
                                                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjwr0l/",
                                                                  "text": "Because they are being told by an instructor in a position of power over them that the time has changed. Quite often the students are at fault in many of the situations that arise, but this is not one of them.\n\nThis is the professor intentionally misleading the students causing a poor grade.",
                                                                  "author": "xodus989",
                                                                  "created": 1576941263,
                                                                  "upvotes": 1,
                                                                  "replies": {
                                                                    "fbjy11v": {
                                                                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjy11v/",
                                                                      "text": "OP was also told by the university how long the final was. There is a discrepancy between the information given by the university and the professor. One of them has more authority on this decision (it’s the university). \n\nIt’s the same as a TA giving you a different due date on an assignment than was given by the professor. Are you just going to accept what the TA tells you without confirming with the professor? Both are in a position of power but the professor has more authority.",
                                                                      "author": "Ultra_dc",
                                                                      "created": 1576941836,
                                                                      "upvotes": 1,
                                                                      "replies": {
                                                                        "fbjybwy": {
                                                                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbjybwy/",
                                                                          "text": "There's much more of a power gap between a TA and a professor. When you sue someone, all you have to prove to a judge is that you received damages due to someone else. A professor intentionally misleading students for no reason causing them to fail and lose thousands of dollars is 100% a valid reason to collect damages.",
                                                                          "author": "xodus989",
                                                                          "created": 1576941970,
                                                                          "upvotes": 1,
                                                                          "replies": {}
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "fbhpnwz": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhpnwz/",
                              "text": "No I'm just giving a reason as to why the professor may have not given the 4 hours that he said. A school has an exam schedule for a reason. Prepare for the two hours and if you get the extra time then great. If you don't then you are ready for it",
                              "author": "creed_1",
                              "created": 1576879408,
                              "upvotes": 0,
                              "replies": {
                                "fbhsa9m": {
                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhsa9m/",
                                  "text": "Professors are in a position of authority and trust and it is not unreasonable to believe them when they tell you something about a test that they are administering. A professor misleading people at what is surely a stressful time is really messed up and should be punished. And obviously the professor shouldn't give 4 hours because that isn't possible, but they also shouldn't mislead their students into thinking otherwise.",
                                  "author": "Str8_up_Pwnage",
                                  "created": 1576881044,
                                  "upvotes": 7,
                                  "replies": {
                                    "fbi6an9": {
                                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi6an9/",
                                      "text": "Professors have little authority on final examination scheduling.",
                                      "author": "Ultra_dc",
                                      "created": 1576892009,
                                      "upvotes": 2,
                                      "replies": {
                                        "fbi6f5r": {
                                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi6f5r/",
                                          "text": "It shouldn't be the students responsibility to determine whether or not their professor is lying to them.",
                                          "author": "Str8_up_Pwnage",
                                          "created": 1576892111,
                                          "upvotes": 7,
                                          "replies": {
                                            "fbi8p9u": {
                                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi8p9u/",
                                              "text": "Yeah the professor shouldn’t be lying to the students, period. If the professor doesn’t give all of them an A on the test, then his “prank” was just cruelty.",
                                              "author": "Mecca1101",
                                              "created": 1576893962,
                                              "upvotes": 4,
                                              "replies": {}
                                            },
                                            "fbi7ubk": {
                                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi7ubk/",
                                              "text": "No but you should always question the information you’re given or at least verify that it is correct. Specially on a matter where a professor has little say. Professors aren’t in charge of scheduling finals.",
                                              "author": "Ultra_dc",
                                              "created": 1576893271,
                                              "upvotes": 0,
                                              "replies": {
                                                "fbi8i1q": {
                                                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi8i1q/",
                                                  "text": "I feel like we are going in circles. Yes the students should have been more vigilant. But none of this would have happened had the professor not been an asshole for no reason.",
                                                  "author": "Str8_up_Pwnage",
                                                  "created": 1576893799,
                                                  "upvotes": 4,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "fbhpxj7": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhpxj7/",
                              "text": "If you are working on a project for someone and you were given a certain time limit, then they say oh you get some extra time, most humans would still try to do it in the original time given",
                              "author": "creed_1",
                              "created": 1576879601,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fbh8ed5": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbh8ed5/",
      "text": "That’s really fucked up. Since you guys thought you had 4 hours to take the test you didn’t really think to have finish your test in a fast pace. I wonder how the curve is gonna be or the highest test grade.",
      "author": "Abyz963",
      "created": 1576867675,
      "upvotes": 209,
      "replies": {}
    },
    "fbh33so": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbh33so/",
      "text": "This is a great TIFU story tbh. My thoughts and prayers are with the affected at this time.",
      "author": "CaptainSpankJarrow",
      "created": 1576864325,
      "upvotes": 448,
      "replies": {
        "fbh3968": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbh3968/",
          "text": "Thank you. You're welcome to attend the funeral for my course grade later on if you want.",
          "author": "DiggityDiglett",
          "created": 1576864407,
          "upvotes": 285,
          "replies": {
            "fbi0l3r": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi0l3r/",
              "text": "F\n\nEdit: Thanks for the silver, stranger! It's my first award!",
              "author": "shreyamtaneja",
              "created": 1576887367,
              "upvotes": 95,
              "replies": {
                "fbi209y": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi209y/",
                  "text": "Literally",
                  "author": "Nosbod_",
                  "created": 1576888519,
                  "upvotes": 23,
                  "replies": {}
                },
                "fbibbda": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbibbda/",
                  "text": "-",
                  "author": "DrumletNation",
                  "created": 1576896086,
                  "upvotes": 2,
                  "replies": {}
                },
                "fbi2gvn": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbi2gvn/",
                  "text": "F",
                  "author": "HeLLBURNR",
                  "created": 1576888894,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fbmva97": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbmva97/",
          "text": "Not really sure how you can claim OP fucked up. Are you really a fuckup for not assuming your professor to have ill-intent?",
          "author": "Otherwise-Positive",
          "created": 1576989297,
          "upvotes": 3,
          "replies": {
            "fbznmo6": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbznmo6/",
              "text": "Exam times are clearly stated ( or at least supposed to be stated) in the course outline for any uni/ college course. This is a document that is signed by the course instructor and department head, and the information cannot change unless both parties agree to it, and a signed version is documented. \n\nSince the course outline said two hours, unless you personally file for extra time due to health reasons to your department, you get the alloted time as per the course outline. Thus the FU rationale.",
              "author": "CaptainSpankJarrow",
              "created": 1577253020,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fbh2jez": {
      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbh2jez/",
      "text": "Find that hard to believe. What school is this?",
      "author": null,
      "created": 1576864014,
      "upvotes": 49,
      "replies": {
        "fbh2mey": {
          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbh2mey/",
          "text": "[deleted]",
          "author": null,
          "created": 1576864060,
          "upvotes": 59,
          "replies": {
            "fbhadoi": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhadoi/",
              "text": "Damn bro, I go here too. That's really shit.",
              "author": "MeGotShadowbanned",
              "created": 1576868995,
              "upvotes": 53,
              "replies": {}
            },
            "fbhn571": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhn571/",
              "text": "I go to IUPUI, first thing you need to do is contact department head, and office of registrar. I had to do something similar last year and they adjusted my grade after writing about 600 words of pure frustration.",
              "author": "Myaj0757",
              "created": 1576877632,
              "upvotes": 13,
              "replies": {
                "fbhu3nx": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhu3nx/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1576882371,
                  "upvotes": 14,
                  "replies": {
                    "fbhuj3u": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhuj3u/",
                      "text": "I didn’t have to do that. I contacted them as soon as the issue arose, and they took care of it. My friend, who waited until the end of the semester had to wait until the following spring to take care of it due to them being backed up(and closed for the holidays).",
                      "author": "Myaj0757",
                      "created": 1576882682,
                      "upvotes": 1,
                      "replies": {
                        "fbibq7y": {
                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbibq7y/",
                          "text": "Who did you contact the department head or registar? I go to a IU school as well",
                          "author": "Beowulf_27",
                          "created": 1576896415,
                          "upvotes": 1,
                          "replies": {
                            "fbiecfi": {
                              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbiecfi/",
                              "text": "Look through your schools(major) directory and you will see the head of the department. Like head of Journalism or Comm Studies. Registrar has a general email like Finaid.",
                              "author": "Myaj0757",
                              "created": 1576898566,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "fbhhcey": {
              "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhhcey/",
              "text": "Bruh we can't even get an out and proud \"are women ruining academia?  Probably\" sexist to face any sort of consequences down here in Bloomington.  Good luck up there.",
              "author": "Punchee",
              "created": 1576873672,
              "upvotes": 24,
              "replies": {
                "fbhu0oy": {
                  "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhu0oy/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1576882312,
                  "upvotes": 18,
                  "replies": {
                    "fbhuec4": {
                      "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhuec4/",
                      "text": "IU Bloomington has a professor who has been in the news for being a shithead.\n\nhttps://www.washingtonpost.com/education/2019/11/20/university-says-professors-views-are-racist-sexist-homophobic-they-cant-fire-him/\n\nI’m saying good luck getting IU (which IUPUI is part of) to do much when they can’t even go after this guy.  Tenured professors wield a lot of power.",
                      "author": "Punchee",
                      "created": 1576882586,
                      "upvotes": 10,
                      "replies": {
                        "fbhyroy": {
                          "link": "/r/college/comments/edddyy/my_professor_played_an_epic_prank_on_us_for/fbhyroy/",
                          "text": "It's really hard to get rid of a tenured professor for their views since that's exactly what tenure is there to protect. Easier to get rid of a professor for just ending an exam in the middle without warning.",
                          "author": "bl1y",
                          "created": 1576885930,
                          "upvotes": 11,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634054859
}