{
  "sid": "qvufj8",
  "link": "/r/college/comments/qvufj8/ive_been_failing_and_retaking_classes_over_the/",
  "title:": "Ive been failing and retaking classes over the past year and 1.4 gpa, I might have a chance.",
  "text": "Freshman year I came into school with a good amount of AP credits, it put me way ahead in math and I started out in differential equations which I have now taken 3 times. This recent semester I withdrew because I was going to fail. I failed it the first two time. I will admit it’s 100% my fault and I wasn’t ready for college and the study habits I needed to make the grades happen. I’m studying mechanical engineering currently and last semester failed or withdrew from literally all of my classes. Because of covid I got to take no credits on two of them. I am currently retaking 3 of those classes not including the diffeq and 2 of those have grade replacements applied. My gpa resulting following this year with my current grades will be a 2.5 and I am passing all of these classes which meets the minimum gpa requirements but I have passed the amount of times I can take diffeq, I’m hoping anyone has a horror story like mine with any advice for if they were able to apply credit from a community college or get the school to allow a retake. Online classes have not been my thing and in person this year is much better. I know that I am smart enough to succeed and just have issues that I have been working through with my study habits. Also my advisor is not helping me figure it out.",
  "author": "100losers",
  "created": 1637136444,
  "updated": 1637181174,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkz9wql": {
      "link": "/r/college/comments/qvufj8/ive_been_failing_and_retaking_classes_over_the/hkz9wql/",
      "text": "This sounds horribly familiar to my own experience. I went through almost the same thing. \n\nTaking time out of school to start working jobs helped me a ton. I had zero discipline when I was first at college. I skated through high school as well and college didn't work that way. \n\nI worked for close to 10 years before coming back. I'm 32 now and college is so much different. I'm not struggling at all. My grades are how they should have been. All of my assignments are done on time and I haven't missed any at all. The biggest difference is just discipline. I learned to be disciplined through working that long and being held accountable for things. I never had that before. \n\nUltimately, it led me to be more confident in my studies. I have way more experiences to relate things to. So far, college has been so much easier than the work I was doing. I would rather study all day every day than do what I was doing.",
      "author": "Awkward_Mail_2786",
      "created": 1637151699,
      "upvotes": 2,
      "replies": {
        "hl0d4zo": {
          "link": "/r/college/comments/qvufj8/ive_been_failing_and_retaking_classes_over_the/hl0d4zo/",
          "text": "Pretty much same. My freshman year was less than 1.0 and I worked in a nursing home for a while after getting kicked out. Then I went back and actually went to every class and did every assignment and ... it was a lot easier.",
          "author": "jessamina",
          "created": 1637169501,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}