{
  "sid": "q9jalf",
  "link": "/r/college/comments/q9jalf/how_can_i_get_the_access_code_for_my/",
  "title:": "How can I get the access code for my homework/midterm in Connect McGraw Hill?",
  "text": "It costs $150 and is there any way I can save some money? I just need the access code, not the textbook. Is there a way to buy for example a used code or something like that?",
  "author": "Blisstering-Misery",
  "created": 1634414123,
  "updated": 1634423791,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgwcgsa": {
      "link": "/r/college/comments/q9jalf/how_can_i_get_the_access_code_for_my/hgwcgsa/",
      "text": "If $150 is for an access code and a physical textbook than you can most likely just get the access code cheaper from the publisher directly or buy a card online at Amazon. Sometimes you will save $20-$40 or more but it’s still better than paying full price.",
      "author": "XenOz3r0xT",
      "created": 1634414357,
      "upvotes": 2,
      "replies": {}
    },
    "hgwc4z7": {
      "link": "/r/college/comments/q9jalf/how_can_i_get_the_access_code_for_my/hgwc4z7/",
      "text": "If you search for just the access code and cant find anyone selling that, then no. Every time ive seen a used textbook theres always the disclaimer that access codes may not be valid. And anyone selling just the access code, I would be very wary that theyre scamming and that the code has been used",
      "author": "taybay462",
      "created": 1634414215,
      "upvotes": 1,
      "replies": {}
    },
    "hgwmhii": {
      "link": "/r/college/comments/q9jalf/how_can_i_get_the_access_code_for_my/hgwmhii/",
      "text": "That's the strategy that the various text book publishers use, forcing you to buy the book to buy the software. Trust me, it is absolutely intentional on their part that you are paying more than you need to, and there really isn't a good way around it.",
      "author": "patrdesch",
      "created": 1634418723,
      "upvotes": 1,
      "replies": {}
    },
    "hgwq6vo": {
      "link": "/r/college/comments/q9jalf/how_can_i_get_the_access_code_for_my/hgwq6vo/",
      "text": "Often you can buy just the code from either directly from the company or even your school’s bookstore.",
      "author": "Hufflepuff7009",
      "created": 1634420388,
      "upvotes": 1,
      "replies": {}
    }
  }
}