{
  "sid": "qnj553",
  "link": "/r/college/comments/qnj553/college_sucks/",
  "title:": "college sucks",
  "text": "I look like I have it all together; 4.0, a high paying job, friends, saved enough in hs for college yk all that stuff. Reality says different. I constantly just sit in my dorm and procrastinate thinking about the future of my life and how I don't like my major but its to late to change. I lost my girlfriend as we went to different states for college. Now you can get expelled if you get caught at a party and intramurals and activities are canceled because of covid. All the classes are online and I spend 22 hours of the day in my dorm. In hs I was super social and had a great time at parties, athletics, clubs. Now college just sucks ass and I have no clue if I should keep doing this or drop out and use that money I saved for college to get into real estate. Please help ik a lot of other people are in this situation!",
  "author": "Straight-Spend-7432",
  "created": 1636141942,
  "updated": 1636655844,
  "over_18": false,
  "upvotes": 68,
  "upvote_ratio": 0.95,
  "comments": {
    "hjgqscb": {
      "link": "/r/college/comments/qnj553/college_sucks/hjgqscb/",
      "text": "It sounds sucky. \n\nPerhaps you'd like to take a break and return to college when Covid is over? Classes wouldn't be online, stuff wouldn't be canceled and you would not have to spend 22 hours of the day in your dorm. \n\nAlso, why is it too late to switch your major?",
      "author": "IwriteIread",
      "created": 1636145381,
      "upvotes": 23,
      "replies": {
        "hjgsmx1": {
          "link": "/r/college/comments/qnj553/college_sucks/hjgsmx1/",
          "text": "I'm the age of a freshman and have almost mid junior standing so I wouldn't want to pay like 60K to retake classes I would need. I don't know if it's worth switching I'm currently in finance and would want to go into the medical field.",
          "author": "Straight-Spend-7432",
          "created": 1636146088,
          "upvotes": 8,
          "replies": {
            "hjgw1kp": {
              "link": "/r/college/comments/qnj553/college_sucks/hjgw1kp/",
              "text": "60k is a lot of money. Are you sure it would be that much? I assume that a lot of your classes could be used for a major in the medical field. \n\nSetting aside other majors, do you want a finance degree? If you don't want it, I don't think you should get it.",
              "author": "IwriteIread",
              "created": 1636147404,
              "upvotes": 9,
              "replies": {
                "hjii4p4": {
                  "link": "/r/college/comments/qnj553/college_sucks/hjii4p4/",
                  "text": "I big second this. I was admitted to University for Life Sciences (Mainly Biology), but I'm a second year now and half of my classes are year 1 because I'm switching into Physical Sciences (Physics, Math, Chemistry). I realized, thankfully early, that I didn't want to get a Bio degree, but it's definitely never too late to change. It feels sucky to go back to square one, but I'm enjoying this program a lot more than the other one :)",
                  "author": "TheMensaGuy1",
                  "created": 1636173870,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "hjj1uax": {
              "link": "/r/college/comments/qnj553/college_sucks/hjj1uax/",
              "text": "You can always go to a community college and spend a couple grand for the same gen ed and pre requisites you’re talking about having to spend 60k on. Plus if you’re junior standing all gen ed would be done so you’d only need to do some pre requisites. Go to a community college for that and maybe test out a couple of hands on medical field courses that community colleges typically have and see if you would truly enjoy it. I switched my major multiple times. Most people do which is why I think going to community college is better so you don’t waste a bunch of time and money on shit you don’t end up wanting to do. I’m 25 now and just about to graduate since I also took time off to travel and work. Eventually I realized what I truly want to do and I’m loving my major and can’t wait to get into my career.",
              "author": "0Lauren0",
              "created": 1636188705,
              "upvotes": 4,
              "replies": {
                "hjmrcfo": {
                  "link": "/r/college/comments/qnj553/college_sucks/hjmrcfo/",
                  "text": "Thanks for the advice. What majors did you switch back and forth from?",
                  "author": "Straight-Spend-7432",
                  "created": 1636254305,
                  "upvotes": 1,
                  "replies": {
                    "hjmt9r6": {
                      "link": "/r/college/comments/qnj553/college_sucks/hjmt9r6/",
                      "text": "At 18 I started as a psychology major. Then switched to biology (emphasis on ecology). Interned in a lab and realized no thanks. I worked in an elementary school at the time too and then changed my major to education to be an elementary school teacher. Then realized I didn’t want to spend all that money on a degree and credential for as little pay as it was and very little increase without more and more education. I stopped going to school for a while after that and moved across the country and traveled a lot. I decided to try and work in the field of psychology thinking maybe I would get my degree in that but with the goal not being the same as when I first wanted to major it in. Working in the field made me realize that nope it wasn’t for me even though I loved learning about it. Then I went back to working in schools and debated going for teaching again but could never bring myself to go back for that. Then one day I came across urban planning and I looked into that for a while and then a couple months into the pandemic I decided that’s what I was going to do and I never looked back. I’m really close to finishing now and the more I learn about it the more excited I am to start my career. I’m also getting a cert in geographic info systems. It meets everything I could want in a career honestly.",
                      "author": "0Lauren0",
                      "created": 1636255335,
                      "upvotes": 2,
                      "replies": {
                        "hjn6obs": {
                          "link": "/r/college/comments/qnj553/college_sucks/hjn6obs/",
                          "text": "Thankyou very much for the detailed response. I’ll have a more open mind in regards to choosing my major.",
                          "author": "Straight-Spend-7432",
                          "created": 1636263388,
                          "upvotes": 3,
                          "replies": {
                            "hjn87r1": {
                              "link": "/r/college/comments/qnj553/college_sucks/hjn87r1/",
                              "text": "No problem. Shop around a little for a major. Trust me you won’t regret taking a little more time to be sure it’s what you want to do. It’s only the career you’ll be doing most of your life so take your time choosing. Consider all aspects of the job not just interest in the major itself.",
                              "author": "0Lauren0",
                              "created": 1636264474,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjgs3y5": {
      "link": "/r/college/comments/qnj553/college_sucks/hjgs3y5/",
      "text": "I'm lucky enough that my classes are all in-person, but I still feel you...I'm so depressed that I've barely been attending my classes. I have somehow managed to make friends and I hang out with usually at least one person a week--which is \"all I wanted\" for so many years--but there's still this emptiness inside of me that I'm not sure will ever go away.\n\nDoes your college not have any clubs you could possibly join? \n\nThe semester is almost over, I think you should finish this semester before considering dropping out. There's also no real harm in taking one semester off to put your thoughts together and consider what you want to do. If you want to continue school, you'll be able to pick up. If you want to go into real estate instead, you can do that too.",
      "author": "SquigglyHamster",
      "created": 1636145887,
      "upvotes": 8,
      "replies": {
        "hjgstef": {
          "link": "/r/college/comments/qnj553/college_sucks/hjgstef/",
          "text": "Thanks for the detailed response. I'm in the investing club super interesting right. I would join and intramural but covid cancelled them",
          "author": "Straight-Spend-7432",
          "created": 1636146157,
          "upvotes": 1,
          "replies": {
            "hji5bif": {
              "link": "/r/college/comments/qnj553/college_sucks/hji5bif/",
              "text": "join a hobby club! there are some really weird clubs out there at any club, you’re bound to find friends. also see if your college has a subreddit and maybe you can start/join a discord. social media is a good way to make friends, i’m a senior and that’s personally how i met some of my best friends in college. i’m also heavily involved in greek life and so i would explore the options on your campus. i hope things get better for you!!\n\nalso maybe this is just be but if staying in college is the best financial decision for you then you should ride it out but still try and follow your dreams. talk to a dean or advisor about changing your major plan to finance on a pre-med track, it will be hard but it you want it it’s worth it",
              "author": "fauxdeep",
              "created": 1636166986,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjhm0qd": {
      "link": "/r/college/comments/qnj553/college_sucks/hjhm0qd/",
      "text": "COVID is a load of crap, that aside, have you talked to your hall mates? I made a lot of friends from my hall/building my first year.",
      "author": "PaddyWag99",
      "created": 1636158014,
      "upvotes": 7,
      "replies": {
        "hjhoegy": {
          "link": "/r/college/comments/qnj553/college_sucks/hjhoegy/",
          "text": "Yeah I agree the ways colleges are handing Covid is just ridiculous. Most kids are just super antisocial although I’ll keep trying",
          "author": "Straight-Spend-7432",
          "created": 1636159076,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjgn630": {
      "link": "/r/college/comments/qnj553/college_sucks/hjgn630/",
      "text": "College sucks for me too dude..  I’m constantly depressed in the dorm and I can’t take it anymore. High school was 50 times better",
      "author": "SnooPredictions7193",
      "created": 1636144035,
      "upvotes": 5,
      "replies": {
        "hjgtv09": {
          "link": "/r/college/comments/qnj553/college_sucks/hjgtv09/",
          "text": "same boat man hopefully it gets better..... I go to the gym which helps sometimes",
          "author": "Straight-Spend-7432",
          "created": 1636146565,
          "upvotes": 1,
          "replies": {
            "hjun1fv": {
              "link": "/r/college/comments/qnj553/college_sucks/hjun1fv/",
              "text": "I’m a gym rat. I live there",
              "author": "SnooPredictions7193",
              "created": 1636405099,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hji3045": {
      "link": "/r/college/comments/qnj553/college_sucks/hji3045/",
      "text": "I feel you man, more than you know. If you’re gonna drop out finish this semester at least. I don’t know you so I won’t give you any more advice besides do what you feel is the best decision, not the easiest, the most comforting, or least painful.",
      "author": "2013MAKEOUTHILL",
      "created": 1636165866,
      "upvotes": 3,
      "replies": {
        "hjifack": {
          "link": "/r/college/comments/qnj553/college_sucks/hjifack/",
          "text": "Valid argument",
          "author": "Straight-Spend-7432",
          "created": 1636172231,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjiaboe": {
      "link": "/r/college/comments/qnj553/college_sucks/hjiaboe/",
      "text": "If you can’t change majors in your current school, maybe you could transfer to another one? Maybe you can double major? Or go to graduate school?\n\nI would say, if you are close from graduating, just finish. If you can change majors to something you really like, that would be great. \n\nCOVID really screwed up the college experience for many. You’re not alone in the social aspect. \n\nUltimately, the decision of what to do is yours to make.",
      "author": "2Browneyes2",
      "created": 1636169569,
      "upvotes": 2,
      "replies": {
        "hjif9hx": {
          "link": "/r/college/comments/qnj553/college_sucks/hjif9hx/",
          "text": "Thanks a lot",
          "author": "Straight-Spend-7432",
          "created": 1636172217,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hji35xe": {
      "link": "/r/college/comments/qnj553/college_sucks/hji35xe/",
      "text": "Switch colleges",
      "author": "Warfys",
      "created": 1636165942,
      "upvotes": 1,
      "replies": {}
    },
    "hjj0216": {
      "link": "/r/college/comments/qnj553/college_sucks/hjj0216/",
      "text": "jus drop out be happy dumbass",
      "author": "boohoo369",
      "created": 1636187246,
      "upvotes": 0,
      "replies": {}
    }
  }
}