{
  "sid": "qmohy3",
  "link": "/r/college/comments/qmohy3/how_do_people_make_groups_of_friends/",
  "title:": "How do people make groups of friends",
  "text": "I see everyone with groups of friends and just wonder how do they even make them? What could I be doing wrong? I’ve joined a club and that has only gave me 2 friends but we aren’t close or anything. I talk to people in my class. I’m pretty introverted too so that could be why. The semester is about to end but I just want a group of close/best friends for next semester to go to parties with (even though I don’t party I just want the experience for once) and to just have fun like I see everyone else doing. How did you find your people in college and could anyone give me some advice because I’m tired of being lonely and don’t bond with other people well to become best friends.",
  "author": "jcks234",
  "created": 1636043422,
  "updated": 1636137407,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjaxjs1": {
      "link": "/r/college/comments/qmohy3/how_do_people_make_groups_of_friends/hjaxjs1/",
      "text": "Based on my experience most people make friends from being involved in athletics. It's a lot of trial and error. If you're really not making friends try joining multiple clubs just to network. You may not like the people you're meeting and talking to, but if they know more people than you you could end up liking people they're connected to. Join as many online forums for your school as you can, figure out when events are being held that might interest you. Ask people you're acquainted with what types of things they do or go to. It can be a very slow process, but you will eventually come across someone you genuinely get along with that probably has other friends there. You just have to be willing to put in the time and effort to socialize with people you might not be compatible with. Otherwise, friends won't fall into your lap",
      "author": "tyxmue",
      "created": 1636045073,
      "upvotes": 2,
      "replies": {}
    },
    "hjcfbqc": {
      "link": "/r/college/comments/qmohy3/how_do_people_make_groups_of_friends/hjcfbqc/",
      "text": "1. school discords \n2. clubs \n3. gym / athletics \n4. work \n5. going to school events",
      "author": "bubblewubb1es",
      "created": 1636066415,
      "upvotes": 2,
      "replies": {}
    }
  }
}