{
  "sid": "rgfqbx",
  "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/",
  "title:": "Need help getting out of a BAD college slump. Any advice?",
  "text": "currently in my second year and finishing up my fall semester in like two days. Im currently on academic probation for flunking second semester of freshman year. Starting from like the last few weeks of my senior year of high school I had gotten really lazy and tired with school. I graduated during the pandemic so I finished the last two months of senior year at home. \n\nThis upcoming spring semester will be my first time having in person classes since that March of 2020 when Covid hit the U.S. I thought it was just a case of “senioritis” and that I was just excited to be done with high school and couldnt be bothered to do whatever joke assignments they gave out (Especially since I already got into a school and has a good GPA that could take the hit of one C.) Upon entering freshman year online it was a bit rocky but I passed all my classes with B’s and C’s. There were periods where I had to really push myself to get work done.\n\nI was a Mech E major at the time but spring 2021 I got a huge wave of this same lack of motivation and it got so bad that I stopped caring about everything, I totally flunked and ended up on academic probation. I also realized this major was not for me and changed my major to Information Systems.\n\nI am now in my fall semester of sophomore year and taking my Info Systems gateway courses. Flunked one of my classes, might get a C for two of them (one of which requires me to get a B in order to pass) and one A. I also had this same lack of motivation and focus and had to really push myself to do work. I do enjoy this major and want to continue but I feel so crappy and don’t know how to break out of this. If I end up on academic probation one more time I will be expelled. I really dont know whats wrong with me.",
  "author": "BigEwrldwide",
  "created": 1639511658,
  "updated": 1639515964,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {}
}