{
  "sid": "ranvam",
  "link": "/r/college/comments/ranvam/should_i_keep_going_with_computer_science_with_bs/",
  "title:": "Should I Keep Going With Computer Science with Bs in all my computer science classes?",
  "text": "To all the comp sci majors and alumni, I m currently taking my Data Structures class and I’m a sophomore. I’ve passed all my other “gateway” computer science classes with B’s, which is weird to me since I usually get As but literally every computer science class other than like Assembly Language Programming I’ve gotten Bs. I don’t code in my free time since I barely even have free time with a part time job. It’s not that I hate computer science, I just seem to not be meant for it. Maybe a major part of it is that I wait until the last minute to do my projects. But this semester I’m hovering between a C and a B. This question has probably been asked many times, but should I continue computer science, or pursue something I think would be easier.\n\nTL:DR - B in all my comp sci classes, and maybe C this semester. Should I continue the major?",
  "author": "Wonderful_Ad_7359",
  "created": 1638842529,
  "updated": 1639517740,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hnjgelm": {
      "link": "/r/college/comments/ranvam/should_i_keep_going_with_computer_science_with_bs/hnjgelm/",
      "text": "Keep at it.  You're doing just fine.  If you drop to C's, that's when you start to get concerned.",
      "author": "ojioni",
      "created": 1638842585,
      "upvotes": 5,
      "replies": {
        "hnjhaaj": {
          "link": "/r/college/comments/ranvam/should_i_keep_going_with_computer_science_with_bs/hnjhaaj/",
          "text": "Thank you, yeah I honestly think I might drop to a C this semester. I had one of the professors and was supposed to do classes live but he ended up switching to online due to medical problems and even then he just posted old videos he made during lockdown. With how important it seems data structures is, I might retake the class",
          "author": "Wonderful_Ad_7359",
          "created": 1638842966,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}