{
  "sid": "qpsooa",
  "link": "/r/college/comments/qpsooa/is_evolution_denial_still_a_thing/",
  "title:": "Is evolution denial still a thing?",
  "text": "On other college campuses, is creationism vs evolution still something that is discussed?\n\nWhat is the most prevalent “anti-science” topic that is actively being discussed on college campuses?",
  "author": "Virophile",
  "created": 1636421816,
  "updated": 1636655344,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjyhx8p": {
      "link": "/r/college/comments/qpsooa/is_evolution_denial_still_a_thing/hjyhx8p/",
      "text": "Yes, evolution denial is still a thing. There are people on my campus that have signs that talk about the fact evolution isn’t real (to them). In fact, my biological anthropology class had to give a 20 minute disclaimer on the separation between science and religion. Shit’s crazy, dog.",
      "author": "tritippie",
      "created": 1636478484,
      "upvotes": 2,
      "replies": {
        "hjykflp": {
          "link": "/r/college/comments/qpsooa/is_evolution_denial_still_a_thing/hjykflp/",
          "text": "I just have a hard time believing that we are STILL here. I want to believe that this is sort of a fringe thing that is voiced by a loud minority.",
          "author": "Virophile",
          "created": 1636479467,
          "upvotes": 2,
          "replies": {
            "hjykt60": {
              "link": "/r/college/comments/qpsooa/is_evolution_denial_still_a_thing/hjykt60/",
              "text": "I also live in the southern US and go to a rather large public school. In my first year biology class, I knew some people that dropped the class because it conflicted with their religious views. It’s really weird that people straight up deny fossil evidence. I think you’re right, it is a vocal minority. I just have to deal with it more often than someone living in say New York has to.",
              "author": "tritippie",
              "created": 1636479616,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}