{
  "sid": "rh7s1w",
  "link": "/r/college/comments/rh7s1w/first_fail/",
  "title:": "first fail",
  "text": "it’s my first semester and well, i failed my first exam. i currently have a c in that class, but im scared. im still in the mindset that says “an A is successful” so idk how to feel, what’re your guys’ thoughts? will i be alright?\n\nedit: meant the final. i failed the final, sorry lmao",
  "author": "lazy-assdreamer",
  "created": 1639598135,
  "updated": 1639787881,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hop7iey": {
      "link": "/r/college/comments/rh7s1w/first_fail/hop7iey/",
      "text": "My first semester, I failed a whole class. My financial aid dropped. I couldn't take the next class the next semester because the one I failed was a pre rec. I took it again the next school year and passed it. Brought my GPA back up. And I failed another class later on, and retook that one too.\n\nAn A is successful, but it doesn't define success. A C is still passing. Nowadays I'm happy if my grade is barely above the threshold of what is considered passing. Because I tried my best in the end, and that's all that matters. You're going to be just fine. If you end the class with a grade you don't like, retake it. One bad grade doesn't mean anything.",
      "author": "begayanddocrimes",
      "created": 1639605303,
      "upvotes": 1,
      "replies": {}
    },
    "hop84da": {
      "link": "/r/college/comments/rh7s1w/first_fail/hop84da/",
      "text": "Growth is what is successful in my opinion. If you fail the first test but then ace the final that growth is what you should be proud of. Learn from your past mistakes and use those lessons to have success in your other classes.",
      "author": "Nosleep_9764",
      "created": 1639605542,
      "upvotes": 1,
      "replies": {
        "hop8ail": {
          "link": "/r/college/comments/rh7s1w/first_fail/hop8ail/",
          "text": "yo thank you for replying, i meant i failed the final though :/",
          "author": "lazy-assdreamer",
          "created": 1639605608,
          "upvotes": 1,
          "replies": {
            "hopfd7b": {
              "link": "/r/college/comments/rh7s1w/first_fail/hopfd7b/",
              "text": "If the C is after the final it still isn't bad. I mean finals week is stressful so if you only did bad on 1 then it still isn't bad.",
              "author": "Nosleep_9764",
              "created": 1639608503,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}