{
  "sid": "q1sfss",
  "link": "/r/college/comments/q1sfss/college_and_work/",
  "title:": "College and work?",
  "text": "Hello, I'm a 20 year old, almost 21 year old, and I just started my first quarter of my first year of college. I put it off for a couple of years to work. \n\nBut now that I'm working and taking on a full time load for school, time has been a bit tight. I'm taking Pre cal, intro to computer science and english, and it's getting a bit hard trying to manage my time studying for all when I have work. \n\nI dropped my hours to 27 hours a week, but even that makes it hard when I'm trying to do pre calculus and my other classes, which are less demanding. I want to be ahead in all of them but work is getting in the way.\n\nI just dunno what to do, and honestly I don't wanna quit my job, because everyone there guilt trips me if I miss a day or two because they \"need\" me. It's just a shitty part time minimum wage job, and I'm not really a big part of anything but people think I am to meet our quota. \n\nAnd I want to so badly pass college. I do. I just feel like I have so much on my plate and it's stressing me out. Any advice?",
  "author": "Mrsv00rhees",
  "created": 1633424203,
  "updated": 1634083963,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hfgjtcl": {
      "link": "/r/college/comments/q1sfss/college_and_work/hfgjtcl/",
      "text": "How badly do you need the income? Do you have any family who could help a bit while you get through? Even if not maybe try something like ubereats, a work study job if you’re eligible, or applying for grants/scholarships? A job that only requires 15-20 hrs a week? I was in the same exact position at 20 with a boss and co workers that didn’t care that I had school and a job that had a quota. My boss would always tell me I could do both but I literally couldn’t find time for everything. Don’t let them get to you. They don’t care. They’re replaceable to you and you are to them! I recently quit my old job and went back to school 2 yrs later. Best decision ever.",
      "author": "Missdaytona99",
      "created": 1633425116,
      "upvotes": 4,
      "replies": {
        "hfj14v9": {
          "link": "/r/college/comments/q1sfss/college_and_work/hfj14v9/",
          "text": "I'm not in terrible need of money, I've just been trying to save up for the future and pay for necessities, I thought about getting a 15-20 hour job. Even before school I've wanted to quit, but they tell me I can do both work and school, and they strictly give me 8AM-1PM, shifts, because the department I'm in only runs from 8AM-4Pm. I know those extra 3 hours can be some but it's still not enough for what I need. \n\nIt also gives me a harder time to get some self care time and time to sit and collect myself.",
          "author": "Mrsv00rhees",
          "created": 1633468978,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfgk3eu": {
      "link": "/r/college/comments/q1sfss/college_and_work/hfgk3eu/",
      "text": "First of all mate I totally understand what you're going through . Most students struggle with doing both , since at the end of it all , one must be compromised especially if both are demanding.\n Have you tried private tutoring ?",
      "author": "Due-Imagination4299",
      "created": 1633425395,
      "upvotes": 2,
      "replies": {}
    },
    "hfhcpq0": {
      "link": "/r/college/comments/q1sfss/college_and_work/hfhcpq0/",
      "text": "[removed]",
      "author": null,
      "created": 1633443570,
      "upvotes": 1,
      "replies": {}
    },
    "hfhw76z": {
      "link": "/r/college/comments/q1sfss/college_and_work/hfhw76z/",
      "text": "I work full time while going to school full time and let me tell you, it is really difficult. Here is what helps me: \n\n1. I schedule every single thing. I sat down with a printout of an hourly weekly schedule and mapped out when my classes were and when work was and I schedule time around it to study. \n2. When I started school, I switched to overnight shifts. If this is a possibility, I highly recommend it just because you can typically study during the overnight while you are at work! \n\nDon't feel shitty for missing days. Your education and future happiness are more important.",
      "author": "swren497",
      "created": 1633451798,
      "upvotes": 1,
      "replies": {
        "hfj1gi9": {
          "link": "/r/college/comments/q1sfss/college_and_work/hfj1gi9/",
          "text": "Thank you. :) Unfortunately, my work requires me to be there 8AM-1PM. I even asked for shorter hours than that but they said they needed me.  But I can always talk to my boss and see what he thinks.",
          "author": "Mrsv00rhees",
          "created": 1633469121,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}