{
  "sid": "qgeuln",
  "link": "/r/college/comments/qgeuln/feeling_bad_about_really_poor_final_project/",
  "title:": "Feeling bad about really poor final project",
  "text": "Bit of context I'm a UK soon to be ex student who's just completed a Masters. While the final project dissertation is still worth a lot of credits it's not a massive proportion to the overall mark. I'd done well enough in my other modules that I only needed to scrape a Pass in my final project to get a Merit overall. I procrastinate a lot and am not the best worker so perhaps took my project a bit nonchalantly. I didnt meet a lot with my supervisor when I should've and didn't read as much as I couldve around it. I completed the bulk of it in the last week of the deadline so didn't have a draft for my supervisor to check. Of course I know this is stupid looking back but in the moment you assume you're fine. For this project I had to do a presentation and answer a lot of questions about it. It was soon made apparent that I got some big things wrong in my project and struggled to answer some questions on it. All of this would have been avoided if I sought regular feedback. I may have done enough to scrape the Pass I need, but I still feel really bad about such rubbish work and feel it was probably a wasted opportunity to really showcase a well researched project for my CV. \n\nIs there anyone else who has been in the same boat, and how did you combat the feeling?",
  "author": "chairmankuze123",
  "created": 1635278501,
  "updated": 1635302396,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi6bro6": {
      "link": "/r/college/comments/qgeuln/feeling_bad_about_really_poor_final_project/hi6bro6/",
      "text": "The way I see it is that you made a mistake and you have to learn from it moving forward. I've procrastinated before and the stress is honestly just not worth it. Make sure to do your work on time and be prepared in the future. As long as you learned a lesson from this you shouldn't feel bad in my opinion.",
      "author": "macaron0",
      "created": 1635288201,
      "upvotes": 1,
      "replies": {}
    }
  }
}