{
  "sid": "qv148d",
  "link": "/r/college/comments/qv148d/starting_to_resent_my_major_but_i_dont_know_what/",
  "title:": "Starting to resent my major but I don’t know what to do?",
  "text": "I’m lying in bed and I have a ton of hw and assignments to do. Not the type where there’s a due date, but they’re all like big projects or exams at the end of the semester. I’m doing electrical engineering right now and I’m still not really sure if I’m going to pass my last classes to go to upper division.\n\nI was undeclared for two years and I basically have the progress of a second semester sophomore. I just am starting to resent the fact that it’s so hard, that it’s going to cause me an ungodly amount of stress for something I don’t even necessarily like, or care about. \n\nThe thing is I don’t care about a specific subject, I’ve been pushed into engineering by my parents and by my ego, bc I just wants something that’s prestigious and is supposed to give me good money (it’s not guaranteed). I don’t necessarily hate the classes, but I hate how incredibly difficulty they are, I don’t like the people in engineering tbh, and idk if I’m just burnt out but ya. \n\nThe thing is there seems to be no other choice and nothing else seems to stand out and in good at math so idk what else to choose. \n\nHas anyone been in this sort of situation as well? How did it plan out for you? I’m most afraid right now of being a disappointment or something and failing out or dropping out, but at the same time there’s a part of me that’s too apathetic to cafe about anything anymore.",
  "author": "moonkie888",
  "created": 1637042859,
  "updated": 1637181428,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hku0taz": {
      "link": "/r/college/comments/qv148d/starting_to_resent_my_major_but_i_dont_know_what/hku0taz/",
      "text": "I was on my way to get an EE degree in my sophomore year. Hated my life because I was struggling through circuits classes that I couldn't care less about, so it became clear to me that I didn't want to be an electrical engineer as a career. I changed to CS because there are a lot of software engineering jobs and I don't hate the subject. No regrets because even if some of my classes are still painfully hard, I feel like they're not worthless because they will help me get a job that I don't hate/suck at. So I guess my suggestion to you is to think about a career you want where you wouldn't hate your life and try classes in that field if time allows. If you end up really suffering, consider switching to a major where you won't hate your life everyday because burnout is real. OR tough it out if you see value in it.",
      "author": "smoothegg",
      "created": 1637053580,
      "upvotes": 2,
      "replies": {}
    },
    "hktz14e": {
      "link": "/r/college/comments/qv148d/starting_to_resent_my_major_but_i_dont_know_what/hktz14e/",
      "text": "Your life sucks. Engineering? Made my dick soft just thinking about it.",
      "author": "asscarnage",
      "created": 1637052084,
      "upvotes": 1,
      "replies": {}
    },
    "hku2w6q": {
      "link": "/r/college/comments/qv148d/starting_to_resent_my_major_but_i_dont_know_what/hku2w6q/",
      "text": "Have you considered computer science? Lots of jobs in the field, good money with potential to be great money, not as difficult as EE (probably, idk). Software engineering can hold that same \"prestige\" and pay that your parents want you to aim for, without being too hard on you if you don't have anything else you want to pursue.",
      "author": "NoDryHands",
      "created": 1637055384,
      "upvotes": 1,
      "replies": {}
    },
    "hkxmc2e": {
      "link": "/r/college/comments/qv148d/starting_to_resent_my_major_but_i_dont_know_what/hkxmc2e/",
      "text": "Hey. I could help you with that",
      "author": "AdrianBoa",
      "created": 1637113911,
      "upvotes": 1,
      "replies": {}
    }
  }
}