{
  "sid": "qxu1tw",
  "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/",
  "title:": "Is dropping a total of three classes too much?",
  "text": "To put things short, I’ve dropped 2 classes my first semester due to covid. The switch from in person classes to online classes was too much for me. Currently on my second to last semester and am taking a class that I really want to drop, but if I do it’ll be my third one. Would this be too much? I plan to my associates by the end of spring 2022. Will transfer to a 4 year university by Fall 2022.",
  "author": "Fuckatnames47",
  "created": 1637369990,
  "updated": 1637689303,
  "over_18": false,
  "upvotes": 39,
  "upvote_ratio": 0.92,
  "comments": {
    "hlbxhlq": {
      "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlbxhlq/",
      "text": "I really think that would be too much. The standard load is 5 classes, and you'll need to maintain that at your four year unless you have special financial circumstances that enable that option. You need to work at time management so you can handle at least 60% of your future courseload.",
      "author": "HorrorDisk8",
      "created": 1637370354,
      "upvotes": 30,
      "replies": {
        "hlcpkjz": {
          "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlcpkjz/",
          "text": "Btw, I’m not dropping 3 classes in 1 semester. I’ve already dropped 2 last year when covid started getting serious. Ever since then I haven’t dropped a class. This would be my 3rd one in total, but it’s the only one I’ve dropped in the past year.",
          "author": "Fuckatnames47",
          "created": 1637384832,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hlc0f0h": {
      "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlc0f0h/",
      "text": "It really would be too much. Keep in mind just how much harder it gets at a 4 year. You shouldn’t be cheating yourself in CC.",
      "author": "maora34",
      "created": 1637371693,
      "upvotes": 13,
      "replies": {
        "hlc9b2b": {
          "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlc9b2b/",
          "text": "Btw, I’m not dropping 3 classes in 1 semester. I’ve already dropped 2 last year when covid started getting serious. Ever since then I haven’t dropped a class. This would be my 3rd one in total, but it’s the only one I’ve dropped in the past year.",
          "author": "Fuckatnames47",
          "created": 1637375931,
          "upvotes": 2,
          "replies": {
            "hlcl2ef": {
              "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlcl2ef/",
              "text": "Oh 3rd in total? Not a big deal. I thought you meant 3 in one semester. Go ahead. I have 1 F, 2Ds, and 5Ws on my CC transcript. Still transferred to a top uni and now I have an internship offer for $85K a year, and can expect around $100k for a full time offer. You’ll be fine.",
              "author": "maora34",
              "created": 1637382186,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "hlc86i5": {
      "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlc86i5/",
      "text": "It’s not ideal but if you don’t think you can pass it’s better to drop the class then fail",
      "author": "ba-len-ci-10",
      "created": 1637375388,
      "upvotes": 3,
      "replies": {}
    },
    "hlcraup": {
      "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlcraup/",
      "text": "I think the way you explained it has some people confused. If you are going to fail the course, I would drop it instead. If you are going to get a C- or C+, do not drop the course. What is your current grade in the course and why are you considering dropping it?",
      "author": "modestmouselover",
      "created": 1637385904,
      "upvotes": 3,
      "replies": {
        "hlcusm7": {
          "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlcusm7/",
          "text": "My grade is currently a B. Unfortunately I took a quiz yesterday and definitely failed since I didn’t have time to finish it. I won’t receive my grade until next Wednesday while the deadline to withdraw is on Monday. I feel like ima get a C most likely but it should have been much better grade since it’s a class that I’m only taking for the credits. Wasn’t even a requirement ;(",
          "author": "Fuckatnames47",
          "created": 1637388185,
          "upvotes": 3,
          "replies": {
            "hlcwkie": {
              "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlcwkie/",
              "text": "I have failed a quiz and still been able to get an A in the class. Dropping the class seems premature. It will cost you more money and take more time. I know receiving a C can feel terrible, but just use that as motivation to do better in the future! Attend office hours, go to the tutoring center, and put the time in. \nI was also a CC student and I failed a class, withdrew from 2, got 1 D (at least), and quite a few C’s. I still got into every school I applied to and I’ve done very well since transferring. \nPut in the work and you will see results!",
              "author": "modestmouselover",
              "created": 1637389441,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hlcjihw": {
      "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlcjihw/",
      "text": "yeah it’s too much plus definitely has financial aid implications",
      "author": "benballernojohnnyda",
      "created": 1637381315,
      "upvotes": 1,
      "replies": {}
    },
    "hlctqp6": {
      "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlctqp6/",
      "text": "Check and make sure you won’t use up all of your drops. In Texas you get 6 drops for your entire career. And also see if your school has something called medical withdrawal / medical drop. That’s what I ended up using and all you need is a doctors note and an explanation as to why you need to drop these and it won’t count as a drop against you. It’ll show as a drop but it won’t count towards your total number",
      "author": "dedreanna",
      "created": 1637387474,
      "upvotes": 1,
      "replies": {}
    },
    "hld9bbs": {
      "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hld9bbs/",
      "text": "I just did the same thing!  I had to drop 2 courses when we switched to virtual because my home life makes large workloads hard.\n\nNow this semester, back on campus, I signed up for Multivariable Calc for no other reason than I thought I wanted to.  I just withdrew from the course this week.\n\nI'm just struggling with life lately, got a lot of psychological baggage from childhood that I never got a chance to work through.  It's been getting more and more difficult to keep up the level of dedicated hard work that got me into this school as a first-gen student.",
      "author": "-n_h101-",
      "created": 1637399875,
      "upvotes": 1,
      "replies": {}
    },
    "hlffsqj": {
      "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlffsqj/",
      "text": "I really think that is too many classes being dropped. Keep in mind, that this will be on your transcript when you're going through the transferring process at your new school. Also, for fafsa if you have too many Ws on your transcript they can give you less money for financial aid and it will hurt you in the long-term. What I would do if I were you is try to stick it out and hopefully pass. You can always retake the class for a better grade the second time around and it will replace the previous grade from your transcript so it does not hurt you as much.",
      "author": "ricebunny1999",
      "created": 1637441622,
      "upvotes": 1,
      "replies": {
        "hlfzfq9": {
          "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlfzfq9/",
          "text": "Btw, I’m not dropping 3 classes in 1 semester. I’ve already dropped 2 last year when covid started getting serious. Ever since then I haven’t dropped a class. This would be my 3rd one in total, but it’s the only one I’ve dropped in the past year.",
          "author": "Fuckatnames47",
          "created": 1637450562,
          "upvotes": 1,
          "replies": {
            "hlg71x7": {
              "link": "/r/college/comments/qxu1tw/is_dropping_a_total_of_three_classes_too_much/hlg71x7/",
              "text": "Was their any forgiveness when you dropped the classes during the covid? I know some colleges offered pass/fail as an option so it does not hurt your gpa. Also, did you drop the class before the penalty? Personally, I would not want to have too many Ws on my transcript since it does not help with you getting into a 4-year uni and it could really mess up your financial aid.",
              "author": "ricebunny1999",
              "created": 1637454088,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}