{
  "sid": "qa13aq",
  "link": "/r/college/comments/qa13aq/struggling_in_my_secondtolast_semester_any_study/",
  "title:": "Struggling in my second-to-last semester. Any study tips?",
  "text": "Hi guys. I’ve never posted in here before so let me know if I did something incorrectly please. \n\nI previously had to drop out in my second semester at community college due to losing my job, and a few years later, I returned to school full time. I’m now in my fourth semester (final semester in the spring) and I am struggling. My first semester back to school, I did really well, all As and Bs, which is great since my GPA tanked to a 2.0 when I dropped out. I’ve been trying to push myself to reach a 3.5 by graduation, and I’m only taking 16 credit hours this semester so I thought this would be attainable. I’ve even been inducted into my school’s honor society chapter, and I’m really excited about learning the material and honestly enjoy being in school again. The problem is that I feel so burnt out that I dread doing the work, and a lot of times, I just don’t have the time. It feels like all I do is study and go to work. \n\nI work 30-35 hours a week on average at my PT job, and I don’t make enough money to support myself right now, and honestly, I need to work less to be able to spend more time on my coursework, but that just isn’t in the cards for me at the moment. On top of financial problems and a lack of time, I have a chronic pain disability that also requires me to have more sleep than the average college student, like I actually need 8 hours of sleep to function - so pulling all-nighters makes me physically ill and more in pain than usual, and I just can’t seem to find enough time in the day to do the same amount of work I used to do while working 40+ hours per week. \n\nDo you guys have any tips that can help me stay on track and motivated? I have all my assignment due dates in a spreadsheet so I don’t forget about deadlines, but other than that and spending a lot of time at the library, I don’t really have many other study skills under my belt. I appreciate any suggestions you guys might have, and thank you in advance!",
  "author": "sugarcult01",
  "created": 1634484967,
  "updated": 1634654804,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {}
}