{
  "sid": "riljbc",
  "link": "/r/college/comments/riljbc/credit_hours/",
  "title:": "Credit Hours",
  "text": "This coming up Spring semester, I am taking 21 credit hours. Is this too much? How much is overdoing it? Has anyone had 21 hours and been successful in keeping up their GPA? Tips please!",
  "author": "Equal_Optimal",
  "created": 1639759718,
  "updated": 1639787348,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hoxs0lh": {
      "link": "/r/college/comments/riljbc/credit_hours/hoxs0lh/",
      "text": "I just finished 19 and got all As except for one. I’m doing 22 in the spring. If this your first semester, it’s too many. If you have a handle on being a full time student and want to be taking this many credits, you’ll be fine as long as you have good time management and school is your priority. Your social life will probably suffer, but it might be worth it. If you’re able to, take different sessions so that all your classes aren’t ending at the same time. That many finals and projects all at once would be killer. Try to get ahead by pretending every due date is a day or two before the actual due date.",
      "author": "wafflepancake5",
      "created": 1639759967,
      "upvotes": 3,
      "replies": {
        "hoxsiu2": {
          "link": "/r/college/comments/riljbc/credit_hours/hoxsiu2/",
          "text": "Thanks a lot. It’s my 2nd semester. I just got done taking 18.",
          "author": "Equal_Optimal",
          "created": 1639760161,
          "upvotes": 1,
          "replies": {
            "hoxsrf7": {
              "link": "/r/college/comments/riljbc/credit_hours/hoxsrf7/",
              "text": "If you did well with 18, you’ll be just fine with one more class. Take some time to analyze your previous semester and learn from it",
              "author": "wafflepancake5",
              "created": 1639760254,
              "upvotes": 3,
              "replies": {}
            },
            "hoyuodi": {
              "link": "/r/college/comments/riljbc/credit_hours/hoyuodi/",
              "text": "Just remember, taking 18 credits consisting of several GE classes your freshman year is not equivalent to taking 18 credits of upper-division courses in your junior year. If you’re still mostly taking GEs though, you should be fine. \n\nI’ve had 12-credit hour semesters than were harder than 18-credit hour semesters. It totally depends on the classes. So keep that in mind.",
              "author": "DcCash8",
              "created": 1639775050,
              "upvotes": 3,
              "replies": {
                "hoz6bj1": {
                  "link": "/r/college/comments/riljbc/credit_hours/hoz6bj1/",
                  "text": "Facts! I have been taking 20+ per semester since freshman spring, but this past semester (Junior Fall) made me realize that I really can't do that moving forward. Once classes get properly in-depth, you will want to be VERY careful OP.",
                  "author": "ChoopeyChoop",
                  "created": 1639779813,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hoxwty6": {
      "link": "/r/college/comments/riljbc/credit_hours/hoxwty6/",
      "text": "I took 21 a few semesters. I’m a total nerd with my social life primarily revolving around study groups, so it was fun for me. Don’t do it if you have a bunch of other time commitments (e.g., a job, sports, childcare). I think one or two of the classes were fluff also, like chorus or gym, or an English teacher known to be easy.",
      "author": "AceyAceyAcey",
      "created": 1639761790,
      "upvotes": 2,
      "replies": {}
    },
    "hoywxvo": {
      "link": "/r/college/comments/riljbc/credit_hours/hoywxvo/",
      "text": "I'm going 31 this semester.",
      "author": "NoSun69",
      "created": 1639775971,
      "upvotes": 1,
      "replies": {}
    }
  }
}