{
  "sid": "qpowd9",
  "link": "/r/college/comments/qpowd9/i_need_help_in_writing_my_apologyexcuse_for/",
  "title:": "I need help in writing my apology/excuse for tomorrow",
  "text": "Basically I'm chronically Ill and last week I had a family event that kinda triggered a lot of stress and boom, several conditions went off at once. I asked for an extension on my test, and I got one, for tomorrow.\n\nBUUUT I'm still sick as hell ( lost like 12 pounds in the past week, probably dehydration along with not eating)\n\nI would tell them about my chronic issues, but I have had experiences where they literally hated me for that.\n\nFor context, I am a part time student ( due to health).",
  "author": "sundowner17442",
  "created": 1636410270,
  "updated": 1636655331,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjvg81g": {
      "link": "/r/college/comments/qpowd9/i_need_help_in_writing_my_apologyexcuse_for/hjvg81g/",
      "text": "Just explain it to them. In high school pre calc,\nI had COVID (with asthma), was off my arthritis medication, had severe constipation and a lodged kidney stone. I got that same extension and just couldn’t work on anything bc I was so sick. I had already had my exam rescheduled by the school but I was doing an EC assignment for a harsh teacher. I wrote a sob email and even attached my hospital discharge papers 😹 it feels stupid, but all you can do is try. She felt so bad, she extended it. I finished it and then the school waived my exam 🧍🏽‍♀️ obviously your exam probably won’t be waived, but literally just try. You’ll never know how sympathetic a teacher is feeling. Also, note that if you’ve asked for accommodations/stated you’re disabled, that will help a lot.",
      "author": "JeanVII",
      "created": 1636417383,
      "upvotes": 2,
      "replies": {}
    },
    "hjw2eo8": {
      "link": "/r/college/comments/qpowd9/i_need_help_in_writing_my_apologyexcuse_for/hjw2eo8/",
      "text": "You should see if the office of accommodations at tour school will help. Your professor hopefully will be sympathetic if you explain what's going on. If not if you have an accommodation then they have to help you out. In my experience they are super helpful",
      "author": "aquamarine_321",
      "created": 1636427447,
      "upvotes": 1,
      "replies": {}
    }
  }
}