{
  "sid": "q5oweb",
  "link": "/r/college/comments/q5oweb/unreasonable_workload_in_an_undergrad_research/",
  "title:": "Unreasonable workload in an undergrad research project",
  "text": "Last week, my research advisor told me to create a simple simulation for our project over the weekend. The project is to span the entire academic year and we have four other researchers on our team, each with a different speciality. The goal of the whole project itself is to create a computer simulation of a complex phenomenon and to analyze it. \n\nIt feels like I’ve been asked to do something so massive that was supposed to take months of collaborating on my own, despite it being a “simpler” version. Moreover, my strong suit is math and stats, not programming. In fact, we have another researcher who’s speciality is programming and we were all a but confused as to why he wasn’t asked to do this! I barely know any python (our preferred language), definitely not enough to design an entire simulation, and I made that clear when I was brought on. And I even brought this problem up this week at our research meeting, that I wasnt able to create a simulation because I have absolutely no idea where to even start. I was given some pointers but those weren’t helpful at all. And now I have to go in this coming week and tell my team, once again, that I was unable to create a simulation because im so lost. Our research advisor was supposed to send me material that would help last week but he forgot, and he forgot to do it again this week. So I can’t help but feel like I’ve been given an unfair amount of work to do on my own. \n\nThe expected workload for this project is supposed to be 5 hrs per week, but I’ve already spent so many more hours learning numerical methods on python, and am expected to spend a whole lot more to create this simulation!? That doesn’t sound right at all and I’ve already embarrassed myself enough when I couldn’t produce anything. At this point, I’m probably just gonna call in sick to avoid the embarrassment again. \n\nAm I in the wrong here? Is research actually this much work, even if it was literally in our contract that it’d only be 5-7 hrs per week? Because my previous research experiences definitely weren’t like this. Its making me want to walk away from this- which I know is a terrible thing to do mid-project. So what should I do?",
  "author": "mowa0199",
  "created": 1633929613,
  "updated": 1634082997,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "hg7l6du": {
      "link": "/r/college/comments/q5oweb/unreasonable_workload_in_an_undergrad_research/hg7l6du/",
      "text": "You are kind of in the wrong here, but it’s understandable because you’re entering with a “student” mindset instead of that of a researcher. \n\nAs a student, you expect everything to be handed to you on a platter. You should never be asked to do any task that has not been explicitly taught. \n\nThis is not at all how research works, so you’re going to need to make a large change in your mindset.\n\nYou have been given a task to do. It doesn’t need to be perfect and it honestly doesn’t even need to be complete or accurate or functional, but you do need to put some actual effort in. \n\nYou say you do not know Python. **Learn it**. Watch YouTube videos, take free courses online, ask others for help. Research means teaching yourself things because there is often not a single person in the world who can teach it to you. The fact that you don’t know a core programming language that you need to use in this project will probably push you well over 5 hours per week. \n\nYou say you are not the programming expert, and someone else is. Then why haven’t you asked this person for help? You are supposed to be *gaining* skills. You are supposed to become more skilled in programming, not simply rest on the skills you already have. You are there to learn, not to perform. \n\nWhen you’re given a task too complex you need to break it down to specific tasks you cannot do, always making sure you have done your homework before bothering others. **Never** go to someone and say “I don’t know where to start”. That only shows that you haven’t put any thought in.\n\nIn terms of the work hours, it’s variable. If you’re only being paid for 5 hours a week and that’s all you can truly do then I think you should make it clear that the task is too large and difficult for you. You should recommend collaborating with the programming expert or negotiate with your PI to hand parts of the task off to other people. You **should not** just call in sick or try to avoid this. You’ve already procrastinated for too long and you need to start taking action. This is *your* project, take ownership and take initiative. Stop waiting around to be told what to do. Stop giving up the moment there’s the slightest obstacle in your way.\n\n- You say you were given useless advice/pointers. Did you tell them you didn’t understand at the time? Or did you just say “thank you” and walk away?\n\n- You say your PI forgot to send through some  materials. Have you been following up at regular intervals, through email and in-person? Or have you sat silently and twiddled your thumbs after they forgot?\n\nAs this is your task and your job, you have to keep on other people and make sure they know what you need at all times. Saying “I need help” on Monday and then being silent for a whole week will make people assume you’ve figured it out. They are not keeping track of you. You have to tell them, constantly, if you need help.\n\nEdit:formatting",
      "author": "officially_anxious",
      "created": 1633944824,
      "upvotes": 9,
      "replies": {
        "hg86qh9": {
          "link": "/r/college/comments/q5oweb/unreasonable_workload_in_an_undergrad_research/hg86qh9/",
          "text": "This is a fantastic response.",
          "author": "PhDapper",
          "created": 1633959591,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg88a42": {
      "link": "/r/college/comments/q5oweb/unreasonable_workload_in_an_undergrad_research/hg88a42/",
      "text": "I am going to disagree - if your research project is supposes to be 5 hours a week, AND knowledge of coding in this language was not a prerequisite , it is not a reasonable goal.\n\nWhile the other responses are correct, it is also true that the goals of an UG research project should also be reasonable .\n\nCalling in sick is really not a good option.\n\nYou need to explicitly discuss this with your supervisor and your group.\n\nEither your expectations were off, or theirs are, or both.",
      "author": "PersephoneIsNotHome",
      "created": 1633960335,
      "upvotes": 1,
      "replies": {}
    }
  }
}