{
  "sid": "r65ce4",
  "link": "/r/college/comments/r65ce4/graduating_in_may/",
  "title:": "Graduating in May",
  "text": "Hello, everyone. I’m a senior in college right now applying to full time jobs in finance and whatnot. But I’ve got a small conundrum. I really really really do not want any of the jobs I am “qualified” for and many of them expect at least a few years of commitment. I’d imagine that’s a relatively new aspect of entry level finance jobs since so many people ditch corporate America after only a few years. I just feel like I picked a major that doesn’t mean anything to me. I couldn’t care less about finance and I honestly see these last 4 years as the biggest mistake I could have made. On a good note tho, I have a 3.94 going into this semester and this semester will a bit lower but I think I could still manage to possibly graduate Summa Cum Laude. That’s really all I care about whether or not it truly matters to anyone else. Just upset about the amount of time, money, and emotion I’ve invested into this and it feels like I’m not gonna get anything out of it. Guess that’s kind of what happens when you pick your major at 18. I’m embarrassed that I even took it this far and I abhor the kind of careers all of my mentors have now. If I could do it again, I think I would study biology with a minor in history and I wouldn’t focus on grades as much as just plain out learning and having a good time in college. Scared of living my life just waiting for 5 o clock every day and feeling like I’m what’s wrong with the world lol. I guess we’ll see what happens but I’m just upset that I don’t stand by any of the decisions I’ve made in the last 4 years and now I’m at the point where I’m mentally drained from pretending to care about business and finance. Let me know your thoughts and btw I don’t mean to bum anyone out I’m just an idiot. Peace ✌️",
  "author": "Kingofsnacks2",
  "created": 1638329648,
  "updated": 1638480436,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmrdsyr": {
      "link": "/r/college/comments/r65ce4/graduating_in_may/hmrdsyr/",
      "text": "I know this isn’t the best solution ever, but you could try getting a masters on one of these areas you are actually interested about and maybe change your career path. It’s either that, do another 4 years of undergrad or just accept business jobs at least for now. \n\nAlso, have you done any Internships during your undergrad? If not, I would recommend trying getting a job in your field to at least see how you feel about the whole job environment and stuff. That could also benefit you when applying for masters programs, I believe. Good luck!",
      "author": "MMSK_",
      "created": 1638334935,
      "upvotes": 1,
      "replies": {}
    }
  }
}