{
  "sid": "q7ec42",
  "link": "/r/college/comments/q7ec42/is_a_50_minute_commute_reasonable/",
  "title:": "Is a 50 minute commute reasonable?",
  "text": "I am currently a college freshman living in my school's dorms. Unfortunately, the living conditions here kinda suck. The buildings aren't clean, neighbors are inconsiderate noisy drunks, and it's expensive. I live in New York, and my current university is in Jersey, only a 45 minute drive away if the traffic is fine. I decide to live on campus freshman year because I knew I might have a hard time handling the workload especially after doing remote learning for my entire senior year of HS. I've heard mixed opinions from other students who commute, some say that it is time consuming and others say that it is tolerable. I'm most likely going to end up moving back home anyway, but do you guys think a 50ish minute commute is reasonable? I regret dorming in the first place and if it weren't for the scholarship I got, I would not have even gone to a private college because it is just not my crowd.",
  "author": "Ocean-Bird",
  "created": 1634140982,
  "updated": 1634167587,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgicqvk": {
      "link": "/r/college/comments/q7ec42/is_a_50_minute_commute_reasonable/hgicqvk/",
      "text": "No",
      "author": "TragicalKingdom",
      "created": 1634147223,
      "upvotes": 2,
      "replies": {}
    },
    "hgj77cx": {
      "link": "/r/college/comments/q7ec42/is_a_50_minute_commute_reasonable/hgj77cx/",
      "text": "Traffic between NY and NJ is not \"fine\" much of the time.  Those particular crossings also have common but unprectably nightmare delays, so on days with exams you better leave at least 2x that.\n\nI used to do a commute like that and it took me 30 mi if I left at 6:30 am and on the way back it never took less than 1 hr 30 unless I waited till like 9 pm to come back\n\nThis is also a very expensive commute",
      "author": "PersephoneIsNotHome",
      "created": 1634159587,
      "upvotes": 2,
      "replies": {}
    },
    "hghxjaq": {
      "link": "/r/college/comments/q7ec42/is_a_50_minute_commute_reasonable/hghxjaq/",
      "text": "That’s ~ 2 hours a day, and however much has costs.\n\nI wouldn’t do it. Living in dorm’s sucks, but you can do a lot to get away from it like hanging out on campus in the library, common areas, etc.",
      "author": "Casual-Economist",
      "created": 1634141200,
      "upvotes": 1,
      "replies": {}
    },
    "hgik0sb": {
      "link": "/r/college/comments/q7ec42/is_a_50_minute_commute_reasonable/hgik0sb/",
      "text": "I commute almost 50 mins a day to college, but this is via bus / train so I get to get some sleep / work done on the way there. I had a longer commute to high school so I’m used to it. It’s manageable but if you can live in the dorms at least try it…",
      "author": "itzDG",
      "created": 1634150141,
      "upvotes": 1,
      "replies": {}
    },
    "hgikvqj": {
      "link": "/r/college/comments/q7ec42/is_a_50_minute_commute_reasonable/hgikvqj/",
      "text": "I would try to get an off campus apartment closer to school",
      "author": "resting_bees",
      "created": 1634150491,
      "upvotes": 1,
      "replies": {
        "hgj7cfv": {
          "link": "/r/college/comments/q7ec42/is_a_50_minute_commute_reasonable/hgj7cfv/",
          "text": "this",
          "author": "PersephoneIsNotHome",
          "created": 1634159647,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}