{
  "sid": "qmtklp",
  "link": "/r/college/comments/qmtklp/how_do_you_get_used_to_your_grades_being_lower/",
  "title:": "How do you get used to your grades being lower than in high school?",
  "text": "When I was in high school I was around an 80's student, a little higher. I've been in university for about 3 months and the current grades I've received on assignments have not been great. They're in the 60's - 70's range. My finals are next month. I for one, am glad that I am not failing, however, I also am disappointed in myself that I didn't get a better grade because for the things I got these low grades on, I really did try my hardest. I think I've been told that grades drop from high school to university, and I'm willing to accept that, but it's still hard. Is there any way to just...get used to your grades being worse than in high school?",
  "author": "npojg",
  "created": 1636057118,
  "updated": 1636137351,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjbyenz": {
      "link": "/r/college/comments/qmtklp/how_do_you_get_used_to_your_grades_being_lower/hjbyenz/",
      "text": "Same boat for my 5 years and uni. And honestly dude just hope for the best and try your best. \n\nOccasionally you will have those times when you do well tho.",
      "author": "vapegod_420",
      "created": 1636059497,
      "upvotes": 1,
      "replies": {}
    },
    "hjc4vnz": {
      "link": "/r/college/comments/qmtklp/how_do_you_get_used_to_your_grades_being_lower/hjc4vnz/",
      "text": "My grades stayed the same from High School to University, I just had to put 3x the effort that I was used to so I could maintain it. I rarely ever studied back in High School but was a regular at my campus library.",
      "author": "Sermos5",
      "created": 1636062098,
      "upvotes": 1,
      "replies": {}
    },
    "hjcchun": {
      "link": "/r/college/comments/qmtklp/how_do_you_get_used_to_your_grades_being_lower/hjcchun/",
      "text": "the goal of college isn't to have perfect grades-- the goal is to graduate. as long as you're passing your classes, then you're doing what's necessary. \n\njust focus on not failing your courses and then after finals, enjoy your winter break.",
      "author": "bubblewubb1es",
      "created": 1636065227,
      "upvotes": 1,
      "replies": {}
    }
  }
}