{
  "sid": "rf7qr1",
  "link": "/r/college/comments/rf7qr1/just_found_out_i_failed_35_classes/",
  "title:": "Just found out I failed 3/5 classes",
  "text": "Over this past semester I've done really bad in my first fall semester( I did summer school) I started the semester with 4 classes and 1 tutoring class. I then had to drop 2 classes one including the tutoring one out of fear I'd get \"F's\" on my transcript. I then only had 3 classes left one of them having a total of 9 assignments the while semester 4 100 point exams, 4 4 points homework assignments and a final exam. Well I studied really hard I was ready for the exams and ended doing bad on 2 out of the 4 resulting in a 63% now I have my final tommarrow and need to ace the test to even pass with a 70% which isn't possible for me. So I have 2 classes left one is a for sure A grade the other I pass the final and I pass the class. So my first semester went pretty shitty, I am going to be on probation on my funding and have to retake the failed courses. That's it.",
  "author": "Glader61",
  "created": 1639371773,
  "updated": 1639516150,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hocwrn4": {
      "link": "/r/college/comments/rf7qr1/just_found_out_i_failed_35_classes/hocwrn4/",
      "text": "As someone who struggled a lot during his freshman year and was put on financial aid suspension, I would suggest 2 things. First, really reevaluate if your major is still what you want to do because if you are doing a major that you absolutely hate, then you’re putting yourself through pain that you don’t need to go through. I would suggest finding a major that you feel is more suitable for you. The second option is if you still want to to do your major, and that’s getting in touch with your schools tutoring services. Starting  college can be rough when you have not learned any good study skills. Tutors can really help you learn and understand the material, as well as teach better study strategies. Also get in touch with your school’s counseling services if you’re having mental health issues. Lastly, failing classes isn’t the end of the world. College is hard and not for everyone. I had to learn that the hard way. It’s totally okay if you ever feel like taking a break from college and coming back years later. Good luck!",
      "author": "shunsui2828",
      "created": 1639384739,
      "upvotes": 4,
      "replies": {}
    }
  }
}