{
  "sid": "rbopss",
  "link": "/r/college/comments/rbopss/feeling_bad_about_changing_my_topic_for_a_paper/",
  "title:": "Feeling bad about changing my topic for a paper",
  "text": "Has this ever happened to you? I feel really bad because I have to submit a paper by the 26th and I has chosen two possible topics. My teacher liked both but one more than the other. It's a very difficult topic for me, I don't know anything about that area of studies and it's honestly consuming me. I have to read a book that I am not enjoing whatsoever because of this paper, and I feel like the idea of the topic it's really interesting but too much for me.\n\nIs it bad if I just change it? I feel too overwhelmed, and I wouldn't mind doing the other version, that I find much much easier for me. But I feel so guilty and like I will disappoint my teacher in some way. I feel stupid for not being smart enough to complete this paper.",
  "author": "throwmeoutplease1111",
  "created": 1638960613,
  "updated": 1639517258,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hnpdxcv": {
      "link": "/r/college/comments/rbopss/feeling_bad_about_changing_my_topic_for_a_paper/hnpdxcv/",
      "text": "[removed]",
      "author": null,
      "created": 1638961712,
      "upvotes": 1,
      "replies": {}
    },
    "hnpvx43": {
      "link": "/r/college/comments/rbopss/feeling_bad_about_changing_my_topic_for_a_paper/hnpvx43/",
      "text": "No. In fact if you do proper research you'll find most of your paper topics will change as you find people have done your paper already.",
      "author": "lanabey",
      "created": 1638972728,
      "upvotes": 1,
      "replies": {}
    },
    "hnpyufa": {
      "link": "/r/college/comments/rbopss/feeling_bad_about_changing_my_topic_for_a_paper/hnpyufa/",
      "text": "You're probably ok -- you still have 2 weeks which is going to be fine for many papers unless this is a really large paper or a thesis. \n\nYour professor is unlikely to be offended because you changed the topic. Professors aren't super invested in student topics as long as they meet the assignment objectives, and are reasonable in scope (so you can reasonably make an argument about it in the assignment length). If the other one was previously approved you should be ok using it.",
      "author": "Melodic_Echidna",
      "created": 1638974102,
      "upvotes": 1,
      "replies": {}
    },
    "hnq31la": {
      "link": "/r/college/comments/rbopss/feeling_bad_about_changing_my_topic_for_a_paper/hnq31la/",
      "text": "Your teacher wants you to dig into something you are interested in and enjoy the learning process. And almost certainly expects you to tighten or shift your focus. Maybe just email or stop in and share what you are thinking. They’ll either agree with your desire to switch topics or help you figure out a compelling slant and resources for this one. They won’t be disappointed if you change directions if you do a good job unless maybe you were exploring something related to their own work。In which case a chat will be really helpful for you both",
      "author": "RetiringTigerMom",
      "created": 1638975954,
      "upvotes": 1,
      "replies": {}
    }
  }
}