{
  "sid": "r5stbh",
  "link": "/r/college/comments/r5stbh/i_hate_my_college_and_my_motivation_has_never/",
  "title:": "I hate my college and my motivation has never been lower. Help.",
  "text": "Hi everybody. I’m a freshman and I really hate the school I’m at. I just don’t belong here at all. Anyway, I’ve been doing really well this semester academically, staying on top of the work, not procrastinating, getting stuff done as soon as it’s assigned. Now all of a sudden I can’t bring myself to get any of this work done with so many final papers coming. I’m afraid I burnt myself out too quickly earlier in the semester. I feel fucking broken and helpless. Thank you in advance for advice/help.",
  "author": null,
  "created": 1638294245,
  "updated": 1638480378,
  "over_18": false,
  "upvotes": 59,
  "upvote_ratio": 0.96,
  "comments": {
    "hmp9xsk": {
      "link": "/r/college/comments/r5stbh/i_hate_my_college_and_my_motivation_has_never/hmp9xsk/",
      "text": "I went through this last year. I'm now in my second year but I'm still considered a freshman because I failed half my classes and ended up getting academically dismissed (I was able to appeal it). My best advice is use the resources given to you. Talk to professors, talk to whatever center on campus is designed to help students succeed, talk to friends. Whatever helps you get things done, even if it's just for a little while, do it. For example, I put on a TV show I've seen dozens of times and have it as background noise. I've also found that my house is a terrible environment for getting things done. I commute but I somehow convinced myself to stay a little bit later in the library or whatever common space is in the building I just had class in. Make super simplified lists for what needs to get done. Have one check box for research, one check box for finding sources, one check box for planning out your paper, etc. You'll feel better about yourself because it will feel like you're getting more done. I know it can be difficult to get out of a funk but don't be like me. Don't ignore half your classes and have to tell your parents you failed out of college",
      "author": "raceyboi1899",
      "created": 1638301606,
      "upvotes": 16,
      "replies": {}
    },
    "hmq9707": {
      "link": "/r/college/comments/r5stbh/i_hate_my_college_and_my_motivation_has_never/hmq9707/",
      "text": "There's lots of colleges. You're probably not as tied to your current one as you think. Transfer.",
      "author": "RollWave_",
      "created": 1638316135,
      "upvotes": 6,
      "replies": {
        "hmqagc2": {
          "link": "/r/college/comments/r5stbh/i_hate_my_college_and_my_motivation_has_never/hmqagc2/",
          "text": "Yeah that’s what I’m inevitably going to do do.",
          "author": null,
          "created": 1638316694,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmp40ne": {
      "link": "/r/college/comments/r5stbh/i_hate_my_college_and_my_motivation_has_never/hmp40ne/",
      "text": "Hold your nose and just do it.",
      "author": "GenXtreme1976",
      "created": 1638299243,
      "upvotes": 0,
      "replies": {}
    },
    "hmqc4tk": {
      "link": "/r/college/comments/r5stbh/i_hate_my_college_and_my_motivation_has_never/hmqc4tk/",
      "text": "I’d recommend going to the office hours of all of your professors and telling them your concerns. sometimes it’s easy to get overwhelmed and in your own head about things, sometimes just hearing that the tasks isn’t as impossible as you think helps a ton. They aren’t for everyone, but lists have helped me a ton as someone who gets burnt out easily. i make a list every morning of what i need to do for the day and for the week, helps me feel a bit more on track. i’m sorry you’re having a rough go, i hope things look up soon :)",
      "author": "bienvenidos-a-chilis",
      "created": 1638317446,
      "upvotes": 1,
      "replies": {}
    },
    "hmqqcc6": {
      "link": "/r/college/comments/r5stbh/i_hate_my_college_and_my_motivation_has_never/hmqqcc6/",
      "text": "I’m a junior in the exact same position as you. I just don’t want to do any of it anymore and I hate my school too. Hang in there semesters almost over just give it all you got",
      "author": "Maleficent_Stress_68",
      "created": 1638323844,
      "upvotes": 1,
      "replies": {}
    },
    "hmr44pi": {
      "link": "/r/college/comments/r5stbh/i_hate_my_college_and_my_motivation_has_never/hmr44pi/",
      "text": "If you hate it, grind out the end of this semester and transfer to a school you like more. You’ll likely be able to get into more schools after a semester/year of college already done especially with good grades.",
      "author": "FalseMoon",
      "created": 1638330096,
      "upvotes": 1,
      "replies": {}
    }
  }
}