{
  "sid": "qe01i0",
  "link": "/r/college/comments/qe01i0/i_dont_think_that_working_hard_should_be_studying/",
  "title:": "I don’t think that working hard should be studying for hours to ace an exam",
  "text": "I feel like that is the only purpose of a student. The only meaning of working hard is getting an A on an exam. \n\nWhy can’t working hard be something else like creating things or doing something that is actually useful? College doesn’t prepare you for anything because you’re just trying to get grades. I think that there should be focus on other things rather than just academics.",
  "author": "nathani3l0g",
  "created": 1634973407,
  "updated": 1635184643,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.67,
  "comments": {
    "hhpxgsf": {
      "link": "/r/college/comments/qe01i0/i_dont_think_that_working_hard_should_be_studying/hhpxgsf/",
      "text": "I’m G 12 high school now. But I’ve experienced this when I still lived in China. Middle school started to slip toward hell for me cuz I don’t understand *to this day* what we’re supposed to get out of working our heads off for 3 years(junior high), taking a national exam(that is, the exam format is there, the questions are different for each province), then doing 3 years again and another national(senior high). It became insufferable halfway through my 2nd year in junior(grade 8).\n\nI immigrated and found my passion in psychology. Now university/master/even PhD is what I need. I’m a bit scared but what must come must come.\n\nFind your passion/purpose. If it’s really not in school then make the decision whether to quit, start a business, do apprenticeship etc. Or simply take a gap year. Travel(if you have money that is). whatever that makes you go “I know what I must do”.",
      "author": "Ok_Sock_2719",
      "created": 1634974980,
      "upvotes": 2,
      "replies": {}
    },
    "hhqpet7": {
      "link": "/r/college/comments/qe01i0/i_dont_think_that_working_hard_should_be_studying/hhqpet7/",
      "text": "The thing to remember is that, while grades matter to some extent, they really *don't* past a certain point, usually. To the extent that they *do* matter, if you master the content and look at feedback you get, the grades should follow. What will matter is other skills and experiences you pursue. \n\n\nAs far as creative stuff, that should come later with things like your own research experience, internships, lab work, etc. But if you don't understand the concepts well, you can't think of creative new ways to use them, so for a while you are stuck with the boring basic stuff. The more school you go through, the more you have the academic freedom to do your own thing, because you have demonstrated your ability to master concepts.",
      "author": "torgoboi",
      "created": 1634996403,
      "upvotes": 1,
      "replies": {}
    },
    "hhshl0i": {
      "link": "/r/college/comments/qe01i0/i_dont_think_that_working_hard_should_be_studying/hhshl0i/",
      "text": "What you get out of college depends on you. If the only thing you ever do is focus on the studying side then sure you probably won’t get a ton out of it. But that’s why there’s clubs, intramurals, job fairs, service projects, undergraduate research, internships etc that is up to you to attend. Those tend to be the places that you get your contacts and in my opinion really find yourself and where you get the most out of college.",
      "author": "LHRXPONCHITO69",
      "created": 1635027510,
      "upvotes": 1,
      "replies": {}
    }
  }
}