{
  "sid": "pqjddt",
  "link": "/r/college/comments/pqjddt/regrets/",
  "title:": "Regrets",
  "text": "I have 6 weeks left for uni to end and will be leaving the town in 8 weeks. After almost 4.5 years of uni, I regret making very little goodvfriends here. Most people are just acquaintances not friends. I did not join clubs/societies/events. I have some good friends outside uni, but the fact i was quite inactive and antisocial in uni is really eating me up (though did well academically). What hurts me more is that i spent a good amount of time alone, stoning, reading, watching, learning etc rather than socializing more (i am quite introverted). I know I cant get the time back and I did enjoy my experience here, but the things I did not do are really eating me up, as I feel i failed to leave a \"legacy\" or a \"mark\" on the uni experience itself..\n\nDid I \"waste\" my college experience by not getting more involved?",
  "author": "9041MMM",
  "created": 1631957645,
  "over_18": false,
  "upvotes": 30,
  "upvote_ratio": 0.92,
  "comments": {
    "hdeviru": {
      "link": "/r/college/comments/pqjddt/regrets/hdeviru/",
      "text": "Yep 3 years of nonsense for me. I did 2 years of community college which is boring as fuck then last year was all online. \n\nSo this year is the only year I even have of real college, and it’s been ok.",
      "author": "Nofapdeity",
      "created": 1632018211,
      "upvotes": 1,
      "replies": {}
    },
    "hdcobat": {
      "link": "/r/college/comments/pqjddt/regrets/hdcobat/",
      "text": "Nope. College is for learning and we can’t predict what that will be! Let it go. Things won’t change now, as people will be preparing to depart. In the future, live your life more fully. That is all.",
      "author": "Awkward_Result6214",
      "created": 1631984705,
      "upvotes": 3,
      "replies": {}
    },
    "hdbgs52": {
      "link": "/r/college/comments/pqjddt/regrets/hdbgs52/",
      "text": "Don't think about the past right now. You've still got 6 weeks to enjoy this chapter of your life before you're on to the next one. I suggest you step out a little more out of your comfort zone and not be thinking too much about making \"memories\", just being right here, right now, and ***enjoying the present***.",
      "author": "QuadricepSnapper",
      "created": 1631962807,
      "upvotes": 11,
      "replies": {}
    }
  },
  "updated": 1634051958
}