{
  "sid": "q75rpq",
  "link": "/r/college/comments/q75rpq/the_solution_to_your_loneliness/",
  "title:": "the solution to your loneliness",
  "text": "i have seen more posts about \"I'm lonely\" than anything else here ... here's the solution: join clubs, ask people to hangout,be proactive! if you're not gonna do something to fix the problem than learn to live with the problem.. learn to live with yourself .. believe me i HAVE been there ... i was very lonely and i started doing harmful things because of it, like drinking , getting high , binging & purging eventually i got to rock bottom .. i couldn't learn to live only with myself so i decided to do something to fix the problem .. i joined clubs , i ask people in my classes for their numbers and make a group chat , i invite people to hangout .. now my life is so full that i actually have to decline invites .. this is not a brag .. i don't need validation or praise, i just want to let you guys know that you just have to get out there!! nothing will change if you don't change ... do something about it .. and i know there will all the \"but I'm an introvert \" ... \" but i don't have time\" ... don't focus on why you can't reach your goals , focus on reaching your goals ... if you don't like my advice disregard it .. if you like it , maybe think of putting it into practice .. put it on your to-do list",
  "author": "aguafreska",
  "created": 1634109058,
  "updated": 1634167595,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hggp2h1": {
      "link": "/r/college/comments/q75rpq/the_solution_to_your_loneliness/hggp2h1/",
      "text": "I appreciate your post and my fear is that even if I do those things, join clubs, put myself out there, etc… people won’t like me and I’ll be in the same position. I fear I don’t fit in bc of who I am fundamentally.",
      "author": "Donut_Hunter",
      "created": 1634117022,
      "upvotes": 3,
      "replies": {}
    },
    "hgh2lnk": {
      "link": "/r/college/comments/q75rpq/the_solution_to_your_loneliness/hgh2lnk/",
      "text": "How do I get over the awkwardness when I ask someone to hangout like I be cringing…",
      "author": "Swimming_Newspaper89",
      "created": 1634127142,
      "upvotes": 2,
      "replies": {
        "hgh7fhf": {
          "link": "/r/college/comments/q75rpq/the_solution_to_your_loneliness/hgh7fhf/",
          "text": "I imagine it will be less awkward the more you do it, and it will feel more natural.",
          "author": "noagnst",
          "created": 1634129822,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}