{
  "sid": "r5j1i3",
  "link": "/r/college/comments/r5j1i3/diversity_in_southern_colleges/",
  "title:": "Diversity in southern colleges",
  "text": "I’m really interested in going to college in the south on the east coast. Does anyone have recommendations for well known colleges that are also ethnically diverse? I feel like the stats online don’t line up with what students at the school say about this aspect",
  "author": "uglionion",
  "created": 1638262334,
  "updated": 1638480516,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hmo4080": {
      "link": "/r/college/comments/r5j1i3/diversity_in_southern_colleges/hmo4080/",
      "text": "You'll want to look at more well known and competitive colleges. There's more than one reason college diversity isn't great. The biggest reason in the south is that there is not much diversity in general from the actual population. Even if college was free and they drew students from a hat, they wouldn't get more diversity than what their state had so long as all their students were from the state. So universities that recruit on a national or international level will probably have more diversity. Also universities that are historically diverse, but you may have to give to get (smaller, maybe more expensive, less alumni) with some of those.",
      "author": "darniforgotmypwd",
      "created": 1638284900,
      "upvotes": 1,
      "replies": {
        "hmo5347": {
          "link": "/r/college/comments/r5j1i3/diversity_in_southern_colleges/hmo5347/",
          "text": "You’re right. Thanks for the help !",
          "author": "uglionion",
          "created": 1638285369,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmo9e2u": {
      "link": "/r/college/comments/r5j1i3/diversity_in_southern_colleges/hmo9e2u/",
      "text": "I've just finished doing a bunch of research on colleges for a YouTube channel I've started. By South on the East Coast, I'm assuming you mean Florida, Georgia, and the Carolinas maybe?\n\nWith the numbers I have, you should check out Emory and Duke, both have 50%+ non-caucasian population, and 10%+ international. Duke is a more even M:F split than Emory (no data on LGBT population was readily available, sorry).\n\nNone of the public schools I have data on are particularly high on international students, but Georgia Tech, Florida, Florida State, and UNC all have >33% non-caucasian student body. Georgia Tech is heavily skewed male, the rest are just minority skewed Female.\n\nHope that helps!",
      "author": "Thelton26",
      "created": 1638287169,
      "upvotes": 1,
      "replies": {
        "hmotum9": {
          "link": "/r/college/comments/r5j1i3/diversity_in_southern_colleges/hmotum9/",
          "text": "This is very helpful. Thank you so much",
          "author": "uglionion",
          "created": 1638295216,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}