{
  "sid": "q5ay0l",
  "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/",
  "title:": "How to get motivation? Seriously?",
  "text": "I have no motivation to study. I can't get anything done and I forget to do almost every assignment. I'm studying what i love so it shouldn't be this hard to be motivated. I'm so stressed. Is this just normal in college? Should I contact a counselor or someone? Does anyone have any tips to be motivated?",
  "author": "imperfectly_lia",
  "created": 1633882020,
  "updated": 1634083020,
  "over_18": false,
  "upvotes": 18,
  "upvote_ratio": 0.89,
  "comments": {
    "hg4l5f2": {
      "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/hg4l5f2/",
      "text": "Seriously, working on something is like going to the gym. If you only do it when you’re motivated, you won’t get results. You need disciple to work on anything seriously. But you also need to know how you work. By example, I can’t work with agendas, but working with bullet journals help me get my shit done because I know what’s up the next week. Also, stress has a huge impact on studies. If you feel stressed all the time, chances are you won’t have the desire to continue your major. So try to find the source of it. Personally, I wanted to apply for a scholarship for my master, but it required a huge c.v. with involvements everywhere and high grades. It put so much pressure on me that every time I worked 1-2h on homework I went to sleep/took a nap because it drained all my energy. Since I decided to not take the scholarship too seriously, the pressure fell, my stress levels fell, and my discipline got up. I’m also doing more. \n\nBut really, what can help is a reminder « why do I do it? » and outside goals (something you wouldn’t like missing such as a party/trip in the forest/etc.) as a reward for your good work.",
      "author": "peachybooxoxo",
      "created": 1633887689,
      "upvotes": 8,
      "replies": {}
    },
    "hg56b0l": {
      "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/hg56b0l/",
      "text": "Omg this is so relatable. The only thing that’s pushing me forward is myself lol. I just study like 4 hrs everyday and reward myself something small for each hour.",
      "author": "whore_for_clothes",
      "created": 1633896335,
      "upvotes": 2,
      "replies": {}
    },
    "hg4edrz": {
      "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/hg4edrz/",
      "text": "For motivation, see some random study motivation videos.\n\nFor discipline? Whenever you feel like not studying, say \"fuck it\" and go study. Do that everyday. Make a routine.",
      "author": "potatolover5002",
      "created": 1633884868,
      "upvotes": 1,
      "replies": {}
    },
    "hg5cjre": {
      "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/hg5cjre/",
      "text": "Sometimes writing out your day and planning things can help.",
      "author": "ThoughtCenter87",
      "created": 1633898857,
      "upvotes": 1,
      "replies": {}
    },
    "hg6lkt7": {
      "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/hg6lkt7/",
      "text": "Money",
      "author": "lil-dlope",
      "created": 1633919876,
      "upvotes": 1,
      "replies": {}
    },
    "hg7pvcd": {
      "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/hg7pvcd/",
      "text": "Maybe try doing something you really enjoy. Perhaps a hobby....and for your assignments, you can try Victoria from https://assignmentsden.com/ she helped me",
      "author": "Michelle_Royal",
      "created": 1633948888,
      "upvotes": 1,
      "replies": {}
    },
    "hg4djs7": {
      "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/hg4djs7/",
      "text": "ur parents don't motivate you? Ur future doesn't motivate you?\n\nEdit: did I say sth wrong that made me get downvoted 😂😭???",
      "author": "WorldofMickeyMouses",
      "created": 1633884498,
      "upvotes": -8,
      "replies": {
        "hg4o9zk": {
          "link": "/r/college/comments/q5ay0l/how_to_get_motivation_seriously/hg4o9zk/",
          "text": "The bare minimum pushing me XD",
          "author": "TheRapidTrailblazer",
          "created": 1633888968,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}