{
  "sid": "pu72lt",
  "link": "/r/college/comments/pu72lt/professors_should_really_stop_saying_stop_like/",
  "title:": "Professors should really stop saying stop like back in my day stuff.",
  "text": "Recently there was a test in Biology 1010, and the average test grade is 33 of 100.  A professor, who I think is like 60 years old, complains to us how young people are unwilling to learn. Then he gave his speech on how higher education 100 years ago used to be so much better. \n\nI was not going to not complain, but literally, he mention how education is better 100 years ago. Wow, I have never heard stupid coming off professor month.\n\nLike 100 years ago, higher education solves algebra. Now we can literally 1 million iterations of computation in high school (some school does). Yet here professor says, \"how higher education is better than 100 years ago.\"\n\nPs: I am a senior in College about to be graduate, just doing this because I need life science credit. I heard back in the day, but not like 100 years ago.",
  "author": "DoctorLuther",
  "created": 1632438570,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.6,
  "comments": {
    "he1viar": {
      "link": "/r/college/comments/pu72lt/professors_should_really_stop_saying_stop_like/he1viar/",
      "text": "Prof here. ”students these days don't care about learning\" is just code for \"I miss the days when I only taught rich white people\".",
      "author": "shadowcentaur",
      "created": 1632456213,
      "upvotes": 0,
      "replies": {}
    },
    "he1fx3d": {
      "link": "/r/college/comments/pu72lt/professors_should_really_stop_saying_stop_like/he1fx3d/",
      "text": "Plato used to complain that the written word would make students too lazy to memorize rhetoric and poetry. Complaining about 'back in my day' and 'kids these days' has been going on for thousands of years.",
      "author": "hdorsettcase",
      "created": 1632448199,
      "upvotes": 10,
      "replies": {}
    },
    "he0xx0c": {
      "link": "/r/college/comments/pu72lt/professors_should_really_stop_saying_stop_like/he0xx0c/",
      "text": "As someone who thinks about \"back in my day\" when I interact with younger people, I was ready to defend your professor, but you're absolutely right on this one. We have made an unbelievable number of advances in the past 100 years-- particularly in biology. The differences between now and then are so extreme it's almost like comparing apples and oranges. \n\nThe younger generations (of which I am because I'm a millennial-- I just feel old around traditional undergrads) are the most educated in history. It *seems* like people were more willing to learn \"back in the day,\" because \"back in the day\" only the most privileged and \"best and brightest\" even had a chance of going to college so the ones that made it to college tended to be significantly better than average. Now nearly everyone goes to college. \n\nAlso, they didn't need to know anywhere near as much. My dad is significantly younger than 100 and never learned anything about DNA in school because they didn't know anything about DNA back then. Now it's a core part of bio curriculums. Back then, students spent a ton of time memorizing, because if they needed to know some factual trivia, they couldn't just google it. Now you can, so mental resources can be allocated elsewhere (memorization of core foundational material is still important, but as a whole memorization in general not as important as it used to be).\n\nThe world is just light-years away from what it used to be. I doubt there are many people from 1921 that would be able to keep up with 2021 standards, to be honest.",
      "author": "HumanDrinkingTea",
      "created": 1632439628,
      "upvotes": 6,
      "replies": {
        "he14pij": {
          "link": "/r/college/comments/pu72lt/professors_should_really_stop_saying_stop_like/he14pij/",
          "text": "Yeah I understand what professor meant, but 100 years is what got stuck to me.",
          "author": "DoctorLuther",
          "created": 1632442867,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634051299
}