{
  "sid": "rc5a8e",
  "link": "/r/college/comments/rc5a8e/should_i_transfer_credits_or_just_start_fresh/",
  "title:": "Should I transfer credits or just start fresh?",
  "text": "In 2018 I enrolled at a CC and did decent. My gpa after 36 credits was a 3.4. Then I had to move, so I transferred to a different community college. Around that time I got really sick for “no reason”, only to officially be diagnosed with chron’s disease in the beginning of this year.  Since I was so sick with no answers, my grades suffered. Basically after 2 years at this new community college I’ve got a 1.7 gpa, but I only have one more semester until I finally obtain my AA. \n\nI recently moved again, so I am in district at the first community college I went to. I know if I transfer my credits it won’t affect my gpa, but it will look bad to see a bunch of withdrawals and 3 F’s when I finally apply to a four year. Should I just start fresh or have the credits transfer over? What would you’d recommend?",
  "author": "danghululylu",
  "created": 1639010268,
  "updated": 1639517214,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hnsup1h": {
      "link": "/r/college/comments/rc5a8e/should_i_transfer_credits_or_just_start_fresh/hnsup1h/",
      "text": ">it will look bad to see a bunch of withdrawals and 3 F’s when I finally apply to a four year\n\nIf you transfer credits from the other school, on your current schools transcript it wont list what grade you got in the class at the other school. In my opinion not transferring credits is a waste, *but* considering that you did poorly it might be worth retaking classes are paricularly important. Like if youre a bio major and dont remember shit from bio 101, youll wanna retake that because otherwise when you get to higher level courses youll be lost",
      "author": "taybay462",
      "created": 1639016223,
      "upvotes": 1,
      "replies": {}
    },
    "hnt54xa": {
      "link": "/r/college/comments/rc5a8e/should_i_transfer_credits_or_just_start_fresh/hnt54xa/",
      "text": "You are likely obligated to transfer the credits if you plan to earn a degree. It is up to the receiving institution to decide how to transfer in those courses but you should send the transcript. It could be considered academic fraud otherwise. A four year school will definitely want to see ALL transcripts from any school you have ever attended. Don't try to hide it, they can look up where you have attended in the National Student Clearinghouse.",
      "author": "kittycatblues",
      "created": 1639020991,
      "upvotes": 1,
      "replies": {}
    }
  }
}