{
  "sid": "q6bbpo",
  "link": "/r/college/comments/q6bbpo/sex_question/",
  "title:": "Sex question",
  "text": "TLDR: Got drunk video message to come fuck while I was asleep from a girl in my class. Girl was like hella drunk so didn't remember saying it, and I told her what she said in a G-rated way, and she said it sounds like something she might say is she DTF?\n\nSo I'm a sophomore, but this is my first real year in college. I added this girls snap from a classroom gc where we post socials, but she snapped me first, and commented on my shirt which led to conversations, I snuck some somewhat shirtless shirt in there which ik sounds rlly douchey but whatever. Anyway, we talked a little in class, but yesterday morning I woke up to 2 drunk snap videos from her from 3 AM (I was asleep). She was asking to chill at her dorm and wanted someone to fuck her or something like that. She was rlly drunk tho. I was asleep, and good I didn't go cause she was like gone. Anyway, I respond \"wait whattt😂\" and she didn't respond till late Sunday apologizing and saying she didn't remember what she said which is an L. I told her the \"come over and chill\" part but not the \"fuck the shit out of me\" part cause I didn't want to embarrass her, and she said \"come over and chill\" is something that sounds like she said which is a dub. Any way I drunk texted her \"I'm tryna get to know you\" last night but Idk she knew what that meant cause she was like \"Know what about. me?\" But continued to snap and chat and shit, so is she DTF while sober or what? How do I get the convo to that if it sounds like is?",
  "author": "cp3thegoat123",
  "created": 1634003554,
  "updated": 1634082998,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.3,
  "comments": {
    "hgb13g1": {
      "link": "/r/college/comments/q6bbpo/sex_question/hgb13g1/",
      "text": "Maybe you should just be honest with her. Be respectful and give her an \"easy out\" (talk in a way that lets her easily have room for an excuse) if you start talking about it, though, because she was drunk and may not actually feel that way.\n\nAlso in case you aren't aware already, you have to be cognizant about how much a person has had to drink when sex is involved. It's okay if they have had one or two standard servings of alcohol and are thinking clearly. But it sounds like this girl had four or five too many and she really can't give consent in that situation.\n\nI would add that it might not be a good decision to have any sort of relationship with someone who would get drunk and do this at 3am. This person definitely gives off \"I'm going to get suspended or do something really stupid while drunk\" vibes. Why don't you try to get to a state of clarity first and *then* ask yourself if this is actually a good idea?",
      "author": "darniforgotmypwd",
      "created": 1634005401,
      "upvotes": 5,
      "replies": {
        "hgb1aqc": {
          "link": "/r/college/comments/q6bbpo/sex_question/hgb1aqc/",
          "text": "Yeah ik I mean i was asleep so it didn't matter but I'd like to think I'd ask her to \"reschedule if I was up\"",
          "author": "cp3thegoat123",
          "created": 1634005492,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgazwns": {
      "link": "/r/college/comments/q6bbpo/sex_question/hgazwns/",
      "text": "[deleted]",
      "author": null,
      "created": 1634004876,
      "upvotes": 4,
      "replies": {
        "hgb178i": {
          "link": "/r/college/comments/q6bbpo/sex_question/hgb178i/",
          "text": "I didn't want to embarrass her plus she prolly wouldn't believe me plus I was drunk when I said that lol",
          "author": "cp3thegoat123",
          "created": 1634005449,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}