{
  "sid": "qz8dkq",
  "link": "/r/college/comments/qz8dkq/is_it_rude_to_ask_for_gas_money_from_someone_who/",
  "title:": "Is it rude to ask for gas money from someone who just got in a wreck?",
  "text": "So this girl I know who lives on campus got in a wreck about a week ago, she asked me for a ride shortly after and I said yes. But she keeps asking me to give her rides to different places, and I don’t mind but I’m spending quite a bit of money on gas to take her places. I don’t know if it’s rude to ask her for gas money since she just got in a wreck and she’s having to pay for car repairs, what do you guys think? We’re both broke college kids, and im not totally sure if she has a job or not…",
  "author": "Izopod1",
  "created": 1637540365,
  "updated": 1637689096,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hlkubqk": {
      "link": "/r/college/comments/qz8dkq/is_it_rude_to_ask_for_gas_money_from_someone_who/hlkubqk/",
      "text": "Nope. It would be one thing if you offered her rides, or if she asked if she could tag along so she could accomplish things along your anticipated route - such as getting groceries. Her car wreck should not cost YOU money. Don’t feel bad about it, you don’t owe her anything.\n\nHave a chat with her, let her know that gas prices are high and you’re open to helping her out, but it’s unrealistic for her to expect it for free. I appreciate that you’re so mindful of her situation, but you have to look out for yourself too and this could lead to you being used for an indefinite amount of time if you neglect to address it. Maybe she’s just stressed about the wreck and never thought to offer you gas money, but in my opinion, I’d be quick to offer what I had if someone was going out of their way to help me out.",
      "author": "mutual-cacophany",
      "created": 1637540959,
      "upvotes": 22,
      "replies": {}
    },
    "hlkvnwa": {
      "link": "/r/college/comments/qz8dkq/is_it_rude_to_ask_for_gas_money_from_someone_who/hlkvnwa/",
      "text": "If it was a one-time thing I wouldn't ask for gas money, but if she wants you to give her multiple rides then I would ask for gas money. Perhaps you could have a conversation with her and nicely ask for her to contribute. You don't want to get taken advantage of, best to set boundaries.",
      "author": "ShyCoconut0_0",
      "created": 1637541577,
      "upvotes": 15,
      "replies": {
        "hln31yn": {
          "link": "/r/college/comments/qz8dkq/is_it_rude_to_ask_for_gas_money_from_someone_who/hln31yn/",
          "text": "[removed]",
          "author": null,
          "created": 1637591093,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlkuge6": {
      "link": "/r/college/comments/qz8dkq/is_it_rude_to_ask_for_gas_money_from_someone_who/hlkuge6/",
      "text": "I would say it is not rude at all.  But if possible given that her money is spoken for you should offer to let her pay in a few weeks when she is back on her feet.  That is assuming you can trust her!",
      "author": "jaysonm007",
      "created": 1637541018,
      "upvotes": 8,
      "replies": {}
    },
    "hlkudi4": {
      "link": "/r/college/comments/qz8dkq/is_it_rude_to_ask_for_gas_money_from_someone_who/hlkudi4/",
      "text": "Next time you pick her up say you need to get gas and ask if you two can split a tank",
      "author": "GoldRequest",
      "created": 1637540981,
      "upvotes": 7,
      "replies": {
        "hllg75w": {
          "link": "/r/college/comments/qz8dkq/is_it_rude_to_ask_for_gas_money_from_someone_who/hllg75w/",
          "text": "I wouldn't spring it on her like this.",
          "author": "ssdbat",
          "created": 1637551283,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hlmk991": {
      "link": "/r/college/comments/qz8dkq/is_it_rude_to_ask_for_gas_money_from_someone_who/hlmk991/",
      "text": "Bro there's a fine line between being nice and being taken advantage of. Next time you see her, ask for compensation for the rides.",
      "author": "milk690",
      "created": 1637579346,
      "upvotes": 4,
      "replies": {}
    }
  }
}