{
  "sid": "rgk3oz",
  "link": "/r/college/comments/rgk3oz/zoom_classes_are_hard_any_advice_on_doing_better/",
  "title:": "Zoom classes are hard. Any advice on doing better in them?",
  "text": "I'm completely cool with in-person classes or online classes where no zoom meetings are involved. But if they are? Then I'm kind of fucked. I don't know why. Even if I take notes and remove as many background distractions as possible, I still miss a bunch of shit and everything ends up leaking out of my ears. \n\nMy calculus class is completely online, with a textbook and tutorial vids, and instructor help if needed. Then you do some work/quizzes and tests whenever and turn it in by the deadline, and you can't progress to the next unit if you get a low score on your work (which has infinite tries). I have a 93% in calc right now.\n\n&#x200B;\n\nMy English&Comp class is completely in-person, and I've never been great at English, but the learning environment of the classroom makes everything stick a lot better. I've never gotten anything below an A- on a paper. \n\n&#x200B;\n\nMy biology class is all zoom meetings with one or two in-person labs every month. I'm failing that class. My labwork looks great, but everything else is literally just garbage. \n\n&#x200B;\n\nI missed about 1/3 to 2/5 of all of my classes (including online) this semester because of covid and flu, but I was able to catch up for Comp and Calc. Bio, however, just went downhill, since I fell behind trying to catch up, and the fact that I got a job right after recovering from sickness didn't help my situation much. \n\n&#x200B;\n\nAnyone know why this might've happened? Do you have advice on doing better in Zoom-based classes, or should I just avoid them entirely?",
  "author": "m48_apocalypse",
  "created": 1639523684,
  "updated": 1639787981,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "holzq30": {
      "link": "/r/college/comments/rgk3oz/zoom_classes_are_hard_any_advice_on_doing_better/holzq30/",
      "text": "Maybe try to treat it as if it is a live class and force yourself to go to a library or coffee shop to do it. I think making a lot of to do lists and for ong yourself to stay on top of assignments could also be helpful.",
      "author": "catlover12321",
      "created": 1639546064,
      "upvotes": 1,
      "replies": {}
    }
  }
}