{
  "sid": "rfvkt4",
  "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/",
  "title:": "Taking longer than 4 years",
  "text": "How common is it to take longer than 4 years to graduate? I’m so worried that taking longer will effect the rest of my life. I also feel a lot of shame with it tbh. \nI just don’t want to feel alone in this boat I guess.",
  "author": "darkroselol",
  "created": 1639445038,
  "updated": 1639515976,
  "over_18": false,
  "upvotes": 47,
  "upvote_ratio": 1.0,
  "comments": {
    "hogcxip": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogcxip/",
      "text": "Idk the validity to this but I just read that it’s like only 31% of people do it in 4 years or less and the average is 5.1 years",
      "author": "bot_mansocks",
      "created": 1639445207,
      "upvotes": 59,
      "replies": {
        "hogup3f": {
          "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogup3f/",
          "text": "Exactly. Graduating in 4 or less years comes with a lot of privilege. First of all you need to have a family that can support you financially and emotionally. Then you gotta somehow make sure that nothing disruptive happens to your mental and physical health within those 4 years.",
          "author": "Nicofatpad",
          "created": 1639453290,
          "upvotes": 43,
          "replies": {
            "hohg8b1": {
              "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hohg8b1/",
              "text": "This! I’m in Canada and we have a physician shortage right now. If you take less than 10 courses in 1 year (30 credits) that year is disqualified from your application at some university med schools Thus, making the med school track only available to those who don’t have to work to pay for college (wealthy families). And it is sometimes the same for other grad schools (expect masters).  Making this level of school unreachable for first gens too. \n\nI’m grateful I only have to worry about school. It’s a huge privilege many take for granted.",
              "author": "jenniferrook9",
              "created": 1639465677,
              "upvotes": 14,
              "replies": {
                "hoi95x7": {
                  "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoi95x7/",
                  "text": "I didn't know any of this was a thing. Is Canada doing anything about this shortage?",
                  "author": "wolfy321",
                  "created": 1639487394,
                  "upvotes": 2,
                  "replies": {
                    "hoik5dt": {
                      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoik5dt/",
                      "text": "Not that I know of. The government is spending more time avoiding getting clean water on native reserves.  A big issue is there is alot of med school spots, then less residency spots and even less attending physician positions. Many have resorted to going up North to work. It can take months even years to get a primary care physician. Especially in the Maritime provinces. But a huge isssue is a majority of MD/DO holders can never work because of how few residency positions there are. \n\nOh and because of the shortage many doctors have resorted to treating nurses and aids poorly. So there is also a nursing demand because many nurses can’t handle the toxic work environment created (has been around since the 90s i believe)",
                      "author": "jenniferrook9",
                      "created": 1639492937,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hogfexg": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogfexg/",
      "text": "The average nationally is around 6 years. You’ll be okay.",
      "author": "maora34",
      "created": 1639446349,
      "upvotes": 25,
      "replies": {}
    },
    "hogdpf5": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogdpf5/",
      "text": "it’s super common",
      "author": "maya0310",
      "created": 1639445563,
      "upvotes": 22,
      "replies": {}
    },
    "hogfm34": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogfm34/",
      "text": "If it makes you feel better, I'm at 6 and counting.",
      "author": "Hunt3r8806",
      "created": 1639446441,
      "upvotes": 16,
      "replies": {}
    },
    "hognka5": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hognka5/",
      "text": "I’ll be taking 7 years since starting. That includes taking 3 years off.",
      "author": "NoSpaceAlien",
      "created": 1639450007,
      "upvotes": 12,
      "replies": {}
    },
    "hogo53d": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogo53d/",
      "text": "No shame and it's super common. I always tell advisees that as long as you can make the financial side of it work, there's no harm in taking longer than the \"standard\" 4 years (which, as others have pointed out, may or may not actually be the norm at your school).",
      "author": "puzzlealbatross",
      "created": 1639450262,
      "upvotes": 9,
      "replies": {}
    },
    "hoh2e6v": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoh2e6v/",
      "text": "My boyfriend is 25, almost 26, he’s been pursuing his bachelor since he was 18. I am 20, I’ve been in college including dual enrollment since 16 and I’m still one semester away from my AA. Everyone moves at their own pace, life happens, things get in the way, and college is HARD. As long as you finish that’s all that matters!",
      "author": "idkwhatimdoing5449",
      "created": 1639457057,
      "upvotes": 7,
      "replies": {}
    },
    "hogvolz": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogvolz/",
      "text": "Most of the people at my college end up being “super seniors” it’s not really anything to be embarrassed or ashamed of imo, different people and different degrees take different amounts of time",
      "author": "poonmaster64",
      "created": 1639453759,
      "upvotes": 3,
      "replies": {}
    },
    "hoiuw9o": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoiuw9o/",
      "text": "I don't know how you get college done in 4 years if you work while going to school. Seems impossible!",
      "author": "Past-Broad",
      "created": 1639497459,
      "upvotes": 3,
      "replies": {}
    },
    "hogfulq": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogfulq/",
      "text": "It's not uncommon, but it isn't the norm. That being said, most graduation statistics take the 6-year graduation rate, so longer than 4 years isn't too far out of the ordinary.",
      "author": "DrAlawyn",
      "created": 1639446549,
      "upvotes": 7,
      "replies": {}
    },
    "hoh2pvt": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoh2pvt/",
      "text": "This is definitely super common. Also, you had covid in your way as well which is valid. I kind’ve wish I took an extra semester/year to make up for what I DIDN’T learn in online classes during covid",
      "author": "miaomfg",
      "created": 1639457227,
      "upvotes": 2,
      "replies": {}
    },
    "hoi80mh": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoi80mh/",
      "text": "Took me 12 years going part time. Keep working it. Good luck! 🍀",
      "author": "johnsmith069069",
      "created": 1639486756,
      "upvotes": 2,
      "replies": {}
    },
    "hogr1o6": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogr1o6/",
      "text": "Bruh, don't worry about.. once your out in the real world you can't go back to college",
      "author": "andwhosaysicant",
      "created": 1639451580,
      "upvotes": 1,
      "replies": {}
    },
    "hogyfop": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hogyfop/",
      "text": "I’m just barely about to get my 2 year associate’s after 4 years… 🙂🙃 I know for sure that it’s hard to not feel awful about moving “slower” than the pace society expects us to complete school in but there really is no rush and not everyone can finish their education in the same amount of time. Things happen, life gets busy, life gets mentally difficult, etc",
      "author": "Northerntwilight",
      "created": 1639455074,
      "upvotes": 1,
      "replies": {}
    },
    "hoh6jc1": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoh6jc1/",
      "text": "I have to do five years since I changed my major ajd transferred schools. It personally doesn’t bother me. I stopped thinking about age as a sign of intelligence a while ago.",
      "author": "CasuallyInsecureMan",
      "created": 1639459356,
      "upvotes": 1,
      "replies": {}
    },
    "hohcz7w": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hohcz7w/",
      "text": "I don't know how common it is, but it took me 3 years to graduate from my 2-year community college. I'll be at my transfer university for another 3 years. So, 6 years total that it will take me.",
      "author": "Autumnleaves201",
      "created": 1639463420,
      "upvotes": 1,
      "replies": {}
    },
    "hohe76d": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hohe76d/",
      "text": "Don’t worry. I’m 25 and just finished my first semester. I won’t be done until I’m 29, 11 years after graduating highschool.",
      "author": "mousist",
      "created": 1639464253,
      "upvotes": 1,
      "replies": {}
    },
    "hohf2cb": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hohf2cb/",
      "text": "I’m 24, and in total my bachelors will have taken 8/9 years when I’m done. We are all on our own timelines :)",
      "author": "Maryjanehollandd_",
      "created": 1639464857,
      "upvotes": 1,
      "replies": {}
    },
    "hohin9a": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hohin9a/",
      "text": "By the time I finish, my BA will have taken me 13 years!",
      "author": "TiredOfForgottenPass",
      "created": 1639467458,
      "upvotes": 1,
      "replies": {}
    },
    "hoi0xxp": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoi0xxp/",
      "text": "Very common. One guy I know took him 8-9 years to graduate and he is Korean and I have a friend still have one class to graduate and he attended college since 2013 lol",
      "author": "MoneyCuzz",
      "created": 1639482298,
      "upvotes": 1,
      "replies": {}
    },
    "hoi6p9r": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoi6p9r/",
      "text": "Graduated in 5 years with good grades and a job offer in a competitive industry here. No one ever asked why did I finish in 5 years in job interviews.",
      "author": "foreverraccoon",
      "created": 1639486001,
      "upvotes": 1,
      "replies": {}
    },
    "hoigzi3": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoigzi3/",
      "text": "Ya when I was working on campus, the office I worked in looked at this and it’s about about 70/30 those who do it in more than 4 vs those who do it in less  than 4",
      "author": "uglybutterfly025",
      "created": 1639491313,
      "upvotes": 1,
      "replies": {}
    },
    "hoikscn": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoikscn/",
      "text": "Not a big deal. Some schools have more requirements than others. My sister went to a different college and finished an accounting degree in 4 years but my school has different requirements so it will take 4.5 years. It’s not a race everyone goes at their own pace. Some will take 6 classes a semester and finish in three",
      "author": "codchump",
      "created": 1639493222,
      "upvotes": 1,
      "replies": {}
    },
    "hoimg2d": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoimg2d/",
      "text": "Not only did I take more than 4 years Im very glad I did. Taking longer Can help you mature and get more out of your education. Also the sooner you graduate, that’s just sooner you’ll start working for the rest of your life",
      "author": "trying-my-best-",
      "created": 1639493950,
      "upvotes": 1,
      "replies": {}
    },
    "hoiueyk": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoiueyk/",
      "text": "I started college in 2016 (graduated high school Spring 2015) going online part time while working part time.  Transferred schools after 3 years (Spring 2019 was my last semester at my original school). I have now been at my current school for two years where I added a major my 1st semester there and just changed said major this semester. All in all I think I have another year and a half or two until I finish both of my majors.",
      "author": "jkehrli1996",
      "created": 1639497266,
      "upvotes": 1,
      "replies": {}
    },
    "hoj204s": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoj204s/",
      "text": "It’s okay bro, most people finish young but there’s others who find their path much later in life.",
      "author": "Infinite_Figure_4573",
      "created": 1639500260,
      "upvotes": 1,
      "replies": {}
    },
    "hoj3tyc": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hoj3tyc/",
      "text": "I may be able to, but that's cause I was an overachiever in highschool and took a ton of AP classes. I also chose a major that allowed 29 of said credits to count towards my major. And I didn't work during college.\n\nI did terrible one semester and took the next off for mental health reasons, sooo all that highschool effort has me graduating within 4 years, barely. If you worked, that's out of this world amazing in my eyes.",
      "author": "Positive-Court",
      "created": 1639500960,
      "upvotes": 1,
      "replies": {}
    },
    "hojdlm3": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hojdlm3/",
      "text": "I mean, me and a couple people I know all took 5 years, some because the switched majors, some because dual or triple majors",
      "author": "Sxotts",
      "created": 1639504736,
      "upvotes": 1,
      "replies": {}
    },
    "hojvswy": {
      "link": "/r/college/comments/rfvkt4/taking_longer_than_4_years/hojvswy/",
      "text": "Very common. I was supposed to graduate in 2021 and now I'm graduating in 2022. At the time, I felt like a failure for taking an extra year but in the grand scheme of things a year is nothing. I would have graduated on time if I didn't have to take a medical leave bc of mental health issues my freshman year.",
      "author": "thatgirltag",
      "created": 1639511870,
      "upvotes": 1,
      "replies": {}
    }
  }
}