{
  "sid": "rc2f16",
  "link": "/r/college/comments/rc2f16/first_semester_woes/",
  "title:": "First Semester Woes",
  "text": "I am honestly at a loss at where I even begin. Currently my classes are going absolutely like shit, and I’m scared to see what effects that will happen on my GPA. \n\nI am a freshman student, with a 3.1 GPA before I entered college with around 10 hours of college credits already earned from my AP & dual enrollment classes. \n\nCurrently my grades are - C+, C-, D+, A+ and A- with some of my favorite classes already being in the lows which sucks. \n\nNot to mention, I don’t think I am a bad student by any means. I go to class every lectures, I finish my assignments as soon as before the due dates, and I try to study for at least 3 hours every week for my classes. \n\nI also tried to make some friends, but honestly all I got are people I consider acquaintances. I mean they’re nice people, but I realized they’re all there for a purpose which is to basically be the same as me - a leetcoding person trying to get their first internship and degree in Computer Science. \n\nI could go on about my internship search, leetcoding woes, but let go back to the main passage. \n\nI also realized that my health is going slowly shittier and shittier as well - I’ve been sleeping on average 3-4 hours a day, and haven’t been exercising unless you count me walking from my dorm to class which is a 15 minutes walk for me. Total calories I burn at the end of the day is 200-300 calories which is nothing compared to the 2400 calories I eat everyday as a shorter person. \n\nAll I can hear is that I’m not getting the “best time of my life” as dictated by college lifestyle and honestly I never had a good moment in my life. All I want to do now is just graduate as early as I can - maybe take an online degree program instead such as UofF Online or WGU - these programs at least on paper seem more suited for me, but I doubt the reliability. \n\nI just want to time travel to me getting my degree and then just starting my life up. I just don’t care about anything anymore, as all I can hear up to this point is that I now hate where I’m at.",
  "author": "VLRNON",
  "created": 1639001647,
  "updated": 1639517185,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hnrzo4h": {
      "link": "/r/college/comments/rc2f16/first_semester_woes/hnrzo4h/",
      "text": "[deleted]",
      "author": null,
      "created": 1639002592,
      "upvotes": 2,
      "replies": {
        "hns2bbq": {
          "link": "/r/college/comments/rc2f16/first_semester_woes/hns2bbq/",
          "text": "I’m failing a class. I don’t think that’s something to be happy about, and my GPA isn’t exactly good for my first semester either.",
          "author": "VLRNON",
          "created": 1639003686,
          "upvotes": 1,
          "replies": {
            "hns2esc": {
              "link": "/r/college/comments/rc2f16/first_semester_woes/hns2esc/",
              "text": "Furthermore, my schedule is already cutthroat as it is - one whole setback can result in me having a shit ton of issues.",
              "author": "VLRNON",
              "created": 1639003725,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnt3m6a": {
      "link": "/r/college/comments/rc2f16/first_semester_woes/hnt3m6a/",
      "text": "Do you study three hours a week total or three hours a week per class? Either way that is no where near enough. Take a look at help labs etc. available at your school. Talk to you advisor. See if you can still drop a class or two that you are failing. Do your best to finish out the semester and work at doing better next semester.",
      "author": "kittycatblues",
      "created": 1639020272,
      "upvotes": 1,
      "replies": {
        "hntd5a2": {
          "link": "/r/college/comments/rc2f16/first_semester_woes/hntd5a2/",
          "text": "Three hours a week per class. I have 5 classes so around 15 hours of total study.\n\nI’ve been using tutoring, as well as been going to office hours with my professor, but the semester is already over. \n\nI think I might be able to retake it as my next semester does not have any preq from this semester, but if I can get some of these classes to be waivered (essentially I take what is the final exam and then get a certain score to get a certain credit - basically CLEP). \n\nUnfortunately the semester is already over, so I’m just anxious to see what my scores is going to be like at this time.",
          "author": "VLRNON",
          "created": 1639025102,
          "upvotes": 1,
          "replies": {
            "hntdc8q": {
              "link": "/r/college/comments/rc2f16/first_semester_woes/hntdc8q/",
              "text": "You need to double your study time next semester. You should be going two hours of work/studying outside of class for every hour you are in class.",
              "author": "kittycatblues",
              "created": 1639025206,
              "upvotes": 2,
              "replies": {
                "hntfs2a": {
                  "link": "/r/college/comments/rc2f16/first_semester_woes/hntfs2a/",
                  "text": "Well - there’s other concerns I have with that as well. I also want to make projects in my time that I have, albeit limited to around 3 hours per days. \n\nI’ll try to see if I can cut down on my hours for work, and increase the amount for schoolwork, but I also have to set aside some time for projects and leetcoding if I can. \n\nI also do every chance I could get to basically work through an assignment and then post it on the earliest day (basically a day or two on average after it was announced). Is this a strategy that I should continue, or should I just try to post it on time, but don’t try to post it last minutes ?\n\nI also have been talking to my advisors who are trying to get me to switch to another major, but I am set in the major I chose, and honestly I don’t want to change it if I have to. \n\nMy goal for next semester is to try to take what you said, but then I’ll encorporate new study methods as well.\n\nDo you have any recommendations for these study methods ?",
                  "author": "VLRNON",
                  "created": 1639026552,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hntd9an": {
              "link": "/r/college/comments/rc2f16/first_semester_woes/hntd9an/",
              "text": "It should also be noted that at the same time - I’m in a STEM field as well so I’ve been putting in my shares of work into projects and Leetcode and searching for internships.",
              "author": "VLRNON",
              "created": 1639025162,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}