{
  "sid": "qloiud",
  "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/",
  "title:": "my roommate keeps getting sick…",
  "text": "after nearing the end of a 3-week long recovery from a viral infection (most likely the flu) that my roommate gave me, she goes and gets sick again, not even a month after getting me sick the first time. I feel like she just doesn’t have very good hygiene but it sucks that I have to suffer with her due to something that’s completely out of my control. y’all, it was so hard to study for midterms when I was sick last time, I physically and mentally can’t do this again. we live in a small dorm room… is it just inevitable that I’ll get sick again?\n\nis this good enough reason for the university to waive my housing contract for next spring? what can I do, I’m so desperate :(",
  "author": "breadstickbitc",
  "created": 1635921146,
  "updated": 1636137563,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hj4kt1e": {
      "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj4kt1e/",
      "text": "What do you think she was doing that made her “get herself sick”from a respiratory virus.  How is this in her control?",
      "author": "PersephoneIsNotHome",
      "created": 1635930739,
      "upvotes": 5,
      "replies": {
        "hj55db9": {
          "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj55db9/",
          "text": "I don’t know, lick every handrail on campus? It’s not that hard to keep yourself healthy— wash your hands, wear a mask in class, and maybe cover your mouth instead of coughing all over the room? It’s just frustrating because this is someone who I literally watch climb into bed without showering, brushing her teeth, or washing her face every night.",
          "author": "breadstickbitc",
          "created": 1635944492,
          "upvotes": -5,
          "replies": {
            "hj57n2c": {
              "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj57n2c/",
              "text": "Respiratory virus are mostly spread by the air (have you been hiding under a rock for the past year?) and for many reasons some people are more susceptible to the flu.\n\nThere is no evidence at all that brushing your teeth is any any way related to transmission of respiratory viruses.",
              "author": "PersephoneIsNotHome",
              "created": 1635945608,
              "upvotes": 5,
              "replies": {
                "hj5tz2h": {
                  "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj5tz2h/",
                  "text": "Exactly, which is why although masks are not required, I still think we should be making an effort to wear them during class. Especially during flu season. And I know that she doesn’t wear a mask anywhere.\n\nBrushing your teeth may not have anything to do with respiratory diseases, but you missed my point that she seems to have no regard for basic hygiene.",
                  "author": "breadstickbitc",
                  "created": 1635954734,
                  "upvotes": 2,
                  "replies": {
                    "hj653t6": {
                      "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj653t6/",
                      "text": "Please learn some basic immunology and a little humanity if you are going to be premed \n\nYou seem to miss the part where catching a respiratory virus is not a visitation from the almighty on the wicked.\n\nmasks provide some protection for the wearer, but as you should have been able to clearly see, if other people who have a respiratory virus do not wear masks in close quarters indoors, then the people they are honking on are very likely to also get that respiratory virus even if they wash their face before they go to bed.",
                      "author": "PersephoneIsNotHome",
                      "created": 1635958915,
                      "upvotes": 2,
                      "replies": {
                        "hj6a9gk": {
                          "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj6a9gk/",
                          "text": "Basic immunology? Like the vague and unbacked claims you’re making? And undermining the effectiveness of masks?\n\nI would be more sympathetic she made a genuine effort to practice basic hygiene and wear a mask but she has completely no regard for the health of the people around her. Anxiety towards becoming ill is so common, especially with the pandemic.\n\nOf course, it may not be very easy to understand as someone who sits at home on Reddit all day.",
                          "author": "breadstickbitc",
                          "created": 1635960854,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hj65ent": {
              "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj65ent/",
              "text": "What kind of flu do you think you can get by ingesting it?  That is not the route of transmission for colds or respiratory viruses in general",
              "author": "PersephoneIsNotHome",
              "created": 1635959028,
              "upvotes": 0,
              "replies": {
                "hj6c00w": {
                  "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj6c00w/",
                  "text": "Who said anything about ingesting it? It’s also common knowledge that pathogens spread when people touch an infected surface and then touch their face or mouth? That’s why washing your hands before you eat or touch your face is so important— literally the basis of basic hygiene, which apparently a surprising people need to be reminded about?",
                  "author": "breadstickbitc",
                  "created": 1635961516,
                  "upvotes": 1,
                  "replies": {
                    "hj6o1bz": {
                      "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj6o1bz/",
                      "text": ">Quantitative microbial risk assessment (QMRA) studies have been conducted to understand and characterize the relative risk of SARS-CoV-2 fomite transmission and evaluate the need for and effectiveness of prevention measures to reduce risk. Findings of these studies suggest that the risk of SARS-CoV-2 infection via the fomite transmission route is low, and generally less than 1 in 10,000, \n\nhttps://www.cdc.gov/coronavirus/2019-ncov/more/science-and-research/surface-transmission.html\n\n\nNorovirus and other things are primarily spread like that.\n\nRespiratory viruses are primarily airborne or aerosol typically.",
                      "author": "PersephoneIsNotHome",
                      "created": 1635966097,
                      "upvotes": 0,
                      "replies": {
                        "hj71jy8": {
                          "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj71jy8/",
                          "text": "The Pancic study (52) recovered 3 to 1,800 PFU of rhinovirus from fingertips of volunteers who handled contaminated doorknobs or faucets. Using coliphage PRD-1 as a model, Rusin et al. (60) demonstrated that 65% of virus could be transferred to uncontaminated hands and 34% to the mouth. The nature and frequency of contact with contaminated surfaces vary for each person depending on age, personal habits, type of activities, personal mobility, and the level of cleanliness in the surroundings (66). Viral transfer and disease transmission is further complicated by variations in virus survival on surfaces and the release of viruses from fomites upon casual contact (24, 66).\n\nRhinovirus infections cause the common cold.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC1828811/",
                          "author": "breadstickbitc",
                          "created": 1635971309,
                          "upvotes": 1,
                          "replies": {
                            "hj7f1rb": {
                              "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj7f1rb/",
                              "text": "Nobody said that viral particles , or fomites, dont exist on surfaces.  Including your hands and skin.  But if it has a role in transmission or not is another matter.\n\nYou need to look up what a route of transmission is.  Which is why you can eat COVID and it does no harm, or have it on your skin and that doesn’t transmit it.  \n\nso you dont understand the things you are copying and pasting, like many students.\n\nYou need to look for studies that look at transmission.  The contact tracing studies, particularly  of the Wuhan busses and the cruise ship for COVID, but also historically for legionaries disease and for previous flu epidemics indicate that sharing glassware and food etc was not a source of transmission, albeit PCR can find virus on all those surfaces.\n\nso wiping your light switch and doorknob is just magical thinking\n\nTake some more bio classes so that you can learn to read and interpret papers !",
                              "author": "PersephoneIsNotHome",
                              "created": 1635976571,
                              "upvotes": 1,
                              "replies": {
                                "hj7jdj9": {
                                  "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj7jdj9/",
                                  "text": "Viruses such as the flu are transmitted via droplets. This cannot be denied. I don’t know how else to explain this to you, but these droplets don’t have to travel directly through the air into someone’s respiratory system for them to become infected.\n\nIf you think you can share food with people without coming into contact with any viral load at all, you are delusional.\n\nIf COVID can’t even spread through skin contact or ingestion, then why would the CDC even recommend hand washing? Is that magical thinking as well? People will come up with anything to justify their bad habits.\n\nThe study does focus on transmission— droplets from viral infections are easily transferred to fomites, and then from fomites to someone’s hands or mouth. If viruses were as picky with infecting people as you claim, we wouldn’t be in a pandemic. No matter what method of contact, a high viral load is still a high viral load. Just because it may not be the main method of transmission doesn’t mean it can be completely disregarded.\n\nReading comprehension is hard sometimes though, so no worries! I’m definitely excited to take more bio classes!",
                                  "author": "breadstickbitc",
                                  "created": 1635978344,
                                  "upvotes": 1,
                                  "replies": {
                                    "hj7ly5d": {
                                      "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj7ly5d/",
                                      "text": "Ok, show evidence of viral transmission via food.  Post a paper.\n\nI linked to the CDC site\n\nThat paper doesnt demonstrate transmission if measure virtual particles.\n\nCovid IS picky. It absolutely wants to be in your nose and eyes.  BEcause that is where the receptors are, that is where some innate meausures are not (it doesn’t survive the stomach acid for example).  \n\nMalaria is also picky.\n\nNorovirus is not picky.\n\nI never said fomite transmission could be completely disregarded, I posted the actually numbers and the info that there are no cases that are traced to sharing glassware and food, but there are to breathing the air, because like most respiratory viruses, they want to be transmitted in droplets or aerosols, that is what they were designed to do.\n\nSome upper respiratory viruses are less picky. RSV for example.  And there is some good data from military studies that frequent proper hand washing can reduce how often people went to the infirmary for cold and flu-like symptoms by a bit, but a significant little bit.\n\nPeople will come up with anything to not admit that they didn’t know as much about something as they thought.\n\nBut look again at the difference between measure if virtual particles and cases, if you try hard you are almost there with your reading comprehension",
                                      "author": "PersephoneIsNotHome",
                                      "created": 1635979434,
                                      "upvotes": 1,
                                      "replies": {
                                        "hj7r3ig": {
                                          "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj7r3ig/",
                                          "text": "The point is not that viral infection spread through food, and it never was. You are changing what you initially mentioned after realizing that it can indeed occur. The flu can spread if the food handler is infected due to the food coming into contact with droplets. These droplets can be anywhere, which is what makes it so contagious. \n\nThe nose and the eyes are areas that people will commonly touch throughout the day. You could easily transfer droplets from your hand or arm to those regions of your face. For other viruses, which is what I was initially discussing before you decided to focus in on COVID as an attempt to represent other viral infections that are nowhere near as specific.\n\nMost people won't go visit a doctor for a small cold or flu, but it's so so important that we all take small precautions, such as washing our hands, in order to prevent spread to people who may become severely ill. \n\nRegardless of the logistics, at the end of the day, everything said here just furthers my point that it's very difficult to avoid contracting a viral illness from a roommate in such close quarters. I have no doubt that you are well-versed in many aspects of biological sciences, and because there are so many different conclusions out there from different studies, it's hard to decide what can be considered \"more accurate\" in regards to the other. This just results in circular, never-ending debates about science, which theoretically, should be an objective subject.\n\nMy point is that while it's not my roommate's fault that she keeps getting sick, it's frustrating for me, someone who makes a conscious effort to practice good hygiene and lifestyle choices in an attempt to avoid the anxiety and inconveniences that come with becoming ill. I think that as someone who lives in the same room as her, I can justifiably make the claim that overall she just lacks basic hygiene. Of course, anyone, even those who do everything right, can get sick. All I'm saying is that it's no coincidence that she's the one who has gotten sick twice within less than a month and doesn't seem very serious about it either. On the other hand, I'm the person who gets COVID tested regularly and every time she gets sick. I'm the person who wears a mask to class and cleans the surfaces of the room where germs are most likely to collect. It's hard to go home to visit my family and boyfriend when I constantly have to worry about potentially bringing home whatever new strain she contracted, and I really hope you can understand where I am coming from.",
                                          "author": "breadstickbitc",
                                          "created": 1635981678,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hj58hpw": {
      "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj58hpw/",
      "text": "Your roommate could have a lower immunity or a respiratory disease that makes then more susceptible to sicknesses. I've asked my family members/roommates to wear a mask in the room when they're sick to prevent it spreading and wiping down literally everything that they touch in the room (you can be doing things to keep yourself healthy don't blame it all on them). As for the school, if you are genuinely worried I would make an attempt at asking what they would recommend or if changes could be made to your living requirements for campus.",
      "author": "Confused-Frog75",
      "created": 1635946005,
      "upvotes": 3,
      "replies": {
        "hj5umpg": {
          "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj5umpg/",
          "text": "If this was the case, I believe she would make a greater effort to actually wear a mask in classes.\nI’ve been wiping down all the light switches and the door knob when she leaves, but that still doesn’t stop her from openly coughing everywhere in the room. I’ll probably be making an effort to get a room change, because although it’s not 100% her fault, her constantly bringing viruses back gives me anxiety",
          "author": "breadstickbitc",
          "created": 1635954980,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj5m7fj": {
      "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj5m7fj/",
      "text": "Some tips:\nwash hands with soap before you touch yourself,eat or drink. better hygiene. \n(I personally clean up the room every week and use disinfection alcohol to wipe my desk, cuz covid…)\nopen the window for 30 minutes every day to let the room have fresh air. \nlast option is to move out.",
      "author": "Adrien0715",
      "created": 1635951734,
      "upvotes": 3,
      "replies": {
        "hj5uunm": {
          "link": "/r/college/comments/qloiud/my_roommate_keeps_getting_sick/hj5uunm/",
          "text": "I’ll continue doing this stuff and hope for the best! COVID is scary and I’m genuinely afraid it’ll be the next thing she brings back",
          "author": "breadstickbitc",
          "created": 1635955064,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}