{
  "sid": "rdf5x2",
  "link": "/r/college/comments/rdf5x2/thank_you_for_the_grade/",
  "title:": "Thank you for the grade",
  "text": "I have had test anxiety for decades and implement a variety of techniques to manage my issue.\n\nI took my final exam last night and I earned a C according to LMS. so I had a glass of wine and accepted my fate, a B in a class I worked really hard in.  Fine. It's what I earned. I get it.\n\nWhen I woke up, I had a canvas alert a grade had been changed. My C is a B.\n\nI have killed it in the rest of the class. Presentations in costume (not even suggested, just felt right), attendance, participation etc. I worked my tail off, and I had a great Prof (yes, even before the grade change).\n\nSo while, yes, after getting the notification I did send my prof a quick mail that just said \"thank you\". I wanted to put out there that there are great Profs that do awesome things. \n\nI lurk on r/professors , I see you. :)",
  "author": "ROIIs360",
  "created": 1639161073,
  "updated": 1639516638,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 0.96,
  "comments": {
    "ho3rtnu": {
      "link": "/r/college/comments/rdf5x2/thank_you_for_the_grade/ho3rtnu/",
      "text": "If I was a professor and saw one of my students who worked hard but failed cause they missed an exam, I would just pass them",
      "author": "nathani3l0g",
      "created": 1639216790,
      "upvotes": 2,
      "replies": {}
    },
    "ho488lm": {
      "link": "/r/college/comments/rdf5x2/thank_you_for_the_grade/ho488lm/",
      "text": "My dad is a prof and does this a good amount. If he sees that a student tried but one of the exams or smthin dropped the grade, he will raise it. Ive seen him raise 87s to an A sometimes which is generous. However i never expect it from profs. So far my engineering profs have been quite strict with grades but im ok with that",
      "author": "numbnuts698",
      "created": 1639228322,
      "upvotes": 1,
      "replies": {}
    }
  }
}