{
  "sid": "qlwjeg",
  "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/",
  "title:": "I just failed my calculus quiz that I should’ve got an A on",
  "text": "Studied the past three days,\n\nOur quiz is 25 min. I screwed up on the first problem by implementing the wrong technique which took up like 15 min.\n\nLooked at #1 again and saw how I made such a simple mistake, so I quickly fixed it. Looked at the other problems and I also knew how to do them \n\nBut I didn’t have time to finish them…\n\nThus was a really easy quiz that I fucked up on. I have a high B+ in the class and am so sad because this will bring it down. It’s worth a lot of points. The quarter is almost over and I need an A in this class. I have big goals of transferring to UCLA and other big names. \n\nHow can I stop feeling bad? I studied so much and should’ve gotten an A…",
  "author": "Environmental_Cress2",
  "created": 1635952198,
  "updated": 1636137397,
  "over_18": false,
  "upvotes": 129,
  "upvote_ratio": 0.95,
  "comments": {
    "hj6eq3i": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj6eq3i/",
      "text": "Maybe think of this as a test skills learning experience? If the test items aren't weighted differently due to difficulty or what have you, go for the shorter easier ones first. Then circle back to the longer more complicated ones.\n\nSometimes the test wins, and we just have to learn from it for the next time. No need to dwell on it, but evaluating things for future exams can be fruitful (:",
      "author": "SnowySheep9",
      "created": 1635962542,
      "upvotes": 54,
      "replies": {}
    },
    "hj6h9n6": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj6h9n6/",
      "text": "Next time just finish out the test before going back to that one you knew you f*cked up",
      "author": "delusionalry",
      "created": 1635963515,
      "upvotes": 41,
      "replies": {}
    },
    "hj6vuac": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj6vuac/",
      "text": "It’s one quiz. At least you know what you messed up on. There’s always next quiz. Why was a quiz that you were given only 25 minutes for worth so much? That’s my question.",
      "author": "_heatwaves_",
      "created": 1635969109,
      "upvotes": 23,
      "replies": {}
    },
    "hj67odl": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj67odl/",
      "text": "This goes to show that quizzes and tests have absolutely nothing to do with knowledge, but rather what you are able to put on the paper.",
      "author": "selmanifesto",
      "created": 1635959886,
      "upvotes": 34,
      "replies": {}
    },
    "hj6t8yt": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj6t8yt/",
      "text": "same",
      "author": "kaqwer",
      "created": 1635968109,
      "upvotes": 3,
      "replies": {}
    },
    "hj7nopj": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj7nopj/",
      "text": "Oh no I’m so sorry. I had a midterm for my US Gov class of 50 questions for 25 points in 1hr. Somehow I thought it was a 25 questions for 25 points in 1hr. When I looked up the clock on canvas, I had 15 mins left and I only finished 25 questions. I failed that midterm bad. But then the TA gave ECs so I could still maintain my A. Praying for you.",
      "author": "FluffyStuffInDaHouz",
      "created": 1635980181,
      "upvotes": 3,
      "replies": {}
    },
    "hj8wedr": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj8wedr/",
      "text": "im in the same boat, i skipped out on plans with my friends to study for this stupid stats class and i failed. we just gotta hang tight for the rest of the semester im nt really sure what to do either.",
      "author": "urfather_bleep",
      "created": 1636001787,
      "upvotes": 2,
      "replies": {}
    },
    "hj5xh8p": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj5xh8p/",
      "text": "It happens, let it be a lesson to slow down a bit and look at the question more carefully.\n\nYou got the grade you earned, and making a mistake because you misstepped has the same consequences as not knowing what you’re doing in the first place.\n\nYou don’t get credit for knowing what you should have done, only what you did. Sorry bud.",
      "author": "Casual-Economist",
      "created": 1635956061,
      "upvotes": 7,
      "replies": {}
    },
    "hj65nhk": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj65nhk/",
      "text": "Sounds like you got the grade you deserve. Disappointing result I guess but on to the next one and don’t lose motivation!",
      "author": "WalmartDarthVader",
      "created": 1635959119,
      "upvotes": 0,
      "replies": {}
    },
    "hj5wtkc": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj5wtkc/",
      "text": "Maybe you got the grade you deserved?",
      "author": "BeautyAndGlamour",
      "created": 1635955809,
      "upvotes": -9,
      "replies": {
        "hj5wvjw": {
          "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj5wvjw/",
          "text": "not really",
          "author": "Environmental_Cress2",
          "created": 1635955830,
          "upvotes": -6,
          "replies": {
            "hj68iky": {
              "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj68iky/",
              "text": "I mean you did say u screwed up on the first problem which took like more than half ur time. I would say dont ever spend over 10 minutes on a problem which is a very long time considering you have 25 minutes. You could've gotten a better grade if u didnt waste time on #1 but its still the grade you deserved cause you didnt finish. Just learn from this and move forward.",
              "author": "Darkrise107",
              "created": 1635960198,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hj7888j": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj7888j/",
      "text": "Maybe talk with your professor and explain that you sort of panicked, walk him through your thinking. This has happened to me, as I get super anxious in tests. Depending on your class/school, the prof might let you resit the quiz or do an extra problem set. I really appreciate when instructors focus more on learning vs evaluation, so if they’re reasonable, you might find a better path forward for showing your progress. In any case, don’t despair and try to ace the next one.",
      "author": "Ok-Boysenberry3703",
      "created": 1635973860,
      "upvotes": 1,
      "replies": {}
    },
    "hj7dv1a": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj7dv1a/",
      "text": "I’ve had a similar experience in a math class. I studied hard but got a poor grade. I realized that I made a bunch of stupid mistakes without thinking. All you can do is learn from this and move on.",
      "author": "JupiterRocket",
      "created": 1635976095,
      "upvotes": 1,
      "replies": {}
    },
    "hj86h4a": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj86h4a/",
      "text": "I always look at the number of problems on a test before I start. If I realized I messed up I would just finish the rest as fast as I can then go back to fix if possible. In my experience, putting down a wrong answer with work always nets some partial credit, while putting nothing will guarantee a 0",
      "author": "GoldRequest",
      "created": 1635988440,
      "upvotes": 1,
      "replies": {}
    },
    "hj8kc9c": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj8kc9c/",
      "text": "Dont worry man! Keep Grinding. I also lost the chance to get A in my Discrete Math class for a quiz",
      "author": "drunkenwang",
      "created": 1635994890,
      "upvotes": 1,
      "replies": {}
    },
    "hj7aatl": {
      "link": "/r/college/comments/qlwjeg/i_just_failed_my_calculus_quiz_that_i_shouldve/hj7aatl/",
      "text": "Believe it or not, just by emailing the professor and explaining the situation, sometimes miracles can happen. Worst comes to worst, you show them that you care very much about your grades. That sets you up for a letter of recommendation. You’ll be okay. And don’t feel like you have to move mountains in calculus from now on. People always say “just try harder” but really, effort is a limited resource. Keep trying but learn from the experience and be mindful about the overall technique that must be used for certain types of problems. Learn to skip problems and go back later if they become way too time consuming. \n\nOh and eff these people who say you got the grade you deserved. Seems like you already know what you’re capable of. 👊",
      "author": "mynamesgarrett",
      "created": 1635974683,
      "upvotes": 0,
      "replies": {}
    }
  }
}