{
  "sid": "pv74il",
  "link": "/r/college/comments/pv74il/extreme_depression/",
  "title:": "Extreme depression",
  "text": "My home environment is causing me extreme depression in that I literally can’t work anywhere without feeling threatened. Backstory: I live with and share a room with two older siblings (27 & 30M) and one day out of the blue while I was using a pc we both shared, came and attacked me without warning due to anger issues. It was his (30m) a long time ago, he gave it to another brother of mine who gave it to me, so apparently it’s still his. Declared I can’t use it anymore because he wants to be mean, or just jealous of me in general. I have my own laptop but it’s so damaged that it’s just in video game terms -90% INT if you use it haha. I can go to the library, I just feel super depressed, I want to move out so I don’t get attacked out of the blue and not worried that someone is going to reclaim a computer I have been using for 6 months, but cannot allocate the funds. Buying my own laptop would save me some time, but my money is extremely limited. I realize it’s a part of adult life and bad things happen, so I would like advice on what I should do?",
  "author": "AspiraRules20",
  "created": 1632577813,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.88,
  "comments": {
    "he8tewh": {
      "link": "/r/college/comments/pv74il/extreme_depression/he8tewh/",
      "text": "I'd recommend contacting your schools student well being department (if it has one) to let them know about these issues. If these issues affect your grades negatively in future, they'll know there's  a legitimate reason why and can help you out. Maybe try getting a part-time job to cover the cost of the laptop and see if there are student loans that can help you move out into dorms?? Also, it might be wise to let the police know about the previous incident (especially if he seriously hurt you), since he might do it again.",
      "author": "Salamander3008",
      "created": 1632591429,
      "upvotes": 4,
      "replies": {
        "he8typm": {
          "link": "/r/college/comments/pv74il/extreme_depression/he8typm/",
          "text": "Yeah that sounds like a great option. We do have one, I haven’t reached out to them but I’ll give it a shot. It is affecting my grades, I used to have a convenient set up and got work done in a timely manner and I feel like I’m struggling to get the simplest assignments done. I have to commute so I’ll probably try and get a part time in my college since it’s most likely better than one I can get like at a gas station or something. I realize I have to help myself because no one else will! Thanks for the insight.",
          "author": "AspiraRules20",
          "created": 1632591678,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "he8rsbt": {
      "link": "/r/college/comments/pv74il/extreme_depression/he8rsbt/",
      "text": "If you're going to buy one, buy a refurbished one. I can't count how much money I've not spent by buying refurbished stuff.",
      "author": "Awkward_Mail_2786",
      "created": 1632590718,
      "upvotes": 5,
      "replies": {
        "he8sncx": {
          "link": "/r/college/comments/pv74il/extreme_depression/he8sncx/",
          "text": "Sounds like a good idea, thanks for the insight. I’ll probably look on Amazon for good deals.",
          "author": "AspiraRules20",
          "created": 1632591094,
          "upvotes": 1,
          "replies": {
            "hecbkxb": {
              "link": "/r/college/comments/pv74il/extreme_depression/hecbkxb/",
              "text": "Newegg!",
              "author": "Awkward_Mail_2786",
              "created": 1632661553,
              "upvotes": 2,
              "replies": {
                "hece2ed": {
                  "link": "/r/college/comments/pv74il/extreme_depression/hece2ed/",
                  "text": "I’ll take a look at both and compare, thanks for the insight!",
                  "author": "AspiraRules20",
                  "created": 1632662846,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "he8eu9o": {
      "link": "/r/college/comments/pv74il/extreme_depression/he8eu9o/",
      "text": "Some colleges have loaner laptops. Check to see if your college does.",
      "author": "Oplatki",
      "created": 1632584996,
      "upvotes": 9,
      "replies": {
        "he8sqc3": {
          "link": "/r/college/comments/pv74il/extreme_depression/he8sqc3/",
          "text": "I think so but they may not let me borrow it to use at home, and I may as well just use the public computers there. Thanks for the insight.",
          "author": "AspiraRules20",
          "created": 1632591130,
          "upvotes": 1,
          "replies": {
            "he975kj": {
              "link": "/r/college/comments/pv74il/extreme_depression/he975kj/",
              "text": "My school allows you to borrow a laptop for an entire semester, so for that semester you get to take it home. Check if your school has a similar program.",
              "author": "jensonaj",
              "created": 1632597521,
              "upvotes": 6,
              "replies": {
                "hen8iy6": {
                  "link": "/r/college/comments/pv74il/extreme_depression/hen8iy6/",
                  "text": "Wow they actually did! Thank you so much, I can use it until December which is very convenient.",
                  "author": "AspiraRules20",
                  "created": 1632864367,
                  "upvotes": 2,
                  "replies": {}
                },
                "he9gwlx": {
                  "link": "/r/college/comments/pv74il/extreme_depression/he9gwlx/",
                  "text": "I’ll check for sure, thank you for the hope and insight!",
                  "author": "AspiraRules20",
                  "created": 1632601881,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634051895
}