{
  "sid": "qsi37l",
  "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/",
  "title:": "Considering changing for Economics to history",
  "text": "I'm seriously considering changing my major from BA in Economics to a history degree. I'm just not doing well in my economics class and I don't know what I want to do after college. Is this a good idea?",
  "author": "aanuma",
  "created": 1636743302,
  "updated": 1639853998,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkd6j8p": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkd6j8p/",
      "text": "It's one of the least marketable degrees, so it's probably not a good idea, tbh.",
      "author": "HumanDrinkingTea",
      "created": 1636743562,
      "upvotes": 1,
      "replies": {
        "hkd8d42": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkd8d42/",
          "text": "Lol you think that matters??? My sister has an English degree and makes a shit ton. My buddy's brother has a engineering degree and he makes like $300 a week. WHAT you major in doesn't matter. This isn't the 80s anymore times have changed. You can make $10k a month off your phone if you know what your doing. Econ major isn't even that marketable.",
          "author": "ManufacturerNo80",
          "created": 1636744339,
          "upvotes": 1,
          "replies": {
            "hkd9i67": {
              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkd9i67/",
              "text": "Anecdotes aren't evidence. [Check this out](https://freopp.org/is-college-worth-it-a-comprehensive-return-on-investment-analysis-1b2ad17f84c8). The data suggests that your major DOES matter.",
              "author": "HumanDrinkingTea",
              "created": 1636744828,
              "upvotes": 1,
              "replies": {
                "hkda0wl": {
                  "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkda0wl/",
                  "text": "Data isn't real life lol. And how old are those charts?? People like you are the reason why the education system is so screwed up, you still think college is important based on twenty year old metrics",
                  "author": "ManufacturerNo80",
                  "created": 1636745049,
                  "upvotes": 1,
                  "replies": {
                    "hkdb4a0": {
                      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdb4a0/",
                      "text": "You're free to believe what you'd like-- I come here to give people the best advice I can, and while data isn't real life, it's a much better reflection of real life than a few anecdotal experiences. Thus, I think it's reasonable to conclude that major matters.\n\nI'll give you that the data is old, but it does have utility in the sense that it gives you an idea of long-term earnings. If you do some googling, you can find some numbers that reflect what people make straight out of school in more recent years, but I'm not going to bother since clearly you're just looking for a fight.",
                      "author": "HumanDrinkingTea",
                      "created": 1636745523,
                      "upvotes": 5,
                      "replies": {
                        "hkdchps": {
                          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdchps/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1636746114,
                          "upvotes": -2,
                          "replies": {
                            "hkdhctf": {
                              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdhctf/",
                              "text": "I agree with that completely. Success is more than just a degree, but that doesn't mean a marketable major isn't helpful. A good major certainly isn't everything, for sure, but it's a big part of helping a person get on the right track to building a career.",
                              "author": "HumanDrinkingTea",
                              "created": 1636748193,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hkdgtsq": {
              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdgtsq/",
              "text": "If your buddy's brother is making $300 a week with an engineering degree then he is an idiot lol. Sure, your sister makes a shit ton with an english degree but her job is most likely not related to her major, if it is, then it is a very scarce job.",
              "author": "M33RHARIS",
              "created": 1636747965,
              "upvotes": 13,
              "replies": {
                "hkdqpgs": {
                  "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdqpgs/",
                  "text": "No fighting guys, everyone just gets lucky lol",
                  "author": "LoreBloop",
                  "created": 1636752194,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "hkdtxeg": {
              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdtxeg/",
              "text": "Hey op don’t listen to this guy",
              "author": "Korokoso1",
              "created": 1636753602,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hkektng": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkektng/",
          "text": "That's true, I'm not sure what else to major in though...",
          "author": "aanuma",
          "created": 1636766213,
          "upvotes": 4,
          "replies": {
            "hketf3g": {
              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hketf3g/",
              "text": "You should really go to the on campus resources to talk about and explore different majors.",
              "author": "whopperlover17",
              "created": 1636770448,
              "upvotes": 5,
              "replies": {
                "hkgebrv": {
                  "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkgebrv/",
                  "text": "This is not to say they will magically find you a fantastic career, but you have to figure out fast what kind of work you can do. Maybe go work for a bank but these campus resources will help you start to realize that, with Econ or history, you have to figure out where you will work after graduation. There are limits bc you have to start working to find out which areas you do really well with but you won’t ever have access to free career counseling after college. Like I said, they are marginally useful and understaffed but it’s a resource you won’t have after graduation. And all those student fees pay for it, so you are paying for it already. Utilize it. Researching for a museum or similar are really hard to get. They go to PhDs and there are hundreds of PhDs for every position. Middle or HS history teacher would be most reliable job.",
                  "author": "Dorothy_Day",
                  "created": 1636810498,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hkfhlbw": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfhlbw/",
          "text": "Not true",
          "author": "SpartanElitism",
          "created": 1636784235,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkdxc1z": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdxc1z/",
      "text": "If you know you want to do history, dig into career research early and figure out how to get to where you want to get. Public Historians that work for governments, agencies, and non-profits can do alright.",
      "author": "zifmer",
      "created": 1636755119,
      "upvotes": 55,
      "replies": {
        "hke7awj": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hke7awj/",
          "text": "Exactly, you have to do your research.",
          "author": "theamateurhistorian1",
          "created": 1636759688,
          "upvotes": 11,
          "replies": {}
        },
        "hkfhiny": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfhiny/",
          "text": "History major here. The major is way more versatile than many give it credit for. Any job requiring analytics will like it",
          "author": "SpartanElitism",
          "created": 1636784182,
          "upvotes": 10,
          "replies": {
            "hkh52mx": {
              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkh52mx/",
              "text": "Also a history major here, I second this comment.",
              "author": "theamateurhistorian1",
              "created": 1636823353,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hkeknsr": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkeknsr/",
          "text": "I would work for a government or non profit.",
          "author": "aanuma",
          "created": 1636766132,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hkefdkb": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkefdkb/",
      "text": "You might consider pairing a History major with a more technical minor to give you a mix of skills. Maybe minor in something like technical writing, computer science, or digital media.",
      "author": "pinkribbonskies",
      "created": 1636763528,
      "upvotes": 23,
      "replies": {
        "hkekphc": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkekphc/",
          "text": "I would do this.",
          "author": "aanuma",
          "created": 1636766155,
          "upvotes": 9,
          "replies": {}
        },
        "hkjij6a": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkjij6a/",
          "text": "I’m personally pairing it with geography. My idea is that I can use GIS (essentially a way to layer data onto maps and analysis it), and information about development in many government or non-profit gigs. Of course ymmv, but for me it is a way to align some of my different interests.",
          "author": "Katherington",
          "created": 1636860637,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkfipeh": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfipeh/",
      "text": "I highly disagree with most of the comments here - if you end up switching to History it will not necessarily dictate your future career goals. I say switch to History if you both enjoy it and do well in it, and if you're still feeling insecure about your major then, then add on a double major or minor in another complementary field.\n\nHistory teaches you how to critically think, read, and write, skills widely applicable to a number of careers. Just with any other major, you'll need to put work into it - take advantage of the opportunities your school offers in it to strengthen your skills and CV, or alternatively market yourself with your History skills for other kinds of positions. \n\nI myself am now pursuing a PhD in History, but I know others who've gone into law school, teaching, government consulting, and other careers not directly related to the subject. If History is interesting to you and you're doing well in it, by all means switch to it. Just make sure to acquire additional experience along the way, which is of course the case for any major. \n\nSee [this page](https://www.historians.org/teaching-and-learning/why-study-history/careers-for-history-majors) curated by the American Historical Association for articles that practically break down the benefits of majoring in History and [this article](https://www.historians.org/publications-and-directories/perspectives-on-history/april-2017/history-is-not-a-useless-major-fighting-myths-with-data) that addresses the statistics of History major employment.",
      "author": "VeteranPendragon",
      "created": 1636785035,
      "upvotes": 9,
      "replies": {
        "hkfnfsg": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfnfsg/",
          "text": ">~~History~~ College teaches you how to critically think, read, and write,\n\nfixed that for you.",
          "author": "wobbletelescope",
          "created": 1636788700,
          "upvotes": 2,
          "replies": {
            "hkh4p1s": {
              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkh4p1s/",
              "text": "It doesn't sound like you disagreed with what most comments said, it sounds like you re-worded what most people, like myself have been saying.",
              "author": "theamateurhistorian1",
              "created": 1636823195,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkdxeav": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdxeav/",
      "text": "Don’t major in history unless you are going pre law, want to be a history teacher, do some sort of research, or work in a museum",
      "author": "Warfys",
      "created": 1636755147,
      "upvotes": 35,
      "replies": {
        "hkeklf6": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkeklf6/",
          "text": "I'm open to doing research...",
          "author": "aanuma",
          "created": 1636766100,
          "upvotes": 7,
          "replies": {
            "hkenqiw": {
              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkenqiw/",
              "text": "Well so be it as long as you’re happy with making barely a living wage",
              "author": "Warfys",
              "created": 1636767655,
              "upvotes": -14,
              "replies": {
                "hkenzsr": {
                  "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkenzsr/",
                  "text": "There's no need to be negative or try to scare them away. If you do your research and pursue what you wanna do hard enough that you can make good money. Especially if you go for a masters degree and PhD programs. No doubt the wages at the beginning are laughable.",
                  "author": "theamateurhistorian1",
                  "created": 1636767784,
                  "upvotes": 24,
                  "replies": {
                    "hkgg4f4": {
                      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkgg4f4/",
                      "text": "A masters or PhD doesn't mean you're going to make money. \n\nFinancially, it's undisputable that you'd be better off with an Econ degree than a history degree. \n\nWe can all just pretend that u/Warfys was being malicious, or we could actually accept that maybe he's actually right.",
                      "author": "Awkward_Mail_2786",
                      "created": 1636811555,
                      "upvotes": 4,
                      "replies": {
                        "hkh7bls": {
                          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkh7bls/",
                          "text": "Nobody was saying that an Econ degree won't grant you a better salary...\n\nAlso, a MD and/ or PhD, Depending on the field and employer, does mean you are going to make more money than you did without. (Note I said Depending on the field and employer).\n\nLastly, Nobody is accusing anybody of being malicious, we are all just civily discussing college degrees. While an Econ degree with undoubtedly make you more financially stable in life, money isn't everything. OP said they aren't doing well in their classes rn, sure it could just be tougher classes but you have to think about the degree that they picked over Econ, that means they probably enjoy doing and/ or can see themselves in a career related to that field in the future. OP said he'd probably wanna work for or with a government, a history degree is perfect for that, literally perfect. A American history professor here at my University only began teaching after about 40 years of fieldwork, military contracting, and lower level government contracting. I'm not trying to argue that an Econ degree isn't the way to go for everyone, if you love Econ than that's would you should do and don't let anyone tell you otherwise, but if you really love something, for myself it's Ancient History, then you should try your best to make a career out of it so everyday of you're working your dream job. With that being said, if OP really just wants to make money and doesn't really have a love for history or anything, a history degree is a slow burn, you will have to work very hard and long, most likely, to make what is considered good money.\n\nOP, go to your student advisor, that is literally what they are there to help you with. Your advisor can help you find a career path, give you more information about majors , and also tell you whether or not all of this Is a good idea or not.",
                          "author": "theamateurhistorian1",
                          "created": 1636824297,
                          "upvotes": 2,
                          "replies": {
                            "hkl4ca6": {
                              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkl4ca6/",
                              "text": "I still think that the prospects on a history degree would be abysmal. It's cool that you can love it and go into it and hopefully get into jobs but from what I've heard, history degrees aren't exactly the most useful for businesses. \n\nI know you keep mentioning how money isn't everything but it sure is something. Living on a low wage fucking sucks. Just enough to pay the bills and go to work the next day. An average wage is around 55k for History majors. Considering getting the degree could rack up probably about that much money in loans, it'd be hard to see the return on investment. 55k is okay money, it's definitely not great. With a partner making about the same you can live comfortably but nothing extravagant. You'd be able to build a savings very slowly but unexpected housing expenses would hurt pretty bad.\n\nIf you really really love it, go for it. Just know that you're not doing it for money and probably won't be able to get rich doing it no matter how hard you try. I think it's important to talk about how it won't pay off as well as other majors. Econ has about the same average but can cover more industries. I have a feeling climbing the corporate ladder with an econ degree would be easier than a history degree.\n\nI'm going to have to say, that the longer I make this post, the more I think that money is a large portion of 'everything'. It sure would make it easier to live. On more money, I can pay some poor sap to mow my lawn and change my engine oil. Hell, I could even pay somebody to clean my house for me. You won't be able to afford that on 55k a year.",
                              "author": "Awkward_Mail_2786",
                              "created": 1636897176,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "hkeo48t": {
                      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkeo48t/",
                      "text": "It’s realistic, I was a history major myself before realizing. Obviously if you have an md or phd it gets better, but that’s a possible 6y+ commitment to make decent money",
                      "author": "Warfys",
                      "created": 1636767845,
                      "upvotes": 9,
                      "replies": {
                        "hkeoqkf": {
                          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkeoqkf/",
                          "text": "Yeah, you are not wrong at all, don't get me wrong. I just feel that we shouldn't discourage them from pursuing what they want to do, and I love they are committed to it and they really like what they do than honestly making a lot of money isn't that big of a deal. Granted studying for an additional 6+ years with little money will be difficult. But if you enjoy your studies and make the most of the experience than it is worth it, impo. Also if you are able to do higher education such as MD and PhD in Europe or something it would be exponentially cheaper.",
                          "author": "theamateurhistorian1",
                          "created": 1636768155,
                          "upvotes": 12,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hke763p": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hke763p/",
          "text": "I agree",
          "author": "theamateurhistorian1",
          "created": 1636759626,
          "upvotes": 2,
          "replies": {}
        },
        "hkfhk24": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfhk24/",
          "text": "Nah, it’s more versatile",
          "author": "SpartanElitism",
          "created": 1636784210,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkds3us": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkds3us/",
      "text": "It really depends on what you plan to do with a history degree, there a a plethora of job opportunities but you just have to look for them. Archivists are always needed from what I hear but personally what I plan to do with my degree is eventually get to archeology.",
      "author": "theamateurhistorian1",
      "created": 1636752802,
      "upvotes": 13,
      "replies": {}
    },
    "hkdrati": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkdrati/",
      "text": "My dad got a history degree because it was “easy.” He just bought a house for 320k and makes a decent living. Just work for a bank after college lol",
      "author": "Away_Peak_5054",
      "created": 1636752448,
      "upvotes": 17,
      "replies": {
        "hkgi94p": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkgi94p/",
          "text": "This, I have two friends that got into banking with a history  degree",
          "author": "soykenito",
          "created": 1636812726,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkfmyxi": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfmyxi/",
      "text": "Tbh it kinda depends on what you wanna do and what career path u want, like economics can basically get any job in business, what would u want to do with history? just think about that and also there are other business majors like marketing, business admin, HR, etc if you’re interested!",
      "author": "kashmiri-chai",
      "created": 1636788320,
      "upvotes": 3,
      "replies": {}
    },
    "hkh2m4u": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkh2m4u/",
      "text": "As an econ major myself, I find either you get it or you don't. There's no in between. If you think you can't get it then switch. Just my humble opinion though.",
      "author": "LimpIndie",
      "created": 1636822306,
      "upvotes": 3,
      "replies": {
        "hmgo5ha": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hmgo5ha/",
          "text": "Yeah I agree with this...",
          "author": "aanuma",
          "created": 1638142015,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkfnfh2": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfnfh2/",
      "text": "How bad are you doing in economics? Maybe you could take some tutorial classes to catch up. If you like economics I wouldn't advice you to leave to take up history. Also college is hard. You won't do as well as you did in school. You just need to pick yourself up again and again instead of accepting defeat. This is coming from someone who was on the same boat as you. I stuck to economics and now I am doing master's in the same field.",
      "author": "android0698",
      "created": 1636788693,
      "upvotes": 2,
      "replies": {}
    },
    "hkgvii8": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkgvii8/",
      "text": "You might not be doing well in your Econ class, but do you like it?\n\nEcon student here. It can be frustrating some times, just as learning any other thing. Your technical knowledge will improve as you go on, but if you don’t like it there’s nothing to do. I’m just saying you shouldn’t give up IF you like it. \n\nNow, it your decision has been made, then go for history. I personally think historians are so cool.",
      "author": "ElasticGood",
      "created": 1636819213,
      "upvotes": 2,
      "replies": {}
    },
    "hkesgmk": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkesgmk/",
      "text": "I would take a break from college if you don’t know what you want to do after you’re done. What’s the point in going if you don’t know what you want for a career?",
      "author": "NeedsMoreJava",
      "created": 1636769977,
      "upvotes": 6,
      "replies": {}
    },
    "hkec3g7": {
      "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkec3g7/",
      "text": "Nice! The guy who delivers my Amazon packages also has a history degree!",
      "author": "Bathmate99",
      "created": 1636761965,
      "upvotes": -11,
      "replies": {
        "hkfg0jz": {
          "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfg0jz/",
          "text": "What did you get your degree in? Maybe help OP out a little more",
          "author": "_vino_three",
          "created": 1636783117,
          "upvotes": 1,
          "replies": {
            "hkfghm1": {
              "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfghm1/",
              "text": "[removed]",
              "author": null,
              "created": 1636783445,
              "upvotes": -7,
              "replies": {
                "hkfgqpe": {
                  "link": "/r/college/comments/qsi37l/considering_changing_for_economics_to_history/hkfgqpe/",
                  "text": "You still never said what your degree was/ is",
                  "author": "_vino_three",
                  "created": 1636783620,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}