{
  "sid": "qgosxm",
  "link": "/r/college/comments/qgosxm/should_i_take_a_semester_off_from_college/",
  "title:": "Should I take a semester off from college?",
  "text": "(I don’t have the best writing/grammar so bare with me🥲) So I (f20) am a sophomore in college and have recently come to a point where I feel I have one of two options. 1) Take a semester off to figure things out and save up my money or 2) Continue on next semester but face having the possibility of taking an extra semester. \n\nI have come to those conclusions is for the reasons as follows:\n\n- I’m currently majoring in Plant Science (I just switched last week and this is my fourth time switching my major) but I am honestly not so sure that’s what I want to do as a career. I chose this major because I do enjoy learning about plants but when it comes to biology and the gritty science of it I’m not so sure about it. Im also at the point where I have taken almost all of the General educations class required for my college and the major of my class from now on will be major-specific and so if I decide Plant Sciences is not for me after next semester it will more than likely result in having to take an extra semester. \n\n- I do not live close to my school (about 45 mins) and I already struggle with getting to school on time as well as finding the motivation to go (Online classes really screwed me with starting college not being on campus so now I view being on campus as a waste of time since I’m to just getting my work done at home in half the amount of time). The way my classes are going to be structured next semester (according to my advisor) I would have to be on campus M-F which I typically try to avoid. I plan on moving this summer closer to school after my bf and I save enough money to move out of our current living space which we live in for free. \n\n- Lastly I have not been in a good mental state (anxiety and depression related) as of late and it has become really hard to do well in my classes and I am afraid that if I take more courses next semester and am still not in a good state it will affect my grades and ultimately lower my gps\n\nOne other important piece of info is that I am extremely lucky to have my parents split the cost of my tuition (which is ~$4,200 a year after scholarships). But I have a younger sister who would be entering college at the same and my mom has expressed it would be hard to fund both of us at the same time. Which I understand but it could put me in a difficult situation paying for that semester that overlaps my sister’s.\n\nOfc I am well aware it is very hard to go back to school and have talked to friends and family about this issue but have gotten conflicting opinions so I thought I’d ask you lovely people you opinions!",
  "author": "aubreynorton",
  "created": 1635310175,
  "updated": 1635457105,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {}
}