{
  "sid": "re2fp3",
  "link": "/r/college/comments/re2fp3/dear_college_students_who_are_having_difficulty/",
  "title:": "Dear college students who are having difficulty finding literature for their thesis, ...",
  "text": "If you cannot afford to buy the articles from JSTOR or want to have better alternatives for your research, **I highly recommend you e-mail the authors of the article(s) you need so much.**  \n\n\nAs a fourth-year college student who lives in a developing country without a credit card to buy 5-pages of information, it is an extreme burden to buy from JSTOR. However, e-mailing authors is your best savior for your thesis or researches. In my case, I need to get at least 25 pieces of literature before Monday, and I'm currently at 18 right now. If you need help finding the author's e-mail (s), you can look it up via Google or research websites. I sent e-mails to the 7+ authors for their articles, and most of them replied with their articles in it.  \n\n\nRemember to be professional when sending e-mails to the author. Some authors might ignore them if you don't send them formally—putting a \"Dear\" with your name in it, a statutory greeting, and concluding remarks such as \"Sincerely,\" or \"Best regards,\" with your name after. Don't expect some authors to reply immediately. Be patient as some authors live in different time zones, but they will read the e-mails afterward.  \n\n\nI hope it will help future scholars and academes.",
  "author": "RichieOfTheSultanate",
  "created": 1639237718,
  "updated": 1639516581,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "ho4thdt": {
      "link": "/r/college/comments/re2fp3/dear_college_students_who_are_having_difficulty/ho4thdt/",
      "text": "To add to this, you can also find a lot of papers on ResearchGate!",
      "author": "PhDapper",
      "created": 1639238796,
      "upvotes": 4,
      "replies": {
        "hob1lxo": {
          "link": "/r/college/comments/re2fp3/dear_college_students_who_are_having_difficulty/hob1lxo/",
          "text": "And Google Scholar! There will often be a direct link to a PDF right there on the search results page, or under \"See all versions.\"\n\nAs a scientist who publishes in journals, please folks, never ever ever pay to access a paper! You can almost always find it elsewhere, and if not, any author will be happy to send you a copy. (Note this only applies to journal articles. I don't recommend asking for a book PDF. We don't get paid for journal articles, but book royalties are a thing.)",
          "author": "puzzlealbatross",
          "created": 1639349208,
          "upvotes": 2,
          "replies": {}
        },
        "ho4z3pj": {
          "link": "/r/college/comments/re2fp3/dear_college_students_who_are_having_difficulty/ho4z3pj/",
          "text": "As a frequent visitor of ResearchGate, there are a few but significant downsides. Some articles need to \"Request full-text\" for full access and download. There are instances when authors don't look at the ResearchGate but instead on their e-mail.",
          "author": "RichieOfTheSultanate",
          "created": 1639241205,
          "upvotes": 1,
          "replies": {
            "ho523bo": {
              "link": "/r/college/comments/re2fp3/dear_college_students_who_are_having_difficulty/ho523bo/",
              "text": "Yeah, that sometimes happens. I maintain my account and try to respond quickly when I get those requests, but some folks don’t.",
              "author": "PhDapper",
              "created": 1639242435,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho4z4nn": {
      "link": "/r/college/comments/re2fp3/dear_college_students_who_are_having_difficulty/ho4z4nn/",
      "text": "Before contacting the authors, please also check with your school's library to see what the options are. Many schools have something called \"Interlibrary Loan\". If your school doesn't have access to an article, they will request it from another school who does. The file will be sent to your school and you'll get access.\n\nIt does take a while (sometimes up to weeks, although I've also received requests within the hour) and it isn't always successful. It also might be a primarily US thing. I've been to multiple universities in the US who participate, but I'm not sure what it's like worldwide.",
      "author": "emchops",
      "created": 1639241215,
      "upvotes": 3,
      "replies": {}
    },
    "ho73s2s": {
      "link": "/r/college/comments/re2fp3/dear_college_students_who_are_having_difficulty/ho73s2s/",
      "text": "Guys please email us if what you want is not available through your institution. We often have to pay to make our stuff open access and we hate it as much as you do. Besides, it strokes our ego.",
      "author": "DontFeartheTeacher",
      "created": 1639275449,
      "upvotes": 2,
      "replies": {}
    }
  }
}