{
  "sid": "r1tn3d",
  "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/",
  "title:": "It’s hard to watch my gf suffer with job search.",
  "text": "Hey y’all, I just need some advice regarding new grad job search so if you can hear me out, I’d appreciate it much. \n\nMe and my gf are both graduating seniors for next summer. I already have a job lined up, but for her, who’s a MIS major international student, things are tough and she’s not getting any phone screening requests. She’s trying her best right now by cold messaging recruiters and alumni in at different companies, but I can sense that she’s an inch away from having a mental breakdown. Her friends and myself landing a job offer is only making her more anxious. I’m pretty confident that her resume is ok; we got it checked by multiple alumni and professors at our university. Right now, she’s mainly looking for a new grad PM or BA positions. Having said that, how late is too late? Can she still find a job next semester that sponsors OPT? How can I comfort her a bit better?",
  "author": "thisGuyCodes",
  "created": 1637835931,
  "updated": 1639860936,
  "over_18": false,
  "upvotes": 30,
  "upvote_ratio": 0.97,
  "comments": {
    "hm0rc9g": {
      "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm0rc9g/",
      "text": "If she is the one, then just let her know you will be there for her and support her. Make her smile and happy. Finding a job in a competitive field temporarily for myself is complete BS but i could not have made it this far without my supportive partner. She always tells me i am doing great and shows appreciation when i clean, make dinner, bath the pets and etc. She would rather support us than to have me work as a waiter or anything below a college degree and prefers that i continue studying for medical school. \nIn conclusion, be like that. She will still be down, but not as much with a supportive partner.",
      "author": "TheOGGizmo",
      "created": 1637836357,
      "upvotes": 19,
      "replies": {
        "hm0s3c8": {
          "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm0s3c8/",
          "text": "Thanks for your comment. Unfortunately, there’s a little more to it than just making her happy. Because she’s international, if she fail to land a job offer after graduation, she has to go back to her home country. I really don’t want things to go this way so I’m trying my best to help her",
          "author": "thisGuyCodes",
          "created": 1637836983,
          "upvotes": 9,
          "replies": {
            "hm0wyax": {
              "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm0wyax/",
              "text": "If you really want to help then marry her so she doesn’t have to leave. It takes a year i believe. Other than that, theres nothing you can do.",
              "author": "TheOGGizmo",
              "created": 1637840963,
              "upvotes": 12,
              "replies": {
                "hm1ef68": {
                  "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm1ef68/",
                  "text": "Seconded. u/thisGuyCodes now's the time to decide if you want to spend the rest of your life with your current girlfriend. Don't marry her just so she can stay in the country; in the US that is considered \"marriage fraud\" and you & her may then be in legal trouble.",
                  "author": "Comprehensive-Ad3963",
                  "created": 1637851584,
                  "upvotes": 10,
                  "replies": {
                    "hm1hvr4": {
                      "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm1hvr4/",
                      "text": "Thank you guys for your comments!",
                      "author": "thisGuyCodes",
                      "created": 1637853250,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hm16phb": {
      "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm16phb/",
      "text": "[deleted]",
      "author": null,
      "created": 1637847513,
      "upvotes": 3,
      "replies": {
        "hm67c5a": {
          "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm67c5a/",
          "text": "Thanks. I haven’t heard of the contractor position option; do a lot of companies have this? Do we find this the same way we find our usual job postings?",
          "author": "thisGuyCodes",
          "created": 1637945935,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm1l6tg": {
      "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm1l6tg/",
      "text": "Is she leveraging LinkedIn? That would let her see how active someone is before messaging them, and hopefully give her a higher success rate. Also, you can follow people who have experienced the same thing. There's someone in my network, Basant Shenouda who probably would have done great advice. And lastly, when she messages alumni, have her ask for an informational interview. We all know that means they're going for a referral, but it also shows they're willing to sit down and talk for 30 minutes first, and let you make an evaluation.",
      "author": "Thelton26",
      "created": 1637854775,
      "upvotes": 3,
      "replies": {
        "hm67kah": {
          "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm67kah/",
          "text": "Yup, she’s been scheduling meetings with the people Who graduated from our univ and has been asking for referrals. I thought getting a referral would at least give her a chance to interview but I was way off",
          "author": "thisGuyCodes",
          "created": 1637946032,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm33tj2": {
      "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm33tj2/",
      "text": "Is she a part of Beta Alpha Psi? Or another similar club? If not she should definitely join a club that helps with job recruitment for MIS. The MIS department head will know what job opportunities are available so she should reach out to them. Network on LinkedIn!!!! Networking is huge.",
      "author": "Cerenya",
      "created": 1637878764,
      "upvotes": 3,
      "replies": {
        "hm67yve": {
          "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm67yve/",
          "text": "Dang if this was like one or two years ago I’d told her to look into Greek orgs. Now that we’re a semester away from graduation I think it’s too late lol. She’s been networking on LinkedIn for sure so hopefully that helps someday",
          "author": "thisGuyCodes",
          "created": 1637946204,
          "upvotes": 1,
          "replies": {
            "hmmzsay": {
              "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hmmzsay/",
              "text": "Yeah if she only has one semester left it is too late unfortunately for Beta Alpha Psi, they require at least 2 semesters. However, her school might have just a basic MIS/Accounting club that doesnt require multiple semesters to join.",
              "author": "Cerenya",
              "created": 1638257744,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hm4zlfm": {
      "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm4zlfm/",
      "text": "To be honest, most graduates have encountered this problem. I graduated last summer and started looking for a job. After countless interviews, I found an education-related job. I understand your girlfriend's anxiety. You can accompany your\ngirlfriend to find a job in free time. Being with you is more important than anything else. Make her feel that you care about her. Finally, wish your girlfriend find a good job.",
      "author": "Ok-Permit6975",
      "created": 1637918855,
      "upvotes": 2,
      "replies": {
        "hm68fd0": {
          "link": "/r/college/comments/r1tn3d/its_hard_to_watch_my_gf_suffer_with_job_search/hm68fd0/",
          "text": "Thanks for the comment!",
          "author": "thisGuyCodes",
          "created": 1637946402,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}