{
  "sid": "qpaes5",
  "link": "/r/college/comments/qpaes5/heating_in_the_room/",
  "title:": "Heating in the room",
  "text": "I live in a small room shared with 2 others. It just so happens that both of them are international from china and we are in california, completely different weather. They always find it extremely cold in the room where im always sweating from how hot i find it. I tried helping the situation by buying a mini- fan that clips on to the side of my bed so that im the onlyone who gets air and they stay warm. However, they turn on the heater making the room filled with warm air rendering my fan useless. I already told them and i turn off the heater whenever i see it on, but they keep turning it on when i turn my back. Might i also add that they wear basketball shorts and undershirt/shirtless. I talked with the RA but do to rules, since it’s technically 2 v 1, he cant do anything to help me. What should i do?",
  "author": "edgar_torres55",
  "created": 1636365458,
  "updated": 1636655397,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjvmz2s": {
      "link": "/r/college/comments/qpaes5/heating_in_the_room/hjvmz2s/",
      "text": "i’m in a very similar situation where 3/5 roommates in my apartment like it at 60° and i like a moderate 73°. my nose, fingers, and toes are literally ice cold and they always lower it when i put it in the middle of the temps mentioned above. on top of that, being bundled up in multiple layers + blankets is so uncomfortable to me so not only am i freezing, but also bundled \n\nbut the semester is almost over so hopefully we can both tough it out until then",
      "author": "bandtrash_ands",
      "created": 1636420501,
      "upvotes": 2,
      "replies": {
        "hjvzr40": {
          "link": "/r/college/comments/qpaes5/heating_in_the_room/hjvzr40/",
          "text": "See, 73 is reasonable, since my room is super small, it gets to 80+ inside",
          "author": "edgar_torres55",
          "created": 1636426233,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}