{
  "sid": "rb2ti3",
  "link": "/r/college/comments/rb2ti3/how_can_i_tell_if_my_roommate_is_not_doing_well/",
  "title:": "How Can I Tell If My Roommate is Not Doing Well or Just Really Lazy?",
  "text": "I know I shouldn't put any of my roommate's responsibility on myself, so this question is more out of curiosity and concern than anything else. I was wondering if anyone else has had any similar experiences and what came of them just in case there are any warning signs. For anonymity, let's call him Dave. \n\nDave stays in the dorm pretty much all day, usually sleeping. I'd say he spends 65%-70% of his day in bed with interesting behavior. He always gets up, sits up in bed, looks around the room for like 3 min straight, almost like he's gone lucid, and then just goes back to sleep. He even wakes up, opens up the blinds, and then immediately falls back to sleep. He always sets a chain of alarms, but always goes back to sleep when they go off. When he finally gets up, it's usually mid-afternoon. He's been sleeping through classes more often, saying \"I just don't really feel like it\" when we've waked him to mention he has class soon. We've had two occasions where people he was working with on group projects have knocked on our door and basically confronted him to do his part of the work. He's not in any extra-curriculars, either. \n\nHe's easily the least social of us three (i have another roommate, who's also concerned). He brought his PC to our dorm and spends most of his social time with online friends he knows from back home, playing games for roughly two hours a day. \n\nI assumed he was depressed, but I talked to my RA about it and he's told me that after some investigation by talking to other people who know Dave, it seems like more of a really bad habit. Funny enough, Dave eavesdropped on me and my other roommate expressing our worry with each other. Later in the day, he admitted that he heard us and politely said that there's no need for concern, basically saying the same thing my RA said, that it was a bad habit gone out of control. He's also mentioned once how his anxiety meds have given him really strange dreams and abnormal sleep patterns, so maybe there's something in that. \n\nAnother important fact is that he doesn't sleep at night, which might also dispel the possibility of depression. Just from waking up in the middle of the night, I've gathered that he quietly sits in bed on his laptop until around 4 in the morning. That's been getting worse though. He's staying up till 7 more often, basically converting into a full-on night owl. \n\nMaybe I'm overthinking all this. I was kinda raised to see this behavior as signs of something worse underneath. None of Dave's behavior is intruding on my privacy or overall dorm life. So just as a bystander, I wanted input from people with similar experiences. Thanks.",
  "author": "baineavent",
  "created": 1638894613,
  "updated": 1639517338,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hnmdvd7": {
      "link": "/r/college/comments/rb2ti3/how_can_i_tell_if_my_roommate_is_not_doing_well/hnmdvd7/",
      "text": "It’s certainly possible that he’s depressed, but given that he and others have said it’s just bad habits, I’d say that’s the more likely option. In my opinion, the best thing you can do for him is ask if he wants to break the habits, and if there’s anything you can do to support him in that. That could mean waking him up, reminding him to go to sleep, helping him figure out a time management system, etc. I don’t advise doing any of those things unless he specifically asks you too though.\n\nAnd of course, you’re not obligated to do any of that, I’m just saying that if you want to help him, I think that’s what would be best.",
      "author": "when-words-fail",
      "created": 1638901664,
      "upvotes": 5,
      "replies": {}
    },
    "hnmwqtx": {
      "link": "/r/college/comments/rb2ti3/how_can_i_tell_if_my_roommate_is_not_doing_well/hnmwqtx/",
      "text": "Could be an undiagnosed mental health issue but it’s really not your place to intervene. The only thing you can do is encourage them to seek help even if it is just laziness. Maybe encourage them to sleep when you sleep, I wouldn’t say it would be okay to wake him up he does deserve respect and agency over his own life. It’s for sure an uncomfortable situation to be around someone so far removed from societies rhythms.",
      "author": "BlueOcean7987",
      "created": 1638909787,
      "upvotes": 4,
      "replies": {}
    },
    "hnmu7fk": {
      "link": "/r/college/comments/rb2ti3/how_can_i_tell_if_my_roommate_is_not_doing_well/hnmu7fk/",
      "text": "Just because he says its not depression/anxiety doesn’t mean it can’t be. A lot of people are not willing to get help immediately and won’t admit that they need it. \n\nWho knows? Maybe it’s ADHD instead (there are lots of overlapping symptoms). Struggling to regulate sleep is a big part of that. Maybe he’s not depressed anymore necessarily, but has resigned to failing this semester and is over it and just doing what he enjoys until it ends.",
      "author": "tpfang56",
      "created": 1638908712,
      "upvotes": 3,
      "replies": {}
    }
  }
}