{
  "sid": "psjed2",
  "link": "/r/college/comments/psjed2/a_guide_to_free_speech_oncampus/",
  "title:": "A Guide to Free Speech On-Campus",
  "text": "I have had the pleasure of working on college campuses in a number of capacities for a number of years. I even got my masters degree in higher education. Something that has been contentious at almost every university I have worked at is free speech. Who has it? Where? What about hate speech? \nThis post is meant to be an informative one about the fundamentals of free speech on campus. If you don't find it interesting, no worries of course! Just figured some of you may find this informative. \n\nFreedom of expression for students is protected mainly by the First Amendment, but may also be protected by the institution’s own bill of rights. Tinker v Des Moines ensured students have a right to freedom of expression, which was first applied to secondary, then applied to postsecondary\n\nA tough legal question that is then asked: to what extent do private individuals have a first amendment right of access to government property for purposes of expressive activity?\nThe basic question is whether the property is “forum” property; some but not all government property will fit this qualifier.\n\nThree categories of forum property: the traditional public forum, the designated public forum, and the nonpublic forum.\n\nPublic forum: Parks, public streets, and town squares\n\nDesignated public forum: Government property with public bulletin boards, space in print publications, or spaces physically made for speeches. The government can limit who accesses these (I.e., only students)\n\nNonpublic forum: Only open to selected speakers on an individual basis. \n\nThe problem in prohibiting or punishing disruptive protests is determine when the activity has become sufficiently disruptive. \nShamloo v Mississippi State Board of Trustees was a case where two Iranian students were participating in on-campus demonstration supporting an Iranian regime. Students were disciplined but the courts ruled that they were not disrupting anyone enough to warrant that punishment. \n\nWhen determining whether or not a disruption is taking place, it needs to be determined who is causing this: the onlookers reacting to the protestors or the protestors themselves. The mere possibility of violence is not enough to warrant restricting free speech. When the onlookers create the problem, they must be approached first, not the protester \n\nWard v Rock Against Racism determined that  time, place, and manner regulations may be placed on public forum zones to serve the government’s legitimate, content neutral interests but need not be the least restrictive or least intrusive means of doing so.” \n\nPamphlets that are posted on public forums, receive strong first amendment protections \nTrying to regulate who can post what, by trying to have all content be approved before being posted, can be content-neutral IF equally applied. Sometimes it isn’t however, and it becomes a content approval issue, rather than a mere administrative one. \nClassrooms are generally not considered public forum, so if someone disrupts class enough, their rights do not outweigh the institutions rights. \n\nNow, for hate speech things get a little dicier. If hate speech is combined with a non speech element, you can limit that non speech element. If a swastika is carved onto a door, the swastika is free speech, but damaging the door is a violation. \nInstitutions can regulate the time and place hate speech may occur, as long as it is impartial.\n\nInstitutions can regulate content that is considered a “true threat” which is a serious commitment to harm individuals or groups of people in their vicinity\nInstitutions can regulate hate speech that is projected onto private areas\nInstitutions can regulate hate speech that furthers a scheme of racial or other discrimination. Posting a “no blacks allowed here” in front of a frat house is considered discrimination. \n\nI know that it was a long read and felt disjointed at parts, but hopefully this helps explain what first amendment rights look like on a college campus. My descriptions were a little rudimentary and I have more depth I could go into on most of these topics, but nonetheless hopefully you found something interesting for your own research or rights on-campus!",
  "author": "Cosmicmix",
  "created": 1632233103,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {},
  "updated": 1634050560
}