{
  "sid": "qxus57",
  "link": "/r/college/comments/qxus57/anyone_else_feel_like_its_so_much_harder_to_get/",
  "title:": "Anyone else feel like it’s so much harder to get good grades in college?",
  "text": "For context, I’m a freshman at a stem heavy T20. \nI know I haven’t gotten lazier. I still put in so many hours studying for tests (my last exam I studied for 20+ hours), yet I can’t ever get above a B in any of my stem class exams. Even my language class, which is like my forte (my professor even said I have a “gift” for languages, always got 99-100 in HS), I’m just barely at an A. I seriously don’t get how all these people graduate with 4.0 GPAs.",
  "author": "cigarettedaydreams27",
  "created": 1637372429,
  "updated": 1637689537,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.7,
  "comments": {
    "hlc758e": {
      "link": "/r/college/comments/qxus57/anyone_else_feel_like_its_so_much_harder_to_get/hlc758e/",
      "text": "B’s get degrees. You’re going to drive yourself crazy if you chase high school grades in college. \n\nI’m convinced people who have 4.0’s in college must study every second of the day. (Which go ahead and do that if that’s your goal but I think most people would agree is not worth it to put in so much time). Just do what you can and get through college. Nobody is going to care about what grade you got in your language class as long as you get that degree.",
      "author": "FloweryFields_",
      "created": 1637374881,
      "upvotes": 13,
      "replies": {
        "hlcbsc4": {
          "link": "/r/college/comments/qxus57/anyone_else_feel_like_its_so_much_harder_to_get/hlcbsc4/",
          "text": "it was supposed to raise my gpa though (its 4 credits) :(. or at least offset my expected B- in lin alg and oop/java",
          "author": "cigarettedaydreams27",
          "created": 1637377192,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlddju2": {
      "link": "/r/college/comments/qxus57/anyone_else_feel_like_its_so_much_harder_to_get/hlddju2/",
      "text": "it's because of rigor. if you attended some community college or university with an 85% admit rate, you would probably still be getting 99-100 in every class. at those schools they have to make the classes easier or else entire classes will fail and the graduation rate would be in the gutter.\n\nrigor is good. it means your grade represents the highest academic achievement. if you have easy math test, the best student and average student will both have high grades on easy test. But on harder test, the best student will have high grade on hard test.\n\nBad students like easier classes because they think it helps them blend in with good students. Good students like harder classes because they can better showcase their academic achievement and learn the concepts more in depth. Of course this doesn't mean you should settle for B grade, your current feeling is *ambition*, a good thing.",
      "author": "wobbletelescope",
      "created": 1637403639,
      "upvotes": 0,
      "replies": {}
    }
  }
}