{
  "sid": "qa38zp",
  "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/",
  "title:": "Do I just need to buckle down and stick to my economics major?",
  "text": "TL;DR: As a freshman I took a couple of economics courses, didn't like them/wasn't interested so this year as a sophomore I pressed pause on my economics major to explore others, found global/international studies which I am taking a class in and find far more interesting but got nervous about its marketability and am now in a tailspin trying to figure out if I should make the switch, switch but not to global/international studies, pick up a minor/certificate, just continue with economics, or if the experience I end up getting is more important and I should stop stressing about my major.\n\n\nLike many I am struggling with my major and the fear of wasting my college years. Early on I got conflicting advice from people who said not to go to college if I didn't know what I wanted to do but also not going/waiting to go wasn't an option because it'd be harder to go if I took a gap year, I need a degree, etc, etc, and initially this wasn't a problem because I thought my economics major would work out but it isn't going like I thought it would so here I am in my sophomore year of college and absolutely lost.\n\nI'm not a STEM person. I've never been interested in science, tried coding one summer and it didn't stick, I can be good at math but I don't want to build a career around complex formulas and theories. Medicine is out of the question, I'm not confident enough in my artistic ability or creativity to pursue arts or graphic design, and the nature of a career as a lawyer stresses me out.\n\nI chose economics (bachelor of arts) because I figured it has a decent mix of hard and soft skills and I'm intrigued by how the economy interacts with the world. After a year I found that while I did very well in the courses I didn't enjoy them, my interest flagged almost immediately, and I'm not really able to see myself in any economics careers.\n\nAfter much deliberation, and triple checking that taking a year wouldn't throw my graduation off track, I decided to take my second year and do the exploring I probably should have done my first year.\n\nInitially I decided on global/international studies because it seems like a perfect mix of my favorite disciplines but after some additional research and fear of having to try and sell it to my family I'm now in a bit of a tailspin.\n\nIn the span of a few hours my planned major has bounced between global/international studies, geography, economics, communication studies, technical writing, and English and that's not even touching the variety of minors and certificates I've considered getting alongside them in an effort to make myself more marketable. Not to mention the back and forth I've had with myself trying to figure out if I put a pause on econ because I got scared of hard work and wanted to do something \"easier\".\n\nSo I ask you, people of r/college, what is your advice? Am I expecting too much enjoyment and I should go back to economics? Am I expecting too much enjoyment but also still should switch majors? Am I overthinking everything and need to relax? Is there some key to picking a major I'm missing? Does any of this matter or should I be more focused on getting experience?",
  "author": "appleslakesandeuchre",
  "created": 1634491481,
  "updated": 1634654813,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hh0bodf": {
      "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh0bodf/",
      "text": "I say study what you enjoy and make a career out of that major.",
      "author": "GoldRequest",
      "created": 1634492687,
      "upvotes": 2,
      "replies": {}
    },
    "hh0eytf": {
      "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh0eytf/",
      "text": "Why not a global studies major with economics minor? Is that possible at all?",
      "author": "ghostingalot",
      "created": 1634494023,
      "upvotes": 2,
      "replies": {
        "hh1ljjx": {
          "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh1ljjx/",
          "text": "It's definitely on the list of major minor combos! The panic might just have me overthinking the validity of this option.",
          "author": "appleslakesandeuchre",
          "created": 1634512323,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh0sdx6": {
      "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh0sdx6/",
      "text": "What are you going to do with a global/international studies major after graduation?  For that matter, what will you do with an economics major after graduation?\n\nThink about the next steps. \n\nDr. Grandpa",
      "author": "FreeThinkingGrandpa",
      "created": 1634499532,
      "upvotes": 1,
      "replies": {
        "hh1kdkq": {
          "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh1kdkq/",
          "text": "I figured both could lead me to a stable career in business. Economics could push me towards finance and with global/international studies I could also pivot to something more humanitarian and do disaster relief or help refugees.",
          "author": "appleslakesandeuchre",
          "created": 1634511759,
          "upvotes": 1,
          "replies": {
            "hh1p3q5": {
              "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh1p3q5/",
              "text": "But do some research and see if your thoughts align with reality.",
              "author": "FreeThinkingGrandpa",
              "created": 1634514025,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hh1qqx0": {
          "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh1qqx0/",
          "text": "What advice would you have given under your other account, u/OldRetiredDood ?",
          "author": "Smihilism",
          "created": 1634514819,
          "upvotes": 1,
          "replies": {
            "hh3q3o3": {
              "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh3q3o3/",
              "text": "You are way out of line here.  Not sure what you're up to, but I'm reporting for inappropriate behavior.",
              "author": "OldRetiredDood",
              "created": 1634561798,
              "upvotes": 1,
              "replies": {
                "hh3wqoj": {
                  "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh3wqoj/",
                  "text": "hmmm. Go right ahead kind sir.\n\nIf I am contacted about your report should I consider it an urgent email?\n\n— The REAL Dr. Grandpa",
                  "author": "Smihilism",
                  "created": 1634565179,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh16jc0": {
      "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh16jc0/",
      "text": "What about international studies do you like? I went into college as an international studies major but like you I was scared of the job prospects. I switched to economics and hated it, but it’s what I graduated in. However, could try to mostly take Econ courses that are more internationally focused so you can at least take more interesting classes while still getting an Econ degree. \nI also find it interesting that you mentioned you are considering geography, because if I could do university over again I’d go for geography and specialize in GIS. Good job growth and decent options. I think you should consider it.",
      "author": "problematictragic",
      "created": 1634505484,
      "upvotes": 1,
      "replies": {
        "hh1fosr": {
          "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh1fosr/",
          "text": "Before I settled on economics I also considered being a history, sociology, or poli-sci major and so international studies kind of took all of those and put them together, plus it's writing based and not math based and when I put my head down I can put together a solid essay much easier than I can get through a set of complex math problems.\n\nGeography kind of came out of nowhere. I was scrolling through my nth site of best non stem majors, saw it, noted that it made a decent salary, looked it up through my college and saw it sort of matched up with one of those career quizzes I took and added it to the list. All that to say it is definitely a major I never expected to actually consider.",
          "author": "appleslakesandeuchre",
          "created": 1634509557,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh1a4iy": {
      "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh1a4iy/",
      "text": "International studies isn't an in-demand degree. That doesn't mean you won't be able to get a decent job after college if you pursue that major, but your job options may be minimally or not at all related to what you studied in college. You'd want to prioritize internships and other resume-building part-time or summer jobs before graduating in order to have good job options after college. \n\nEconomics majors who don't go to graduate school frequently end up in working in business-related occupations, especially finance-related roles. Does that appeal to you? Or you are hoping to do something else?",
      "author": "clearwaterrev",
      "created": 1634507055,
      "upvotes": 1,
      "replies": {
        "hh1i6t3": {
          "link": "/r/college/comments/qa38zp/do_i_just_need_to_buckle_down_and_stick_to_my/hh1i6t3/",
          "text": "Tbh and maybe I should've included this in the original post but I accepted a while ago that in picking a less specialized degree the chances were extremely high that I wouldn't end up working in my declared field much less my dream job. Maybe my indecision about majors is because I'm trying to find some jack of all trades to complement that, I don't know.\n\nJob experience is definitely a priority for me no matter what and my international studies department has made it a priority to ensure students graduate with experience so I'm not concerned about leaving school without something under my belt.\n\nAs for jobs related to economics, I find the pay attractive but after doing economics courses I'm souring on the idea of actually going into the field.",
          "author": "appleslakesandeuchre",
          "created": 1634510724,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}