{
  "sid": "rbiiyz",
  "link": "/r/college/comments/rbiiyz/trouble_with_final_grade/",
  "title:": "Trouble with Final Grade",
  "text": "I have my business calc final in two days. Currently have 343/500 points (roughly a 68% which is a C in the class). Ive had three tests (15% each, each out if 100 points) and received (65%, 20%, and 50%). The final is worth roughly 28% (out if 200 points). Professor said that if my grade on my final is higher then my lowest exam score, that it will replace my lowest exam score. What does this mean? Will the final hurt my grade is I score less that a 20%? PLEASE HELP ME",
  "author": "Ok-Environment9164",
  "created": 1638937343,
  "updated": 1639517309,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hnokoyq": {
      "link": "/r/college/comments/rbiiyz/trouble_with_final_grade/hnokoyq/",
      "text": "Based only on what you recall your professor said, the final is a replacement for your lowest  test score and the cumulative weighted points will make up the remaining 85% of your total score. The best way to know for certain is to see what the syllabus states. That’s what the Dean will uphold if there is ever an issue or complaint.",
      "author": "MotoPineapple",
      "created": 1638938480,
      "upvotes": 2,
      "replies": {}
    },
    "hnokpk6": {
      "link": "/r/college/comments/rbiiyz/trouble_with_final_grade/hnokpk6/",
      "text": "If you get higher than. 20% on the final that will replace your 20%",
      "author": "gooters14",
      "created": 1638938489,
      "upvotes": 1,
      "replies": {}
    },
    "hnokxz6": {
      "link": "/r/college/comments/rbiiyz/trouble_with_final_grade/hnokxz6/",
      "text": "So if my current grade is 68%, then that means that my final grade can’t go down, only up?",
      "author": "Ok-Environment9164",
      "created": 1638938631,
      "upvotes": 1,
      "replies": {
        "hnopcdp": {
          "link": "/r/college/comments/rbiiyz/trouble_with_final_grade/hnopcdp/",
          "text": "Yes.  Whichever test is your lowest score will be treated like it doesn't exist.  So if you score less than 20% the test won't count and your grade will stay the same, if you score higher than 20% then your grade will go up as it will replace the test you scored a 20% on making it look like you never had that test.  In my experience a lot of professors do this with their finals.",
          "author": "1976Raven",
          "created": 1638941422,
          "upvotes": 1,
          "replies": {
            "hnoq3ii": {
              "link": "/r/college/comments/rbiiyz/trouble_with_final_grade/hnoq3ii/",
              "text": "But if the total amount of points is 700 with the final included, And I have 342 right now, and need 420 total points for the lowest C possible, then how would I have enough point total if the final didn’t count?",
              "author": "Ok-Environment9164",
              "created": 1638941917,
              "upvotes": 1,
              "replies": {
                "hnosmsn": {
                  "link": "/r/college/comments/rbiiyz/trouble_with_final_grade/hnosmsn/",
                  "text": "if its lower than a 20% your other three test grades stay put. But you will fail the class if you score that low anyways.",
                  "author": "GoldRequest",
                  "created": 1638943708,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}