{
  "sid": "q0t5jg",
  "link": "/r/college/comments/q0t5jg/is_it_normal_to_fall_behind_on_school_work_in/",
  "title:": "Is it normal to fall behind on school work in college?",
  "text": "I am currently a freshman in college. Ever since the pandemic has reached the US last year, my time management skills have suffered greatly.\n\nWhen I started college a month ago, my time management skills have not improved and it has shown. I have turned in many assignments late, show up to class late, and even slept in my bed through a 9 AM class.\n\nRight now, somehow, I have A's in all of my classes except my cyber class, which is an F right now. I had a meeting with my TA, and he said that the main reason my grade is suffering in the class is because I haven't been turning in a lot of assignments.\n\n**Is falling behind on school work and assignments a normal thing for college freshman? Is it a normal thing for college students in general?**\n\nI'm afraid to tell my parents about it because they are pretty strict and have high expectations for me. There are so many mistakes that I have made that my parents would not approve of. It makes me sad because I set a goal for myself to be absolutely superb and never make a simple mistake in college, and so far I have fallen on my face.\n\nThere are a total of 16 weeks in a semester at my college, and so far week 6 has just ended for me.\n\nI do not want to drop the cyber class because I really want to do well. I know, I fucked up. It was not supposed to happen and it did.\n\n**Is it too late for me to turn things around for my failing grade in that cyber class?**",
  "author": "snoogle999",
  "created": 1633302789,
  "updated": 1634089618,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfadh5g": {
      "link": "/r/college/comments/q0t5jg/is_it_normal_to_fall_behind_on_school_work_in/hfadh5g/",
      "text": "Is it common? No. But I wouldnt say it’s unheard off. Talk to your Cyber  class prof (or check the syllabus) and ask about handing in late assignments for partial credit. It will take a lot of work but if you can get your poop in a group you should be okay. \n\nTry getting a daytimer for assignments and keep up on them. Go to bed earlier and cut back the distractions during the day.",
      "author": "skippy5433",
      "created": 1633303525,
      "upvotes": 1,
      "replies": {}
    }
  }
}