{
  "sid": "qfkyow",
  "link": "/r/college/comments/qfkyow/yall_ever_feel_like_you_stress_too_much_over_your/",
  "title:": "Y’all ever feel like you stress too much over your wording in professional emails?",
  "text": "spent like 3 days working on the perfect email for the chair of the psychology department asking him to sign off on the form for my minor and when he replied his gmail pfp is him with his head in a giant plastic dino and ended the email with “good luck :)”\n\nidk i think i always imagine anyone outside of my usual profs as the  [scary food critic from ratatouille](https://imgur.com/a/dx4u8rW) does anyone else have this problem",
  "author": "EdelwoodOil",
  "created": 1635180529,
  "updated": 1636186748,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hi0obfi": {
      "link": "/r/college/comments/qfkyow/yall_ever_feel_like_you_stress_too_much_over_your/hi0obfi/",
      "text": "for sure. The other day I spent a whole hour trying to ask for advice from my professor in the most respectful, grammatically correct, professional manner possible, and she just flat-out didn’t listen lol. I’ve also had professors respond with one word like “yes” despite my spending ages stressing out about emailing them and making sure I phrased it properly. It kind of just makes me wonder if I should just give no fucks either — like I genuinely feel like my emails have been far more professional than those of my professors",
      "author": "FlyFreeWithMyself",
      "created": 1635188004,
      "upvotes": 7,
      "replies": {}
    },
    "hi19c1t": {
      "link": "/r/college/comments/qfkyow/yall_ever_feel_like_you_stress_too_much_over_your/hi19c1t/",
      "text": "Honestly, as someone who stays in contact with just about all of their professors and was taught a very formal way of email construction, it depends on the professor. Sometimes you just need to play it by ear depending on your current rapport with the professor, but as a general rule of thumb I err on the side of being formal in email and more relaxed in person. It’s natural to feel a bit of worry about speaking to people who are important or who could help change the course of your future, but they are human just like the rest of us. They vary. Some may be fine with a more laid-back style of communication, while others may prefer the formality that is typically expected when writing emails. Either way, professors probably won’t get offended if you go too formal, but going too lackadaisical can easily come of as rude or disrespectful. \n\nAlso, if you remember, Anton Ego had just as much of a joyous, amicable side as a harsh, critical one by the end of the movie. Professors come in many different shapes, sizes, and manners of conduct and speech because they’re just people like us. And in most scenarios, professors want to see students succeed and are there to help. I wouldn’t fret about your interactions with them too much; keep the emails classy and respectful and you should be fine.",
      "author": "GlassGlaceon",
      "created": 1635196410,
      "upvotes": 3,
      "replies": {}
    },
    "hi1k72c": {
      "link": "/r/college/comments/qfkyow/yall_ever_feel_like_you_stress_too_much_over_your/hi1k72c/",
      "text": "Yeah I sometimes get lost as to how i phrase my emails. But honestly, declaring a minor? shouldntve taken three days to write.",
      "author": "trueoctopus",
      "created": 1635201106,
      "upvotes": 2,
      "replies": {
        "hi1klee": {
          "link": "/r/college/comments/qfkyow/yall_ever_feel_like_you_stress_too_much_over_your/hi1klee/",
          "text": "my academic advisor said i had to prove why i think i deserve it so i kept going back to tweak it to make it just right",
          "author": "EdelwoodOil",
          "created": 1635201284,
          "upvotes": 3,
          "replies": {
            "hi1s3wf": {
              "link": "/r/college/comments/qfkyow/yall_ever_feel_like_you_stress_too_much_over_your/hi1s3wf/",
              "text": "Yeah I guess yall do minors differently. All i need to do is fill out a google form. Some departments dont even reach out to their minors after they declare. Majors you have to 'apply' (also by filling out the same google form) but the Department chair has to let you in.",
              "author": "trueoctopus",
              "created": 1635204690,
              "upvotes": 3,
              "replies": {
                "hi1sfrs": {
                  "link": "/r/college/comments/qfkyow/yall_ever_feel_like_you_stress_too_much_over_your/hi1sfrs/",
                  "text": "god that sounds a lot less nerve wracking than worrying about whether or not the department chair will think you’re worthy of the minor",
                  "author": "EdelwoodOil",
                  "created": 1635204841,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi2qhbi": {
      "link": "/r/college/comments/qfkyow/yall_ever_feel_like_you_stress_too_much_over_your/hi2qhbi/",
      "text": "yeah",
      "author": "iamsojellyofu",
      "created": 1635221460,
      "upvotes": 1,
      "replies": {}
    }
  }
}