{
  "sid": "qnlwnp",
  "link": "/r/college/comments/qnlwnp/bio_and_premed_should_be_separate_majors/",
  "title:": "Bio and pre-med should be separate majors",
  "text": "Or, at the very least, pre-med students should have the option of their own major. (I know that's an option in some places, but it seems far more common for pre-med students to be shuffled into bio undergrad majors).\n\nI'm a bio major, with a focus on ecology and evolution. Most of the other bio undegrads are pre-med. That's fine, I get it. There's no pre-med undegrad major, they have to get their credits for med school. What I'm tired of is every facet of the biology major being catered toward pre-meds, while the rest of us are left in the wind.\n\nEvery networking opportunity the department organizes involves hospitals or clinics. The newsletters with internship opportunities are all focused on the medical field. Every resume workshop is organized around skills for future doctors. The rest of us? Lmao good luck I guess\n\nIt even extends into the classroom. Every time we go into a topic that isn't directly related to public health or the human body, the professors preface it with \"I know this doesn't seem useful, but when it comes to treating people--\". It's like they feel like the need to justify teaching, you know, the full range of biology. \n\nBiology is such a huge field. Medicine is an important part of it, but still a small part. There's ecology, conservation, botany, zoology, even freaking astrobiology. Many more I could list. I feel like all that gets lost when so much of the major is pre-med students. Like the department is limiting itself. And it's a shame. \n\nPre-meds deserve a separate major that can fully commit to their career trajectory, and the rest of us deserve a major that actually takes the rest of biology into account. \n\nWhat do you guys think?",
  "author": "7thKindEncounter",
  "created": 1636150104,
  "updated": 1636655896,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.57,
  "comments": {
    "hjh67ak": {
      "link": "/r/college/comments/qnlwnp/bio_and_premed_should_be_separate_majors/hjh67ak/",
      "text": "This happens in just about any and every situation where there are different career goals represented among the student population of a major-- generally speaking, the majority wins. It's not just bio where this happens. When I was a music major, everything was catered towards future teachers. When I studied math at an engineering school, everything was catered towards applications in engineering. There's always someone who gets left out, but it's helpful for the majority, so it's not the end of the world imo. Big schools can add separate majors for separate areas of focus and have specialized classes, but many/most schools aren't big enough to do that.",
      "author": "HumanDrinkingTea",
      "created": 1636151402,
      "upvotes": 1,
      "replies": {}
    }
  }
}