{
  "sid": "qbspk0",
  "link": "/r/college/comments/qbspk0/issues_with_cengage/",
  "title:": "Issues with Cengage",
  "text": "So I've had my cengage account for more than two years. I got an email yesterday (I didn't even see it until an hour ago) saying that my account was deactivated because of account sharing. What account sharing? When? Where? How is this the first I'm hearing of it? I haven't even logged in since Friday. (I tried to today but couldn't. Just figured it was down and moved on to other homework). I never shared my account with anyone. Ever. I don't believe I've ever mentioned it in conversation with anyone either. \n\nSo I'm completely lost. I have no idea how this happened or why. What did I even do? And now because I can't login I can't even talk to anyone. I have no idea what to do at this point. I just feel like breaking down crying. I'm so done with this shit.",
  "author": "erivanla",
  "created": 1634703434,
  "updated": 1634750272,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhbph1a": {
      "link": "/r/college/comments/qbspk0/issues_with_cengage/hhbph1a/",
      "text": "Call them. Their support number is listed here.\nhttps://help.cengage.com/mindtap/mt-student/common/contact-support.html\n\nIf they restore the account, change the password and make it one that you've never used any where else. This it because it may have been possible someone else was somehow using your login information to log in and trigger whatever detected this. This is possible even if you've never spoke of having this account with anyone.",
      "author": "SouthernRhubarb",
      "created": 1634704197,
      "upvotes": 1,
      "replies": {
        "hhbq559": {
          "link": "/r/college/comments/qbspk0/issues_with_cengage/hhbq559/",
          "text": "Thanks. I'll try that tomorrow while I'm at work. That is probably the best bet since none of my other habits have changed. Hopefully they restore it since I'm in 3 classes currently and bought a two-year cengage unlimited subscription over the summer.",
          "author": "erivanla",
          "created": 1634704589,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhbudvi": {
      "link": "/r/college/comments/qbspk0/issues_with_cengage/hhbudvi/",
      "text": "Change your password on Cengage or try to . Because somebody got your password and is using it or selling your account.\n\nAnd contact Cengage Support.\n\nDo you use the same password as any other website that you are on? If yes Change the password to that site now.",
      "author": "tcbobb16",
      "created": 1634707365,
      "upvotes": 1,
      "replies": {
        "hhbv2k7": {
          "link": "/r/college/comments/qbspk0/issues_with_cengage/hhbv2k7/",
          "text": "I know I used to. But I don't think I have others. I'll go through and double check. It won't send me an email to change it. Should I also let my teachers know incase it takes a few days? I'll be contacting them at some point tomorrow.",
          "author": "erivanla",
          "created": 1634707855,
          "upvotes": 1,
          "replies": {
            "hhbzowt": {
              "link": "/r/college/comments/qbspk0/issues_with_cengage/hhbzowt/",
              "text": "I do not know what your teacher would be able to do in this situation. But they could help in supporting your Claim that you are original ower of that account. But they probably have taken ownership of your Cengage account. Since you can not log in.\n\nContact Cengage Support.",
              "author": "tcbobb16",
              "created": 1634711419,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhbxhwd": {
      "link": "/r/college/comments/qbspk0/issues_with_cengage/hhbxhwd/",
      "text": "my chegg account password has to be changed on occasion for the same reason. Why, its when I google an answer and then use the app on my iPhone (doesnt recognize its the same device).\n\nCengage I have not had trouble, but my Community college (taking continuing education classes) had a case where cengage didn't connect with the prof grade book.",
      "author": "enoughstreet",
      "created": 1634709681,
      "upvotes": 1,
      "replies": {
        "hhbzdqn": {
          "link": "/r/college/comments/qbspk0/issues_with_cengage/hhbzdqn/",
          "text": "That's the case in one of my classes as well. I use it on my desktop, phone (browser) and app. Never had a problem until now.",
          "author": "erivanla",
          "created": 1634711168,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}