{
  "sid": "qnqnjy",
  "link": "/r/college/comments/qnqnjy/letter_of_recommendation_advice/",
  "title:": "Letter of Recommendation Advice",
  "text": "I am applying to grad school soon and need some advice on how to ask professors for letters of recommendation. I have had very limited interaction with professors due to COVID. We got sent home three weeks into my second semester of my sophomore year, and up until that point I had pretty much just been completing my random university requires gen eds. Due to this I have taken most of my major specific classes online and they have either had limited interaction with the professor or have been completely asynchronous. With that being said, how do I go about asking any professors for letters of recommendation if I have barely had any interaction with them? Any advice or personal stories would be super helpful!",
  "author": "spinchrecall",
  "created": 1636165300,
  "updated": 1636655864,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hji5mbv": {
      "link": "/r/college/comments/qnqnjy/letter_of_recommendation_advice/hji5mbv/",
      "text": "When you write the request, include a detailed statement about yourself and the position you are seeking a recommendation for. This gives the professor something to write about, even if they don't necessarily know you very well. As for who you request from, don't choose a professor you've never spoken to or did poorly on their class. Choose someone whose class you found interesting and at the very least had a good grade in. \n\nFinally, be understanding if they don't agree to recommend you. Yeah, it sucks, but like you said, they don't really know you, and you are basically asking them to put their professional reputation on the line to vouch for you. Some might not be willing to do that for someone they don't have an established relationship with. It sucks, but that's the way it is.",
      "author": "patrdesch",
      "created": 1636167134,
      "upvotes": 3,
      "replies": {}
    },
    "hjitbqa": {
      "link": "/r/college/comments/qnqnjy/letter_of_recommendation_advice/hjitbqa/",
      "text": "minimize back-and-forth. send your CV/resume, unofficial transcript, and statement of purpose in the first email. It's unsolicited and nobody likes unsolicited stuff, but they are busy people, so again, minimize back-and-forth. Also they don't know you really well, but they can \"get to know you\" through the documents.\n\nif you are submitting applications in 4-7 weeks, you are incredibly late and need to ask ASAP.",
      "author": "wobbletelescope",
      "created": 1636181839,
      "upvotes": 0,
      "replies": {}
    }
  }
}