{
  "sid": "rdn5ar",
  "link": "/r/college/comments/rdn5ar/struggling_with_the_transition_from_college_to/",
  "title:": "Struggling with the transition from college to office life.",
  "text": "I graduated in May 2021 with a BFA in graphic design. A bit of context, my whole family have worked in the public school systems, none of them have ever worked in an office setting.\n\nI now work in an office and it's been a tough transition amonog my fellow peers and I (Those I graudated with.)\n\n1. We all work at different companies but all of our companies, we find ourselves actually working overtime most days. Instead of a 40 hour week, it looks more like 45-50 hours salaried (No overtime pay). We are all stressed.\n2. I have struggled with ADHD most of my life but in the school system I found people were forgiving with feedback and little mistakes not so much in design post-graduation\n3. I'm 4 months in and the senior designer training me is suddenly gone-we don't know when he is coming back to the office. There are days where I really don't know the answers to questions\n4. In school I always made the deadlines on time and was punctual with my work, even in team and large scale event projects, and at my internship. But now at my job 2-4 people are always in my files and deadlines get complicated with sudden changes and late feedback.\n5. I feel like my physical and mental health are not doing their greatest. It's like a slow burn.\n6. Getting used to office lingo and business culture is really strange. People are indirect and sometimes I'm not sure if I understand them fully.\n7. My mom and family always sticked to one job, one place of work their whole life- that's because in the school system their pay was based off of the years they worked there, not completely tied to performance, I feel so stressed at my new place of work and always feel the need to step up and say yes to working overtime even when I know I shouldn't for that hope at a raise\n8. Most of my circle are in the same situation I'm in but for even less benefits and pay. I can't really complain as my workplace isn't toxic but I feel like I struggle a lot and put a lot of pressure on myself to succeed. It's so hard with adhd as I'm constantly missing tiny details or rereading things. If you've made it this far thank you for reading my post. I miss college and didn't know what I had until I didn't have it anymore. :(",
  "author": "Fiery_Tigress",
  "created": 1639183025,
  "updated": 1639516688,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}