{
  "sid": "rg012n",
  "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/",
  "title:": "I have given up trying to make friends in college",
  "text": "I tried joining clubs, hanging out outside of my dorm room, be kind, be open, yet I ended up making no friends. I don’t even know what to do at this point. It feels like people are super busy in college and you just get left behind.",
  "author": "FoxDry888",
  "created": 1639459000,
  "updated": 1639515957,
  "over_18": false,
  "upvotes": 122,
  "upvote_ratio": 0.94,
  "comments": {
    "hoiw6tw": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoiw6tw/",
      "text": "A few things I've learned:\n\n1. There's value in learning how to be alone.\n2. Take stock of what you bring to the table. If others don't see that value then they aren't worth stressing over.\n3. Invest yourself in a hobby that can be easily shared with others.\n3. Find opportunities to volunteer.",
      "author": "october_bliss",
      "created": 1639497972,
      "upvotes": 27,
      "replies": {}
    },
    "hohl9xb": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hohl9xb/",
      "text": "Making and maintaining meaningful relationships is a lot of work tbh. Most people in college already have their friend group so you have to really work hard to be part of it and so far I haven't really met anyone that I've considered \"worth\" the effort. There was this one dude who I had respect for since we are both studying robotics and I felt I could learn a lot from him. I lost all respect for him after he showed up to one of our robotics meetings and ate food the entire time and just told us what to do.",
      "author": "BingeV",
      "created": 1639469471,
      "upvotes": 50,
      "replies": {}
    },
    "hohmi6d": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hohmi6d/",
      "text": "I kinda have given up. I joined clubs, sorority, and I’ve realized that I prefer my own companionship. A lot of college friends (acquaintances) just come and go, and I don’t feel like wasting my time investing in something that doesn’t last. Keep the ones that matter, and that’s about it.",
      "author": "ricedrank",
      "created": 1639470445,
      "upvotes": 28,
      "replies": {}
    },
    "hohfsec": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hohfsec/",
      "text": "I really feel for you! I am only now finding my friend group as a junior, given I’ve been home due to covid since my freshman year. It is definitely tough as I’m more introverted and it takes a while for me to open up. What helped me is focusing on getting close to one person at a time. Then you can meet their friends or just take time getting to know them. A lot of my friends are ppl I sat next to in class and I just invite them to study in the library or get dinner. And eventually you will form a routine and naturally become friends!",
      "author": "maymay203",
      "created": 1639465363,
      "upvotes": 14,
      "replies": {}
    },
    "hoh88i5": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoh88i5/",
      "text": "I always see posts like this and just think “ok and?”\n\nLike bro that sucks but it’s absolutely something on your end that’s ending in you not making friends. If you’re putting yourself out there to meet people but not taking it any further, then you can’t expect to turn circunstancial relationships into friendships.\n\nDo you get their number/instagram/snapchat? Do you hang out with them or make an effort to hangout with them outside of your usual meeting spot? Do y’all actually get along well in person? Answer to all of these needs to be yes for it to be a problem that’s outside of your control.\n\nIf you’re in clubs, make a groupchat with the people you talk to in the club. Same concept with people you meet in class or in your dorms. As long as you get along well and y’all enjoy each other’s company, make sure you can communicate with them through your phone. Then, whenever you’re doing something random like studying, going to the gym, grabbing lunch, seeing a movie… INVITE THEM. Invite everyone until a few people say yes. \n\nRepeat this process multiple times a week and then boom a friend group forma",
      "author": "guardiandown1218",
      "created": 1639460366,
      "upvotes": 62,
      "replies": {
        "hohegot": {
          "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hohegot/",
          "text": "Even as an introvert, I still try to make an effort into not only meeting new people but also maintaining the relationship. \n\nObviously, my social energy will be drained real quick compared to others. However, ppl who I truly want to be around with, I try to be the first one to make that move.",
          "author": "owlwaves",
          "created": 1639464437,
          "upvotes": 24,
          "replies": {}
        },
        "hojmax8": {
          "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hojmax8/",
          "text": "gotta say, as an introvert who read a lot of books about how to make friends, there really is only one solution, and it is that you MUST make everyone around you happy.\n\nif you want a friendship, the people that you want must be always happy when they are with you.\n\nhow you might do that you may ask? well, by offering them something easy for you but meaningful to them, if you have a funny sense of humor, make jokes constantly and make them laugh, if you are smart, help them out in an assignment or homework, if you are rich, maybe invite them to lunch once or twice.\n\nI know you might think that this is a bad relationship because it is the prime example of an exploitative relationship, so of course, your personalities should always match.\n\nwhat i am trying to show you is how to be popular and have a lot of friends, i was a big introvert 3 years ago and no one liked me, but now i am always surrounded by friends.\n\none thing people tend to forget is that other people are people too and not side characters, they have a life, they are studying, they have a busy schedule, and just like you, if there is someone you are always happy to be around them, then you will be around them all the time, same here, if people are happy to be around you, they will be around you for a long time.",
          "author": "DesarForPeace",
          "created": 1639508154,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hohydns": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hohydns/",
      "text": "I can relate I don't even care about making friends anymore.",
      "author": "bigdickro",
      "created": 1639480403,
      "upvotes": 11,
      "replies": {}
    },
    "hohka33": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hohka33/",
      "text": "At least you're not commuting an hour to a community college every day like I am... It could always be worse. You at least have a *chance*.",
      "author": "MeanYeti",
      "created": 1639468698,
      "upvotes": 8,
      "replies": {}
    },
    "hoh6f4e": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoh6f4e/",
      "text": "I low-key feel you on that",
      "author": "FlyG23",
      "created": 1639459286,
      "upvotes": 13,
      "replies": {}
    },
    "hojclal": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hojclal/",
      "text": "Keep working on it man you'll get there. I think I hung out with one my now best friends like 10/15 times before we actually became friends. Consistency is key here. Stick to doing things you enjoy and it'll just naturally happen if you give it enough time",
      "author": "jpolly223",
      "created": 1639504349,
      "upvotes": 3,
      "replies": {}
    },
    "hojdnjp": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hojdnjp/",
      "text": "Part of your problem might not be that people in college are too busy for friends, but that the nature of friendship changes in college compared to what you probably experienced in high school. Even my best friends and I see each other maybe once a week if we're lucky. It doesn't mean we aren't friends, just that we all have a lot going on.",
      "author": "Jack_Rickle",
      "created": 1639504757,
      "upvotes": 3,
      "replies": {}
    },
    "hojom2q": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hojom2q/",
      "text": "U just have to ask someone to hang out and hope u get lucky",
      "author": "Yo_dog-",
      "created": 1639509063,
      "upvotes": 1,
      "replies": {}
    },
    "hoiltdl": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoiltdl/",
      "text": "Why don't you go to your school's subreddit and just say you want to make friends. There are plently of people in reddit with the same problem as yours. At least if yall both lonely then it could work out.",
      "author": "TheRapidTrailblazer",
      "created": 1639493674,
      "upvotes": 3,
      "replies": {}
    },
    "hoijgg0": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoijgg0/",
      "text": "First of all, It’s definitely not too late, people don’t stop making friends at a certain point in college, so don’t worry about that. I still have friends I met my first day of freshmen year in college, All the way up to my last year and grad school. I was actually just the best man and a friends wedding who I met my junior year, and we are in our 30’s now.\n\nThe key, is that making/staying friends takes effort. Sounds like you are putting yourself out there and meeting people, which is a great first step. The key to turning people from acquaintances to friends is follow-up. When you vibe with someone, get their number, invite them places, invite them to do things, keep inviting them, all the time. When they invite you, make a good effort to go. Eventually you both will decide if each other are worth the effort, if you both decide you are… congratz you made a friend. But remember, it still requires effort to keep that friend.",
      "author": "Brocklyboy1990",
      "created": 1639492621,
      "upvotes": 2,
      "replies": {}
    },
    "hoie7xy": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoie7xy/",
      "text": "smoke weed and the stoners will hang w you",
      "author": "KIDPESOO",
      "created": 1639489995,
      "upvotes": 1,
      "replies": {}
    },
    "hoj0rra": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoj0rra/",
      "text": "man it's better to have less friends imo.\n\ni made so many friends at first it was cutting into my study time.\n\nbut i started really hitting the books and spending less times with friends my grades are soaring. i actually like it better this way lol\n\nbut dont worry, they will come, it may take more time, it will happen",
      "author": "OswaldNovember",
      "created": 1639499779,
      "upvotes": 1,
      "replies": {}
    },
    "hojhz91": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hojhz91/",
      "text": "Based",
      "author": "Mr_Dr_Prof_Derp",
      "created": 1639506457,
      "upvotes": 1,
      "replies": {}
    },
    "hojmg0v": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hojmg0v/",
      "text": "[removed]",
      "author": null,
      "created": 1639508210,
      "upvotes": 1,
      "replies": {}
    },
    "hoi4go6": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoi4go6/",
      "text": "L, just make friends",
      "author": "Formal_Candle6789",
      "created": 1639484647,
      "upvotes": -4,
      "replies": {}
    },
    "hoj1gwb": {
      "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoj1gwb/",
      "text": "Same. Im almost 1 year in and i havent made a single friend. In my country i dont think we have clubs ect. So it just sucks ass. Worst part is, that now we have to form our own studygroup with people from class. The teachers randomly made them the last 2 times. So im just gonna get stuck with a group of people that never shows up to class. I fucking hate stuff like this.",
      "author": "Short_Principle",
      "created": 1639500052,
      "upvotes": 0,
      "replies": {
        "hoj1i8a": {
          "link": "/r/college/comments/rg012n/i_have_given_up_trying_to_make_friends_in_college/hoj1i8a/",
          "text": "\nHello! You have made the mistake of writing \"ect\" instead of \"etc.\"\n\n\"Ect\" is a common misspelling of \"etc,\" an abbreviated form of the Latin phrase \"et cetera.\" Other abbreviated forms are **etc.**, **&c.**, **&c**, and **et cet.** The Latin translates as \"et\" to \"and\" + \"cetera\" to \"the rest;\" a literal translation to \"and the rest\" is the easiest way to remember how to use the phrase. \n\n[Check out the wikipedia entry if you want to learn more.](https://en.wikipedia.org/wiki/Et_cetera)\n\n^(I am a bot, and this action was performed automatically. Comments with a score less than zero will be automatically removed. If I commented on your post and you don't like it, reply with \"!delete\" and I will remove the post, regardless of score. Message me for bug reports.)",
          "author": "ectbot",
          "created": 1639500066,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}