{
  "sid": "qkoo1p",
  "link": "/r/college/comments/qkoo1p/cute_guy_in_my_class/",
  "title:": "Cute guy in my class",
  "text": "I’m gay first off. So today some guy I’ve never seen in class showed up. I talked to him for a couple minutes and found out which high school he went to. After class I asked for his snap then dipped out cause I was nervous lmao. Idk if he likes guys but should I just message him and ask straight up or is there another route I should take? He’s %100 my type which isn’t the stereotypical gay “type” so it makes it hard to know if he could even possibly be into guys unless I straight up ask. During break time me and my friend walked out to my car for a second and he kinda followed us, that’s where the very short conversation we had started. We may or may not have locked eyes a few times in class, I genuinely don’t know. I was hungover af, just got off a 12 hour night shift, and tired so I really don’t fucking know lmao",
  "author": "yourbluebird638",
  "created": 1635803183,
  "updated": 1636185984,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.2,
  "comments": {
    "hj4cchu": {
      "link": "/r/college/comments/qkoo1p/cute_guy_in_my_class/hj4cchu/",
      "text": "Idk if your state/province votes liberal/Democrat but a lot of people aren't tolerant. So find a safe space or student club for lgbtq",
      "author": "Cylinder126",
      "created": 1635923212,
      "upvotes": 1,
      "replies": {
        "hj5hqbq": {
          "link": "/r/college/comments/qkoo1p/cute_guy_in_my_class/hj5hqbq/",
          "text": "I live in SC so it’s probably not the most friendly lgbt place but i haven’t had any issues. I’ve felt with a lot of straight guys lmao. They’re all either like “nah I’m straight but we can still be friends” or they start questioning them selves.",
          "author": "yourbluebird638",
          "created": 1635949957,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}