{
  "sid": "qga337",
  "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/",
  "title:": "Where can I go to report a teacher for an unjust policy?",
  "text": "I’m not sure how to word this, so I’ll just explain: my mother had a heart attack two weeks ago that left her in the hospital for 3 days. Since I’m the only one living with her that can drive, that means that I had to drive her to and from the hospital. I knew I was going to miss 2 sessions of one of my classes, so I contacted that particular teacher a day in advance. She told me it was totally fine, nothing to worry about, etc. A few days ago, she has me wait till after class (all online) to tell me that I’m going to be having 2 points taken off my overall grade for having missed these days. I told her that my mom had a heart attack (again), and she just said that there’s no excuses. What can I do to get these points added back to my grade/get justice for this? How is this fair?",
  "author": "allseeingeye42",
  "created": 1635265381,
  "updated": 1636178940,
  "over_18": false,
  "upvotes": 70,
  "upvote_ratio": 0.96,
  "comments": {
    "hi4zus2": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi4zus2/",
      "text": "If you have this is writing that will help you greatly, but also talk with the dean of students. If possible get documentation of your mother being in the hospital. Try and show these to your professor and talk with them again and if that doesn't help definitely talk with the dean of students.",
      "author": "HolidayDecember",
      "created": 1635269091,
      "upvotes": 59,
      "replies": {
        "hi53775": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi53775/",
          "text": "Thank you for your help. She knew and acknowledged that my mother was in the hospital, that wasn’t the problem. She even said “no excuses” regarding absences (even if they’re excused, I’ve never had a class where this was the rule). Regardless, I have all the necessary documentation",
          "author": "allseeingeye42",
          "created": 1635270401,
          "upvotes": 27,
          "replies": {}
        }
      }
    },
    "hi53mh6": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi53mh6/",
      "text": "If the issue is with grading and you can’t resolve it with the professor, the next step should be the department chair (assuming you have proper documentation for everything). Absences and points for those absences are usually at the sole discretion of the professor, but it all depends on institutional and departmental policies as to whether excused absences can override said discretion. As others have said, the dean of students may be able to help with documentation and advocacy, but they cannot do anything about grades or override a professor’s decision. That occurs within the department.",
      "author": "PhDapper",
      "created": 1635270568,
      "upvotes": 18,
      "replies": {
        "hi5q2j7": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi5q2j7/",
          "text": "Makes sense, thank you. I’m just confused about it all, I’ve never had a professor who takes points off for excused absences. I understand taking points off of the grade of a student who just goes AWOL, but not one in my situation",
          "author": "allseeingeye42",
          "created": 1635279299,
          "upvotes": 4,
          "replies": {
            "hi5r5uj": {
              "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi5r5uj/",
              "text": "Some attendance policies don’t treat absences as excused or unexcused - absences are just absences. Perhaps that’s her approach.",
              "author": "PhDapper",
              "created": 1635279719,
              "upvotes": 5,
              "replies": {
                "hi63rii": {
                  "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi63rii/",
                  "text": "That’s really absurd considering the fact that sometimes people have emergencies, but still I get where you’re coming from",
                  "author": "allseeingeye42",
                  "created": 1635284723,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi5j1tp": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi5j1tp/",
      "text": "How are the points graded? Because it sounds like a lot of trouble if the points are not “heavy”. If it would really affect your grade id suggest doing what the others here have said. Good luck bud :)",
      "author": "A1089",
      "created": 1635276620,
      "upvotes": 4,
      "replies": {
        "hi5pw28": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi5pw28/",
          "text": "My issue is that I have a 3.98 GPA and I already have like an 86 in this class, I can’t afford to lose 2 points, I want to maintain a high GPA. I can likely get my grade up to an A or A-, but I have a lower chance of this if I let this slide",
          "author": "allseeingeye42",
          "created": 1635279230,
          "upvotes": 2,
          "replies": {
            "hi63asp": {
              "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi63asp/",
              "text": "Please escalate this! You work too hard in school just to let this bullshit professor tac off 2 points for what",
              "author": "TheRapidTrailblazer",
              "created": 1635284530,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hi5nevn": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi5nevn/",
          "text": "Well if you do nothing even if its a small grade the professor will continue doing things like that. You have to call it out when it happens so it doesn’t continue and affect other students.",
          "author": "Many-Ad-3622",
          "created": 1635278287,
          "upvotes": 4,
          "replies": {
            "hi5pqx2": {
              "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi5pqx2/",
              "text": "I agree with you very much on this, this is what I’ve been thinking",
              "author": "allseeingeye42",
              "created": 1635279177,
              "upvotes": 2,
              "replies": {}
            },
            "hi78u96": {
              "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi78u96/",
              "text": "Professors have the discretion to make their own grading policies though.  It’s not really a go speak to the manager type of situation.",
              "author": "Blackberries11",
              "created": 1635303246,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hi4ui2l": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi4ui2l/",
      "text": "Always get these things in writing. If you'd emailed her for a response, you would have something to present to her. And when you asked, did you specifically ask if you would lose points? BTW, it's common for people to take a cab to/from hospital.",
      "author": "CindsSurprise",
      "created": 1635266992,
      "upvotes": 25,
      "replies": {
        "hi4v4pk": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi4v4pk/",
          "text": "I have all the emails of her saying it’s fine (she did however say that I would miss a quiz, which I said was fine). In terms of proof, I have everything. Where do I go though to report it?",
          "author": "allseeingeye42",
          "created": 1635267236,
          "upvotes": 18,
          "replies": {
            "hi52tox": {
              "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi52tox/",
              "text": "Student omanbudsman or department student liaison",
              "author": "Plantsandanger",
              "created": 1635270253,
              "upvotes": 4,
              "replies": {
                "hi538cn": {
                  "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi538cn/",
                  "text": "Thank you",
                  "author": "allseeingeye42",
                  "created": 1635270413,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi5cnvl": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi5cnvl/",
      "text": "This would first go to the dept chair.",
      "author": "PersephoneIsNotHome",
      "created": 1635274140,
      "upvotes": 2,
      "replies": {}
    },
    "hi6bjw4": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi6bjw4/",
      "text": "at our school medical absences, death in the family, all that sort of stuff - this goes through the Dean of Students, and if the dean of students determines that the absence meets whatever criteria, they then notify the faculty members that these have to be treated as excused absences, so you could make up work and not be penalized, just the same as like when an NCAA athlete misses a test while traveling for a game, those are excused and can't be held against the student.",
      "author": "RollWave_",
      "created": 1635288107,
      "upvotes": 2,
      "replies": {
        "hi6m28u": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi6m28u/",
          "text": "Interesting. Is your school private or public?",
          "author": "allseeingeye42",
          "created": 1635292850,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi8xahy": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi8xahy/",
      "text": "As others have stated, the best course of action would be to go to the chair about this. Since you have documentation of you communication with the professor, I don't expect there to be any difficulties.\n\nI would advise to be careful with your phrasing and tone. Professors are a prickly bunch and don't like being accused of doing something wrong. Words like 'unjust' will get people on the defensive. A better way of phrasing it is something along the lines of, \"The professor agreed to this, but now is not. I think they might have forgotten our conversation or made a mistake.\" Always give faculty some kind of 'it was all a mistake/misunderstanding' out. I know it can feel unjust, but it is how the game is played.\n\nIf for some reason things don't work out for you don't escalate the situation. Put a pin in it, finish the semester strong, and then see if your final grade was affected. Then raise the issue again.",
      "author": "hdorsettcase",
      "created": 1635343090,
      "upvotes": 2,
      "replies": {
        "hi9j8oo": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi9j8oo/",
          "text": "Good advice, thank you",
          "author": "allseeingeye42",
          "created": 1635352152,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi7f6h8": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi7f6h8/",
      "text": "It’s an online class so unless your deathly ill then there’s no good excuse for missing class. That’s the only down side to online classes.",
      "author": "ORCA_OF_WALLST",
      "created": 1635306460,
      "upvotes": 1,
      "replies": {
        "hi7l60v": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi7l60v/",
          "text": "Um. They literally said that they were *driving* their mother to and from the hospital. You can't exactly attend a Zoom class while DRIVING.",
          "author": "Autumnleaves201",
          "created": 1635309826,
          "upvotes": 1,
          "replies": {
            "hi8kye4": {
              "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi8kye4/",
              "text": "I’ve done it before just log in on to zoom with your phone and listen to the class. Not that hard.",
              "author": "ORCA_OF_WALLST",
              "created": 1635336901,
              "upvotes": 0,
              "replies": {
                "hi8rt1v": {
                  "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hi8rt1v/",
                  "text": "It's incredibly dangerous,",
                  "author": "Poison-Hot-Chocolate",
                  "created": 1635340506,
                  "upvotes": 1,
                  "replies": {
                    "hiakio3": {
                      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hiakio3/",
                      "text": "How? it’s the same as listening to the radio or a podcast while you drive.",
                      "author": "ORCA_OF_WALLST",
                      "created": 1635366616,
                      "upvotes": 1,
                      "replies": {
                        "hik47mq": {
                          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hik47mq/",
                          "text": "No, it's not. While you may be indirectly processing the information you hear from a radio or podcast. You are expected to and required to process the information from a college class at a much higher level. \n\nDepending on the class and subject you shouldn't be focused on driving while simultaneously trying to process and understand new course material.",
                          "author": "Poison-Hot-Chocolate",
                          "created": 1635539105,
                          "upvotes": 1,
                          "replies": {
                            "hikic58": {
                              "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hikic58/",
                              "text": "I was marked present. that’s all OP needed to do was to be marked present, to no lose 2 points. Obviously it would be slightly harder to grasp the concepts while driving but it not like your driving every class.",
                              "author": "ORCA_OF_WALLST",
                              "created": 1635544923,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjbqovz": {
      "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hjbqovz/",
      "text": "I had a professor try to dock me late points for being IN the hospital MYSELF with pneumonia (sepsis, almost died). He told me some similar line about no excuses, no absences. \n\nI contacted the department head/advisor of my program who was horrified. He arranged for me to make up the whole class the following semester. \n\nThe professor who I “inquired” about later denied he ever said it, was angry at me - what a child!",
      "author": "OkapiEli",
      "created": 1636056492,
      "upvotes": 1,
      "replies": {
        "hjbr5u6": {
          "link": "/r/college/comments/qga337/where_can_i_go_to_report_a_teacher_for_an_unjust/hjbr5u6/",
          "text": "Wow, I’m sorry to hear that. Happy to know you’re better though. You missed so much class that you had to retake it? It’s really disgusting that some people have no regard for others like that, it’s almost like they don’t understand that they’re just as human as the rest of us",
          "author": "allseeingeye42",
          "created": 1636056677,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}