{
  "sid": "qt8jnr",
  "link": "/r/college/comments/qt8jnr/which_computer_is_the_best_for_college/",
  "title:": "Which computer is the best for college ?",
  "text": "So I’m currently a senior right now and since Black Friday is right around the corner I was wondering which computer was the best one to get for college.",
  "author": "Abre_Habte228",
  "created": 1636832528,
  "updated": 1637182003,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hkig3g0": {
      "link": "/r/college/comments/qt8jnr/which_computer_is_the_best_for_college/hkig3g0/",
      "text": "It doesn't matter bro, anything that runs works, and I say this as a computer science major lol.  What's your budget?",
      "author": "M33RHARIS",
      "created": 1636843421,
      "upvotes": 3,
      "replies": {}
    },
    "hkhrhyz": {
      "link": "/r/college/comments/qt8jnr/which_computer_is_the_best_for_college/hkhrhyz/",
      "text": "I’m not sure there is a best computer. It’s all about personal preference and what you can afford. MacBooks however are popular option for productivity  and I see a lot of people using them to take notes in lectures.",
      "author": "Frysterm",
      "created": 1636832947,
      "upvotes": 2,
      "replies": {}
    },
    "hkivl5v": {
      "link": "/r/college/comments/qt8jnr/which_computer_is_the_best_for_college/hkivl5v/",
      "text": "I started college with a windows laptop and it just couldn’t handle what I was doing. It was slow as hell and couldn’t run a lot of things at once. Switched to a MacBook Air and used that for the rest of my undergrad. It was awesome. I just got rid of it (6 years old). It was still running well and I didn’t have to get rid of it but I started my masters that’s completely online and needed a bigger screen (I have bad eye sight). Got a new MacBook Pro before the new one came out. This will probably last me for at least 10 years. They are expensive at the front but they definitely last longer. And work faster. My husband has a windows computer that was a $1500 computer and two years old and my MacBook Air that was 5 years old at the time still was faster.",
      "author": "zippyzeal",
      "created": 1636850096,
      "upvotes": 1,
      "replies": {}
    },
    "hkj2qhb": {
      "link": "/r/college/comments/qt8jnr/which_computer_is_the_best_for_college/hkj2qhb/",
      "text": "The Dell XPS 13 9305 is on sale for $650. I've been using it for a few months now and it's great.",
      "author": "JungleJohn224",
      "created": 1636853346,
      "upvotes": 1,
      "replies": {}
    }
  }
}