{
  "sid": "r5womo",
  "link": "/r/college/comments/r5womo/english_classes_as_bio_degree/",
  "title:": "English classes as Bio Degree",
  "text": "Hi! I am a senior in high school planning on majoring in biology. With this, I ask if in a bio degree are you required to take any English classes? I have already taken ENC1101 and ENC1102 and I am currently taking AP Literature. Does literature even matter in a bio degree? Is it a waste of time to take this course? is it part of the requirements for the degree? Thank you so much.",
  "author": "jasmine0411",
  "created": 1638304377,
  "updated": 1638480458,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmptmo1": {
      "link": "/r/college/comments/r5womo/english_classes_as_bio_degree/hmptmo1/",
      "text": "I am not aware of any degree, at any college, which does not require 2 semesters of English composition and grammar.  Whether the 2 classes you took meet that requirement can only be determined by the college you attend.  \n\nFor general education requirements, there is no \"one size fits all\" answer.  College websites will often list each course one must take for each major.  Looking on the sites of schools you are considering attending will give you the answer.",
      "author": "taxref",
      "created": 1638309509,
      "upvotes": 3,
      "replies": {
        "hmqctj8": {
          "link": "/r/college/comments/r5womo/english_classes_as_bio_degree/hmqctj8/",
          "text": "> which does not require 2 semesters of English composition and grammar. \n\nIt sounds like OP has maybe taken those at a college already:\n\n> ENC1101 and ENC1102\n\nUnless they are referring to their HS classes, though I've never seen a HS have that numbering system.",
          "author": "kingkayvee",
          "created": 1638317758,
          "upvotes": 2,
          "replies": {}
        },
        "hmquctv": {
          "link": "/r/college/comments/r5womo/english_classes_as_bio_degree/hmquctv/",
          "text": "My college only requires English 101. Other English classes can be taken to fulfill other requirements, but those requirements don’t need to be fulfilled by English classes specifically",
          "author": "when-words-fail",
          "created": 1638325632,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmpt8xl": {
      "link": "/r/college/comments/r5womo/english_classes_as_bio_degree/hmpt8xl/",
      "text": "It’s not gonna be part of the requirements for the degree, but a lot of colleges have it as a general graduation requirement",
      "author": "when-words-fail",
      "created": 1638309355,
      "upvotes": 1,
      "replies": {
        "hmqcmuv": {
          "link": "/r/college/comments/r5womo/english_classes_as_bio_degree/hmqcmuv/",
          "text": "> but a lot of colleges have it as a***n option of a course that you can take as part of your*** general graduation requirement\n\nFTFY",
          "author": "kingkayvee",
          "created": 1638317674,
          "upvotes": 3,
          "replies": {
            "hmqu57u": {
              "link": "/r/college/comments/r5womo/english_classes_as_bio_degree/hmqu57u/",
              "text": "My bad, I misread the post and though OP was asking about English classes in general",
              "author": "when-words-fail",
              "created": 1638325536,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}