{
  "sid": "qrcu5h",
  "link": "/r/college/comments/qrcu5h/how_to_go_about_dealing_with_a_professor_who/",
  "title:": "How to go about dealing with a professor who doesn’t like me?",
  "text": "hello,\n\nI am currently taking my undergraduate classes at an NU online, and I have an instructor who has a completely ignored me in my comment asking about my grades and how I can improve them. My director read the message and she thinks that the instructor probably felt like I was “belittling her degree” by challenging the grade she gave me, and my director is saying I should take caution in dealing with her. \n\nNot only this, she has also been lowering my grades. Two times now I have experienced her going in and giving me a low B, which I was already upset about because I had put in so much effort, and then changing an hour later to keep my overall grade at a C. **this is absolutely infuriating** as I have never in 14 years of school had an instructor go back in and **lower** a grade. This has lead me to completely stop communicating with her, and instead talk to my advisor about allowing me to switch to a different class. Unfortunately it is past the one week timeframe I have to order to drop or add a class. In my opinion this is unfair, because you don’t actually start talking to your instructors until they grade your assignments which is usually halfway through week two. My two directors and my mentor both said that they think I should try to get out of this class or at least try talking to her about what she has been doing, but I don’t wanna make the situation worse, and I don’t trust that she will allow me even a smidgen of a fair education if I confront her.\n\nWhat should be my course of action here? My Academic adviser stated that he did not find any evidence of any animosity from her. I have also explained to him that I’ve already been compiling a list of things she has done that seem suspicious. And that I do not want to give it to him unless I absolutely need to. My goal is not to destroy this woman’s career, it is to get a fair education. And I don’t think that our getting off on the wrong foot should dictate whether or not she gets to teach.\n\nTLDR: I paid Like $1500 a class. My Instructor is not treating me fairly and is tanking my grades for no reason. I absolutely refuse to take this lying down, and I am going to get a fair education if it is literally the last thing that I do. Please advise. Thank you.",
  "author": "GokuG0D",
  "created": 1636604975,
  "updated": 1636654801,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hk6m5s1": {
      "link": "/r/college/comments/qrcu5h/how_to_go_about_dealing_with_a_professor_who/hk6m5s1/",
      "text": "If you have the evidence you claim to have then just try to appeal the grade. If a teacher’s biases affect how they do their job then it’s clear they’re incompetent in their role as an educational instructor. \n\nBut really I think there’s more then you’re letting on here. A teacher generally isn’t offended when you question the grade you received. They may be annoyed, but not to the point where they hold a vendetta against you.",
      "author": "kizeltine",
      "created": 1636622193,
      "upvotes": 2,
      "replies": {}
    },
    "hk6k8rw": {
      "link": "/r/college/comments/qrcu5h/how_to_go_about_dealing_with_a_professor_who/hk6k8rw/",
      "text": "Unfortunately they can do that, just gulp it and move on.",
      "author": "sundowner17442",
      "created": 1636620489,
      "upvotes": 1,
      "replies": {}
    },
    "hk71k2t": {
      "link": "/r/college/comments/qrcu5h/how_to_go_about_dealing_with_a_professor_who/hk71k2t/",
      "text": "Concerning the grade change: you would have to have some evidence that you recieved a grade or score equal to a B on the assignment itself. For example having the physical paper with a score of 81 written on it and the cutoff for a B is 80. A professor going back and changing a grade within a couple hours is less indicative of misconduct and more likely a correction.\n\nYour advisor sees no evidence of misconduct, so it is unlikely other faculty will. If you have evidence that you don't want to show them then you can go to an ombudsman or student affairs to talk about it confidentially. \n\nYou say you want a fair education, but have not discussed the content of the class. Your concern seems more with assessment.",
      "author": "hdorsettcase",
      "created": 1636634174,
      "upvotes": 1,
      "replies": {}
    },
    "hk7duyo": {
      "link": "/r/college/comments/qrcu5h/how_to_go_about_dealing_with_a_professor_who/hk7duyo/",
      "text": "I would hold off on assuming that your prof doesn’t like you and set up a virtual office hour to discuss your grades.",
      "author": "seagreengoddess",
      "created": 1636640554,
      "upvotes": 1,
      "replies": {}
    }
  }
}