{
  "sid": "qrr33w",
  "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/",
  "title:": "How screwed am I if i wanted to switch Majors?",
  "text": "Im a junior at a university majoring in economics and I already have an associates degree in Business Administration. Its kinda popped into my head that I would like to pursue engineering as i like the hands on aspect of it. Would it be worth it to switch or could I still pursue a career in that field with my degree? Would a minor help?",
  "author": "Seadog1826",
  "created": 1636653859,
  "updated": 1637387387,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk8c291": {
      "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk8c291/",
      "text": "Of course, try new things or a thing you love!",
      "author": "FallCompetitive7976",
      "created": 1636654733,
      "upvotes": 1,
      "replies": {}
    },
    "hk8lmgs": {
      "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk8lmgs/",
      "text": "Engineering is a major that is harder to transfer into as there are so many prerequisites for the upper level courses. I recommend talking to your current advisor and a professor in engineering to see what is possible.",
      "author": "Katherington",
      "created": 1636658575,
      "upvotes": 10,
      "replies": {}
    },
    "hk8ddjm": {
      "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk8ddjm/",
      "text": "You should switch majors if it’s really what you want to do. Just keep in mind you might need to take summer classes or attend college for an extra year to fit in all the requirements.",
      "author": "gearbox45",
      "created": 1636655256,
      "upvotes": 5,
      "replies": {
        "hk8lrh4": {
          "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk8lrh4/",
          "text": "Thats the problem. Im out of state and switching woulf probably cost me another 3 years at school. I dont have the money for that",
          "author": "Seadog1826",
          "created": 1636658631,
          "upvotes": 1,
          "replies": {
            "hk8ud7p": {
              "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk8ud7p/",
              "text": "I'm a career changer (went into something different after my bachelor's) and my advice is that you should absolutely go for engineering if that's what you want to do, but if you can't afford it right now you should graduate with your economics degree and get a job and live as frugally as possible so that you can save money to go back to school to study engineering. \n\nIn the meantime, take as many engineering courses you can while you're in your current program.\n\nThat's if you *really* can't afford it though. If you are able to find the money for it, the better option is to just switch majors now. \n\nBe mindful that engineering has high fail rates, so an extra 3 years could easily turn into an extra 4 years so weigh the risks appropriately.",
              "author": "HumanDrinkingTea",
              "created": 1636662170,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk9hgve": {
      "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk9hgve/",
      "text": "How are your grades? Do you like math? How much student debt do you have?",
      "author": "Nodeal_reddit",
      "created": 1636671898,
      "upvotes": 2,
      "replies": {}
    },
    "hk8tdbx": {
      "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk8tdbx/",
      "text": "That’s a very tough one. Have you taken any engineering prerequisites?",
      "author": "dalej42",
      "created": 1636661760,
      "upvotes": 1,
      "replies": {
        "hk8u7wo": {
          "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk8u7wo/",
          "text": "Nope, thats the problem. I think i will just minor in engineering",
          "author": "Seadog1826",
          "created": 1636662108,
          "upvotes": 1,
          "replies": {
            "hk96auv": {
              "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk96auv/",
              "text": "Gonna be honest a minor in engineer (if that even exists) is gonna be useless. Nobody will hire you with that at least for an engineering role. Also is it the hands on aspect you like or the problem solving? \n\nIf it’s hands on id look into getting certifications that allow you to work as a technician. Stuff like welders, machinists, CNC, mechanic, etc. If your school offers these sort of classes then take a couple there. If not almost all community colleges or tech schools have some form of weekend or night classes, so you take a course  there without it interfering with your university classes. It would let you work in a hands on setting and while your degree wouldn’t be helpful currently, In the future if you wanted to move to a management/office job a business degree would beneficial.\n\nIf it’s really the problem solving engineering aspect, the really weight your options. Engineering is a lot harder if a degree than business and it’s quite common to see people switch to easier majors or dropout all together. I’m not saying you can’t do it, but be realistic and know this is at least 3 more years of schooling. Best of luck man!",
              "author": "HighwayDrifter41",
              "created": 1636667083,
              "upvotes": 3,
              "replies": {
                "hk9crpo": {
                  "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk9crpo/",
                  "text": "No i realize that that a minor in something like industrial engineering wont get me an engineering job,  i just feel it could open up a pathway that involves working in management for an engineering company. Im not sure to be honest. Im not against doing something in business, just not something boring like a banking or investment company. If you kinda understand what i mean",
                  "author": "Seadog1826",
                  "created": 1636669834,
                  "upvotes": 1,
                  "replies": {}
                },
                "hk9dj4u": {
                  "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk9dj4u/",
                  "text": "And im open to alot of options, like i have a strong interest in the aviation industry. I just still dont know what id like to do in it",
                  "author": "Seadog1826",
                  "created": 1636670169,
                  "upvotes": 1,
                  "replies": {
                    "hk9h2io": {
                      "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk9h2io/",
                      "text": "If you’re looking to test the waters with engineering and work on a cool project, I’d head down to your schools formula sae (FSAE) team work shop and ask if they’re looking for extra help. At least that my school were always looking for extra help and people would probably be happy to talk to you about engineering and what it’s like. Also if you apply to an business position at engineering company, FSAE is pretty well known in the engineering community so it could be a good talking point in an interview and on your resume.",
                      "author": "HighwayDrifter41",
                      "created": 1636671718,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk9lnts": {
      "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk9lnts/",
      "text": "I switched from neuroscience to engineering in my junior year. I'll be in school for an additional year so I'm graduating as a 5th year senior. I had alot of the prereqs and even then it extended it by a while",
      "author": "Low-Complex-5168",
      "created": 1636673835,
      "upvotes": 1,
      "replies": {}
    },
    "hk9qdk4": {
      "link": "/r/college/comments/qrr33w/how_screwed_am_i_if_i_wanted_to_switch_majors/hk9qdk4/",
      "text": " not only worth it to switch, but u are going into a very high paying field too, do it! im an engineer",
      "author": "ghostmode342",
      "created": 1636676275,
      "upvotes": 1,
      "replies": {}
    }
  }
}