{
  "sid": "q7yqdr",
  "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/",
  "title:": "HELP! I submitted the wrong script and now my professor thinks that I'm cheating",
  "text": "I had a group project from a programming class to be turned in last friday. We worked hard for it and asked the professor several questions. But before turning in the assignment, one of my classmates had a doubt about a graph we did. So I asked one of my friends who had taken this class before, since she might know something, but instead she gave me the script they did. I used our data to run their script, but the answers were different. It was weird but we didn't think much of it and didn't change anything on our script.\n\nThe thing is that at the moment of submitting the script, I wrongfully submitted my friend's script. I didn't realise that until the professor talked to me yesterday.\n\nShe started by saying that she had already reported us since we turned in someome else's work. I immediately knew that I messed things up, so I tried to explain that we just used that script to test something we weren't sure about and that our script was completely different. Thankfully, she asked me to send her our script. But when I asked her what would happen to us (since we've been already reported), she said that we'd be dropped off from class or get a 0 for this assignment. She added that we should wait and don't withdraw from this class (idk whether she was caring for us or she wouldn't be able to punish us if we withdrew).\n\nI'm really afraid of getting an academic sanction since I have very good grades and I'm trying to get into a prestigious grad school next year. So, I wrote an appoligizing letter to her today.\n\nThere are still somethings that favor us:\n- the 2 scripts are very different (there are parts that look similar, since they were either on the scripts used in class or found online)\n- we sent a mail asking several questions (with a screenshot included), and what the professor answered were well incorporated in our script\n- given the same data, the answer on both scripts are different\n- we didn't put our names or anything like that on my friend's script (so that's not appropiation or plagiarism)\n- I sent our script to the professor right there, so there was no time to edit \n\nI'm really afraid how this is going to turn out, she said that she would speak to us again on Friday about the final decisions. What do you think this will turn out? I'm not sure how strict is my university about this, but I know some cases that were solved between the professor and the student by just giving a lower mark (they didn't report the student). But my professor seems to make things more serious.",
  "author": "asdfvbmm987",
  "created": 1634214719,
  "updated": 1634584126,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.25,
  "comments": {
    "hgn1tlq": {
      "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/hgn1tlq/",
      "text": "At most places, you cant withdraw from the class if you are I being investigated for an integrity violation.",
      "author": "PersephoneIsNotHome",
      "created": 1634235217,
      "upvotes": 1,
      "replies": {
        "hgn2pfm": {
          "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/hgn2pfm/",
          "text": "Would you consider this case a integrity violation?",
          "author": "asdfvbmm987",
          "created": 1634235587,
          "upvotes": 1,
          "replies": {
            "hgn9wve": {
              "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/hgn9wve/",
              "text": "Yes. I would report.  At my school there were likely be a record and if there were benefit of the doubt you would have to do remediation and it would be on record.  So if this unfortunate and total accidental mixup never happens again there would be no further outcome.\n\nIf I had done specific warnings about looking at other peoples scripts, code or making sure your uploads were checked for before submission, or any other reason I would also report and recommend a more stringent penalty",
              "author": "PersephoneIsNotHome",
              "created": 1634238578,
              "upvotes": 1,
              "replies": {
                "hgnhqrl": {
                  "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/hgnhqrl/",
                  "text": "Thanks for the insight. I don't think this kind of things will ever happen again, this was honestly the first time. She never mentioned anything related to this, but we're supposed to not use because of common sense, and I never thought that the assignment was the same from last semester until my friend sent it to me. I'm making a doc with all the steps we did and the sources we took those codes from (it's allowed to use class codes and search on the internet). Do you think this will make things better?",
                  "author": "asdfvbmm987",
                  "created": 1634241804,
                  "upvotes": 1,
                  "replies": {
                    "hgnmon4": {
                      "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/hgnmon4/",
                      "text": "You saw that the assignment was the same and then still used the friends script or code?  \n\nHow will that make it better?\n\nYou need to stop thinking about it .\n\n\nThere is nothing you can do about it now\n\nFind a friend to watch something with and think about something else.\n\nYou will know when you know and anything anyone says now is only going to make you either worry unnecessarily or be disappointed.",
                      "author": "PersephoneIsNotHome",
                      "created": 1634243841,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgngne0": {
      "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/hgngne0/",
      "text": "Faculty here.\n\nTough situation.  Objectively, you're guilty of academic dishonesty, because there's no doubt that you formally submitted someone else's work under the names of your group.  \n\nSo, as you've already realized, the key thing here is to get the professor to understand that it was an honest mistake, assuming it truly was.  The substantial difficulty you're facing, though, is that almost every professor has had cheaters in the past who made the same claim (\"I didn't mean to upload that essay I downloaded off the internet, I was just using it to help me figure out how to format my own work.\" \"I didn't mean to copy someone else's homework answers word-for-word, I was just using them to help me figure out the answers on my own.\"  And so forth.) But, unsurprisingly, the vast majority those people were lying to try to weasel out of the consequences of their actions.  So your professor's first inclination will, understandably, be to assume you're probably lying too.  The fact of the matter is that cheating is rampant on US college campuses.\n\nStill, the fact that there is a record of your group doing its own work will help you.\n\nSo hopefully the professor will come to some kind of satisfactory arrangement with your group, but you have to keep in mind that \"satisfactory arrangement\" doesn't necessarily mean \"we get off with no consequences whatsoever.\"\n\nIf the professor doesn't believe that your group did its own work, then you could always file a grade appeal.  That's a tedious thing to do, though, and the process usually isn't very quick.  Furthermore, since the accusation is cheating/academic dishonesty, you'll likely encounter a skeptical audience in whoever it is that hears your appeal.  So, best advice is to organize all your documentation and written records, code archives, revision history, etc., and be ready to lay everything out from beginning to end in a logical manner.  Most importantly, you need to approach this situation from the point of view of being apologetic/conciliatory.  No emails or conversations that could be seen as whiny, entitled, aggressive, or demanding.  So, just be sure to keep all communication about this matter professional and cordial, and hopefully things will go smoothly.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1634241355,
      "upvotes": 1,
      "replies": {
        "hgnj17x": {
          "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/hgnj17x/",
          "text": "Thanks a lot for the insight! I'm making a document with the sources where we took our script from (codes from class and searching on internet are allowed), I hope this can be useful. I'm also afraid that she might think that we did the same for the other 2 assignments, which we didn't and she can check that",
          "author": "asdfvbmm987",
          "created": 1634242334,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgq471k": {
      "link": "/r/college/comments/q7yqdr/help_i_submitted_the_wrong_script_and_now_my/hgq471k/",
      "text": "[removed]",
      "author": null,
      "created": 1634296219,
      "upvotes": 1,
      "replies": {}
    }
  }
}