{
  "sid": "qlibs7",
  "link": "/r/college/comments/qlibs7/strategies_for_time_management/",
  "title:": "Strategies for Time Management!",
  "text": "Hi everyone! I wanted to share some tips for time management that I’ve learned over the years.\n\nI think one of the most important things to manage your time is to make a plan or use a schedule. When I have a plan for the day, I can get started on my school work and other tasks without having to think so much about what I should do first. If we plan for 1 hour, we can save several hours in the execution of the task. Usually I’ll make a plan for the day the night before, so I am already mentally prepared when I wake up and I can get started right away. Making a plan doesn’t have to be complicated. Most of the time I just make to-do lists and that works really well for me.\n\nAnother thing that is really helpful for time management is figuring out your priorities, or what is the most important for you in life. This might be doing well in school, expanding your social circle, boosting your extracurriculars on your resumes, or spending time with your family. Everyone is going to have different priorities, but it’s important to know what they are, so you can make time for them in your schedule.\n\nI think it’s also important to be realistic about how much time you have. Some of my professors have recommended that for every 1 hour of class, we should be spending 2-3 hours of time outside of class doing assignments, projects, or studying. We may also have a part-time job, extracurricular activities, and need to do things to care for physical and mental health, like personal hygiene, eating, sleeping, and exercising. It can be helpful to know where all your time goes in the day and in the week, and sometimes we might even have to reduce the number of activities we’re involved with if we realize that we have taken on more than we can handle. Even if you could handle another activity, sometimes it can be good to have a bit of extra time for rest and relaxation.\n\nI also made a video on time management strategies for anyone who’s interested: [https://youtu.be/QhQcaC6pjN4](https://youtu.be/QhQcaC6pjN4) :)",
  "author": "lindaedith",
  "created": 1635899028,
  "updated": 1636137572,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {}
}