{
  "sid": "prmbja",
  "link": "/r/college/comments/prmbja/gap_semester/",
  "title:": "Gap Semester",
  "text": "Hello, I’ve been considering taking a gap year for my mental health. I currently live in a fraternity house and being constantly surrounded by people has become overwhelming. I’m very behind in all of my classes and the only reason I’m here right now is for my close friends. I do have some friends in my fraternity house, but my mental health has caused me to isolate myself. I hate that I’m going through this because I know I would have a great time with my friends, but my head is holding me back. If I go home, I would seek treatment, but I would also be without friends and stay with my mother and brother. The friendships I’ve cultivated at college are extremely crucial to my mental health, but I still feel like I need to take a break. Remaining here would most likely further harm my relationships and negatively change how people view me. Going on a gap semester would be for treatment as well as cultivating discipline. I would also be working. Do you think I’d be stupid to do this or should I remain in college and tough it out?",
  "author": "West_Seaweed5914",
  "created": 1632106891,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hdkcnfl": {
      "link": "/r/college/comments/prmbja/gap_semester/hdkcnfl/",
      "text": "[removed]",
      "author": null,
      "created": 1632122193,
      "upvotes": 1,
      "replies": {}
    },
    "hdjqx7g": {
      "link": "/r/college/comments/prmbja/gap_semester/hdjqx7g/",
      "text": "I think that a gap semester is one of the best things that you could do.  I personally wouldn’t live in a  traditional frat house because its would just be too much for me. The gap semester would give you some time to think about if the frat house is right for you, if you are going down the right career path, and maybe you could have some fun (maybe do some traveling or work a fun job).  I never got a chance to take a gap semester/year because I was an early college student & was forced to go directly into university.  In my opinion, you won’t regret taking it (especially if you do something fun, earn some money , or do something else that is meaningful to you).",
      "author": "ClearAndPure",
      "created": 1632107702,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634054210
}