{
  "sid": "q315be",
  "link": "/r/college/comments/q315be/i_wanna_quit/",
  "title:": "i wanna quit",
  "text": "i’ve barely been 3 months into community college and i already want to leave. my major is graphic design but i have to take stats and english. despite being a graphic design major, english is my easiest class. i’m failing art, and i’m failing statistics. i’ve heard from a lot of people that college isn’t needed for graphic design just experience but i don’t know what to do. i don’t want to look like a failure cause i quit so early but at the same time i don’t want to continue and wish i had left a long time ago when i could. thoughts? :(",
  "author": "natali3iscool",
  "created": 1633580436,
  "updated": 1634083633,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hfoy0j1": {
      "link": "/r/college/comments/q315be/i_wanna_quit/hfoy0j1/",
      "text": "You should speak to an academic advisor and more people that are in this field. I would definitely check what employers are asking for in job postings nearby.\n\nRegardless of whether you decide to continue or not, don't let other peoples thoughts control you. Especially when it comes to decisions for your career. I know it is easier said then done but just wanted to emphasize it.",
      "author": "Traaaaaaaaap",
      "created": 1633580841,
      "upvotes": 2,
      "replies": {}
    },
    "hfp023s": {
      "link": "/r/college/comments/q315be/i_wanna_quit/hfp023s/",
      "text": "Believe me, my best class I took for an A was a Japanese history class. Not my major at all but did well in it. So no worries if your class is easy and since you’re there to learn which should be a hard classes In your major for learning unless that professor makes it complicated and not a great instructor. You’ll know when you get one. Have you gone to tutoring or office hours? If you’re not understanding the material then you should go to one or the other really recommended. YouTube and google is also a good resource for stats. Like other comment said, don’t let other decide your career. You might want to answer if you truly want to quit school or if you are just feeling overwhelmed with the material. You can always take part time college work if you need to work on college readiness like studying and all that. There’s no rush when it comes to college",
      "author": "ThicccPanta",
      "created": 1633581944,
      "upvotes": 1,
      "replies": {}
    }
  }
}