{
  "sid": "pxh3b5",
  "link": "/r/college/comments/pxh3b5/is_there_a_genuine_benefit_of_campus_jobs_over/",
  "title:": "Is there a genuine benefit of campus jobs over independent ones?",
  "text": "I hate my (non campus) job. It's not that it's *that bad*, really. It's just a group of rich people with multiple advanced degrees from ivy league (or the international equivalents, Oxford, Cambridge, etc) institutions doing nothing in the field they studied apart from mouth service or even making things worse, but if you've heard of the group you immediately think it's amazing when really all of the money goes into expensive vacations. ALL OF THE TIME for the execs, close to minimum wage for me, and it seems like everyone does everything to be as inefficient as possible which just amazes me- like you really did all of your schooling for *that? Really?* Almost half of my time is spent correcting mistakes that were made because of said inefficiency or making fake smiley small talk in meetings that should have just been a freaking text message.\n\nI've been actively avoiding work (I work remotely) without realizing it and making excuses because of this because it just makes me so angry and was giving me an existential crisis, like is this really what I'm working towards? It's the idealistic college kid's nightmare of what happens and it's a tough course of study so I really don't need that nightmare. It's also an over-achiever's nightmare and every time I've tried to suggest things I could do which could actually help our cause I've gotten shot down with a death glare. \n\nBut I work remotely with pretty flexible hours, a fairly low stress job if you ignore the existential dread and soul crushing part, and make a few dollars more than minimum wage. My schedule is set up so that I can travel during the weekends once I save up enough and travel restrictions get better which is also awesome and hopefully means I can see my friends. \n\nSo is there a genuine benefit of campus jobs over this? Can/should I quit my current job for a campus one which makes less but is possibly more fun?",
  "author": "Throwaway2104891056",
  "created": 1632866569,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hep25ay": {
      "link": "/r/college/comments/pxh3b5/is_there_a_genuine_benefit_of_campus_jobs_over/hep25ay/",
      "text": "i got a campus job because i know that they understand my school schedule and that education comes first. plus it’s just a four minute walk from my dorm and i don’t have a car so it’s perfect.",
      "author": "EdelwoodOil",
      "created": 1632899053,
      "upvotes": 1,
      "replies": {}
    },
    "heowc0g": {
      "link": "/r/college/comments/pxh3b5/is_there_a_genuine_benefit_of_campus_jobs_over/heowc0g/",
      "text": "I think  on campus jobs keep you closer to where you live sometimes if your in a dorm or near campus. They are also better at understanding you have school and can accommodate to that. There are also some jobs that you can do your schoolwork while at work! Depends on the job but I like on campus more.",
      "author": "Jfogs2020",
      "created": 1632894554,
      "upvotes": 1,
      "replies": {}
    },
    "henrdsz": {
      "link": "/r/college/comments/pxh3b5/is_there_a_genuine_benefit_of_campus_jobs_over/henrdsz/",
      "text": "I don’t think the campus vs non-campus thing is a big deal. The only benefits I can think of are you get to be around other students at your school and you can get a reference from someone affiliated with the school. But ultimately, it boils down to the job itself. Whether you like the job (or can at least tolerate it) is all that matters, regardless of whether it’s on or off campus.",
      "author": "ludgatedwyer500",
      "created": 1632872988,
      "upvotes": 1,
      "replies": {}
    },
    "henl2t1": {
      "link": "/r/college/comments/pxh3b5/is_there_a_genuine_benefit_of_campus_jobs_over/henl2t1/",
      "text": "It honestly depends on how soul sucking the job is. If it’s enough that it’s impacting your mental health/ making you view school in a different light than it really isn’t worth it. I have a campus job at my school’s library and I love it. I work the desks and so long as no one approaches me to ask questions, I can just do my homework. I do get a decent amount of questions during busy hours but they’re all pretty simple (where’s the bathroom, do you know how the printer works, etc.) I had 21 credits last semester and worked there 5 days a week and still maintained a 4.0 because I could study the whole time I was at work. The other big benefit is that they’re way more understanding. No other job I’ve had has ever cared if I have an exam coming up but at the library they understand if I can’t work because I have a huge test the next day. So if you’re able to find a desk job on campus? Definitely worth it.",
      "author": "Sweet_Coffee4823",
      "created": 1632870034,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634051746
}