{
  "sid": "rgqxwu",
  "link": "/r/college/comments/rgqxwu/not_sure_what_is_the_right_decision/",
  "title:": "not sure what is the right decision..",
  "text": "i have no one to help me out rn so i’m asking here. i’m in college atm and am thinking of dropping out of this current one and transferring to another. i don’t feel like i fit in at this college, smth feels off. no matter how many great people i meet i feel disconnected with everything. idk how to properly describe it but yeah. i’ve been to other schools where i did feel like i’d enjoy it there but this was the cheapest school and now i’m rethinking things. so i was thinking of just taking the spring and summer time to really think about what i want from college, what it is i really want to do, and also where it’s best for me to attend (environment and program wise). am i going about this right? anything i should ask myself before officially dropping out of this school?",
  "author": "layz02",
  "created": 1639544236,
  "updated": 1639787942,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "holyou3": {
      "link": "/r/college/comments/rgqxwu/not_sure_what_is_the_right_decision/holyou3/",
      "text": "Have you been at this school prior to COVID? A lot of people feel discombobulated right now. Lot of helpful articles online about transferring. Before you drop out make sure the credits you have earned will transfer with you",
      "author": "hasrocks1",
      "created": 1639545471,
      "upvotes": 1,
      "replies": {
        "honvrvs": {
          "link": "/r/college/comments/rgqxwu/not_sure_what_is_the_right_decision/honvrvs/",
          "text": "i’ve visited the school before covid but started to attend this year :/ didn’t think about how covid can effect things. i guess i can see it. thank you",
          "author": "layz02",
          "created": 1639586878,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}