{
  "sid": "qgd8bb",
  "link": "/r/ApplyingToCollege/comments/qgd8bb/common_app_supplement_essays_due_in_4_days/",
  "title:": "Common app & supplement essays due in 4 days",
  "text": "I was recently informed that I have to complete my common app & compulsory supplementary essays by 1st NOV. I haven't started writing either and it's freaking me out, any advice/tips??\n\nAlso, how do I approach the UMaryland supplement questions as they are very different from the usual supplement questions. Why have they given these questions? Are they to assess our writing ability??",
  "author": "nothisisluz",
  "created": 1635274010,
  "updated": 1635301703,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hi5e588": {
      "link": "/r/ApplyingToCollege/comments/qgd8bb/common_app_supplement_essays_due_in_4_days/hi5e588/",
      "text": "I always advise to just start writing. As someone who writes pretty good, some of my stuff is really good, some of it just needs tweaks, and some of it I rewrite/restructure to reiterate a point or whatever I need. But having the outline done is 50% of the process, no doubt.\n\nFor me personally, on one essay the hook was completely perfect. The middle needed a few tweaks to make my point more clear and concise, and the ending was rewritten because I wanted a more clear example of my personality showing and didn't want all of it to be so \"theoretical\" if you can get what I'm saying. On another, I rewrote the entire thing but the ideas stayed the complete same per paragraph.",
      "author": "Xymes",
      "created": 1635274713,
      "upvotes": 2,
      "replies": {
        "hi5glqm": {
          "link": "/r/ApplyingToCollege/comments/qgd8bb/common_app_supplement_essays_due_in_4_days/hi5glqm/",
          "text": "Thanks, better get working on the outline then",
          "author": "nothisisluz",
          "created": 1635275678,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi6kz69": {
      "link": "/r/ApplyingToCollege/comments/qgd8bb/common_app_supplement_essays_due_in_4_days/hi6kz69/",
      "text": ">Also, how do I approach the UMaryland supplement questions as they are very different from the usual supplement questions. Why have they given these questions? Are they to assess our writing ability??\n\nAn AO (or some admissions person) at UMD has said these are pretty much for fun. Don't stress them too much, just answer. If you're spending more than, like, 30 minutes on them you're overthinking it.",
      "author": "FuriousGeorge1435",
      "created": 1635292352,
      "upvotes": 1,
      "replies": {}
    }
  }
}