{
  "sid": "q72o9a",
  "link": "/r/ApplyingToCollege/comments/q72o9a/i_need_advice/",
  "title:": "I need advice",
  "text": "I have some questions that I cant get answered. I've emailed people and talked to my counsellors but I just cant get straight forward answers about some stuff.\n\n1. My father has limited involvement in my life. Hes in prison and has a lot of mental health issues. I'm trying to fill out his information on my college apps but I dont have everything I need. I know he used to be an engineer and has a bachelor's degree, but I dont know when he graduated, what he majored in, or where he graduated from. He is unable to give me this information so I have to leave it blank. Common App is not allowing me to do this and I've previously emailed them for help. They told me to just choose the limited information option but I have already done that. It still wants that information. What do I do? That section is showing as incomplete and I dont want it to mess up my application last minute.\n2. I'm in the process of finishing my Girl Scout Gold Award. I know I shouldn't have left it last minute but I had a lot of issues completing it. I have to wait for the committee to review my project and give me the award. That could take at least 2 weeks and EA is due in 20 days. Should I write on my application that I've started the project or say that I completed? How do I phrase it on my application? Do I put it in my activity section with the rest of my girl scout information or do I put it under awards? My gold award is worth over 80 volunteer hours but my high school will not count it. Should I state the volunteer hours with girl scouts or the award or not at all?\n3. My college essay technically answers 2 different prompts. I didnt plan for this to happen when I wrote it. Its about my identity/background and growing to accept it. Does it matter which prompt I choose? I dont know if the prompt you pick actually matter.\n4. I started a job in September as a paid math tutor at my local college. I currently have over 10 activities so I'm not sure if I should include this job. I only just started it but its themed towards my major. I'm planning on applying as an engineering major so I dont know if it's worth including. I already have a 2nd paid job that I've been doing for 7 months but that one's not centered around my major. I've also been an volunteer SAT tutor for over a year. Is it worth including both jobs in my activities section and cutting out other stuff? How do I decide what's worth keeping?\n5. How do schools verify our extracurriculars? I chose to become a volunteer SAT tutor on my own and I'm not doing it through an organization. Will they need me to provide proof? I haven't kept track of the total hours because I already have 300+ through my other activities. \n6. One of the applications asks about my sexuality. They dont say how that information will affect my application or if other people could view that info after submission. My parents are extremely religious so I'm not sure if I should answer truthfully. Why would a college want to know this? Is it worth answering truthfully?\nI'd really appreciate it if anyone could help me out with any of these questions. Or maybe just tell me where to go for help. Thanks in advance.",
  "author": "EmmenRose",
  "created": 1634096175,
  "updated": 1634167107,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgfzve0": {
      "link": "/r/ApplyingToCollege/comments/q72o9a/i_need_advice/hgfzve0/",
      "text": "Hi, I cannot really answer some of your questions but I'll try and answer others.\n\n3. Common App's essay prompts are more of a push to come up with ideas if you cannot think of what to write. It doesn't really matter which prompt your choose or if you choose a provided one at all.\n\n4/5. If you're worried about adding more than 10 activities, many colleges will let you submit a full resume of extracurriculars. You might have to talk to advisors for those specific colleges though.  \nIf you want to cut stuff out, I would at least keep the tutoring (both paid and unpaid) and anything similar.\n\n\n6. I was in the same boat and I ended up changing it after my parents looked over my applications. They won't be able to see what you put down unless you show them/give them access to the application. Also, I believe answering won't affect your application, I think it's really only for statistics/demographics purposes and so that colleges can claim that \"#% of LGBT go here\" if you choose to go. If you're worried, just put straight or prefer not to say. As of now, I/my college experience hasn't been affected by what I put down.\n\nEDIT: saw a typo",
      "author": "txicab",
      "created": 1634097734,
      "upvotes": 3,
      "replies": {
        "hgh0uop": {
          "link": "/r/ApplyingToCollege/comments/q72o9a/i_need_advice/hgh0uop/",
          "text": "Thanks for replying. I've talked to some of the colleges that allow resumes and they said they only view them if they have time. Would it be better to put it in my additional information section? Also, the college wont start sending me emails about LGBT clubs or anything, right?",
          "author": "EmmenRose",
          "created": 1634126047,
          "upvotes": 2,
          "replies": {
            "hgibvrk": {
              "link": "/r/ApplyingToCollege/comments/q72o9a/i_need_advice/hgibvrk/",
              "text": "Additional information is mostly for explaining some of the activities you already listed in more detail. You should still send your resume anyways because it won't harm you whether or not they look at it. \n\nAlso, I don't think I received any info about specifically LGBT clubs from any colleges I applied to (both before and after getting accepted).",
              "author": "txicab",
              "created": 1634146898,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgg3tuw": {
      "link": "/r/ApplyingToCollege/comments/q72o9a/i_need_advice/hgg3tuw/",
      "text": "1. Can you figure out your fathers age & guess when he graduated with his bachelor's?  Any clues from family?  Also, the option for limited parent information should make certain questions for parent not required, but CA is nonspecific on what those questions are. Maybe try the other option \"No other parent to report?\"\n\n2. Girl Scout Gold Award project, 80 volunteer hours submission in committee review",
      "author": "roguezebra",
      "created": 1634099941,
      "upvotes": 1,
      "replies": {
        "hgh19va": {
          "link": "/r/ApplyingToCollege/comments/q72o9a/i_need_advice/hgh19va/",
          "text": "He was in the military so I believe his degree was a part of his training. It kind of complicates things. I'm trying to get a copy if his dd214 but the records office has only been working on emergency requests. Covid is making it hard for me access everything because my father's records are all paper copies. I have a 10 year range that I believe he got his degree in but that's too broad. If I put no parent then that makes it a little difficult to discuss my father later on. He's a big part of my essay so it would be weird if I put no information available. \nThanks for helping",
          "author": "EmmenRose",
          "created": 1634126317,
          "upvotes": 2,
          "replies": {}
        },
        "hgg73zx": {
          "link": "/r/ApplyingToCollege/comments/q72o9a/i_need_advice/hgg73zx/",
          "text": "Agree on the GS point.  My daughter completed her Gold Award. It is a ton of logistical hoops to jump through. Congratulations!",
          "author": "Octocorallia",
          "created": 1634101952,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hghet1p": {
      "link": "/r/ApplyingToCollege/comments/q72o9a/i_need_advice/hghet1p/",
      "text": "Does your grandma or mom know the info about your dad?\n\nIf not, just put unknown.  And then explain in the additional info section",
      "author": "admissionsmom",
      "created": 1634133402,
      "upvotes": 1,
      "replies": {}
    }
  }
}