{
  "sid": "qurmwa",
  "link": "/r/ApplyingToCollege/comments/qurmwa/grade_issue_for_uc_retaking_classes/",
  "title:": "grade issue for UC (retaking classes)",
  "text": "hi, *pls help asap*\n\ni am a high school senior interesting in applying to the university of california system. however, during covid-19 i was in distance learning for the first semester of my junior year and my internet connection was faulty for months. because of this, my grades suddenly fell much and I received some marks under a C. I brought my grades up again next semester to my normal high grades but the poor ones are still on my transcript. I read that the UC system does not replace marks used in gpa calculation if the course re-did is not as rigorous as the prior class but rather both would be looked at. The problem is that my school does not offer programs to redo courses at a higher level and only offers regular classes to make up a grade. One class I have this issue in is AP world history in which I got a D when enrolled in distance learning and my school principal didn’t make accommodations. (The rest are honors courses but they aren’t UC-approved so I think retaking them would replace the grade). Is it worth it to redo the class with a regular world history credit offered through my school and apply to UC or should i just give up now? (*link attached for reference about what i read regarding retaking classes and i’m an out of state student.)[link here](https://askmssun.com/academic-preparation-high-school/)",
  "author": "glossyducky",
  "created": 1637013619,
  "updated": 1637179712,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hks3e15": {
      "link": "/r/ApplyingToCollege/comments/qurmwa/grade_issue_for_uc_retaking_classes/hks3e15/",
      "text": "No, do not give up because the UC school system does admission by exception if you had an extenuating circumstance such as that. Maybe you don’t need to write an essay about that, but definitely write it in your additional comments, and it would help if your grades other than that are much higher of course.",
      "author": "Asleep_Course_7162",
      "created": 1637016625,
      "upvotes": 2,
      "replies": {
        "hksqaz3": {
          "link": "/r/ApplyingToCollege/comments/qurmwa/grade_issue_for_uc_retaking_classes/hksqaz3/",
          "text": "here’s the catch in my situation: i have a B in my second semester (0.5 credit) of APUSH, and the A-G requirements say that it’s possible to have 0.5 us history *while also having* 0.5 or more gov classes. would it be okay to only self report the APUSH semester that i did pass? or would it be worse because when i submit my official transcripts the AO would see the D that i didn’t self report and possibly rescind my acceptance?",
          "author": "glossyducky",
          "created": 1637026736,
          "upvotes": 2,
          "replies": {
            "hkss5vq": {
              "link": "/r/ApplyingToCollege/comments/qurmwa/grade_issue_for_uc_retaking_classes/hkss5vq/",
              "text": "No don’t leave anything out on your transcript man just add in additional comments why you got the D",
              "author": "Asleep_Course_7162",
              "created": 1637027550,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hks3lbg": {
          "link": "/r/ApplyingToCollege/comments/qurmwa/grade_issue_for_uc_retaking_classes/hks3lbg/",
          "text": "I will be honest and say it might be a low chance because it is mainly meant for home schooled students without transcripts but you can still be admitted. Good luck",
          "author": "Asleep_Course_7162",
          "created": 1637016708,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hks4rlj": {
      "link": "/r/ApplyingToCollege/comments/qurmwa/grade_issue_for_uc_retaking_classes/hks4rlj/",
      "text": "PSA, public universities tend to offer little to no need-based financial aid to out-of-state students and charge them more. OOS students pay 65-70k per year to attend UCs, no need-based aid. Run the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based financial aid estimate before you apply.",
      "author": "elkrange",
      "created": 1637017203,
      "upvotes": 1,
      "replies": {}
    }
  }
}