{
  "sid": "qf4ylo",
  "link": "/r/ApplyingToCollege/comments/qf4ylo/should_i_write_the_sexual_identity_essay_for_duke/",
  "title:": "Should I write the sexual identity essay for Duke if I am closeted?",
  "text": "For context, the optional prompt is:   \n**Duke’s commitment to diversity and inclusion includes sexual orientation, gender identity, and gender expression. If you would like to share with us more about your identity, you can do so here, or use any previous essay prompt you feel is appropriate.**\n\nI am a closeted bisexual (?) male applying ED to Duke.  I don't want to come off as disingenuous, but I'm wondering if it still might be important to write.\n\nI'm not out, so I don't have those same struggles that an openly queer person may have, but I have internal identity issues.\n\nAt the end of the day, I'm still trying to figure out my own sexual identity, and I don't know if that makes me a better or worse candidate for writing this essay.",
  "author": "adequatedesign",
  "created": 1635121710,
  "updated": 1636156566,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhxhk4e": {
      "link": "/r/ApplyingToCollege/comments/qf4ylo/should_i_write_the_sexual_identity_essay_for_duke/hhxhk4e/",
      "text": "I think, if you really wish, you definitely could write about your sexuality. Hell, you could discuss you being closeted if you wanted, how that has affected you, your reasonings, etc.",
      "author": "grapesgrapsgrapes",
      "created": 1635122260,
      "upvotes": 4,
      "replies": {}
    },
    "hhxiu01": {
      "link": "/r/ApplyingToCollege/comments/qf4ylo/should_i_write_the_sexual_identity_essay_for_duke/hhxiu01/",
      "text": "Hello! I saw that essay prompt while doing my RD application, and it’s designed to be optional. If you’re not comfortable discussing your sexuality yet, then it’s fine not to! Sexuality is something that may be very personal for one person, but very public and open for someone else; neither methods are wrong! And if you choose to do the essay (but you don’t want to explicitly state how you identify), you can discuss your experiences of being closeted- or even how sexual identity can also be a bit more undercover without it being less valid to someone else’s.\n\nJust remember to do what works for you, and that there’s no timetable or specific location to come out- to anyone in public, to any AO, or to yourself. I hope everything works out for you! ❤️",
      "author": "dragon_qu33n1",
      "created": 1635122897,
      "upvotes": 1,
      "replies": {}
    },
    "hhxiyrx": {
      "link": "/r/ApplyingToCollege/comments/qf4ylo/should_i_write_the_sexual_identity_essay_for_duke/hhxiyrx/",
      "text": "If your parents are not reading your application, I would write the essay.",
      "author": "thatcornellbitch",
      "created": 1635122964,
      "upvotes": 1,
      "replies": {}
    },
    "hi3hlj9": {
      "link": "/r/ApplyingToCollege/comments/qf4ylo/should_i_write_the_sexual_identity_essay_for_duke/hi3hlj9/",
      "text": "You don’t need to write this essay. It won’t help you get admitted.",
      "author": "policywoman501",
      "created": 1635242810,
      "upvotes": 1,
      "replies": {}
    }
  }
}