{
  "sid": "qlm5xi",
  "link": "/r/ApplyingToCollege/comments/qlm5xi/not_sure_how_to_approach_college_applications/",
  "title:": "Not Sure how to Approach college applications (Senior from Cali)",
  "text": "Hey everyone, So I am a senior in high school (Class of 2022) in California and everyone is currently stressed about college applications while I don't really know what I have been doing these oast few months. I am not sure if I plan on applying to a UC (definitely might try CSUs), and if I do, i really onlly have 28 days to write my 4 essays which I have not started. I also plan on majoring in biology since i do have soome sort of interest in it but My current acadenic status isn't terrible but its not good either so I feel like I have no chance and shouldn't even apply to a UC (\n\nI have a 3.3 UW GPA and 3.1 Weighted GPA, my ECs are weak since I have only been a member of Key Club for 4 years while not doing much in it. And stopped playing tennis my sophomore year at the beginning of the pandemic.I also didn't achieve much in quarantine... it was really depressing honestly) \n\nBecause of the deadline for UCs coming up on Nov. 30th, and my underwhelming academic high school life. I am not so sure where to apply to...Should I aply to CSUs and not UCs? Should I just go to the local communuty college 1 mile away from my school w/ free tuition and then transfer to a Uni? \n\nI am really stressed about this situation and honestly don't know what I can do... and what the future holds for me either. I am just thinking about forgetting abiut UC applications because I lost all hope of getting into a UC and just thought bout Community college\n\nWhat should I do? I wish i tried harder in HS.",
  "author": "Necessary-Pop-4525",
  "created": 1635911655,
  "updated": 1636136762,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hj3wea0": {
      "link": "/r/ApplyingToCollege/comments/qlm5xi/not_sure_how_to_approach_college_applications/hj3wea0/",
      "text": "It's totally normal to be stressed out around college applications. People put a lot of pressure on young adults to succeed and know exactly what they want to do and where they want to do it. \n\nThe most important thing to know is that the pressure is misplaced. You don't have to know exactly what you want to do. College is about figuring that out. \n\nAnd you don't need to know where you want to go. Any college in the US will give you an excellent and world class education. \n\nWhich brings me to a misconception that you seem to have. A lot of people from California think that the University of California is better than the CSU or a community college. It isn't. These schools are different and are meant to serve students with different needs. \n\nThe UC is a research university system. These are not places that specialize in providing the highest quality teaching. Instead, they focus on scientific research and employ literally thousands of people who do that exclusively. As an undergraduate, you will have large class sizes and a \"traditional\" (but not necessarily desirable) university experience. The best UCs for getting an undergraduate degree are not necessarily the most prestigious ones. Riverside, Merced, Santa Cruz, and Santa Barbara are more undergraduate oriented than the others. You should apply to some or all of them. \n\nThe California State University is one of the largest and best teaching university systems in the country. It is just as good as the UC, but focused almost entirely on undergraduate teaching and pre-professional studies. There are twice as many campuses. Some are large (SDSU), and some are very small (Channel Islands). Some of the best engineering schools in the country are CSUs (the Cal Poly campuses and San Jose State). You should spend time on the CSU website researching which campus might be right for you. \n\nCommunity college is also an excellent route, and often a much better path than going directly to a university. You will learn how to be a student in a lower stress and lower cost environment, both of which can be invaluable. Some of the most accomplished people I know went to a city college first. \n\nSo apply to a mix of places. As long as you meet the requirements to apply, there's no reason not to apply. If you get an acceptance letter, then you can make a choice about whether to attend. Don't worry about picking the best or most prestigious place, focus on finding somewhere that you like and will do well at. That's all the matters.",
      "author": "tachyonicinstability",
      "created": 1635912516,
      "upvotes": 3,
      "replies": {}
    },
    "hj3y7vv": {
      "link": "/r/ApplyingToCollege/comments/qlm5xi/not_sure_how_to_approach_college_applications/hj3y7vv/",
      "text": "You should definitely apply to CSUs. Some of them (San Jose State) have Impaction while the other don't iirc. As long as you meet the criteria, you should be fine. And you don't have to write any essays whatsoever so that's good. \n\nAs for UCs, if you're willing to write 4 essays you might want to try UC Merced, UC Santa Cruz, and maybe a few others. Even if you don't want to write essays, the good thing about California is the CC to UC transfer system is super nice. I've had a lot of my friends and their siblings take the CC then transfer to UCLA/whatever route.",
      "author": "i-believe-in-magic1",
      "created": 1635913503,
      "upvotes": 2,
      "replies": {
        "hje2qtz": {
          "link": "/r/ApplyingToCollege/comments/qlm5xi/not_sure_how_to_approach_college_applications/hje2qtz/",
          "text": "Yeah ill definitely do a mixture of Collegesm ill probably submit some csu applications and (HOPEFULLYYY) Get my UC essays done and subkit my application this month. If all doesnt work out then Ill definiteky consider Community collegem i think ill prefer a UC since theyre more research based too so i want to try my hand at that. \n\nBut CC is a good back up plan because i can transfer to UC after them. My top uc choices are definitely irvine and maybe Santa barbara...? But hopefully i get in. If I dont then Ehh",
          "author": "Necessary-Pop-4525",
          "created": 1636099297,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}