{
  "sid": "qa02tb",
  "link": "/r/ApplyingToCollege/comments/qa02tb/cant_decide_my_major/",
  "title:": "Can't Decide My Major",
  "text": "I'm a south Asian 12th grade student from Bangladesh. I wanna apply to us unis on this fall 22. From my childhood I decided that I will be a CSE engineer. But for the last two years, I started loosing my interest on CSE. I think I never loved hardcore programming. Last year, I started a digital marketing internship which ended in the middle of this year. During this period, I started loving marketing. Starting my own business, doing perfect marketing and banging success; I started dreaming like this. But in our country, you have to choose among 3 groups: science, commerce and arts. I have chosen science in my 9th grade. Because I love science. So I had no courses like marketing, accounting, management, etc. That's why I have no idea about the bba courses. Student who took commerce studied all these subject but they couldn't study higher mathematics, physics like me. So I have insecurities whether I can do well studying bba or not. Or studying cse will be okay for me. Recently, I heard about a course which is Computer and business or something like that. I loved the concept and started thinking about the course. What do you guys think? Should I study on this type of course? which unis have this course on us? I need unis which must have a good acceptance rate and aid or scholarship for international students. Need help from all. Thanks in advance.   \n\n\n\\*Sorry for my english :)",
  "author": "ZealousidealVast9799",
  "created": 1634481864,
  "updated": 1634654128,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgznmmb": {
      "link": "/r/ApplyingToCollege/comments/qa02tb/cant_decide_my_major/hgznmmb/",
      "text": "Depending on the university, computer engineering may lean a lot more toward electrical engineering than programming. (Computer science would be more programming than CE.)\n\nThere are plenty of options for combining computer science (NOT computer engineering) and undergrad business. It sounds like you may wish to apply to undergrad business programs - look at what the program offers, for example, for business analytics or for getting a minor in CS.\n\nRegarding financial aid, try r/IntltoUSA and google extensively on both need-based financial aid for internationals and merit scholarships for internationals. There are many many people in your shoes.",
      "author": "elkrange",
      "created": 1634482358,
      "upvotes": 2,
      "replies": {}
    }
  }
}