{
  "sid": "qqcgnn",
  "link": "/r/ApplyingToCollege/comments/qqcgnn/im_starting_cc_in_january_how_does_transfer_work/",
  "title:": "Im starting CC in January how does transfer work?",
  "text": "Im starting community college soon, I havent quite declared a major yet because Im unsure of what I want to do. I also plan to transfer to a university and have narrowed my choice down to 4 universities only one being out of state. How will picking my classes now affect my time later? What are the limits of what I can and cannot do with this?",
  "author": "PsychoticHeBrew",
  "created": 1636489577,
  "updated": 1636653453,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjzt5rk": {
      "link": "/r/ApplyingToCollege/comments/qqcgnn/im_starting_cc_in_january_how_does_transfer_work/hjzt5rk/",
      "text": "For each school you think you might transfer to, you need to carefully read their transfer admissions process. Some schools will want you to have completed specific coursework in order to transfer, and others might be more flexible. Make sure you have what you need. The transfer process tends to vary a lot between schools.",
      "author": "pixelatedpix",
      "created": 1636497309,
      "upvotes": 2,
      "replies": {}
    },
    "hjzdbl0": {
      "link": "/r/ApplyingToCollege/comments/qqcgnn/im_starting_cc_in_january_how_does_transfer_work/hjzdbl0/",
      "text": "your questions are pretty vague but look into if you can transfer credits from your cc to your unis (and if so, which ones). try and get some of your gen ed courses done if ur not set on a major yet (look up the requirements for your state/schools)",
      "author": "modularmercury",
      "created": 1636490932,
      "upvotes": 1,
      "replies": {
        "hjzdi78": {
          "link": "/r/ApplyingToCollege/comments/qqcgnn/im_starting_cc_in_january_how_does_transfer_work/hjzdi78/",
          "text": "I know they are vague im sorry, i dont know what im doing lol. Thank you",
          "author": "PsychoticHeBrew",
          "created": 1636491005,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}