{
  "sid": "qqj28a",
  "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/",
  "title:": "Columbia or Stanford more prestigious?",
  "text": "Which is more prestigious? I know Stanford is the best tech school after MIT, but I am talking about the universities as a whole. Columbia is consistently ranked higher and is in the top tier of the Ivy League and has great social sciences and humanities combined with decent STEM (without too much focus on one area, unlike Stanford), so IMO Columbia. What do you think is the relative employer perception and lay prestige of these two schools?\n\nAnd which one do you think is more likely to overtake Princeton and Yale to become Harvard's rival in the future?",
  "author": "lionroarthrowaway",
  "created": 1636508873,
  "updated": 1636653492,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.27,
  "comments": {
    "hk133mp": {
      "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk133mp/",
      "text": "Low key feel like if you're asking this question then you probably don't need to worry about it.",
      "author": "jayphoward",
      "created": 1636518214,
      "upvotes": 9,
      "replies": {}
    },
    "hk0qzrt": {
      "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk0qzrt/",
      "text": "It really doesn't make a difference at this level, but I think Stanford has an edge over Columbia.\n\nAlso, Stanford isn't really a \"tech\" school as such - I would substitute it with CMU in your opening statement.",
      "author": "prsehgal",
      "created": 1636512301,
      "upvotes": 11,
      "replies": {
        "hk19o8c": {
          "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk19o8c/",
          "text": "Stanford isn't really known for much except tech, though. Harvard/Yale/Princeton/Columbia are all known for being liberal arts, Harvard being known as the best college in America. MIT is known for being the best STEM college in America. Stanford is *primarily* known for being good at engineering / California tech college, like Berkeley.",
          "author": "lionroarthrowaway",
          "created": 1636522065,
          "upvotes": -7,
          "replies": {}
        }
      }
    },
    "hk0th93": {
      "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk0th93/",
      "text": "honestly it depends on where you are. on the east coast, definitely columbia. on the west coast, definitely stanford. globally, i think theyre on pretty even footing. both are equally difficult to get into, and both have some of the most accomplished faculty in the world. as for whod rival harvard, stanford has a pretty big monopoly over west coast prestige in resources, but columbia has new york which is difficult to ignore. i think it can go either way, but harvard, columbia, and stanford are probably already the three most prestigious, well rounded large research universities in the us.",
      "author": "newjerseyhate",
      "created": 1636513423,
      "upvotes": 2,
      "replies": {
        "hk19shq": {
          "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk19shq/",
          "text": "Eh. I don't think even on the West Coast Stanford is as prestigious as the top ivies (HYPC). To those \"in the know,\" at least. I laugh every time someone on this sub tries to compare Stanford with Harvard, the most prestigious school in America, though.",
          "author": "lionroarthrowaway",
          "created": 1636522139,
          "upvotes": -6,
          "replies": {}
        }
      }
    },
    "hk0y6r3": {
      "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk0y6r3/",
      "text": "Trust me, prestige is an awful reason to choose a school.",
      "author": "thatcornellbitch",
      "created": 1636515671,
      "upvotes": 2,
      "replies": {}
    },
    "hk0un9i": {
      "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk0un9i/",
      "text": "Big Tech doesn’t go after prestige (neither Google nor Microsoft CEO is from ‘prestige’ universities. Thousands of folks from ‘prestige’ universities work for them). They go after great skill set - Berkeley, MIT, CMU are more prestigious for them. If you are a big Law firm, you go to Harvard or Yale. If you want top management skills, you go to Wharton or Columbia.",
      "author": "svday",
      "created": 1636513967,
      "upvotes": 0,
      "replies": {
        "hk19epv": {
          "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk19epv/",
          "text": "OP is stupid, but there is so much wrong with what you just said (which doesn't even seem relevant to the post in the first place).\n\n1. Google CEO went to IIT, Stanford, and Wharton. Amazon CEO went to Harvard. Facebook CEO went to Harvard. The previous Microsoft CEO went to Harvard. (Granted, I don't think the almae matres of CEOs have much to do with current recruiting efforts, so I have no clue why you brought that up in the first place).\n2. Big tech isn't recruiting Harvard/Princeton/Columbia/etc. any less than Berkeley. Berkeley is a huge fucking school and has way more people interested in big tech, so their absolute numbers are higher. If you are going to Harvard, Google will take your call, don't worry. Very very few people are going to Berkeley/CMU over Harvard just because the former two are more known for CS.\n3. Very few people are going to Wharton/Columbia over Harvard/Stanford for business school, even if they are focused on management.\n\nI really feel like this sub goes overboard on the whole \"choose a university for its major\" sort of thing. The name on the diploma + overall fit is way more important than major-specific rankings...",
          "author": "PedaleFrancisca",
          "created": 1636521898,
          "upvotes": 3,
          "replies": {
            "hk1a4b2": {
              "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk1a4b2/",
              "text": "We are talking of just undergrad degree here. Top tech companies, of course, do take loads from Harvard & Yale - they do it because they find folks with great skills there not because it is prestigious. They take loads of folks from CalPoly SLO too - they go anywhere they find folks who have great skills and corporate cultural fit.",
              "author": "svday",
              "created": 1636522343,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk4l2zw": {
      "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk4l2zw/",
      "text": "As an amorphous, un-measurable term, it really doesn’t matter.",
      "author": "RichInPitt",
      "created": 1636583087,
      "upvotes": 1,
      "replies": {
        "hk4xpgh": {
          "link": "/r/ApplyingToCollege/comments/qqj28a/columbia_or_stanford_more_prestigious/hk4xpgh/",
          "text": "I mean, Harvard is clearly more prestigious than both. So is MIT. Are Stanford and Columbia just so close that it isn't really possible to get a definite answer?",
          "author": "lionroarthrowaway",
          "created": 1636588457,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}