{
  "sid": "qekrgh",
  "link": "/r/ApplyingToCollege/comments/qekrgh/act_score_question_for_common_app/",
  "title:": "ACT score question for common app",
  "text": "I just finished taking my ACT today, (Oct 23 btw) but I'm wondering if I can use this score on EA? I don't think the score will come out before Nov 1, but I was wondering what I should do with the score that I get. Can I still use it on my EA applications?",
  "author": "ValidatingExistance",
  "created": 1635049173,
  "updated": 1635182974,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhtq4la": {
      "link": "/r/ApplyingToCollege/comments/qekrgh/act_score_question_for_common_app/hhtq4la/",
      "text": ">Can I still use it on my EA applications?\n\nDepends on the requirements of each specific school you’re applying to.  Many/most will accept scores from October tests.",
      "author": "Strict-Special3607",
      "created": 1635049507,
      "upvotes": 1,
      "replies": {
        "hhtq8bf": {
          "link": "/r/ApplyingToCollege/comments/qekrgh/act_score_question_for_common_app/hhtq8bf/",
          "text": "How would I do that? So I just update my \"testing\" section after my scores come out and they should be able to see it?",
          "author": "ValidatingExistance",
          "created": 1635049571,
          "upvotes": 1,
          "replies": {
            "hhtqlqi": {
              "link": "/r/ApplyingToCollege/comments/qekrgh/act_score_question_for_common_app/hhtqlqi/",
              "text": "No, you would update your scores in the admission portal you receive after submitting your app, if the college accepts self-reported scores. Other colleges still require an official report prior to admission so for those, you'd need to order a score report after your score is released.\n\n(When you submit an app to a college, the college receives whatever is in the app at that moment in time. Later changes to the common app are not transmitted to the college.)",
              "author": "elkrange",
              "created": 1635049795,
              "upvotes": 1,
              "replies": {
                "hhtr46z": {
                  "link": "/r/ApplyingToCollege/comments/qekrgh/act_score_question_for_common_app/hhtr46z/",
                  "text": "Sorry, I'm new to this. What is an admission portal? It's just something they give me after I submit my application right? I have a dilemma because the Oct 23 ACT is my first ACT, but I don't know if I should choose to have my colleges review my ACT score or not because I don't have the test result yet.",
                  "author": "ValidatingExistance",
                  "created": 1635050105,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}