{
  "sid": "qupzj6",
  "link": "/r/ApplyingToCollege/comments/qupzj6/mit_application_checklist/",
  "title:": "MIT Application Checklist",
  "text": "The MIT checklist was added today but it says that they did not receive my second teacher recommendation. However, when I open the \"Manage Recommendations & School Report\" section it says submitted for each one. It says the first teacher recommendation was received on 10/29/21. On the \"Manage Recommendations & School Report\" the dates of submission are 10/22/21 and 10/29/21. How can I tell which recommendation was the actual one submitted and what should I do about it?",
  "author": "BlockAlien",
  "created": 1637009185,
  "updated": 1637179534,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 0.94,
  "comments": {
    "hkvvhrq": {
      "link": "/r/ApplyingToCollege/comments/qupzj6/mit_application_checklist/hkvvhrq/",
      "text": "I have this same exact issue. I think I’m going to email MIT just in case, but I narrowed the unsent recommendation from the checklist down to one of my two recommenders and asked him to resend the letter. I narrowed it down based on the confirmation email date I received from MIT when the letters were initially sent. One of my teachers sent it in earlier than the other and the date submitted on the checklist reflected that. You can also match up the dates from the manage section to the checklist to see which teacher’s letter didn’t go through.\n\nI’ll update on what MIT says though.",
      "author": "jcellitti",
      "created": 1637087944,
      "upvotes": 1,
      "replies": {
        "hkwoduj": {
          "link": "/r/ApplyingToCollege/comments/qupzj6/mit_application_checklist/hkwoduj/",
          "text": "Got an email from MIT regarding the issue.\n> \n> \n> Hi,\n> \n> Thank you for your interest in MIT! Your checklist should be updated within 24 hours reflecting the correction. Apologies for any confusion, if you have further questions please let us know.\n> \n>",
          "author": "BlockAlien",
          "created": 1637099335,
          "upvotes": 2,
          "replies": {
            "hl09blv": {
              "link": "/r/ApplyingToCollege/comments/qupzj6/mit_application_checklist/hl09blv/",
              "text": "It must’ve been a tech issue, thanks for showing me this! The checklist probably will update automatically after they found that it was submitted. I haven’t heard back or have had the checklist changed but I’m guessing I’ll get a similar response.",
              "author": "jcellitti",
              "created": 1637168010,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hkwl3rh": {
          "link": "/r/ApplyingToCollege/comments/qupzj6/mit_application_checklist/hkwl3rh/",
          "text": "Has your checklist updated since the resubmission?",
          "author": "BlockAlien",
          "created": 1637098029,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}