{
  "sid": "qirnxy",
  "link": "/r/ApplyingToCollege/comments/qirnxy/should_i_call_off_my_michigan_ea_app/",
  "title:": "Should I call off my Michigan EA app?",
  "text": "I haven't even started the supplements (especially the why UMich essay), so they'll probably be weak if I end up cramming them over the next two days. This is probably not a good situation for me to be in as a Virginia resident, because with a weak why UMich essay, it's more likely than not that they'd assume I'd go to UVA over UMich if I got into both. Also, I heard that they don't even read all of the EA applications and end up deferring a lot of people for that reason, so should I just go with RD instead? Does EA provide a significant advantage?",
  "author": "Puzzled-Ad5592",
  "created": 1635559413,
  "updated": 1635779225,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hinds9y": {
      "link": "/r/ApplyingToCollege/comments/qirnxy/should_i_call_off_my_michigan_ea_app/hinds9y/",
      "text": "Significant no, advantage yes. If you can put together a decent essay go for it if not wait.",
      "author": "TritonTheCat",
      "created": 1635605825,
      "upvotes": 2,
      "replies": {}
    },
    "hinizdb": {
      "link": "/r/ApplyingToCollege/comments/qirnxy/should_i_call_off_my_michigan_ea_app/hinizdb/",
      "text": "no professional school will refuse to read apps out of nonchalance. so cross that out. in my opinion you should still do it, why umich is probably an easy question to answer imo",
      "author": "localramenconsumer",
      "created": 1635608149,
      "upvotes": 2,
      "replies": {}
    },
    "hink8hg": {
      "link": "/r/ApplyingToCollege/comments/qirnxy/should_i_call_off_my_michigan_ea_app/hink8hg/",
      "text": "I have the exact same concern HAHA I’m probably just going to do RD because I’m worried my LOR’s won’t be submitted in time",
      "author": "bcl24",
      "created": 1635608675,
      "upvotes": 2,
      "replies": {}
    },
    "hipoe57": {
      "link": "/r/ApplyingToCollege/comments/qirnxy/should_i_call_off_my_michigan_ea_app/hipoe57/",
      "text": " If you're done with your other apps, why not try? You can always choose not to apply if you think it's not up to scratch.",
      "author": "sleepkeyichidema",
      "created": 1635642935,
      "upvotes": 1,
      "replies": {}
    }
  }
}