{
  "sid": "h8ezgq",
  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/",
  "title:": "STOP pushing \"sob stories\"",
  "text": "Edit: Wow this got popular! My goal is to respond to everyone's questions by about 10pm Pacific on Monday. Thanks for your patience.\n\nI've seen this sentiment circulating around here and some sister subs so instead of just making a dozen comments, I'm going to post this.\n\nIn response to anyone saying things like \"admissions officers love 'trauma porn' \" or \"sob stories are the way to go, anyone saying otherwise is lying\" or anything else disgusting like that: No. \n\nNobody cares about your \"sob story\". I've been in the college amissions game for 8 years, first in Cal's Admissions office, then in the private sector.\nI am so sick of hearing all this entitled, unqualified, ignorant nonsense.\n\nIf someone chooses to write about overcoming obstacles - and I've gotten numerous students into Ivies and flagship public schools (UMich, Berkeley, etc ) without them doing so- the focus needs to be on the skills the student gained from OVERCOMING said obstacle, not some \"sob story\" nonsense. \n\nAre you a skeptical cynic? Well then, think of it this way, nobody, I mean NOBODY, is going to admit you because they feel bad for you. Nobody reading your app could give half a clipped toenail about your personal circumstances unless they think those circumstances have made you a valuable asset to their school. \n\nHere's WHY students with shocking backstories get in to colleges. Because they became mothertrucking b*d*sses from it.\n\nIn research and in your professional life, spaghetti is gonna hit the fan all the time. Didn't get a research grant? Great, how are you going to get a new one or do without? You know what a good parallel for that is? Resourcefulness in the face of childhood poverty as a first gen college  student, as you figure out how to apply for food stamps and the FAFSA all on your own while your dad is outside the trailer drunk with the boys again.\n\nYour undergrad minions all caught COVID and now they can't  ZOOM Interview research subjects? Great, how are you gonna juggle all that? Maybe with similar time management skills you developed having to work 20 hours a week in minimum wage jobs after school while maintaining a 3.8 and being president of your school's speech and debate team.\n\nYou're in residency and dealing with some very recalcitrant patients. You think back to when you were translating for your diabetic mother who couldn't speak English much less read an English nutrition label. You remember what you did that finally got her to listen and try the same type of empathy and understanding on your patients. They finally start getting it.\n\nOr maybe you think back to when you were bullied because of an autoimmune disorder that had some unsightly physical effects and made you weak. You think about how you got through that, no way in heck you can't get through the disappointment of getting a C your first OChem midterm. You study your butt off and pass with a B (not great, but there's legit hundreds of thousands of doctors who still became doctors with a B or even a C in OChem. It's OCHEM.).\n\nI could go on and on and on.\n\nSo many kids who have never faced anything remotely like hardships or setbacks CRUMBLE in these kinds of situations because they've never had to pick themselves up and wipe all the mud and blood off themselves. Resilience, tenacity, resourcefulness, determination, perseverance, ALL of these are qualities that are key for success in the real world. Colleges WANT PROOF of that. The ability to APPLY your smarts is just as important as being smart. That's why 4.0s with zero proof of life skills are sometimes rejected over super capable 3.7s.\n\nSure, a couple spitheads might slip through the cracks and get in with a pity essay - that was likely because they had a really strong rest of their app, or they're just really good a BSing. One shyster succeeding with crap isn't enough to endorse the sob story method. Plus,  most of those people  flunk out and wind up working a pity job at their daddy's company or minimum wage somewhere else. \n\nNobody cares about how hard you had it if you didn't develop some valuable skills because of your experiences. We hate sob stories that are clearly looking for pity instead of narratives of overcoming obstacles that prove how powerful the applicant is.",
  "author": "Empowerly-Admissions",
  "created": 1592079652,
  "updated": 1634078273,
  "over_18": false,
  "upvotes": 1517,
  "upvote_ratio": 0.98,
  "comments": {
    "fuqh8ex": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqh8ex/",
      "text": "amen!! the sob stories are not supposed to be about the experience itself but about the skills gained from it.",
      "author": "uni-sirius",
      "created": 1592080094,
      "upvotes": 322,
      "replies": {}
    },
    "fur4guo": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur4guo/",
      "text": "I have a friend who cheesed his way into Cornell by applying to their agriculture school, and wrote his essay about how he took care of his ailing grandparents' farm for a summer.\n\nHis grandparents were fine. There was no farm. We live in an area where the average household income is over $150k & families making $80k or less qualify for \"low-income\" housing.\n\nCornell accepted him, and then once he got there, he switched into his desired major.\n\nI still don't know whether to be impressed or mad.",
      "author": "OkayKatniss413",
      "created": 1592093244,
      "upvotes": 225,
      "replies": {
        "fur8ffc": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur8ffc/",
          "text": "Man I feel like this is why you should have to meet with an alumni who’s read your essays. Easiest way to vet out who’s lying about it imo",
          "author": "bienvenidos-a-chilis",
          "created": 1592095714,
          "upvotes": 68,
          "replies": {}
        },
        "fur5yji": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur5yji/",
          "text": "Don't hate the player, hate the game.",
          "author": null,
          "created": 1592094169,
          "upvotes": 155,
          "replies": {
            "futeloy": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futeloy/",
              "text": "Sometimes it's okay to hate both",
              "author": "FeistyGift",
              "created": 1592155020,
              "upvotes": 31,
              "replies": {
                "futhifo": {
                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futhifo/",
                  "text": "This",
                  "author": "20kelly103220",
                  "created": 1592156591,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "furhozn": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furhozn/",
          "text": "Honestly, with that strategy, I believe that he sure is smart enough to go to an ivy - dude gamed the system like a pro.",
          "author": "BeefyBoiCougar",
          "created": 1592101764,
          "upvotes": 71,
          "replies": {
            "fut7l2j": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fut7l2j/",
              "text": "[deleted]",
              "author": null,
              "created": 1592151143,
              "upvotes": 23,
              "replies": {
                "fuv905q": {
                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuv905q/",
                  "text": "Could not agree more.",
                  "author": "Empowerly-Admissions",
                  "created": 1592193003,
                  "upvotes": 1,
                  "replies": {}
                },
                "futayj5": {
                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futayj5/",
                  "text": "This ain’t it chief",
                  "author": "FatherShm00p",
                  "created": 1592153022,
                  "upvotes": -2,
                  "replies": {
                    "futb15o": {
                      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futb15o/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1592153063,
                      "upvotes": 3,
                      "replies": {
                        "futb8e9": {
                          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futb8e9/",
                          "text": "The comment lmao",
                          "author": "FatherShm00p",
                          "created": 1592153175,
                          "upvotes": -3,
                          "replies": {
                            "futbem8": {
                              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futbem8/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1592153270,
                              "upvotes": 10,
                              "replies": {
                                "futd1gy": {
                                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futd1gy/",
                                  "text": "It isn’t.",
                                  "author": "piedrafundamental",
                                  "created": 1592154163,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "futef1p": {
                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futef1p/",
                  "text": "If detecting sarcasm is this difficult for you - maybe you should start lying too.",
                  "author": "BeefyBoiCougar",
                  "created": 1592154919,
                  "upvotes": -1,
                  "replies": {
                    "futg0pn": {
                      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futg0pn/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1592155779,
                      "upvotes": 11,
                      "replies": {
                        "futpruj": {
                          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futpruj/",
                          "text": "And everyone here that isn’t them, the vast majority, agrees with you",
                          "author": "BeefyBoiCougar",
                          "created": 1592161112,
                          "upvotes": -2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fuqhh85": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqhh85/",
      "text": "I always thought there was the understanding that ‘sob stories’ are only used do demonstrate how strong someone is. May I ask how you would suggest presenting overcoming a hurdle in a way that doesn’t underplay it’s significance (mine is severe illness) but also shows how much I have achieved in spite of it.",
      "author": "ohdearstudying",
      "created": 1592080222,
      "upvotes": 156,
      "replies": {
        "fuqs19w": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqs19w/",
          "text": "I've worked with a lot of students who have written about illness. That's completely legit. I think it's hard to prescribe a formula without seeing the essay, but the description of the hurdle should be no more than 25% of your words (ideally more like 20%) and the rest should be how you figured out how to overcome the obstacle, highlighting the skill you gained/what you learned, and how you can apply these skills in your academic and professional career.",
          "author": "Empowerly-Admissions",
          "created": 1592085843,
          "upvotes": 113,
          "replies": {
            "fuqs6hf": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqs6hf/",
              "text": "thanks so much for that explanation, i’ve definitely taken a different spin on it now. how would one write a whole essay on what i’ve overcome? it seems quite challenging to be honest!",
              "author": "ohdearstudying",
              "created": 1592085927,
              "upvotes": 30,
              "replies": {
                "fur1vb5": {
                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur1vb5/",
                  "text": "I don't know how much more advice I can provide without seeing the whole essay, and whether this is for the main common app or a supplemental. Feel free to PM me and we can talk more.",
                  "author": "Empowerly-Admissions",
                  "created": 1592091678,
                  "upvotes": 23,
                  "replies": {}
                }
              }
            },
            "furp7ky": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furp7ky/",
              "text": "Thank you SO MUCH!!!!! Reading this comment and your post have helped immensely!",
              "author": "v_theking",
              "created": 1592106833,
              "upvotes": 7,
              "replies": {}
            },
            "furk6c6": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furk6c6/",
              "text": "RemindMe! 30 days",
              "author": "OG_Mac1",
              "created": 1592103417,
              "upvotes": 1,
              "replies": {
                "furk7r6": {
                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furk7r6/",
                  "text": "I will be messaging you in 27 days on [**2020-07-12 02:56:57 UTC**](http://www.wolframalpha.com/input/?i=2020-07-12%2002:56:57%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furk6c6/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fh8ezgq%2Fstop_pushing_sob_stories%2Ffurk6c6%2F%5D%0A%0ARemindMe%21%202020-07-12%2002%3A56%3A57%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20h8ezgq)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                  "author": "RemindMeBot",
                  "created": 1592103442,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fustrmv": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fustrmv/",
          "text": "I tried to write about my medical condition. Personally, it didn’t feel “right”, but if I was to try again, I would focus on what that struggle taught you, and how you’ve grown as a result. \n\nIt can definitely portray you as strong, but you have to make sure the focus is less on the illness, and more on how you persevered- think of you condition as the background to the story you’re trying to tell.\n\nHope this helps (also I’m just a prefrosh, so feel free to take this with a grain of salt haha)",
          "author": "cosmic-melodies",
          "created": 1592142910,
          "upvotes": 4,
          "replies": {
            "fustz01": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fustz01/",
              "text": "no that’s okay! i think it’s worthwhile telling  the backdrop of so many things for me (also explains why all my ECs begun in junior year). but i know it catches a lot of people by surprise and i often underplay it’s significance. also, because i’m international i almost want them to gather i’m not a run of the mill silver spoon clad international student. thanks for your advice!",
              "author": "ohdearstudying",
              "created": 1592143044,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fur14nx": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur14nx/",
      "text": "Preach.  \"Sob stories\" sometimes work because they're deeply personal, insightful, and facilitate students writing meaningfully about themselves.  As you said, it is not pity that makes them effective (when they do work), its because they show resilience, grit, or other positive qualities.\n\nTo put this in perspective, ask yourself - would you date someone you otherwise wouldn't be interested in just because they had a tragic story?  No.  You would feel bad, and you might try to help, but you wouldn't hitch your wagons to that person out of pity.  Same goes for job interviews - companies don't really care about how badly you need the job, how hard your life has been, etc.  They care about the value you can produce, the skillset you have, and your ability to succeed in the role.\n\nThis is the same for colleges.",
      "author": "ScholarGrade",
      "created": 1592091239,
      "upvotes": 66,
      "replies": {}
    },
    "fuqwo40": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqwo40/",
      "text": "what if i sobbed about your post",
      "author": "LateRespect",
      "created": 1592088557,
      "upvotes": 55,
      "replies": {
        "furmcm8": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furmcm8/",
          "text": "lmao",
          "author": "DankSkillz2",
          "created": 1592104849,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fuqlhnl": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqlhnl/",
      "text": "[deleted]",
      "author": null,
      "created": 1592082368,
      "upvotes": 35,
      "replies": {
        "fuqrnnd": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqrnnd/",
          "text": "It sounds like this is a potentially fruitful topic that can showcase your resilience, so yeah! I'd make sure to get some *QUALIFIED* eyes to take a look at it before submission (which tbh everyone should do regardless of topic) but yeah, it sounds like it's quite viable.",
          "author": "Empowerly-Admissions",
          "created": 1592085621,
          "upvotes": 44,
          "replies": {}
        },
        "fuqpc9l": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqpc9l/",
          "text": "Are the experiences and skills you came out with going to make you more valuable to the college? If yes, then yes. It mostly just depends on how you write it and what you emphasize.",
          "author": "tatro3",
          "created": 1592084401,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "fuqxdcp": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqxdcp/",
      "text": "The idea of saying \"sob story\" rather than something like \"tragic overcoming\" kinda represents the mindsets of the people who go and suggest that route. I'm glad this post was made, especially since OP seems like a really experienced admissions officer.",
      "author": "vampiricreader",
      "created": 1592088976,
      "upvotes": 22,
      "replies": {}
    },
    "furjpjb": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furjpjb/",
      "text": "What if I write a sob story about not having a sob story?",
      "author": null,
      "created": 1592103111,
      "upvotes": 18,
      "replies": {
        "fus14x8": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus14x8/",
          "text": "very meta, i like it \n\n\"my struggle for my entire life has been that I have never struggled before. Because of this, no one becomes my friend out of pity or shared experience; i've never experienced anything! I overcame this obatacle by watching youtube videos of pickup artists and now can manipulate anyone to be my friend. problem solved\"\n\ni just got into harvard for you thank me",
          "author": "aadisaha17",
          "created": 1592116503,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "fuqjvq2": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqjvq2/",
      "text": "Thank you OP. Like you said, the process and growth is what's important!",
      "author": "kawikakalama",
      "created": 1592081495,
      "upvotes": 10,
      "replies": {}
    },
    "fur71lk": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur71lk/",
      "text": "Hey OP I was wondering if you could take a look at my draft essay. Its kinda personal so I was wondering if you could tell me how to make it better. Let me know if you can do this and I will send a separate message",
      "author": null,
      "created": 1592094844,
      "upvotes": 9,
      "replies": {
        "fur7wnx": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur7wnx/",
          "text": "Send me a PM and I'll tell you the best way to send it to me (or a colleague if I think of someone who would be a better fit).",
          "author": "Empowerly-Admissions",
          "created": 1592095387,
          "upvotes": 10,
          "replies": {
            "fuu9srh": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuu9srh/",
              "text": "Alright I did it. Thanks",
              "author": null,
              "created": 1592172096,
              "upvotes": 1,
              "replies": {
                "fuucffe": {
                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuucffe/",
                  "text": "Excellent, I will get back to you within 24-48 hours.",
                  "author": "Empowerly-Admissions",
                  "created": 1592173535,
                  "upvotes": 1,
                  "replies": {
                    "fuudjxc": {
                      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuudjxc/",
                      "text": "Alright cool thanks",
                      "author": null,
                      "created": 1592174160,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "furadug": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furadug/",
      "text": "Yea the “sob stories work” narrative is just this subs victim complex from affirmative action manifesting itself. Turns out it also functions to invalidate the life experiences of black and latinx Americans",
      "author": "pokemongofanboy",
      "created": 1592096961,
      "upvotes": 25,
      "replies": {
        "fus3vnw": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus3vnw/",
          "text": "Yup, it's pretty awful",
          "author": "Empowerly-Admissions",
          "created": 1592119111,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "furnvr2": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furnvr2/",
      "text": "Does this also apply to the additional information section? My freshman year I had undiagnosed/untreated narcolepsy, which contributed to some lackluster grades, but since getting on medicine that works, I've greatly improved. I was planning on including my diagnosis and how it affects me/how I cope with it in the extra info section, but now I'm not sure if it would look like I'm trying to get sympathy. I also don't want the AO to think that I couldn't handle the school because of my diagnosis. Any advice?",
      "author": "Sonny0217",
      "created": 1592105898,
      "upvotes": 6,
      "replies": {
        "fus2isg": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus2isg/",
          "text": "No, that would not look like trying to get extra sympathy. Your grades improved after going on meds, this is just a good explanation for why your grades weren't so hot beforehand. When admissions officers see a spot of bad grades,  but also a bunch of good ones in a upward trend we assume that something external must have caused the bad grades. This would just be you giving us the information we need so we can stop scratching our heads. We won't think you can't handle it if you've proved yourself elsewhere by succeeding in your grades and ECs.\n\nWherever you wind up, you might want to look into the schools DSP (disabled student program) services. You have rights, and if things do get tricky while in school, you can potentially appeal for a reduced course load on the basis of your narcolepsy. That doesn't mean you can't handle the school or don't have valuable contributions to make, it just means that if push comes to shove, it's better to have DSP protection in case you need to be a part-time student.",
          "author": "Empowerly-Admissions",
          "created": 1592117803,
          "upvotes": 5,
          "replies": {
            "fut4cqp": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fut4cqp/",
              "text": "Thank you so much for the advice, it really means a lot!",
              "author": "Sonny0217",
              "created": 1592149323,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fur98z4": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur98z4/",
      "text": "Question about an essay: is writing about being excluded from programming/building (indirectly because of culture/gender I’m a black female btw) on a robotics team a good topic? I was going to heavily focus on how that inspired me to volunteer and educate others about STEM subjects and how I make sure nobody is left out. \n\nI was afraid my challenge is too trivial though it was a major stress point in my sophomore year",
      "author": "RussianBlue18",
      "created": 1592096233,
      "upvotes": 12,
      "replies": {
        "fur9o6k": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur9o6k/",
          "text": "This seems really interesting! To give an idea of where I'd place this, I'd recommend it for a prompt  like the UCs \"how did you make your school or community a better place\" prompt, rather than the \"educational obstacle\" one since the main focus of the essay should be on how this motivated you to go out there and kick some butt on the haters.",
          "author": "Empowerly-Admissions",
          "created": 1592096503,
          "upvotes": 10,
          "replies": {
            "furgzlk": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furgzlk/",
              "text": "Thank you!",
              "author": "RussianBlue18",
              "created": 1592101290,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fura6c5": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fura6c5/",
      "text": "So could I write an essay about overcoming my suicidal tendencies and being in the process of my depression? Is that too grim of a topic to talk about?",
      "author": "lena_174686",
      "created": 1592096825,
      "upvotes": 4,
      "replies": {
        "furvra8": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furvra8/",
          "text": "Hey there, I am so so sorry to hear about your circumstances and am glad you are getting better. That take a lot of courage and strength. This would be an extremely delicate topic and I think it might be too intense for a main essay. If this caused a significant dip in grades, you could briefly describe this (maybe in more vague terms) obstacle as an explanation for why in the additional comments section. You also risk being harmed by (completely unfair) stigma that people have against those with suicidal tendencies and/or depression. If this was caused by some sort of trauma, I think that could be worth writing about, but you don't have to be specific about the after effects.\nI think you could probably benefit a lot from some advising from one of my colleagues, feel free to PM me about it if you want additional college app advice.",
          "author": "Empowerly-Admissions",
          "created": 1592111812,
          "upvotes": 11,
          "replies": {}
        },
        "furt2fq": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furt2fq/",
          "text": "I've heard that schools don't want students who they feel may be a \"liability\" so any sort of serious mental illness is best not to mention. \n\nI'm sorry you went through that and I hope life will get better for you!",
          "author": "ap_dumbass",
          "created": 1592109673,
          "upvotes": 9,
          "replies": {}
        },
        "furnwe3": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furnwe3/",
          "text": "Sorry about your experience. Don’t think it is a good idea.",
          "author": null,
          "created": 1592105911,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "furlnjc": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furlnjc/",
      "text": "So when talking about extenuating circumstances that may have led to a lower GPA overall, the key to not looking like you're just making excuses is talking about how these experiences made you stronger later on?",
      "author": "FewElevator4",
      "created": 1592104384,
      "upvotes": 5,
      "replies": {
        "fus3zh8": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus3zh8/",
          "text": "In a nutshell, yes. Give us an explanation and example of growth, not an excuse.",
          "author": "Empowerly-Admissions",
          "created": 1592119218,
          "upvotes": 2,
          "replies": {
            "futomhq": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/futomhq/",
              "text": "Alright, thank you.",
              "author": "FewElevator4",
              "created": 1592160480,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fusamwt": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fusamwt/",
      "text": "graduating senior here who wrote a “sob story!” i worked with my english teachers and counselors over and over again to make sure my story wasn’t a sob one. i talked about how my father’s alcoholism pushed my passion for writing. i am proud of the essay, but it’s hard to pull off. i still question if it was the right route to go down, since it really can be a hit or mess with some AOs. the best thing i can recommend doing: MAKE A LIST OF POTENTIAL ESSAYS! i listed a bunch of topics/ideas i thought i could write about, then went to my counselors to get their feedback. if anyone has any questions i’d be happy to answer them as a fellow “sob story” writer.",
      "author": "belle729",
      "created": 1592125908,
      "upvotes": 4,
      "replies": {
        "fuv9ik9": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuv9ik9/",
          "text": "That definitely sounds like an interesting essay, I wouldn't consider that a sob story. You probably made the right choice.",
          "author": "Empowerly-Admissions",
          "created": 1592193362,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fusthi1": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fusthi1/",
      "text": "I agree. I tried to write about a major medical experience I had, but it just didn’t work. However, everyone always kind of implied that that’s what I was “supposed” to write about, so I felt like I had to at least *try.* \n\nFinally, I tried to write about something totally different and kind of random (a quirky family tradition), and I was able to crank out a draft in one sitting. It just “worked”, and even the bluntest critics of my writing over the years (out of a belief that I had potential) loved it. My essay was even referenced in some of my acceptance letters as something especially notable to the admissions team- so I would say it worked for me.\n\nSo yeah. Don’t write about the worst thing that’s ever happened to you, just because you *feel like you are supposed to.* Some of the best essays are about things that seem random, but are written about from a unique perspective and with strong voice, in a way that illuminates who you are.",
      "author": "cosmic-melodies",
      "created": 1592142719,
      "upvotes": 5,
      "replies": {}
    },
    "furhhyg": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furhhyg/",
      "text": "[deleted]",
      "author": null,
      "created": 1592101634,
      "upvotes": 3,
      "replies": {
        "fus47gx": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus47gx/",
          "text": "PM me and we can talk",
          "author": "Empowerly-Admissions",
          "created": 1592119440,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "furwoax": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furwoax/",
      "text": "Ok, everyone asking for advice, I will try to get back to you over the weekend! Sorry for the delays, I just got flooded with PMs, but I appreciate your questions and want to help!",
      "author": "Empowerly-Admissions",
      "created": 1592112563,
      "upvotes": 3,
      "replies": {
        "fus4rpc": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus4rpc/",
          "text": "Thanks for being so helpful to the a2c community, much appreciated :)",
          "author": "luke_sweatshirt",
          "created": 1592119994,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fus9p6q": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus9p6q/",
      "text": "Question: would writing about my hearing loss be a good fit? I lost all my hearing in my left ear suddenly right before freshman year, and I want to write about how I overcame that (started awareness, joined organizations about hard of hearing people, learned sign language) and that type of stuff.",
      "author": "josiebecomesdecent",
      "created": 1592124960,
      "upvotes": 3,
      "replies": {
        "fuvbvfg": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuvbvfg/",
          "text": "Dang, yeah that sounds like a really good essay! It looks like your experience helped catapult you into advocacy, this is exactly the kind of thing AOs want to see in an overcoming obstacles essays.",
          "author": "Empowerly-Admissions",
          "created": 1592195035,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fut7uga": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fut7uga/",
      "text": "Couldn’t agree more. If anyone wants to see what not to do in an adversity essay, look up examples on College Confidential (also... never post your essay online.) \n\nOP (or anyone,) would you mind giving some advice to a student who has overcome significant challenges, but hasn’t necessarily done anything extraordinary? I was raised by heroin addicts for the majority of my childhood before being forcibly removed from the home. After that, I went through six families and thirteen schools before graduation. I often lived out of bags and slept on couches. It sucked! \n\nNow I’m 22 and I’m finishing up my AA. I’ve worked full time to support myself during college, and recently I’ve assumed the role of caretaker for my infant sibling about 30% of the time. My free time is scarce. I have virtually no EC’s—no internships, no clubs, no research experience (although I can’t say things would be much different if I didn’t have work, seeing that my CC is tiny.) I’m starting my transfer applications and all l have on paper is a 4.0, a couple of jobs, and solid time management skills. But I can’t express how proud of myself I am. And while I don’t love placing myself into the “child of a junkie” box, it just feels *wrong* to completely omit something that had such a profound impact on my development and that spurred what I considered to be my greatest asset: grit. \n\nI guess my question is, can “extraordinary” performance be relative to a student’s circumstances? Or should I bite the bullet and explore a different avenue for my essay? Any and all advice is welcome and appreciated.",
      "author": "miawallacesuglytwin",
      "created": 1592151288,
      "upvotes": 3,
      "replies": {
        "fuzm4is": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuzm4is/",
          "text": "I think that this can be a viable topic, and you don't need to place yourself into the \"child of a junkie\" box nor do you need traditional ECs, especially as a transfer student. Your work experience means a lot, and succeeding in your work counts for more than most clubs. When it's a paying job you can get fired from, everyone knows you're held to a much higher standard and you need to be actually involved. What are you interested in majoring in?  \nDon't omit your story, as you said, this gave you grit.  I would love to read this essay, you've put your money where your mouth is and managed to juggle work, caretaking, and still get a 4.0. This is a narrative of overcoming obstacles, not a sob story.  It's not so much that \"extraordinary performance\" is relative to a student's circumstances, it's that the criteria used to define extraordinary may expand or be different.  You have levels of self-sufficiency and resilience that most people don't - I'd trust you to, even if you don't have research experience, jump at the chance once that resource was offered to you and excel at it.  You already had to navigate everything else on your own, be reliable, handle multiple stressors, you've proved a lot of crucial qualities in a non-traditional way, because those were the cards life dealt you. Another applicant who had a much easier time navigating things and didn't have to work would then need to do something else to prove those same qualities to me, in their case maybe that would be excelling at science olympiad and being a leader on the team, or a collection of other activities.  \nAs I mentioned before, we need people who can produce results in the real world, not just  people who can be smart under ideal circumstances.  \nFeel free to PM me if you have draft up and running or if you have more questions.  \nI hope that helped, I'm on like 3 hours of sleep so if I sound a little rambly that's why.",
          "author": "Empowerly-Admissions",
          "created": 1592291372,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fuqj2wt": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuqj2wt/",
      "text": "[deleted]",
      "author": null,
      "created": 1592081065,
      "upvotes": 3,
      "replies": {}
    },
    "fur9z04": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fur9z04/",
      "text": "[deleted]",
      "author": null,
      "created": 1592096694,
      "upvotes": 3,
      "replies": {
        "fus46dr": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus46dr/",
          "text": "I would treat that like any other health issue, so yes. It takes a lot of dedication to turn your life around like that, kudos to you for getting healthy!",
          "author": "Empowerly-Admissions",
          "created": 1592119411,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "furfawn": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furfawn/",
      "text": "period!!! couldn’t have said it any better!!!",
      "author": "doyouknowdaaway",
      "created": 1592100168,
      "upvotes": 2,
      "replies": {}
    },
    "furhuhr": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furhuhr/",
      "text": "I have a question as somebody who would be returning to school after ten years: do I just describe what I did and how it made me a better person in my spare time? The reason I ask this is because I have chronic illness and mental illness and I have to take a lot of meds for them and would rather not reveal that I have mental illness due to the stigma surrounding what I have.   \n\n\nOr like, would a better topic be a risky roll and just be flat out short and honest, \"I've been dealing with XYZ and during that time I've learned XYZ coping skills. I has planned on going back to school in 2012 but XYZ happened and the years that followed this happened. It has made me realize XYZ. Despite all the hardship, I managed to do XYZ (like manage an entire small business, no joke, my boss just would leave for vacay and put me in charge of the company).\" Or would that be considered a sob story? I have a hard time with understanding this but it's a question I've had (because I'm considering a college rn with required essays).\n\nAlso, if by the time I have to write my essays I have a service dog, would writing about how they improve my quality of life be appropriate.   \n\n\nAgain, I haven't had to write an essay in 8 years and I'm freaked lol. Peace!",
      "author": "ManicTypist",
      "created": 1592101864,
      "upvotes": 2,
      "replies": {
        "fus1dn5": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus1dn5/",
          "text": "You definitely don't have to disclose having a mental illness. Mentioning that you have a service dog is fine. Definitely not a \"sob story\". I should have made a better distinction in the post (but tbh I wasn't expecting this much engagement) \"sob story\" is a term that I definitely don't believe in for people writing about overcoming obstacles. It's just what a lot of people who are such crummy applicants they think everyone else must just be getting in off of pity call narratives of overcoming obstacles. In your case, you're definitely in the overcoming obstacles camp.  Talking about putting school on pause in favor of working and experiencing life is fine, especially since you've had to manage a small business! You can talk about how those experiences made you stronger and a more valuable applicant, that alone makes sense. You don't have to mention anything about your illness if you don't want to.\nIf you'd like additional advice, feel free to PM me to talk about this more.",
          "author": "Empowerly-Admissions",
          "created": 1592116724,
          "upvotes": 2,
          "replies": {
            "fuso1qk": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuso1qk/",
              "text": "Thank you very much for taking the time to answer my questions and clarify things. I sincerely appreciate it. If I ever have a Q, I'll PM you. \n\nPeace!!",
              "author": "ManicTypist",
              "created": 1592138764,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "furkv7e": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furkv7e/",
      "text": "I always want your opinion on stories that involve overcoming drug abuse and suicide. I've heard AOs on here say that you generally don't want to write about dealing with those topics because schools don't want to take a chance on that and ruin their reputation. Can you confirm?",
      "author": "whitelife123",
      "created": 1592103862,
      "upvotes": 2,
      "replies": {
        "fuvbpqq": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuvbpqq/",
          "text": " The content of this comment may be triggering for some readers.\n\nThere's not really a clean answer on this one. It's not uniform, and it's not always discouraged because of a liability issue. Sadly at this point I think a lot of colleges figure at least some of their students are going to commit suicide, even if they wrote perfectly happy essays. Especially the premeds, the suicide rate for prehealth students tends to be higher, rates of suicide for those in med school, residency, and practicing physicians is higher than many other occupations (I need to dig through my files to find the articles on this, I heard about this issue during a lecture at a conference not too long ago).\nBut I digress. Sometimes it's because of implicit bias against people with mental health issues, whether or not the Admissions Committee thinks they'll commit suicide while in college. \n\nIf however, a mental health issue has caused a huge impact on your grades or participation in ECs, I'd reccomend mentioning the issue and approaching the topic VERY CAREFULLY. It's crucial to show resilience and a willingness to seek resources. You definitely need to make it sound like that was in the past and you've recovered and through therapy or meds or whatnot, you're \"all better now\". Is that how it ever works when it comes to mental health? Yeah no, not really, but if you do wind up needing to talk about this somewhere in your app, and I'd avoid doing so unless it's *absolutely* necessary, you do really need to emphasize that you're ok now.\n\nGetting into the gray area of like \"sometimes I still struggle with X but I feel like I'm regaining more control every day\" is going to muddle things a lot more than like \"It's been 2 years since I self-harmed, thanks to therapy that helped me process X trauma. My personal experiences with Y diagnosis have made me passionate about psychology and public health. I started a mental health awareness program at my school to help destigmatize seeking resources in our community. This past year we've [name some quantified impact]\"\n\nIt would be great if I could give a nice neat answer to this, but it's not quite that simple.\nIf it's something that has severely impacted your HS career, talk about it VERY CAREFULLY.\nIf you don't have to talk about it to explain a dip in grades, I'd avoid talking about it. Everyone is so much more than a diagnosis, write about other things in your life and other interests.\nHope this helps.",
          "author": "Empowerly-Admissions",
          "created": 1592194920,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fusbldl": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fusbldl/",
      "text": "I had a friend who's going to be a senior say he was going to lie and say he was a drug addict for his essays. I explained to him why it's bad to lie and that sob stories aren't always the best. He refused to listen. Kinda saw him in a different light after that and was disgusted.",
      "author": "bellawatersw",
      "created": 1592126895,
      "upvotes": 2,
      "replies": {
        "fuzhwlz": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuzhwlz/",
          "text": "Yeah not going to lie, I hope that kid gets rejected from everyone, even clown college. Adolescents who struggle with addictions frequently do because they are disenfranchised from healthcare systems and are self-medicating to deal with mental illness, abuse, and other traumas. And of course, these kids are disproportionately low-income students of color. Trying to lie about it is massively disrespectful to the living hell students who did struggle with addiction are going through, especially as they're trying to turn their lives around by applying to college, where they will be stigmatized against. Just wow, I'm glad that you're seeing him in a different light.",
          "author": "Empowerly-Admissions",
          "created": 1592287688,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fuskxaj": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuskxaj/",
      "text": "[deleted]",
      "author": null,
      "created": 1592136107,
      "upvotes": 2,
      "replies": {
        "fv3kbt2": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fv3kbt2/",
          "text": "Yes, you can talk about it if you frame it as a narrative of subverting harmful family practices and about taking control of your life. It's very important to frame it like \"I'm better now and used this as a jumping off point to launch X initiative or interest.\nFeel free to PM me if you want more advice!",
          "author": "Empowerly-Admissions",
          "created": 1592375841,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fussx13": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fussx13/",
      "text": "I give a speech to students all the time that matches this post\n\n“Anyone can have something bad to them. That’s not your story. Your story is how you respond to that hardship and take back your life.”",
      "author": "CollegeWithMattie",
      "created": 1592142295,
      "upvotes": 2,
      "replies": {}
    },
    "fuupdte": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuupdte/",
      "text": "personally, i wrote about a chronic disease that i was diagnosed with and how it changed my world view. \n\njust writing about my illness and making it seem like “im just a sad kid with so many health issues and im so so sad and life has been so hard for me” would have not worked at all. \n\nbut i’m going in for a polisci degree so writing about how my disease gave me a lot of experiences with the healthcare system that others only hear about from the news or once they’re getting ill at an old age. then elaborating on how those experiences changed what i wanted from the world and how my experiences and the fact that i had to struggle to make things better for me made me want to go into the political system. \n\nyou can use a sob story, you just have to make it about what you learned from it and how it relates to what you want to do with your life.",
      "author": "sappho666",
      "created": 1592180842,
      "upvotes": 2,
      "replies": {}
    },
    "furg3i6": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furg3i6/",
      "text": "interesting! i love the examples you gave. say that you have a physical disability that limits a small part of your life, is that a good subject to right about?",
      "author": "deathlyaesthetic",
      "created": 1592100698,
      "upvotes": 1,
      "replies": {
        "fvb140n": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fvb140n/",
          "text": "The general idea sounds viable, it's all about how you portray yourself. Feel free to PM me with more details and I can figure out if I or a colleague would be a better fit to edit your essay.",
          "author": "Empowerly-Admissions",
          "created": 1592540655,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "furk237": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furk237/",
      "text": "Hey OP. Would you be able to take a look at a rough draft of my essay? I would love to get some experienced opinions on it.",
      "author": "cozybuilder",
      "created": 1592103340,
      "upvotes": 1,
      "replies": {
        "fvb161g": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fvb161g/",
          "text": "PM me with more details and we can talk!",
          "author": "Empowerly-Admissions",
          "created": 1592540693,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "furq2ub": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furq2ub/",
      "text": "i’m curious about how suicidal stuff and overcoming depression and such applies to this? \n\nsophomore year i started off with a 4.0 for the first semester and then got my first f for a nine weeks. i missed like at least two months of school in total and tried to kill myself in the middle of my second semester. it like wrecked my gpa and i had some content gaps coming into my junior year (chemistry and both world wars). \n\nbut like i bounced back slowly but surely (starting out the first nine weeks with a 78 c as my lowest) and i finished this year with all a’s and two b’s (both ap classes). and one of the months i missed of school was technically homebound where i received all of my class assignments at my house and was expected to do them there (very similar to how the covid schooling was except less organized) and i was completely unmotivated and did almost none of my work that entire time. and i think going through that prepared me for covid school because i became a lot more disciplined this time around and almost flourished in covid school (all a’s for the nine weeks, only one being the result of a curve). so it kinda trained me to be adaptable and stuff like that. \n\ni can’t tell if that would still be too dark to right about or still come off too sob story-ish, but it was a pretty major part of my high school career. \n\noh god i typed a lot but hopefully someone can provide some insight",
      "author": "tis_i_bri",
      "created": 1592107437,
      "upvotes": 1,
      "replies": {
        "fus4m1z": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus4m1z/",
          "text": "Hey, this is a more involved question and I want to give it a thorough answer. Feel free to PM me, I think talking about this with a colleague of mine might be helpful. This definitely does count as overcoming an obstacle, the issue is mainly that it's just a really intense and delicate subject and must be approached carefully so that way you convey the right message without the obstacle itself taking over the essay.",
          "author": "Empowerly-Admissions",
          "created": 1592119838,
          "upvotes": 3,
          "replies": {}
        },
        "furut1j": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furut1j/",
          "text": "It's not a great story, especially the suicide attempt. What are you passionate about?",
          "author": "baycommuter",
          "created": 1592111046,
          "upvotes": 1,
          "replies": {
            "furv6mm": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furv6mm/",
              "text": "i mean it’s not really a story- it was a whole year of my life lol. so that doesn’t count as overcoming something? \n\nuh i’ve been sewing since i was like 9 or 10 ? that’s really like my only passion i guess? i’ve been on the academic team for three years? i don’t really know what qualifies as a passion.",
              "author": "tis_i_bri",
              "created": 1592111344,
              "upvotes": 1,
              "replies": {
                "furvn8n": {
                  "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furvn8n/",
                  "text": "Well look at it as an admissions officer. They see dozens of applications from people who have mental health issues and have to worry about each one posing a danger to their school's reputation. I'd rather read a well-written essay about sewing and what you've learned from it.",
                  "author": "baycommuter",
                  "created": 1592111719,
                  "upvotes": 2,
                  "replies": {
                    "furwdsm": {
                      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furwdsm/",
                      "text": "the only thing i’ve learned from it is self-sufficiency maybe? but i’m going to have to bring up the mental health issues at some point to explain my extenuating circumstances as to why i had such a bad gpa dip be it in an essay or in the additional info section. so if i have to bring it up either way, would it not be better to elaborate on what happened and how i’ve overcome and grown from it and what skills developed as a result instead of just tacking it on in the additional info area? furthermore, if i have that stuff in the additional info section and then write some random essay about sewing wouldn’t that make them question? idk how any of this stuff works. all i want to do is get into my state school and graduate without being in crippling debt",
                      "author": "tis_i_bri",
                      "created": 1592112322,
                      "upvotes": 1,
                      "replies": {
                        "fus316p": {
                          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus316p/",
                          "text": "A majority of state schools don’t require essays or have automatic admissions based on grades. Check the details for the ones in your state.",
                          "author": "baycommuter",
                          "created": 1592118280,
                          "upvotes": 1,
                          "replies": {
                            "fussull": {
                              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fussull/",
                              "text": "thanks",
                              "author": "tis_i_bri",
                              "created": 1592142247,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "fus4pr1": {
                          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus4pr1/",
                          "text": "I'd try pming a verified AO or asking for help from someone who is an expert/professional w college apps. It's definitely a v delicate situation; props to u for getting thru it.",
                          "author": "luke_sweatshirt",
                          "created": 1592119940,
                          "upvotes": 1,
                          "replies": {
                            "fussuc7": {
                              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fussuc7/",
                              "text": "alright thank you !",
                              "author": "tis_i_bri",
                              "created": 1592142241,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "furvo4c": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furvo4c/",
      "text": "Hey Op.I agree with you. It should be of what you did to overcome it, not just something that happened to you. Do you think writing about a very stressful service in an ambulance shift as a Paramedic student in which I really learned that I could do something to help a good idea, or is it cheesy or not great?",
      "author": "rooo8",
      "created": 1592111740,
      "upvotes": 1,
      "replies": {
        "fus4tv7": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus4tv7/",
          "text": "I don't know if it fits in the overcoming obstacles category exactly (and it doesn't have to to still be a good essay!) but it does sound interesting, I think it's a viable topic",
          "author": "Empowerly-Admissions",
          "created": 1592120052,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fus8wbk": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus8wbk/",
      "text": "Half a clipped toenail....",
      "author": "cyberneticbrain666",
      "created": 1592124136,
      "upvotes": 1,
      "replies": {
        "fuzmank": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuzmank/",
          "text": "When you can't use swear words because you're on your company's account, you need to get creative with your expletive substitutions.",
          "author": "Empowerly-Admissions",
          "created": 1592291526,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fut7yb3": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fut7yb3/",
      "text": "I’ve actually been wondering about this. Can I PM you and discuss my ideas for my essay since you seem to have a good idea of what admissions offices are looking for?",
      "author": "sorayaelena",
      "created": 1592151347,
      "upvotes": 1,
      "replies": {
        "fuzcjg8": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuzcjg8/",
          "text": "yes, feel free to PM me!",
          "author": "Empowerly-Admissions",
          "created": 1592283449,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fuuqojz": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fuuqojz/",
      "text": "[removed]",
      "author": null,
      "created": 1592181609,
      "upvotes": 1,
      "replies": {}
    },
    "fvd87a2": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fvd87a2/",
      "text": "I'm not sure if you're still taking questions but this has been weighing heavily on my mind  since I'm beginning to plan for transferring to a four-year.\n\nI'm a non-traditional student who graduated hs twelve years ago. I experienced ongoing emotional abuse from early childhood into adulthood, my last year of high school through freshman year was in two emotionally abusive relationships, and experienced another significant trauma I don't feel comfortable describing here. I also had ADHD that was not diagnosed until the age of 26 which I believe also significantly impacted my performance. As a result of all this, my grades in the latter half of high school took a hit, I never took my SATs and ACT, dropped my ECs, became isolated from my friends and family, and I ended up with almost exclusively Ws and Fs my freshman year which I am still recovering from academically. I intend NOT to use this as a sob story but to give explanation for my poor grades. I had a child in 2016 and stayed home with him until he was two when I re-enrolled in CC with what I believe was less than a 1.0 and have admittedly faced difficulty maintaining my grades while parenting, participating in ECs, and working. I have raised my GPA to 2.7 making mostly As and Bs with a few Cs and working to replace all the Fs from before. I'm going to receive my Associate of Science this fall with one more science class, which I intend to take as my ultimate goal is to major in Marine Biology at (I am praying) a CSU or a UC, both of which I realize are huge reaches with my grades.\n\nI'm just not sure how to write about any of this without it seeming like a grab for sympathy or how to connect it to my desire to study Marine Bio. I'm also quite frankly feeling discouraged by the whole process because I've been busting my ass for two years and still have a GPA incongruent with my ambitions, which ultimately I think hurts my chances at demonstrating  resilience if I'm relentlessly critical of what successes I HAVE had, if that makes sense.",
      "author": "somethingxfancy",
      "created": 1592594231,
      "upvotes": 1,
      "replies": {
        "fvkec6t": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fvkec6t/",
          "text": "Hey, I am still taking questions. I will try to get a full response to you by Monday evening.",
          "author": "Empowerly-Admissions",
          "created": 1592768441,
          "upvotes": 1,
          "replies": {
            "fvkfac9": {
              "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fvkfac9/",
              "text": "Sure. No rush, I appreciate you taking the time to read this.",
              "author": "somethingxfancy",
              "created": 1592768956,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fut0siv": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fut0siv/",
      "text": "TL;DR write sob stories but focus on how you grew from the experience",
      "author": "GeneriksGiraffe",
      "created": 1592147281,
      "upvotes": 1,
      "replies": {}
    },
    "furkamu": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furkamu/",
      "text": "\"I've gotten numerous students into...\"   That statement made me cringe.",
      "author": "JCDexter",
      "created": 1592103494,
      "upvotes": 1,
      "replies": {
        "furwz0t": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furwz0t/",
          "text": "Well...I mean I have. I do apologize if it came off like I was robbing them of credit for their accomplishments, they're all incredible students I feel lucky to have worked with, and at the end of the day, it's the student, not the counselor, who is the b@d@ss for getting in to a top school.",
          "author": "Empowerly-Admissions",
          "created": 1592112812,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "furas5f": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furas5f/",
      "text": "[deleted]",
      "author": null,
      "created": 1592097217,
      "upvotes": 0,
      "replies": {
        "furwjus": {
          "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/furwjus/",
          "text": "Hey, sorry if this came off the wrong way. I don't want to belittle your experience, and that example was from a real student I've worked with. Sorry to hear you're going through something similar. In case it wasn't clear, I don't think of it like \"a sob story\", I think of these as narratives of overcoming obstacles.\nWishing you the best of luck.",
          "author": "Empowerly-Admissions",
          "created": 1592112459,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fus5glk": {
      "link": "/r/ApplyingToCollege/comments/h8ezgq/stop_pushing_sob_stories/fus5glk/",
      "text": "Not the sub I was expecting to see this on, but yeah... in general, sob stories are mostly people trying to bypass the task at hand, and people see through it",
      "author": "beck-hassen",
      "created": 1592120681,
      "upvotes": 0,
      "replies": {}
    }
  }
}