{
  "sid": "qkdtyt",
  "link": "/r/ApplyingToCollege/comments/qkdtyt/misworded_ec/",
  "title:": "misworded ec",
  "text": "i’m one of the board members of an organization featured on an extremely extremely accredited magazine. i’m\nnot the founder but i’m part of the main team and on my ec description i said “featured on ___,” then elaborated on my position. I applied ED, is this wording going to penalize me, and will i be okay if i just upload the article link to my application portal and indicate that they featured the organization?",
  "author": "localramenconsumer",
  "created": 1635772797,
  "updated": 1636156015,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hivvo1e": {
      "link": "/r/ApplyingToCollege/comments/qkdtyt/misworded_ec/hivvo1e/",
      "text": "How did you misword it? I’m a little confused",
      "author": "admissionsmom",
      "created": 1635775718,
      "upvotes": 1,
      "replies": {
        "hivvvoq": {
          "link": "/r/ApplyingToCollege/comments/qkdtyt/misworded_ec/hivvvoq/",
          "text": "so i’m not the founder, nor was my name featured on (forbes). however, the organization i’m part of the main team (of around 10 directors) of isfeatured on forbes. in the activities section i worded it like “featured on forbes, 2800+ members” and then elaborated on my position and duties in the organization. is this okay?",
          "author": "localramenconsumer",
          "created": 1635775820,
          "upvotes": 1,
          "replies": {
            "hivw5r1": {
              "link": "/r/ApplyingToCollege/comments/qkdtyt/misworded_ec/hivw5r1/",
              "text": "It should be fine. But you can clarify for it for your other apps and say Org. featured…\n\nIf you feel the need to clarify for the colleges you’ve already applied to you can send a quick email update or use the portal if they have that available for you",
              "author": "admissionsmom",
              "created": 1635775953,
              "upvotes": 1,
              "replies": {
                "hivw9ti": {
                  "link": "/r/ApplyingToCollege/comments/qkdtyt/misworded_ec/hivw9ti/",
                  "text": "thank you! do you think letting them know is necessary? or does the 2800+ members segment attached to “featured on forbes” do enough clarification to not portray this as a lie",
                  "author": "localramenconsumer",
                  "created": 1635776007,
                  "upvotes": 1,
                  "replies": {
                    "hivzm3g": {
                      "link": "/r/ApplyingToCollege/comments/qkdtyt/misworded_ec/hivzm3g/",
                      "text": "Not sure they’ll look at that. I think it’s probably fine, but I alway suggest students go with their comfort level about these kinds of things. If it were me I’d probably send a quick oops clarification email. But I’m not sure it’s necessary",
                      "author": "admissionsmom",
                      "created": 1635777535,
                      "upvotes": 2,
                      "replies": {
                        "hivzt1y": {
                          "link": "/r/ApplyingToCollege/comments/qkdtyt/misworded_ec/hivzt1y/",
                          "text": "okay! i think i will . so when i upload a document to my portal, should i list one thing at a time? because i also have to clarify something else. can i just list every note in one document in the form of bullets? and will mentioning this forbes thing harm me?",
                          "author": "localramenconsumer",
                          "created": 1635777621,
                          "upvotes": 2,
                          "replies": {
                            "hiw03q3": {
                              "link": "/r/ApplyingToCollege/comments/qkdtyt/misworded_ec/hiw03q3/",
                              "text": "Yes. I’d just title it \n\nUpdates and Clarifications to my Application \n\nMake sure your name is on it. \n\nAnd yes. I’d use bullet points\n\nNo. I dont see how linking to the Forbes document will hurt you but I just don’t know if they’ll click on it",
                              "author": "admissionsmom",
                              "created": 1635777756,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}