{
  "sid": "qc4er6",
  "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/",
  "title:": "I had a college application advisor/tutor. And she said she will edit my essay but it ends up she almost wrote it for me.",
  "text": "I had a college application advisor/tutor. And she said she will edit my essay but it ends up she almost wrote it for me. What should I do? I really feel bad of doing so.\n\nEdit: I am talking with my parents about it and hopefully I can convince them to not use the advisor.",
  "author": "Striking-Warning9533",
  "created": 1634746256,
  "updated": 1634749562,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhdkowi": {
      "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/hhdkowi/",
      "text": "That's pretty much illegal tbh, ask your parents about it?",
      "author": "anuxietys",
      "created": 1634746314,
      "upvotes": 1,
      "replies": {
        "hhdkthr": {
          "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/hhdkthr/",
          "text": "I know it is illegal. That advisor said the colleges won't know.",
          "author": "Striking-Warning9533",
          "created": 1634746363,
          "upvotes": 1,
          "replies": {
            "hhdl1kg": {
              "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/hhdl1kg/",
              "text": "That's shady and a red flag in an advisor. Your degree could get revoked any time even after graduation if anyone found out. (Which they probably can, considering you posted it here), is this a private advisor or a school counselor?",
              "author": "anuxietys",
              "created": 1634746451,
              "upvotes": 1,
              "replies": {
                "hhdmwcz": {
                  "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/hhdmwcz/",
                  "text": "Definitely a private one, school will never do that",
                  "author": "Striking-Warning9533",
                  "created": 1634747183,
                  "upvotes": 1,
                  "replies": {
                    "hhdnqf0": {
                      "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/hhdnqf0/",
                      "text": "They're jeopardizing your future and also doing something incredibly shady and illegal. Admissions officers aren't that dumb to not be able to differentiate between the writing of an adult and that of a student freshly out of high school. It's a massive risk, which imo isn't worth taking considering how much you can be humiliated if anyone finds out (reiterating on the fact that they probably will, our digital footprint doesn't go away on clicking delete) and how much money you will waste if they revoke your degree.",
                      "author": "anuxietys",
                      "created": 1634747513,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhdm4p3": {
      "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/hhdm4p3/",
      "text": "This is a huge red flag. Have your parents contact this \"advisor\"...she is really not worth a penny. By writing your essay and then claiming \"colleges won't know\". she is putting you at risk (not to mention she is thoroughly unethical). Your contract and contact will her should cease upon informing her. Do you not have a school counselor?",
      "author": "Radiant-Chipmunk-987",
      "created": 1634746883,
      "upvotes": 1,
      "replies": {
        "hhdnxnj": {
          "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/hhdnxnj/",
          "text": "Here is the thing, I have a high school counselor and it is really helpful already. And there is no reason for me to get a private advisor: some decent colleges and professors already email me for a guarantee enrollment even scholarships. HOWEVER, my parents are really crazy about education, they want me to to the top university, they spent couple thousands dollars on advisoring and tutoring. I really don't understand.\n\n But I think they won't do unethical things, I will talk with them about this.",
          "author": "Striking-Warning9533",
          "created": 1634747593,
          "upvotes": 1,
          "replies": {
            "hhdra47": {
              "link": "/r/ApplyingToCollege/comments/qc4er6/i_had_a_college_application_advisortutor_and_she/hhdra47/",
              "text": "Yes...And, be sure to save and show your parents your history of emails with her. Most often your HS counselor is the best asset you and your family have. Good Luck! You sound as if you are a great candidate with strong ethics. The second will serve you best in life.",
              "author": "Radiant-Chipmunk-987",
              "created": 1634748890,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}