{
  "sid": "q6thsj",
  "link": "/r/ApplyingToCollege/comments/q6thsj/should_i_get_my_associates_and_transfer_or_get_my/",
  "title:": "should i get my associates and transfer or get my associates and start all over as a freshman?",
  "text": "im currently a sophomore in high school but next year ill be attending a school located at my local community college that's basically just dedicated to earning your associates in the last 2 yrs of hs. this is the best opportunity currently offered to me, as the area i live in has absolutely no useful extracurricular activities for my desired major atm so im willing to dedicate all my time w those studies for the time being. its also among the best in the country. but also i am not aiming towards staying in this state because i absolutely hate it here to the point i feel ill and ive been looking forward to studying out of state for years\n\nso my plan was that i got my associates and had impeccable grades and a shitton of research and volunteer hours + mock trial (to make up for my lack of eqs) and then to transfer to a good uni for my major but now that im reading about the acceptance rates for oos transfer students i feel really stressed out\n\nso do i just go w my current plan and transfer ? or do i get my associates degree in something related to my future career and then apply for a different major as a freshman to my dream unis  ? is having 2 aas counterproductive? or do i just try to not get my associates at all?",
  "author": "dianaisgnarly",
  "created": 1634066254,
  "updated": 1634072714,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hge4x2y": {
      "link": "/r/ApplyingToCollege/comments/q6thsj/should_i_get_my_associates_and_transfer_or_get_my/hge4x2y/",
      "text": "If you earn an associates degree in HS, you apply as a first-year student, regardless of how mant college credits you've earned.",
      "author": "skieurope12",
      "created": 1634067379,
      "upvotes": 3,
      "replies": {
        "hge6s0u": {
          "link": "/r/ApplyingToCollege/comments/q6thsj/should_i_get_my_associates_and_transfer_or_get_my/hge6s0u/",
          "text": "OHH ok thank you so much that makes it a lot clearer",
          "author": "dianaisgnarly",
          "created": 1634068126,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}