{
  "sid": "r06662",
  "link": "/r/ApplyingToCollege/comments/r06662/how_important_is_college_location/",
  "title:": "how important is college location?",
  "text": "hello everyone,\n\ni recently graduated high school and enlisted in the US air force. i plan on getting as many credits as i can while i’m in and finishing when i’m out (as i most likely will not have the time to finish a four year + work). i plan on majoring in finance and working my way into high finance. top places to work (chicago or new york city. maybe boston). unfortunately, there aren’t many air force bases where i would like to go to college (nyc and chicago).\n\nso my question is: if i attend school, let’s say, in dc. how much harder is it to then transfer to a new state and get a job vs. going to school in the same state you want a job in?\n\np.s. if any veterans would like to chime in on their story that would also be very helpful! \n\nthank you in advance!",
  "author": "sin1sback",
  "created": 1637646288,
  "updated": 1637687219,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hlqlia5": {
      "link": "/r/ApplyingToCollege/comments/r06662/how_important_is_college_location/hlqlia5/",
      "text": "It depends. For example UIUC is in central Illinois without a few hours away from any city over a million people. Yet tech companies come to Urbana-Champaign for the tech talent. It is also shown for smaller schools like Missouri S&T having a fairly strong pipeline to Boeing. So it depends. There are strong job opportunities in finance especially for vets in DC. Either as an accountant for government or a finance expert for the various companies there. Here is a list for colleges who’s grads make 70k+ two years after graduation [sorted by graduation rate](https://collegescorecard.ed.gov/search/?cip4=5203&cip4=5208&cip4_degree=c&cip4_degree=a&cip4_degree=b&fos_salary=70000..150000&page=0&sort=completion_rate:desc&toggle=fos). You experience will likely be different having more experience working but it can give a rough proxy by looking at where the colleges are clustered.",
      "author": "TritonTheCat",
      "created": 1637647758,
      "upvotes": 2,
      "replies": {}
    }
  }
}