{
  "sid": "qkxaq9",
  "link": "/r/ApplyingToCollege/comments/qkxaq9/sent_sat_scores_nov_1_too_late/",
  "title:": "Sent SAT Scores Nov. 1 - Too Late?",
  "text": "I didn't realize that Collegeboard MAILED the SAT scores...  I figured once I clicked send they would send them digitally and that would be the end of it.  I submitted my applications on Oct. 31 and sent my scores on Nov 1st.  I didn't think anything of it until I read on the collegeboard website that they mail scores.\n\nMy 1370 on the SAT is really a high point in my applications, do you think the colleges will accept the scores if they come in after my application and after the deadline?  Or will they consider my application without the scores?",
  "author": "xNyxNox",
  "created": 1635830960,
  "updated": 1636162016,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hizezt6": {
      "link": "/r/ApplyingToCollege/comments/qkxaq9/sent_sat_scores_nov_1_too_late/hizezt6/",
      "text": "I would call the admissions office for the schools you're applying to tomorrow. My SAT scores were sent on Friday but still weren't showing up on my portal. The admissions office just asked for the order confirmation and said ok. Another one said they give leeway until Friday for stuff to come in. Either way, just call and ask.",
      "author": "mightyeagle11",
      "created": 1635835298,
      "upvotes": 2,
      "replies": {
        "hj2m3mr": {
          "link": "/r/ApplyingToCollege/comments/qkxaq9/sent_sat_scores_nov_1_too_late/hj2m3mr/",
          "text": "Okay, I think I will do that.  Thank you.",
          "author": "xNyxNox",
          "created": 1635892675,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj2lap4": {
      "link": "/r/ApplyingToCollege/comments/qkxaq9/sent_sat_scores_nov_1_too_late/hj2lap4/",
      "text": "Very unlikely they still physically mail reports anywhere\n\nThey electronically deposit scores to a school’s electronic inbox, typically once or twice a week.\n\nWhether schools accept late application components varies by school.\n\nIf they determine your application was not complete, they will roll it to the Regular Decision process. They won’t evaluate it test-optional if you did not indicate a test-optional applicatio.",
      "author": "RichInPitt",
      "created": 1635892348,
      "upvotes": 1,
      "replies": {
        "hj2m2f4": {
          "link": "/r/ApplyingToCollege/comments/qkxaq9/sent_sat_scores_nov_1_too_late/hj2m2f4/",
          "text": "I figured they did not physically mail, but I could not figure out any reason that they would have regular and express delivery if they had an automated digital process (which seems like the easiest for everyone).\n\nWell, I suppose we'll see.  One school gave me a portal where I can see they are waiting while the other school sent me an email telling me to request my scores if I haven't already, which makes me think that they are both waiting.",
          "author": "xNyxNox",
          "created": 1635892661,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}