{
  "sid": "q5voh8",
  "link": "/r/ApplyingToCollege/comments/q5voh8/how_does_college_work_in_america_especially_byu/",
  "title:": "How does college work in america? especially BYU?",
  "text": "Hello I am very sorry for this stupid question, but I am starting college next year in fall which is about late august, I was wondering how will it work? Is there terms and how long are the terms?\n\nMy main question is, if I started fall this year, in august, will i continue my classes next year at the start times of winter, spring and summer? or will I only go to college for this fall, and then start again next fall?\n\nI am just so confused because I heard you can start college in any season you want, such as fall summer etc, if I start in fall, will I continue my classes at the start dates of Winter, Spring and then summer? Along with the new students that start at those times?\n\n&#x200B;\n\nAlso I am from australia thats why I dont know the system",
  "author": "jaromeluai",
  "created": 1633958368,
  "updated": 1634073264,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hg8718y": {
      "link": "/r/ApplyingToCollege/comments/q5voh8/how_does_college_work_in_america_especially_byu/hg8718y/",
      "text": "If the college is on a semester schedule and you start in the fall, you finish the fall semester before Christmas and then return in January. Continue cycle for 4 more years. Each semester is about 15 weeks.",
      "author": "skieurope12",
      "created": 1633959739,
      "upvotes": 1,
      "replies": {}
    },
    "hg8df2p": {
      "link": "/r/ApplyingToCollege/comments/q5voh8/how_does_college_work_in_america_especially_byu/hg8df2p/",
      "text": "Normally a school year starts in fall semester and continues through winter. If you choose to you can take “extra” courses in spring/summer, although this is not typical",
      "author": "scarlettc1107",
      "created": 1633962736,
      "upvotes": 1,
      "replies": {}
    },
    "hg8mh2r": {
      "link": "/r/ApplyingToCollege/comments/q5voh8/how_does_college_work_in_america_especially_byu/hg8mh2r/",
      "text": "At BYU you will have a set of classes that go from September to December called Fall Semester. Then you will have a different set of classes from January to April that is called winter semester. 8 semesters over 4 years is usually enough to finish all the required classes for your major, although classes are also offered in May-June and July-August but people mainly just sign up for those if they fall behind or want to finish earlier, all the classes required for you major will be offered in the normal semesters. You always sign up for classes for each semester a couple months before it starts so you want to pay attention to when that is so that classes you want don't fill up completely.",
      "author": "tenisplenty",
      "created": 1633966657,
      "upvotes": 1,
      "replies": {}
    }
  }
}