{
  "sid": "qpweh0",
  "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/",
  "title:": "Where can i get into a good college with a budget of $54000 for aerospace engineering?",
  "text": "$54000 for the whole course My budget too less for Canada or the USA. As per my research European countries are that worth of money for graduation and Singapore has only 2 great universities and if i don't get into either of them then i am screwed\n\nShould i get my graduation done from India (my home country)  and do my masters from Canada, Europe, USA as post graduation is cheaper and more worth of money.\n\nIs my thought process accurate?",
  "author": "SBiner",
  "created": 1636434448,
  "updated": 1636653537,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjwkabi": {
      "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/hjwkabi/",
      "text": "Cal Poly(California Polytechnic State University-San Luis Obispo) is in your budget for undergrad and is a pretty decent school for aerospace. Iowa State is decent but I would probably recommend your apply as MechE same thing is true for Missouri S&T. Iowa State is probably not as good since the main employer is Collins Aerospace, who I think is a contractor. But Missouri S&T’s main employer is Boeing in St. Louis so it doesn’t have the same difficulties.",
      "author": "TritonTheCat",
      "created": 1636436599,
      "upvotes": 4,
      "replies": {
        "hjwspdv": {
          "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/hjwspdv/",
          "text": "FWIW, Collins in Cedar Rapids makes pretty much all of the avionics and missions systems for Raytheon. They are literally the industry leader of those fields. \n\nClose by is also Oshkosh Defense, Lockheed Martin (multiple offices in WI), Sierra Space (Orbitech), Sikorsky (subsidiary in Milwaukee), and Basler Turbo Conversions (trust me, they are a wild company, and really cool).",
          "author": "the_Q_spice",
          "created": 1636442559,
          "upvotes": 3,
          "replies": {
            "hjxjd3c": {
              "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/hjxjd3c/",
              "text": "A lot of the US aerospace jobs are in defense so I was just unsure about whether those companies can hire foreign engineers even if they have US degrees.",
              "author": "TritonTheCat",
              "created": 1636463329,
              "upvotes": 2,
              "replies": {
                "hjy72bu": {
                  "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/hjy72bu/",
                  "text": "Even some internships and graduate schools have citizenship restrictions for defense-adjacent projects.",
                  "author": "Perplexed-Owl",
                  "created": 1636474162,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjwjk1q": {
      "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/hjwjk1q/",
      "text": "$54000 per year?\n\nThat's enough to afford some excellent options in the US if you can get admitted - Georgia Tech is less than that I think, and Purdue is less than that for sure.  There are less selective options that would be affordable as well - the aerospace industry is pretty big in the US so there are a lot of good programs.\n\nThat doesn't necessarily mean it's worth it though for undergrad -- aerospace as a field has a ton of work restrictions because so much of the work is covered under export control laws. If you can get into a good program in India that might make more sense.",
      "author": "BrawnyAcolyte",
      "created": 1636436144,
      "upvotes": 1,
      "replies": {
        "hjwkzql": {
          "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/hjwkzql/",
          "text": "Not per year 😐. The total",
          "author": "SBiner",
          "created": 1636437059,
          "upvotes": 7,
          "replies": {
            "hjxtv3w": {
              "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/hjxtv3w/",
              "text": "Yeah - that pretty much takes out the US for undergrad unless you can get into somewhere like Cornell as an international student seeking aid, which is incredibly competitive.   Options that are very good with merit aid like UAH are still going to be $20k/year.",
              "author": "BrawnyAcolyte",
              "created": 1636468565,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjy0ngz": {
      "link": "/r/ApplyingToCollege/comments/qpweh0/where_can_i_get_into_a_good_college_with_a_budget/hjy0ngz/",
      "text": "Western Michigan University",
      "author": "diesalotXV",
      "created": 1636471519,
      "upvotes": 1,
      "replies": {}
    }
  }
}