{
  "sid": "qkiarx",
  "link": "/r/ApplyingToCollege/comments/qkiarx/last_minute_app_questions/",
  "title:": "Last minute app questions",
  "text": "For the activities, should I avoid putting in clubs that I've joined senior year but haven't done anything in yet? For example, I joined NHS recently. We've only had one meeting so far so I haven't actually done anything aside from show up. I have some other activities, so I'm not hurting too badly, but I don't have a ton either.\n\nFor the essay, I only \"finished\" it yesterday. Should I try to get a teacher to edit it today? On the one hand, it could be helpful, but on the other hand there's not much time to revise, so I'd almost rather just submit it not knowing how good/bad it is than find out it's hot trash and have to either submit it anyway or frantically try to rewrite it.",
  "author": "kiddrone",
  "created": 1635785763,
  "updated": 1635890296,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiwl91y": {
      "link": "/r/ApplyingToCollege/comments/qkiarx/last_minute_app_questions/hiwl91y/",
      "text": "Order your activities with the most important coming first. It's fine to add activities at the bottom that are new for senior year.\n\nSomeone should read your essay. (It is much easier for someone who is not the author to catch typos.)  Consider finding some other adult who is not a teacher, such as a parent or older sibling, as teachers might be busy with finishing recs today.",
      "author": "elkrange",
      "created": 1635786961,
      "upvotes": 3,
      "replies": {
        "hiww1zo": {
          "link": "/r/ApplyingToCollege/comments/qkiarx/last_minute_app_questions/hiww1zo/",
          "text": "Okay, thanks. I did have my mom edit it, just not someone more familiar with college essays.",
          "author": "kiddrone",
          "created": 1635791400,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiwlbym": {
      "link": "/r/ApplyingToCollege/comments/qkiarx/last_minute_app_questions/hiwlbym/",
      "text": "Just being a member of NHS isn't going to add any value to your application, but if you have space, there's no reason not to include it",
      "author": "freeport_aidan",
      "created": 1635786995,
      "upvotes": 2,
      "replies": {}
    },
    "hixeum1": {
      "link": "/r/ApplyingToCollege/comments/qkiarx/last_minute_app_questions/hixeum1/",
      "text": "I put an activity that I started in July (so senior year) as my number 1 activity bc it’s insanely unique",
      "author": "Cool_Tale3626",
      "created": 1635799022,
      "upvotes": 1,
      "replies": {}
    }
  }
}