{
  "sid": "q83711",
  "link": "/r/ApplyingToCollege/comments/q83711/what_should_i_put_in_my_art_portfolio/",
  "title:": "What should I put in my art portfolio?",
  "text": "I'm not applying to be an art major but I have the opportunity to submit a portfolio, which is an opportunity I am going to take. So far I am planning to put some photos of the football team I took, club posters, merchandise designs I made for different clubs, fake advertisements I made for real companies (is that allowed?), a couple of drawings, and a couple of paintings.\n\n&#x200B;\n\nDoes anyone have experience with this? There is no min/max that I can submit, so is 15 pieces a good number? Please let me know! TY!",
  "author": "murbsta",
  "created": 1634228761,
  "updated": 1634251616,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgmr1z2": {
      "link": "/r/ApplyingToCollege/comments/q83711/what_should_i_put_in_my_art_portfolio/hgmr1z2/",
      "text": "Is there a common theme that ties all this together? Because from your description, it sounds like you're throwing shit against the wall to see what sticks.\n\nAn art supplement is optional and a portfolio, even if not an art major, needs to be high quality. If it's not, you're just wasting everyone's time.",
      "author": "skieurope12",
      "created": 1634230757,
      "upvotes": 1,
      "replies": {
        "hgmrhcw": {
          "link": "/r/ApplyingToCollege/comments/q83711/what_should_i_put_in_my_art_portfolio/hgmrhcw/",
          "text": "I didn’t mean to make it sound like I’m throwing shit against the wall, I just want to show schools that I can do a variety of art forms (digital design, painting, drawing, photography, etc.) I don’t know a lot about art supplementals and this specific school says to show variety, that’s why I am asking.",
          "author": "murbsta",
          "created": 1634230937,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}