{
  "sid": "q4a9zj",
  "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/",
  "title:": "Uchicago or Northwestern",
  "text": "I know that this is the age old question lol, but I am genuinely pulling my hair out. I’d like to think that I’m a “thinker” and really like the uchicago theoretical atmosphere, but am not sure about the academic rigor since I don’t want to spend 24 hours at the library. I’ve heard that northwestern has a more chill, collaborative environment compared to the more competitive uchicago. At uchicago I would be trying for the molecular engineering program. At Northwestern I would be going for some materials science degree. I still want to be able to think, but in a friendlier environment. Which do you think would be better for me? Thanks in advance and sorry for rambling.",
  "author": "iiChzzqD2",
  "created": 1633738436,
  "updated": 1634074142,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hfxssj6": {
      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxssj6/",
      "text": "I mean, some colleges are easier than others, but **college is not easy**. If you think going to northwestern will give you a stress free 4 year (no 24 hours at the library) then prepare for potential regrets.\n\nIf you think northwestern's culture/environment is more friendly, then yeah, possibly NW is the right choice. If you prefer NW because you don't want to work hard, then probably not the right choice.",
      "author": "idkname999",
      "created": 1633749786,
      "upvotes": 7,
      "replies": {
        "hfz2a7x": {
          "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfz2a7x/",
          "text": "Sorry if it came across that way, but I want to work hard and do great things. The thing is I just want to have a bit more freedom with my time to do other things instead of just school.",
          "author": "iiChzzqD2",
          "created": 1633781682,
          "upvotes": 4,
          "replies": {
            "hg154ka": {
              "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hg154ka/",
              "text": "Aw, that makes sense. It did came across a bit that way =P\n\nI don't know much between the 2 schools but I went to a pretty stressful college, so your concern is a valid one. I do like to mention though that college is pretty different from high school. It is generally more flexible and you have more control. For instance, in high school, you probably have daily assignments but college, assignments, at worse, are weekly. So you really have to plan your own schedule out. Even though the college I went to is pretty stressful, I still seen people spend a lot time outside of courses (start a company, research, etc). You can really design your schedule/coursework where you have a bit freedom. This, of course, is not to dismiss your concern because there is a difference between colleges.",
              "author": "idkname999",
              "created": 1633816661,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hfx8d23": {
      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfx8d23/",
      "text": "I think a good test is to see if you have a good idea for the UChicago extended essay and try and write it. If you do, then apply there because it'll be fun to write. If you don't, there's a good chance you wouldn't like it there.\n\nAlso, assuming you can afford the application fee and have enough time to write the supps for both, apply to Northwestern too.",
      "author": "FuriousGeorge1435",
      "created": 1633739651,
      "upvotes": 7,
      "replies": {}
    },
    "hfz1ndq": {
      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfz1ndq/",
      "text": "I’m currently a student at Uchicago and we are very collaborative, I’m in group chats where we help each other answer psets, I do comp sci hw with other ppl etc. , and I have never felt any sort of competition tbh besides applying to finance RSOs, so that shouldn’t be a concern. However if u r interested in pursuing engineering I whld honestly suggest u go to a different school besides uchicago.",
      "author": "run1234554",
      "created": 1633781267,
      "upvotes": 3,
      "replies": {
        "hg0kgeh": {
          "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hg0kgeh/",
          "text": "I’m not entirely dead set on engineering, which is why I am considering uchicago as a top choice. I’m really attracted to the “life of the mind” style of uchicago, but am wondering if it’s super over exaggerated. Thanks in advance!\n\nEdit: also one of the main reasons why my current ED is uchicago and not northwestern",
          "author": "iiChzzqD2",
          "created": 1633807541,
          "upvotes": 1,
          "replies": {
            "hg0m3va": {
              "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hg0m3va/",
              "text": "Depends what is your impression/definition of the life of the mind at Uchicago?",
              "author": "run1234554",
              "created": 1633808255,
              "upvotes": 1,
              "replies": {
                "hg0npqx": {
                  "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hg0npqx/",
                  "text": "Like more thinking based I guess. As I said in the post I’d like to think I’m more of a thinker and like to ruminate over problems and especially my mental health. Idk uchicago keeps marketing themselves as this thinking powerhouse and I was just wondering if that was true.",
                  "author": "iiChzzqD2",
                  "created": 1633808973,
                  "upvotes": 1,
                  "replies": {
                    "hg0rjlw": {
                      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hg0rjlw/",
                      "text": "Like all other marketing tactics it’s def over exaggerated to a certain extend. But if you define life of the mind as \n1. Every class you take will be hard, rewarding, and intellectually stimulating \n2. Classes being very theoretical and can potentially change the way you think\n3. Find communities that share your interest that you can have perspective warping conversations with\n4. Find people to work on p sets with to late into the night\nThen yes uchicago has all those, but if you expect to meet a random person and instantly have a “life of the mind” conversation with them, that won’t happen. We are for the most part still very typical college students.",
                      "author": "run1234554",
                      "created": 1633810688,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfxc5c2": {
      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxc5c2/",
      "text": "You want to try a start-up so-so ChemE department at Chicago (because yes, most schools have Chemical and Biomolecular Engineering departments) instead of one in the top 20 (at Northwestern)? Yeah, I know: **UChicago**, but they are just not there for engineering and if you have any interests in related areas they have nothing there to support that. Honestly, I would not even bother with Chicago and would, instead, look at any of the other top 15-20 engineering schools.\n\nEdit: I know this sounds harsh, but nobody asks \"I'm interested in literature so should I choose Harvard or MIT?\" Even if Chicago were fully committed to engineering (which they are not), it would take them years just to get to where Harvard is -- and that's still not great.",
      "author": "minimuminfeasibility",
      "created": 1633741469,
      "upvotes": 5,
      "replies": {
        "hfxi6i7": {
          "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxi6i7/",
          "text": "I’m not in engineering but I’ve heard so much hype here about PME. Is it really perceived as nothing more than a ‘so-so chemE department’ among engineers (including I guess for the PhD level)? I wouldn’t be that surprised if that’s the case tbh, but I’m genuinely curious.",
          "author": "SnooKiwis7945",
          "created": 1633744465,
          "upvotes": 2,
          "replies": {
            "hfxkshc": {
              "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxkshc/",
              "text": "Look at the rankings -- including academic rankings -- for ChemE or MatSci. Chicago isn't even close to the top or the middle of those (and it's missing from many of them). Look at where they get people from too: if they didn't share people with Argonne, they wouldn't have even some of their so-so people.\n\nFurthermore, engineering disciplines benefit from each other. What if you hit a problem with connections to MechE or EE or the Chem part of \"ChemE\" (now usually ChemMolE) or Operations Research/IE (common, because optimization crops up a lot)? What do the researchers there do? They talk to people at Argonne or Northwestern or UIUC. So why not just go where the experts are?\n\nI've read the hype too, but I also know the weaknesses in anything that is close to engineering. Hell, some alumni are angry that engineering (and the undergrad finance minor) means Chicago is becoming too careerist. That's not what I'd call a supportive ecosystem.",
              "author": "minimuminfeasibility",
              "created": 1633745743,
              "upvotes": 3,
              "replies": {
                "hfxl47k": {
                  "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxl47k/",
                  "text": "The only engineering rankings where I found Chicago anywhere near the top is on the Shanghai rankings - 30th in materials engineering, 19th in metallurgical, 12th in energy science and engineering. But I don’t know how reliable these rankings are, or if these subfields actually reflect how the field conceives of itself. Would any of these be related to pme?",
                  "author": "SnooKiwis7945",
                  "created": 1633745906,
                  "upvotes": 4,
                  "replies": {
                    "hfxmd7q": {
                      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxmd7q/",
                      "text": "That might be related to PME but it's also got some odd issues. Like: Chicago is ranked 101-150 for MechE and Biomedical Engineering -- departments they do not even have -- while it is ranked 151-200 for CS. That is not reassuring. Meanwhile, as someone noted above, Northwestern is one of the top departments in the world for materials science according to most rankings.",
                      "author": "minimuminfeasibility",
                      "created": 1633746525,
                      "upvotes": 3,
                      "replies": {
                        "hfxmfzc": {
                          "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxmfzc/",
                          "text": "Interesting. Thanks for the info!",
                          "author": "SnooKiwis7945",
                          "created": 1633746563,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hfxfj6e": {
          "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxfj6e/",
          "text": "Are you talking about Northwestern too because they are very highly rated for materials science, which is what I’m interested in pursuing.",
          "author": "iiChzzqD2",
          "created": 1633743135,
          "upvotes": 3,
          "replies": {
            "hfxl1ll": {
              "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxl1ll/",
              "text": "Yeah, Northwestern is top 10 for MatSci. Top ten!\n\nChicago? \"Yeah, we have some people in that area.\" Nope. Thanks for playing, but no.\n\nThanks for noting the lack of clarity, though; fixed that.",
              "author": "minimuminfeasibility",
              "created": 1633745870,
              "upvotes": 5,
              "replies": {
                "hfxwizi": {
                  "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxwizi/",
                  "text": "Northwestern is usually ranked #2 in Mat Sci right behind MIT!",
                  "author": "hendersball",
                  "created": 1633751770,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg0ytwd": {
      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hg0ytwd/",
      "text": "irrelevant but is your pfp wits end😟",
      "author": "flabbergasted101",
      "created": 1633813838,
      "upvotes": 2,
      "replies": {
        "hg130jy": {
          "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hg130jy/",
          "text": "Yes lol",
          "author": "iiChzzqD2",
          "created": 1633815699,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfyytxp": {
      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfyytxp/",
      "text": "Northwestern",
      "author": "Public_Watch1905",
      "created": 1633779344,
      "upvotes": 4,
      "replies": {}
    },
    "hfxix3n": {
      "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxix3n/",
      "text": "I love both but I'd always choose Northwestern if it was a choice. I think resources wise, they're like almost same. Bith provide AMAZINGGGG resources to their students. But Northwestern's campus is just too damn hot. Like HAWT. (Pro tip--- Their students are also hot).",
      "author": "Concerned-gay-guy",
      "created": 1633744822,
      "upvotes": 3,
      "replies": {
        "hfxmi6j": {
          "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxmi6j/",
          "text": "If only I was hot too lol",
          "author": "iiChzzqD2",
          "created": 1633746593,
          "upvotes": 3,
          "replies": {
            "hfxmobj": {
              "link": "/r/ApplyingToCollege/comments/q4a9zj/uchicago_or_northwestern/hfxmobj/",
              "text": "Oh honey you are. Trust me we're the total same... And you are HAWT.",
              "author": "Concerned-gay-guy",
              "created": 1633746678,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}