{
  "sid": "q5zqs5",
  "link": "/r/ApplyingToCollege/comments/q5zqs5/recommendation_letters_from_a_phd_student/",
  "title:": "Recommendation Letters from a PhD Student",
  "text": "I’m a PhD student right now with a masters from a reputed university. I’ve been teaching for close to 10 years via my company where I’m also stated as a director - I know this sounds a bit pretentious but it is what it is. There is this one particular student that I taught for about 3-4 years and he is a very bright kid. \n\nHe is now applying for undergrad admissions in the US and wants me to write a recommendation letter for him. I don’t have the heart to tell him no (I mean I would love to) but I also do not think that my recommendation letter would hold any weightage or sway due to the fact that I do not have great credentials (still pursuing a PhD) and that I am not a full fledged professor at a university/school either. \n\nAny suggestions? Am I wrong about my recommendation being worthless? should I be upfront and ask him to get a reco letter from someone else who probably has a teaching job?",
  "author": "bouncii99",
  "created": 1633969898,
  "updated": 1634072982,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hg8uxhh": {
      "link": "/r/ApplyingToCollege/comments/q5zqs5/recommendation_letters_from_a_phd_student/hg8uxhh/",
      "text": "i mean, ive mostly read that it doesn't matter *who* the recommender is, just how close your relationship is with that recommender and their ability to write good and personal things about you. if your main concern is that you're only a PhD student, I think you should write it anyway -- even if your concerns are right, it can't hurt the student in any way.",
      "author": "thifting",
      "created": 1633970173,
      "upvotes": 6,
      "replies": {}
    },
    "hg9s6wn": {
      "link": "/r/ApplyingToCollege/comments/q5zqs5/recommendation_letters_from_a_phd_student/hg9s6wn/",
      "text": "I'm doing research with a PhD student at a university and having her write me a letter. She's able to shed a new perspective on my application, and I think her letter will only help.",
      "author": "CarelessToday105",
      "created": 1633984225,
      "upvotes": 2,
      "replies": {}
    }
  }
}