{
  "sid": "qosguc",
  "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/",
  "title:": "Question about Financial Aid with ED Application",
  "text": "When checking the box for Early Decision on Common App, the text says the following:\n\n\"If you are an Early Decision candidate and are seeking financial aid, you need not withdraw other applications until you have received notification about financial aid from the admitting Early Decision Institution\"\n\nDoes this mean if I get accepted into my Early Decision school, I can wait until I get my financial aid package before withdrawing, and if it doesn't work and I need to reject the offer, I can still attend one of my early action schools?\n\nIf that's not what it means, could someone explain? I applied early decision to a school, but my main concern is financial aid, and I don't want to be limited to only RD schools if financial aid doesn't work out if there might be an alternative.",
  "author": "7StepsAheadVFX",
  "created": 1636303858,
  "updated": 1636654197,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjpbikf": {
      "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjpbikf/",
      "text": "Yes, that's what it means, but once you reject your ED offer, there's no going back. You cannot merely *wait* to see what your EA schools offer - many EA decisions are released in January, well after ED. You do not get to *compare* actual financial aid packages.\n\nThat said, run the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. Compare *estimates* for all your schools.  If your ED school is unlikely to be affordable, do not apply ED. If the NPC estimate for your ED school is affordable, and you are admitted ED with an actual financial aid package that is similar, then that's where you're going.\n\n(Sometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions.)",
      "author": "elkrange",
      "created": 1636309227,
      "upvotes": 4,
      "replies": {
        "hjpp8xs": {
          "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjpp8xs/",
          "text": "Who determines if a school is affordable? If we get our package and the school claims it’s affordable, am I bound to attend? Or could I say it doesn’t work financially and not go even if they “disagree” about it being unaffordable?",
          "author": "7StepsAheadVFX",
          "created": 1636314562,
          "upvotes": 1,
          "replies": {
            "hjpxmdp": {
              "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjpxmdp/",
              "text": "They cannot legally force you to attend. However, when you sign the ED agreement, you agree that if you are accepted, they can share your name with other institutions, which could potentially cause issues with your other schools. It can get sticky - they can bring your high school counselor into the loop, etc. It is not as easy as just *saying* it's not affordable, especially when you should already have an estimate from the Net Price Calculator, and assuming the actual package is in line with the estimate.\n\nBargain in good faith. If doesn't look affordable now, you can move your ED to RD.",
              "author": "elkrange",
              "created": 1636317819,
              "upvotes": 3,
              "replies": {
                "hjq8hvg": {
                  "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjq8hvg/",
                  "text": "I’ve actually not found a way to move my ED to RD. Is this option meant to be available on every school’s portal? I cannot find it on mine.\nAdditionally, I feel like if I ask my admissions officer to switch me from ED to RD, I might be giving myself worse chances than other RD applicants because they might think “why would we accept someone who essentially just told us they’re not that interested in our school?”.\n\nI assure you I am not trying to game the system. I really wish to go to my ED school, I just don’t want to cripple myself with student loans for the rest of my life. The only aspect of me EDing that does not line up is financial.\n\nIt seems I may have to take out the max student loans and accumulate ~$57k in debt and I’m just so anxious about that but I also don’t want to screw myself over and leave myself with schools I don’t want to attend. I don’t even know if 57k is a lot or not, it’s hard to tell as an 18 year old what will cripple me as an adult.\n\nI could always go to this school and transfer after a year if I need to, but then will I get the same amount of scholarships with my exceptional high school stats or will those no longer matter? I have no idea.",
                  "author": "7StepsAheadVFX",
                  "created": 1636322173,
                  "upvotes": 1,
                  "replies": {
                    "hjq8vm4": {
                      "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjq8vm4/",
                      "text": "You would need to email them to move your app from ED to RD, if there's nothing in the portal. (This is not an uncommon occurrence.)\n\nFederal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. \n\nLarger loans require a parent signature (go against parent credit, acrrue interest during college, i.e. are parent loans) and are usually not reasonable amounts to borrow.",
                      "author": "elkrange",
                      "created": 1636322334,
                      "upvotes": 2,
                      "replies": {
                        "hjryc3f": {
                          "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjryc3f/",
                          "text": "All I know from what my parents and I have discussed is that I would need to take out and pay the maximum amount of student loans that I can, but they will pay for anything I would have otherwise needed to take out in personal loans. Are you saying that federal student loans are capped at 27k over four years or just subsidized loans?",
                          "author": "7StepsAheadVFX",
                          "created": 1636353276,
                          "upvotes": 1,
                          "replies": {
                            "hjsxhiw": {
                              "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjsxhiw/",
                              "text": ">Are you saying that federal student loans are capped at 27k over four years or just subsidized loans?\n\nMy understanding is that federal student loans are capped at 27k over four years; that is subsidized and unsubsidized *combined*. For freshmen, $5500 (it goes up for jrs/srs).\n\nYou cannot take out a personal loan without a cosigner, that is, they would be parent loans. Parent loans go against parent credit and payments begin during college.",
                              "author": "elkrange",
                              "created": 1636379645,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjpbuvc": {
      "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjpbuvc/",
      "text": "Yes, being not able to afford your ES college is a legitimate reason to get out from ED agreement, so you should be able to attend your EA schools. Be sure to check decision dates of EA schools though, because many of them can have decision dates after the deadline to decline/accept ED.",
      "author": "elyrtw",
      "created": 1636309362,
      "upvotes": 2,
      "replies": {}
    },
    "hjqk6h4": {
      "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjqk6h4/",
      "text": "Yes, that’s what it means.\n\nBut “it doesn’t work” doesn’t mean “I don’t want to pay that”. You are expected to have run the schools’s NPC to get an estiamate of what you will be expected to pay. It the aid results in a price near that, you can’t just decide you no longer want to pay it.",
      "author": "RichInPitt",
      "created": 1636327194,
      "upvotes": 2,
      "replies": {
        "hjry1zm": {
          "link": "/r/ApplyingToCollege/comments/qosguc/question_about_financial_aid_with_ed_application/hjry1zm/",
          "text": "This is probably what I need to hear. One of my concerns is that there is an elective surgery I may need to get and I’m still making that choice. If I have to pay my ED’s tuition and it’s not good enough aid, I may not be able to have the surgery. So if this is true, I might want to withdraw my ED.",
          "author": "7StepsAheadVFX",
          "created": 1636353066,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}