{
  "sid": "qebeyf",
  "link": "/r/ApplyingToCollege/comments/qebeyf/need_help_with_superscoring/",
  "title:": "need help with superscoring",
  "text": "I have 1420 - 650 770; 1380 - 600 780. Will admission officers see my bad section scores such as previously mentioned 600 and 770. If no, how can I superscore?",
  "author": "quirky__catt",
  "created": 1635016477,
  "updated": 1635183388,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhrvqqn": {
      "link": "/r/ApplyingToCollege/comments/qebeyf/need_help_with_superscoring/hhrvqqn/",
      "text": "If a school superscores, they will evaluate you based on a 650/780=1430.\n\nYou can superscore on the Common App, as they only request your highest sections.\n\nFor schools requiring official reports, you send both scores and they will superscore.",
      "author": "RichInPitt",
      "created": 1635017566,
      "upvotes": 2,
      "replies": {}
    },
    "hhrttza": {
      "link": "/r/ApplyingToCollege/comments/qebeyf/need_help_with_superscoring/hhrttza/",
      "text": "Schools that superscore only download the highest English and Math section scores into your application; no one there will see the other two scores.\n\nThis was confirmed on a recent post on this sub by the UVA Dean of Admissions.\n\nPS - If you’re self-reporting scores through common app, those are the only two scores you’ll enter.",
      "author": "Strict-Special3607",
      "created": 1635016716,
      "upvotes": 1,
      "replies": {}
    },
    "hhrtz3u": {
      "link": "/r/ApplyingToCollege/comments/qebeyf/need_help_with_superscoring/hhrtz3u/",
      "text": "It all depends if the school allow superscore SAT. Not all school allow superscore. And if they do, it depends on how they ask you to report your score. If it is directly through college board, you have to send in both scores but they will take the highest one. If you self report, you may be anle to only report the highest score of each section. Again, it all depends on the school. Check their admission site.",
      "author": "poohland",
      "created": 1635016780,
      "upvotes": 1,
      "replies": {}
    }
  }
}