{
  "sid": "egq6he",
  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/",
  "title:": "After a stressful season of applications, I've withdrawn all of them and I'm not going to college",
  "text": "Its kinda click baity but its true. I withdrew my applications to every college I submitted an application to. I decided to enlist in the Air Force instead. I swore into the Delayed Entry Program just before Christmas and I've never been happier.\n\nWhy did I decide to forego college? Its not because I couldn't go anywhere or because the military was a last resort option. I have good stats (33 ACT, 3.87 GPA, strong ECs, and several prestigious awards). It wasn't because I couldn't afford college (between savings, scholarships, financial aid, and half of a GI Bill, I could've paid for college with minimal debt.\n\nI enlisted because I really wanted to. I haven't booked a specific job yet, but hopefully I'll end up in an Aircrew or Intelligence job. I am going to complete my Bachelor's on Uncle Sam's dime (thank you to all of you who pay taxes, its appreciated) and then get a Master's degree paid for by my GI Bill once I get out of the military. I can do all of that in about the same amount of time that it would take to finish six years of university (BA and MA) level education.\n\nI'll be 19 years old making a decent salary with no debt and very few living expenses, complete health care, amazing opportunities, guaranteed college tuition support, and probably a Top Secret clearance. \n\nSo I urge you, if someone you know decides to forego college entirely and forge their own path, military or otherwise, support them. Don't tell them they're throwing their future away. Don't say \"But you have so much potential.\" I'm excited about my future and the opportunity to get a Bachelor's, a Master's, and a career opportunity debt-free. I'm not throwing my future away, I'm taking a while to do what I love and reap the maximum possible benefits from it and hopefully come out ahead.\n\nBest of luck to all of you as you select your colleges and finish your apps. I love you guys and I want the world for you.\n\nBye for now ✌️\n\n&#x200B;\n\nEDIT: So a lot of people seem to think that I'm drinking the Kool-Aid. I'm not. I was born on an Air Force base and I've spent the last 18 years moving 13 times, seeing my dad go on numerous deployments and too many TDYs to count. I know it takes a toll on families (my parents are now divorced) and I know its not an idyllic patriotic heaven of all benefit and no pain. It sucks sometimes. That's okay. I know what I'm getting myself into. I'm also not getting screwed over by my recruiter. My dad used to do recruiting and has helped me cut through the BS and really get what I want. I'm gonna be okay.",
  "author": null,
  "created": 1577535751,
  "updated": 1634077768,
  "over_18": false,
  "upvotes": 1667,
  "upvote_ratio": 0.95,
  "comments": {
    "fc9ckk4": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9ckk4/",
      "text": "As someone who's been in the Navy and probably enlisted for the wrong reasons, I'm glad you're choosing to enlist because you want to and not for any of the benefits. Good luck to you.\n\nEdit: you're\\*\n\nEdit 2: For the love of god, Invest like 5% of your paycheck in TSP from day 1, including in boot camp, don't do the Montgomery GI bill over Post 9/11, call TSP after boot camp and switch your funds out of the G-Fund to more risky stuff and literally save as much as your money as possible. Rant over, lol. ALSO, if you decide to a stem degree, you can apply to extend for another 9 months of the Post 9/11 due to the Forever Gi-bill act. Super worth it imo, though I'm not entirely sure how that works since I haven't done it yet so maybe take that with a grain of salt. Okay now rant really over.",
      "author": "Spusk",
      "created": 1577550558,
      "upvotes": 277,
      "replies": {
        "fc9xu2b": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9xu2b/",
          "text": "What's Navy like?",
          "author": "isidorvs",
          "created": 1577559817,
          "upvotes": 16,
          "replies": {
            "fc9y8h1": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9y8h1/",
              "text": "Depends, have you ever watched a grown man shove an entire Klondike bar in his mouth or tackle a dude while he was in the shower? Cause that was my experience, lol.",
              "author": "Spusk",
              "created": 1577559989,
              "upvotes": 62,
              "replies": {
                "fc9yfjy": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9yfjy/",
                  "text": "> tackle a dude while he was in the shower? \n\nOWO",
                  "author": "isidorvs",
                  "created": 1577560076,
                  "upvotes": 37,
                  "replies": {}
                }
              }
            },
            "fca4tek": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca4tek/",
              "text": "my friend's in the navy and he hates it mostly  because he's lower ranked (he joined in may) so the higher ranked treat him like crap, and he dislikes how everything is strict",
              "author": "0oops0",
              "created": 1577563065,
              "upvotes": 16,
              "replies": {
                "fcackpy": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcackpy/",
                  "text": "I would imagine it's strict? It's the military not a summer camp",
                  "author": "jointjuice26",
                  "created": 1577566794,
                  "upvotes": 23,
                  "replies": {
                    "fcacvcw": {
                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcacvcw/",
                      "text": "yea but sometimes the strictness is a bit exaggerated. like they have to clean their rooms and every corner needs to be shiny, and the person checking is actually looking for a spec of dust, and if they find just a bit theyll make you do it again. he knew it was strict, but not like that",
                      "author": "0oops0",
                      "created": 1577566969,
                      "upvotes": 10,
                      "replies": {
                        "fcakm44": {
                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcakm44/",
                          "text": "Yeah I'm pretty sure I spent about 80% of my time cleaning",
                          "author": "Spusk",
                          "created": 1577571053,
                          "upvotes": 4,
                          "replies": {}
                        },
                        "fcakta2": {
                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcakta2/",
                          "text": "It teaches discipline. If someone can’t even be trusted to clean a room properly, how can they be trusted with the lives of others?",
                          "author": "Mysticccccc",
                          "created": 1577571172,
                          "upvotes": 9,
                          "replies": {
                            "fcb1jxb": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb1jxb/",
                              "text": "Good point, this is why surgery residents spend all their time cleaning the floors of the hospital. \nI mean, it's an interesting argument, and people use it, but it doesn't really make much sense when you think about it.\nSorry, not trying to be a dick.",
                              "author": "imc225",
                              "created": 1577580910,
                              "upvotes": 9,
                              "replies": {
                                "fcb4dhr": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb4dhr/",
                                  "text": "Surgery residents definitely don’t spend all their time cleaning",
                                  "author": "Mysticccccc",
                                  "created": 1577582195,
                                  "upvotes": -1,
                                  "replies": {
                                    "fcb7n2p": {
                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb7n2p/",
                                      "text": "Yeah, sort of the point, eh?",
                                      "author": "imc225",
                                      "created": 1577583418,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "fcanwet": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcanwet/",
                              "text": "Facts",
                              "author": "NotNickSuriano",
                              "created": 1577573004,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "fcccngp": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcccngp/",
                              "text": "This may be the reason given but I can also promise there are lots of time's where we clean because fuck you go clean. It doesn't really matter though. It's just a part of the game and everyone has to put up with it equally.",
                              "author": "Spusk",
                              "created": 1577596879,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fcd4plm": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcd4plm/",
          "text": "[deleted]",
          "author": null,
          "created": 1577606327,
          "upvotes": 3,
          "replies": {
            "fcfkati": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfkati/",
              "text": "It's fine he'll understand it once he's in hopefully. Just a few things I wish I learned faster lol.",
              "author": "Spusk",
              "created": 1577630811,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fqb4dz4": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fqb4dz4/",
          "text": "why not enlist for the benefits? and what's wrong with the montgomery GI bill? just curious",
          "author": "jvidal7247",
          "created": 1589230380,
          "upvotes": 1,
          "replies": {
            "fqb6qb2": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fqb6qb2/",
              "text": "You can do that, that's why I did. It just might suck a lot cause it's a really tedious and sometimes difficult depending on the job. The mgi bill is kinda outdated and gives you more of a flat rate of money, which I have no idea what that rate is. It really depends more on what kinda of schooling or program you use it on. The reason I bring it up is cause they kind of goad you into signing the mgi papers in bootcamp and then that means they take 50 bucks out of your paycheck for the first year in when you can just opt in later when you want, and you aren't out 1200 dollars unless you want to be.",
              "author": "Spusk",
              "created": 1589231549,
              "upvotes": 1,
              "replies": {
                "fqb7eu1": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fqb7eu1/",
                  "text": "I've only just now started to really plan for my future (a bit late i know) and don't have the best stats to earn scholarships and I'm not too interested in drowning in debt later in life, hence my interest. If i did join I was thinking of opting for the coast guard, anything I should know?",
                  "author": "jvidal7247",
                  "created": 1589231889,
                  "upvotes": 1,
                  "replies": {
                    "fqb8ylq": {
                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fqb8ylq/",
                      "text": "I think the coast guard is the right choice. I was navy and would have done coast guard looking back. My only advice is advice I'd give anyone else. Just take everything with a grain of salt, don't sign anything without understanding it and save your money, don't blow a bunch of money on food or a car just cause you have the money now. I really don't have any super great advice right now, I'm sorry lol.",
                      "author": "Spusk",
                      "created": 1589232664,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fccbci7": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fccbci7/",
          "text": "Thank you! I've grown up around the Air Force and I'm really excited. I'm enlisting because I really want to. I know a lot of people think I'm drinking the kool-aid, but I'm genuinely excited and I'm well aware that it won't be easy. I want to serve my country, I want the experience, and I'm ready for it. I know there'll be days when I regret it all, and there'll be days when I think about making it a career. In the end, I'm going to see where it takes me and get as much out of it as I can.",
          "author": null,
          "created": 1577596465,
          "upvotes": 1,
          "replies": {
            "fccc8rd": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fccc8rd/",
              "text": "Yeah it doesn't really matter what anyone else thinks about anything. Your\\* opinions will probably change after being in for a while and that's fine, and they may not, and either way it's your life so just keep at it.",
              "author": "Spusk",
              "created": 1577596752,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fc9438r": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9438r/",
      "text": "Why not military academies?",
      "author": "LRFE",
      "created": 1577546710,
      "upvotes": 60,
      "replies": {
        "fc9hsf6": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9hsf6/",
          "text": "Academies aren’t all they’re chalked up to be, plus he’s already an Airman no going back.",
          "author": "goflyint0",
          "created": 1577552870,
          "upvotes": 44,
          "replies": {
            "fc9i6ba": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9i6ba/",
              "text": "I was just curious, not trying to change his mind. \n\nAlso, what’s wrong with academies? Full ride at a great school, plus a greta job right out of college.",
              "author": "LRFE",
              "created": 1577553033,
              "upvotes": 33,
              "replies": {
                "fc9j9oe": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9j9oe/",
                  "text": "High suicide rates. Once your in the academy, no leaving unless you’re expelled, with some stipulation. Sexual assault is through the roof. And lots more",
                  "author": "goflyint0",
                  "created": 1577553482,
                  "upvotes": 30,
                  "replies": {
                    "fc9jtnd": {
                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9jtnd/",
                      "text": "Hmm... I thought you could leave before sophomore year, or leave and just pay the tuition back. \n\nAs for the other stuff, thanks for shedding some light on that! Didn’t expect those.",
                      "author": "LRFE",
                      "created": 1577553721,
                      "upvotes": 15,
                      "replies": {
                        "fc9mquj": {
                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9mquj/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1577555009,
                          "upvotes": 30,
                          "replies": {
                            "fc9o2a9": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9o2a9/",
                              "text": "Sexual [assault](https://www.npr.org/2019/02/14/694597943/despite-prevention-programs-sexual-assaults-rise-at-military-academies) is actually rising a lot. As for the drop and all there is some stipulations to it. So I’d disagree that I’m giving a bad outlook of them :)",
                              "author": "goflyint0",
                              "created": 1577555587,
                              "upvotes": 3,
                              "replies": {
                                "fc9of4e": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9of4e/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1577555744,
                                  "upvotes": 5,
                                  "replies": {
                                    "fcfyv20": {
                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfyv20/",
                                      "text": "There is a process to get the forms you must go through",
                                      "author": "goflyint0",
                                      "created": 1577634980,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "fcaa4hq": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcaa4hq/",
                                  "text": "As someone attending, this dude is stupid. The academies are great and this guy just hates the military.",
                                  "author": null,
                                  "created": 1577565460,
                                  "upvotes": 6,
                                  "replies": {
                                    "fcfy3i9": {
                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfy3i9/",
                                      "text": "[removed]",
                                      "author": null,
                                      "created": 1577634754,
                                      "upvotes": -1,
                                      "replies": {
                                        "fcheupf": {
                                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcheupf/",
                                          "text": "LMAO AND THERE IT IS\n\nenjoy your debt",
                                          "author": null,
                                          "created": 1577649840,
                                          "upvotes": 2,
                                          "replies": {
                                            "fci31rv": {
                                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fci31rv/",
                                              "text": "I won’t be in debt, i live in Georgia where public university is free",
                                              "author": "goflyint0",
                                              "created": 1577657158,
                                              "upvotes": 0,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fc9odw2": {
                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9odw2/",
                      "text": "Can't you transfer out?",
                      "author": "whitelife123",
                      "created": 1577555729,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fc9tnab": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9tnab/",
          "text": "They're tough to get into. Ivy League Tough.",
          "author": "Luftwagen",
          "created": 1577558055,
          "upvotes": 6,
          "replies": {
            "fc9w1q8": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9w1q8/",
              "text": "Not quite. As long as you’re in shape and have decent academics, you’re good. I could probably get into them but would have no shot at HYP.",
              "author": "LRFE",
              "created": 1577559037,
              "upvotes": 14,
              "replies": {
                "fca6vi1": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca6vi1/",
                  "text": "You sure? One of my past friends tried getting in, did all the paperwork and made it 90% of the way only to not get accepted. Another one of my friends has spent the better half of the past two years working through the requirements and was just accepted to the AF academy. Getting into an Ivy is tough, but at least you don't have to get one of the few nominations from a senator, and then hope that the academy will still accept you after that.",
                  "author": "mjc4wilton",
                  "created": 1577563936,
                  "upvotes": 6,
                  "replies": {}
                },
                "fccdbzs": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fccdbzs/",
                  "text": "I had a friend get rejected by West Point but ended up going to Harvard lmao. It's true that they look for different things than Ivy League though. Ivys care about that sweet sweet GPA but the academies seem to look for experience, leadership, etc.",
                  "author": "Luftwagen",
                  "created": 1577597098,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "fca92mo": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca92mo/",
              "text": "Many are recruited athletes",
              "author": "Fawna1618",
              "created": 1577564958,
              "upvotes": -2,
              "replies": {}
            }
          }
        },
        "fcca5fd": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcca5fd/",
          "text": "I strongly considered them, but in talking to some academy guys I know and graduates, I decided the experience I would get there was not what I'm looking for. Plus, most of the academies place a heavy emphasis on engineering and I'm more of a liberal arts guy.",
          "author": null,
          "created": 1577596076,
          "upvotes": 3,
          "replies": {}
        },
        "fcb1dt9": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb1dt9/",
          "text": "The military academies are all ridiculously difficult to get into. Not only do you need high stats, you also need to pass the physical tests.",
          "author": "Diiigma",
          "created": 1577580804,
          "upvotes": 1,
          "replies": {
            "fcb2wh9": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb2wh9/",
              "text": "tell that to the naviance charts lmao\n\nit's not like the physical tests are that hard, if you're in good shape and train specifically for them you can probably get close to the maximum for each event.\n\nWith no specific training, here's what I'd probably get \n\nBball: no clue lol never done this\n\nPullups: 15 probably\n\nShuttle run: no clue what this is\n\nCrunches: 95 (max out)\n\nPushups: at least 60, probably get close to 75 (max)\n\nMile: 7ish.",
              "author": "LRFE",
              "created": 1577581601,
              "upvotes": -4,
              "replies": {
                "fcb3zdb": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb3zdb/",
                  "text": "Congrats? I made it sound like high stats + physical tests = acceptance letter, but there's a whole process to it that's not just those two things in mind. Plenty of kids get rejected, and they probably also had good things going for them too.",
                  "author": "Diiigma",
                  "created": 1577582048,
                  "upvotes": 1,
                  "replies": {
                    "fcb44zk": {
                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb44zk/",
                      "text": "All I'm saying is that you don't need god-tier stats or god-tier athletics. Usually being decent at both is good enough to get you in.",
                      "author": "LRFE",
                      "created": 1577582105,
                      "upvotes": 1,
                      "replies": {
                        "fciqn1s": {
                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fciqn1s/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1577667501,
                          "upvotes": 1,
                          "replies": {
                            "fcir6qo": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcir6qo/",
                              "text": "I mean like you need a 3.6-3.8 UW and probably a 1450+ SAT or 33+, with great ECs I imagine but that's not quite as strict as Harvard where those stats would be considered pretty low",
                              "author": "LRFE",
                              "created": 1577667872,
                              "upvotes": 1,
                              "replies": {
                                "fcirr6g": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcirr6g/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1577668267,
                                  "upvotes": 1,
                                  "replies": {
                                    "fciru28": {
                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fciru28/",
                                      "text": "fair that they're looking for different things, but I'd say that leadership is great for both regardless",
                                      "author": "LRFE",
                                      "created": 1577668321,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fc8lira": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc8lira/",
      "text": "Good post. Well phrased. Thank you for your service!",
      "author": "icebergchick",
      "created": 1577537406,
      "upvotes": 304,
      "replies": {
        "fc8pibs": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc8pibs/",
          "text": "Thank you, but I haven't done anything yet besides sign some paperwork!",
          "author": null,
          "created": 1577539618,
          "upvotes": 146,
          "replies": {
            "fc8pmpu": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc8pmpu/",
              "text": "You committed and that’s to be commended",
              "author": "icebergchick",
              "created": 1577539680,
              "upvotes": 145,
              "replies": {}
            },
            "fc9op78": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9op78/",
              "text": "Many ways to get to your goal: a degree. Congrats on getting educated AND serving your country!",
              "author": "throwawaylol12344321",
              "created": 1577555868,
              "upvotes": 16,
              "replies": {}
            },
            "fcb46rt": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb46rt/",
              "text": "Well, good luck. And thank you for choosing to serve our country",
              "author": "Nomekop777",
              "created": 1577582125,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "fc90z85": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc90z85/",
      "text": "Have you thought about ROTC or the academy?",
      "author": null,
      "created": 1577545271,
      "upvotes": 36,
      "replies": {
        "fcc9vax": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc9vax/",
          "text": "I did, but I decided that I wanted to go and actually **do** something, rather than go to college. It was a personal choice. I might pursue commissioning later in life. But for now, the goal is to spend 4 years in the Air Force and  finish up and college degree and then a masters.",
          "author": null,
          "created": 1577595989,
          "upvotes": 2,
          "replies": {
            "fcccc9e": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcccc9e/",
              "text": "Awesome man, best of luck!",
              "author": null,
              "created": 1577596783,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fc94ch9": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc94ch9/",
      "text": "I decided to only apply to the T10 schools (HYPSM) and if i doesn't work out, I'm going to drop my NROTC scholarship and got straight to the Navy. I have been in contact with my recruiter to get all the nuances in order to get my SEAL challenge contract and be at Bud/s by next year.",
      "author": null,
      "created": 1577546828,
      "upvotes": 63,
      "replies": {}
    },
    "fc9p8bk": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9p8bk/",
      "text": ">a decent salary\n\nNo. If you're as good as you think you are you can make much more outside. \n\n>very few living expenses\n\nJust wait. \n\n>complete health care\n\nHealth care that is awful and you are not allowed to use. Your unit will specifically ban you from using that health care. The shit you do have access to can hardly be called health care.\n\n>amazing opportunities\n\nYes you do, once you get out of the military. \n\n>guaranteed college tuition support\n\nThis is literally the only thing that makes military service worthwhile. Without the gi bill there would be an extreme manpower shortage lmao. \n\nTuition assistance while inside though is complete garbage. If you have a job that isn't a complete skate fest you'll be ever be able to use it, ever. That and they keep threating to cut tuition every so often and they can kill it anytime they want. Just a matter of time before they do.\n\nHonestly it sounds like you swallowed all of the bait that a military recruiter has told you. Literally nothing a military recruiter says to you should be believed, ever. You're about to get a hard reality check. Military is garbage, that's why there's only a 5% reenlistment rate for first time contracts.\n\n Fuck the marine corps.\n\nEdit: also top secret clearances aren't that big a deal, everyone gets one. The only way you can't get one is if you are a fuck up or loser.",
      "author": null,
      "created": 1577556088,
      "upvotes": 118,
      "replies": {
        "fc9t6a5": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9t6a5/",
          "text": "Damn is this true lol",
          "author": "FactoryResetButton",
          "created": 1577557844,
          "upvotes": 26,
          "replies": {
            "fca9q8c": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca9q8c/",
              "text": "Yes. Literally any veteran that isn't trying to sell you something well tell you the same.",
              "author": null,
              "created": 1577565265,
              "upvotes": 20,
              "replies": {
                "fcg1rkh": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcg1rkh/",
                  "text": "Yeah this is 100% true hahaha.",
                  "author": "Spusk",
                  "created": 1577635713,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fc9uc7c": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9uc7c/",
          "text": "The only sane person in the comments. Too bad OP withdrew his college applications. The lesson here should be to never listen to a recruiter.",
          "author": "whymauri",
          "created": 1577558339,
          "upvotes": 70,
          "replies": {
            "fc9xzid": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9xzid/",
              "text": "IMO, the real lesson is to not enlist if you plan on attending college and can get in and afford it straight out of HS. If you really want to join the military, go in as an officer (i.e. via ROTC or the service academies). You'll be treated at least a little better from what I've seen, having worked with military folks before.\n\nWith that said, I'm sure OP can make things work. I wish them luck.",
              "author": "Glittering_Airline",
              "created": 1577559882,
              "upvotes": 32,
              "replies": {}
            }
          }
        },
        "fca9sx9": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca9sx9/",
          "text": "thank god someone said it. i feel so bad for OP, falling into some imperialist bullshit scam",
          "author": "ykaledu",
          "created": 1577565300,
          "upvotes": 18,
          "replies": {}
        },
        "fcc63ew": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc63ew/",
          "text": "I didn't swallow the recruiter's bait. I was born on an Air Force base and I've moved 13 times with the Air Force. I've seen it all first hand and I know that its not all sunshine and roses. My dad used to be a recruiting squadron commander so I didn't get the wool pulled over my eyes. He and I cut through the BS and I know exactly what I'm getting into. I'm not getting a hard reality check, I'm getting exactly what I signed on the dotted line for. I really do appreciate your concern, but I know what I'm getting into.",
          "author": null,
          "created": 1577594834,
          "upvotes": 5,
          "replies": {
            "fcejw8e": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcejw8e/",
              "text": "Then you should know that you're basically putting your life on hold for four years for money",
              "author": null,
              "created": 1577621193,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fc9ulk7": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9ulk7/",
      "text": "I don't understand how you're finishing everything in the same amount of time. The time you will spend working in the military is time you could have spent in college.",
      "author": "tacopower69",
      "created": 1577558450,
      "upvotes": 22,
      "replies": {
        "fcc772u": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc772u/",
          "text": "My initial training through Tech School and the Community College of the Air Force will result in 60 credit hours. I plan on studying Political Science at Troy, a school which Air Force tuition assistance will pay for entirely. The Air University - Assosciates to Bachelors is a contractual agreement between CCAF and various undergraduate institutions to enable service-connected individuals greater flexibility and access when transferring credits. \n\nI know if I work hard, I can reasonably finish most, if not all of a bachelors on Uncle Sam's dime. Its not the path for everyone, but this is the path I chose.",
          "author": null,
          "created": 1577595168,
          "upvotes": 3,
          "replies": {
            "fccdmw9": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fccdmw9/",
              "text": "ah i see. I'm not really familiar with how the military works so I didn't know the training they gave you can be used as college credit.",
              "author": "tacopower69",
              "created": 1577597198,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fc9xlp4": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9xlp4/",
          "text": "Yes and the time he spends in the military will be time gaining technical experience that every employer is looking for. Then the GI bill will cover any college he picks so he will be better off then most college graduates.",
          "author": null,
          "created": 1577559713,
          "upvotes": -9,
          "replies": {
            "fca0m3o": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca0m3o/",
              "text": "The thing is the GI bill doesn’t cover private colleges. Only public in state schools pretty much, which kinda sucks because he’s qualified for prestigious colleges",
              "author": null,
              "created": 1577561031,
              "upvotes": 21,
              "replies": {
                "fcb39n9": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb39n9/",
                  "text": "It covers up to $25,000 at private colleges. https://www.military.com/education/gi-bill/gi-bill-covers-public-college-tuition.html",
                  "author": "Diiigma",
                  "created": 1577581752,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "fca5qrp": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca5qrp/",
              "text": "That doesn't answer the question of how he is supposedly finishing an undergrad and masters program *and* finish serving all within 6 years. There is an opportunity cost to finishing school later as opposed to sooner.\n\n\"technical experience that every employer is looking for\" is also really vague. If he wants to become a software developer, for example, then acumen is more important than arbitrary technical experience. That's why the interview process is so rigorous: they just want clever coders.\n\n>Then the GI bill will cover any college he picks\n\nNot every college. All public schools and some private schools. Usually more prestigious private schools don't offer much aid to veterans.\n\n> he will be better off then most college graduates.\n\nProbably, the question is whether he'd be better off than if he just decided to go to school immediately after highschool. If he wants to take a break from school and also wants to serve in the military then yes, he is. If he's only going into the military for the financial benefits then maybe not.",
              "author": "tacopower69",
              "created": 1577563456,
              "upvotes": 11,
              "replies": {
                "fcafsch": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcafsch/",
                  "text": "All good and fair points.",
                  "author": null,
                  "created": 1577568476,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fca80bq": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca80bq/",
      "text": "I joined the Navy right out of high school. I joined because I was a terrible student, had no self confidence, and had no direction in life. It was the best decision I’ve probably ever made. It got me on a *really* good path to a successful career/life outside the military that I would’ve never attained otherwise. \n\n But I would never have urged someone like you to join enlisted. Your head is screwed on a little tighter and you’ve been really successful in high school. You have more self discipline. I’d urge you to think about going to a service academy or joining ROTC at a college instead of joining enlisted. You’ll be much better suited and probably happier with the assortment of jobs and responsibilities of an officer.",
      "author": "sailor_and_coke",
      "created": 1577564448,
      "upvotes": 28,
      "replies": {}
    },
    "fcanl62": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcanl62/",
      "text": "[deleted]",
      "author": null,
      "created": 1577572819,
      "upvotes": 16,
      "replies": {
        "fcbgh3v": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcbgh3v/",
          "text": "Thank you for posting this!",
          "author": null,
          "created": 1577586566,
          "upvotes": 2,
          "replies": {}
        },
        "ffh0bun": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/ffh0bun/",
          "text": "That’s why you shouldn’t join the military JUST for the benefits. I don’t really have a problem if the benefits are the icing on the cake but if you want JUST the benefits and nothing else, then I think you shouldn’t be anywhere within 1,000 feet of a recruiting office.  \n\nPersonally, I’m joining the Marines and I could give a fuck all about the benefits. Don’t get me wrong, obviously they’re nice. But if you join the military, you join to serve your country and defend the Constitution of the United States or because of family tradition or you need some direction in life or whatever.",
          "author": "GodofWar1234",
          "created": 1579919701,
          "upvotes": 1,
          "replies": {
            "ffh0hlp": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/ffh0hlp/",
              "text": "That’s not the reason he joined or the reason he’s stayed for almost 20 years \n\nThe benefits won’t affect you that much. They are really only beneficial when you have kids. Which I’m assuming you don’t have (hopefully)\n\nThe military is just a job like any other. Plenty of people join, serve for a couple years, and then leave\n\nThe self righteous stuff is (no offense) things that recruiters sell you to get you to join. In reality you’ll be working a boring job like everyone else, just in a marine uniform.\n\nMy dad is an infantryman, aka the guys they call when shit needs to get shot, and even he spends most of his time at an armory (doing paperwork) or bossing people around at training. It’s not action and adventure and glory like you might think",
              "author": "kaystrrrr",
              "created": 1579919822,
              "upvotes": 1,
              "replies": {
                "ffh0rs7": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/ffh0rs7/",
                  "text": "But it really isn’t like any other job. Obviously depending on your MOS/rating/AFSC it could be any old regular 9-5 job but I doubt that the military as a culture and environment is “just another job”. Pretty sure there’s a difference between driving an M1 Abrams and clocking in at an office job.",
                  "author": "GodofWar1234",
                  "created": 1579920036,
                  "upvotes": 1,
                  "replies": {
                    "ffh0w4b": {
                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/ffh0w4b/",
                      "text": "like I said, it’s not all military stuff all the time \n\nYou won’t be in combat most of the time. You’re not going to be doing the “cool” stuff that you think \n\nHell, even when you get DEPLOYED you’re most likely gonna be bored.\n\nThe military does a lot of training for example. My dad just had to train at the national training center where they run this full scale simulator. That was pretty fun \n\nUnless the United States declares war on someone, you will find that the work you’re doing won’t be similar to the things you read on their website \n\nBut like I said, you have to do the boring stuff most of the time.",
                      "author": "kaystrrrr",
                      "created": 1579920131,
                      "upvotes": 1,
                      "replies": {
                        "ffh1625": {
                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/ffh1625/",
                          "text": "Obviously there’s the whole standby to standby and drawing weapons at 3 just to hurry up and wait for 5 hours for the CO to show up and of course there’s a lot of downtime. But the military isn’t just “any other job”.",
                          "author": "GodofWar1234",
                          "created": 1579920342,
                          "upvotes": 1,
                          "replies": {
                            "ffh1fmm": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/ffh1fmm/",
                              "text": "Hey, I’m just telling you my experience being an army brat my whole life \n\nI’m not saying I’m right, I’m just saying both my parents (and I) literally live and breathe “the military life” \n\nI live right by Fort Bragg \n\nYour experience might be different. I’m just telling you what happens in my experience. \n\nOnce you get out of the lower ranks, you’ll find that the grunt work is no longer your responsibility. Then you’ll have to deal with the paperwork of a whole battalion of soldiers, leading the range and keeping inventory count, and giving out orders instead of receiving them \n\nThe culture is obviously different. But at the end of the day you’re doing work for the government for pay. That’s a job \n\nI certainly hope you enjoy your time with the military",
                              "author": "kaystrrrr",
                              "created": 1579920542,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fcacwn8": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcacwn8/",
      "text": "I hope you made the right decision for you. Really hoping this works out for you and you’ll be in my thoughts and prayers",
      "author": "RDR4065",
      "created": 1577566991,
      "upvotes": 8,
      "replies": {}
    },
    "fc9gtic": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9gtic/",
      "text": "No guarantee your job will require a TS",
      "author": "niksin_",
      "created": 1577552467,
      "upvotes": 11,
      "replies": {
        "fcc7cs9": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc7cs9/",
          "text": "[deleted]",
          "author": null,
          "created": 1577595216,
          "upvotes": 3,
          "replies": {
            "fcdloj6": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcdloj6/",
              "text": "[deleted]",
              "author": null,
              "created": 1577611179,
              "upvotes": 1,
              "replies": {
                "fcdrm6a": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcdrm6a/",
                  "text": "Dude you've done nothing with your Reddit account except comment negative things on my post. I know you don't like my decision, but let it be.",
                  "author": null,
                  "created": 1577612914,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fc9ckki": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9ckki/",
      "text": "Aren't you at least regretful of the applications you wrote and then withdrew?\n\nEdit: I see I'm getting downvoted, so I want to clarify that I am in no way criticizing OP's decision, merely empathizing with what must already have gone through his head.",
      "author": "MohammadRezaPahlavi",
      "created": 1577550559,
      "upvotes": 21,
      "replies": {
        "fcc7odw": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc7odw/",
          "text": "My biggest regret isn't my essays, but the time my teachers put into letters of recommendation for me. I met with all of them individually to thank them for the effort they put into my letters and explained my decision. They were all very supportive once I explained my path. Going to High School on a military base makes people more supportive.",
          "author": null,
          "created": 1577595317,
          "upvotes": 4,
          "replies": {}
        },
        "fc9f1v2": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9f1v2/",
          "text": "He’s going to apply after his service is over. He can probably reuse a few things. But it seems like he’s given a good amount of thought to this and this is what he *wants* to do",
          "author": "uglypenguin5",
          "created": 1577551715,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "fca038r": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca038r/",
      "text": "I’m kind of ignorant: how do you withdraw applications?",
      "author": "David_900",
      "created": 1577560796,
      "upvotes": 3,
      "replies": {
        "fcat0lq": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcat0lq/",
          "text": "You can withdraw an app from within the individual school's applicant system.   You may also be able to do it from the Common App, but I'm not positive about that.",
          "author": "radioactivefroggy",
          "created": 1577576027,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fcav2dy": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcav2dy/",
      "text": "Everyone has a goal in life and everyone has their own unique path to get to their goal. College is not the only way to reach your goals, but make sure you know exactly what you want to accomplish in life. Having a clear goal is crucial to your commitment in spending your valuable time and energy.",
      "author": "rali32",
      "created": 1577577184,
      "upvotes": 2,
      "replies": {}
    },
    "fc9x59u": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9x59u/",
      "text": "[deleted]",
      "author": null,
      "created": 1577559510,
      "upvotes": 10,
      "replies": {
        "fc9xeqg": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9xeqg/",
          "text": "If anything he is better off pursuing a path such as the military and come back to college later. The Air Force is one of the best branches as well for technical skills and he will be better off because of that.",
          "author": null,
          "created": 1577559630,
          "upvotes": -1,
          "replies": {
            "fc9xvod": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9xvod/",
              "text": "[deleted]",
              "author": null,
              "created": 1577559836,
              "upvotes": 2,
              "replies": {
                "fc9ygtc": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9ygtc/",
                  "text": "Exactly. No offense to OP but fuck the military",
                  "author": "luminous_moonlight",
                  "created": 1577560091,
                  "upvotes": 5,
                  "replies": {
                    "fcag2vo": {
                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcag2vo/",
                      "text": "Sometimes you should just keep some things in your head instead of blurting it out and making yourself look dumb",
                      "author": null,
                      "created": 1577568618,
                      "upvotes": -6,
                      "replies": {
                        "fcavoqz": {
                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcavoqz/",
                          "text": "There’s nothing dumb about having a perfectly valid opinion. Our military has done lots of fucked up shit, is bloated and takes so much money to do so little that I get where the person above is coming from. Obviously I appreciate the defense but I hate the war crimes our military has perpetrated and I’ve seen first hand the way that military culture can destroy a person. I’m with the person above. Fuck the military. It could be so much better but we defend it and erase its flaws.",
                          "author": "Lark121",
                          "created": 1577577531,
                          "upvotes": 4,
                          "replies": {
                            "fcc7zqf": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc7zqf/",
                              "text": "I signed up for a lot of personal reasons, but also because I'm a patriot at heart. I absolutely respect your opinion and I raised my right hand promising to defend the Constitution which guarantees you the right to have an opinion I disagree with.",
                              "author": null,
                              "created": 1577595419,
                              "upvotes": 1,
                              "replies": {
                                "fcgn82m": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcgn82m/",
                                  "text": "I just hope you know what you’re getting into. A friend of mine took a similar path to you, and she’s been suffering for it ever since. Military bro culture is deeply fucked and whether or not you see combat, you will be affected by it. I applaud your decision to join, it takes a lot of courage, as long as you really know what you’re signing up for. It isn’t going to be what you expect.",
                                  "author": "Lark121",
                                  "created": 1577641926,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "fcbe5ei": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcbe5ei/",
                              "text": "You talk about it like it happens every day. I respect your opinion though, just think it’s dumb.",
                              "author": null,
                              "created": 1577585756,
                              "upvotes": -1,
                              "replies": {
                                "fcdwfu6": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcdwfu6/",
                                  "text": "Not really dumb when helpless children are fucking dying over oil, hmm?",
                                  "author": "luminous_moonlight",
                                  "created": 1577614527,
                                  "upvotes": 1,
                                  "replies": {
                                    "fcfajd0": {
                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfajd0/",
                                      "text": "Ok I guess Isis doesn’t exist.",
                                      "author": null,
                                      "created": 1577628062,
                                      "upvotes": -1,
                                      "replies": {
                                        "fcfdc4x": {
                                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfdc4x/",
                                          "text": "ISIS excuses dead children? Have you seen the areas that the military has tried to \"help\"? Have you heard of Vietnam? Venezuela?",
                                          "author": "luminous_moonlight",
                                          "created": 1577628873,
                                          "upvotes": 2,
                                          "replies": {
                                            "fcfg3lz": {
                                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfg3lz/",
                                              "text": "Venezuela shot themselves in the foot and Vietnam was a mess up from politicians as well. You do know our medical ships just returned from Venezuela right?",
                                              "author": null,
                                              "created": 1577629640,
                                              "upvotes": 1,
                                              "replies": {
                                                "fcfjdcc": {
                                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfjdcc/",
                                                  "text": "Did anyone ask the US to show up? Like obviously there are times we need to step in. But given how rotten and shady the military is from the top down, should we be rushing into every single country at the first time of ~~communism~~ sorry, trouble?",
                                                  "author": "luminous_moonlight",
                                                  "created": 1577630587,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "fcflar9": {
                                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcflar9/",
                                                      "text": "Because we are the only ones who will step up. We are the ones sailing in the South China Sea to stop the Chinese from illegally making islands. We are one of the only ones to stop Iran from shutting down the Strait of Hormuz and illegally stopping trade. Also since when was Iran communist? And I am pretty sure the Soviet Union fell long ago.",
                                                      "author": null,
                                                      "created": 1577631251,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "fcfq4oh": {
                                                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfq4oh/",
                                                          "text": "Who mentioned Iran? Google \"map of the world\" so you can educate yourself on the existence of countries called Vietnam and Venezuela.",
                                                          "author": "luminous_moonlight",
                                                          "created": 1577632682,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "fcfbcxq": {
                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfbcxq/",
                                      "text": "Also, you do know that the United States is one of the largest producers of oil right? No need to be condescending man, just chill out.",
                                      "author": null,
                                      "created": 1577628350,
                                      "upvotes": -1,
                                      "replies": {
                                        "fcfee22": {
                                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfee22/",
                                          "text": "FYI, \"man\", that fact doesn't negate anything I've said. I stated my opinion of the military in a reply to someone else and *you* decided to call me dumb out of nowhere. Idk if they're paying you to lick boots but you really should give your poor tongue a rest.",
                                          "author": "luminous_moonlight",
                                          "created": 1577629108,
                                          "upvotes": 2,
                                          "replies": {
                                            "fcffvqs": {
                                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcffvqs/",
                                              "text": "It’s just annoying that you say the military kills children when you know that is not true. Then you go onto say we are only fighting for oil when we produce more oil then the countries we are in!",
                                              "author": null,
                                              "created": 1577629576,
                                              "upvotes": 0,
                                              "replies": {
                                                "fcfiv4n": {
                                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfiv4n/",
                                                  "text": "Was Vietnam justified? Was the War on Terror justified? Is it cool that the military produces a non-negligible percentage of the world's pollution? Do children just grow bullet holes or drop bombs on themselves? Do we only engage in trade for resources we don't produce ourselves? Can you answer any of these questions l?",
                                                  "author": "luminous_moonlight",
                                                  "created": 1577630471,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "fcfke3z": {
                                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfke3z/",
                                                      "text": "9/11 happened so the war on terror was justified. Children don’t do that and unfortunately there is collateral damage but we do not intentionally bomb children. We engage in trade of all resources but we are not sending Americans to die for oil. Did you know that if the straight of hormuz was shut down by the Iranians, Europe would run out of oil in three days? Also, one passage lane could shut down in China and millions of Americans would die of starvation because of our imported food. Who is it protecting these staits? Yes the US military, so when you say “fuck the military” it makes me think that you truly are an idiot.",
                                                      "author": null,
                                                      "created": 1577630844,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "fcfpm5f": {
                                                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfpm5f/",
                                                          "text": "So everywhere the military went had a direct link to the attacks, right? The wastes of space known as children 🤢🤮 are just necessary deaths in order for our glorious military to...continue to exist in the middle east nearly 20 years after the attacks. Great to know. Glad to hear that terrorists and food are why we must continue to intervene in countries like Venezuela and Cuba and Bolivia. We must continue to spend $700 billion on this organization and increase that number year after year (while ~10% of our nation's bridges are in immediate need of repair and families bankrupt themselves trying to get treatment for illnesses). Thanks for sharing. You can go back to polishing those boots.",
                                                          "author": "luminous_moonlight",
                                                          "created": 1577632538,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "fcdwwdz": {
                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcdwwdz/",
                          "text": "Just because you don't agree with my opinion doesn't make it dumb. The US military is an organization that had brought death and destruction to so many communities across the globe. I don't respect that organization at all.",
                          "author": "luminous_moonlight",
                          "created": 1577614681,
                          "upvotes": 1,
                          "replies": {
                            "fcfatqm": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfatqm/",
                              "text": "Look at all the good things our military has done as well. We are the first ones to deploy ships for humanitarian concerns across the world. Also, look at who we are fighting. Do you really want that spreading over the world?",
                              "author": null,
                              "created": 1577628163,
                              "upvotes": 0,
                              "replies": {
                                "fcfdlk8": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfdlk8/",
                                  "text": "Did I say they should dismantle the military? Serious overhaul and reforms are needed.",
                                  "author": "luminous_moonlight",
                                  "created": 1577628936,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ffh0ipc": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/ffh0ipc/",
                  "text": "Am I suppose to feel sorry for shitheads who’ve killed thousands of people in the name of a religion and prophet who they perverted and twisted to fit and somehow justify their batshit crazy ideals? \n\nSorry but no one should feel sorry for shooting ISIS or the Taliban. Bring the downvoted in.",
                  "author": "GodofWar1234",
                  "created": 1579919844,
                  "upvotes": 1,
                  "replies": {}
                },
                "fca12g7": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca12g7/",
                  "text": "Even if he is in combat, it’s for the good of our nation. Stop hating on the military when they put their asses on the line everyday for all of us.",
                  "author": "Arbiter604",
                  "created": 1577561294,
                  "upvotes": -3,
                  "replies": {
                    "fca7ne9": {
                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca7ne9/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1577564282,
                      "upvotes": 6,
                      "replies": {
                        "fcafltj": {
                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcafltj/",
                          "text": "He is going to be on a computer stopping hackers from gaining access to vital information and to stop hackers from destroying our way of life. You obviously don’t know what you are talking about and you have never served so you have never seen what that perspective is like. Don’t talk crap about others who would die for your right to be incompetent.",
                          "author": null,
                          "created": 1577568393,
                          "upvotes": -2,
                          "replies": {
                            "fcb2pl6": {
                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb2pl6/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1577581528,
                              "upvotes": 6,
                              "replies": {
                                "fcb8m6x": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb8m6x/",
                                  "text": "Copypasta material, honestly",
                                  "author": "cactus1549",
                                  "created": 1577583788,
                                  "upvotes": 1,
                                  "replies": {
                                    "fcbenl4": {
                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcbenl4/",
                                      "text": "Copypasta ok.",
                                      "author": null,
                                      "created": 1577585931,
                                      "upvotes": -1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "fcbeljy": {
                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcbeljy/",
                                  "text": "I’m sorry that I am defending the military and I am sorry you think that is funny.",
                                  "author": null,
                                  "created": 1577585912,
                                  "upvotes": 1,
                                  "replies": {
                                    "fcbes4y": {
                                      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcbes4y/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1577585972,
                                      "upvotes": 3,
                                      "replies": {
                                        "fcbfdri": {
                                          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcbfdri/",
                                          "text": "Iran, Russia, China, Pakistan, and many other countries attempt to hack into our networks every day.",
                                          "author": null,
                                          "created": 1577586180,
                                          "upvotes": 1,
                                          "replies": {
                                            "fcbfp0r": {
                                              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcbfp0r/",
                                              "text": "[deleted]",
                                              "author": null,
                                              "created": 1577586293,
                                              "upvotes": 1,
                                              "replies": {
                                                "fcbfvnj": {
                                                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcbfvnj/",
                                                  "text": "Lol you just said it was the funniest thing, maybe it was the way I phrased it",
                                                  "author": null,
                                                  "created": 1577586357,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fca8hth": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca8hth/",
      "text": "Since you’re joining up with the Air Force, see if you can get one of those sweet Space Force gigs. Best of luck to ya!",
      "author": "uknowhowitb",
      "created": 1577564678,
      "upvotes": 2,
      "replies": {
        "fcc8lmv": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc8lmv/",
          "text": "1C6X1 - Space Systems Operations is one of the career fields I'm applying for! #SpaceForceGang",
          "author": null,
          "created": 1577595605,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fc8uvxp": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc8uvxp/",
      "text": "[deleted]",
      "author": null,
      "created": 1577542379,
      "upvotes": 3,
      "replies": {
        "fc9i2or": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9i2or/",
          "text": "The point is he doesn’t want the college experience right now for his own reasons. He has enlisted so no going back, also he doesn’t want to be a career military officer, just wants the armed forces to help him give him guidance.",
          "author": "goflyint0",
          "created": 1577552990,
          "upvotes": 2,
          "replies": {
            "fc9t0uu": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9t0uu/",
              "text": "[deleted]",
              "author": null,
              "created": 1577557780,
              "upvotes": 6,
              "replies": {
                "fcfjb20": {
                  "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfjb20/",
                  "text": "Not a military person, don’t know what the fuck that means",
                  "author": "goflyint0",
                  "created": 1577630576,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fcc8fv3": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc8fv3/",
              "text": "My dad is a career Air Force officer and I'm not totally ruling it out down the road. But right now, I want to **do** something rather than go to college.",
              "author": null,
              "created": 1577595556,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fc9d5ny": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9d5ny/",
      "text": "So much respect! This is a smart move, despite what others may say. I would do the same thing if I was strong enough mentally and physically. And thanks for your service!",
      "author": "peptobizmul",
      "created": 1577550814,
      "upvotes": 2,
      "replies": {}
    },
    "fca4v68": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca4v68/",
      "text": "[deleted]",
      "author": null,
      "created": 1577563085,
      "upvotes": 0,
      "replies": {
        "fcc9akx": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc9akx/",
          "text": "Funny enough, the oath I took was in English, not Hebrew. ¯\\\\\\_(ツ)\\_/¯",
          "author": null,
          "created": 1577595817,
          "upvotes": -2,
          "replies": {}
        }
      }
    },
    "fcaj3w8": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcaj3w8/",
      "text": "Good luck! Enjoy your time, and don’t give up!",
      "author": "117_Sins",
      "created": 1577570146,
      "upvotes": 1,
      "replies": {}
    },
    "fcamnm8": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcamnm8/",
      "text": "Look into enlisting in the Air National Guard instead. Most states offer free tuition at any state school. You'll get activated and paid full time for training, with the option of being activated more often. You will get extremely cheap ($50/month) healthcare, choose where you live, and get to choose your job.",
      "author": "lazydictionary",
      "created": 1577572275,
      "upvotes": 1,
      "replies": {}
    },
    "fcatg3w": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcatg3w/",
      "text": "I got into a lot of trouble in my early 20’s and didn’t get my BS till 29, I definitely think you should do navy then go to college!",
      "author": "icarusisgod",
      "created": 1577576274,
      "upvotes": 1,
      "replies": {}
    },
    "fcb14eo": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb14eo/",
      "text": "[deleted]",
      "author": null,
      "created": 1577580641,
      "upvotes": 1,
      "replies": {
        "fcc93va": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc93va/",
          "text": "I did my due diligence. My dad is a career Air Force officer and I've grown up around it. He also used to command a recruiting squadron so he helped me not get screwed over in my job choices and career options. I know what I'm getting into and I've given it a lot of thoughtful consideration. I'm making the right decision for me.",
          "author": null,
          "created": 1577595761,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fcchho2": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcchho2/",
      "text": "That's.. wow!! Good luck with everything! :)",
      "author": "Da_Invincible_",
      "created": 1577598444,
      "upvotes": 1,
      "replies": {}
    },
    "fcdx9kd": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcdx9kd/",
      "text": "Thats great man, best of luck for further experiences",
      "author": "potato__29",
      "created": 1577614727,
      "upvotes": 1,
      "replies": {}
    },
    "fcfphbl": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcfphbl/",
      "text": "Although I think your decision is awesome I would reccomend applying to one of the military academies instead of straight enlisting t=in the military. you would be paid for your studies and start directly into the military as an officer while not having to worry about college and the workforce once you leave.",
      "author": "Supahafiya",
      "created": 1577632495,
      "upvotes": 1,
      "replies": {}
    },
    "fd9xa2y": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fd9xa2y/",
      "text": "I wish I can join the airforce or the navy but im an international and I don't have the sort where Im from :(",
      "author": "sealy__",
      "created": 1578239059,
      "upvotes": 1,
      "replies": {
        "fd9xazq": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fd9xazq/",
          "text": "I saw a :( so heres an :) hope your day is good",
          "author": "SmileBot-2020",
          "created": 1578239072,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fc9eimn": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9eimn/",
      "text": "Bravo!",
      "author": null,
      "created": 1577551461,
      "upvotes": 1,
      "replies": {}
    },
    "fcanuol": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcanuol/",
      "text": "Thank you for serving our country. I’m glad there are some very intelligent, successful, capable people joining the military because they choose to not because it is their last resort and they have no where else to turn. Good luck",
      "author": "nihilismdebunked",
      "created": 1577572975,
      "upvotes": 1,
      "replies": {}
    },
    "fcb6pla": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb6pla/",
      "text": "So u choose the path of welfare... wise choice",
      "author": "justinint",
      "created": 1577583070,
      "upvotes": 1,
      "replies": {}
    },
    "fc93mpi": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc93mpi/",
      "text": "good luck dude!!!",
      "author": "shayan211237",
      "created": 1577546489,
      "upvotes": 0,
      "replies": {}
    },
    "fc9j886": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9j886/",
      "text": "Hell yeah! Go Air Force!",
      "author": "IMLL1",
      "created": 1577553464,
      "upvotes": 0,
      "replies": {}
    },
    "fc8vffu": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc8vffu/",
      "text": "thank u for this my man.",
      "author": null,
      "created": 1577542644,
      "upvotes": -2,
      "replies": {}
    },
    "fca2tuu": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca2tuu/",
      "text": "attaboy",
      "author": "Raider454",
      "created": 1577562255,
      "upvotes": 0,
      "replies": {}
    },
    "fca7373": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca7373/",
      "text": "Happy for you!",
      "author": "lucelwoo",
      "created": 1577564030,
      "upvotes": 0,
      "replies": {}
    },
    "fca8s7p": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fca8s7p/",
      "text": "a very much needed wholesome story in the midst of this chaotic season.",
      "author": "LOLIMDYInggg",
      "created": 1577564822,
      "upvotes": 0,
      "replies": {}
    },
    "fcat22j": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcat22j/",
      "text": "Yyyyyeah no way José",
      "author": "excusemebro",
      "created": 1577576049,
      "upvotes": 0,
      "replies": {}
    },
    "fcb45tu": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcb45tu/",
      "text": "Thank you for your service!",
      "author": "lamsamsam",
      "created": 1577582114,
      "upvotes": 0,
      "replies": {}
    },
    "fc9joha": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9joha/",
      "text": "Wonderful!!  Glad you are at peace.  Enjoy the rest of your year!",
      "author": "1wikdmom",
      "created": 1577553661,
      "upvotes": -2,
      "replies": {}
    },
    "fc8zgvw": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc8zgvw/",
      "text": "Thank you for your service!!",
      "author": "eamkraut",
      "created": 1577544576,
      "upvotes": -4,
      "replies": {
        "fcajxcp": {
          "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcajxcp/",
          "text": "I know you meant this in a kind way and I mean no disrespect to OP, but he hasn't done anything yet.",
          "author": null,
          "created": 1577570637,
          "upvotes": 5,
          "replies": {
            "fcc9e87": {
              "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcc9e87/",
              "text": "Yup, I've done nothing yet really. Thank your local cops and firefighters, they risk their lives every day way more than most members of the military.",
              "author": null,
              "created": 1577595847,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fc9oost": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9oost/",
      "text": "Great option.  It's likely that you'll quickly rise to the top of your enlisted class and begin getting leadership experience.  Best of luck to you.",
      "author": "kickin_it_old_skool",
      "created": 1577555864,
      "upvotes": -4,
      "replies": {}
    },
    "fc9ih7h": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9ih7h/",
      "text": "Good luck, thank you for your service! <o",
      "author": "Darren_NH",
      "created": 1577553158,
      "upvotes": -2,
      "replies": {}
    },
    "fc9gotd": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9gotd/",
      "text": "I love this!!! I hate when people think they have to go the traditional route to be happy. good for you and thank you for your service",
      "author": "texangirl101",
      "created": 1577552414,
      "upvotes": -2,
      "replies": {}
    },
    "fc9qeka": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9qeka/",
      "text": "This is touching. I'm so glad that you have found your calling, and it's so refreshing to hear someone excited about their future as you seem to be. Congratulations! I wish you well.",
      "author": "confusedjulia",
      "created": 1577556627,
      "upvotes": -2,
      "replies": {}
    },
    "fcg2vnv": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcg2vnv/",
      "text": "Good luck man. I respect the decision. Don't take any shit from everyone here posting negative shit",
      "author": "Tim70",
      "created": 1577635972,
      "upvotes": 0,
      "replies": {}
    },
    "fcg6p47": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fcg6p47/",
      "text": "In the end you have to be the master of your own fate and make your own decisions.\n\nI think the military is a great place to start a career, and get practical hands on training if you are willing to put in the effort.  I wanted to attend West Point, but since I was a few days short of my 17th birthday, I wasn't able to apply.  My parents didn't want me to sit around for a whole year doing nothing when I already had an admissions offer, so they sort of forced me to go to a state school.\n\nDon't let other people bring you down.",
      "author": "CuriousAlertness",
      "created": 1577636947,
      "upvotes": 0,
      "replies": {}
    },
    "fc9rvfg": {
      "link": "/r/ApplyingToCollege/comments/egq6he/after_a_stressful_season_of_applications_ive/fc9rvfg/",
      "text": "Hey how is one supposed to get that top secret clearance again?",
      "author": "IcarG",
      "created": 1577557279,
      "upvotes": -2,
      "replies": {}
    }
  }
}