{
  "sid": "qosp3u",
  "link": "/r/ApplyingToCollege/comments/qosp3u/annoyed_but_want_to_know_if_i_should_do_it/",
  "title:": "Annoyed but want to know if I should do it?",
  "text": "Hi so I ED to a school but my mother got mad and wanted me to apply to more colleges but if I get into my ED , I obviously have to go there but she cried and shit saying she wants me to apply to more schools so I switched from ED to EA. NOW SHE’S TELLING ME I COULD SWITCH BACK BECAUSE SHE DOESNT HAVE APPLICATION MONEY. If I switch back to ED would that be bad? At this point I don’t care, I worked my ass off for my ED school for her to ruin it.",
  "author": "shekyy_lopie",
  "created": 1636304473,
  "updated": 1636654076,
  "over_18": false,
  "upvotes": 30,
  "upvote_ratio": 0.97,
  "comments": {
    "hjp39l3": {
      "link": "/r/ApplyingToCollege/comments/qosp3u/annoyed_but_want_to_know_if_i_should_do_it/hjp39l3/",
      "text": "Sorry for your confusion and added stress. At this point I would apply for the status you want. But first, you and your mother have to talk candidly (know this is difficult) about this being a \"cast in concrete; once in a cycle\" decision. Neither of you want or need any more conflict! God Luck!",
      "author": "Radiant-Chipmunk-987",
      "created": 1636305953,
      "upvotes": 22,
      "replies": {
        "hjp57a9": {
          "link": "/r/ApplyingToCollege/comments/qosp3u/annoyed_but_want_to_know_if_i_should_do_it/hjp57a9/",
          "text": "Thanks, I don’t know if it will be annoying for the university to see I keep switching statuses. She wants me to apply to Emory and Cornell (I really don’t want though because I don’t see myself in those schools)",
          "author": "shekyy_lopie",
          "created": 1636306723,
          "upvotes": 3,
          "replies": {
            "hjp9ual": {
              "link": "/r/ApplyingToCollege/comments/qosp3u/annoyed_but_want_to_know_if_i_should_do_it/hjp9ual/",
              "text": "My guess is that the university will care a whole lot less than your discomfort at not keeping it as ED. Why not apply for RD for Emory and Cornell if you must and if money is an issue now? By then, your Mom may have changed her mind. You Do know which of you is going to college and needs to be content with it?!!!!",
              "author": "Radiant-Chipmunk-987",
              "created": 1636308591,
              "upvotes": 8,
              "replies": {
                "hjpi9qw": {
                  "link": "/r/ApplyingToCollege/comments/qosp3u/annoyed_but_want_to_know_if_i_should_do_it/hjpi9qw/",
                  "text": "Thanks for the advice!",
                  "author": "shekyy_lopie",
                  "created": 1636311844,
                  "upvotes": 3,
                  "replies": {
                    "hjpj2zw": {
                      "link": "/r/ApplyingToCollege/comments/qosp3u/annoyed_but_want_to_know_if_i_should_do_it/hjpj2zw/",
                      "text": "so welcome",
                      "author": "Radiant-Chipmunk-987",
                      "created": 1636312151,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjqfebe": {
      "link": "/r/ApplyingToCollege/comments/qosp3u/annoyed_but_want_to_know_if_i_should_do_it/hjqfebe/",
      "text": "If you don’t have money for application fees how will you pay for school? What if you apply to schools with few waivers like Tulane instead?",
      "author": "RetiringTigerMom",
      "created": 1636325098,
      "upvotes": 1,
      "replies": {
        "hjqrxvu": {
          "link": "/r/ApplyingToCollege/comments/qosp3u/annoyed_but_want_to_know_if_i_should_do_it/hjqrxvu/",
          "text": "Should’ve mention this but I applied to 12 schools already and didn’t want to apply to anymore since my ED school was the last school. But my other relatives wanted to send money for me to apply to schools near them (that’s why my mom wanted me to switch to EA). The money in question haven’t even reach to us yet and I switched to EA (stupid ik) so now she’s telling me to switch back.\n\nWe don’t mind paying the the tuition, but the fees at this very point is troubling for us because of where I live.",
          "author": "shekyy_lopie",
          "created": 1636330604,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}