{
  "sid": "q95zax",
  "link": "/r/ApplyingToCollege/comments/q95zax/what_is_the_chance_of_getting_into_schools_with_a/",
  "title:": "What is the chance of getting into schools with a transfer 2.8 GPA?",
  "text": "So I'm a 3rd year at another college but I'm not happy there and I have a few options on where I've wanted to go for college. I have only a 2.8GPA with 45 credits. There are some places I want to go to like Florida, Maryland, Alabama, Tennessee, LSU, Texas, etc.\n\n\n I just feel like my transfer gpa is not even close to good enough to get into the main campus of these schools. What transfer gpa do most of these colleges accept people into? I've only heard of high school gpa averages. My HS was 3.6 by the way. Thank you.",
  "author": "GingerGod69",
  "created": 1634363446,
  "updated": 1634423313,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hguvuz8": {
      "link": "/r/ApplyingToCollege/comments/q95zax/what_is_the_chance_of_getting_into_schools_with_a/hguvuz8/",
      "text": ">What is the chance of getting into schools with a transfer 2.8 GPA?\n\nNot great.  Texas, Florida and Maryland are probably out of reach.  Alabama, Tennessee and LSU might be a possibility.",
      "author": "jayphoward",
      "created": 1634390572,
      "upvotes": 2,
      "replies": {}
    },
    "hgtxubd": {
      "link": "/r/ApplyingToCollege/comments/q95zax/what_is_the_chance_of_getting_into_schools_with_a/hgtxubd/",
      "text": "Minimum transfer GPA at Alabama and UTK is 2.0 and at LSU is 2.5 so you could certainly have a shot at those and comparable state flagships.  Specific colleges and majors could be more selective though. \n\nUMD, UF, and UT Austin would be more selective.  For example, UMD has a guaranteed transfer program for in-state community colleges but the minimum GPA is 3.0 - I think transfers from other schools are more competitive than that.",
      "author": "BrawnyAcolyte",
      "created": 1634363948,
      "upvotes": 1,
      "replies": {
        "hgtycxq": {
          "link": "/r/ApplyingToCollege/comments/q95zax/what_is_the_chance_of_getting_into_schools_with_a/hgtycxq/",
          "text": "Ok thank you for telling me! This makes me feel a little better from the minimum GPA. I'll look at the specific colleges and my major to see of my options would be good. I am staying at my college for 2 more semesters so I'm going to really try to get my GPA up anyways. Appreciate it.",
          "author": "GingerGod69",
          "created": 1634364337,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}