{
  "sid": "qn6jms",
  "link": "/r/ApplyingToCollege/comments/qn6jms/no_ecs_related_to_major/",
  "title:": "No EC's related to major",
  "text": "Hey everyone!\n\nSo, just to give a little background:\nI was initially planning to major in physics for my undergraduate studies until I started researching about its job prospects. I found that physics, besides being one of the most difficult majors, doesn't equip you with the necessary professional skills required for you to work at a company. Also, physicists or researchers don't get paid well enough and struggle to earn a decent amount for most of their professional life.\nMoreover, I did a few summer courses and internships over the summer related to physics and engineering and tbh I didn't really enjoy them. However, I liked the coding part of it... it interested me a lot and for the past few weeks I've been contemplating whether to switch my majors to CS or not. But the problem I'm facing is I have very little experience in programming and also almost no EC's related to it. Everything I've done is related to either Math or physics/engineering and not to programming or CS in particular.\n\nSo do you think it would be a wise decision to apply for CS for my UG or apply for physics first to increase my chances of acceptance and then later switch to CS at uni? \nPlease advise.",
  "author": "T800-",
  "created": 1636100977,
  "updated": 1636135735,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hje5lz1": {
      "link": "/r/ApplyingToCollege/comments/qn6jms/no_ecs_related_to_major/hje5lz1/",
      "text": "apply then switch!",
      "author": "hedgehoggerrr",
      "created": 1636101922,
      "upvotes": 2,
      "replies": {}
    },
    "hje749w": {
      "link": "/r/ApplyingToCollege/comments/qn6jms/no_ecs_related_to_major/hje749w/",
      "text": "You dont really need major related ECs, except at top colleges. For example, I got into a state flagship as an international for CS with ZERO CS related activities and never having studied CS. Just write good essays and you should be fine.",
      "author": "Disastrous-Ad-1328",
      "created": 1636103328,
      "upvotes": 1,
      "replies": {}
    },
    "hjecujb": {
      "link": "/r/ApplyingToCollege/comments/qn6jms/no_ecs_related_to_major/hjecujb/",
      "text": "Apply for cs. It’s more competitive to switch into it",
      "author": "Top-Cryptographer-81",
      "created": 1636108222,
      "upvotes": 1,
      "replies": {}
    },
    "hjeedza": {
      "link": "/r/ApplyingToCollege/comments/qn6jms/no_ecs_related_to_major/hjeedza/",
      "text": "Apply for CS. At many schools, it is very difficult to switch into CS. \n\nMake sure to apply to schools other than ones with the most highly-selective, highly-ranked CS programs. Those are the programs most likely to reject applicants without more demonstrated CS interest. Go ahead and apply to those, because you would definitely still have a chance. But be sure to also apply to less competitive programs at schools you like, to increase your chances and give you more options.",
      "author": "cmac6767",
      "created": 1636109396,
      "upvotes": 1,
      "replies": {}
    }
  }
}