{
  "sid": "r4enlw",
  "link": "/r/ApplyingToCollege/comments/r4enlw/uc_app_question/",
  "title:": "Uc app question",
  "text": "So I have 3.1 uw and don't know if i should even apply. I mean i barley have any ec's and no test scores but I do have fee waivers. Also, i've barely started any of my piqs because i thought i couldn't apply. pls help idk what to do lolzzzzz",
  "author": "ilovem11lfs",
  "created": 1638134316,
  "updated": 1638204944,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmg6u5s": {
      "link": "/r/ApplyingToCollege/comments/r4enlw/uc_app_question/hmg6u5s/",
      "text": "Are you in-state? If not, only apply if your family can afford the OOS tuition (which I presume isn’t the case with fee waivers in hand).\n\nIf you are in-state, a 3.1 is tough for most UCs without ECs or something else to make up for it. If you have few waivers and you want to attend a UC, you could look at ones with higher acceptance rates, like UCSC, UCR, and UCM. Definitely apply to some less selective CSUs (you can still get a solid education at less selective institutions) in case it doesn’t work out for a UC.",
      "author": "pixelatedpix",
      "created": 1638134811,
      "upvotes": 3,
      "replies": {
        "hmgiuos": {
          "link": "/r/ApplyingToCollege/comments/r4enlw/uc_app_question/hmgiuos/",
          "text": "Yup! those UC's are definitely on my list and have applied to some CSUs. I'm just really behind on my PIQ's and don't think i'll make it on time.",
          "author": "ilovem11lfs",
          "created": 1638139747,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmga6vc": {
      "link": "/r/ApplyingToCollege/comments/r4enlw/uc_app_question/hmga6vc/",
      "text": "Did you do any honors or AP, then the GPA would go up due to extra weight? Since you have 4 no app fee colleges - take advantage of it. You have nothing to lose.",
      "author": "svday",
      "created": 1638136173,
      "upvotes": 2,
      "replies": {
        "hmgibqt": {
          "link": "/r/ApplyingToCollege/comments/r4enlw/uc_app_question/hmgibqt/",
          "text": "My school doesn't have any honors or AP but i did take some dual enrollment courses. You're right! I have nothing to lose :)",
          "author": "ilovem11lfs",
          "created": 1638139526,
          "upvotes": 2,
          "replies": {
            "hmgsvds": {
              "link": "/r/ApplyingToCollege/comments/r4enlw/uc_app_question/hmgsvds/",
              "text": "Dual enrollment courses are very good - they also get extra weight age and also show rigor. Definitely apply. Answer the PIQs as if someone asked you the questions verbally.",
              "author": "svday",
              "created": 1638144026,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmgjosq": {
      "link": "/r/ApplyingToCollege/comments/r4enlw/uc_app_question/hmgjosq/",
      "text": "It doesn’t hurt to apply especially since you have fee waivers so I think you should go for it!",
      "author": "angelicjoy",
      "created": 1638140096,
      "upvotes": 1,
      "replies": {}
    }
  }
}