{
  "sid": "q7mvqx",
  "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/",
  "title:": "IM NOT OKAY🧍🏼‍♀️",
  "text": "(Vent post)\n\nIm losing it. I live in Chile and we have this standarized test called PDT (which is similar to SAT) and you take it by the end of your senior year. The thing is, I’ve been hardcore studying for this test, preparing 25 college apps (13 of them are due in 18 days) and also studying for a big ass amount of tests I have every week at school. Bruh im so done😭\n\nTHAT IS NOT EVEN THE WORST THING. College apps to the US are so UNCOMMON here in my country so my school had no fucking idea what a school profile/report/transcript was! I had to make everything! Last night I spent 6 hours creating the school profile document because my conselour (which is my english teacher because my school doesn’t have one) didn’t know how to do one and didn’t want to do it.\n\nAnd the worst part? Im probably not getting into any school. Wasting so much fucking time and I’m probably getting rejected because I’m an international needing aid. \nBut I’m still doing it because I need to get out of this fucking country. Thanks.",
  "author": "javznotjavz",
  "created": 1634166077,
  "updated": 1634576152,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgk6fp4": {
      "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/hgk6fp4/",
      "text": "i hate to break it to you, but common app does have pdfs of blank school reports on the website 💀",
      "author": "PrincipleSpecial4759",
      "created": 1634175834,
      "upvotes": 31,
      "replies": {
        "hglo4pk": {
          "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/hglo4pk/",
          "text": "wdym? can you explain please",
          "author": "No-Shift-6657",
          "created": 1634213184,
          "upvotes": 5,
          "replies": {
            "hglvizw": {
              "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/hglvizw/",
              "text": "oh you didn’t have to make one you just could’ve printed a pdf and had your counselor fill it out",
              "author": "PrincipleSpecial4759",
              "created": 1634217256,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hglzhbm": {
          "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/hglzhbm/",
          "text": "Yea ik! I’m complaining about the fact my teacher didn’t know anything and wanted me to do all, even tho if I get into any good college they are gonna brag for a whole year and use it as promo for their school lmao",
          "author": "javznotjavz",
          "created": 1634219163,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hgjr1oa": {
      "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/hgjr1oa/",
      "text": "so sorry that you have to deal with this, hang in there <3",
      "author": "girlbythewindows",
      "created": 1634168476,
      "upvotes": 12,
      "replies": {}
    },
    "hgjqy8l": {
      "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/hgjqy8l/",
      "text": "Oh man a that is HARD. I believe that this hard work will pay off is some way - you should too. Maybe not in a predictable way but you have to put yourself out in the world to succeed in anything. And that’s what you are doing. And that’s great. Best of luck 🤞",
      "author": "WorriedTurnip6458",
      "created": 1634168430,
      "upvotes": 5,
      "replies": {}
    },
    "hgkxvdl": {
      "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/hgkxvdl/",
      "text": "fellow Latin American here. I get you !!! everything is fricking difficult from this side of the globe, but there’s nothing anyone can do to improve anything in the case of college apps. all we can do at this point is hope for the AOs to understand opportunities are not the same here. but hey, everything is going to be okay!!! it’s already so rewarding to be trying our absolute best",
      "author": "joydivisible",
      "created": 1634191614,
      "upvotes": 4,
      "replies": {
        "hglznul": {
          "link": "/r/ApplyingToCollege/comments/q7mvqx/im_not_okay/hglznul/",
          "text": "Thank you so so much for your words<3 Im hoping this will come out with great results, and I hope you receive good news too.",
          "author": "javznotjavz",
          "created": 1634219246,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}