{
  "sid": "ql5yjh",
  "link": "/r/ApplyingToCollege/comments/ql5yjh/psa_double_check_your_sat_scores_were_sent/",
  "title:": "PSA: Double check your SAT scores were sent. College Board confirmed scores were sent to colleges and NMSC but they never were.",
  "text": "Please double check your college portals (for those that require official score reports) that they have recd your SAT reports. Six weeks ago I ordered scores to be sent. I received email and verbal confirmation from College Board that they were but noticed on college portals scores not received. On College Board site, scores sent page is blank but was told \"that happens sometimes\" . Called AOs, no scores received. Three calls to customer service has gotten me nowhere except put on a list for \"upper management\" to call me back. No call back and my social media posts to CB were deleted.",
  "author": "finster_baby",
  "created": 1635864816,
  "updated": 1635889470,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.95,
  "comments": {
    "hj0zq59": {
      "link": "/r/ApplyingToCollege/comments/ql5yjh/psa_double_check_your_sat_scores_were_sent/hj0zq59/",
      "text": "Oh heck no! That's crazy!! DM me tomorrow if no one calls. I have a contact, from raising other problems. \n\nGeesh, CB. Get your sh*t together.",
      "author": "roguezebra",
      "created": 1635869921,
      "upvotes": 4,
      "replies": {
        "hj207l4": {
          "link": "/r/ApplyingToCollege/comments/ql5yjh/psa_double_check_your_sat_scores_were_sent/hj207l4/",
          "text": "Thank you! Will DM you later.",
          "author": "finster_baby",
          "created": 1635884201,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj17bmq": {
      "link": "/r/ApplyingToCollege/comments/ql5yjh/psa_double_check_your_sat_scores_were_sent/hj17bmq/",
      "text": "Nothing to do with this post,  it a rant to CB as well!! They canceled 6 of my son’s SAT test the past year. Luckily, we decide to switch to ACT in March and he got good results for it. \n\nACT is definitely a better testing agency when it comes to scheduling, testing and sending score! His ACT score was send on the same day that we request, and the university got it the next morning!",
      "author": "poohland",
      "created": 1635872955,
      "upvotes": 3,
      "replies": {}
    },
    "hj2415m": {
      "link": "/r/ApplyingToCollege/comments/ql5yjh/psa_double_check_your_sat_scores_were_sent/hj2415m/",
      "text": "If a college says they self-report scores, do you not need to send them? Obviously you’d need to if you get in, but I currently haven’t sent any as all my schools have enabled self-reporting",
      "author": "fro5torm",
      "created": 1635885648,
      "upvotes": 1,
      "replies": {}
    }
  }
}