{
  "sid": "q6aa2b",
  "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/",
  "title:": "I need to pick an ED school",
  "text": "Guys I need to pick an ED school like yesterday. My parents are pressuring me to ED somewhere and I want to, I just don’t know where. Pls don’t say don’t ED if you’re not 100% sure, because I don’t really care where I end up as long as it’s a good school- I can pretty much fit in anywhere. Hard stats- I have 3.9 UW 4.9 W and 1430 SAT. I want to study finance or business analytics. Also I live in Northeast, and would prefer to be in that area\n\nSome contenders are:\nEmory, Tufts, Notre dame (REA), and Boston College\n\nThing is if I apply ED I want to actually have a shot of getting in, so a school that actually gives an ED boost would be best. I want a school w a collaborative, tight knit culture. Please please give some suggestions, and please don’t say I shouldn’t ED anywhere; I’m not going to have regrets; I just need to pick a school where I have a decent shot but is still prestigious (as my parents don’t want to pay 80k for a subpar school)",
  "author": "rad-jazz-21",
  "created": 1634000052,
  "updated": 1634570912,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.95,
  "comments": {
    "hgatz7x": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgatz7x/",
      "text": "Tufts doesn't have a Finance or Business Analytics major, so that's crossed off for ED.\n\nYou want to stay in the Northeast, so no Notre Dame & Emory for ED.\n\nBoom, you're left with **Boston College**.\n\n\\^\\^\\^ Extremely simple and bare way of minimizing schools lol. But BC matches your criteria of being in the Northeast, having a Finance major (and Business Analytics as a concentration), and having a collaborative, tight-knit culture. Their business programs are also very well-regarded. Your GPA, coupled with your SAT, are within range for BC.\n\nKeep in mind that BC values service and leadership, so if you're stuck choosing an essay topic, you could start brainstorming with service and leadership and go from there.\n\nBest of luck. :)",
      "author": "toyota2003",
      "created": 1634002204,
      "upvotes": 27,
      "replies": {
        "hgawx9t": {
          "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgawx9t/",
          "text": "Thanks so much! Having a fresh pair of eyes see that has really helped put things in perspective lol. I think I’m going to w BC!",
          "author": "rad-jazz-21",
          "created": 1634003540,
          "upvotes": 7,
          "replies": {}
        },
        "hgaxg4w": {
          "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgaxg4w/",
          "text": "Do you have any suggestions that I didn’t already have in mind?",
          "author": "rad-jazz-21",
          "created": 1634003771,
          "upvotes": 1,
          "replies": {
            "hgb2dw3": {
              "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgb2dw3/",
              "text": "Mwah ha ha ha... My favorite question!\n\nBased on BC/Notre Dame/Emory/Tufts & your preference of being in the Northeast & studying finance/business analytics, here's some schools that might be good fits for you:\n\n**Lehigh, Fordham, Bentley, Syracuse** \\- Targets/Matches\n\n**Northeastern, Babson -** Reaches\n\n**Cornell, UPenn, Georgetown** \\- High Reaches",
              "author": "toyota2003",
              "created": 1634005990,
              "upvotes": 7,
              "replies": {
                "hgb4x3d": {
                  "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgb4x3d/",
                  "text": "Thanks so much! This is rlly helpful",
                  "author": "rad-jazz-21",
                  "created": 1634007146,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hgard6a": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgard6a/",
      "text": "boston college gives hard boost!",
      "author": "letsgocollege",
      "created": 1634000990,
      "upvotes": 4,
      "replies": {
        "hgawy0v": {
          "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgawy0v/",
          "text": "Ooo that’s good to know!",
          "author": "rad-jazz-21",
          "created": 1634003549,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hgaww8v": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgaww8v/",
      "text": "Boston College out of the ones you listed. I'd also encourage you to look into to Northeastern, although their tuition can be quite high without merit aid (did you qualify for national merit?).",
      "author": "FuriousGeorge1435",
      "created": 1634003526,
      "upvotes": 6,
      "replies": {
        "hgaxekx": {
          "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgaxekx/",
          "text": "I do not:( and my parents don’t think NEU would be worth 80k… honestly idek think they think BC is worth 80k but I’m gonna try and convince them haha. Do you have any suggestions that I didn’t list?",
          "author": "rad-jazz-21",
          "created": 1634003751,
          "upvotes": 8,
          "replies": {
            "hgayir1": {
              "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgayir1/",
              "text": "I hate to break it to you, but NEU and BC are pretty much the only usually low-acceptance-rate schools in the northeast US that give a big boost from ED. I'm not sure about the rest of your application, but if your 1430 (which is certainly not a bad score!) is any indication, it'll be very, very difficult for you to get into absolute top schools which your parents would agree are worth the money, even more so than for the average applicant to those top schools. You could always ED somewhere like Penn, which would definitely be worth the money due to Wharton having super strong programs for your major, but you'd have to keep in mind that the chances are very slim.\n\nEdit: Also, do you know why your parents think NEU and BC wouldn't be worth the money? Both are great schools and are T50s.",
              "author": "FuriousGeorge1435",
              "created": 1634004260,
              "upvotes": 4,
              "replies": {
                "hgb35wf": {
                  "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgb35wf/",
                  "text": "They think my state flagship or schools that offer merit would be a better deal than BC or NEU. And yeah, I know all that which kinda sucks so I’m probably going to go for BC or Emory",
                  "author": "rad-jazz-21",
                  "created": 1634006341,
                  "upvotes": 2,
                  "replies": {
                    "hgb4a8a": {
                      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgb4a8a/",
                      "text": "Assuming you're ok to leave the Northeast, out of the options you listed I'd honestly say REA to Notre Dame. This way you can compare offers, and if you end up getting a big merit scholarship to your state flagship, you can decide to go there instead.",
                      "author": "FuriousGeorge1435",
                      "created": 1634006858,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "hgb2hqd": {
                  "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgb2hqd/",
                  "text": "\\- You have to apply test-optional: 1430 will be decremental to your app.\n\n\\- Schools are only worth 80k to those who can easily afford it, if not, I'd strongly consider your state flagship. \n\nWhere in Northeast are you?",
                  "author": "Applying_in_2021",
                  "created": 1634006039,
                  "upvotes": 1,
                  "replies": {
                    "hgb5t6m": {
                      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgb5t6m/",
                      "text": "A 1430 is perfectly fine for BC( all of them really). It's within the range for BC.",
                      "author": "91210toATL",
                      "created": 1634007559,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgc6d3o": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgc6d3o/",
      "text": "ED Boston College",
      "author": "Public_Watch1905",
      "created": 1634034000,
      "upvotes": 2,
      "replies": {}
    },
    "hgbnyj3": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgbnyj3/",
      "text": "Northeastern \n\nVillanova\n\nBabson\n\nFordham\n\nBoston college",
      "author": "admissionsmom",
      "created": 1634017884,
      "upvotes": 2,
      "replies": {
        "hgdya0g": {
          "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgdya0g/",
          "text": "Thanks!",
          "author": "rad-jazz-21",
          "created": 1634064676,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgbuui9": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgbuui9/",
      "text": "Id say that in terms of the easiest acceptance rate for ED/EA among the schools you listed it would be BC as the easiest (\\~40%), then Tufts (\\~25%), then Emory (\\~23%), and then Notre Dame (\\~22%). Also keep in mind that the school (besides ND) is a school that you have to commit to if you get accepted, so choose your school wisely in case you might have any regrets later down the line. \n\nIn regards to finance/job opportunities, Notre Dame is the best among your 4 schools, with Tufts being the worst ([https://www.wallstreetoasis.com/forums/comprehensive-undergraduate-target-schools-tier-list-2020](https://www.wallstreetoasis.com/forums/comprehensive-undergraduate-target-schools-tier-list-2020)). Notre Dame is a target/top semi-target and gives you the most opportunities, Emory and BC are middle semi-targets that focus mainly on regional job offers, and Tufts is a low semi-target (even more regional-based). I'm not sure about the culture but I'm guessing all of them except Emory are pretty good; I heard that Emory students don't have any school pride so it might not be that great there.\n\nSince you're not picking schools to go to and rather focusing on schools that are good and give you the best chance, I'd recommend Emory or BC based on your stats. I'd give you about a 55% chance of getting into BC based on your stats, while Emory or ND might be a little bit lower than the acceptance rate I listed above. Tufts I'm not sure about.\n\nIf you want more advice about this kind of stuff, feel free to pm me, or search it up on Wall Street Oasis, which is a forum similar to A2C but is more business centric with some people that actually know what they're saying lol.",
      "author": "Forward-Drive7282",
      "created": 1634023420,
      "upvotes": 1,
      "replies": {}
    },
    "hgb6evo": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgb6evo/",
      "text": "Based on your wants I think Tufts is the best option. It doesn't have a finance major but an econ major will have similar outcomes as a business major elsewhere. \nTufts> BC> ND> Emory\nHowever, all of these schools are great and Emory does have very good Northeast placement for a southern schools. I believe 40% of Emory grads end up in the NE.",
      "author": "91210toATL",
      "created": 1634007842,
      "upvotes": -1,
      "replies": {}
    },
    "hgbob0t": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgbob0t/",
      "text": "Washu is the best answer here",
      "author": "Neeroodle",
      "created": 1634018144,
      "upvotes": -1,
      "replies": {
        "hgd4lsy": {
          "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgd4lsy/",
          "text": "I was thinking about WashU actually! It’s just that their high sat range makes me think I have zero shot of getting in. Are they good for business? I thought washu was more medicine oriented",
          "author": "rad-jazz-21",
          "created": 1634052510,
          "upvotes": 1,
          "replies": {
            "hgda1zy": {
              "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgda1zy/",
              "text": "Definitely good business and definitely a bigger reach for you, but worst case:  you don’t get in and you’re not pegged into one school via ED anyway. \n\nAnother good option that is less selective than WashU and closer to your region of preference:  U Rochester.",
              "author": "ChampionshipPerfect5",
              "created": 1634054723,
              "upvotes": 1,
              "replies": {}
            },
            "hgdauuk": {
              "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgdauuk/",
              "text": "The reason I reccomended WashU is because there ED boost is the biggest by far and it’s better than any other college you applied too. It’s less of a chance than the other schools, but the chance is not low. ED to WashU will give you a very fair shot of getting in. \nIt’s not better than tufts but tufts ED boost isn’t as significant.",
              "author": "Neeroodle",
              "created": 1634055058,
              "upvotes": 1,
              "replies": {
                "hgdpcdd": {
                  "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgdpcdd/",
                  "text": "The OP might get the best admissions odds lift from WashU, but the other schools originally listed are all probably marginally easier to get into. Even ND. When you adjust for applicant pool quality it’s really difficult to determine which ED choice is the most likely to generate an acceptance. \n\nThat’s kinda why I tossed out URochester. They have good econ/stats/finance programs, the admissions bar is a bit lower and they usually fill 40% of their class ED. 23 classes to complete all business school core requirements and the double major in both finance and business analytics. \n\nThe big advantage w WashU is that it’s less selective ED compared to peers of similar overall admissions selectivity and it offers better aid than the other schools if the OP’s family is at a level where they “might” qualify for some aid. If the OP’s family is really in that range, I could see WashU giving 10 grand while many of the others would not. The net price calculator would help there. \n\nOther thing I’d note:  OP, there are some very different schools on this list. If you don’t have a strong preference in terms of school culture, that’s fine. But ND/BC are pretty different than Tufts.",
                  "author": "ChampionshipPerfect5",
                  "created": 1634061014,
                  "upvotes": 1,
                  "replies": {
                    "hgdy7tn": {
                      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgdy7tn/",
                      "text": "Thanks for the advice! And yeah, I’m aware these schools are kinda wildly different from each other, but I’m the kind of person who kind fit in anywhere, so I’m not really concerned about that",
                      "author": "rad-jazz-21",
                      "created": 1634064652,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgbnpl1": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgbnpl1/",
      "text": "Not trying to dissuade you from applying ED but please realize that in most cases ED will be BINDING so you would have to go (not legally required but you would basically be blacklisted if you don't). This also means you won't be able to negotiate the financial aid package they offer you so unless you're wealthy and don't care about costs, sure go ahead. But if not, please think carefully.",
      "author": "Disastrous_Fig_3762",
      "created": 1634017697,
      "upvotes": 0,
      "replies": {
        "hgd65yt": {
          "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgd65yt/",
          "text": "Yeah I know… but my parents are the one who want me to ED and they know we wouldn’t get much aid so I’m pretty sure finance isn’t an issue- they just don’t want to pay full price for a school that’s comparable to my state school",
          "author": "rad-jazz-21",
          "created": 1634053134,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgeuv5u": {
      "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgeuv5u/",
      "text": "Sorry if this is a personal or inappropriate question, just ignore if that's the case. But why do you HAVE to ED? Why do your parents want you to? I was just curious, because I had never heard of that before.",
      "author": "redditnoap",
      "created": 1634078169,
      "upvotes": 1,
      "replies": {
        "hgevs8u": {
          "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgevs8u/",
          "text": "Honestly no idea. Partly bc I’m the most indecisive person in the world who would be happy at any of these colleges so it’d be nice if I get him. For my mom it’s bc she doesn’t think I could get in to one of the top colleges so this is kind of just for fun/ if I did get in, I’d be able to relax and de stress. For my dad, it’s me maximizing my chances at a college I probably would have less of a chance at if I applied RD.",
          "author": "rad-jazz-21",
          "created": 1634078576,
          "upvotes": 2,
          "replies": {
            "hgf97ea": {
              "link": "/r/ApplyingToCollege/comments/q6aa2b/i_need_to_pick_an_ed_school/hgf97ea/",
              "text": "Oh, okay. Thanks for replying!",
              "author": "redditnoap",
              "created": 1634084777,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}