{
  "sid": "qqngep",
  "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/",
  "title:": "r/uchicago: Another Asian student killed during a robbery. Misleading students, parents, and staff into thinking that Hyde Park is safe is simply unethical",
  "text": "[https://www.reddit.com/r/uchicago/comments/qqe1yv/misleading\\_students\\_parents\\_and\\_staff\\_into/](https://www.reddit.com/r/uchicago/comments/qqe1yv/misleading_students_parents_and_staff_into/)\n\n>​To any prospective student, researchers, and anyone in general: Hyde Park is not safe, full stop. Especially if you aren't American and aren't used to the normalization of deadly gun crimes.  \n>  \n>To people still misleading others who don't know about the numerous horrific dangers in Hyde Park: Why do you keep doing this? Hyde Park is not safe. Misleading people around you into thinking that it is is unethical. Some people decide to come to UChicago underestimating the hazard and risk of doing so due to the understatement of the danger in Hyde Park. It's at least understandable why the University downplays the security issues, but regular students? People need to make informed decisions and misinformation is shady to the nth degree.  \n>  \n>How many deaths must we have before people stop parroting the lie that Hyde Park is safe?\n\n[24-Year-Old Male Shot and Killed at 54th Place and Ellis Avenue](https://www.chicagomaroon.com/article/2021/11/9/24-year-old-male-shot-killed-54th-place-ellis-avenue/)\n\n>A recent graduate of the University of Chicago was shot and killed at about 1:54 p.m. Tuesday afternoon at 956 East 54th Place.  \n>  \n>The victim, a 24-year-old Asian male, was struck in the chest, according to the police scanner [Rangecast](https://twitter.com/SPOTNEWSonIG/status/1458162345470013449?s=20).   \n>  \n>The Chicago Police Department (CPD) confirmed that the victim was on  the sidewalk when the offender exited a dark-colored vehicle and  demanded property from him. The offender then shot the victim and fled  the scene in the vehicle.  \n>  \n>The victim was transported to the University of Chicago Medical Center, where he was pronounced dead at 2:13 p.m.  \n>  \n>The incident is different from the nearby shooting at East 53rd  Street and South Harper Avenue around 12:10 p.m., which was reported to  the University of Chicago Police Department and communicated to students  in an email. No casualties were reported in that incident. \n\nUpdated: [Recent University of Chicago graduate killed in Hyde Park identified as international student](https://www.chicagotribune.com/news/breaking/ct-university-chicago-graduate-killed-hyde-park-20211110-jcqptf2mpjhszjjlblzygsocdq-story.html) ([Dennis Shaoxiong Zheng](https://www.linkedin.com/in/dennis-zheng/))",
  "author": "JJKKLL10243",
  "created": 1636523547,
  "updated": 1636652802,
  "over_18": false,
  "upvotes": 194,
  "upvote_ratio": 0.97,
  "comments": {
    "hk27840": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk27840/",
      "text": "why has so much shit happened this week... berkeley, columbia, cornell, brown, and now uchicago",
      "author": "hoyasaxaa",
      "created": 1636547812,
      "upvotes": 40,
      "replies": {
        "hk4tdel": {
          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk4tdel/",
          "text": "Dont forget fordham too",
          "author": "Thro_aWay42",
          "created": 1636586570,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hk1frdo": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk1frdo/",
      "text": "This. It’s so dangerous that the Chicago PD patrols the university. Still people continue to be in denial and downvote you to hell when you try telling them this. They’re their own worst enemy, those sorts of people. My best wishes to the boy’s family.",
      "author": "a2cwy88766",
      "created": 1636526268,
      "upvotes": 113,
      "replies": {}
    },
    "hk1trxq": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk1trxq/",
      "text": "Another comment: perhaps gives more insight into the area. \n\n>You're right, Hyde Park is not safe, but an even more egregious falsehood is the astroturfed talking point where they act as if campus is just in Hyde Park. Over half of the dorms, lots of off campus housing, and many academic buildings are in the even more dangerous Woodlawn, not Hyde Park. And of course orbiting Woodlawn and Hyde Park are far more terrifying neighborhoods. And the other lie is acting like downtown is just a peachy brief trip from campus. It's a legit 45 minute one-way trek on public transportation with walking, bus and/or el stops in and passing through war zones.\n\nTo prospective peeps, I am in no way saying that you shouldn't apply to UC Hicago because it's definitely not like I'm applying there as well and would like to increase my chances (/s), but this just shows that location is a very very important factor. College campuses are probably the safest places in any city aside from government buildings, but it's unlikely that you'll be cooped up on campus 24/7. The surrounding area is definitely something to consider. Also, for my fellow internationals, gun crime is a thing in the US. They are on the rare side if you look at the statistics, but it's still a thing. Don't be blinded by the potential opportunities, think and research very carefully.",
      "author": "U_of_SOL",
      "created": 1636537806,
      "upvotes": 57,
      "replies": {
        "hk1ucno": {
          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk1ucno/",
          "text": "Just so people know there’s someone with multiple accounts who basically has been pushing three points and shows up whenever the topic of crime comes up:\n\n1) Hyde Park isn’t safe\n2) Even if Hyde Park is safe, a lot of the campus is in Woodlawn which isn’t\n3) Chicago isn’t a peer to the ivies. \n\nThis last year has been horrific, and even though a year ago I would have said Hyde Park was a safe neighborhood, this year it’s different. Whether this will get better as Covid subsides and the admin becomes serious about improving safety (which we’ve received several emails about) is something we can only guess at. But there are several things this person consistently gets wrong:\n\n1) Woodlawn as a neighbourhood extends well beyond the part of it that university buildings are on and the patrol area of the UCPD - the crime stats you get for that neighborhood include areas that students are well aware they shouldn’t go to, meanwhile the actual campus part (a tiny part of the overall neighborhood) reports very little crime.\n2) it’s actually very easy to get downtown using metra or the 6 bus, which is an express bus skips over the ‘dangerous’ neighborhoods by taking a highway down the lake from Hyde park. During non-rush-hour times it takes about 20 minutes. \n\nTbh I think this person is just someone who got rejected. It’s really random to shoehorn a convo about prestige into a dialog about campus safety, and it’s really clear that the person just doesn’t know the layout of the neighborhood/public transport.\n\nEdit: I’m talking about the person who wrote the comment being quoted here, not U_of_Sol.",
          "author": "SnooKiwis7945",
          "created": 1636538306,
          "upvotes": 29,
          "replies": {
            "hk1ysqk": {
              "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk1ysqk/",
              "text": ">Tbh I think this person is just someone who got rejected\n\nthey said they were applying this year...\n\n>It’s really random to shoehorn a convo about prestige into a dialog about campus safety\n\nwhen did they mention prestige???",
              "author": "taylorm898",
              "created": 1636542053,
              "upvotes": 21,
              "replies": {
                "hk1zn0t": {
                  "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk1zn0t/",
                  "text": "This isn’t the first time this person has appeared and I’m talking about more than just this one comment. I’m also not talking about the person commenting here, I’m talking about the person who wrote the comment they’re quoting.",
                  "author": "SnooKiwis7945",
                  "created": 1636542709,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk6lom6": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk6lom6/",
      "text": "I'm a HS senior in China. Last year a Chinese PhD UChi student was shot to death in his car with his fiancee sitting next to him. He was a alumni of my HS. He had a bright future ahead of him and it was tragic",
      "author": "PostDawn",
      "created": 1636621756,
      "upvotes": 4,
      "replies": {}
    },
    "hk29ayi": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk29ayi/",
      "text": "Chicago's leadership is pro criminal instead of pro victim.\n\nFor example, a couple of weeks ago, the district attorney declined to charge people who got into a gunfight in the middle of a street, in the middle of the day, because it was \"mutual combat\".",
      "author": "StonkToro",
      "created": 1636548997,
      "upvotes": 24,
      "replies": {
        "hk41vj7": {
          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk41vj7/",
          "text": "Pretty crazy considering Illinois doesn't acknowledge the existence of the 2nd amendment. I suspect though it is because that attorney didn't see a good chance of winning and their courts are underfunded as it is.",
          "author": "pointlessarguments3",
          "created": 1636575552,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hk3iqrs": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk3iqrs/",
      "text": "Man this is awful. Also Berkeley is apparently not much better.",
      "author": "DAthrowaway40403",
      "created": 1636568136,
      "upvotes": 5,
      "replies": {
        "hk44nkl": {
          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk44nkl/",
          "text": ">Berkeley is apparently not much better\n\nI am not sure about that. If you read  UCPD Daily Incident Reports for [yesterday](https://incidentreports.uchicago.edu/incidentReportArchive.php?reportDate=1636437600) alone, there were a motor vehicle theft, a hit & run, a shot fired incident ([30 shots within 10 seconds](https://abc7chicago.com/chicago-shooting-hyde-park-u-of-c-jahmal-cole/11218774/)), a criminal damage to vehicle, a homicide, a bomb threat, and an armed robbery, What did Berkeley have? Thanks to [the Clery Act](https://www.knowyourix.org/college-resources/clery-act/), you don't need to guess. You can just [look it up](https://ucpd.berkeley.edu/reports-data/daily-crime-log) (that is why even UChicago has a crime log despite its refusal to produce a common data set). No school can hide its campus crime incidents.",
          "author": "JJKKLL10243",
          "created": 1636576630,
          "upvotes": 6,
          "replies": {
            "hk46dsi": {
              "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk46dsi/",
              "text": "Just FYI, the crimes reported here are not just Hyde park, they’re all crimes in the UCPD patrol zone, which goes way farther north and way farther south than student actually live. So you gotta check which incidents happened where when you look at it. But Hyde park has definitely gotten worse this year.",
              "author": "SnooKiwis7945",
              "created": 1636577298,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk23411": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk23411/",
      "text": "There’s a parent group I’m on where someone has a similar vendetta against Ohio State.",
      "author": "jayphoward",
      "created": 1636545206,
      "upvotes": 1,
      "replies": {}
    },
    "hk2b21r": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk2b21r/",
      "text": "Why does him being Asian have anything to do with it?\n\nSomeone was killed, that's all that matters.",
      "author": "BoomTexan",
      "created": 1636549942,
      "upvotes": -12,
      "replies": {
        "hk2n0on": {
          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk2n0on/",
          "text": "I think it is because [two out of three killed  this year are Asian](https://www.reddit.com/r/uchicago/comments/qqcovs/another_asian_student_killed_during_a_robbery/).\n\n>[Three, actually. Yiran Fan in January, Max Lewis in July, and now this. RIP](https://www.reddit.com/r/uchicago/comments/qqe1yv/misleading_students_parents_and_staff_into/hjzs61j/?context=3).\n\n[​ Anti-Asian hate crimes rose 73% last year, updated FBI data says](https://www.nbcnews.com/news/asian-america/anti-asian-hate-crimes-rose-73-last-year-updated-fbi-data-says-rcna3741)\n\n​[With racial attacks on the rise, Asian Americans fear for their safety](https://www.npr.org/sections/health-shots/2021/10/13/1045746655/1-in-4-asian-americans-recently-feared-their-household-being-targeted-poll-finds)\n\nYou can find UChicago daily crime log [here](https://incidentreports.uchicago.edu/).",
          "author": "JJKKLL10243",
          "created": 1636555581,
          "upvotes": 36,
          "replies": {}
        },
        "hk420bk": {
          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk420bk/",
          "text": "The race does matter because hate crimes against Asians has increased since the pandemic started. It can be useful in identifying whether this was a hate crime or not.\n\nAlso as OP said , 2 of 3 killed have been asian. Points out a potential trend",
          "author": "pointlessarguments3",
          "created": 1636575603,
          "upvotes": 13,
          "replies": {}
        },
        "hk2kxxa": {
          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk2kxxa/",
          "text": "Facts bro",
          "author": "y33tyeetyeet",
          "created": 1636554676,
          "upvotes": -8,
          "replies": {}
        }
      }
    },
    "hk1e1vv": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk1e1vv/",
      "text": "Still gonna apply though, hope I don’t die",
      "author": "ScarAdvanced9562",
      "created": 1636525016,
      "upvotes": -16,
      "replies": {}
    },
    "hk2kprp": {
      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk2kprp/",
      "text": "UChiacgo has 14000 students. Average murder rate is 5 per 100.000 people in the US per year. Do the math.",
      "author": "Quantfieldgeek",
      "created": 1636554575,
      "upvotes": -9,
      "replies": {
        "hk2u9z3": {
          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk2u9z3/",
          "text": "Yeah, AVERAGE. Places like Wyoming and Idaho are going to bring it down. Chicago's murder rate is exponentially higher.",
          "author": "HeisenbergNokks",
          "created": 1636558582,
          "upvotes": 20,
          "replies": {
            "hk2uy62": {
              "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk2uy62/",
              "text": "Indeed, you are correct!! And since the average murder rate is 7.8 in the US, assuming that no other factors play a role (i.e young people are more likely to get murdered), roughly one current student at UChicago will get murdered per year. \n\nOf course, the murder rate in Chicago is 20.7/100.000 people. The reason we don’t see more murders of UChicago students is that most victims are involved in organized crime, and because of the increased security on campus.\n\nPeople REALLY are blowing this out of proportion. As a normal student at UChicago with no criminal connections, you’re equally as likely to be murdered as a student at NYU, Columbia, UPenn, Johns Hopkins, or any other university in a big city.",
              "author": "Quantfieldgeek",
              "created": 1636558851,
              "upvotes": -2,
              "replies": {
                "hk4rzya": {
                  "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk4rzya/",
                  "text": "No one’s arguing about the statistics. Of course there is always a risk of getting involved in such an incident no matter the state, or no matter the country for that matter. The issue is that the neighborhoods surrounding UChicago are not necessarily what you’d expect to be especially considering UChicago is a top tier institution. And it doesn’t help that the college administration as well as some diehard UChicago students downplaying the danger all because “statistically speaking” there is little to nothing to worry about. Yes there is also a risk in big cities, but at least those campuses aren’t surrounded by neighborhoods with insanely high murder rates.",
                  "author": "U_of_SOL",
                  "created": 1636585971,
                  "upvotes": 1,
                  "replies": {
                    "hk535if": {
                      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk535if/",
                      "text": "I think my post went past your head. The crime UChicago students are exposed to is no more than the average top tier institution. \n\nNYU and Columbia are also surrounded by high-crime neighborhoods.",
                      "author": "Quantfieldgeek",
                      "created": 1636590889,
                      "upvotes": 1,
                      "replies": {
                        "hk5b2by": {
                          "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk5b2by/",
                          "text": "Well if it would make you feel better I could make a whole other comment about the areas NYU and Columbia, but it’s not about those schools at the moment is it? It seems like OPs post went past your head lol. The original post in UChicago sub refers to how the school admin and some students are downplaying the dangers at UChicago and here we see 3 deaths that we know of related to the dangerous crime that is prevalent in that area.",
                          "author": "U_of_SOL",
                          "created": 1636594443,
                          "upvotes": 1,
                          "replies": {
                            "hk6lz8v": {
                              "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk6lz8v/",
                              "text": "But my point is that nobody is downplaying anything. You are all blowing it out of proportion and this happends proportionally at all schools in big cities. Saying that UChicago is ”dangerous” is outright ignorant",
                              "author": "Quantfieldgeek",
                              "created": 1636622028,
                              "upvotes": 1,
                              "replies": {
                                "hk6rwlj": {
                                  "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk6rwlj/",
                                  "text": "A lot of people on r/uchicago say otherwise. I'm just relating what people have said on that sub.",
                                  "author": "U_of_SOL",
                                  "created": 1636627187,
                                  "upvotes": 1,
                                  "replies": {
                                    "hk6ryjv": {
                                      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk6ryjv/",
                                      "text": "A lot of people tend to be wrong. Statistics are more important than how people ”feel”.",
                                      "author": "Quantfieldgeek",
                                      "created": 1636627231,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hk54ir0": {
                      "link": "/r/ApplyingToCollege/comments/qqngep/ruchicago_another_asian_student_killed_during_a/hk54ir0/",
                      "text": "It feels weird to me to complain that people use statistics to argue their point - isn’t that better than highlighting a few specific incidents? \n\nBut in any case the consensus among Uchicago students is that it’s gotten much worse this year, and this is consistent with crime stats across the country. People aren’t really saying these shootings are nothing to worry about, or that Hyde park is safe at this moment. But what they are saying is that this year hasn’t been normal.",
                      "author": "SnooKiwis7945",
                      "created": 1636591501,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}