{
  "sid": "q8rfs4",
  "link": "/r/ApplyingToCollege/comments/q8rfs4/do_colleges_like_it_more_if_you_graduate_early_or/",
  "title:": "Do colleges like it more if you graduate early or stay your senior year and take more rigorous courses?",
  "text": "^",
  "author": "OMWTCL",
  "created": 1634313598,
  "updated": 1634331333,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hgr3vtx": {
      "link": "/r/ApplyingToCollege/comments/q8rfs4/do_colleges_like_it_more_if_you_graduate_early_or/hgr3vtx/",
      "text": "You don't get any bonus points for graduating early, and you'll still be competing with people who had all four years of HS, and everything that comes along with that (an extra year of ECs, awards, courses, etc.)",
      "author": "freeport_aidan",
      "created": 1634313683,
      "upvotes": 21,
      "replies": {
        "hgr4f6y": {
          "link": "/r/ApplyingToCollege/comments/q8rfs4/do_colleges_like_it_more_if_you_graduate_early_or/hgr4f6y/",
          "text": "I figured this. My mom thought it would be better to graduate early rather than stay my senior year.",
          "author": "OMWTCL",
          "created": 1634313903,
          "upvotes": 5,
          "replies": {
            "hgr5o2g": {
              "link": "/r/ApplyingToCollege/comments/q8rfs4/do_colleges_like_it_more_if_you_graduate_early_or/hgr5o2g/",
              "text": "I mean, the reasons I listed doesn't mean it's *worse* to graduate a year early, it just means that there are other things to take into consideration.\n\nIt might still make sense to graduate a year early (graduating from HS early means you get out into the workforce a year earlier), but you've got to think about things like whether or not you could spend senior year taking a ton of AP/DE credits, which might help you save money and graduate from college early (even better than graduating HS early)\n\nThat's just one consideration, but there's a ton of other stuff you could (and should) think about as well",
              "author": "freeport_aidan",
              "created": 1634314417,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hgr7155": {
      "link": "/r/ApplyingToCollege/comments/q8rfs4/do_colleges_like_it_more_if_you_graduate_early_or/hgr7155/",
      "text": "I was told by a respected college consultant that it will harm more than help if you graduate early. \n\nColleges don’t want 17 year old freshmen. Graduating one year early does not make you a child genius. \n\nThey want to see what you did with your time after you’ve maxed out your classes. Did you go take college classes? Online courses? Work? In other words, no matter how smart you are, even if you’ve already taken every class in your high school, there is still more you can do and they know that.\n\nETA: of course this only applies to T60 or so colleges. If you’re planning to go to your non-flagship stage college, it probably won’t make that much of a difference.",
      "author": "SpacerCat",
      "created": 1634314979,
      "upvotes": 4,
      "replies": {
        "hgr9jq7": {
          "link": "/r/ApplyingToCollege/comments/q8rfs4/do_colleges_like_it_more_if_you_graduate_early_or/hgr9jq7/",
          "text": "I took 4 years of high school and I’ll still be a 17 year old freshman lol",
          "author": "High-Quality-Usernam",
          "created": 1634316016,
          "upvotes": -1,
          "replies": {
            "hgrhx2d": {
              "link": "/r/ApplyingToCollege/comments/q8rfs4/do_colleges_like_it_more_if_you_graduate_early_or/hgrhx2d/",
              "text": "Well, that’s clearly not what I was talking about. :) you’ll turn 18 before the end of the first half of your first year.",
              "author": "SpacerCat",
              "created": 1634319431,
              "upvotes": 0,
              "replies": {}
            },
            "hgr9qhg": {
              "link": "/r/ApplyingToCollege/comments/q8rfs4/do_colleges_like_it_more_if_you_graduate_early_or/hgr9qhg/",
              "text": "same lol #latebirthday",
              "author": "pulsar-beam",
              "created": 1634316094,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}