{
  "sid": "q7g7zk",
  "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/",
  "title:": "Junior in highschool and still absolutely lost. What are some things I NEED to know?",
  "text": "I've been chilling for the past 4 years of my life, not worrying about college or my future. Realized this is stupid and that its going to get me nowhere. I did not join any clubs, sports, but have however kept my grades up and taken a few APs. As I get closer to my senior year, I'm given all of this information that I've never even heard about. How grades alone dont get you much, and how colleges value a multitude of things other than intelligence. I missed the PSAT for this year, and Im looking to take an alternate date. I know what I want to do in the future, but I'm just so lost in what I actually should be doing. Is it already too late for me to do certain things, and if so, what are the things I can do? Does anyone have tips or ideas on what I should be focusing on? If you need more context/info, feel free to ask.",
  "author": "Academic-Chance-4240",
  "created": 1634146341,
  "updated": 1634167050,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hgidgrt": {
      "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgidgrt/",
      "text": "To start what do you want to do? It is not too late to do activities. Do two activities directly related to your field of choice, do one for pure fun and another in a different field/volunteering. And with those activities go deep, if the available clubs don’t work for you move them to work for you or make new clubs. Though it also depends on your chosen field of interest.",
      "author": "TritonTheCat",
      "created": 1634147496,
      "upvotes": 5,
      "replies": {
        "hgif0jq": {
          "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgif0jq/",
          "text": "Have been struggling on what I wanted to do for a while. and I'm still unsure. I've decided on learning coding/programming for now, though I'm only learning alone through online resources. I've looked into internships but most require qualifications that I don't meet or are not related to what I'm interested in. Other than clubs or sports at school, is there anything that would count as extracirricular outside of school? If not, I 'm willing to force myself to join a club.",
          "author": "Academic-Chance-4240",
          "created": 1634148112,
          "upvotes": 3,
          "replies": {
            "hgj6rt8": {
              "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgj6rt8/",
              "text": "You could do something like a personal project. Something like making a personal productivity tool or something that interests you personally. Though joining clubs is recommended.",
              "author": "TritonTheCat",
              "created": 1634159405,
              "upvotes": 1,
              "replies": {}
            },
            "hgjmx2d": {
              "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgjmx2d/",
              "text": "> The Common App says that extracurricular activities \"include arts, athletics, clubs, employment, personal commitments, and other pursuits.\" Almost anything that you are actively and productively involved in can be considered an extracurricular activity\n\nhttps://blog.prepscholar.com/what-are-extracurricular-activities-and-why-do-you-need-them\n\nAnything you do outside of school can be an extracurricular. My extracurriculars include moderating subreddits, chess, birdwatching, arguing with rаcists on Reddit (joke) and programming. Not particularly interesting or amazing stuff. I’m not curing cancer in an internship or in leadership for any club or participating in competitions. Most people aren’t. \n\nYou are fine :)\n\nThis sub will make it seem like you are so far behind, but you really aren’t at all.\n\nBut, you should definitely join some clubs. Or, better yet, start one! You could start an environmental conservation club, coding club, business club, math tutor club, literally anything. That’s one thing I wish I knew sophomore/junior year. You could also join Key Club and Honors Societies.",
              "author": "Voldemort57",
              "created": 1634166539,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgief71": {
      "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgief71/",
      "text": "Hi! I was in the same boat as you during my junior and senior year of high school, so I'll try and give you some advice.\n\nPSAT scores won't really affect anything unless you get a high enough score to qualify for a national merit scholarship. It's still pretty good practice for the SAT though. Also, if you can, take the SAT/ACT multiple times since some schools will let you superscore. \n\nIt's somewhat true that grades will not get you much. However, colleges will also look at what type of classes you take. Those that have taken AP/DE classes and kept their grades up will have a better chance than someone who hasn't (not taking ECs into consideration at least). If you haven't already, try and see if you can add some AP/DE classes to your list.\n\nIt's never too late to join stuff, something is better than nothing. I never really did anything or joined any clubs in my high school years (mostly because I was online schooling) For example, volunteering added activities to my list.\n\nIf you haven't already, start researching what colleges you want to go to. Some community colleges offer a program that will let you transfer to a partnered state university after you get an A.A degree (usually just one year, but could be less).",
      "author": "txicab",
      "created": 1634147871,
      "upvotes": 3,
      "replies": {
        "hgifzkd": {
          "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgifzkd/",
          "text": "I'm mainly looking to do the PSAT for practice, as I won't be completely unprepared when time comes to take the actual test. I wasn't aware of the importance extracirriculars bring to the table until a friend of mine struggled applying to certain colleges. I know what career field I want to get into (software engineering or gamd developing) and I'm really fine getting into any of the UCs. \nI have done barely any researching into colleges/universities other than what I learned about in a college prep summer program. \nGenerally, I'm just lost when it comes to what colleges want and what I need to do. None of the clubs at school interest me. nor are related to any career field I'd like to pursue. Are there any activities I can do outside of school to replace this? \nAlso, do you have any links to resources that could tell me more about college? or is that something I'm better off talking to my counselor about.",
          "author": "Academic-Chance-4240",
          "created": 1634148504,
          "upvotes": 3,
          "replies": {
            "hgiizol": {
              "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgiizol/",
              "text": "Talking to your advisors would be a good idea. A lot of times, colleges will also have a page listing things they expect from applicants, so check those.\n\nThe activities in/outside of school don't really have to be related to what you want to pursue. Colleges just like to see that you're doing something. Activities that you can do outside of school depend on what's available near you, so I can't give you much advice on that other than to just search (volunteering would be a good search term).",
              "author": "txicab",
              "created": 1634149727,
              "upvotes": 1,
              "replies": {
                "hgijlqy": {
                  "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgijlqy/",
                  "text": "Could you give examples? Can it really be anything? Such as a personal hobby like biking, weight lifting, or swimming? Does it have to be with an official organization/company like a public library, a internship, or outsidd club/school?",
                  "author": "Academic-Chance-4240",
                  "created": 1634149975,
                  "upvotes": 1,
                  "replies": {
                    "hgik1ok": {
                      "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgik1ok/",
                      "text": "Yes! Personal hobbies such as the ones you listed would count as activities, and they also show that you have personality. They don't have to be part of an official organization. I put cooking/baking down for my hobbies.",
                      "author": "txicab",
                      "created": 1634150151,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgje99v": {
      "link": "/r/ApplyingToCollege/comments/q7g7zk/junior_in_highschool_and_still_absolutely_lost/hgje99v/",
      "text": "have a serious convo with whoever supports you financially (if any) about your financial circumstances, so you know if there might be any limitations on what you can afford. THEN research colleges that are ideal for your major and personality. if you have a #1 (somewhere you would undoubtedly ED if u could), find less selective, similar/comparable colleges as safeties. that way, your backups are still somewhere you would love.",
      "author": "gocrazyg0stupid",
      "created": 1634162621,
      "upvotes": 1,
      "replies": {}
    }
  }
}