{
  "sid": "qxz3yt",
  "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/",
  "title:": "Huge Mistake on UC App",
  "text": "Ok, so this is pretty bad. I submitted my Uc Apps earlier today thinking that I should be proactive and get this application out of the way. Then after I looked over my application again after submitting, I realized I made a grave mistake on the activities section. I served on the “Youth” Board of Directors at this non profit, but I simply stated Board of Directors. I forgot to put “youth” which is probably the most important 5 letter word in this. I did mention this activity as being “youth” later in the essay, but I am afraid they might accuse me of misrepresenting myself on the application. I contacted the application center, but all they told me was that you can’t make corrections to the activities section of the UC app. UC Campuses don’t even allow me to individually contact them to let them know about this mistake. I don’t know what to do. I really put a lot of work into the UC app and now I am afraid they might even come after me for misrepresenting myself. What should I do? This is so stressful.",
  "author": "GrassComfortable6626",
  "created": 1637387670,
  "updated": 1637688502,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlcuinr": {
      "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/hlcuinr/",
      "text": "Don’t worry - it is not as big a mistake as you think. Especially as you mentioned it in essay later.",
      "author": "svday",
      "created": 1637387998,
      "upvotes": 5,
      "replies": {
        "hlcuucv": {
          "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/hlcuucv/",
          "text": "I really hope so. Last thing I want is them contacting my school and telling admin I misrepresented myself on the UC application. Then all hell breaking loose, and my college counselor auditing my application with a fine tooth comb.",
          "author": "GrassComfortable6626",
          "created": 1637388218,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlcvw9i": {
      "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/hlcvw9i/",
      "text": "Don’t worry.",
      "author": "TwoSuns168",
      "created": 1637388964,
      "upvotes": 3,
      "replies": {
        "hlcw5qc": {
          "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/hlcw5qc/",
          "text": "I did contact application center so I can have email correspondence in case they come after me. I can claim I did everything in my power to correct this mistake.",
          "author": "GrassComfortable6626",
          "created": 1637389151,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlcym6p": {
      "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/hlcym6p/",
      "text": "You seem to be afraid that they’re going to “come after” you for it. First of all, this might sound backhanded, but these people really don’t have the time to come after you. Especially, since you corrected yourself further down the line, and emailed them trying to correct your mistake. For the most part, the mistake is not giant. Like a referenced earlier, most of these admissions staff do not have the time, so it is typical of them skim through essays before reading it in-depth. Therefore, they should understand that it is the youth board of directors before actually fully reading it.",
      "author": "TFATFA1",
      "created": 1637390956,
      "upvotes": 3,
      "replies": {
        "hlcyw58": {
          "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/hlcyw58/",
          "text": "Ok, thank you. I mean them coming after me and reporting me is a secondary concern. I am fairly confident I can reason with them if they do. My primary concern was them thinking I was fabricating my application. And me getting rejected because of some stupid error in my activities list. Worse, they might contact the organization.",
          "author": "GrassComfortable6626",
          "created": 1637391162,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hldkyjq": {
      "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/hldkyjq/",
      "text": "Don't worry. Let it go",
      "author": "skieurope12",
      "created": 1637409739,
      "upvotes": 2,
      "replies": {}
    },
    "hlh9ouy": {
      "link": "/r/ApplyingToCollege/comments/qxz3yt/huge_mistake_on_uc_app/hlh9ouy/",
      "text": "You mentioned it later on in the essay. You should be fine. If they do say you misrepresented yourself just point out that it was an easy to make error that you clarified later in the essay",
      "author": "Pattywackist",
      "created": 1637474886,
      "upvotes": 1,
      "replies": {}
    }
  }
}