{
  "sid": "q8ry2i",
  "link": "/r/ApplyingToCollege/comments/q8ry2i/no_aps_how_fucked_am_i/",
  "title:": "No APs how fucked am I?",
  "text": "I took one honor junior year and two honors senior year in an award winning rigorous school. Totally completely regret that I wasn’t confident enough in my abilities to stand up to parents and guidance counselor who didn’t want me to take APs or more honors. My highest reach school is Purdue undecided for spring semester. I know they look less at GPA and more at course rigor. Is this a dealbreaker?",
  "author": "anon8403",
  "created": 1634315059,
  "updated": 1634331354,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hgrigu8": {
      "link": "/r/ApplyingToCollege/comments/q8ry2i/no_aps_how_fucked_am_i/hgrigu8/",
      "text": "I don’t think you’re screwed without APs at all. From someone with the exact opposite situation, I don’t think APs really enhance my application that much. Those types of courses just go to show that you chose rigor in your coursework, but if your school is known to be rigorous than your rigor will show. I saw your comment about your 1520 SAT, so I think colleges will definitely see that you’re smart regardless of the amount of APs you took. Definitely report that SAT score. And try to be confident. Not many schools offer a million APs so colleges aren’t expecting that. Hope this helps:)",
      "author": "NayNay6302",
      "created": 1634319656,
      "upvotes": 5,
      "replies": {
        "hgrqjyh": {
          "link": "/r/ApplyingToCollege/comments/q8ry2i/no_aps_how_fucked_am_i/hgrqjyh/",
          "text": "It’s 1250 lol but that is comforting to hear. Ty sm.",
          "author": "anon8403",
          "created": 1634322973,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgr8915": {
      "link": "/r/ApplyingToCollege/comments/q8ry2i/no_aps_how_fucked_am_i/hgr8915/",
      "text": "Depends on your tests and how strong they are if you took them. Strong tests can help and show that you are a strong student with poor counselors. There are also many other schools that have successful grad you will have to work harder in college tho.",
      "author": "TritonTheCat",
      "created": 1634315481,
      "upvotes": 2,
      "replies": {
        "hgrh1wm": {
          "link": "/r/ApplyingToCollege/comments/q8ry2i/no_aps_how_fucked_am_i/hgrh1wm/",
          "text": "1250? Not too awful for undecided",
          "author": "anon8403",
          "created": 1634319081,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}