{
  "sid": "qkam6x",
  "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/",
  "title:": "A Case for WashU",
  "text": "I too am a sophomore that goes to WashU, and I completely agree that you should weigh your decision before applying/committing here. It's worth hearing both sides of the argument, and I thought I might as well give WashU some kind of fighting chance on this sub :\\^0\n\nBefore I get into it, I will be honest and say that I had an absolutely miserable freshman year. I hated it here so much, and that was difficult to cope with because I had basically grinded through all of high school just to be at this goddamn school. Every hard day had me wanting to start a transfer app. Luckily, my sophomore year has been exponentially better, and this is very much due to the let up in COVID restrictions. I'm pretty sure every institution during the 2020-2021 school yr was just a shittier version of itself. My freshman year was mostly me sitting on my ass all day thinking that this school had nothing to offer me. \n\nNot to say everything is back to normal, but WashU has been slowly coming back alive, and from that I've learned that college really is what you make of it.  WashU, whether you agree or not, is a top institution with a ton of money to spend on improvement. We have impressive faculty, research/career opportunities, and infrastructure. Not to say that it's a utopia, but it's also not too shabby, and definitely not jank enough to be unconditionally complaining about. \n\n**1. Social Life/Things to do in STL**\n\nYes, there is definitely a club/bar scene that requires you to drop a decent amount of money on Ubers/covers. Still, it's not your only option if you want to go out. There are plenty of house parties that people throw and mixers that various clubs/sports teams organize that require no money at all. You're not obligated to go to some random bar every night if that's not what you want to do - it won't ever be your only option, and no one will force you to go. \n\nI actually think the party scene at WashU is healthy, and it fits what I want out of my own social life. Someone once told me that the kids here are basically just nerds that just learned how to party, and that's a pretty accurate description of what goes down here. Literally no one cares if you don't drink / smoke, but a decent amount of people do (sometimes that shit surprises you,,, like when you see that rlly smart guy in your comp sci class blasted & you would have never expected it lmao). We don't have ragers, and maybe in comparison to state schools it's tame, but there's still a presence and you very much can find things do on a Thursday/Friday/Saturday night. \n\nAlso! It might be hard to believe, but STL is actually a pretty cool city. Clayton itself - the suburb that WashU is in - is also adorable, and allows for WashU to exist in both the suburbs and the city. The metro is easy to take (it literally only goes in two directions so anyone can realistically figure it out). There are plenty of cheap things to do around here, such as free events, cultural spaces, cute neighborhoods, etc. I'm a thrifting bitch, and I'm actually surprised at how many thrift stores there are - from exploring those, I've also found really cute local businesses and definitely some really good food (STL is known to be a foodie city and that's definitely true).  There are a decent number of freshman, and especially sophomores, who have their cars on campus. You will inevitably make friends with people that do, which makes Ubering a lot less necessary. I've only had to take an Uber a handful of times, and that was only because we had no DDs. \n\nOverall, I think the social scene here is geared towards a specific niche of people. And sometimes it doesn't come easy, but most things never usually do. You do have to make an effort, such as joining clubs, or talking to upperclassmen, or reaching out to people that you find cool, but all of that is just part of expanding your community and something that you would have to do at any school. Still, if your personality fits WashU's type, you will enjoy your time here. There will always be something to do, whether it be day or night ( & it can't always be night aha). \n\n**2. Campus / General Vibe**\n\nYes, there are some people here who are loaded. I come from an upperclass neighborhood, and even then the way some people here treat money genuinely shocks me. But (not to make any excuses, but will make this one) this is a commonality at any top university. And while WashU is admittedly late to correcting for that, we have gone need-blind, and I would think, are making an effort. I would also say most people are very much aware of their socioeconomic status, and are generally considerate of all situations. No one is ever persecuted for their financial circumstances and while yes, sometimes the affluence peeks through, it's not some all-mighty force that dictates everything.\n\nThe facilities are nice. I don't really know how anyone can argue otherwise about this campus. WashU puts in a ridiculous amount of money to upgrade and maintain buildings. Their flower budget is literally around a million dollars. It's an objectively pretty place. There are also two gyms that are fairly solid for a D3 school, and one of which always has at least one bench open, for anyone wondering. The biggest library closes at 9PM, which sucks, but this is more due to COVID than anything else (it used to be open 24/7 - also, there are plenty of other buildings that are accessible late at night). Food isn't Michelin star quality, I agree, but there's always a decent meal, which I would say is pretty good for college dining. WashU also brings food trucks to campus, has daily dining specials/events, consistently hosts local restaurants to serve their food, and has a number of dining halls that all offer different options. COVID has also messed with what is provided (dining staff shortages being a big issue), but I would say they still make an effort. \n\nOne thing I can't rebut is the prices,,, I'm like 200 under on meal points how did this happen >:\\^%%.\n\n**3. People**\n\nTrust that WashU has the least school spirit out of any place ever lmfao. I actually don't think I've met anyone who is some hardcore stan, but most people are pretty happy all the same. Like any other institution, we all have our grievances about one thing or another; we definitely are not blindly praising Andrew Martin and all that he has done for us. There's no Kool-Aid here and definitely no groupthink, tf. \n\nI've definitely had my own complaints about the people here. My freshman year was filled with some really fucking weird characters, but I also didn't make any real effort to meet anyone else. After branching out, I've found that people here are friendly and are usually down to hang or get to know you. There are still some people who are pretentious / shallow, but they aren't people that you have to spend time with. My class (2024) in particular is a bit closed off, but I think that's more of COVID forcing us to form cliques/groups than anything else. The freshman though??? Those bitches are so nice and will literally talk to anyone, which I think is probably representative of what WashU kids are normally like. We are known to be collaborative with a little bit of adopted Midwestern nice. \n\nYes, there are rich people. It is an issue that WashU has recognized and that the entire student body is conscious of. Some people could not give a shit, but most here are thoughtful. Your socioeconomic status will never be a factor in any social / academic situation.\n\n**4. Internships / Career Opportunities**\n\nI'm not sure what to tell you. At the end of the day, WashU is an impressive school to go to, and while it has the worst brand name recognition, companies & other higher education institutions undoubtedly know what it is. I don't know anyone who has struggled to secure a position that they wanted, and most people I know are doing very impressive things. Even with that, you shouldn't expect name alone to get you in. \n\n***5. CONCLUSION***\n\nWith every school that you apply to/get into to, fit should be a deciding factor. Every school is different, and in most cases, match is way more important than prestige. With that, college is very much what you want to get out of it. You have to put in effort, whether you like to or not, and while some things are up to chance, most are controlled by your own decisions. Regardless, university can be the best four years of your life, but also, it's just school. It's just four years. Like, it's not going to be perfect, and honestly, if it is, then where's the character development anyway. College is just . life . basically. There's ups and downs (lots & lots,,, you'd be surprised how fast time passes here), and you're going to have to deal with that. Sure, some of it can be due to the institution, but some of it might also be coming from yourself. \n\nAll in all, WashU is not perfect. No one here will argue that it is. Especially considering COVID, my college experience has definitely been tainted. But WashU has offered me a lot, and I really don't think there's a better school that I would fit with. Kids here maintain a good balance of school and having fun - the parties will never be as crazy as state universities, but they make sense for WashU students. The quality of life here is also unmatched, and while people here can be toss up, most are generally looking for a connection. The academics are also good, and profs / advisors usually care about their students. \n\nI know people like to dunk on WashU, and valid, but I think it can be a great school for the right person. feel free to dm if u have any questions !!!",
  "author": "apsuffer",
  "created": 1635760674,
  "updated": 1636150697,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.96,
  "comments": {
    "hivsnng": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hivsnng/",
      "text": ">I know people like to dunk on WashU\n\nnah, people just like to dunk on u/ssssseabass. Thanks for your input.",
      "author": "U_of_SOL",
      "created": 1635774241,
      "upvotes": 1,
      "replies": {
        "hivsz82": {
          "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hivsz82/",
          "text": "Nah the WashU hate came long before I did",
          "author": "ssssseabass",
          "created": 1635774402,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hivt8uh": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hivt8uh/",
      "text": "What prompted this post lmao",
      "author": "CLOWN_ALERTO",
      "created": 1635774536,
      "upvotes": 1,
      "replies": {
        "hivydea": {
          "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hivydea/",
          "text": "I think we all know what",
          "author": "-IndigoMist-",
          "created": 1635776972,
          "upvotes": 1,
          "replies": {
            "hiw23bl": {
              "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiw23bl/",
              "text": ">u/ssssseabass\n\ni dont know pls tell",
              "author": "nd034",
              "created": 1635778655,
              "upvotes": 4,
              "replies": {
                "hiw3jdn": {
                  "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiw3jdn/",
                  "text": "The other post that was like \"Dont apply to WashU\" prompted this",
                  "author": "ssssseabass",
                  "created": 1635779320,
                  "upvotes": 25,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiwk4pz": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiwk4pz/",
      "text": "Lmao bruh let’s just rename this place \nr/fightaboutwashU",
      "author": "chumer_ranion",
      "created": 1635786494,
      "upvotes": 54,
      "replies": {
        "hiy9og2": {
          "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiy9og2/",
          "text": "“1 member, 3 online” 😂",
          "author": "Berkeley_Simp",
          "created": 1635812277,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "hixlefd": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hixlefd/",
      "text": "Where did WashU hate start? Like just from what I've seen about it outside of this subreddit its like my second choice school, and some words from internet strangers hasn't really changed that, but I'm curious why it seems to be the most disliked t20.",
      "author": "EffectiveCustard",
      "created": 1635801717,
      "upvotes": 12,
      "replies": {
        "hixow4v": {
          "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hixow4v/",
          "text": "It's probably the least well known T20 when considering the average American individual.\n\nThe school by all means deserves to be ranked 14th -- but people on A2C are so obsessed with people knowing where they went to school and validating them (which i totally get) that they dislike any school they don't know. This affects Rice and Vandy too, but it seems that WashU earned itself the top spot in that ranking.\n\nTheir thinking is flawed anyway because like 90% of this sub hails from either coast, where WashU has meh name recognition, but I can tell you it's VERY well known and highly respected by those who live in the Midwest and anyone who works in academia/other competitive industries, especially medicine.\n\nBut i really don't get why this sub hates the school as much as they do. People think that going to the T20 with the 2nd best campus, 2nd best food, and best dorms is \"coping\" with being rejected from the T10s -- now this I don't understand whatsoever.\n\nOh and people hate St Louis a lot, which is sad because everybody here is so nice and proud of their city. Not to mention everything here is DELICIOUS and costs like 1/3rd of what the equivalent would cost in either coast. And those scary crime statistics are misinterpreted due to the very small size of St Louis City itself, when factoring in the suburbs (where WashU is) the crime rate drops down to around that of other major US cities",
          "author": "ssssseabass",
          "created": 1635803164,
          "upvotes": 20,
          "replies": {
            "hixsv46": {
              "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hixsv46/",
              "text": "I think it’s primarily to do with location honestly.  It wasn’t so long ago that WashU was ranked within the top 10 semi-regularly, and Rice certainly has less name recognition nationally (if you ask me) but is the butt of fewer jokes/less criticism. \n\nMissouri is just one of those states people tend to avoid at all costs—more so even than Texas or Tennessee.",
              "author": "chumer_ranion",
              "created": 1635804855,
              "upvotes": 14,
              "replies": {
                "hixyrmg": {
                  "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hixyrmg/",
                  "text": "It’s sad because STL is definitely underrated like many other midwest cities, and I say this as someone from Cali who now goes to WashU. One can rail WashU for many things but STL honestly shouldn’t be so high on the drawbacks list IMO\n\nNow I’d still prefer to have a career in Cali but that’s mostly because my family resides in the Bay, otherwise I’d be more than content living here esp knowing it won’t cost me an arm and a leg just to exist like it would in HCOL areas\n\nPeople back home think I go to school in a no-questions-asked shithole surrounded by even more shithole & worry about being shot or mugged all day (along with coded racism worrying about my safety because of “those people”) but like all hyperbole it’s not very close to reality. Even if one were to just stay on campus all four years of college, WashU isn’t even that close to downtown to begin with where all the shit goes down, among other sketch areas. Coastal elitism for ya",
                  "author": "MundyyyT",
                  "created": 1635807432,
                  "upvotes": 10,
                  "replies": {}
                },
                "hixtyyo": {
                  "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hixtyyo/",
                  "text": "That's probably right, I remember feeling that before moving here.\n\nBut in all honesty it's not much different than Virginia was tbh. Just cheaper prices and a few more Republicans",
                  "author": "ssssseabass",
                  "created": 1635805339,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hixzdz1": {
              "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hixzdz1/",
              "text": "i agree with you on very few things, this is one of them\n\nhonestly most ppl i’ve met here who want to transfer out are only here bc of prestige whoring gone wrong (i.e highest ranked school they got into and they went w/o question bc of that). \n\na lot of ppl here who i’ve met def applied to a bunch of T10s or other T20s but they came here for reasons other than US News and they’re consequently a lot happier, and no it’s not just the premed kids, it’s kids in “weaker” WashU majors ranking-wise like MechE, EE, CS, Physics, etc",
              "author": "MundyyyT",
              "created": 1635807701,
              "upvotes": 5,
              "replies": {}
            },
            "hixqlm4": {
              "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hixqlm4/",
              "text": ">It's probably the least well known T20 when considering the average American individual.\n\nND is more unknown (at least before ACB)",
              "author": "HahaStoleUrName",
              "created": 1635803885,
              "upvotes": 1,
              "replies": {
                "hixrgjz": {
                  "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hixrgjz/",
                  "text": "Nah it's much more well known because of their football team.\n\nWithout it they'd be just like WashU -- academically amazing but not recognized by the general population outside of the Midwest",
                  "author": "ssssseabass",
                  "created": 1635804247,
                  "upvotes": 11,
                  "replies": {
                    "hiy0tzm": {
                      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiy0tzm/",
                      "text": "First time I heard about them outside of school was with Amy Coney Berret",
                      "author": "HahaStoleUrName",
                      "created": 1635808337,
                      "upvotes": -2,
                      "replies": {
                        "hiy0y2g": {
                          "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiy0y2g/",
                          "text": "WELP that aint a nice way to be recognized",
                          "author": "ssssseabass",
                          "created": 1635808387,
                          "upvotes": 1,
                          "replies": {
                            "hiybo95": {
                              "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiybo95/",
                              "text": "Wdym she is a completely unbiased judge who will better the country.\n\n\n/s",
                              "author": "HahaStoleUrName",
                              "created": 1635813159,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hiwvinc": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiwvinc/",
      "text": "honestly fuck this post, it's gonna drive down the acceptance rate again /s\n\nbut yeah congratulations A2C for taking one random sophomore's experience at washu as gospel. don't take this one as gospel either b/c it's also anecdotal but still good to get an n != 1 opinion lmao",
      "author": "MundyyyT",
      "created": 1635791179,
      "upvotes": 44,
      "replies": {}
    },
    "hiz6e0i": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiz6e0i/",
      "text": "I’m a first-year CS student loving WashU\n\nEveryone I’ve met is genuinely happy to be here. The only people who’d complain about a school like this would complain about anything lmao\n\nHappy to answer questions too. Best wishes!",
      "author": "mjspark",
      "created": 1635828648,
      "upvotes": 7,
      "replies": {
        "hiz88j2": {
          "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiz88j2/",
          "text": "[deleted]",
          "author": null,
          "created": 1635829948,
          "upvotes": 1,
          "replies": {
            "hizbc95": {
              "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hizbc95/",
              "text": "Reddit A2C is an awful dataset for real-world college opinions lmao",
              "author": "mjspark",
              "created": 1635832259,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hiw2g0w": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiw2g0w/",
      "text": "Emory - St. Louis Campus",
      "author": "BearMeyer",
      "created": 1635778817,
      "upvotes": 18,
      "replies": {}
    },
    "hiwpcmu": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiwpcmu/",
      "text": "WashU was catching strays this entire year lmao. Nice to see something different.",
      "author": "DerpDerper909",
      "created": 1635788644,
      "upvotes": 10,
      "replies": {}
    },
    "hiwmej3": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiwmej3/",
      "text": "copium",
      "author": "tcswagz",
      "created": 1635787439,
      "upvotes": 10,
      "replies": {}
    },
    "hj2z4yu": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hj2z4yu/",
      "text": "Graduated biochem pre-med last December from WashU and I had an incredible experience and agree with this post 100%. I also think it gave me a very well rounded education and really prepared me for applying to medical schools. I’m happy to talk to anyone about my experience (the good and bad), but do admit my bias because I would choose to go here all over again.",
      "author": "born2bewilder",
      "created": 1635898071,
      "upvotes": 2,
      "replies": {}
    },
    "hiwl6hv": {
      "link": "/r/ApplyingToCollege/comments/qkam6x/a_case_for_washu/hiwl6hv/",
      "text": "Glad I read this. WashU is the last app for me to submit.",
      "author": "GodDammitGrigori",
      "created": 1635786931,
      "upvotes": 2,
      "replies": {}
    }
  }
}