{
  "sid": "qpu10o",
  "link": "/r/ApplyingToCollege/comments/qpu10o/transcript_question/",
  "title:": "Transcript Question",
  "text": "I'm applying rd to some t20 schools, however, I have quite a serious problem. Basically, I spent freshman and sophomore year at the top hs in my city which requires an entrance exam, and I had really really bad grades.\n\n My average was 74/100, with good grades in history (93+) English (85+) but poor grades in everything else. \n\nI transferred to a private HS, my grades at my new HS are 94/100 junior year, and 99/100 for quarter 1 of this school year, SAT is great (1450, super score 1510), and I self-studied 3 APS, took 2 college courses, and have a bunch of great ECs (captain of 2 varsity sports team, captain of quizbowl, made 5k downloads app and small e-commerce business with 20k revenue). \n\nIs there any way I can send one transcript, or will they look at both? Can I make up for it with a high SAT/ACT score, I'm predicting a 35 for the Oct 23 act, and will study my hardest to get 35 or 36 for the December one.",
  "author": "Journey1620",
  "created": 1636426187,
  "updated": 1636653556,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjw910c": {
      "link": "/r/ApplyingToCollege/comments/qpu10o/transcript_question/hjw910c/",
      "text": "Most colleges will need to see your official transcripts from 9th through 11th grades. The upward trend in grades will be in your favor.",
      "author": "jjhoster",
      "created": 1636430531,
      "upvotes": 2,
      "replies": {
        "hjx9uru": {
          "link": "/r/ApplyingToCollege/comments/qpu10o/transcript_question/hjx9uru/",
          "text": "which ones won't need to see these grades?",
          "author": "Journey1620",
          "created": 1636457285,
          "upvotes": 1,
          "replies": {}
        },
        "hjxhlmo": {
          "link": "/r/ApplyingToCollege/comments/qpu10o/transcript_question/hjxhlmo/",
          "text": "but realistically, I'm out of the race for t-20s, right?",
          "author": "Journey1620",
          "created": 1636462337,
          "upvotes": 1,
          "replies": {
            "hjxutqr": {
              "link": "/r/ApplyingToCollege/comments/qpu10o/transcript_question/hjxutqr/",
              "text": "“T20” schools are the ones which reject the large majority of applicants, so they’re reach schools for just about every student. Feel free to apply to some of them. But you also need to apply to colleges with more reasonable acceptance rates, such as those which admit 50%+ of their applicants.",
              "author": "jjhoster",
              "created": 1636468997,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}