{
  "sid": "qrcmvg",
  "link": "/r/ApplyingToCollege/comments/qrcmvg/worried_i_chose_the_wrong_major_please_help_me_out/",
  "title:": "Worried I chose the wrong major please help me out",
  "text": "I applied to all my schools for Data Science, currently taking AP Statistics and doing really bad(worse than I’ve ever done in any class). Is this a problem?",
  "author": "twich1344",
  "created": 1636604298,
  "updated": 1636652848,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk6v966": {
      "link": "/r/ApplyingToCollege/comments/qrcmvg/worried_i_chose_the_wrong_major_please_help_me_out/hk6v966/",
      "text": "Data Science is heavy stats (and programming). It’s okay if you’re bad, you can definitely improve. But at this point you have to ask yourself if you’re going (and willing) to study more. \n\nIf it helps, I was super bad at AP Stats, and now I’m good at it. I just had a terrible teacher who wouldn’t bother explaining stuff (I was also chronically ill). But I also studied more. \n\nI also feel inclined to tell you that Data Science as a major is a double edged sword for two reasons: \n\n1. A lot of these schools just pump out Data Science as a new degree because it was popular, without taking the time to carefully design it. This would screw you over because then you won’t have the skills necessary to do the job. When you apply, you put what skills you have in list format. \n\n2. You’ll be stuck only applying to Data Analyst and Data Scientist positions because your major is Data Science. Data Science is extremely competitive, and mostly those with Master degrees get them. Unless you’re good at making social connections or just bum lucky, it’s gonna be hard for you. \n\nOther majors that are popular with Data Scientists: Economics, Statistics, other maths (Applied Math), Physics, and Computer Science. \n\nCS + a Statistics minor or CS+Stats double major is the most popular because Data Science, again requires programming (in Python or R) and statistics. \n\nFor the other majors, you’ll need a CS minor or learn programming on your own. \n\nIf you really want Data Science as a major, then go for it. But it’s not gonna give you a better chance than the other majors, especially with no Master’s.\n\nETA: no one really cares what your major is, as long as you have the skills needed at the level desired. When you apply to jobs, you rarely put your major down. Instead, you put your skill list down. If your Data Science program doesn’t teach you the skills, then you’ll have to learn them by yourself or switch majors.",
      "author": "Outherepoor",
      "created": 1636629814,
      "upvotes": 2,
      "replies": {}
    },
    "hk5y34r": {
      "link": "/r/ApplyingToCollege/comments/qrcmvg/worried_i_chose_the_wrong_major_please_help_me_out/hk5y34r/",
      "text": "Not all schools even admit by major, so it might not matter depending on where you applied\n\nAt other schools, its ranges from very easy to effectively impossible to change majors, so it'll also depend on where you applied and what you want to switch into\n\nAs an aside, I would not let your performance in one HS class dictate what you chose to study for the next four years. You could very well just have a bad teacher/not be grasping the material and be giving up on a subject you might come to love",
      "author": "freeport_aidan",
      "created": 1636605203,
      "upvotes": 1,
      "replies": {
        "hk5yp5n": {
          "link": "/r/ApplyingToCollege/comments/qrcmvg/worried_i_chose_the_wrong_major_please_help_me_out/hk5yp5n/",
          "text": "Probably gonna stick to that first option it just sucks that for all through the application process I thought this would be something that came easy to me and I had much to do with my career goals then I got to this class and it’s been really tough. I know that the majority of my class is struggling so I’m hoping it’s the teacher and that’s what I’m sticking with in my head.",
          "author": "twich1344",
          "created": 1636605532,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk61nrd": {
      "link": "/r/ApplyingToCollege/comments/qrcmvg/worried_i_chose_the_wrong_major_please_help_me_out/hk61nrd/",
      "text": "The real questions should be: \n\n1. Do I like what we are doing with stats, while things will be different in college a decent amount of the fundamentals will stay the same so do you still like it?\n\n2. Are you just doing poorly with grades or are you also failing to understand the content? It is an important distinction to make.",
      "author": "TritonTheCat",
      "created": 1636607193,
      "upvotes": 1,
      "replies": {}
    },
    "hk66mnr": {
      "link": "/r/ApplyingToCollege/comments/qrcmvg/worried_i_chose_the_wrong_major_please_help_me_out/hk66mnr/",
      "text": "I mean if you don’t get stats data science may not be a great major for you",
      "author": "redneck198412",
      "created": 1636610149,
      "upvotes": 1,
      "replies": {}
    },
    "hk6yfsm": {
      "link": "/r/ApplyingToCollege/comments/qrcmvg/worried_i_chose_the_wrong_major_please_help_me_out/hk6yfsm/",
      "text": "Believe it or not, you can change majors after being admitted. If you end up deciding Data Science isn’t for you, and if you think you want to switch to another competitive major, then you may want to take that into account when deciding which school to attend.",
      "author": "jayphoward",
      "created": 1636632133,
      "upvotes": 1,
      "replies": {}
    }
  }
}