{
  "sid": "q6angd",
  "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/",
  "title:": "Will not taking a foreign language affect my chances at top schools",
  "text": "So I’m a sophomore in high school and in Texas, you only need to take 2 years of a foreign language. I completed my first year of Spanish my 8th grade year and my second year of Spanish my freshmen year. I opted out of Spanish 3 because I was not interested in it under any circumstances and I instead wanted to pursue Japanese. I’ve been self teaching myself Japanese since my freshmen year (learned the basic writing systems in 6th grade so I already had a pretty good background). So far I’ve learned almost 400 words in the past few months, > 100 kanji and can understand 80% of kids shows (7 and under). My school only offers Japanese 1 and has no AP Japanese class so I was thinking of just taking the AP Japanese test my Junior year to show that I am still pursuing some form of a second language. I do plan on fluency by the time I graduate (hopefully I can pass jlpt 1 or 2).\n\nWill colleges see it as a bad thing that I didn’t take a language class past the requirement? I still plan on continuing Japanese well into my adult life, but I want a realistic view on how colleges will view this.",
  "author": "Luv_Luyxoxo",
  "created": 1634001247,
  "updated": 1634072824,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.81,
  "comments": {
    "hgaucaz": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgaucaz/",
      "text": "It might make a you a bit less competitive for elite institutions but it’s definitely not a deal breaker as long as you have good grades and took challenging coursework otherwise. I would definitely take the AP exam if possible or at the very least put that you are studying Japanese on your own time somewhere in you application or CV. That definitely shows interest and initiative and would separate yourself from other applicants. Do you plan on majoring in eastern studies? Or something like that",
      "author": "PrizedRadish",
      "created": 1634002373,
      "upvotes": 7,
      "replies": {
        "hgavnmr": {
          "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgavnmr/",
          "text": "I plan on minoring in Japanese if I can or East Asian studies",
          "author": "Luv_Luyxoxo",
          "created": 1634002971,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgayvpu": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgayvpu/",
      "text": "Depending on the type of colleges you're looking at, it might make a difference. I would ask each college if they're looking for a certain number of years of foreign language in high school; if they say 3-4 (and you have one), ask if your self study would count.",
      "author": "newyorkliberalarts",
      "created": 1634004424,
      "upvotes": 3,
      "replies": {
        "hgbari4": {
          "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgbari4/",
          "text": "The colleges I’m looking at say they recommend 3-4 but it’s not required so would I be fine?",
          "author": "Luv_Luyxoxo",
          "created": 1634009834,
          "upvotes": 1,
          "replies": {
            "hgc2cxd": {
              "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgc2cxd/",
              "text": "As someone said in another comment, when colleges 'recommend' something, it's usually a good idea to do that thing. This is not to say you'll be automatically rejected if you don't have 3-4 years of a language, especially if the rest of your application is strong, but I would definitely recommend putting some information in your app about your study of Japanese.",
              "author": "newyorkliberalarts",
              "created": 1634030374,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgb7jxu": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgb7jxu/",
      "text": "ALRIGHT I have experience with this subject matter, since I didn't take in G11-G12. If you have proof that you can reach an understanding of the language that roughly equates to 3 years worth, then it won't be TOO much of a problem.\n\nSo you want to look at SAT language tests, AP's (are there AP language exams?), to \"prove\" your capability, and expand on it in the additional info section",
      "author": "sleepkeyichidema",
      "created": 1634008363,
      "upvotes": 3,
      "replies": {}
    },
    "hgbd829": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgbd829/",
      "text": "When colleges say they \"recommend\" something, they want to see you take it.",
      "author": "mflu_",
      "created": 1634011083,
      "upvotes": 2,
      "replies": {}
    },
    "hgbepmu": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgbepmu/",
      "text": "May I ask how you learnt so much?\n\nI'm completely comfortable with Hiragana and most Katakana, but Kanji is so fucking difficult.",
      "author": "whoisapotato",
      "created": 1634011902,
      "upvotes": 2,
      "replies": {}
    },
    "hgbhvv1": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgbhvv1/",
      "text": "Yes it will, unfortunately.",
      "author": "ivybrothers",
      "created": 1634013772,
      "upvotes": 2,
      "replies": {}
    },
    "hgbnizk": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgbnizk/",
      "text": "Most highly selective/rejective colleges like to see at least four years of one language in high school.  \n\nHere’s my copy pasta:\n\nWhy Take a Third or Fourth Year of Foreign Language?\n\nGood question. I’ve asked that myself a lot and here’s what I’ve learned.\n\nIt shows a willingness to learn something beyond what’s comfortable. You learn a language to be forced to think beyond your native language’s thought structure.\n\nLanguages flex your brain in different ways and make it work in another functional way\n\nHere’s what I’ve heard admissions officers and counselors say:\n\nThey value the commitment of students who continue to persevere with language if it’s available\n\nThe study of language helps with cultural competency\n\nLanguage study teaches an appreciation of other cultures and helps develop an understanding of how language affects our ability to think and express ourselves. Selective colleges want students who delve deep into another language for its inherent value.\n\nIt’s not about the language. It’s about the way of thinking and learning a new skill set.\n\nIt’s considered a matter of “horsepower,” allowing you to think differently and grow your ability to empathize, understand other cultures, and stretch your mind.\n\nAlso, studying other languages allows you to really understand English and grammar because you’re being forced to go through a complex analysis of how grammar and language work.\n\nKids who go to fancy prep schools are advised to take at least one language all four years, and often two. For example, my kids all took Latin all four years, and then also took Greek as seniors, and took either French or Spanish for 2 or 3 years. This is all in high school. Not including the Spanish 1 or 2 or Latin 1 or 2 they did as middle schoolers. And they aren’t uncommon — especially for humanities majors.  If you’re a stem major, it matters slightly less.\n\nOf course, students are accepted without the fourth year of language bc they do look at what’s offered to you and what you have taken, but I encourage all my students to stick with their fourth year of language.  So I just share whatever advice I give my private students with y’all here.\n\nHere’s what Yale says though, for example: “Yale does not have any specific entrance requirements (for example, there is no foreign language requirement for admission to Yale). But we do look for students who have taken a balanced set of the rigorous classes available to them. Generally speaking, you should try to take courses each year in English, science, math, the social sciences, and foreign language.” (https://admissions.yale.edu/advice-selecting-high-school-courses)\n\nAnd colleges are definitely aware that different students have access to different opportunities in high schools and some schools only offer two years. They will be aware of that.",
      "author": "admissionsmom",
      "created": 1634017561,
      "upvotes": 2,
      "replies": {
        "hgddx54": {
          "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgddx54/",
          "text": "Thank you for your input! My school does offer advanced Spanish classes but I didn’t see any point in me investing my time in one language when I’m invested in another. I have made the decision to take the Japanese proficiency exam at the end of my junior year (level 2 or 3) and AP Japanese next year. This gave me really good insight!",
          "author": "Luv_Luyxoxo",
          "created": 1634056313,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgcdqq5": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgcdqq5/",
      "text": "Phone the admission offices",
      "author": "KaiwenKHB",
      "created": 1634039294,
      "upvotes": 1,
      "replies": {}
    },
    "hgduehy": {
      "link": "/r/ApplyingToCollege/comments/q6angd/will_not_taking_a_foreign_language_affect_my/hgduehy/",
      "text": "yes",
      "author": "PrincipleSpecial4759",
      "created": 1634063110,
      "upvotes": 1,
      "replies": {}
    }
  }
}