{
  "sid": "r3bzrl",
  "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/",
  "title:": "Any other juniors feeling super lost rn?",
  "text": "I've been relatively okay with my extracurriculars up until now, but somehow anxiety has started to set in and I can't stop comparing myself to these insane Einsteins who somehow manage to do every activity under the sun perfectly. It's making me feel super lost tbh. Like how are people out here publishing research papers in prestigious journals AND running international nonprofits AND winning olympiads??? It baffles me.",
  "author": "carnegiemellonsimp23",
  "created": 1638013617,
  "updated": 1638205181,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.96,
  "comments": {
    "hm9nsxa": {
      "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/hm9nsxa/",
      "text": "Try not to compare. Even the most perfect applicant can get denied. A good lot of them are just high achievers — it’s how they’re wired. But no doubt, a good few of these kids accomplished these things at the cost of a real life or personality, or even resilience and adaptability. You did you and that’s what’s important.",
      "author": "pupuphlatter",
      "created": 1638016526,
      "upvotes": 14,
      "replies": {
        "hm9xl2c": {
          "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/hm9xl2c/",
          "text": "this! in the span of a year i amped up my ecs to look similar to the person referenced by op, and in exchange i lost a lot of my persona and became negligent to my appearance ,which is now having repercussions given that i’m almost done with applications and want to go back to my social life",
          "author": "localramenconsumer",
          "created": 1638022564,
          "upvotes": 5,
          "replies": {
            "hm9za1v": {
              "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/hm9za1v/",
              "text": "Here’s hoping you get back to yourself soon!",
              "author": "pupuphlatter",
              "created": 1638023481,
              "upvotes": 3,
              "replies": {
                "hma2mup": {
                  "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/hma2mup/",
                  "text": "thank you!! <3",
                  "author": "localramenconsumer",
                  "created": 1638025208,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm9v3q2": {
      "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/hm9v3q2/",
      "text": "You don't have to do a ton of extracurriculars to look good for AOs. I've heard it's better to pick a couple activities, stick with them all 4 years (or as long as you can) and show dedication to them rather than trying out every club in school.",
      "author": "Omegathan",
      "created": 1638021172,
      "upvotes": 7,
      "replies": {
        "hm9zk4x": {
          "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/hm9zk4x/",
          "text": "Correct. They want kids who actually like doing their ECs as opposed to checklist-kids. It’s not about having 10+. It’s about wanting to do what you want to do because you want to. No doubt your experience will be a lot deeper and fulfilling.",
          "author": "pupuphlatter",
          "created": 1638023628,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hmbzl0x": {
      "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/hmbzl0x/",
      "text": "hi i’m a current senior just applied to schools!! I had the same dilemma but wayyy later in the game bc of covid. felt totally lost when i was filling out my activities. however you’d b surprised how many things you do actually count and how you can finesse them a lil in the description to showcase what u learned from them! it’s hard to try to put urself in a written all for everyone but it’s better to put things down that you enjoy then pulling things out just to have on an app. good luck!",
      "author": "tooinvestedintvshows",
      "created": 1638055130,
      "upvotes": 1,
      "replies": {}
    },
    "hmfijv7": {
      "link": "/r/ApplyingToCollege/comments/r3bzrl/any_other_juniors_feeling_super_lost_rn/hmfijv7/",
      "text": "Get involved in things you are passionate about and you love. When it comes to writing your essays this passion will come across and feel very authentic. With this in mind you will be supporting yourself both inside and out which is the key to happiness. I know this may sounds corny but it is very true and a perfect time to start being true to who you are-its a great habit something most kids your age struggle with. Good Luck !",
      "author": "Hamilton3322",
      "created": 1638125149,
      "upvotes": 1,
      "replies": {}
    }
  }
}