{
  "sid": "qwq4r4",
  "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/",
  "title:": "I'm a senior and I haven't applied to college yet. Is it too late to apply?",
  "text": "I haven't even taken the SAT. I only took the ACT but I got a 21 on it. Most colleges in my state are test-optional but is it too late to apply? I have some community college credits as well.",
  "author": "Responsible_Bicycle1",
  "created": 1637243380,
  "updated": 1637352999,
  "over_18": false,
  "upvotes": 56,
  "upvote_ratio": 0.96,
  "comments": {
    "hl4bygo": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl4bygo/",
      "text": "Not too late at all! Of the colleges that have set deadlines, a lot are coming in January and February. There are also a lot of \"rolling\" admission schools that don't really have pressing deadlines in the next few weeks. \n\nYou have tons of options!",
      "author": "UVaDeanj",
      "created": 1637243510,
      "upvotes": 77,
      "replies": {}
    },
    "hl4ojdp": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl4ojdp/",
      "text": "Here is an old list, but it’s a good place to start looking at schools based on what your GPA is:\n\nhttps://static1.squarespace.com/static/527cc9ffe4b06105448def23/t/5956c079f7e0aba4bff0bfc7/1498857597321/MMQDCLB+062917.pdf\n\nAlso ignore the test scores on the list and apply test optional. You’re the perfect case for why they have that option.",
      "author": "SpacerCat",
      "created": 1637249131,
      "upvotes": 21,
      "replies": {}
    },
    "hl4bzsc": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl4bzsc/",
      "text": "Definitely not too late to apply, a lot of colleges have regular decision end on January 1st! You got plenty of time — I definitely would apply test optional though most schools in the country are test optional this year which you should take advantage of",
      "author": "ShameMyShirt",
      "created": 1637243529,
      "upvotes": 18,
      "replies": {}
    },
    "hl4wbwz": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl4wbwz/",
      "text": "Definitely not too late, if your looking into the UC’s then it’s not due till November 30",
      "author": "SozinsComet1",
      "created": 1637252263,
      "upvotes": 5,
      "replies": {}
    },
    "hl4cktv": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl4cktv/",
      "text": "As others have said, you definitely still have time.\n\nIf any schools you are interested in do rolling admissions, I'd apply to those first - if you are interested in a major that's in high demand the spots in that field can fill up (at some schools this isn't a big deal, at others it can be).",
      "author": "BrawnyAcolyte",
      "created": 1637243820,
      "upvotes": 10,
      "replies": {}
    },
    "hl4mnwz": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl4mnwz/",
      "text": "Make a list of colleges you are interested in and look up their application deadlines on their websites. Most will have regular decision deadlines in January. Rolling could be anytime from last summer through May or even through school starting next Aug - depends on the school.",
      "author": "elkrange",
      "created": 1637248347,
      "upvotes": 3,
      "replies": {}
    },
    "hl622mm": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl622mm/",
      "text": "U still have time for the UC schools, regular decision for pretty much every college, and rolling admissions for schools like Pitt, Indiana, Michigan State, Arizona and tons of others. U only missed out on Early Action and Early Decision but pretty much all schools that offer those also offer an option to submit Regular decision, which is typically deadlined between mid-December and mid-January!",
      "author": "Zealousideal-Ebb-415",
      "created": 1637268666,
      "upvotes": 3,
      "replies": {}
    },
    "hl5l43r": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl5l43r/",
      "text": "nope, most colleges are not expecting SAT scores until 2022 (for class of 2023) so you can still apply to a lot of colleges. You should still get in with your GPA and extracurriculars.",
      "author": "Original_Two_4434",
      "created": 1637261971,
      "upvotes": 2,
      "replies": {}
    },
    "hl6bcbl": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl6bcbl/",
      "text": "Almost all US colleges have a January 1 or later application deadline.",
      "author": "RichInPitt",
      "created": 1637272388,
      "upvotes": 2,
      "replies": {}
    },
    "hl7a23g": {
      "link": "/r/ApplyingToCollege/comments/qwq4r4/im_a_senior_and_i_havent_applied_to_college_yet/hl7a23g/",
      "text": "You can totally apply and I am pretty sure you can take the SAT in December and you may be late but it is not TOO late.  But if you don't want to submit your scores that is ok.  Why not apply for college if that is what you want.  Some colleges like Drexel are \"coop\" schools where you can work and travel maybe and then take some classes.  GO FOR IT and good luck.  DON\"T get dejected and if you can't get it together for this fall, try to do something you really want to do or get a job and apply for spring admission or admission next fall!  Also, many schools, if not most, are not requiring the SAT.  You can still apply regular admission to most schools till at least January 1 and many of them have admission deadlines after that.  Why",
      "author": "singularreality",
      "created": 1637287815,
      "upvotes": 1,
      "replies": {}
    }
  }
}