{
  "sid": "qrr885",
  "link": "/r/ApplyingToCollege/comments/qrr885/challenge_dont_look_up_your_alumni_interviewer/",
  "title:": "Challenge: don’t look up your alumni interviewer when you get their name.",
  "text": "I didn’t know anything ab my Georgetown interviewer and it was so much cooler not knowing anythinf and getting to learn ab them during the interview instead of having to pretend I didn’t stalk them on Linkedin like some of y’all, lol",
  "author": "sarahkppp",
  "created": 1636654231,
  "updated": 1637374061,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk92mft": {
      "link": "/r/ApplyingToCollege/comments/qrr885/challenge_dont_look_up_your_alumni_interviewer/hk92mft/",
      "text": "This is actually probably pretty bad interview advice, always a good idea to know your audience",
      "author": "CH3OH-CH2CH3OH",
      "created": 1636665563,
      "upvotes": 53,
      "replies": {}
    },
    "hk955d7": {
      "link": "/r/ApplyingToCollege/comments/qrr885/challenge_dont_look_up_your_alumni_interviewer/hk955d7/",
      "text": "I just do some really basic stuff, nothing super deep. Like I know my Duke interviewer did his undergrad there and did three majors/minors, then did a Ph.D., and is now at Scripps Institute of Research. That's literally it. Nothing more particular than that but I just wanted to know whether he did research or not so I could ask him about it.",
      "author": "chaotically_awkward",
      "created": 1636666611,
      "upvotes": 10,
      "replies": {}
    },
    "hkaiahk": {
      "link": "/r/ApplyingToCollege/comments/qrr885/challenge_dont_look_up_your_alumni_interviewer/hkaiahk/",
      "text": "If I have an interview for anything— whether it be a job, a one-on-one with a professor, or just networking and learning more about a field —I *always* look them up and find out what I can. It’s not stalking if it’s all information that’s out there in the open. I gain valuable information and can steer the conversation towards their interests. There’s nothing wrong with it.",
      "author": "HireLaneKiffin",
      "created": 1636689337,
      "upvotes": 3,
      "replies": {}
    },
    "hkbwc4h": {
      "link": "/r/ApplyingToCollege/comments/qrr885/challenge_dont_look_up_your_alumni_interviewer/hkbwc4h/",
      "text": "Huh interesting! I had quite the opposite experience.\n\nI Googled my interviewer and spent about 5 mins seeing which labs they used at the university. During the actual interview, I slowly turned the conversation towards the labs and associated skills/tools...and suffice it to say that I (and I guess the interviewer too) lost track of how long we discussed that. Of course, it is true that they were a recent grad in the same major as my anticipated choice, so that had a huge role to play too.",
      "author": "eccentric-Orange",
      "created": 1636723941,
      "upvotes": 1,
      "replies": {}
    },
    "hkcb075": {
      "link": "/r/ApplyingToCollege/comments/qrr885/challenge_dont_look_up_your_alumni_interviewer/hkcb075/",
      "text": "I literally couldn't find anything on my interviewer and the interview went really well. so yea I agree.",
      "author": "SnooPets1386",
      "created": 1636730693,
      "upvotes": 1,
      "replies": {}
    }
  }
}