{
  "sid": "q43m2g",
  "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/",
  "title:": "Colleges for Mechanical Engineering",
  "text": "Hi A2C community, my GPA is really low \\~3.2 and my SAT scores are decent \\~1500. Do I have a chance to get into any decent college with major in Mechanical Engineering? I had 504 throughout my high school and really difficult time with online classes during covid time. I had decent amount of extracurriculars but only few AP/Hons classes. I have a passion about doing something on Mechanical Engineering side. \n\nIf there are chances, can you please list some colleges where I should be focusing at?",
  "author": "beecreative01",
  "created": 1633717357,
  "updated": 1634074537,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hfvxicm": {
      "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/hfvxicm/",
      "text": "You should be fine for schools like Arizona State, Oregon State, Iowa State.  Maybe Michigan State.  CU Boulder might offer you pre-engineering or exploratory studies, but you could get into mechanical engineering if you did well in first year courses.  Somewhere like MSOE would probably be fine too if you preferred a smaller engineering focused school.\n\nThose might not be better than options in your state -- the differences in outcomes between top engineering schools like UC Berkeley, UIUC, or Georgia Tech and pretty good ones like the ones mentioned above just isn't that big for mechanical engineering, so if you have a good option that has lower tuition or offers you more aid that can make a lot of sense.  Just make sure they are ABET accredited -- it definitely matters for mechanical engineers.\n\nWhat jobs grads go into can be influenced somewhat by location -- all the decent mechanical engineering options in Michigan have pretty good salaries because their grads go pretty heavily into the auto industry for example.",
      "author": "BrawnyAcolyte",
      "created": 1633719065,
      "upvotes": 4,
      "replies": {}
    },
    "hfw3hyi": {
      "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/hfw3hyi/",
      "text": "Thanks for the response!! Really gave me some hope. I am located in California, but I am ready to go anywhere in US.",
      "author": "beecreative01",
      "created": 1633721483,
      "upvotes": 2,
      "replies": {
        "hfwig4a": {
          "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/hfwig4a/",
          "text": "Lots of the Cal State options are pretty solid - Cal Poly SLO is exceptional but could be a reach.\n\nYou can check grad salaries at https://collegescorecard.ed.gov to get an idea of who does well.  You also might get discounted tuition through WUE at schools like Colorado State, Oregon State, and University of Utah which are all good for engineering.",
          "author": "BrawnyAcolyte",
          "created": 1633727729,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfvxyoz": {
      "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/hfvxyoz/",
      "text": "Where are you looking geographically? If on the east coast, take a look at Drexel and Stevens.",
      "author": "cindydoes",
      "created": 1633719249,
      "upvotes": 1,
      "replies": {}
    },
    "hfwyq7o": {
      "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/hfwyq7o/",
      "text": "If you are willing to go anywhere in the US, look at UMass Lowell. Great coops and internships. They also offer scholarships for high test scores.",
      "author": "jasonghor",
      "created": 1633734941,
      "upvotes": 1,
      "replies": {}
    },
    "hfxjx9m": {
      "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/hfxjx9m/",
      "text": "anything around a 1500 is quite competitive (considering it’s about the average for ivies) and should help compensate some of that gpa - all the schools listed here are quite good options. Just mention how covid affected your gpa in extra info and apply wherever you’d like",
      "author": "loserlake420",
      "created": 1633745309,
      "upvotes": 1,
      "replies": {}
    },
    "hg0kkxg": {
      "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/hg0kkxg/",
      "text": "Most of the colleges are test blind or test optional. How does it lower the importance of test scores now? UCs are not even looking at them until after enrollment.",
      "author": "beecreative01",
      "created": 1633807597,
      "upvotes": 1,
      "replies": {}
    },
    "hg9p6s5": {
      "link": "/r/ApplyingToCollege/comments/q43m2g/colleges_for_mechanical_engineering/hg9p6s5/",
      "text": "Kettering University might be a good option is you are ok with living in Flint. Your GPA is below the 25th percentile, but your SAT is close to the 75th percentile. It is a very strong school for Mechanical Engineering, and is very prestigious in the automotive industry (most grads either work for an automotive company or Amazon). The co-op program is also great. You graduate with 2 years cumulative of paid internship experience, and they start your freshman year. If you have any further questions about it, feel free to ask me.",
      "author": "diesalotXV",
      "created": 1633982885,
      "upvotes": 1,
      "replies": {}
    }
  }
}