{
  "sid": "qxckva",
  "link": "/r/ApplyingToCollege/comments/qxckva/fallback_options/",
  "title:": "Fallback options",
  "text": "I’ll be 16 by the time I get into college, and I’m extremely nervous about college acceptance. UC is my dream college, and I have already applied to most of the branches. I feel as if my application wasn’t that great, so I’m currently looking to apply to more colleges as a fallback. Preferably schools that have high acceptance rates to ease my anxiety.\nI’d greatly appreciate any advice. :)",
  "author": "voodoodless",
  "created": 1637313930,
  "updated": 1637353013,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hl96leo": {
      "link": "/r/ApplyingToCollege/comments/qxckva/fallback_options/hl96leo/",
      "text": "16 is really really young. Have you considered a gap year or two? \n\nIf you’re in California the CSUs can be great options — many with more reasonable admissions rates. \n\nBtw if you’re not in California, please be aware that the UCs give no financial aid to OOS students. \n\nIf you like that vibe though, check out these schools \n\nASU\n\nU Arizona \n\nU New Mexico\n\nNew Mexico State \n\nU Oregon\n\nOregon State \n\nColorado State\n\nU Nevada LV\n\nKansas State \n\nU Kansas",
      "author": "admissionsmom",
      "created": 1637330243,
      "upvotes": 4,
      "replies": {}
    },
    "hl9poal": {
      "link": "/r/ApplyingToCollege/comments/qxckva/fallback_options/hl9poal/",
      "text": "San Diego State comes to mind, but I just checked and they're only accepting 37% so maybe not that safe after all.  If your SAT is 1300+ then your odds are much, much better.\n\nAlternately, there are some large public campus near-ish to California you could likely be admitted to, but that would be more expensive (unless you get significant merit aid).  Washington State, Oregon, Oregon State, Utah, Arizona, Arizona State.",
      "author": "jayphoward",
      "created": 1637338487,
      "upvotes": 1,
      "replies": {}
    }
  }
}