{
  "sid": "qm846q",
  "link": "/r/ApplyingToCollege/comments/qm846q/applied_for_a_fee_waiver/",
  "title:": "Applied for a Fee Waiver",
  "text": "So I’ve heard many times that you should always apply for scholarships and waivers that you may qualify for. At the end of the MIT application, it asked if I wanted to request a fee waiver, so I clicked yes. I was under the impression that it would then ask me financial questions, but instead it just went ahead and submitted the application for free, no questions asked. This has me worried, because at the end of the day, I probably don’t qualify for one, but I did it just in case. Will this affect my chance of admission, and will I eventually have to pay it?",
  "author": "BxllDxgZ",
  "created": 1635984636,
  "updated": 1636136281,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hj83a3m": {
      "link": "/r/ApplyingToCollege/comments/qm846q/applied_for_a_fee_waiver/hj83a3m/",
      "text": "I have the same question. I submitted my application without paying the fee but I don't know if I qualified for a fee waiver",
      "author": "Traditional-Mammoth9",
      "created": 1635987032,
      "upvotes": 2,
      "replies": {}
    },
    "hj83dnz": {
      "link": "/r/ApplyingToCollege/comments/qm846q/applied_for_a_fee_waiver/hj83dnz/",
      "text": "It looks like there largely about the honors system when it comes to fee waivers...\n\nhttps://mitadmissions.org/blogs/entry/does\\_mit\\_offer\\_application\\_fee/",
      "author": "aLouise37",
      "created": 1635987075,
      "upvotes": 2,
      "replies": {
        "hj83n3e": {
          "link": "/r/ApplyingToCollege/comments/qm846q/applied_for_a_fee_waiver/hj83n3e/",
          "text": "Uh oh. Should I reach out to them somehow so I don’t seem like an asshole?",
          "author": "BxllDxgZ",
          "created": 1635987191,
          "upvotes": 1,
          "replies": {
            "hj8u1ai": {
              "link": "/r/ApplyingToCollege/comments/qm846q/applied_for_a_fee_waiver/hj8u1ai/",
              "text": "That blog was from 2007. I doubt you should reach out (?). All kinds of things like that are set to be permissive because of Covid. One of the legit reasons listed in '07 was \"things are stressed in my family\" (or whatever). I bet you're fine! You weren't trying to be evil and things HAVE been stressed so you clicked to learn more about the guidelines and suddenly you found the deal was done ...",
              "author": "83201",
              "created": 1636000272,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}