{
  "sid": "qhv5fp",
  "link": "/r/ApplyingToCollege/comments/qhv5fp/procrastinator_who_made_a_stupid_mistake_for/",
  "title:": "Procrastinator who made a stupid mistake for University of Maryland EA application (SAT Score send): Help",
  "text": "Hello. I'm applying to UMD EA since i want to be considered for merit scholarships. (It's not one of my top choices and more of a safety/match for me, but if I end up going there i want to make sure I get merit aid). I want to submit my sat scores, but i just found out that UMD does not accept self reported SAT scores on common app, and requires receipt of the official score send from collegeboard by the Nov 1 EA deadline. \n\nNow, I have two choices of what to do:\n\n1. Indicate on my application that I intend to apply EA and submit test scores. Spend $43 to send my SAT scores with rush shipping on collegeboard. If my scores don't arrive in time, my application will be deferred to the regular decision pool and i will no longer be eligible for merit scholarships, but they might arrive in time since the website says rush shipping takes 1-2 business days.\n2. Indicate on my application that I intend to apply EA test-optional. All application materials will be guaranteed to be ready for the EA cycle, but I'm concerned that I won't be able to get merit scholarships without submitting SAT scores. My stats are a 101.8 gpa and I've indicated my national merit semifinalist designation, and my extracurriculars are good as well, but I'm wondering if that's enough. I'm not really familiar with what these merit scholarships are specifically looking for but I know they're very stats-focused.\n\nWhich choice should I make? I don't want to lose out on my opportunity for merit scholarships because of a stupid mistake I made. All the other schools I'm applying to accept common app self-report with official score send for verification upon acceptance, so I assumed UMD had the same system. But i guess not :(\n\nAny help would be appreciated!",
  "author": "lqj37",
  "created": 1635450911,
  "updated": 1635455724,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hifb77n": {
      "link": "/r/ApplyingToCollege/comments/qhv5fp/procrastinator_who_made_a_stupid_mistake_for/hifb77n/",
      "text": "i would try and do rush shipping but do it now bc u can’t waste any more time. it would help to maximize ur chances of scholarships if it’s high enough so i think it’s worth it to do it",
      "author": "socallaghann",
      "created": 1635452036,
      "upvotes": 2,
      "replies": {}
    },
    "hifd8xf": {
      "link": "/r/ApplyingToCollege/comments/qhv5fp/procrastinator_who_made_a_stupid_mistake_for/hifd8xf/",
      "text": ">My stats are a 101.8 gpa\n\nWhat are your scores? (Total and Subscores)\n\nIntended major?",
      "author": "Strict-Special3607",
      "created": 1635452863,
      "upvotes": 1,
      "replies": {
        "hifgl0k": {
          "link": "/r/ApplyingToCollege/comments/qhv5fp/procrastinator_who_made_a_stupid_mistake_for/hifgl0k/",
          "text": "April 1490 710m 780ebrw\n\nAugust 1520 790m 730ebrw\n\nCivil engineering\n\nI know my SAT is very good, and I want them to see it. The only reason i would apply test optional is to meet the deadline in case my scores don't send soon enough. But as of now i've decided to send them anyway and risk being pushed into the RD pool if they don't get there soon enough. Hopefully rush shipping works properly",
          "author": "lqj37",
          "created": 1635454195,
          "upvotes": 1,
          "replies": {
            "hifgoq8": {
              "link": "/r/ApplyingToCollege/comments/qhv5fp/procrastinator_who_made_a_stupid_mistake_for/hifgoq8/",
              "text": "Good luck",
              "author": "Strict-Special3607",
              "created": 1635454235,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hifhyxk": {
      "link": "/r/ApplyingToCollege/comments/qhv5fp/procrastinator_who_made_a_stupid_mistake_for/hifhyxk/",
      "text": "I would apply test optional because I am concerned your scores won’t arrive in time.  Your NMSF should be sufficient.",
      "author": "Ok-Reality-640",
      "created": 1635454752,
      "upvotes": 1,
      "replies": {}
    }
  }
}