{
  "sid": "q50qo3",
  "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/",
  "title:": "Is it weird that I don't really want to share my acceptance with others?",
  "text": "I've always wondered if other people felt the same way, but wherever I get accepted, I don't really want to share it with anyone. Yeah, I'll tell my family, but it makes me internally cringe to wear college merch or plaster it on social media. I'm not knocking down other people who do this, but personally wearing a college sweater right after acceptance feels like you're wearing a target on your chest where people are invited to speculate how you got in and in which circumstances.\n\nDo other people feel like this? There's also another explanation where I don't want to give others the satisfaction of knowing what I've worked 5 plus years for. In some twisted way if I share my decision outside of my family it feels like I've done this whole thing for them. Maybe being raised in a hyper-competitive atmosphere has done this to me, but it also feels like if I externally share it, I've done this whole process for them, rather than myself.\n\nI've been having this kinda weird thought for a long time. Somehow it feels like pre-imposter syndrome where I'm scared others will label me a certain way. Dunno, thoughts?",
  "author": "unstable_parsley",
  "created": 1633838642,
  "updated": 1634073525,
  "over_18": false,
  "upvotes": 42,
  "upvote_ratio": 0.95,
  "comments": {
    "hg2gj78": {
      "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2gj78/",
      "text": "I feel the same exact way. To be honest, I feel like it’s because of the shame that I’ll feel if I don’t get into the top schools that others get into. And yes, I’m aware that prestige doesn’t mean everything. For some reason, I just can’t let go of the fact that I might be seen as inferior if I don’t get into certain schools. If I don’t share acceptance information with others, I honestly don’t think it would change much. I feel like people would just assume I don’t want to share because I didn’t get in. I just hate the overall culture around this type of stuff.",
      "author": "uhh-iDunno",
      "created": 1633840585,
      "upvotes": 16,
      "replies": {
        "hg2uvks": {
          "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2uvks/",
          "text": "I know exactly what you mean. It’s the same when it comes to grades.. it’s so frustrating when people ask for your grade and you don’t want to reply so that you don’t indulge their curiosity. But the culture just makes it seem like your silence has a negative connotation behind it. Like Silence = bad grade..",
          "author": "Complexinq_",
          "created": 1633851072,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg2gmfv": {
      "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2gmfv/",
      "text": "Dw I'm the same as I'm sure many others are. Tbh flexing anything in general will mostly just make others jealous and speculative, and for me it's just not worth it :p",
      "author": "Legitimate_Square964",
      "created": 1633840639,
      "upvotes": 5,
      "replies": {}
    },
    "hg2uazg": {
      "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2uazg/",
      "text": "Same. I'm telling a few friends but won't be putting it anywhere where people can see",
      "author": "pinkduckies",
      "created": 1633850617,
      "upvotes": 3,
      "replies": {}
    },
    "hg2kvhh": {
      "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2kvhh/",
      "text": "I’ve heard this a lot honestly. For me it depended on the person. I was actually more comfortable telling less close friends about certain rejections / places I applied to because I feel like they wouldn’t judge as much whereas my closer ones would have higher expectations. Also I didn’t mention rejections to a lot of my relatives- I knew there would be some that would pretend to feel bad but in a condescending way, or there would be others that would be disappointed because they don’t understand the app process and thought it’d be easy to get in based on grades / scores alone.",
      "author": "sedlaghs",
      "created": 1633843429,
      "upvotes": 6,
      "replies": {
        "hg2vosm": {
          "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2vosm/",
          "text": "holy shit i totally feel you about the relatives. The worst are the family friends who've sent their kids to ivys and just silently judge you.",
          "author": "unstable_parsley",
          "created": 1633851713,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hg2ryxn": {
      "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2ryxn/",
      "text": "Honestly same. I also wish other people didn't do this. I'm really nervous about just being depressed when other people get accepted to universities that I applied to as the winter/results season approaches.",
      "author": "snowflakebite",
      "created": 1633848770,
      "upvotes": 2,
      "replies": {
        "hg2v4xg": {
          "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2v4xg/",
          "text": "Same but there’s a place for everyone! At the end of it all we’re all graduating 🥳",
          "author": "UofMempSIMP",
          "created": 1633851281,
          "upvotes": 2,
          "replies": {
            "hg2weq1": {
              "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg2weq1/",
              "text": "That's the positive attitude I hope to adopt!",
              "author": "snowflakebite",
              "created": 1633852293,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg4iwk0": {
      "link": "/r/ApplyingToCollege/comments/q50qo3/is_it_weird_that_i_dont_really_want_to_share_my/hg4iwk0/",
      "text": "I would say not to tell folks where you are applying. Then wherever you’re accepted and choose to go, just say that’s your first choice/dream school. No one would ever know you were rejected from anywhere.",
      "author": "BuffsBourbon",
      "created": 1633886781,
      "upvotes": 1,
      "replies": {}
    }
  }
}