{
  "sid": "cqkgri",
  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/",
  "title:": "Poor kids have it worse. In response to middle class complaints on this sub.",
  "text": "It's a pretty common notion here that middle class kids get fucked over the worst with financial aid - because rich kids can afford to pay in full, and poor kids qualify for lots of aid. And I'm not going to refute that middle class people do get fucked over quite often. Middle class kids often don't qualify for the aid that they would benefit from, and that's not a good thing.\n\nThe notion that middle class kids have it *worse* than poor kids is incredibly insensitive and wrong, though.\n\nSomeone made a comment on one of the recent front page \"the middle class gets the shortest end of the stick :(\" posts with something to the effect of \"the poor will always have it worse\" and I want to echo that sentiment and make sure some of y'all get a little clarity on what being poor is actually like.\n\nSo sure, poor kids get a lot of financial aid. Might get all of their tuition, all of their room and board paid for. That doesn't account for all the other expenses, though. That doesn't account for food, for all of the living supplies like toiletries, cleaning supplies, new sheets because nobody owns a Twin XL at home. And while everyone has these expenses, they're a lot bigger of a burden on poor people, and y'all better not have the audacity to try and refute that. Simply living on a day to day basis can be a challenging expense for some folks.\n\nI'll use the disclaimer that I'm poor, so yeah, I'm going to be more sensitive to my fellow poor kids. I got over 3/4 of my tuition and housing paid for with need-based aid. But that's only the beginning of the expenses. I feel guilty buying the things that I need to live in college. Even buying things from the thrift store and the dollar store - I still feel horrible for the burden it is on my parents. Because that's what it's like. Buying sheets is a burden. Buying a hamper for my laundry. Paying for laundry. Paying for books. We already skimp on breakfast sometimes if we haven't gotten paid yet and don't have the spare fucking 2 dollars for a dozen eggs. I'm worried for how they'll fare this year after I've left, with monthly tuition bills on top of every other expense.\n\nBeing poor isn't some great circumstance that middle class kids should somehow envy. It fucking sucks. And while I understand that it's frustrating not to receive financial aid, I promise you that you are NOT getting the shortest end of the stick. It's really disheartening and disgusting to see people on here acting like being middle class is the worst thing that happened to them, and that somehow, they've got it worse off than poor people. **Being poor isn't worth all the financial aid in the world.**\n\nSorry if this comes off as mean, but I'm at my wits' end and I'm absolutely disgusted with the misunderstanding of poorness on this sub. Not everybody here acts like it, but I have seen far too many posts here complaining about how middle class kids have it the worst for college, and far too many of them are making it to the front page. I understand your frustration. But not one of you would want to live a day in a poor kid's shoes. It's insensitive to erase those struggles and act as though your lack of financial aid is a bigger problem than things like, I don't know, poverty.\n\nInb4 \"struggle is not a competition\" I know it isn't. But there are people on this sub acting like it is and that they've got it the worst, when there are so many other struggles in this community.",
  "author": "throwaway814a",
  "created": 1565839354,
  "updated": 1634075974,
  "over_18": false,
  "upvotes": 2243,
  "upvote_ratio": 0.93,
  "comments": {
    "ewx6r4p": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6r4p/",
      "text": "Every time I try to explain what being poor at university is like, I use examples from some of my undergraduate friends.\n\n1. A guy I did intro chemistry with. He lived at home and caught the bus in each day, but the buses are unreliable at best in the poorer areas so he ended up missing quite a few classes and failed. It rained a lot where we lived, and he couldn't afford to buy new shoes when the soles of his wore through, so he just wrapped them in duct tape and wore that for the rest of the year. Paying $100 for a pair of jeans or new shoes was an unimaginable cost. \n\n2. Another guy, two years younger. He couldn't afford any of his lab gear. Couldn't afford textbooks either, and wasn't able to find versions that were cheap enough or even an illegal PDF. He *cried* when I gave him my books and safety glasses. \n\nThese are people who have literally 0.50c to their name, if not -0.50c. Sometimes you do the absolute best you can with the cards you were dealt and it's still a steaming pile of shit, and it isn't your fault.",
      "author": "NoxiousQuadrumvirate",
      "created": 1565846442,
      "upvotes": 559,
      "replies": {
        "ewy447g": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy447g/",
          "text": "In my experience attending a very poor high school, college admission was really hard on poor people.  Most of them don't have resources or time to devote to achieving top academics, studying for SATs, building a portfolio of activities, or other things that make students attractive to colleges.  So many of them had no idea how to apply to college and had no idea that fee waivers and need-based aid exist.  I was lower-middle class myself and I thought FAFSA = student loans.  \n\nThe data bear this out - only 10% of low income students land in the top quartile of standardized test scores, and of those, just 41% complete a bachelors degree within 10 years.  [There are 38 top colleges that have more students from the top 1% of the income distribution than from the entire bottom 60%](https://www.nytimes.com/interactive/2017/01/18/upshot/some-colleges-have-more-students-from-the-top-1-percent-than-the-bottom-60.html).  That was last updated in 2017 and the trend has only been getting worse.\n\nFinally, not every college has generous financial aid.  Only 104 of the ~4600 degree granting institutions in the US guarantee that your need will be met and these are all predictably selective.  So if you're poor, you have to be aware of the resources available, perform at an outstanding level, attend a college with generous aid, and then defy the odds and graduate.",
          "author": "ScholarGrade",
          "created": 1565874268,
          "upvotes": 134,
          "replies": {
            "ewykv3u": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewykv3u/",
              "text": "Yep, people at well-resourced schools have absolutely no idea just how bad a \"bad\" school can be. \n\nMy own school had no band, no drama, no debate, no chess, no competitions of any sort, no programming, no philosophy, and really *no clubs*. You can't join a club, you can't lead a club, you can't start a club. Most people who attend the school actually live quite far away and will travel 30-60 minutes one way on a bus, without any family members who can pick them up, so almost all after-school activities are also not possible. \n\nThere was no one to tell us how to apply to universities, or when any of the deadlines were. Absolutely zero teachers mentioned university applications. Our parents didn't mention them. Our friends didn't mention them. And even places like this sub are worthless if students don't know they exist. By the time you do find these boards, you're in your senior year, you have no clubs, maybe one sport that you never won a game in, no competitions, no real ECs aside from working in a fast-food store. It's too late, and you're fucked.",
              "author": "NoxiousQuadrumvirate",
              "created": 1565882802,
              "upvotes": 74,
              "replies": {}
            },
            "ex08fpk": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex08fpk/",
              "text": "Well that’s the thing. If you’re poor and get into any of those 104 colleges, you won’t have too many expenses. You’d prob end up being better off than a middle class person who will be trying to pay off debt and be undergoing many expenses. In the end, both of you guys will get good jobs except the originally middle class person will be behind in terms of wealth because they had to continue paying their debt. But yea I understand it’s hard to get into those 104 schools.",
              "author": "KoalityBrawls",
              "created": 1565907032,
              "upvotes": 2,
              "replies": {
                "ex0j59v": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0j59v/",
                  "text": "You are missing the point entirely. It’s incredibly difficult for low-income students to get into one of those schools if they don’t have the resources to do so in the first place. And even once they are in, they have to deal with costs of textbooks, clothes, transportation, etc. Many have to work jobs to stay afloat in college, which decreases the amount of time they can study to get a good gpa, or do extracurriculars or research that can help on your resume or a grad school application. They can’t take internships that offer great experience if they’re unpaid. And they don’t have networking connections that can actually help you land jobs. Being a poor college student will put you at a disadvantage when it’s time to go out into the workforce or higher education.\n\nAlso not every college has great financial aid that will cover all costs for poor students. Many do take out loans and have less means to pay them off than middle class students.",
                  "author": "AwesomenessOnAPlate",
                  "created": 1565914339,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            },
            "ewyltrr": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyltrr/",
              "text": "[deleted]",
              "author": null,
              "created": 1565883247,
              "upvotes": -19,
              "replies": {
                "ewyvor2": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyvor2/",
                  "text": "You're, wittingly or not, spreading race realist propaganda. It's not a \"fact\" that intelligence is genetic. The only people spreading this message are racists, usually trying to push a white ethnostate via motte and Bailey type comments like the one you wrote. \n\nYou can also say knowledge is closely tied to your economic well being, but going so far as to link low IQ to poorness is very misleading as well.",
                  "author": "HecarimMainsUnite",
                  "created": 1565887447,
                  "upvotes": 18,
                  "replies": {
                    "ewywem4": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewywem4/",
                      "text": "Your source is also kinda garbage. It's outdated and the methods used are questionable. They quantified IQ by for poor people by whether or not they were able to make it into the middle class. For middle class people though, it was just about maintaining their position.\n\nThe amount of extra variables in this sort of data sifting is absurd and if you are acting in good faith, don't use that article to dictate your worldview.",
                      "author": "HecarimMainsUnite",
                      "created": 1565887758,
                      "upvotes": 13,
                      "replies": {
                        "ewz5w6l": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz5w6l/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1565891564,
                          "upvotes": -8,
                          "replies": {
                            "ewz8k7g": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz8k7g/",
                              "text": "The end of the abstract of that study: \"However, this finding does not warrant causal interpretations of the relationship between SES and the development of intelligence.\"",
                              "author": "Palacen",
                              "created": 1565892575,
                              "upvotes": 7,
                              "replies": {
                                "ewzc8d6": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzc8d6/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1565893975,
                                  "upvotes": 0,
                                  "replies": {
                                    "ewzrayq": {
                                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzrayq/",
                                      "text": "My complaint is that your original post implied there was one? What else was I supposed to think after this chain of claims??\n\n>We know for fact that intelligence is largely genetic, and we also know for fact that there is a strong link between social class and intelligence in the US and UK (you can read more about that here if you’re interested). Therefore, the children of people in the lower classes are inherently going to be on average less intelligent than children of people in the upper class.",
                                      "author": "Palacen",
                                      "created": 1565899582,
                                      "upvotes": 7,
                                      "replies": {
                                        "ewzs8vl": {
                                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzs8vl/",
                                          "text": "[deleted]",
                                          "author": null,
                                          "created": 1565900003,
                                          "upvotes": -1,
                                          "replies": {
                                            "ewztbrx": {
                                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewztbrx/",
                                              "text": "I realize this, but I think your original comment was irresponsible in its execution and maybe that's why you have so many downvotes. Honestly, you're telling me that you can't see how someone would assume that *you* have a belief in the causal relationship between intelligence and wealth after reading what you wrote? It seemed pretty implicitly clear to me.",
                                              "author": "Palacen",
                                              "created": 1565900478,
                                              "upvotes": 3,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "ewz93ii": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz93ii/",
                              "text": "Also in the same study you quoted:\n\n>\tIt is plausible that children from higher SES families experience greater opportunities for and support in cognitive engagement and learning than children from more disadvantaged homes (Bradley & Corwyn,2002).\n\nFunny how the person who claims that others’ “emotions” are getting in the way toootally isn’t biased at all...",
                              "author": "ohmygodthx",
                              "created": 1565892772,
                              "upvotes": 6,
                              "replies": {
                                "ewzcen7": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzcen7/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1565894038,
                                  "upvotes": -1,
                                  "replies": {
                                    "ewzgzgu": {
                                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzgzgu/",
                                      "text": "You perviously stated that intelligence was based off genetics.\n\nThe study quite literally concludes that they can’t determine the causality behind the IQ difference because its a chi-squared test, which can only prove correlation. In other words, **the study doesn’t support or prove your stance**. You formed an opinion from the study that can’t even confirm whether or not that opinion is correct, and that’s disingenuous.",
                                      "author": "ohmygodthx",
                                      "created": 1565895710,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ewywv3a": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewywv3a/",
                  "text": "So do you believe in predestination too? I was taught by calvinists in religious schools and, let me tell you, this is the kind of excuses they use for not teaching *certain types* of people.\n\nIt’s absolutely ridiculous to assert that you have to be intelligent to get educated. How about you can be more intelligent when you’re educated?\n\nWhen a kid is hungry when she takes a test it’s natural that she will underperform compared to non hungry peers. Look at it like that not that the rich have some natural intelligent ability. \n\nAnd this is not an opportunity to argue scientific definitions of intelligence and other semantics. It’s just absolutely ridiculous to assert that predetermined intelligence should dictate whether or not you have access to education.\n\nI get what you’re saying—it doesn’t matter if it’s right or wrong it’s just a trend we should expect. Yeah in this shitty timeline. But it’s not because wealthy people are genetically smart, it’s because the education system in the US is for the elite and can be a ticket to a slightly better social class for poorer people if they are willing to pay up. \n\nIt’s designed for it to be easier for wealthy people. Read some of the other comments here—that’s a fact. \n\nShouldn’t those oh so intellectual benevolent wealthy people have had the smarts to change the education system to make it easier for the chosen few intelligent poor folks? The fact that that has not happened shows that people want universities and education to be for the elite. Not to mention that even the dumbest rich kid will certainly go to college because that’s what’s expected of them. It’s not expected of most poor kids no matter how smart they are.\n\nEdit-\nPS kids don’t get into college based entirely on their intellectual merit. I get that you think that because you’re a kid and you work really hard. You need to think that to get through this stressful time and get your reward for your hard work.  You seriously deserve that reward. But, you’ll be a 100% better person if you think a bit about the lurking variables in these statistics and what social circumstances are leading to this so called intellectual disparity. \nI went to high school with kids in complete abject poverty. This girl I went to school with was beaten brutally as a kid and had extreme social problems. She had a kid by her own uncle when she was 14 years old after suffering years of abuse. Her father was a university professor in another country who was executed.  She started to improve greatly and is doing ok these days but never went to university—this has nothing to do with her intelligence. This is obviously extreme but just a slice of what social circumstances can dictate for a kid vs their natural intelligence.",
                  "author": "gregorydudeson",
                  "created": 1565887958,
                  "upvotes": 9,
                  "replies": {
                    "ewyy7b5": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyy7b5/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1565888543,
                      "upvotes": 0,
                      "replies": {
                        "ewz0xtm": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz0xtm/",
                          "text": "Kid, how many people in poverty do you know? Go talk to them about this",
                          "author": "gregorydudeson",
                          "created": 1565889656,
                          "upvotes": 8,
                          "replies": {
                            "ewz2l3u": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz2l3u/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1565890290,
                              "upvotes": 1,
                              "replies": {
                                "ewz8qzh": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz8qzh/",
                                  "text": ">A college education certainly isn’t reserved for the elites in the modern day. There are community colleges and financial aid available to help out poor students; they don’t really need to be “willing to pay up” as you say since they can often go to college for free.\n\n\nIt's sort of hard to justify going to community college instead of getting a second job to help support your family.\n\n>Lastly, thanks to the Internet, everyone in America (except maybe the bottom .00001% that don’t have access to a computer) has access to an education, so I don’t get your point.\n\n\nbruh wtf, do you think computers and internet access is cheap? if people are poor, that's one of the least essential things for them. On the same note, not everyone has a library close to them (I don't have them within a 15 mile radius of me),  and not everyone has a car that they can use to drive the distance to go to a place with internet access. It's really naive to think that only \".00001%\" of people don't have access to a computer.",
                                  "author": "CanIDoIt_IsitPossibl",
                                  "created": 1565892645,
                                  "upvotes": 7,
                                  "replies": {
                                    "ewzdk2u": {
                                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzdk2u/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1565894484,
                                      "upvotes": 0,
                                      "replies": {
                                        "ewzg9d6": {
                                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzg9d6/",
                                          "text": ">Okay? It’s not my fault people find it hard to talk to their parents about their future.\n\n\nWhat would talking to one's parents do if your family literally cannot afford to eat and survive in general without another source of income? \n\n\n>Yes, I do. Because you can go to a public library for very cheap and access the Internet\n\n\nDid you ignore what I wrote? Not everyone has access to a public library (which I stated in my comment, which you chose to ignore).\nI'm not in a rural area at all, I'm literally in a city but in a part where a library is just not close.\n\n\n And my guy, I would reckon many people would rather use $50 towards eating once a day or affording rent than buying a tablet that's ultimately superfluous when considering surviving for the next month. I'd say internet is a basic necessity, but it's not necessary enough to prioritize it over survival.",
                                          "author": "CanIDoIt_IsitPossibl",
                                          "created": 1565895472,
                                          "upvotes": 4,
                                          "replies": {
                                            "ewzi8ng": {
                                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzi8ng/",
                                              "text": "[deleted]",
                                              "author": null,
                                              "created": 1565896173,
                                              "upvotes": 1,
                                              "replies": {
                                                "ewzk5bb": {
                                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzk5bb/",
                                                  "text": ">I’m open to being proved wrong here, but I seriously doubt anyone (in America) besides the absolute poorest of the poor or the most unfortunate of the unfortunate needs their son to work—without the opportunity for a 4 year break for schooling, during which he could still have a part time job anyway—for them to “to eat and survive.” This is so rare that it doesn’t really deserve discussion; we cannot formulate a system based on the needs of a small, small, small group of people.\n\n\nNow that's just ignorant. I worked about 24 hours per week during my senior year of high school (which isn't that much tbf) but most of my checks went towards bills (water & electricity) or food. My situation is far from the worst, but I'm just using it as an example because apparently, you don't believe that people struggle and live paycheck to paycheck(or not even, in most cases). It's not rare at all, literally, so many people don't go to college because they have to get jobs to help their families. I consider myself blessed that recent developments have allowed for my family to begin having enough to support themselves in the past few months without the contribution that I cannot provide while away.\n\n\n>What kind of city are you in that doesn’t have a public library close by you?\n\n🤷 I don't know why.\n\n\n>If $50 is the difference between survival and death for you and you are a kid in high school, your parents are extremely selfish for birthing you (unless you went through some terribly tragedy that sucked all your money up and left your parents unemployed), but that is so rare).\n\nRent rises. People get laid off. Medical expenses occur. There's so many reasons that aren't rare at all for why people live paycheck to paycheck if even. I don't know why you think it's rare? So many people struggle in poverty that I'm honestly stumped at why you think that.",
                                                  "author": "CanIDoIt_IsitPossibl",
                                                  "created": 1565896886,
                                                  "upvotes": 3,
                                                  "replies": {
                                                    "ewzmpn8": {
                                                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzmpn8/",
                                                      "text": "[deleted]",
                                                      "author": null,
                                                      "created": 1565897843,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "ex078fq": {
                                                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex078fq/",
                                                          "text": "Case closed, guys! You're a selfish idiot bastard. Congratulations!",
                                                          "author": "shadowpreachersv",
                                                          "created": 1565906346,
                                                          "upvotes": 2,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        },
                                        "exfq1et": {
                                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exfq1et/",
                                          "text": "Okay, you’re clearly unwilling to see past your own bullshit, but I want to try and give you something irrefutable anyway.\n\nYou argue that nobody dies from starvation in the US anymore. That’s incorrect. 40 million Americans struggle to have enough food to feed themselves, and 5.8 million U.S. households suffer from severe food insecurity, which means they’re more often than not hungry. Of course, you aren’t completely wrong. The CDC doesn’t track deaths by starvation, so we can safely assume it’s not too common. But the idea that it’s okay to be starving as long as you aren’t dead (which is exactly what you’re implying) is, how you say, fucking stupid. I sort of get the vibe that you grew up upper middle class, and don’t even see poor people as people. And do you know what I could do with $50? I could feed myself for a week. It would be one meal a day, and it wouldn’t be good, and it probably wouldn’t be healthy, but I’ve done it, and will do it, because after a lifetime of only allowing myself one meal a day because that’s what I can afford, nothing is going to change that ingrained behavior. But like, I’m not going to give you a lesson on the psychological effects of growing up poor and starving. You clearly have the Internet. Fucking Google it. \n\nAlso, you seem to be under the impression that having the internet is the same as a college education. If I go to a public library, yea, I can use a computer and read books and I could become fucking Einstein. But we don’t live in a world where having the intelligence or skill is enough. An employer isn’t going to hire someone as an historian just because he read every history book available at the library. They want a college degree. They want a vocational certificate. They want PROOF that you know the stuff, and they aren’t going to go through the trouble of testing you when having a degree does that for them.\n\nSomething else that you said that doesn’t bother me, but does make me feel extreme pity for you and your pea sized brain, is that your response to “it’s hard to justify going to community college instead of helping support your family” was “so? It’s not my fault those kids can’t talk about their future with their parents.”\n\n1. No one is saying it’s your fault? The argument is: some kids can’t afford school, and those that get aid still struggle more than middle class kids. It benefits you in NO WAY to argue with this fact. NO ONE is asking you to support those kids. NO ONE is asking you to take responsibility for them. You have gone out of your way to comment on this thread and to argue with people about the oh-so controversial fact that financial aid doesn’t magically make a poor person’s life better. \n\n2. When you are in that situation, where going to school would be a significant financial burden on your family, it’s a hard decision to make. Sometimes your family wants you to go to school anyway. Sometimes they beg you not to so they can still afford to get by. It is gut wrenching to be a parent and to know that you have hurt your child in that way. It is gut wrenching to be a child and to have to choose between getting by or getting an education. Ideally, an education will help you get a good job, help better help your family. But it’s a gamble. You don’t know if you’ll be able to afford it, and you don’t know if you’ll end up dropping out after a year to help out with medical bills or because the cost got to be too much. And then what? All of those loans were for nothing. It’s not about talking to your parents, because talking about it won’t change the choice that has to be made.\n\n3. How I read your response was, “so? It’s not MY PROBLEM that they’re poor.” And you’re right. It’s not your problem. It’s not your business. You’re just some well off kid who spends his time on reddit making troll comments. So my real question for you is, what do you benefit out of being such a dumbass? How does INSISTING that poor people deserve to be poor get you what you want? Is it a classic case of “privileged person wants so bad to be the underdog that he ignores facts” or do you just like stirring people up with your EDGY takes?\n\nLike, don’t worry, I know it may seem like I’m worked up, but really I’ve been laughing for the past hour at your comments. Come on. Give me your takes. Let’s see if you can out source me, and prove ONCE AND FOR ALL that POOR PEOPLE are the luckiest of them all. \n\nSources: https://www.ers.usda.gov/publications/pub-details/?pubid=84972\nhttps://www.feedingamerica.org/about-us/press-room/new-data",
                                          "author": "talkalottabby",
                                          "created": 1566245939,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ewz881k": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz881k/",
                  "text": "I think people are downvoting because they're dumbfounded by your comment. \n\nI honestly don't know where to begin: \n\n>Isn’t this to be expected? We know for fact that intelligence is largely genetic, and we also know for fact that there is a strong link between social class and intelligence in the US and UK (you can read more about that here if you’re interested). \n\nThis idea of intelligence as genetic is something I don't have the time to fully contest right now, but I want you to consider the assumptions you're making about how colleges find worthy admits. Assuming that you're right about intelligence, for your assertion to be true the SAT and ACT would have to be measures of fluid intelligence (Gf). The rub there, of course, is that these tests aren't. The SAT has famously dropped any presumption of aptitude from its abbreviation and has changed substantially from any time its results could be accurately equated to an IQ score (which isn't a particularly accurate measurement of Gf either); and, if you don't trust the College Board, the SAT, and ACT to a lesser extent, are no longer viable qualifiers for the majority of high-intelligence societies, including Mensa. \n\nI'd also like to respond to some of the stuff you've said in other comments: \n\n>Are you kidding? Do you think intelligence spontaneously and randomly generates in someone’s brain after conception? Intelligence is certainly genetic; education is what is not genetic. \n\nAgain, not going to contest the idea of genetic intelligence right now, but have you thought about how the level of education one has influences how well they score on measures of intelligence? Parts of the SAT and ACT are literally basic grammar, proper use of which is certainly not a measure of Gf. If someone hasn't read many books, hasn't taken any halfway-decent English classes, and goes home to a community where they predominantly speak another language or an untested dialect of English, how does missing those points somehow imply they're less intelligent? \n\n>And how exactly am I spreading race propaganda when I did not even mention race? What the hell? You’re the one who strangely just brought that up.\n\nPart of me thinks you're being intentionally obtuse, but I'll go with it. Frankly, the linking to an article about The Bell Curve, a commonly-cited book in race realist circles; the implication that being less intelligent is not only a cause of poverty but also genetic; and the fact that some races are statistically more likely to be poor is what led /u/HecarimMainsUnite to make their comment. \n\n>America is more or less a meritocracy due to its capitalistic nature.\n>America is a capitalist society which allows it to be more or less a meritocracy. That’s why the result that more money equals more intelligence generally holds true and makes sense.\n\nIt would take too long to respond to this thoroughly. Unfortunately I don't remember where I read this (so take it with a grain of salt ig), but just know that the best indicator of your ultimate status in life in the US is not intelligence, but what class you were born into.",
                  "author": "Palacen",
                  "created": 1565892447,
                  "upvotes": 5,
                  "replies": {
                    "ewzbdoj": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzbdoj/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1565893649,
                      "upvotes": 0,
                      "replies": {
                        "ewzqqjr": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzqqjr/",
                          "text": ">Take a deep breath and rationally analyze what you are saying. Your responses are full of pure emotion with little to no sources or logical reasoning to back up your outlandish claims.\n\nAlright. **Deep breath.** I've done that. I'm prepared to respond now. \n\n>Here’s a great study that demonstrates the EXTREMELY strong correlation between ACT score and IQ. See page 4 to view the graph that really shows you. On a basic level, this result makes sense. Think of it on a personal level: Of the people you know, do the smarter ones generally score higher on the ACT? I know that’s definitely true in my case with very few exceptions, and that study supports my anecdotal experiences.\n\nA few things here: this source, like the one from before, operates on some old data. The ACT has changed substantially since 1975, the year when the data points in this study sat the exam, and, even if it hadn't, the test-taking strategies of students are wildly different now. In the past twenty or so years, the percent of students scoring a 36 has increased dramatically (see [this graph](https://upload.wikimedia.org/wikipedia/commons/2/29/ACT-36-1997_to_2011.png), sourced from [this data set](https://web.archive.org/web/20110927173540/http://www.act.org/newsroom/data/)), while the test itself has changed very little. Since we seem fond of using anecdotal evidence here, I have anecdotally understood that this is the result of extensive test prep, whether that be done individually or with a company, which is a privilege disproportionately afforded to the wealthy. As for me: I don't know anyone who took the ACT in 1975, so I don't know how to answer your question; sorry. \n\n>Again, bringing race into this is absurd. I made no mention of race, yet you and others seem to be dragging that into this. All I’m saying (which is supported by the linked study) is that lower socioeconomic status, regardless of race, directly correlates to a lower IQ on average.\n\nOk. I'm only responding to this so you know I'm not ignoring any of your points. I also would like you remind you of: \n\n>Your responses are full of pure emotion with little to no sources or logical reasoning to back up your outlandish claims.\n\nWhen I had responded with the evidence about The Bell Curve and the implications of your argument, I was only telling you why it was that /u/HecarimMainsUnite was (rather kindly, I think) telling you that your argument hinted at race realist dogwhistles. I'm not bringing race into this argument, but, please, keep propping up purely emotional, sans-logic strawmen. \n\n>This has no contradiction with my claim. If I’m saying that higher classes are already more intelligent on average, then it would be expected that those who are born into those higher classes are very likely to remain in a higher class. Your claim also has no source by the way, which is troubling. Especially because you are wrong. “Moderator analyses showed that the relationship between intelligence and success is dependent on the age of the sample but there is little evidence of any historical trend in the relationship.” So intelligence is the best predictor, it is just not overwhelmingly the best predictor. Couple this with the fact that higher IQ generally equals higher socioeconomic status and you get that my analysis is very well-reasoned and grounded in evidence.\n\nI hope it wasn't too much of a leap to go from (paraphrasing here) \"America is, as a result of its capitalist framework, mostly a meritocracy,\" \"Poor people are more likely to be less intelligent,\" and \"Intelligence is genetic,\" to my thought that you believed that wealth in America is a result of intelligence. The point I was trying to make with my comment is that, whether or not intelligence is genetic, to claim that wealth, and especially generational wealth, is a result of Gf is shortsighted. The article also references what I was talking about in my last post: \n\n>Others have replied that parental SES, if properly measured, is actually a better predictor\n(Bowles & Nelson, 1974; Fischer et al., 1996). The seemingly greater predictive power of intelligence in some studies results from the failure to correct for measurement error in the measures of parental SES (Bowles & Nelson, 1974) and the failure to include important\naspects of parental status (most importantly, parental income) among the predictors (Bowles & Nelson, 1974; Fischer et al., 1996).\n\nIt's likely I was thinking of either Bowles and Nelson's study or Fischer's. In any case, I can concede that this study seems to be better analyzed than those two and that intelligence is at least as good a predictor of income as parental income and SES are. That being said, I'd like to push back on this study in particular as evidence for the point about the U.S.'s \"meritocratic\" nature. Some of the data in the meta-analysis comes from the '40s and not all of it is American. As a result, I don't think it says very much about the current state of the U.S. \n\nStill on the article, I found the correlation presented by it between income and parental income strikingly low, so I went ahead and looked for articles specifically dedicated to analyzing this link in the U.S. For example, [this paper from the notably conservative Booth School of Economics at UChicago, which claims a .37 parent-child income correlation](https://faculty.chicagobooth.edu/erik.hurst/research/final_resub_jpe_dec2002.pdf), or [this 2010 OECD report, which contends that American parent-child income correlation *r* is actually closer to .45.](http://www.oecd.org/centrodemexico/medios/44582910.pdf)\n\n>I think you’ve been thoroughly debunked here. You can either choose to accept it and hopefully change your viewpoint or you can continue to live in denial. Unfortunately, you’ll probably choose the latter option as people tend to become more strongly rooted in their beliefs when they are met with countering evidence.\n\nlol I sincerely hope you get the irony here because it's hilarious from my point of view",
                          "author": "Palacen",
                          "created": 1565899376,
                          "upvotes": 4,
                          "replies": {
                            "ewzusar": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzusar/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1565901040,
                              "upvotes": 1,
                              "replies": {
                                "ewzwz8x": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzwz8x/",
                                  "text": ">Oh my god. You should become a politician. You do a great job bullshitting, but unfortunately I see right through it.\n\nThanks? \n\n>Which one is it? Has it changed substantially or very little? Regardless, I love that your only refutation to the data presented is “Uhhhh it’s 40 years old! Gotcha!” And your point about test-taking strategies is unable to be either confirmed or falsified, so that can’t be a point of discussion. Moreover, the percentage of 36s went up, so what? That fact alone is meaningless, especially if the test has changed.\n\nNo? My refutation to the data is that, even if the ACT pre-1989 was a good measure of g, the ACT right now no longer is. Also, the ACT *hasn't* changed since 1989, but it certainly *has* changed since 1975. \n\n>Moreover, the percentage of 36s went up, so what? That fact alone is meaningless, especially if the test has changed.\n\n??? This comment was made in direct reference to why the ACT isn't an accurate measure of g. If test scores at the highest band have increased so dramatically in the last 5 years, then how exactly are you going to use the exam as an accurate measurement of general intelligence? See above for the comment on test changes. \n\nHonestly, I was considering responding to the rest but I don't think it's worthwhile. Good talk, I guess.",
                                  "author": "Palacen",
                                  "created": 1565901880,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ex0hdhn": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0hdhn/",
                  "text": "I'm sorry if this is somehow offensive to you, but your basic premises are entirely unfounded. First, to stipulate that intelligence is largely predetermined by your genetic makeup based on the fact that there are observable differences in demonstrated intelligence is straight-up wrong. There is no causal link between those two statements. That is the crucial point of misinformation in the article you cite.\n\nThe article notes: \"Unless we are willing to assume that we are all born with exactly the same intellectual capacity (in which case any of us could have written the plays of Shakespeare or discovered the theory of relativity), we have to accept that innate differences of intelligence exist, and that such differences will tend to be passed on from parents to their children.\" Making this statement is akin to dismissing entirely the effect the environment a child is raised in has on their demonstrated intelligence.\n\nYou say that \"if college admissions were purely based on academic merit alone (not ECs or athletics or wealth), the bottom 50% money-wise of America would still be way underrepresented because the top 50% naturally outperform them in academic fields.\" I'm not going to dispute this. But you assume that this is caused by some deficiency of the student in question, instead of a deficiency in the system they are subject to and part of. Yes, research has shown that children of poorer parents tend to perform worse than those of richer parents even before grade school. But richer families read to their children close to five times more often than those in the bottom quintile of the income bracket do. Those in the top quarter tend to have close to ten times more books in their homes than those in the bottom quarter. Rich babies receive, on average, a greater level of positive reinforcement in response to achievement. These seemingly subtle environmental changes have drastic impacts on a child's perceived ability.\n\nNow, I'll not insult you by saying there is no correlation whatsoever between intelligence and certain genetic markers. But most of the scientific field agree that genetic predisposition accounts for only 30% of an individual's behaviors. If we agree that success is the product of a series of undertaken actions, we can then assume that only 30% of the success an individual in the middle class has enjoyed can be attributed to their born ability, and, in turn, assume that only 30% of the failure an impoverished individual faces stems from their genes.\n\nNot even a close minority for either individual. So what, then, do we attribute the remaining 70% to? Let's start before the baby is even born. Factors such as quality of prenatal care, exposure to toxins, and stress have a strong influence on the developing child (Jenses 2009). Those from disadvantaged backgrounds have long experienced lessened access to quality healthcare and nutrition. We move on, then, to a child's socialization, both with caregivers and others. This is when the pressure to fit in or risk social rejection kicks in. Jensen 2009 (and the vast majority of other sources agree with him):\n\n\"Socioeconomic status forms a huge part of this equation. Children raised in poverty rarely choose to behave differently, but they are faced daily with overwhelming challenges that affluent children never have to confront, and their brains have adapted to suboptimal conditions in ways that undermine good school performance.\"\n\nEkman in 2003 notes that because the brains of those under three are limitedly capable of experiencing emotion, these children need \"A strong, reliable primary caregiver who provides consistent and unconditional love, guidance, and support; safe, predictable, stable environments; ten to 20 hours each week of harmonious, reciprocal interactions (this process, known as *attunement*, is most crucial during the first 6–24 months of infants' lives and helps them develop a wider range of healthy emotions, including gratitude, forgiveness, and empathy); and enrichment through personalized, increasingly complex activities.\" This is something children born into poverty are often not provided. The report continues that \"children raised in poverty are much less likely to have these crucial needs met than their more affluent peers\" Deficits in these areas inhibit the production of new brain cells, alter the path of maturation, and rework the healthy neural circuitry in children's brains, thereby undermining emotional and social development and predisposing them to emotional dysfunction (Gunnar, Frenn, Wewerka, & Van Ryzin, 2009; Miller, Seifer, Stroud, Sheinkopf, & Dickstein, 2006).\n\nThat's the first issue: predisposition due to a lack of early-life emotional maturation. The second is the stupidly diverse number of chronic stressors children in poor households experience. Stressors include living in overcrowded, substandard housing or unsafe neighborhoods; enduring community or domestic violence, separation or divorce, or the loss of family members; and experiencing financial strain, forced mobility, or material deprivation (Evans & English, 2002). It's really quite simple -- stress is a biological response. Cells can either grow or deteriorate. When faced with acute, chronic stressors, biological mechanisms kick in that essentially force an individual's biology into a mode that conserves energy and learning capacity for what these cells perceive as a threatened future. And before you say it, this isn't something you can overcome by \"realizing you aren't in immediate danger.\" It's an involuntary biological response.\n\nBut wait -- there's more. \"Compared with a healthy neuron, a stressed neuron generates a weaker signal, handles less blood flow, processes less oxygen, and extends fewer connective branches to nearby cells. The prefrontal cortex and the hippocampus, crucial for learning, cognition, and working memory, are the areas of the brain most affected by *cortisol*, the so-called \"stress hormone.” Experiments have demonstrated that exposure to chronic or acute stress actually shrinks neurons in the brain's frontal lobes—an area that includes the prefrontal cortex and is responsible for such functions as making judgments, planning, and regulating impulsivity (Cook & Wellman, 2004)—and can modify and impair the hippocampus in ways that reduce learning capacity (Vythilingam et al., 2002).\"\n\nThe result? Diminished room for growth because of a child's surrounding environment, *not* their genetic predisposition. Poor students get worse teachers, worse facilities, fewer real growth opportunities, etc.\n\nAs for your misguided notion that there are apparently *so few* people that live from paycheck to paycheck, and are therefore unable to pursue higher education, here are a few widely accepted statistics:\n\n31 percent of American families have trouble paying their electricity bills. So no, people don't all have access to online education. Half or more community college students struggle to afford food. Low income students can't afford 95% percent of colleges, and have trouble finding the ones they can afford because, again, they are subject to a shitty educational system without many resources.\n\nYou're also conveniently forgetting about the time investment dedicating oneself to an education costs. That in particular is something many kids from poor households can't afford. Hell, I'm from a middle-class family and I struggle to dedicate myself entirely to a competitive education because I'm responsible for caring for two ill parents. While that seems like an extenuating circumstance, it isn't -- not for many families under the poverty line, who don't have access to decent healthcare. If you want a number, that's 8.8 percent of the US's population -- 28.5 million people who can't afford basic medication or treatment.\n\nIf any of you actually managed to read until the end, thanks for sticking around. I get that this response isn't particularly organized. I could go on for ages, but I have better things to do than write a twenty-page paper that tries to educate a grossly misinformed, close-minded Redditor. In these many words, at least I tried.\n\nAnd hey, AP-Account -- thanks for being mostly civil in your responses. I may disagree with you and think you aren't taking into account the vast body of empirical evidence and meta-analysis that sits against you, but I respect that.",
                  "author": "CodWagnerian",
                  "created": 1565913083,
                  "upvotes": 2,
                  "replies": {
                    "ex0l66e": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0l66e/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1565915808,
                      "upvotes": 1,
                      "replies": {
                        "ex0l6id": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0l6id/",
                          "text": "**Heritability of IQ**\n\nResearch on heritability of IQ implies, from the similarity of IQ in closely related persons, the proportion of variance of IQ among individuals in a study population that is associated with genetic variation within that population. This provides a maximum estimate of genetic versus environmental influence for phenotypic variation in IQ in that population as environmental factors may be correlated with genetic factors. \"Heritability\", in this sense, \"refers to the genetic contribution to variance within a population and in a specific environment\". In other words, heritability is a mathematical estimate that indicates an upper bound on how much of a trait's variation can be attributed to genes.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/ApplyingToCollege/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28",
                          "author": "WikiTextBot",
                          "created": 1565915815,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "f2cfew6": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/f2cfew6/",
                          "text": "I know this is old, but I've just gotten around to replying. \n\nA key point in my argument is not that I am refuting existing studies \"confirming\" the heritability of IQ (though I might disagree with those, too -- I'd have to look into it more). I'm stating that the methodology used to determine the heritability of IQ does not take into account environmental externalities, and as such, aren't credible studies. \n\nSecond, \"using the internet\" is not the same thing as \"having easy and continual access to the internet.\" An online education requires the latter, and as stated in my original refutation above, most don't have access to the latter. \n\nLastly, a system is broken if we don't build it to work for the outliers. No truly successful product has ever catered only to the first standard deviations from the mean. A system, institution, or product working well for those on the edges is what makes it effective. \n\nThanks, AP-Account. This was fun.",
                          "author": "CodWagnerian",
                          "created": 1570137481,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ewz2mci": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz2mci/",
                  "text": "As for downvotes, from the article you linked:\n\n>\"Predictably, reaction has been fierce, and mostly hostile.\"",
                  "author": "ScholarGrade",
                  "created": 1565890306,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ewytore": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewytore/",
          "text": "That was kinda me although not that extreme.\n\nI used to take 8am classes so that I could work 30 odd hours in the week. My thinking was I could do that with my lower level classes but I wouldn’t be able to in my upper division classes. That way I could have some savings later on.\n\nThe problem wasn’t only that the classes necessitated me to be up at like 5:30 and I was at a higher risk of being late. It was also that my alma mater is one stereotypically for wealthy kids and the vast majority of underclassmen live on campus. As such, the classes we’re not built for people like myself who needed to work and could not live on campus. Furthermore, many underclassmen professors had really punitive policies designed to teach these wealthy 18 yr olds to be responsible. I was older but didn’t look it. The policy that hurt the most was when an English teacher belittled my preparedness when I didn’t have the expensive anthology she requires for the course (on DAY ONE) and completely shut me down when I started to ask about alternatives. I needed SO MUCH more support than I had, and not just monetarily.\n\nI did graduate with a good and useful degree but I’m not the wild success story I wanted to be. I’ve been working my ass off since I was 15 yrs old to survive and, although it’s better now, my mom has a mental illness that makes it hard for me to be close to her which has been a major strain on my adulthood. I found a wonderful partner who makes a good wage and, honestly, I’ve just been letting myself not panic and struggle since graduating two years ago. I am working meh paying jobs that I enjoy and relying on my partner a lot. He’s ok with this and so am I for now.\n\nThe prospect of joining another office where I am different and need to struggle to exist there isn’t for me. I know other people say the pay check makes it worth it but I have such severe anxiety now from living such an unstable life for so long I don’t think any amount of money is worth it. I need to rest and heal my chronically stressed self.\n\nI’m happy now! Poor for now but happy.",
          "author": "gregorydudeson",
          "created": 1565886633,
          "upvotes": 17,
          "replies": {}
        },
        "ex087du": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex087du/",
          "text": "[deleted]",
          "author": null,
          "created": 1565906882,
          "upvotes": -1,
          "replies": {
            "ex0gstd": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0gstd/",
              "text": "I said “$100” because that’s a price that I’ve seen mentioned on this sub before when it comes to things like jeans, shoes, jackets being “reasonably priced”. There are a lot of people on this sub who see brand clothing as being very affordable, but in reality, poor students can’t even afford the $10. They have to choose between their bus fare or a new pair of shoes.",
              "author": "NoxiousQuadrumvirate",
              "created": 1565912676,
              "upvotes": 2,
              "replies": {}
            },
            "ex09eew": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex09eew/",
              "text": "Imaging claiming to be poor, yet not knowing how much jeans or shoes cost.  $100 is downright absurd.",
              "author": "isaaciiv",
              "created": 1565907653,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "ewx4vmp": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx4vmp/",
      "text": "100% agree, our food stamps got cut off earlier this month and this is really what's been on my mind even though it's a year away. Good luck to you and your family.",
      "author": "ActuallyAria",
      "created": 1565844449,
      "upvotes": 246,
      "replies": {
        "ewx6b35": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6b35/",
          "text": "I hope there’s a food bank near you. Maybe a church nearby?",
          "author": "cookiebinkies",
          "created": 1565845949,
          "upvotes": 60,
          "replies": {
            "ewx6esz": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6esz/",
              "text": "Yeah, the local church has been helping us out thankfully, we're hoping to get reinstated at the end of the month; it was all because my stepdad made 17 dollars over their limit of \"too little to survive\" in July",
              "author": "ActuallyAria",
              "created": 1565846061,
              "upvotes": 120,
              "replies": {
                "ewxbyuq": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxbyuq/",
                  "text": "If you're ever in need of a hot meal, see if there's a gurdwara (Sikh temple) nearby. It's part of their religion to give a meal to anyone that visits, no matter what.",
                  "author": null,
                  "created": 1565851945,
                  "upvotes": 49,
                  "replies": {
                    "ewxohqn": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxohqn/",
                      "text": "Thanks a lot for the tip! I'll keep it in the back of my mind just in case.",
                      "author": "ActuallyAria",
                      "created": 1565864348,
                      "upvotes": 21,
                      "replies": {
                        "ex0286z": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0286z/",
                          "text": "Check out r/Food_Pantry or r/Random_Acts_Of_Pizza\n\nif you are really in need of some help send me an amazon wish list and I will send what I can :)\n\nSending hugs",
                          "author": "Sunandmoon33",
                          "created": 1565903889,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ewx6n4o": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6n4o/",
                  "text": "it’s ridiculous how unrealistic the government is with these limits, but it’s cause they keep cutting funding. I had to quit my two full time jobs my senior year because as a dependent, I was making too much and I would lose health insurance. Never mind that my jobs were supporting my parents (one who was searching for a job, the other blind,) my two siblings, and myself.",
                  "author": "cookiebinkies",
                  "created": 1565846317,
                  "upvotes": 69,
                  "replies": {
                    "ewx6qz3": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6qz3/",
                      "text": "That's really rough, did everything work out okay?",
                      "author": "ActuallyAria",
                      "created": 1565846437,
                      "upvotes": 16,
                      "replies": {
                        "ewx7pww": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx7pww/",
                          "text": "It actually ended up working out a lot better than I expected.\n\nI did end up using Medicaid a ton because my first semester of college I got serotonin syndrome and ended up in seizures and on a short coma. I’m taking time off now and taking Excelsior exams (basically AP exams) and going back into reapplying. My job right now is great though so I’m able to support my parents while my mom pursues a tattoo apprenticeship to hopefully get a better job by the end of this year. \n\nI’m actually aiming to go to a small private college near home with a decent nursing program. Will be taking out loans ($60k+) but I’ve gotten my credit up to a place where loans will finally be possible! Hopefully, since this school is like a super safety (average SAT is 890, mine was 1540) I’ll get a scholarship.",
                          "author": "cookiebinkies",
                          "created": 1565847535,
                          "upvotes": 47,
                          "replies": {
                            "ewx7sv5": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx7sv5/",
                              "text": "Wow! Great job! I know I'm just a random person but I feel a lot of pride for you. Good luck going forward!",
                              "author": "ActuallyAria",
                              "created": 1565847627,
                              "upvotes": 19,
                              "replies": {}
                            },
                            "ewyq4om": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyq4om/",
                              "text": "Man I have so much respect for you, you won’t even believe it. Keep grinding. People like you will make the world a better place. I wish you the best of luck!",
                              "author": "Sparta_Kush",
                              "created": 1565885129,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "ewzv08u": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzv08u/",
                              "text": "Good luck with applications, work, and with your health in the future! congratulations on your great SAT score/resilience/hard work 💙",
                              "author": "helloxoc",
                              "created": 1565901128,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ewx9e4a": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx9e4a/",
                  "text": "Same with my family as in we just got kicked out of Medicaid because my family made a little too much (because my dad worked THREE jobs). Also, I've been working 60 hour weeks during the summer and I hope I don't lose my financial aid next year because if how much I worked. 50% of my money is going to pay for my twin sister's college tuition and the rest is going to my other college costs because I got a full ride. I hope I didn't mess up by working a lot.",
                  "author": "PotBelly100",
                  "created": 1565849367,
                  "upvotes": 19,
                  "replies": {
                    "ewxof74": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxof74/",
                      "text": "Yeah, my stepdad is working three jobs right now and it was just over, it's all crap. I wouldn't worry \"too\" much, if you're need based aid gets rescinded and it causes a problem, try going straight to financial aid services, depending on the school you could make an appeal to get more aid because need-based got reduced. Best of luck!",
                      "author": "ActuallyAria",
                      "created": 1565864298,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "ewxy7su": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxy7su/",
                      "text": "I've done internships for the last two summers and my EFC never changed so you should be good.",
                      "author": "OnceOnThisIsland",
                      "created": 1565870972,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "ewxa1jy": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxa1jy/",
                  "text": "I get that. My mom recently got a 20 cent raise and we're worried I won't be able to get fully free lunches anymore.",
                  "author": "iliketothinkimcool",
                  "created": 1565850103,
                  "upvotes": 15,
                  "replies": {
                    "ewxos0q": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxos0q/",
                      "text": "Like I said in an above comment, if you go above the cutoff for a state funded activity (like free lunch programs) you can try to appeal to get them back if you bring your specific case to your school. I really feel that though, and two of my stepdad's jobs are seasonal, so they might drop us off everything only for his jobs to end in two months. I'm really friendly with the cafeteria ladies, in the morning they let me use my free lunch thing to take a few extra bagels and butters, even if I'm not gonna eat them because I can bring them home; if you're friendly with them/they know your situation, maybe they'll just bend the rules for you?",
                      "author": "ActuallyAria",
                      "created": 1565864629,
                      "upvotes": 12,
                      "replies": {}
                    }
                  }
                },
                "ewzzww8": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzzww8/",
                  "text": "means testing is literally cancer",
                  "author": "emilychats",
                  "created": 1565903005,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ewzmtyc": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzmtyc/",
          "text": "[deleted]",
          "author": null,
          "created": 1565897889,
          "upvotes": -2,
          "replies": {
            "exebr8a": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exebr8a/",
              "text": "You’re disgusting",
              "author": "ApplyingToUniSoon",
              "created": 1566208267,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "ewx8cg0": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8cg0/",
      "text": "Finally, someone said it! I totally understand that middle-class kids have less access to financial aid compared to us lower-income households. I also recognize that having a lot of siblings or having cheap parents or dealing with family crises have to be factored in, too.  But idk, in my own experience coming from a family who's always been poor and knowing others with the same peasant-ass status, it's more likely for poor kids to deal with financial burdens constantly. There's no ups and downs, really. It's just always stagnant and really low.( please don't @ me idk if this is making any sense at all)\n\nAlso to add on to your point of how being poor affects literally every decision to do with college, the same thing applied to high school shit. When your family is struggling to not get kicked out and you're trying to juggle 3 jobs at once, finding interesting hobbies, funds for school ecs, and enrichment opportunities just aren't on your radar. You can't just pull yourself up by the bootstraps when you don't have the means to.\n\nEdit: ALSO FORGOT, don't know if this just me but poor kids tend to be first-generation. idk not knowing what the fuck i was doing while everyone else did scared me so much (and continues to!). on the bright side, i guess this leads to more perseverance and initiative.",
      "author": "rainysidedown",
      "created": 1565848232,
      "upvotes": 102,
      "replies": {
        "ewxac6z": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxac6z/",
          "text": "Your edit is me to a tee. I'll be the first in my family to go from high school straight to college and I have no idea how I'm going to manage it. I hate always being seen as the poor kid.",
          "author": "iliketothinkimcool",
          "created": 1565850395,
          "upvotes": 27,
          "replies": {}
        }
      }
    },
    "ewx9y9m": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx9y9m/",
      "text": "I'm so glad someone finally said it. As a poor kid, it's annoying hear all the middle class kids on here complain about their situation. Yeah, it sucks your parents can't help pay for your college as much as you want them to, but at least your parents have jobs that pay more than minimum wage. At least you haven't had to budget with your parents to see if they could afford to let you go on a school trip in the hopes of getting an award that'll help you out further down the road. \n\nSure, I get all my application and testing fees waived, but the humiliation I feel when I have to ask my school counselor, who makes more money than my parents could think of, for waivers, is more than I can bare sometimes.",
      "author": "iliketothinkimcool",
      "created": 1565850002,
      "upvotes": 86,
      "replies": {
        "ewy663n": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy663n/",
          "text": "I felt that, especially the waiving fees. It's so embarrassing to go to a camp and them being like \"oh yeah I paid the full thing\" and I look like garbage cause I only paid half of it. Or \"I applied early so I only had to pay $100\" well I only had to pay $50 off of my paycheck to go cause mom can't afford it cause she's paying bills.",
          "author": "falloutkittens_",
          "created": 1565875524,
          "upvotes": 9,
          "replies": {
            "exf36mu": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exf36mu/",
              "text": "Exactly. When I played club soccer I would feel lowkey guilty the whole time because I only paid like $100 to be there unlike everyone else. I wasn’t even that good so it was like double guilt. I had to save up from my fast food job just to pay that $100 and to buy myself a new soccer ball. Because my parents were busy paying bills. Magnified by when we had tournament fees and the coach took me aside after practice and told me not to worry about them.",
              "author": "chnlmb",
              "created": 1566231607,
              "upvotes": 3,
              "replies": {
                "exfqgjv": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exfqgjv/",
                  "text": "I feel guilty now because the softball coach said she'd help me pay this year if I can't. I know I won't be able to and I feel bad",
                  "author": "falloutkittens_",
                  "created": 1566246186,
                  "upvotes": 1,
                  "replies": {
                    "exfqpmd": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exfqpmd/",
                      "text": "Maybe I should practice what I preach but don’t feel bad just grateful that someone believes in you enough to help",
                      "author": "chnlmb",
                      "created": 1566246333,
                      "upvotes": 2,
                      "replies": {
                        "exg5ckg": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exg5ckg/",
                          "text": "Yeah you're right",
                          "author": "falloutkittens_",
                          "created": 1566255835,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ewx3rhl": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx3rhl/",
      "text": "Live this so much it seems that it has become a competition to see who receives the most aid for being poor but the struggles taken to receive that aid are nothing to be wished upon anyone",
      "author": "Lizthebiz77890",
      "created": 1565843348,
      "upvotes": 69,
      "replies": {}
    },
    "ewx612u": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx612u/",
      "text": "You're correct, people ignore the fact that even with a full ride the poor kid is often relatively unprepared for a college life, just because they're given good aid doesn't mean all the other issues they deal with because they're poor suddenly go away.",
      "author": "CornHellUniversity",
      "created": 1565845650,
      "upvotes": 49,
      "replies": {}
    },
    "ewxpj77": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxpj77/",
      "text": "I think 70% of my media consumption is American, but reading these comments is really an eye opener to the \"daily\" struggles middle class and poor Americans go through, it's a part of USA that gets very little coverage. \n\nI really symphesize with your problems, and I hope it works out well for all of you. \n\nI live in a country with free education and student loans and scholarships for all, so these problems are basically non-existant. \n\nPeople in this age group worry about selecting the bachelor or masters degree that's right for them. Finding a good place to live and worry about moving out from mom for the first time. \n\nThe shit many of you guys go through is mind boggling and really gives me a new sense of respect for anyone that manages to overcome these obstacles and get a degree. Good luck",
      "author": "kjs_music",
      "created": 1565865306,
      "upvotes": 18,
      "replies": {
        "ewzfxzq": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzfxzq/",
          "text": "[deleted]",
          "author": null,
          "created": 1565895373,
          "upvotes": 2,
          "replies": {
            "ex1cgiu": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex1cgiu/",
              "text": "You could choose not to collect the loan but that's financially stupid as the interest is very low and the payback plan is very long term. It's also set up so that if you finish your degree the scholarship kicks inn an reduces the loan by 50%. \n\nIncome tax is pretty high. It's progressive so the more you earn the more % you are taxed. But people are happy with what they get in return so there is really not many complaints..",
              "author": "kjs_music",
              "created": 1565939135,
              "upvotes": 0,
              "replies": {
                "ex50d3r": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex50d3r/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1566014305,
                  "upvotes": 2,
                  "replies": {
                    "ex5v826": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex5v826/",
                      "text": "Sure, if you got the money US is best, for the majority of the population this model is better I believe",
                      "author": "kjs_music",
                      "created": 1566032791,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ewx1e60": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx1e60/",
      "text": "I’m poor in college and I stayed over for the summer to work in my research lab. The dinning hall has been closed for 2 weeks and I can only afford to eat once every other day",
      "author": "VeryVeryValentine",
      "created": 1565841131,
      "upvotes": 37,
      "replies": {
        "ewx2fi0": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx2fi0/",
          "text": "That’s not good. I know lots of campuses are trying to figure things out.  Is there a food bank you can go to near by?",
          "author": "admissionsmom",
          "created": 1565842066,
          "upvotes": 24,
          "replies": {
            "ewxyqd9": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxyqd9/",
              "text": "They have one at my university but I’m embarrassed to go to it since the first time I went everything I got was infested with bugs",
              "author": "VeryVeryValentine",
              "created": 1565871283,
              "upvotes": 10,
              "replies": {
                "ewy1v7k": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy1v7k/",
                  "text": "Yuck. But don’t not eat. Go and get food that’s not infested with bugs. You don’t need to be embarrassed — that’s why they are there. Be proud that you are there and taking good care of yourself while you’re in college. You have to eat or you won’t be able to get your work done.",
                  "author": "admissionsmom",
                  "created": 1565872989,
                  "upvotes": 13,
                  "replies": {}
                },
                "ewyjojo": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyjojo/",
                  "text": "Don't be embarrassed!  They would probably be mortified to know that the food they provided was not edible.  Hopefully that won't be the case the next time; hopefully you can also get some fully sealed (canned) items to be sure.  At any rate you can let them know. \n\nMy university recently opened a food bank and it is prettily heavily used.  And not just by people who come from poor backgrounds but also by people who are in a temporary tight spot.  It's not like you get imprinted with a badge of shame for going there.  It's there for a reason, and you should use it.",
                  "author": "FeatofClay",
                  "created": 1565882223,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ewx9wdi": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx9wdi/",
      "text": "Thank you. I was hoping someone would say this soon. This sub is so... elitist, almost every person on here comes from a decently wealthy background (i.e. they have a house and live comfortably, can afford to apply to college, etc.) yet they act like they have nothing.\n\nMiddle and upper class people who like to pretend their poor never fail to irk me. It's like those YouTubers nowadays who say \"omg I'm broke!\" for attention and relatability.\n\nMy family income is over 100k, and we live in the San Francisco Bay so it's really not THAT high (my brother's rent is $2k/month), but it could be worse. I got no aid for where I go to school (UC Berkeley) and it sucks, but I'm still luckier than those who came from less money who got aid.\n\nPoor people will always, ALWAYS, have it worse than middle-class people who can afford 3 meals everyday, school supplies, actually applying to college (application fees), etc. all without worry. You can still complain and be stressed about your financial situation if you're middle class, that's normal, but don't pretend to know what it's like to be poor.",
      "author": null,
      "created": 1565849946,
      "upvotes": 69,
      "replies": {
        "ewy198n": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy198n/",
          "text": "My family and I are the bottom of the barrel lower middle class/high range of poverty line.\n\nMy son was able to get over $25k in scholarships to one school, and $22k to another.  He *still* would have had to take out $22k and $20k in loans, respectively, each year!\n\nWe laid out all the numbers for him, including the fact that because we make so little that he could go to our local community college for free.\n\nI know he really wanted to go away, he had been offered money to come and play college level competitive video games (yes, that's a thing) and be part of teams and a developing college sport.\n\nHe decided to stay home and go to community college.\n\nIt's heartbreaking that he had to pass up great opportunities for the field he hopes to go into because he's terrified of a lifetime of debt.  Yes, he did get a lot of money offered, but most colleges are like, we gave you money, just take it loans, duh!",
          "author": "3Gloins_in_afountain",
          "created": 1565872661,
          "upvotes": 17,
          "replies": {
            "ex05owf": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex05owf/",
              "text": "Which game if you don't mind me asking? League of legends?",
              "author": "PillowDan",
              "created": 1565905533,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ewzqzw6": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzqzw6/",
          "text": "Go bears",
          "author": "pr3st0n192",
          "created": 1565899468,
          "upvotes": 2,
          "replies": {}
        },
        "ex0pnu7": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0pnu7/",
          "text": "Bro 2k/month damn that's hella cheap for SF",
          "author": "cooldude_127",
          "created": 1565919099,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ewx0rql": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx0rql/",
      "text": "YES AGREE. Like I need to get most of my tuition paid. I can't pay for room and board. I won't have enough for books or dorm supplies or food. I'll have to work in college which is even more stress (used to it though have had a job for 3 yrs) and then after college I won't have my dad's income to fall back on because we have like no income. I'll have to leave college and be able to pay all my bills and all of my expenses with NO HELP FROM ANYONE. I don't want to be in debt forever but I also want a good education and I love learning. There are so many expenses that poor people can't pay that aid doesn't cover. At least middle class people can always afford food and new stuff and a car or whatever and they really think that only get some aid is the end of the world when In reality they have their parents to fall back on in times of need and poor people have literally nothing and don't get financial support at all",
      "author": "bakedcowboyy",
      "created": 1565840593,
      "upvotes": 53,
      "replies": {
        "ewxm000": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxm000/",
          "text": "[removed]",
          "author": null,
          "created": 1565862142,
          "upvotes": -10,
          "replies": {
            "ewxnp77": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxnp77/",
              "text": "It doesn’t matter that you can’t afford the car and new stuff. You can live without those. But when it comes to actual NEEDS, I’m sure you do just fine since you’re middle class. Also, at least you’re parents can help when you need it. I only have one parent and she made literally less than $10,000 last year. You’re complaining about how you’re parents won’t give you money because they’re saving for retirement, while there are people who can’t take care of basic needs.",
              "author": "maestro_times_2",
              "created": 1565863674,
              "upvotes": 14,
              "replies": {
                "ewy21qi": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy21qi/",
                  "text": "*You’re complaining about how you’re parents won’t give you money because they’re saving for retirement, while there are people who can’t take care of basic needs*\n\nNot to mention, but somehow I imagine that when the time comes that your mom can't work anymore, that's going to affect you financially in some capacity.  Whether you move back home to pay rent or send money for bills, unless you have a toxic parent it's likely that you (and others in your position) will do what you can to take care of her.  Especially if you still have siblings at home.\n\nThat's something middle class kids generally don't have to worry about, at least not to that degree.",
                  "author": "3Gloins_in_afountain",
                  "created": 1565873085,
                  "upvotes": 6,
                  "replies": {}
                },
                "ewy83f6": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy83f6/",
                  "text": "> But when it comes to actual NEEDS, I’m sure you do just fine since you’re middle class\n\nYoo fuck off with this. This sounds so fucking judgemental - I'm sorry.\n\nMy mom was the sole bread winner in our family. I really can't count how many times she's fretted about not having enough to pay for food or the house despite making 70-90K as we grew up. Even now, she just started making 90K and we have a broken sink she can't afford to fix. 75K is a middle class salary but we still had to pay a gross 20K per year at UPitt (before she lost her job and I just couldn't go at all.)\n\nSoo even with a middle class salary, people can still struggle, maybe not as much as a household with less income, but I'm tired of yall pushing like you have the worst situation so only you have the right to feel sorry for yourself and anyone who isn't your definition of poor and is still complaining about their situation has no right? Fuck off with that.\n\nEveryone's situation is different. You're about to go to college most likely. You better learn that really quick or you are going to seem really judgmental and not well liked in college and beyond, even if people are \"nice\" and don't say anything. \n\nSorry but this thread really urks me.",
                  "author": "StardustNyako",
                  "created": 1565876518,
                  "upvotes": 1,
                  "replies": {
                    "ewyk7c0": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyk7c0/",
                      "text": "You have the right to feel sorry for yourself but it doesn't make sense for you to say you have it worse than poor people. Which is the point of this post.",
                      "author": "collegeappTHROW20",
                      "created": 1565882482,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "ex08bli": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex08bli/",
                      "text": "Oh you have it so hard. Poor you :>(",
                      "author": "shadowpreachersv",
                      "created": 1565906955,
                      "upvotes": 1,
                      "replies": {
                        "ex08pwe": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex08pwe/",
                          "text": "Why don't you read the post before giving a sarcastic response.",
                          "author": "StardustNyako",
                          "created": 1565907218,
                          "upvotes": 0,
                          "replies": {
                            "ex0a3y3": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0a3y3/",
                              "text": "#middleclasssuffering",
                              "author": "shadowpreachersv",
                              "created": 1565908117,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "ewyt8m3": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyt8m3/",
                      "text": "Wasn’t being judgemental. If I came off that way, then I’m sorry, but that wasn’t my intention. \n\nWasn’t saying people in the middle class don’t struggle. My point was that it’s less likely that middle class people will have to worry about paying for things like food or rent or whatever. \n\nWasn’t trying to say I have a worse situation. I was trying to give my own example as a way to provide perspective. \n\nDidn’t say people had no right to complain about their situation. \n\nIt’s fine if you disagreed with me. But there was no need for you to be rude.",
                      "author": "maestro_times_2",
                      "created": 1565886461,
                      "upvotes": 0,
                      "replies": {
                        "ewytqy6": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewytqy6/",
                          "text": "Sorry that I was rude, I should not have been but I was fed up with all the assumptions being made here with how much bull shit I, as a middle class person went through, looking at a thread where people acted like being poor is always the absolute worst thing ever.",
                          "author": "StardustNyako",
                          "created": 1565886659,
                          "upvotes": -1,
                          "replies": {
                            "exh02ks": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exh02ks/",
                              "text": "Being poor is always the absolute worst thing ever. What? Getting financial aid doesn’t mean shit when you can’t afford food or book. Being poor is always awful. It’s this lingering sense that if you waste any money ever then you’ll regret it. Its having this pressure to preform higher than average in terrible stressful conditions or risk losing the only way to be able to afford education to end he cycle of poverty. Like I get that you have your middle class woes or whatever you don’t make statements where you act like being poor can be a good thing",
                              "author": "chnlmb",
                              "created": 1566283830,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ewxod1c": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxod1c/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1565864247,
                  "upvotes": -3,
                  "replies": {
                    "ewxpulc": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxpulc/",
                      "text": "I didn’t say middle class people could buy new cars. And I get that this sub is about applying to college. But that doesn’t change the fact that the people here who have been complaining about being middle class severely lack perspective. Middle class people here complain about not being able to afford to go to super expensive private schools, when state schools are cheaper, community college is an option, and there are lots of merit scholarships that exist. It may seem like poor kids can afford college more because of schools that meet full financial need, but the fact is, there aren’t a lot of schools that do that. And the ones that do are very competitive. If a poor kid can’t get into one of those schools, which is more likely, then they will struggle to pay for college more than a middle class kid would.",
                      "author": "maestro_times_2",
                      "created": 1565865549,
                      "upvotes": 11,
                      "replies": {
                        "ewy3a6q": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy3a6q/",
                          "text": "Piggybacking on your comment,  statistically speaking lower income high school students are more likely to have jobs during the school year and are more likely to work more hours.  They often are also responsible for helping out with housework and child care of siblings.\n\nIt's hard to concentrate to study when your heat has been turned off in the winter and you can see your breath inside.  It's hard to get work done when you don't have power and may or may not be able to afford candles.  It's hard to focus during class when you're exhausted from working late. It can be hard to get to school on time if you are having to use public transportation or walk in potentially bad weather.  Tardiness affects your grades, too.\n\nDisclaimer, I did not grow up poor.  I did know people who were close to it, especially as I got older, to get an idea of what that could be like.  As an adult, events beyond our control have drastically reduced out earning potential.  Things are tight.  We are still not in these straights, but I can see how it could happen, and I can guess how the difficulties of poverty complicate everything. It's not just \"being poor\".  It's about have few to no options, and then others who are better off tell you to work harder.\n\nEmpathy goes a long way.",
                          "author": "3Gloins_in_afountain",
                          "created": 1565873767,
                          "upvotes": 9,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ewx2r1b": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx2r1b/",
      "text": "Poor international male non urm student has it the worst",
      "author": "Thisisathr0waccount",
      "created": 1565842364,
      "upvotes": 62,
      "replies": {
        "ewx62g8": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx62g8/",
          "text": "Lol, that person doesn’t have a single shot at any college.",
          "author": null,
          "created": 1565845691,
          "upvotes": 18,
          "replies": {}
        },
        "ewx8fzq": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8fzq/",
          "text": "[deleted]",
          "author": null,
          "created": 1565848334,
          "upvotes": 5,
          "replies": {
            "ewxa44j": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxa44j/",
              "text": "Shit thats me",
              "author": "Thisisathr0waccount",
              "created": 1565850180,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ewxck11": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxck11/",
          "text": "I know a guy like this who applied for CS.",
          "author": "DarkerSamurai",
          "created": 1565852494,
          "upvotes": 3,
          "replies": {
            "ewxik6o": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxik6o/",
              "text": "If you see my post history lmao",
              "author": "Thisisathr0waccount",
              "created": 1565858519,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "ewx4ymx": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx4ymx/",
      "text": "Hundred times louder for everyone please. Understandably to go to a good college, you gotta work hard. But poor kids just had it alot harder throughout k-12. Sometime people forgot that because they are middle class they already received alot more resources than the poor kids. Better school, more free time, guidance through school etc. Those are things poor kids lacked growing up. For them to grow up and qualified to be in the same school as another kid with adequate resources is hard. Yet some middle classes don't see that. They envy the figures poor kids received, but did not see the resources they had growing up. Financial aid help make the situation equal, for middle classes to complain is ridiculous. Your enemies shouldn't be those poorer than you.",
      "author": "francisbaconcantdraw",
      "created": 1565844531,
      "upvotes": 40,
      "replies": {
        "ewy3xfu": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy3xfu/",
          "text": "Poor kids are also less likely to be involved in extra curricular activities that look so good on college applications because they can't afford to pay the fees or buy the equipment, because they can't get transportation, or because they simply don't have the hours available for it as they may be working it taking care of siblings.",
          "author": "3Gloins_in_afountain",
          "created": 1565874129,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "ewx53h5": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx53h5/",
      "text": "Plus poor kids who attend college while working and taking care of their families back home. Going to college doesn’t mean your family can afford to lose the extra income, especially when your parents lose their jobs or are disabled. \n\nAnd then you have to stress about the mandatory fees, like the meal plan, and feel guilty when your parents skip meals so you can go to school.",
      "author": "cookiebinkies",
      "created": 1565844666,
      "upvotes": 17,
      "replies": {}
    },
    "ewxfjuv": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxfjuv/",
      "text": "I must agree. I went to a small college that didnt have a dorm, so I stayed with my parents. I cant drive because my eyesight, but Im too poor to fix it. So my mother drove to me to and from campus every day. Just sat in the parking lot for hours on end. But one day, the car broke down. I couldnt go back. And we didnt have the money to fix it, or to afford a bus ride every day. I dropped out. And Ive sadly never been able to go back.",
      "author": "RaikouGilgamesh",
      "created": 1565855482,
      "upvotes": 10,
      "replies": {}
    },
    "ewx0que": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx0que/",
      "text": "I agree with all but one thing. Many times college give subsidies to students with financial aid to help pay for daily expenses like food and books. But other than that yeah, you’re right.",
      "author": null,
      "created": 1565840571,
      "upvotes": 88,
      "replies": {
        "ewx1tld": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx1tld/",
          "text": "How common are these? I'm not denying their existence, I'm just not familiar with any that do this (because I probably would've applied to schools that do this if I'd known haha)",
          "author": "throwaway814a",
          "created": 1565841513,
          "upvotes": 52,
          "replies": {
            "ewxlrp2": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxlrp2/",
              "text": "They’re very rare. I grew up lower class, college was a significant burden and I could never thank my parents sacrifices enough to allow me to go, because I couldn’t have without them.\n\nFor subsidies, you pretty much need to be homeless to get them.",
              "author": null,
              "created": 1565861926,
              "upvotes": 8,
              "replies": {}
            },
            "ewx3ecr": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx3ecr/",
              "text": "I’m not exactly sure but many Ivies have them (one of the reason I would want to apply). I think they are relatively common with full financial aid students. It seems like most schools with full needed aid met have them as well",
              "author": null,
              "created": 1565842988,
              "upvotes": 8,
              "replies": {
                "ewx6bd0": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6bd0/",
                  "text": "Hello! Reality knocking here: Ivy League schools educate a tiny fraction of the United States college freshmen in any given year. You might as well talk about lottery winnings as a means of financing college.",
                  "author": "Cargobiker530",
                  "created": 1565845957,
                  "upvotes": 44,
                  "replies": {
                    "ewx6fmx": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6fmx/",
                      "text": "that is true. State schools won’t help with these expenses at all. Or if they do, it’ll be at most $150 for textbooks. which is laughable.",
                      "author": "cookiebinkies",
                      "created": 1565846087,
                      "upvotes": 28,
                      "replies": {
                        "ewylgd6": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewylgd6/",
                          "text": "> State schools won’t help with these expenses at all. Or if they do, it’ll be at most $150 for textbooks. \n\nWhile I agree that it is not appropriate to say that \"many\" colleges give subsidies, I don't believe it is accurate to say that no state college will help, or that state colleges budget low figures for books.",
                          "author": "FeatofClay",
                          "created": 1565883088,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "ewx9eys": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx9eys/",
                      "text": "to get into an ivy is also pretty expensive considering SAT prep and a good highshool to have good ECs",
                      "author": null,
                      "created": 1565849393,
                      "upvotes": 9,
                      "replies": {
                        "ewxafon": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxafon/",
                          "text": "The occasional homeless kid gets in whereupon they discover they aren't flying to Cancun for winter break like their \"peers\" nor are they skiing Jackson's Hole. It sounds like a four year sentence in Hell TBH.",
                          "author": "Cargobiker530",
                          "created": 1565850469,
                          "upvotes": 12,
                          "replies": {}
                        }
                      }
                    },
                    "ewx6kgm": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6kgm/",
                      "text": "It’s not only Ivies...it’s most schools that meet full demonstrated need (and the number of schools that do that is growing)",
                      "author": null,
                      "created": 1565846234,
                      "upvotes": -3,
                      "replies": {
                        "ewx9700": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx9700/",
                          "text": "You still believe in the Tooth Fairy too?",
                          "author": "Cargobiker530",
                          "created": 1565849140,
                          "upvotes": 12,
                          "replies": {
                            "ewysdr4": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewysdr4/",
                              "text": "Please explain.",
                              "author": null,
                              "created": 1565886111,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ewx68tx": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx68tx/",
                  "text": "doesn’t apply to health insurance or travel though. I turned down UPenn because couldn’t afford to buy the health insurance when I was on out of state Medicaid.",
                  "author": "cookiebinkies",
                  "created": 1565845882,
                  "upvotes": 16,
                  "replies": {
                    "ewx6dve": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6dve/",
                      "text": "Wow, that is a really tough situation...seems a bit niche though, right? Are there many people that have had the same problem as you? Why I’m voting for Bernie in 2020 lol\n\nEdit: We can all take a lesson from your experience; if at first you don’t get a financial aid package that fits your needs, request a review from the AOs and many times you’ll be able to have your decision appealed. Not having health insurance seems like a bad way to not go to a certain school",
                      "author": null,
                      "created": 1565846034,
                      "upvotes": 4,
                      "replies": {
                        "ewx6s8f": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6s8f/",
                          "text": "I know two other people who turned down great schools for similar reasons. But they also had other factors such as family being sick and wanting to take care of them. The other person wanted to commute to a college since she had a job and her family needed her income.",
                          "author": "cookiebinkies",
                          "created": 1565846476,
                          "upvotes": 10,
                          "replies": {
                            "ewx6tqz": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6tqz/",
                              "text": "Was health insurance necessary to be enrolled in the school or could you have skipped out on it?",
                              "author": null,
                              "created": 1565846523,
                              "upvotes": 2,
                              "replies": {
                                "ewx714f": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx714f/",
                                  "text": "mandatory i think. At least when I got into the school. \n\nBut even if i didn’t get insurance at uPenn, my first semester at college I ended up with crazy health issues (seizures, coma, muscle spasms) and ended up in the hospital 5 times. I withdrew from college until the health issues resolved and now I’m applying to schools again.",
                                  "author": "cookiebinkies",
                                  "created": 1565846757,
                                  "upvotes": 11,
                                  "replies": {
                                    "ewx73fd": {
                                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx73fd/",
                                      "text": "Ahh I had assumed you were otherwise healthy. I can see why it’s so important now",
                                      "author": null,
                                      "created": 1565846830,
                                      "upvotes": 2,
                                      "replies": {
                                        "ewx75uz": {
                                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx75uz/",
                                          "text": "I actually was healthy at the time of enrollment at UPenn. It’s just it was mandatory. Thank god I did get health insurance though! Blessing in disguise.",
                                          "author": "cookiebinkies",
                                          "created": 1565846907,
                                          "upvotes": 10,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "ewy6asp": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy6asp/",
                          "text": "It is not a niche situation. I will have dental insurance for the first time in years only because my school has given me a health insurance grant for their insurance.\n\nAnd appeals are not that great— For example, my school is literally giving me aid for an EFC of 0, as in cannot offer me more than that, and I still will need to take out loans. That is not uncommon.",
                          "author": "fleurdedalloway",
                          "created": 1565875592,
                          "upvotes": 5,
                          "replies": {}
                        },
                        "ewxaubk": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxaubk/",
                          "text": "At Cornell, I had the same dilemma. I needed to purchase the school insurance, as my MassHealth wouldn’t cover me except for emergencies out of state.",
                          "author": "tatianamaries",
                          "created": 1565850856,
                          "upvotes": 4,
                          "replies": {}
                        },
                        "ewxb0sb": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxb0sb/",
                          "text": "see, Yang is so meta that he has bots on reddit to garner support.  That is clever.",
                          "author": "rockncole",
                          "created": 1565851037,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "ewx8rfg": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8rfg/",
                          "text": "if you go the socialist route, don't go bernie, join the yang gang (well don't, because socialism is fucking stupid).  But really, IF you believe in socialism as a form of establishing equity, why would you vote for an old, pandering career politician with no real economic experience who is running on promises that he could never make a reality when he was a senator.  Also, his whole platform is that the rich are evil and selfish when he himself is a millionaire; he just wants more power.  Yang is a proven businessman with charisma and a genuine belief in his ability to revolutionize the country's economic system to help people and subsequently increase output; he's spent his funds and time on philanthropy before he ever thought about politics, so his desire to establish equity (giving people what they need to survive, NOT equality) is sincere.  He also calmly and reasonably explains how his ideas could function without being expensive and tripling taxes, instead of the Ocasio-Cortez method of saying that \"we'll spend less on funerals so we can totally make up for the 30 trillion dollar deficit.\"",
                          "author": "rockncole",
                          "created": 1565848674,
                          "upvotes": -2,
                          "replies": {
                            "ewx8rpj": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8rpj/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1565848682,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ewx6cmj": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6cmj/",
                  "text": "My family didn't have enough to pay the application fees for the big schools around me. I was only able to apply to schools with no application fees, and the one I was accepted to didn't offer anything like that. Application fees suck",
                  "author": "skybob123",
                  "created": 1565845996,
                  "upvotes": 7,
                  "replies": {
                    "ewx6hkv": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6hkv/",
                      "text": "How did your fees not get waived if you couldn’t afford to pay them? That seems like a terrible situation - I know many colleges waive fees even if you don’t qualify. Make sure to ask the admissions department if you can’t afford if",
                      "author": null,
                      "created": 1565846148,
                      "upvotes": 5,
                      "replies": {
                        "ewx6oqx": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6oqx/",
                          "text": "you only get waived for three schools. \n\nEdit: Collegeboard apparently raised it to 4 schools now.",
                          "author": "cookiebinkies",
                          "created": 1565846368,
                          "upvotes": 13,
                          "replies": {
                            "ewx6q1d": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6q1d/",
                              "text": "Oh shit really? I’m fucked then lol",
                              "author": null,
                              "created": 1565846409,
                              "upvotes": 2,
                              "replies": {
                                "ewx732m": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx732m/",
                                  "text": "at least if you get free lunch or other government aid, it’s three schools. But maybe try to contact them. It won’t hurt. \n\nI only applied to three schools cause of this.",
                                  "author": "cookiebinkies",
                                  "created": 1565846819,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            },
                            "ewx84lv": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx84lv/",
                              "text": "that's not tru. my low-income friend who applied to colleges with app fees got fee waivers for every single application that she submitted",
                              "author": "memeqween101",
                              "created": 1565847991,
                              "upvotes": 1,
                              "replies": {
                                "ewx8df1": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8df1/",
                                  "text": "Wait. how??? Collegeboard only gave out 3 waivers my year.",
                                  "author": "cookiebinkies",
                                  "created": 1565848261,
                                  "upvotes": 2,
                                  "replies": {
                                    "ewx8oul": {
                                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8oul/",
                                      "text": "im pretty sure that you're supposed to reach out to schools yourself or your guidance counselor signs a form that you send to a school to get one (it honestly depends on the school but thats what I think that I'll be doing)",
                                      "author": "memeqween101",
                                      "created": 1565848599,
                                      "upvotes": 4,
                                      "replies": {
                                        "ewx8u4n": {
                                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8u4n/",
                                          "text": "wow. my guidance counselor was useless. she just gave me the college board waiver and that was that.",
                                          "author": "cookiebinkies",
                                          "created": 1565848754,
                                          "upvotes": 5,
                                          "replies": {
                                            "ewx97ws": {
                                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx97ws/",
                                              "text": "damn that sucks. i go to a private school so the counselors are v helpful. if i went to school where i live rn im pretty sure that i'd have a useless counselor as well",
                                              "author": "memeqween101",
                                              "created": 1565849170,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "ewx6xvn": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6xvn/",
                          "text": "I didn't know that was possible. I applied on my own when I was 17 and nobody told me you could get the fees waived, so when I saw the fee I just quit and didn't apply to that school. I'm happy with the school I chose though and I'm in a much better situation now. I'm not even finished with school but I have an engineering position with a manufacturing company. Education is key to overcoming poverty and everyone in a country benefits from having a population with more money. College should be free.",
                          "author": "skybob123",
                          "created": 1565846655,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "exebyp3": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exebyp3/",
                  "text": "Not even. I got into Yale and I’m extremely grateful that almost everything is covered except I’m expected to pay for textbooks. Textbooks are so damn expensive.",
                  "author": "ApplyingToUniSoon",
                  "created": 1566208556,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "ewx6n5b": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6n5b/",
              "text": "Literal 0 EFC at a UC. The college cost factors in transportation and other expenses, which the school will fully meet, be it loans or otherwise",
              "author": "pokemonareugly",
              "created": 1565846317,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ewyl2j8": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyl2j8/",
          "text": "I would clarify this a bit.  \n\nI wouldn't call these \"subsidies.\"  This is part of the calculation of the cost of attendance, so any college which meets full need would include aid to cover this kind of expense.  Food and books and personal items like shampoo are all part of the total cost of attendance.  So this doesn't come as part of some \"extra\" cash on top of the aid package; it's part of the entire aid package.  Therefore, every college should include this in their calculation of need for aid.  Whether or not that provides cash to students to meet these expenses will depend on aid policies.  It would surprise me that this is the case as \"many\" colleges.\n\nIf a college doesn't provide full aid, any aid they provide is going to be applied to tuition first, and the \"gap\" (where students have to use their own additional resources) is what will cover the living expenses and books and such.  \n\nIf the aid package includes loans, then a student might be trying to take the minimum loan as possible and therefore end up with very little money for these kinds of living expenses.\n\nAlso, some lower-income students may end up contributing to their family by sending money home or buying things that siblings need, further cutting into their ability to meet their needs.  \n\nLower-income students may find that lack of transportation, long job hours, or other factors limit their ability to shop frugally, so their expenses may come in higher than the budgeted estimate.\n\nSo **even at colleges where student aid budgets yield available cash to buy food and books, lower-income students can struggle!**  This is really important to understand.",
          "author": "FeatofClay",
          "created": 1565882904,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ewx1e5k": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx1e5k/",
      "text": "Yeah this sub is elitist af you will come to realize. I pride myself on my upbringing as mostly lower class first gen who worked hard to get into top schools. Others had the resources from the get go. Still, many many more have it worse than me, so realistically all these complaints should subside.",
      "author": "FinalPush",
      "created": 1565841131,
      "upvotes": 44,
      "replies": {
        "ewx1xtu": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx1xtu/",
          "text": "Certainly. This is more about countering the attitudes on this sub about middle class struggles. I wouldn't have made this post if it didn't feel merited by the sub's behavior - I also know that there are countless people in far worse situations than me, and I try to avoid complaining about my situation.",
          "author": "throwaway814a",
          "created": 1565841620,
          "upvotes": 14,
          "replies": {
            "ewx3zlz": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx3zlz/",
              "text": "I wouldn’t call this post a complaint but an observation on the unfair attitudes here in this sub. I’m certainly on your side with this... trust me I’m sick of the elitism sometimes.",
              "author": "FinalPush",
              "created": 1565843568,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "ewx3mvw": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx3mvw/",
      "text": "That post is really fucking dumb like I get the idea but damn poor people have more to worry about than getting aid for a portion of their overall bills",
      "author": "nerdymen242424",
      "created": 1565843222,
      "upvotes": 28,
      "replies": {}
    },
    "ewxlxg9": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxlxg9/",
      "text": "genuine question\nfinancial aid doesn't cover living expenses, sheets, food etc.? i was under the impression that you were allowed to use scholarships for anything remotely close to being a college expense. or is that only the case for \"scholarships\", i.e. third-party application based scholarships, when you're primarily talking about need-based governmental financial aid or first-party institutional financial aid? \n\nI agree/understand though. My family is definitely middle class, because my dad works 60+ hours every week at a factory job he's had for 35 years, and so we technically make in the range of 100k a year. But my parents had a business they started fail in the crash of 2012... that left us over half a million in debt. So for the past decade we've been penny-pinching. My mom started couponing, and got multiple side jobs; when I was 15, I got my first job and have now been working part time pretty consistently, for over 3 years. \n\n\nWe haven't been to the point of struggling to put food on the table in a while. But for the longest time I've been aware that I have no college fund from them, and they will have little to no extra money to help me with. And that's a huge factor why I chose to start working as early as I could reasonably, and am going to a community college for my first 2 years while continuing to work part or possibly even upping to full time. Sknce my household income is so high on paper, but our net budget after bills, debt payments etc. is so low, I felt crushed by both sets of expenses when looking at the numbers. I'm not saying my situation is worse than one of someone who genuinely does have no money and no/heavily underpaying source of income though. I see friends trying to survive on even 15$ an hour for skilled job pay and it's... terrifying and heartbreaking, and I am thankful for everything I do have and the opportunities and luck I have had in my life. Just wanted to point out that a high middle class income doesn't directly equate to being able to handle normal expenses outside of tuition, sometimes it can mean not being able to handle either\n\nI apologise for rambling on your post. I do that a lot on Reddit. \nI hope you can find a way to get your needs met, and that everything goes well for you throughout your journey. ♥️ May your life be fulfilling, and all your dreams come true except for one, so you always have something to strive for.",
      "author": "PornAccountForAnts",
      "created": 1565862075,
      "upvotes": 7,
      "replies": {
        "ewy7d3l": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy7d3l/",
          "text": "It depends on the school! You’ll just need to examine your financial aid offers as closely as possible once you get them. Also, let me know what state you’re in, and I might have more advice. Otherwise, some schools offer transfer grants specifically.",
          "author": "fleurdedalloway",
          "created": 1565876148,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ewxt0ya": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxt0ya/",
      "text": "Exactly. My school ran out of fee waivers, and so we had to find money that wasn't there to pay for the SAT for me, and I felt awful about being the cause of such financial strain. I'm sympathetic to middle class kids, but being poor fucking sucks.",
      "author": "Artist552001",
      "created": 1565867703,
      "upvotes": 7,
      "replies": {}
    },
    "ewyf23j": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyf23j/",
      "text": "Goddamn, thank you.\n\nThat other post pissed me off so much.",
      "author": "PhoenixPhighter4",
      "created": 1565879962,
      "upvotes": 6,
      "replies": {}
    },
    "ewyk07i": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyk07i/",
      "text": "I know of a poor person at my high school who had to work to support her family and HAD to deal with shitty employers in order to survive while taking the same number of AP and Honors classes as everyone else without any access to SAT classes. She got into prestigious schools through Questbridge but couldn't go because she didn't get enough aid to afford it, but still got a full ride at a UC. If she didn't, she would be at a community college well beneath her caliber, unlike you middle class kids, who certainly would/do take out loans to go to a good school. And that's the difference - middle class students have way more options and aren't tied down the same way poor kids are due to the ability to realistically take out loans.",
      "author": "collegeappTHROW20",
      "created": 1565882383,
      "upvotes": 6,
      "replies": {}
    },
    "ewykvp8": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewykvp8/",
      "text": "Yeah well being poor effects small choices too. When I first started I HAD to take only online classes because the bus ride was 6$ there and back, and the ‘offer’ they gave me at school for a discount on metro was a 250$ card worth 500$. Was shitty having to explain that yes it’s a good deal but I don’t have the extra 6$ for one ride.",
      "author": "xcasandraXspenderx",
      "created": 1565882810,
      "upvotes": 4,
      "replies": {}
    },
    "ewx16z0": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx16z0/",
      "text": "[deleted]",
      "author": null,
      "created": 1565840956,
      "upvotes": 38,
      "replies": {
        "ewx1qzn": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx1qzn/",
          "text": "I'd reckon you're right in most scenarios, but the culture on this sub seems very heavy on \"middle class gets fucked over the most.\" It's on the front page at least once a week. This post wasn't drawn out of me thinking that myself and other poor kids are so pitiful, but out of seeing countless posts with far too many upvotes claiming that the grass is greener for poor kids.",
          "author": "throwaway814a",
          "created": 1565841448,
          "upvotes": 26,
          "replies": {
            "ewx66x4": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx66x4/",
              "text": "Reddit in general is largely middle class white men aged 16-24, so the fact that this sub is no exception shouldn't really surprise anyone",
              "author": "Thorsigal",
              "created": 1565845824,
              "upvotes": 12,
              "replies": {
                "ewxa4pw": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxa4pw/",
                  "text": "That doesn't mean that demographic can't learn from the smaller percentage of poor, poc, female, etc of people who do exist on this sub and reddit in general. It's not surprising that this sub has a lot of opinions that cater to that demographic, but posts like this are still important to not just give the average white guy a reality check but also be a comfort for the minority or redditors who are here too.",
                  "author": "ToucanDantheman",
                  "created": 1565850198,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ewxrcnx": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxrcnx/",
      "text": "I mean the fact that I’ve seen many middle class kids here say that they’ve got it worse than poor kids because they can’t go to Harvard or Stanford or Duke because they didn’t get enough aid is already a huge showcase of their privilege. For poor kids these schools usually aren’t even an option. I know I didn’t even think about them, even when I actually had the stats for some early on in HS. \n\nI have poor friends who literally could not even afford community college which was only about 2k a year unless it was subsidized or they got grants to pay for it, but even then they struggle with the overall living cost of it because at CC they still have to struggle with living life without money at home. I have 3 friends who have been working at fast food/gas stations for the past 3 years post HS graduation because they cannot even afford transportation to our community college which is 30 min away. So they’re literally saving for years just for transportation to go to CC. \n\nMyself personally, I’m lower middle class and my parents did great with financial planning but I’ve never even considered going out of state or going to any college where my scholarships or dual enrollment wouldn’t go with me. \n\nHonestly, a lot of middle class kids here are angry at themselves and their parents for not thinking ahead, which is an understandable way to feel, but it in no way makes their lives comparable to kids who are actually poor. I knew that being lower middle class I needed to work around that bc I didn’t get a lot of aid so I took free dual enrollment classes and saved 1 free year’s worth of college and only looked at schools where my aid would transfer and that would be in state. \n\nIt’s crazy to me how so many middle class kids here casually flex these out of state schools with tuition being 60k+ as being their “only” options and then compare themselves to poor people. I’m going to have a hard time believing anyone who claims that they’re poor but acts like CC doesn’t even exist as an option in their world. \n\nLike, many poor people cannot even afford transportation to get to these out of state schools in the first place. \n\nAt the end of the day college is a personal responsibility imo, not something that your parents must help you with (though I think they should), and if a middle class kid did not take advantage of work, dual enrollment, scholarship application, etc opportunities they should not think that they are comparable to a poor child when they’ll still likely be able to go to CC without a worry in the world about their next meal or buying a few books. Really ridiculous to me how many “my parents make 120k+ a year but I’m not gonna be able to afford duke I’m so poor ugh” comments I’ve seen. It’s just insulting to the poor kids who have only had CC as an option their entire lives. \n\nAnd for a reference if it helps im now attending Clemson and my tuition is fully covered by scholarships/aid except for a few thousand each semester which I and my parents can cover fine for 3 years bc I planned ahead & saved & can graduate early due to that. Had I not planned ahead I would suck it up and attend CC. \n\n(So I agree op)",
      "author": "petiterunner",
      "created": 1565866604,
      "upvotes": 9,
      "replies": {}
    },
    "ewyaum5": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyaum5/",
      "text": "Obviously being a poor leaves you worse off than being middle/upper middle class. It's just that 99% of kids from those classes have literally never experienced hardship that wasn't just basic school stress and so the first time their parent's wealth actually works against them in any way they freak out and decry discrimination and write essays ranting about how life is unfair. \n\nConversely, when being wealthy works in their favor (i.e. their entire lives) they don't notice the benefits it brings.\n\nI attend a pretty good school and there have been many times I was legitimately *shocked* at the caliber of my classmates, I have had class with honest to god geniuses and I've also had classes with people where I couldn't understand how they even graduated high school (I have a couple funny stories). All those dumbass kids in my classes came from private schools that send a lot of people to my school every year, while the kids from legitimately poor backgrounds tend to fall into that genius category more often than not.",
      "author": "tacopower69",
      "created": 1565877872,
      "upvotes": 7,
      "replies": {}
    },
    "ewxdwmc": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxdwmc/",
      "text": "Thank you for some sanity",
      "author": "Racculo",
      "created": 1565853790,
      "upvotes": 4,
      "replies": {}
    },
    "ewykde9": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewykde9/",
      "text": "You’re totally right. I have a friend who is entering her freshman year and has a family who is financially struggling. Not only is she gonna have the financial burden you mention but she also had to fill out the FAFSA by herself with no help from her family and she had to figure out loans and other things that parents usually help with by herself. I don’t envy her and I feel bad for what she had to go through just to get admitted to college",
      "author": "Weeziebob",
      "created": 1565882566,
      "upvotes": 4,
      "replies": {}
    },
    "ewylxcw": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewylxcw/",
      "text": "Thank you for posting this.  I am sorry you had to use a throwaway (although I 100% understand why).  You deserve the karma this honest post earns!\n\nIt is hard for people to look beyond their own situation sometimes (it's human nature) and it's really valuable when we are made to see the world from a different perspective.",
      "author": "FeatofClay",
      "created": 1565883291,
      "upvotes": 4,
      "replies": {}
    },
    "ewzrxss": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzrxss/",
      "text": "Yea I think middle class kids think their life is tough in college because their standard of a \"good life\" is so much higher, so when they are forced to skimp to the first times in their lives they feel like they've suddenly hit the poverty level.\n\nMental health services, family support networks, transportation, heating and electricity, even proper nutrition, these are things most who are privileged enough to be in the middle class consider to be basic necessities, yet are things lower class kids don't have access to on a daily basis. \n\nSo middle class kids, although its easy for us to feel bitter when we compare our selves to the uber-wealthy, who can enjoy the finer things in life without a care in the world, but it's important to have perspective and keep in mind that there are so many who are far less fortunate than us.",
      "author": "AdmiralYi89",
      "created": 1565899863,
      "upvotes": 5,
      "replies": {}
    },
    "ewx0xys": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx0xys/",
      "text": "Amen to that. I'm poor too, and while me and my family have some of the things we need to survive, we can't really afford to splurge or buy things that aren't cheap. Some wiggle room is better than none at all. \n\nAlso, because of our situation if things don't improve in the future or if I can't find a way to pay for most of the things that college would want to charge me I probably won't go at all.",
      "author": "Randomusername919192",
      "created": 1565840741,
      "upvotes": 14,
      "replies": {}
    },
    "ewx3tlg": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx3tlg/",
      "text": "Say it louder for the kids who whine about their parents making over 100k in the back",
      "author": "DankusMemus_TheDank",
      "created": 1565843407,
      "upvotes": 36,
      "replies": {
        "ewy72j0": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy72j0/",
          "text": "EVEN IF you live in the Bay Area. I grew up in the Bay Area. I had such a distorted idea of what “poor” meant because in middle school and high school, my friends would always complain about being poor; so I thought we were the same.\n\nNo, you aren’t poor just because your family pays high property taxes on your 2-story house in the suburbs and can only go on one vacation a year, Samantha.",
          "author": "fleurdedalloway",
          "created": 1565875996,
          "upvotes": 9,
          "replies": {
            "ex00fnw": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex00fnw/",
              "text": "But, but... we had to buy our second car USED!",
              "author": "FeltIOwedItToHim",
              "created": 1565903196,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ewxdk3d": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxdk3d/",
      "text": "ikr?\nat least middle class kids can cover their tuition expenses partly (sometimes even fully!) with scholarships from non-govermental organizations/funds if they bother to apply. also, their relatives are there to help them if  they need money for anything college-related.\n\non the other hand, the only thing that poor folks can do to support themselves during college time is work. for them, there is nobody to fall back on financially - simply because their family doesn’t have any resources. hence stress and anxiety.\n\ngiven that, i highly recommend looking at outside scholarships if you’re middle class. and please-please, never disregard what poor people are going through - even if their need is “full met” at college, it might not be so in reality.",
      "author": "xenn322",
      "created": 1565853473,
      "upvotes": 7,
      "replies": {}
    },
    "ewx02u1": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx02u1/",
      "text": "Completely agree, someone always has it worse than you and we should be grateful that we have what we have",
      "author": "rpm3c",
      "created": 1565840008,
      "upvotes": 22,
      "replies": {
        "ewx342o": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx342o/",
          "text": "I disagree with that, Yes, saying poor kids have it worse is wrong and untrue. I do agree with OP. But I also hate when people try to shut down valid complaints about the way things are because it’s worse for some people. Obviously it is, there’s only one person in the world who that’s not true for. Doesn’t mean you should automatically be happy with the status quo.",
          "author": null,
          "created": 1565842707,
          "upvotes": 35,
          "replies": {
            "ewx5dq1": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx5dq1/",
              "text": "Yeah, you see the difference here is the in the rhetoric. Nobody is getting shut down for saying it they have it rough in high school - everyone has it rough applying to college.\n\nIt's kids wishing they were literally in poverty because they have absolutely no perspective.",
              "author": "whymauri",
              "created": 1565844960,
              "upvotes": 17,
              "replies": {}
            }
          }
        }
      }
    },
    "ewxs9g3": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxs9g3/",
      "text": "100% agree. I’m middle class and while I do think that we get screwed over frequently, I would never want to be worse off just to get more aid.",
      "author": "Soupy314",
      "created": 1565867229,
      "upvotes": 7,
      "replies": {}
    },
    "ewxuyk3": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxuyk3/",
      "text": "What really sucks is when you’re poor as fuck, but your family starts moving up so the very year that you guys finally start being alright, all of the aid that you were going to get gets gone because of an extra thousand dollars a year over the limit. Now you have to find a way to pay for college without the aid that you thought was coming.",
      "author": "BFRSpaceX",
      "created": 1565868939,
      "upvotes": 3,
      "replies": {}
    },
    "ewys38y": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewys38y/",
      "text": "Totally agree!, but try not to turn this sub into a class war of poor vs relatively stable. The real enemy is higher tuitions and the ever-increasing wealth gap of the 1% making it harder on everyone.",
      "author": "LadyMjolnir",
      "created": 1565885988,
      "upvotes": 3,
      "replies": {}
    },
    "ewxofyh": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxofyh/",
      "text": "Finally. I’ve seen at least a handful of those “woe is me I’m middle class” posts and they’re so ignorant that it’s kind of amazing. I was homeless freshman year and got zero assistance. You might think your teachers would give a shit, but they genuinely won’t. On top of that, you’re held to the exact same standards of kids who have their own computers, have their own bedrooms, have parents who ask them how school is going, eat dinner in the evenings, have reliable transportation to school, etc. I could go on, but living below the poverty level and trying to keep decent grades is hell. Fuck the middle class.",
      "author": "officialkodos",
      "created": 1565864316,
      "upvotes": 9,
      "replies": {
        "ewxzwel": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxzwel/",
          "text": "That’s so sad. The fact that your teachers turned away from you is horrible. Good for you sticking with it. I literally can’t imagine what’s like to have to deal with because I’ve been really fortunate in life to have good circumstances all around. \n\nI really don’t mean to disagree with you because I know completely where you’re coming from when say “fuck the middle class” but please realize most of us fortunate to be middle/upper class are not like these kids who complain about not being able to go their favorite T20 even though they worked kinda hard in high school. I’m not saying this for the sake of argument, just to give you hope that those kids are a pretty loud minority.",
          "author": "readettore",
          "created": 1565871935,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "ewxp00y": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxp00y/",
      "text": "Yeah, 100% agree. Saying middle class kids have it the worst is fucking pretentious and insensitive",
      "author": "Reginayoga",
      "created": 1565864869,
      "upvotes": 8,
      "replies": {
        "ewy5suh": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy5suh/",
          "text": "I disagree.\n\nCue incoming downvotes.",
          "author": "nydanny2014",
          "created": 1565875330,
          "upvotes": -2,
          "replies": {
            "ewzbr36": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzbr36/",
              "text": "Downvotes come because you didn't argue your point imo.",
              "author": "CanIDoIt_IsitPossibl",
              "created": 1565893802,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "ewx4ro1": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx4ro1/",
      "text": "Don't forget people with wealthy parents with a \"DIY\" mindset and won't pay for anything T~T\n\n(Just a little bit sad, but definitely I agree with your points)",
      "author": null,
      "created": 1565844338,
      "upvotes": 8,
      "replies": {
        "ewx5pu3": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx5pu3/",
          "text": "loans are payable as long as you get a decent major. Poor kids suffer during college cause the parts financial aid and scholarships won’t cover, they’ll have to cover themselves with a full time job that might have to contribute to family income back home. I think it’s more of poor kids who suffer a lot during undergrad years (skipping meals/working full time jobs) or whether the upper class suffers for a long time after college (paying off debt for 10 years)",
          "author": "cookiebinkies",
          "created": 1565845315,
          "upvotes": 9,
          "replies": {
            "ewx6zs2": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6zs2/",
              "text": "Some poor kids still have loans to pay after college too, so they suffer in both circumstances, throughout and after college",
              "author": "the_chirik",
              "created": 1565846714,
              "upvotes": 8,
              "replies": {}
            },
            "ewx6qdl": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6qdl/",
              "text": "That's true, I wasn't negating the disadvantage for impoverished students. To that end, though, I'll likely have to work a full time job with close to nothing in terms of aid.",
              "author": null,
              "created": 1565846420,
              "upvotes": 2,
              "replies": {
                "ewx7an7": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx7an7/",
                  "text": "If you plan on going to a state school, a lot of states actually give you a full ride if you maintain a 3.5+ GP during your first or second year of community college. I know a few people who graduated debt free this way.\n\nEdit: I’d also push towards taking some Excelsior courses (basically like AP exams) during community college so you might be able to graduate a year early!",
                  "author": "cookiebinkies",
                  "created": 1565847056,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ewx71lt": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx71lt/",
      "text": "I think there is a pretty significant point you're missing here. I can certainly see the frustration and would never trade my middle class upbringing for more tuition, but a big source of the frustration for middle class students comes from the elitist nature of the sub. Many people in this sub want to go to top schools, almost all of which are private. Fixed costs such as food and supplies like you mentioned arent much of an issue for the middle class compared to what you mentioned. However, these costs dont change based on what school you go to (most of the time). The cost of attending school drastically changes between state and private colleges. The middle class students on the sub feel like they cant attend those private schools because the tuition gap is so large. Im looking at well over 100,000$ in loans to attend just about any private school in the country. It makes it just about useless to apply to any top schools since the cost is looking like a 30-40k difference per year. \n\nAgain, not trying to make this a struggle olympics and certainly wouldn't wish I had a worse upbringing just for more college money, but the frustration comes from the discrepancy between private and public cost for the middle class, at least for me.",
      "author": "Ap_Sona_Bot",
      "created": 1565846773,
      "upvotes": 9,
      "replies": {}
    },
    "ewypl5x": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewypl5x/",
      "text": "Was poor (got a good job after my degree), I second this sentiment.",
      "author": "ParadigmHang",
      "created": 1565884889,
      "upvotes": 2,
      "replies": {}
    },
    "ewyw28x": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyw28x/",
      "text": "Now just imagine being on the lower end of middle class, not having financial aid cause I’m not poor enough and buying everything from a thrift store and trying to find sheets and beds from other people because I can’t afford them.",
      "author": null,
      "created": 1565887609,
      "upvotes": 2,
      "replies": {}
    },
    "ewzo8c2": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzo8c2/",
      "text": "So what I've gotten from this is: poor kids have it better in relation to straight up going to college, but worse in terms of general lifestyle? That sounds about right",
      "author": "CarbonKol",
      "created": 1565898404,
      "upvotes": 2,
      "replies": {}
    },
    "ewzvc63": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzvc63/",
      "text": "This! I've always feel blessed to be middle class and have the option to go to a public university regardless of financial aid. I had a friend who had to cancel her meal plan for the semester so she could pay for a laptop she needs for classes. It really changes your perspective when you realize not everyone has the privilege of being able to pay for basic necessities.\n\nIf your biggest worry in college is your classes/grades and not housing/food/etc., you do not have it the worst.",
      "author": "ncsugal",
      "created": 1565901253,
      "upvotes": 2,
      "replies": {}
    },
    "excpikw": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/excpikw/",
      "text": "These fucking kids out here think it’s just fine and fun living check to check, missing a couple meals some weeks your asking your friends and family for money for food other weeks they’re just as broke",
      "author": "ActiveBoof",
      "created": 1566156395,
      "upvotes": 2,
      "replies": {}
    },
    "exjrd51": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exjrd51/",
      "text": "Lower-middle class have it the worst. Practically no financial aid, and on top of it you can’t afford half of what you need. So you’re in debt because of tuition and on top of it you either,  forewent either clothes, food, or necessities. And then you don’t qualify for food stamps or government programs so no help there, and your parents can’t afford to spare you any money at the cost of their/siblings expense.",
      "author": "NeeYoDeeO",
      "created": 1566358097,
      "upvotes": 2,
      "replies": {}
    },
    "ewxka0y": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxka0y/",
      "text": "Here’s my issue with the way the system works. I was 18. My father, a traditional Greek man, shook my hand and said it was my turn to be a man. No savings, no college fund, no place to go. He took everything he had paid for in the past, even my cell phone. I went to college on baseball scholarship so all was well, I had a job and paid for food and got a new phone and cashed on my friends floors after practice. Then I got hurt and lost my scholarship. I spent 6 months delivering pizzas and couch surfing. My dad again said figure it out. He refused to co-sign loans, he refused to give me money or let me back home. He makes roughly 300k$ a year. He’s my best friend, he thought what he was doing was a right of passage. I was forced to join the national guard to pay for my schooling. I worked a full time job my entire way through school for a degree I don’t even use, and I still had to pay all taxes and fees for school out of pocket. All my clothes, all my food, my car, everything. That was thousands of dollars. Where was my financial aid? They didn’t care what I made, they cared what my father made. That part of the system needs to be fixed or at least they need to teach high schoolers how to use their resources because I was clueless and lost.",
      "author": "NetworkNooob",
      "created": 1565860319,
      "upvotes": 4,
      "replies": {
        "ewy1kce": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy1kce/",
          "text": "I'm not saying your situation doesn't suck, but how would you improve the system? If students could get more financial aid by their parents saying \"I don't want to pay\", then no parent would ever pay. Your father at least has the resources to pay if he wanted to. Low income kids don't have that fallback. \n\nYou were also very smart to take a baseball scholarship. Plenty of students on this sub are allergic to full ride scholarships at schools ranked below a certain point, and often complain when more expensive schools don't give good aid.",
          "author": "OnceOnThisIsland",
          "created": 1565872825,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ewx9zlw": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx9zlw/",
      "text": "I agree that the middle class sob stories are getting ridiculous, but I don't think most people are saying that it just \"sucks,\" it's that the premise is not based on merit.  Possible train of thought:\n\n \n\n\"My parents worked hard and sacrificed a lot to give us a secure life.  They always spent money responsibly and worked to get promoted instead of fired; they went to community college and had no advantages but that doesn't matter.  Now, after 20 years of work and careful saving, they're expected to pay out half of their total income? and that guy a few blocks over with parents who chose to be lazy, chose to be a drag at work, chose to skip college to party, chose to try out some drugs, chose to do anything besides pursue the means for a more financially secure future for their children, now they're expected to be pay nothing?  My parents don't deserve to have to pay for someone else's kid, they earned what they have and the other people didn't.  And even more pressing, I can't go to that selective college because my parents can't afford it even after busting their tails, but that guy a few blocks down gets to go there for free even though his parents didn't work hard.\"\n\nOr something like that.  The poor student did nothing to earn the financial aid.  The poor parents did nothing to earn the financial aid.  But the parents who did grind their way to a secure life, they're basically penalized for being financially stable.  Because look at it this way, the poor people aren't just \"not having to pay,\" someone else's tuition dollars are paying the poor parents $70k per year even though the poor parents didn't work hard and make the right sacrifices.  From the eyes of the middle class, poor people are rewarded just for being poor, while the middle class worked hard and made sacrifices are for nothing because they lost $200k.  These aren't my views, I'm just explaining that some people's perspective isn't that paying sucks, it's that poor parents did nothing to deserve the $70k they are basically being paid by the middle class, and the middle class have their opportunity to attend a top college ripped away from them but the poor kid goes for free.",
      "author": "rockncole",
      "created": 1565850043,
      "upvotes": 3,
      "replies": {
        "ewy8buk": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy8buk/",
          "text": "It sounds like it kind of IS your view...\n\nLook, you seem to not have an understanding of how poverty really works in this country (if you’re in America). People do not often choose to have nothing, and if they do, do you really think the poor kid they produced should be held back from going to school? \n\nThe middle class kid will be okay in life, at minimum. For a lot of poor kids, college is their chance to make it or break it, and stay in poverty or get out. They don’t have the resources, food/housing security, role models, or understanding of life/finances/etc that the middle class kid would. \n\nThe rich getting richer is a direct result of people blaming the poorer people for their poorness, and acting like poor people are leeches on society. We have enough wealth to provide education to everyone, and to support everyone— We just don’t.",
          "author": "fleurdedalloway",
          "created": 1565876636,
          "upvotes": 9,
          "replies": {
            "ex026y0": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex026y0/",
              "text": "Read some of his earlier posts from a few months back.  It absolutely is his view.",
              "author": "FeltIOwedItToHim",
              "created": 1565903876,
              "upvotes": 4,
              "replies": {
                "ex3hbuw": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3hbuw/",
                  "text": "Like when?",
                  "author": "rockncole",
                  "created": 1565985529,
                  "upvotes": 0,
                  "replies": {
                    "ex3q4kl": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3q4kl/",
                      "text": "Here's one you said a while back:\n\n\"Harvard doesn't give that much of a damn about the proportionality of opportunities vs. outcomes, they just want outcomes. Harvard is not a charity, and it shouldn't be. Top institutions should teach people who are ready to do world class things. It doesn't matter that Sally from 20k household does way more than people would expect if she still can't do as much as Sarah from 200k that runs her own clothing company and does research at a prestigious lab.\n\nTop private institutions aren't a right or an expected privilege. They aren't supposed to be some lifeline for poorer kids. I don't mean that with any malice, I'm just saying they aren't.\n\nYou say compare people apples to apples, but you are implying to fulfill an income bracket quota. That's stupid. Why should I not be able to get in while I am in all-state bands, win a few big awards, 5 all my ap exams, do research, etc. just so someone from the inner city who easily gets A's among unintelligent peers and does a single club can get in because \"Harvard needs more poor kids\"?\"\n\nHere's another:\n\n\"Very stupid. First off, a lot of people say College Board's standardized tests can only quantify intelligence to a degree. But a FUCKING ADVERSITY SCORE? Ok so wow I wish I went to my local public high school where it is much easier to succeed and more fun instead of working to get into a magnet or private on scholarship, since my public school gives me better chances since there was more \"adversity\" in being in classes taught at an elementary school maturity level. And now there is the fact that my parents made good decisions all their lives for their children, just so someone else can claim a university spot because their parents blew their money on stupid things and live in a smaller house. And they won't even let students see how their life experiences are being boiled down to just a number, because they know that nobody wants this. ACT all the way.\"\n\nor this:\n\n\"The wealthy and middle class should have an \"advantage\" in admission, depending on how you define the term. If by advantage you mean they are automatically considered greater, then that is false because \"adversity\" is a de facto bonus to the application while \"privilege\" is frowned upon (AO's say it themselves that they are trying to get more socioeconomically diverse classes). If by advantage you mean that more wealthier people are admitted, then yes of course they are, because they have the highest chance of bringing back money and fame to the university and had more opportunities that could already sharpen them into the top candidates for elite universities if they chose to capitalize on them. Why would good universities be mostly/more comprised of people who come from financial lows (there is nothing undignified with not having money, but financial background is the easiest predictor of skill level at almost anything so it makes sense that higher ed has more wealthy people)?\"\n\nthis one was good:\n\n\"hat doesn't make sense. You think that being rich automatically gives you opportunities and makes you intelligent? You think that being slightly above average all of a sudden means you are \"advantaged\"? Why should someone else substantially achieve less than me (in the ways that are measurable) and still be seen as a more qualified candidate? I'm not saying not to consider background, I'm just saying that they are trying to put objective numbers on things that aren't just a simple \"oh his life was 'harder' and he MUST have worked harder.\" Furthermore, what does it mean to be in a \"good\" school system when it is less fun and puts you at a disadvantage for higher education (what your career options are based upon)? If it is advantageous to take the easy way out, more people will take the easy way out. That degrades lower education. I'm not talking about people who are seriously impoverished, but the middle class. This gives advantage to middle class people who chose easier schools (easier schools as in less academic rigor which is correlated with the adversity factors strongly) relative to their peers who went for challenges or more difficult schools. Going to a magnet school is generally harder than the local high school, but often doesn't change what opportunities are available while the adversity factors are diminished. So by going to the better school, you are more \"privileged\" despite doing more and learning more and earning it.\"\n\nand this one:\n\n\"You are literally arguing my point. What is the incentive for anyone from the middle class to go to a place with more opportunities and hard work when those places are viewed less favorably (no \"adversity\") than going to a school facing \"hardship\" where they can coast in comparison to the other students? This system provides reward for going to worse schools (because you face more \"adversity\" even though everything is easier SCHOOLWISE).\n\nAnd you also aren't reading what I'm saying. I'm not talking about people from poverty and unstable situations gaining an advantage, but the middle class people who are intrinsically smart but would rather coast always choosing the easy path and then being rewarded for it.\"\n\nThe guy was right.  You really do think that people choose to be poor.",
                      "author": "FeltIOwedItToHim",
                      "created": 1565989462,
                      "upvotes": 3,
                      "replies": {
                        "ex3rc3f": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3rc3f/",
                          "text": "And I stand behind every statement I made and still express that the above viewpoint is not my own. None of those posts were about financial aid. Not sure if you noticed, but this post is about financial aid and how middle class people believe that the system hurts them while poor people get to go for free.  I contrarily believe the financial aid distribution system is pretty good at top universities and poorer students should receive all the financial aid they need.\n\nDon’t take these out of context. They are about meritorious admissions, how the adversity score incentivizes going to worse high schools and devalues education, and the correlation between wealth and academic achievement. None of that is about what is subjectively fair and unfair in financial aid.",
                          "author": "rockncole",
                          "created": 1565990061,
                          "upvotes": 2,
                          "replies": {
                            "ex3rnco": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3rnco/",
                              "text": "I know you stand behind every statement.   But read together, they reflect a certain world view that is very dismissive of the challenges faces by poor people, or of the idea that \"merit\" can be defined in any way other than the way that most benefits rockncole.  \n\nthat's all.",
                              "author": "FeltIOwedItToHim",
                              "created": 1565990226,
                              "upvotes": 5,
                              "replies": {
                                "ex4tpew": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex4tpew/",
                                  "text": "My world view is that people should be judged based on what they have done, not how much money they have or don’t have. European college admissions are almost entirely grade  and score based, with very little regard to background. Does that mean Europe is “dismissive of the poor” just like me? No. We just have the selection standard of whoever does the best and the most or the top institutions. I’m not dismissive of “the poor.” I’m not rich, nor is anyone in my family. I don’t live to elevate the rich even higher. You made a lot of assumptions by “reading together” various comments about different education selection topics. You don’t know anything about me, what gives you the right to tell me who I am and what I believe? Who are you to discredit my opinions based on assumptions?\nYou can selectively quote anyone and paint them any which way you feel, good or bad. \n\nMy grandparents were all poor farmers, two from very poor countries. Many in my extended family are still poor. I’m not dismissive of their struggles; I’m inspired by how they worked for everything. That’s my mindset. Work for what you want, don’t expect it to be handed to you because you grew up poorer than some people and richer than others. You should be selected for an honor based on what you have accomplished. \n\nNext time read carefully, the nuances are important, and don’t arrogantly make assumptions about what someone’s “world view” is, and don’t talk down to people as if they are self-centered.  Who is truly self-centered, the one who has a meritocratic code or the one who thinks he has the merit to mock someone and insult their character? Logic question: Did I base my idea of merit around my own benefit, or did I develop a system of merit and morality and then work to make myself a better person around that code of merit? Oh wait, doesn’t matter, you don’t have any right to make that judgement.\n\nThat’s all.",
                                  "author": "rockncole",
                                  "created": 1566010783,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "ex3j56j": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3j56j/",
              "text": "Well I am American. And it’s not my view, I just understand it. I like that top colleges will pay for less fortunate kids to go to school, no questions asked. But remember that college is a privilege, not a right; there are plenty of people that don’t go to college and end up just fine, no one is just entitled to any school beyond high school. And don’t twist my words. I don’t believe anyone should be held back from going to a school on the basis of their financial situation; that doesn’t mean that anyone is responsible for supporting their education besides themselves and their parents. Everything else is generosity. \n And remember than anyone can fall, even the middle class kid can get depressed and fall behind, can lose a family member and struggle, can get an illness and lose money. But that’s besides the issue.\nNo one chooses to have nothing, but some people make bad decisions. There are consequences to decisions. Those consequences can include becoming poor. And sometimes bad luck happens to good people. Sometimes you make a bad decision and bad luck makes it worse. But that’s life. \nI’m not saying poor people are leeches to society. I’m saying that some people have that mindset, and some poor people are indeed leeches of the system which is why that mindset gets perpetuated. \nAnd we do provide education to everybody - 13 years of schooling 100% free. \nThe rich getting richer is not a direct result of blaming the poor, it’s a direct result of companies producing and selling more. Basic economics.",
              "author": "rockncole",
              "created": 1565986384,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "ewyksv9": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyksv9/",
          "text": "What did the middle class kid do to earn being born into a life of financial privilege? \n\nAlso, it's not the poor student's fault that they were born into a poor family like how you could have been born into a poor family.",
          "author": "collegeappTHROW20",
          "created": 1565882772,
          "upvotes": 5,
          "replies": {
            "ex3jjhc": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3jjhc/",
              "text": "I’m not saying it’s the poor kid’s fault or that the financial stability was earned by the student. I’m just explaining a viewpoint.\nMaybe the parents of the middle class kid are angry that they worked harder/smarter and have to pay more than someone who may have worked less/worse. It’s an oversimplification to describe the trend that people don’t like having to pay more than other people not on the basis of merit.",
              "author": "rockncole",
              "created": 1565986569,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ewzbknc": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzbknc/",
          "text": "Wow. I have a hard time believing these “aren’t your views”. Piggybacking off of what the other commenters said: when the poor kid’s parents are “partying and doing drugs”, it takes a crazy amount of determination on the part of the kid to continue to work hard enough to get into a selective college; probably much more than a kid from a stable background.\n\nIt’s also a gross misconception of the working class. You can work like a dog for sixty and have integrity up the wazoo and still get fucked over by a company that cares more about profit than its workers.",
          "author": "officialkodos",
          "created": 1565893729,
          "upvotes": 2,
          "replies": {
            "ex3ko0p": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3ko0p/",
              "text": "It’s an oversimplification obviously. It’s hypothetically what someone might say about poor parents. \n We can’t quantify determination, now, can we? Maybe the rich kid is beaten at home or verbally abused, we never can know or quantify who had to have a stronger set of values between that kid and a poor kid. \nEverything cuts both ways. You can work like a dog for 60 and end up middle/working class and the poor person is unemployed and lives off of welfare while they do drugs. Who pays more? The middle class guy. \nNot every poor person “had integrity but got fucked by the rich,” sometimes they just straight up made stupid decisions and it’s their fault. Sometimes someone gets lucky and scores a high paying job that they are unqualified for and doesn’t deserve the wealth. But that’s life. Nothing will ever be perfectly fair or balanced because there is no such thing. I’m showing you why some people believe this system to be unfair. \nHere’s a thought question: is it more *fair* to make Disney give out park tickets to the poor because “they struggle more” and “deserve it”? What is fair? It’s subjective.",
              "author": "rockncole",
              "created": 1565987092,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f9jf13z": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/f9jf13z/",
          "text": "Nope. If you’re middle class and can’t afford college, your parents didn’t work hard enough.",
          "author": "georgeblair1984",
          "created": 1575371161,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ewxnhza": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxnhza/",
      "text": "Most the kids complaining are also upper upper middle class bordeeinon rich with an income of like 300k",
      "author": "fmemate",
      "created": 1565863496,
      "upvotes": 4,
      "replies": {}
    },
    "ewz8kam": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewz8kam/",
      "text": "[deleted]",
      "author": null,
      "created": 1565892576,
      "upvotes": 2,
      "replies": {
        "ewzg3q0": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzg3q0/",
          "text": "Being poor I’m not sure why I’m supposed to have sympathy for you and I’m sure colleges feel the same.",
          "author": null,
          "created": 1565895432,
          "upvotes": -3,
          "replies": {
            "ewzpwzq": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzpwzq/",
              "text": "[deleted]",
              "author": null,
              "created": 1565899064,
              "upvotes": 4,
              "replies": {
                "ewzs5g6": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzs5g6/",
                  "text": "Colleges already have an established sympathy for the poor. So why should they also have sympathy for you? Someone has to pay for college and the upper class isn’t enough.\n\nAlso if you think that the privilege of paying for a higher education is the same exact struggle that poor people have I recommend you spend time in actual disadvantaged communities and see how true that statement holds.",
                  "author": null,
                  "created": 1565899959,
                  "upvotes": 1,
                  "replies": {
                    "ex0nct6": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0nct6/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1565917398,
                      "upvotes": 1,
                      "replies": {
                        "ex0nmbf": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0nmbf/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1565917595,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "exkwk1z": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exkwk1z/",
          "text": "The assumption that any amount of work can change your socioeconomic status has been proven in all but very few cases to be a fallacy. The bootstrap method simply isn’t possible.\n\nI grew up POOR. I was a fantastic student, President of my NHS, did speech and debate, etc. I still needed to take out over 100k in private loans to attend a STATE school. I’ve worked since I was 15 and worked HARD. I had a full time job and a part time job during undergrad, and a full time job during my Master’s as well. I have worked fucking HARD. And guess what! Because I needed loans to get a good education because I was poor, I might as well have not gone to college and just worked at a hardware store. I take home about the same amount of money.\n\nSo, no. Just because your parents work hard doesn’t necessarily mean they earned being middle class, and it CERTAINLY doesn’t mean that poor people didn’t/don’t work hard and decide to be poor. I worked and continue to work hard, like many poor people, and yet nothing truly has changed financially. Except now I don’t qualify for any government assistance because I “make plenty of money.”\n\nTo summarize: not all poor kids get financial aid, and I’d say 90% can’t even earn them due to circumstances preventing them from being good students, and even when you’re a good student and poor, you almost never get enough financial aid to afford college anyhow. Socioeconomic status is inherited and nearly impossible to break out of. Stop blaming poor people for not having money, and stop claiming people with more money, in any way, have it easier.",
          "author": "Tri_skel_ion",
          "created": 1566400643,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ewzopv1": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzopv1/",
      "text": "The writer John Scalzi wrote in his blog about what it's like to grow up being poor, [https://whatever.scalzi.com/2005/09/03/being-poor/](https://whatever.scalzi.com/2005/09/03/being-poor/)  and it really hits you in the feels. Growing up poor myself, I really connected with what he said. Reading it again, it makes me angry. Angry at the privileged elite and the rationalization that if you are poor because you must have done something wrong to make you this way.  Most of the privileged people I know just don't have a clue how much more difficult it is to be in financial straits, with the thing they understand the least being that those less fortunate typically have less time, skills, and resources to devote to improving their lives because all their energy is spent just trying to keep their heads above the water.\n\nMy wife worked at a homeless day shelter before we had kids, and she mentioned something to me that really illuminates just how unfair things can be if you are poor, and how untouchable you can be if you are rich.  She said,\n\n\"Everybody is human, and everybody make mistakes, whether you're rich or poor.  It's just that the rich have so many more chances to make the same mistakes, and sometimes bigger and nastier mistakes, often with no consequences.  If you are poor and you make a mistake, you are done, as in you're homeless, or you're in jail, or you're out of a job.  And the rich make these same mistakes, and because they are rich they have that safety net that so many of us simply do not have.  And what's truly maddening is they are oblivious to this advantage, or use this advantage to further their own ends,often to the detriment of others, and think that the rest of us deserve the consequences of our mistakes moreso than them. It's part of the all-too-common rationalization that the poor in our society just don't work hard enough or are decent enough to deserve a better life\".\n\nTo put the above statement in context, we were having a discussion about an incident that happened in a rich north side suburb in our city.  Four 18-19 Y.O. upperclassman basketball players hazed several freshman teammates multiple times, but most notably on a bus to one of their games.  They held several freshman down and penetrated them anally with their fingers.  All 4 got brought up on charges- mind you in most circumstances  they would have been charged  with rape or sexual battery. Nope!  One kid was apparently really stinking rich (i think their dad was a lawyer), got the charges reduced to a misdemeanor, and every one of them only got probation and community service.  understandably tons of people were up in arms over this.\n\n[http://www.indianapolisrecorder.com/news/features/article\\_19ef025c-b994-59b2-9bdd-b566b06932ed.html](http://www.indianapolisrecorder.com/news/features/article_19ef025c-b994-59b2-9bdd-b566b06932ed.html)",
      "author": "fskern",
      "created": 1565898583,
      "upvotes": 1,
      "replies": {}
    },
    "exdpz7v": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exdpz7v/",
      "text": "I feel you completely here man. I haven’t quite suffered being in the same financial class as you, (middle class but no financial aid) however I too feel concerned for my family. They are in so much debt from paying for my cancer treatment. Honestly I am very surprised they can pay for college. But, I still don’t have it as hard as someone who is in a lower financial class. I was lucky even with what I got. People need to just sit down and not pretend it’s the end of the world they didn’t get financial aid. There are many people who aren’t as lucky.",
      "author": "thatgoat-guy",
      "created": 1566183341,
      "upvotes": 1,
      "replies": {}
    },
    "exfkmf2": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exfkmf2/",
      "text": "I’m one of eight kids. The only way I was able to move far away and live on campus was because every free second of time in high school was dedicated to working so I could pay my own phone and car payments. Plus cover the costs of my extra curriculars like soccer and national honors society. My participation in those and good grades won me a lot of scholarships to accompany the aid I get. You’d think working so hard in high school would make you set for college, but nope, I had 3 more years I needed to win money to cover. So I joined clubs and worked in college. Still paying my own rent, utilities, insurance, phone, food, clothes, etc. I had no time to have fun in college. I had to plan out every single move. “What else can I do to stand out on scholarship applications?” My plate was so full, I feel burnt out and I haven’t even graduated yet. \n\nThe saddest part is that while everyone else gets to go home over the summer and chill out while they live off their parents and wake up to breakfast, I had to work harder. I was gone for 9 months out of the year, bedrooms in my moms house are in high demand so she gave my little sister my room. That was pretty much my unofficial “you’re on your own.” I don’t get financial aid in the summer ya know so I had to work so so much to keep paying my rent. I know it has made me a better person, but you have no idea how much I miss waking up in a chaotic house to eggs in the morning and sitting at dinner talking with everyone rather than being in an empty apartment eating cereal for dinner",
      "author": "silentkiller000",
      "created": 1566242632,
      "upvotes": 1,
      "replies": {}
    },
    "exg1xz3": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exg1xz3/",
      "text": "While I’m not exactly poor these days, I’m square in the middle class now, I did grow up in a poor family and it’s ridiculous to think that middle class kids have it tougher than poor ones. I mean, the occasional benefit like getting more financial aid doesn’t outweigh being unable to afford to eat or buy clothes regularly, or to have any nice things or fun experiences that cost money. People in the middle class take a lot of small things for granted, I know that I see myself doing so quite often and I know what it’s like to be poor so someone who has never been truly poor probably doesn’t really understand fully what it’s like. I mean, even the smallest little things like buying a candy bar at the corner store is impossible when you’re poor, forget about actually having disposable income for leisure. Poor kids have to go without so many things, including outright necessities, while middle class kids simply don’t have as much money as they’d like. Obviously it’s hard on everyone that isn’t financially comfortable, middle class and poor kids both have it rough in this country, but it’s crazy to think that it’s overall more beneficial to be poor due to things like easier access to financial aid because that doesn’t begin to justify being poor tour whole life. I just wanted to throw in my two cents and say I agree with OP, being poor sucks.\nReally though, we should be making it possible for every single person who is competent enough to get a college degree to do so. It’s better for the country as a whole if more people are educated. The fact is, I’d rather see my tax dollars go toward educating our citizens than to see it go toward police having freaking light tanks and other military grade weapons and tools. Hell, I’d rather it go to education than like 99% of what it usually does go to. It’s sad to think how many people that are capable of being doctors or engineers end up having to drop out of high school to start working because they can’t afford school. Even people who could be eligible for financial aid, if their families don’t know how to go about applying for it and they are from crappy schools that don’t take the time to teach kids how to access it, they never get to go simply because they don’t know how to get financial aid. It’s really sad, as I’d rather love in a country where everyone who is competent enough to go to college get to do so without it putting them into debt for decades.",
      "author": "BornTo0Lo0se",
      "created": 1566253606,
      "upvotes": 1,
      "replies": {}
    },
    "exi4rb5": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exi4rb5/",
      "text": "I echo this sentiment except for your word choice because “room and board” is *housing and food*, so you probably should be more precise or more accurate. But other than that, I think people oftentimes don’t consider some of the things that others outside of their own demographic have to experience. Well said.",
      "author": "ChefMamii",
      "created": 1566321053,
      "upvotes": 1,
      "replies": {}
    },
    "f7flmi6": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/f7flmi6/",
      "text": "Why should my aid be based off my parent's income when my parents aren't going to pay shit.",
      "author": "LlamasCSGO",
      "created": 1573682055,
      "upvotes": 1,
      "replies": {}
    },
    "ewx8iwb": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8iwb/",
      "text": "International poor kids have it the worst",
      "author": "antarjyot",
      "created": 1565848419,
      "upvotes": 2,
      "replies": {
        "ewx9v4q": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx9v4q/",
          "text": "It's not a competition but you're right.",
          "author": "PotBelly100",
          "created": 1565849910,
          "upvotes": 4,
          "replies": {}
        },
        "ewxh0cm": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxh0cm/",
          "text": "*poor international kids",
          "author": null,
          "created": 1565856948,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ewzeg2r": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewzeg2r/",
      "text": "Let’s be real here the majority of poor people applying to college are people of color. You know why this sub thinks the way it does.",
      "author": null,
      "created": 1565894833,
      "upvotes": 1,
      "replies": {
        "ex02fey": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex02fey/",
          "text": "Go to ANYWHERE in rural America.  There are a shit-ton of poor white people too.",
          "author": "spaideyv",
          "created": 1565903960,
          "upvotes": 1,
          "replies": {
            "ex03jl5": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex03jl5/",
              "text": "Ok and what does that have to do with what I said?\n\nThis subreddit has a problem with adversity being part of the application process. An even bigger one with race being part of the application process. Because to this subreddit if you didn’t get into the university of your choice it is because a poor minority took their spot.",
              "author": null,
              "created": 1565904462,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ewxk77m": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxk77m/",
      "text": "[deleted]",
      "author": null,
      "created": 1565860233,
      "upvotes": -1,
      "replies": {
        "ewxm9ps": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxm9ps/",
          "text": "I’m not quite sure who has it the hardest because I’ve always been lower-middle class, but it does suck that my parents make just enough for me to not qualify for financial aid, but cannot help me pay for college. \n\nI’ll have to work all through college, take out loans, etc.\n\nI’ve opted to do ROTC and join the military after college largely due to the fact that that’s the only way I can afford to go to college and feel comfortable about having a stable job afterwards.",
          "author": "spread-joy-like-jam",
          "created": 1565862389,
          "upvotes": 3,
          "replies": {
            "ewxmh0x": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxmh0x/",
              "text": "[deleted]",
              "author": null,
              "created": 1565862571,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ewykwy5": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewykwy5/",
          "text": "The likeliness of getting the right scholarships is extremely low. I know someone who couldn't afford USC even after Questbridge. Middle class people can generally afford to have their basic needs met while taking out and working on loans..",
          "author": "collegeappTHROW20",
          "created": 1565882827,
          "upvotes": 2,
          "replies": {
            "ewylo6x": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewylo6x/",
              "text": "[deleted]",
              "author": null,
              "created": 1565883182,
              "upvotes": 1,
              "replies": {
                "ewymww9": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewymww9/",
                  "text": "one kid getting a full ride doesn't mean all poor kids are gonna get one 😂 you're doing the same thing by assuming that all low income kids get full rides. MIT is an extremely well funded institution and not all institutions have that money to give their students \n\nAlso, poor or not, who said you were gonna get into MIT in the first place?",
                  "author": "collegeappTHROW20",
                  "created": 1565883717,
                  "upvotes": 2,
                  "replies": {
                    "ewynsa2": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewynsa2/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1565884101,
                      "upvotes": 1,
                      "replies": {
                        "ewyoap6": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyoap6/",
                          "text": "Sure, but would a high achieving student even want to go to a crappy state school when they have other options?\n\nThis is exactly what privilege is. Two students of the same stats, the poorer one has to go to a lower caliber place where they'll get a full ride and the wealthier one can go to a better school because taking out loans and paying them is feasible.",
                          "author": "collegeappTHROW20",
                          "created": 1565884317,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ewy6pog": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy6pog/",
          "text": "but the thing is, the middle class kid is much more likely to get into college in the first place- poor kids don't have time for extracurriculars- they have to work. Some poor kids don't even have access to the internet, meaning that sometimes they can't even do their homework. Poor kids tend to get less attention and less time to talk with their parents from when they are young, which has huge negative effects on their reading, writing, and verbal abilities. Food insecurity means that kids sometimes go to school hungry, and when you go to school hungry, you can't focus. lower middle class kids can afford to pay for community college out of pocket to a certain extent. poor kids usually have to put money towards their needs. everything adds up when you're poor.",
          "author": "owlswearwatches",
          "created": 1565875810,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ewxdahu": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxdahu/",
      "text": "This site is overwhelmingly middle class. Any knowledge or sensitivity about poverty is quite rare on reddit.",
      "author": "HorchataOnTheRocks",
      "created": 1565853208,
      "upvotes": -1,
      "replies": {}
    },
    "ewx280z": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx280z/",
      "text": "[deleted]",
      "author": null,
      "created": 1565841877,
      "upvotes": -18,
      "replies": {
        "ewx3w9c": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx3w9c/",
          "text": "They're just examples, but go on and be petty. There are folks struggling to get meals at college - shit like this adds up and makes going to college, even on a full ride, a huge challenge for poor people. Living expenses are no joke.",
          "author": "throwaway814a",
          "created": 1565843478,
          "upvotes": 21,
          "replies": {
            "ewx4js5": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx4js5/",
              "text": "[deleted]",
              "author": null,
              "created": 1565844121,
              "upvotes": -18,
              "replies": {
                "ewx5x01": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx5x01/",
                  "text": "meal plans aren’t always included in full rides. I can say so for myself since I had a full ride to my state school (merit based not need based)\n\nAnd health insurance might be a lot. Poor kids can’t afford to take out private loans at all for these expenses or food because their parents have no credit. And they might be working full time jobs cause their parents at home don’t have groceries and need help. And why the fuck are you spending $200k+ on tuition when there are affordable state schools?",
                  "author": "cookiebinkies",
                  "created": 1565845527,
                  "upvotes": 16,
                  "replies": {}
                },
                "exec6ti": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exec6ti/",
                  "text": "That’s just not true. It’s highly dependent on the school. I got a “full ride” from one school and was still expected to contribute 3k for some reason.",
                  "author": "ApplyingToUniSoon",
                  "created": 1566208873,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ewx6wu3": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx6wu3/",
      "text": "okay i get what you’re saying but the amount of debt a middle class student could end college with can be unreal because of not receiving very much aid",
      "author": "hehsjsnsnksbs",
      "created": 1565846622,
      "upvotes": -8,
      "replies": {
        "ex02odo": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex02odo/",
          "text": "no one forces anyone to take out that level of debt.  You don't HAVE to go to NYU, you just want to.",
          "author": "FeltIOwedItToHim",
          "created": 1565904059,
          "upvotes": 3,
          "replies": {
            "ex3n58d": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3n58d/",
              "text": "but what’s wrong with wanting a good education? it should be more affordable and available for everyone",
              "author": "hehsjsnsnksbs",
              "created": 1565988203,
              "upvotes": 1,
              "replies": {
                "ex3nr36": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex3nr36/",
                  "text": "Nothing wrong with wanting it.  But a middle class student that has the option to go into debt (or not) is still better off than a poor kid.",
                  "author": "FeltIOwedItToHim",
                  "created": 1565988455,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ewxlhtm": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxlhtm/",
      "text": "[removed]",
      "author": null,
      "created": 1565861694,
      "upvotes": -4,
      "replies": {
        "ewya3n3": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewya3n3/",
          "text": "I agree your situation sucks too but for poor families like mine, there is no retirement fund and there is no “own shit”. All the money my family makes goes right to my sister and I going to college and that’s it. No vacations or planning for the future, just trying to get an education so hopefully we can get out of this",
          "author": "VeryVeryValentine",
          "created": 1565877497,
          "upvotes": 9,
          "replies": {}
        },
        "ewyl25e": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyl25e/",
          "text": "\"you can go to the schools you got into\" def not true, even with federal aid UCs are still $15k+ year and I know people who even with Questbridge couldn't afford their dream schools",
          "author": "collegeappTHROW20",
          "created": 1565882899,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ewx40l0": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx40l0/",
      "text": "I disagree",
      "author": "Daddie301",
      "created": 1565843596,
      "upvotes": -14,
      "replies": {
        "ewx5hwm": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx5hwm/",
          "text": "well you’re entitled to your own opinion. But at least the middle class kids can get their loans while even the full ride poor kids will balance working full time jobs to support family back home while skipping meals. \n\nAnd there’s plenty of full ride scholarships at the state schools if you study hard. Most of the kids I know who had full rides to Rutgers had parents who actually made more than $300k+. They’re able to get tutors in high school for classes they struggle with. \n\nAnd then people who complain that poor kids get to go to better schools cause they’re more likely to get scholarships. Well, a lot of poor kids will end up attending their state schools instead of ivy leagues cause they can’t drop the $$ that health insurance cost cause they’re on Medicaid or cause they can’t afford the plain tickets.",
          "author": "cookiebinkies",
          "created": 1565845081,
          "upvotes": 20,
          "replies": {
            "ewx7kw1": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx7kw1/",
              "text": "I’m new to this.  Do you lose your Medicaid coverage when you go to college in another state?  Do you have to have health insurance to go to college?",
              "author": "unleadedbrunette",
              "created": 1565847376,
              "upvotes": 4,
              "replies": {
                "ewx7tq9": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx7tq9/",
                  "text": "Yes. I think almost all colleges except community colleges require health insurance.",
                  "author": "cookiebinkies",
                  "created": 1565847654,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "ewx8wa3": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx8wa3/",
              "text": "No offense, you just seem very bitter and jealous.\n\nEnjoy your free college.",
              "author": "Daddie301",
              "created": 1565848818,
              "upvotes": -14,
              "replies": {
                "ewxa7gt": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxa7gt/",
                  "text": "I got a merit based scholarship so even if I was rich, I’d still be getting free college because, well, I studied my ass off.",
                  "author": "cookiebinkies",
                  "created": 1565850281,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        },
        "ewxp8ip": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxp8ip/",
          "text": "[removed]",
          "author": null,
          "created": 1565865057,
          "upvotes": 5,
          "replies": {
            "ewxt8p5": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxt8p5/",
              "text": "Well let him explain. Maybe then we won't downvote",
              "author": null,
              "created": 1565867843,
              "upvotes": 5,
              "replies": {}
            },
            "ewy8vf7": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy8vf7/",
              "text": "They add nothing to the conversation by simply saying, “I disagree,” to all of OP’s post. That’s kind of the point of the downvote button— Their comment lacked relevance to the topic, therefore: Downvote.",
              "author": "fleurdedalloway",
              "created": 1565876896,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ewy0qpy": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy0qpy/",
      "text": "Listen.  Here's a secret.  It's not going to get better for either of these self-identified groups until you realize you're in this together.  Pitting the poor against the middle class is a trick of the wealthy, the very wealthy.  And I'm not talking about the family who makes $250k per year.\n\nThis isn't a competition about who can out \"woe is me\" the other.  Just because you feel you have it worse doesn't mean someone better off also doesn't feel something similar.  Everyone is dealing with their own shit.\n\nYou are all in this together.  Stop with these pity parties and help each other.  Be good people.",
      "author": "taz20075",
      "created": 1565872390,
      "upvotes": -5,
      "replies": {}
    },
    "ewx3t7x": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx3t7x/",
      "text": "[deleted]",
      "author": null,
      "created": 1565843395,
      "upvotes": -14,
      "replies": {
        "ewx605l": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx605l/",
          "text": "depends how poor your family is. If you’re on the deep deep end of poverty with food stamps and debating whether college is a smart choice because that means one less income for your family to buy groceries, you might disagree.",
          "author": "cookiebinkies",
          "created": 1565845622,
          "upvotes": 16,
          "replies": {
            "ewyko1y": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyko1y/",
              "text": "[deleted]",
              "author": null,
              "created": 1565882705,
              "upvotes": 2,
              "replies": {
                "ewyt9tx": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyt9tx/",
                  "text": "I grew up in an Asian American family so parents don’t really kick you out. I think I was lucky and just raised well. We were somewhat well off when I was in preschool. But my dad (the primary supporter) became blind and my mom was an art major. I was really lucky that I was able to get a piano scholarship from my piano teacher when I was 6, whose husband was a Columbia math professor and tutored me. She made sure I always had food and clothes while I was younger while my parents did odd jobs here and there to support me and my 3 siblings. My piano teacher and her husband were amazing people who gave me resources for school I would’ve never been able to have. But they did move away when I entered middle school. \n\nI was lucky to have awesome parents who always tried to take us to the park or to the library since we didn’t have a television. They always tried their best to make sure we knew we were loved, even skipping meals so we ate well. In return, my siblings and I tried our best in school. But because I struggled the least in school, I used the extra time to work so my little sister can grow up without stressing about asking my parents for $5 for fees for her clubs and stuff.",
                  "author": "cookiebinkies",
                  "created": 1565886472,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ex0320r": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex0320r/",
          "text": "It is SO much easier for someone to be a \"top\" middle class kid than a top poor kid, it's not even funny.",
          "author": "FeltIOwedItToHim",
          "created": 1565904237,
          "upvotes": 5,
          "replies": {}
        },
        "ewxespz": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxespz/",
          "text": "> Top middle class kids and their families are at a huge financial disadvantage compared to top poor students.\n\nNot really. I guess if you think you have to go to Cornell or something, maybe, but that's just a very elitist and privileged mindset in the first place. If you're a top student from either the middle class or the impoverished class, there are more than enough universities that would be willing to fund your education and throw scholarships at you. \n\nWhich... Given all the disadvantages that poor people face in daily life against the middle class and above, I don't really feel is a bad thing at all. This really is a non-issue as well since it affects such a small percent of the population; the vast majority of poor people are not enjoying such benefits.",
          "author": "doneanddead",
          "created": 1565854717,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "exdyx4z": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exdyx4z/",
      "text": "Why can’t you get a part time job to cover those expenses?",
      "author": "bigvalley11",
      "created": 1566191416,
      "upvotes": 0,
      "replies": {}
    },
    "ewybzks": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewybzks/",
      "text": "I went to a big university in Florida, paid everything with money saved up and loans, got zero in financial aid. This ‘poor kid’ I know, got 22k a year and didn’t even finish his first semester!",
      "author": "koala_bear_05",
      "created": 1565878441,
      "upvotes": -3,
      "replies": {
        "exec4li": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/exec4li/",
          "text": "I’m confused. Are you trashing him for not finishing?",
          "author": "ApplyingToUniSoon",
          "created": 1566208785,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ewy6x05": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy6x05/",
      "text": "I’m not gonna refute that being poor is the worse of the situations. Its obviously is. But we’re talking about college.\n\nI’d MUCH rather struggle to buy supplies and food than for tuition. Unless you go to community college, tuition costs more, and in that case you can just go home to eat and sleep anyways.",
      "author": "Mathman2021",
      "created": 1565875915,
      "upvotes": -4,
      "replies": {
        "ewyagkr": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyagkr/",
          "text": "You’d rather not be able to eat and have to take out loans for supplies than have to take out loans for tuition?",
          "author": "VeryVeryValentine",
          "created": 1565877674,
          "upvotes": 9,
          "replies": {
            "ewyatvl": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyatvl/",
              "text": "I’d rather take out smaller loans for supplies and food that larger loans for tuition. It’s simple math.\n\nI’m obviously not disputing that outside of college being lower class is harder even with programs that help with money, but in college being lower class is an advantage.",
              "author": "Mathman2021",
              "created": 1565877861,
              "upvotes": -3,
              "replies": {
                "ewybd69": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewybd69/",
                  "text": "Food and supplies can be expensive though and when you’re poor you want to save as much money as possible. It’s not fun and you end up skipping lots of meals. I posted a comment here earlier, I’m only eating once every other day and I’m not gonna take out loans for food. It’s uncomfortable but Its how I can survive.",
                  "author": "VeryVeryValentine",
                  "created": 1565878130,
                  "upvotes": 10,
                  "replies": {
                    "ewyekop": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyekop/",
                      "text": "I know they can be expensive, but my point is that financially they’re not as expensive as tuition.",
                      "author": "Mathman2021",
                      "created": 1565879724,
                      "upvotes": 1,
                      "replies": {
                        "ewyet8j": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyet8j/",
                          "text": "You really just ignored everything didn’t you. The difference is quality of life. You can afford to take out loans and still eat and go on vacations and have fun, poor people literally can’t",
                          "author": "VeryVeryValentine",
                          "created": 1565879844,
                          "upvotes": 4,
                          "replies": {
                            "ewyh0mx": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyh0mx/",
                              "text": "That’s not true. In terms of general life, yes, middle class obviously has it better. But in college, my family is paying the whole $600,000+ it’s going to cost for three kids to go to college where scholarships do something, but it’s not much of a dent. No one is going to be taking vacations or eating fancy meals for quite a few years. My parents will be paying that off for the rest of their life and I love them for that, but it’s not like the middle class can just pay for college no big deal.",
                              "author": "Mathman2021",
                              "created": 1565880922,
                              "upvotes": 1,
                              "replies": {
                                "ewyhl5d": {
                                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyhl5d/",
                                  "text": "Still. I don’t even mean “fancy” meals I mean regular meals. Your parents can afford to pay it and still only have to cut off luxuries, not necessities. My comforter got ripped up so all I have for this year are 3 blankets and I’m planning on just sleeping in hoodies so I can make it through the winter. I’m from Florida and I go to college in Iowa so I never had to invest in winter stuff so I literally only have one pair of boots and one winter coat. All of my stuff is breaking down. I had 3 nice pairs of shoes and I’m down to 2 because the sole separated from the rest of the shoe. You wouldn’t have to deal with that regardless of how much debt you accumulate",
                                  "author": "VeryVeryValentine",
                                  "created": 1565881203,
                                  "upvotes": 5,
                                  "replies": {
                                    "ewyi9dr": {
                                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyi9dr/",
                                      "text": "How much do you think middle class people make? $600,000 is still $600,000. It would take over six years to pay that off with just salary. Then there’s the fact that we still have to pay for food, electricity, water, etc like everyone else. My parents won’t be eating anything fancy or regular for a while. My dad works over 100 hours a week and I love him for that, but it’s to help pay for our college. We don’t get any help from the government. We also have to give almost half of our income to health care. The difference in income is less than the difference in how much college will cost.",
                                      "author": "Mathman2021",
                                      "created": 1565881533,
                                      "upvotes": 1,
                                      "replies": {
                                        "ewyilbq": {
                                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyilbq/",
                                          "text": "Ik it sucks but it’s still better than being poor. And yeah my mom works 3 jobs so she can pay for my sis and I to go to college. Must b nice having health care",
                                          "author": "VeryVeryValentine",
                                          "created": 1565881700,
                                          "upvotes": 5,
                                          "replies": {
                                            "ewyjtxv": {
                                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyjtxv/",
                                              "text": "I’m not debating that being lower class is harder outside of college, but in college the financial amount of help given for tuition outweighs the amount it costs for food and supplies.",
                                              "author": "Mathman2021",
                                              "created": 1565882296,
                                              "upvotes": -1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "ex03cbq": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ex03cbq/",
                          "text": "They are if you don't have any money.   Taking out loans to choose an expensive private school is a choice.  Being poor AF is not a choice.",
                          "author": "FeltIOwedItToHim",
                          "created": 1565904368,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ewxwsdb": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxwsdb/",
      "text": "Original middle class poster: thanks for this (civil) response! One thing I definitely realized from this and my original is that college isn’t equal payment, it’s equal sacrifice. It sucks to pay for for everyone (I mean unless you are legit rich).",
      "author": "windstorm02",
      "created": 1565870103,
      "upvotes": -3,
      "replies": {}
    },
    "ewy28j3": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy28j3/",
      "text": "https://chat.whatsapp.com/IxKUVtu4qRr7044uNtpg4K",
      "author": "vamshi8074",
      "created": 1565873184,
      "upvotes": -5,
      "replies": {}
    },
    "ewy29lb": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy29lb/",
      "text": "https://chat.whatsapp.com/IxKUVtu4qRr7044uNtpg4K",
      "author": "vamshi8074",
      "created": 1565873200,
      "upvotes": -3,
      "replies": {}
    },
    "ewxy47i": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewxy47i/",
      "text": "Sure, but the argument that middle class posts make is that the cost of food, toiletries, etc. is a very very very negligible percentage of the tuition/room. It's like if you were running a marathon, tuition would be the first 1599 meters, and the last meter is all the other stuff. And not only that, there's a lot of new programs to help low income families send their kids to a selective school. Almost none of those things exist for middle class+.\n\n[https://www.insidehighered.com/news/2016/01/12/high-achieving-low-income-students-remain-rare-most-selective-colleges](https://www.insidehighered.com/news/2016/01/12/high-achieving-low-income-students-remain-rare-most-selective-colleges)\n\nAnd yes, low income students are more commonly failed at selective schools. Whether the school purposely does that, I don't know. \n\nThere's also different types of struggles. The struggles that a middle class family has is vastly different from the struggles of a low income family, which are equally difficult for the respective families to tackle.\n\nNot saying that kids who have rough incomes don't have it bad, but that's the argument middle class posts are making, and it makes sense.",
      "author": "nydanny2014",
      "created": 1565870912,
      "upvotes": -8,
      "replies": {
        "ewy180e": {
          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy180e/",
          "text": "I’m upper middle class so I can’t speak for those in the lower middle class or who are poor. But I just disagree. I think the struggle that low income students face is objectively worse. \n\nThose toiletries, books, etc may seem like not much to us, but for people who are poorer, they can be enough that the entire budget has to be planned around it. If they can afford it. The idea of paying a decent percentage of tuition to someone in the lower class is a fucking joke. For us, it just sucks. Maybe some loans.\n\nAnd I know that not being able to go to your ideal college sucks but at the very least, if you’re middle class, you can get a scholarship to a solid school, then be fine. The books, toiletries, etc. hardly matter because they’re nothing compared to that huge sticker price.\n\nBut let’s say you’re poor, first generation. You work your frickin butt off in grade school to get an amazing scholarship to a competitive high school. Then you’re lost. It’s a completely new environment. Everyone seems to know what they’re doing but you. You struggle freshman year but eventually get the hangout of it. You push yourself everyday to get good grades while dealing with challenges people aren’t even aware of. You didn’t have a family wedding during that school field trip; you couldn’t afford the $80 like most people paid without even thinking.\n\nBut you keep pushing and get a great scholarship to a solid school. Now it’s high school all over again but worse. Now all these things that are little to most people NEED to be paid. You can’t go without toiletries, sheets, etc. But sometimes you have to.\n\nIt’s just so different. I’m not saying people in the middle class don’t have reason to complain. Not saying that at all. But I don’t think you can say the struggles are the same burden.",
          "author": "readettore",
          "created": 1565872645,
          "upvotes": 7,
          "replies": {
            "ewy5lzj": {
              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy5lzj/",
              "text": "Yes, I am saying that they're the same burden. I debate, and we've literally gone over hundreds of impacts on student debt. Low income families don't have to pay tuition, but struggle with living expenses. Everyone else gets fucked over by student debt, which may very well put you in a position worse than the kid with low income. Especially if you pick a shitty job prospect major, like something in the liberal arts.",
              "author": "nydanny2014",
              "created": 1565875217,
              "upvotes": -7,
              "replies": {
                "ewy9l5b": {
                  "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy9l5b/",
                  "text": "If you think your debate experience has even scratched the surface of this topic, you are incorrect.",
                  "author": "fleurdedalloway",
                  "created": 1565877238,
                  "upvotes": 7,
                  "replies": {
                    "ewy9xko": {
                      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewy9xko/",
                      "text": "No, I do believe it has. Impacts of student debt are infinitely worse for a country overall than some poor people not being able to attend college.",
                      "author": "nydanny2014",
                      "created": 1565877410,
                      "upvotes": -4,
                      "replies": {
                        "ewyauaw": {
                          "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewyauaw/",
                          "text": "“Yes, I am saying that they're the same burden. I debate, and we've literally gone over hundreds of impacts on student debt. Low income families don't have to pay tuition, but struggle with living expenses. Everyone else gets fucked over by student debt, which may very well put you in a position worse than the kid with low income. Especially if you pick a shitty job prospect major, like something in the liberal arts.”\n\nThat wasn’t all you said, though. You suggested that lower income kids do not suffer from student debt, but that those that do (middle-upper class) may end up in worse situations. You stated that “everyone else” is fucked over by student debt. All of that is heavily flawed, and if that isn’t what you meant, that IS how you phrased it. \n\nEdit: You’re a rising junior. I know you hate when people bring this up— I hated it too—but you’re young. Don’t start acting like you’ve got the whole country’s situation figured out yourself. You’ll have plenty of time when you’re older to feel that way. I don’t even feel that way, and I’m 5 years older than you. \n\nYour instant downvotes on my comments are showing that you aren’t even kind of open to my opinion, and that really sucks to see.",
                          "author": "fleurdedalloway",
                          "created": 1565877868,
                          "upvotes": 5,
                          "replies": {
                            "ewybg0z": {
                              "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewybg0z/",
                              "text": "Yeah, low income students face less amounts of student debt than middle class kids. Student debt bad, a few hundred thousand+ in student debt is pretty bad. But you know what, I'm sure OBJECTIVELY(and I quote), those living expenses are pretty rough.",
                              "author": "nydanny2014",
                              "created": 1565878169,
                              "upvotes": -3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ewx7cw6": {
      "link": "/r/ApplyingToCollege/comments/cqkgri/poor_kids_have_it_worse_in_response_to_middle/ewx7cw6/",
      "text": "Thank God I'm getting married, will appear poor on the FAFSA but still have help from middle class parents",
      "author": "UnRenardRouge",
      "created": 1565847126,
      "upvotes": -18,
      "replies": {}
    }
  }
}