{
  "sid": "qhemdy",
  "link": "/r/ApplyingToCollege/comments/qhemdy/how_much_does_my_gpa_play_into_admission/",
  "title:": "How much does my GPA play into admission?",
  "text": "I’m looking to get into PITT university main campus but I only have a unweighted overall gpa of 3.3 or so. In my first two years of high school I was suffering from extreme depression and anxiety and my mother died unexpectedly. Due to this mental illness and grief along with covid mixed in I did poorly in school. I’m now getting back on my feet and drastically changed my grades. Aside from my math grade, I have all good grades and am excelling in my AP and honors classes. I am also heavily involved in extracurriculars and community work. However, I have been told that in order to get into PITT I would need a 3.75 or above. Is there a way I could work around this? I heard PITT has almost a 60% acceptance rate so why does it have such a high required gpa? If this is a set in stone gpa is there anyway I could quickly raise my gpa during my junior year?",
  "author": "OkSection3524",
  "created": 1635394284,
  "updated": 1635455975,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hicbj01": {
      "link": "/r/ApplyingToCollege/comments/qhemdy/how_much_does_my_gpa_play_into_admission/hicbj01/",
      "text": "High School GPA is the number one factor in college admissions.\n\nPitt claims an average 4.11 GPA on their CDS, so they are obviously playing fast and loose with the data and ignoring the “on a 4.0 scale” guidance.\n\nEven with that, 18% are shown with a GPA under 3.75. So on a true 4.0 scale, I wouldn’t be surprised if 30%+ are below a 3.75, so it’s certainly not a hard requirement.",
      "author": "RichInPitt",
      "created": 1635394635,
      "upvotes": 4,
      "replies": {}
    },
    "hiccz8d": {
      "link": "/r/ApplyingToCollege/comments/qhemdy/how_much_does_my_gpa_play_into_admission/hiccz8d/",
      "text": "As the others have commented, GPA is one of the largest factors in admission decisions. However, many schools, incl PITT, also look at the whole application (“holistic” evaluation of app), so they’ll look at extenuating circumstances, of which a parent death certainly applies. There’s no sugar-coating that your GPA makes you less competitive, but your LORs/personal statement/essays, grade improvement trend, and extenuating circumstances can alleviate your less than ideal GPA.",
      "author": "pixelatedpix",
      "created": 1635395462,
      "upvotes": 3,
      "replies": {}
    },
    "hicbsgg": {
      "link": "/r/ApplyingToCollege/comments/qhemdy/how_much_does_my_gpa_play_into_admission/hicbsgg/",
      "text": ">why does it have such a high required gpa?\n\nI don’t believe there’s a single school in the US — not even Harvard — that has a “required” GPA.\n\nThat said, your GPA is the most important part of your application.\n\nCheck section C11 of Pitt’s Common Data Set to see what the actual GPA range was for the most recently reported freshman class.\n\n[https://ir.pitt.edu/wp-content/uploads/2021/01/CDS\\_2020-2021-Pittsburgh-Campus.pdf](https://ir.pitt.edu/wp-content/uploads/2021/01/CDS_2020-2021-Pittsburgh-Campus.pdf)",
      "author": "Strict-Special3607",
      "created": 1635394785,
      "upvotes": 2,
      "replies": {}
    },
    "hicopjc": {
      "link": "/r/ApplyingToCollege/comments/qhemdy/how_much_does_my_gpa_play_into_admission/hicopjc/",
      "text": "I can't really say anything helpful, but I did want to say that I'm sorry you went through all of that and I'm wishing the best for you.",
      "author": "dontatmeplz3",
      "created": 1635403602,
      "upvotes": 1,
      "replies": {}
    }
  }
}