{
  "sid": "qs1b8n",
  "link": "/r/ApplyingToCollege/comments/qs1b8n/css_profile_help/",
  "title:": "CSS profile help!",
  "text": "Literally what is a CSS profile, why do i have to fill it out and how is it any different from the FAFSA? I just wanna know how it works. Also, for those of you who have done it already, how long does it take?",
  "author": "Worried_Scallion789",
  "created": 1636684348,
  "updated": 1636745325,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hka8xal": {
      "link": "/r/ApplyingToCollege/comments/qs1b8n/css_profile_help/hka8xal/",
      "text": "Heeello! First, breathe and sit down. You need a bit of steadiness. The CSS profile is a financial aid form that you need to fill out for some colleges. It highlights your financial situation, taxes and else. I don’t particularly know its difference from the FAFSA as I’m an international, but you can find the info online. There is a website (it’s a domain from college board) that has tons of videos on how to fill it out. It takes a bit, but could be faster if you have the documents and information at hand. Google this! Don’t mean to be rude but it literally has the answer to all of your questions.",
      "author": "Isa_Isabella",
      "created": 1636684917,
      "upvotes": 4,
      "replies": {
        "hkaamxz": {
          "link": "/r/ApplyingToCollege/comments/qs1b8n/css_profile_help/hkaamxz/",
          "text": "first, you’re not being rude \nsecond, thank you so much \nand third, do i need to fill it out by the deadline for each of the colleges i’m applying to or is there leeway with that?",
          "author": "Worried_Scallion789",
          "created": 1636685700,
          "upvotes": 2,
          "replies": {
            "hkacbwl": {
              "link": "/r/ApplyingToCollege/comments/qs1b8n/css_profile_help/hkacbwl/",
              "text": "Google says:”The College Board recommends turning in your CSS Profile at least two weeks prior to your earliest college application deadline. Ultimately, you'll need to check with each school you're applying to. As with any important document, the earlier you get this profile done, the better”. \nSooooo I think check it, but it should be done at the same time of your apps",
              "author": "Isa_Isabella",
              "created": 1636686511,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}