{
  "sid": "qrlgrm",
  "link": "/r/ApplyingToCollege/comments/qrlgrm/penn_state_vs_arizona_state_for_engineering/",
  "title:": "Penn State VS Arizona State for Engineering?",
  "text": "Hi, I am an international student and was accepted to both universities.\n\nI am not sure which one to go for engineering as it has both pros and cons. I like PSU’s prestige in engineering, great alumni connection, while ASU’s location, climate, and that it's ranked No. 1 for innovations in the US.\n\nOne of the main factors for me is location and opportunities. I'm not too fond of isolated places in the middle of nowhere, as they are genuinely depressing. I know that I will like ASU with its atmosphere, but not sure about Penn State.\nHowever, I am not sure which one offers better opportunities in terms of internships, maybe co-ops for internationals, to get more experience in my major.\n\nTuition of both for internationals is ofc pricey, but there's not much difference (PSU is a bit more expensive), so price tags are not a significant factor.\n\nAppreciate any of your answers. Thanks.",
  "author": "bzlare",
  "created": 1636637765,
  "updated": 1637365023,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hk7eys2": {
      "link": "/r/ApplyingToCollege/comments/qrlgrm/penn_state_vs_arizona_state_for_engineering/hk7eys2/",
      "text": "Ignoring the No 1 in Innovation ranking (it's just a marketing stunt), I would opt for ASU here since it seems to have the location advantage you're looking for. Penn State is a great school too, but ASU sounds like a better match for you.",
      "author": "prsehgal",
      "created": 1636641068,
      "upvotes": 6,
      "replies": {
        "hk7i7t8": {
          "link": "/r/ApplyingToCollege/comments/qrlgrm/penn_state_vs_arizona_state_for_engineering/hk7i7t8/",
          "text": "I’m a Pennsylvanian who hold PSU in high regards and I agree ASU is the right choice.",
          "author": "IDrankChocolateMilk",
          "created": 1636642531,
          "upvotes": 2,
          "replies": {
            "hk85tda": {
              "link": "/r/ApplyingToCollege/comments/qrlgrm/penn_state_vs_arizona_state_for_engineering/hk85tda/",
              "text": "What do you think cons of Penn State? I only find its location in the center of Pennsylvania in a small city. But cannot mention other things by now",
              "author": "bzlare",
              "created": 1636652295,
              "upvotes": 1,
              "replies": {
                "hk8bq8x": {
                  "link": "/r/ApplyingToCollege/comments/qrlgrm/penn_state_vs_arizona_state_for_engineering/hk8bq8x/",
                  "text": "I cant think of anything academically wrong with PSU (I didn’t go there). The engineering scene is far bigger in the Phoenix area than Pennsylvania as a whole with maybe the exception of Pittsburgh. Phoenix and Pitt are tech hubs, but Phoenix is simply larger.\n\nState College is a decent sized town, but it is built around and for the college. There isn’t much of a community unaffiliated with the university.  \n\nOn your concern for internship ops, I have no idea. You should ask the respective subreddits. You’ll probably have a better time in ASU (the West is so amazing), but I’m not sure how big the academic trade off is",
                  "author": "IDrankChocolateMilk",
                  "created": 1636654600,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk7xufe": {
          "link": "/r/ApplyingToCollege/comments/qrlgrm/penn_state_vs_arizona_state_for_engineering/hk7xufe/",
          "text": "Thank you! I am leaning towards ASU after some advises too, but I still have some time to think.",
          "author": "bzlare",
          "created": 1636649141,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk947ti": {
      "link": "/r/ApplyingToCollege/comments/qrlgrm/penn_state_vs_arizona_state_for_engineering/hk947ti/",
      "text": "I am a parent whose son is applying this year. I am also working as a tech executive in Bay Area for years. I am not familiar with PSU, but due it’s proximity to Silicon Valley, a lot of companies from here hire from ASU. Barrett college (In ASU) is a highly regarded honors college and once you are accepted in ASU, it’s not difficult to get in Barrett. One other aspect, since ASU gives full ride to national merit scholarship finalists, a lot of very smart students chose ASU, especially CS kids. You’ll be in good company there.",
      "author": "anxiousCAMom",
      "created": 1636666220,
      "upvotes": 3,
      "replies": {}
    }
  }
}