{
  "sid": "qjydld",
  "link": "/r/ApplyingToCollege/comments/qjydld/do_i_submit_my_1420_sat_score_to_northeasterns/",
  "title:": "Do I submit my 1420 SAT score to Northeastern’s Business School?",
  "text": "This is a super niche post; I apologize if I’m breaking any rules. \n\nMy grades are questionable. Freshman and sophomore year were not the best, but I have a severe upwards trend so far.\n\nGPA:\nUW: 3.95/4.5\nW: 4.25/4.5\n\nI don’t know if you’ll be able to get anything out of this metric, but I’m very slightly above the range of accepted GPAs according to my school’s Naviance. \n\nMy SAT score is a 1420 (730 EBRW + 690 Math). Northeastern average SAT, for context, is somewhere around a 1470 according to their website. I’ve also heard rumors, though, that the statistics are super inflated.\n\nI’ve been debating whether to go test-optional for a minute now. Any advice?",
  "author": "GreatLifeInc",
  "created": 1635713235,
  "updated": 1635777526,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hit4fsv": {
      "link": "/r/ApplyingToCollege/comments/qjydld/do_i_submit_my_1420_sat_score_to_northeasterns/hit4fsv/",
      "text": "i submitted my neu application today and i submitted my 1420 (710 on both sections). the range is like 1430-1520, but a 1420 was close enough for me to submit.",
      "author": "InquisitiveInFashion",
      "created": 1635713591,
      "upvotes": 3,
      "replies": {}
    },
    "hit9298": {
      "link": "/r/ApplyingToCollege/comments/qjydld/do_i_submit_my_1420_sat_score_to_northeasterns/hit9298/",
      "text": "I just finished submitting my app to NEU explore program and I went test optional. My counselor told me not to submit my 1440, and also during a northeastern virtual information session the speaker told us their average was 1470, and to not submit SAT if you scored even just 20 points less. At the same time a 1420 is a good score so Idk if this is the best advice, but good luck w ur apps!! :)",
      "author": "awanderingmoth",
      "created": 1635715679,
      "upvotes": 1,
      "replies": {}
    }
  }
}