{
  "sid": "qg7gag",
  "link": "/r/ApplyingToCollege/comments/qg7gag/possible_self_report_sat_error_not_sure/",
  "title:": "Possible Self Report SAT Error (not sure)?",
  "text": "Hello all. I have completed my Common App, and have submitted it to various colleges, and I self reported my SAT scores. However, I looked at it close again today, and realized there might be a small error. There is no total score or reading section score, but there is the overall math and reading/writing score. It looks something like this.  **Total**: blank | **Evidence-Based Reading and Writing Section**: (actual correct score) | **Math Section**: (actual correct score) | **Reading Test**: blank\n\nI was wondering if this is a serious problem or not. If it is, should I just pay and send the SAT to all of my colleges (I did not apply to very many) so they have my actual scores and see what I did wrong? I was told I did not have to send scores until I was accepted by someone on here (to save money), but that could be wrong.\n\nthanks to all",
  "author": "basic4345",
  "created": 1635258033,
  "updated": 1635301711,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi4dqbp": {
      "link": "/r/ApplyingToCollege/comments/qg7gag/possible_self_report_sat_error_not_sure/hi4dqbp/",
      "text": "You're fine. The Common App Testing section does not have a field for SAT composite score or for SAT reading score.  (I have no idea why there would be one in the PDF.)\n\nIf this is in the college-specific questions rather than the Common App testing section, which college is it?\n\nAs for self-reporting in general, check each of your colleges' websites to see what score reporting methods they accept. Many colleges now accept scores self-reported in the app (or portal), for free, to be followed by an official report only if you later enroll. HOWEVER, other colleges still require official score reports sent directly from the testing agency prior to admission.",
      "author": "elkrange",
      "created": 1635260279,
      "upvotes": 1,
      "replies": {
        "hi4g3ai": {
          "link": "/r/ApplyingToCollege/comments/qg7gag/possible_self_report_sat_error_not_sure/hi4g3ai/",
          "text": "Hi, thank you for the reply! It was just the Common App self report, it was not specific for any one college. I checked, and each college I am applying to allows for self reports, but I will make sure they don't want that followed up by an official report before the admission decision.",
          "author": "basic4345",
          "created": 1635261250,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi65321": {
      "link": "/r/ApplyingToCollege/comments/qg7gag/possible_self_report_sat_error_not_sure/hi65321/",
      "text": "You don’t enter a total on the Common App, just the two sections. And Reading hasn’t been a section since 2016. It’s odd they have these on a pdf version of the app, but you can ignore them.\n\nAs always, check each school’s portal after the application is received. Some have totals, some don’t. Just be sure that whatever they show is correct.\n\nSend official scores to schools that require them (4 of my daughter’s 9 EA schools did) - don’t waste the money for the others.",
      "author": "RichInPitt",
      "created": 1635285279,
      "upvotes": 1,
      "replies": {}
    }
  }
}