{
  "sid": "q4pkwh",
  "link": "/r/ApplyingToCollege/comments/q4pkwh/commonapp_supplemental_rec_system_is_so_stupid/",
  "title:": "CommonApp Supplemental Rec system is SO STUPID!!!!!",
  "text": "Edit: I emailed them and they changed it in 30 minutes... Never mind guys, we good.\n\nI swear to god. My volunteer supervisor told me last minute that she would be willing to write me a recommendation, unprompted. I said okay, and went to add her on my CommonApp. She didn't exactly fit any of the supplemental recommender types, so I put her as \"other\". Little did I know that some of my colleges DOESN'T EVEN ACCEPT \"other\" AS A VALID RECOMMENDER. This would all be good and fine, IF IT WAS POSSIBLE TO CHANGE THE TYPE RIGHT THERE IN THE COMMONAPP. But no, apparently we have to EMAIL THE APP SUPPORT CENTER AND ASK THEM TO CHANGE IT. Guess what, CommonApp? I have less than two weeks to submit this application, and for her to write the recommendation. If you don't change it by then, I'll have to submit without it, and her work will be for nothing. Why is there even a \"recommender type\" when CommonApp already asks the recommender to write about themselves before the recommendation? Why are colleges allowed to choose which Recommender types they accept? I understand if they don't want a family member rec, but \"other\" has too many important jobs and roles that would be willing to write a rec.\n\nI hate this 🤬🤬🤬.",
  "author": "redditnoap",
  "created": 1633799664,
  "updated": 1634074079,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hg03tqq": {
      "link": "/r/ApplyingToCollege/comments/q4pkwh/commonapp_supplemental_rec_system_is_so_stupid/hg03tqq/",
      "text": "CommonApp has a 24/7 online chat - try using that to see if they can sort out your issue that way. Or try deleting the recommender and adding them again as a different type.",
      "author": "prsehgal",
      "created": 1633800163,
      "upvotes": 1,
      "replies": {
        "hg056ll": {
          "link": "/r/ApplyingToCollege/comments/q4pkwh/commonapp_supplemental_rec_system_is_so_stupid/hg056ll/",
          "text": "Deleting the recommender and adding them again as a different type does not work, and according to the CommonApp website, I have to send an email to [appsupport@commonapp.net](mailto:appsupport@commonapp.net) and ask them to change it. I sent the email already, and I'll see what happens. Thank you.\n\nEdit: They changed it 30 minutes after I sent the email.",
          "author": "redditnoap",
          "created": 1633800756,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}