{
  "sid": "q9bv30",
  "link": "/r/ApplyingToCollege/comments/q9bv30/is_a_letter_of_recommendation_from_a_corporate/",
  "title:": "Is a Letter of Recommendation from a Corporate Research company valuable?",
  "text": " \n\nHi everyone,\n\nI am considering to apply for a PhD position this year and one of my recommenders would be from an European corporate research department within a company in which I have done a research internship on. This department, which is in a big company, works as a \"bridge between academia and industry\" and thus they publish papers and go to conferences. The research I have done there is very closely related to what I would like to research in my PhD. I would like to ask if this letter would have a reasonable weight in my application, or if I should try to substitute it by a letter from a professor in a university in Latin America where I did my bachelors . The caveat is that my bachelors is not so closely related field to the PhD program I'll be applying for. Furthermore, universities in Latin America are not as well known as multinational companies.\n\nThank you all in advance!",
  "author": "Allansman",
  "created": 1634390392,
  "updated": 1634574455,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.9,
  "comments": {
    "hguvnfv": {
      "link": "/r/ApplyingToCollege/comments/q9bv30/is_a_letter_of_recommendation_from_a_corporate/hguvnfv/",
      "text": ">I am considering to apply for a PhD position\n\nThis is a sub for teenagers applying to undergrad schools… probably won’t get much in the way of relevant insight.",
      "author": "Strict-Special3607",
      "created": 1634390456,
      "upvotes": 32,
      "replies": {
        "hguwnkl": {
          "link": "/r/ApplyingToCollege/comments/q9bv30/is_a_letter_of_recommendation_from_a_corporate/hguwnkl/",
          "text": "Thanks for the info u/Strict-Special3607!",
          "author": "Allansman",
          "created": 1634391014,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hguxj7a": {
      "link": "/r/ApplyingToCollege/comments/q9bv30/is_a_letter_of_recommendation_from_a_corporate/hguxj7a/",
      "text": "r/gradadmissions",
      "author": "elkrange",
      "created": 1634391490,
      "upvotes": 16,
      "replies": {
        "hgwkz1b": {
          "link": "/r/ApplyingToCollege/comments/q9bv30/is_a_letter_of_recommendation_from_a_corporate/hgwkz1b/",
          "text": "You know, that sub lost a great chance to be called r/gradmissions and I'm still mad about it",
          "author": "FuriousGeorge1435",
          "created": 1634418051,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgux82z": {
      "link": "/r/ApplyingToCollege/comments/q9bv30/is_a_letter_of_recommendation_from_a_corporate/hgux82z/",
      "text": "What are your other recommendations? Where are you applying? Can you submit both?\n\nIf it's something like Microsoft Research or a think tank, it probably won't hurt, but it isn't as good as a tenure-track professor who is well-known and can praise you to the skies and work behind the scenes to tell his/her buddies in your department to take a closer look at your application (this definitely happens in some fields). Unless your recommender knows people where you're applying and can do this for you!",
      "author": "finewalecorduroy",
      "created": 1634391324,
      "upvotes": 0,
      "replies": {
        "hgzsmp4": {
          "link": "/r/ApplyingToCollege/comments/q9bv30/is_a_letter_of_recommendation_from_a_corporate/hgzsmp4/",
          "text": "My other LoR are two professors. One is closely related with this person from the corporate research center. I'll be applying for quite a number of schools and usually I would say I only have space for one of them, then unfortunately not both. The working behind the scenes that you mentioned would be fantastic, but I do not have many contact with American Scholars :/",
          "author": "Allansman",
          "created": 1634484601,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgw5dx1": {
      "link": "/r/ApplyingToCollege/comments/q9bv30/is_a_letter_of_recommendation_from_a_corporate/hgw5dx1/",
      "text": "I'm applying to PhDs this cycle after having taken some gap years to work in industry and do an MS. I'm getting a rec letter from a former boss because they know my work ethic and ability to produce quality work better than someone who I just took classes with in undergrad. I think it's a good move IMO. Like other people said though, do go post in grad-school oriented subreddits to get more valuable feedback :P",
      "author": "ShiaTheBluff",
      "created": 1634411322,
      "upvotes": 1,
      "replies": {}
    }
  }
}