{
  "sid": "qgip5r",
  "link": "/r/ApplyingToCollege/comments/qgip5r/the_importance_of_a_strong_support_network_also/",
  "title:": "THE IMPORTANCE OF A STRONG SUPPORT NETWORK. also community college rocks.",
  "text": "I completely forgot about this sub until I got a notification concerning it. As a third college student, I want to share some of the things I learned regarding colleges/universities. Ik a lot of yall are aiming for the stars and that's cool and I'm happy for you. All I want to say is, you could still shoot for the stars, even if you're attending you're local CC. Don't let anyone tell you otherwise.\n\nCommunity College is a valid option. It's an awesome option, even. I went to it because I knew I wasnt ready to commit to a university just yet. The professors there are amazing, in my experience. They are super passionate and absolutely brilliant and they will give you a quality education. One of my favorite professors, I still keep in contact with, now teaches at Rice University, one of the most prestigious schools in the world and I got to take his class for almost-free! The community there is super supportive, nothing like my high-school where teachers and students would straight up cringe in pity when I disclosed my ambitions. They are very uplifting and push you to do your best! My classmates and professors had more faith in me than I did in myself and it's really game changing to be surrounding by people who actually believe in you.\n\nI'm now attending UT and I know that I would've never got in had I not attended community college. I wasn't the smartest in my class in high-school, I was totally unmotivated and I never, ever imagined I would get into such a school. I remember my coworker once laughed at me when I told her my ambitions to go to UT and she said:\n\n\"You're not going anywhere, you're going to be stuck here like the rest of us.\"\n\nAnd I hate myself for it, but that's when I gave up on that dream right then and there until I got into cc and met the people that have literally changed my life for the best. This post is for those people who are lost, confused, and unsure about your next move. It's for the people who think they've lost their shot at attending their dream school because of their grades/ECs in high-school. Please don't give up! There's still a way to make up for it! I think the hardest part of this journey is finding someone who's rooting for you, it could be just one person and if you can't find anyone, you should always have your back to fall on. I cannot stress how important it is to have a strong support network to fall back on when you need it. \n\nIk this is ramble-y but I wish I had someone to tell me this in high-school. It's not over yet.",
  "author": "Ignoured",
  "created": 1635289498,
  "updated": 1635301535,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {}
}