{
  "sid": "qdjx4v",
  "link": "/r/ApplyingToCollege/comments/qdjx4v/just_got_stood_up_for_an_interviewportfolio/",
  "title:": "Just got stood up for an interview/portfolio review at my top school, is this a red flag?",
  "text": "I just had an incident with my top school that was really worrying, and I'm wondering how I should feel about it. My top school is an art school in New York, which I visited and toured last summer. I loved the campus, the atmosphere, and all the staff I met. I sent a lengthy thank you note afterwards, and the director of admissions replied saying that I could contact him to schedule a portfolio review/interview any time. Fast forward to two weeks before I'm planning on turning in my early action app, I email the admissions office to inquire about a portfolio review. They are very slow replying, and it takes me two weeks to actually set up a date with them, which was planned for yesterday.\n\nHere's where it gets complicated- they say that an admissions counselor will contact me about the zoom meeting link and code, but I continue to wait for this email, and only receive it three hours before my portfolio review. It feels like they're cutting it a bit close, but I don't mind until I check the email and notice that the admissions counselor entirely forgot to paste in the zoom info. I email him back within five minutes replying \"Unfortunately, I can't seem to access a zoom link from this email. Is there some other way that I could acquire the link?\" Two and a half hours pass, and he doesn't reply. Now only half an hour before my scheduled time, I panic and email both the admissions office and this specific counselor again, kindly asking for the meeting code. Radio silence. I sit at my computer for an hour refreshing my email, and then just give up. \n\nI don't receive a reply until the next day, in which this admissions counselor replies, \"I am so sorry you were not able to join.\" Not able to join? He never sent me the zoom link! This whole situation feels really off to me, and I can't tell if I'm overreacting or if this was really a rude move on their part. It really feels like they strung me along for two weeks barely replying to my emails, got my hopes up about an interview at my top school, and then proceeded to waste more of my time and be barely apologetic. I missed important classes for this meeting, but it feels like they just consider my time to be disposable. On the other hand, I understand that the admissions team must be under a huge amount of pressure with early action apps, so I guess I can understand how I'd slip through the cracks, even though I followed up multiple times through email.\n\nWhat do you guys think? Is this possibly a red flag for my top school? And how do I reply to this email in a kind way, but not letting to blame be shifted upon myself?",
  "author": "hermitcraber",
  "created": 1634918165,
  "updated": 1635183521,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "hhmwuft": {
      "link": "/r/ApplyingToCollege/comments/qdjx4v/just_got_stood_up_for_an_interviewportfolio/hhmwuft/",
      "text": "It's a mis-step; it happens. Email them back and explain clearly but nicely what happened and say you were really excited for it -- so can they reschedule and make sure to send a link? You might even want to give them a phone call to explain.  It's busy now, so it can be easy for them to miss details (like including a link, realizing you were unable to join).",
      "author": "minimuminfeasibility",
      "created": 1634919257,
      "upvotes": 17,
      "replies": {}
    }
  }
}