{
  "sid": "g5cq27",
  "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/",
  "title:": "still crying over the fact that i got accepted to uc berkeley after being rejected 2 years ago",
  "text": "like what the hell, i didn't think i'd ever get in\n\nhere i go crying again i can't believe i got in\n\nedit: thanks for all the congratulations and well wishes guys, y'all are awesome",
  "author": "transferAsFuck",
  "created": 1587464619,
  "updated": 1634077726,
  "over_18": false,
  "upvotes": 1707,
  "upvote_ratio": 0.99,
  "comments": {
    "fo2la6n": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2la6n/",
      "text": "[deleted]",
      "author": null,
      "created": 1587466662,
      "upvotes": 418,
      "replies": {
        "fo2lmls": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2lmls/",
          "text": "dude being waitlisted is such an accomplishment, i would've killed to have been waitlisted when i applied as a freshman. i hope you get off homie, you got this!!! and thank you <3\n\n(you're totally right tho lol ive texted my best friend at like 3am everyday since friday saying \"wow i got into berkeley\" hahaha)",
          "author": "transferAsFuck",
          "created": 1587467006,
          "upvotes": 147,
          "replies": {
            "fo2lryf": {
              "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2lryf/",
              "text": "[deleted]",
              "author": null,
              "created": 1587467152,
              "upvotes": 43,
              "replies": {
                "fo2mqt9": {
                  "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2mqt9/",
                  "text": "i don't blame you bro i was the same way when i submitted my appeal as a freshman. pro tip tho, if you can convince yourself that you're not gonna get in, it's a really nice surprise when/if you do. my mom can attest to the thousand times i said \"well i'll never get into berkeley so it's whatever\" 🤪",
                  "author": "transferAsFuck",
                  "created": 1587468104,
                  "upvotes": 28,
                  "replies": {
                    "fo38bkn": {
                      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo38bkn/",
                      "text": "> if you can convince yourself that you're not gonna get in, it's a really nice surprise when/if you do. my mom can attest to the thousand times i said \"well i'll never get into berkeley so it's whatever\" 🤪\n\ncan confirm. works well.\n\nmake sure not to have that lingering \"oh it'd be such a delight to get in\" or that subdued hope either. you need to be a master of doublethink.",
                      "author": null,
                      "created": 1587482419,
                      "upvotes": 10,
                      "replies": {
                        "fo4onfa": {
                          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4onfa/",
                          "text": "you get the vibes",
                          "author": "transferAsFuck",
                          "created": 1587508253,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "foalha6": {
                      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/foalha6/",
                      "text": "Lol, that was the exact mindset I had in March",
                      "author": "Alise_in_Wonderland",
                      "created": 1587648666,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "fo3dm4q": {
                  "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3dm4q/",
                  "text": "Hol up, lemme start doin that too LMAO",
                  "author": "throwawaymoose1369",
                  "created": 1587485091,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fo45lro": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo45lro/",
          "text": ">Thank you! My hopes are too high and that terrifies me because it's been one of my dream schools from the very beginning and I'll be crushed if I don't get in. I pray before I go to bed every single day and I'm not even religious lol\n\nI was waitlisted back in 2016 and accepted! Cal accepts quite a lot off the waitlist (I think over 30%) and due to COVID people will probably be struggling with committing to certain colleges so your chances remain high! Best of luck!! :D",
          "author": "peachescc37",
          "created": 1587498587,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo2kb61": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2kb61/",
      "text": "[deleted]",
      "author": null,
      "created": 1587465652,
      "upvotes": 102,
      "replies": {
        "fo2ks0q": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2ks0q/",
          "text": "i have full faith in you homie! keep at it legend!!!",
          "author": "transferAsFuck",
          "created": 1587466143,
          "upvotes": 28,
          "replies": {}
        },
        "fp4egrc": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fp4egrc/",
          "text": "I managed to get in as a 1-year transfer after being rejected by basically every UC. Anything is possible",
          "author": "shmoopdoop6969",
          "created": 1588297306,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fo2jimn": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2jimn/",
      "text": "Congrats!! Proud of you :)",
      "author": "honestly_tho_00",
      "created": 1587464808,
      "upvotes": 34,
      "replies": {
        "fo2ksoh": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2ksoh/",
          "text": "appreciate it dearly :)",
          "author": "transferAsFuck",
          "created": 1587466162,
          "upvotes": 13,
          "replies": {
            "fo3fug5": {
              "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3fug5/",
              "text": "Where're you transferring from?",
              "author": "Roughneck16",
              "created": 1587486189,
              "upvotes": 8,
              "replies": {
                "fo4o3ot": {
                  "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4o3ot/",
                  "text": "a california community college!",
                  "author": "transferAsFuck",
                  "created": 1587507961,
                  "upvotes": 2,
                  "replies": {
                    "fo4o7rl": {
                      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4o7rl/",
                      "text": "Nice work. Get ready to pick up the pace!",
                      "author": "Roughneck16",
                      "created": 1587508022,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fo343sc": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo343sc/",
      "text": "Congrats!!!! Where were you studying all this while?\n\nI'm tryna transfer into UCB someday as well. So would love to know more about the process. Any tips? And which year did you transfer into? Junior year? Can I enter UCB as a sophomore?",
      "author": "rish-16",
      "created": 1587480179,
      "upvotes": 25,
      "replies": {
        "fo3cajv": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3cajv/",
          "text": "Usually when you transfer its after you're done with your lower GE classes plus the required classes for the major youre planning to enroll. You enter as a junior.",
          "author": "thejimmycan",
          "created": 1587484433,
          "upvotes": 8,
          "replies": {}
        },
        "fo43jea": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo43jea/",
          "text": "The UC's pretty much only offer Junior level transfers though I think UC Davis allows sophomore level transfers for like 2 programs.\n\nMy biggest tip for transferring (not UC specific but helpful) is to plan ahead. Can't emphasize this enough. I didn't consider transferring until after I had started going to college and it was kind of difficult trying to research transfer requirements while going to class and clubs. Transfer requirements are usually GPA, classes, and academic standing.\n\nThe GPA requirement is just a minimum required amount and I'd suggest you keep your GPA higher than that. One example is UIUC CS. They require a 3.0 but the average GPA for an admitted transfer student for CS was a 3.89. I'm not trying to discourage you but yeah it can be hard. (This is CS in Engineering btw, not CS+X or Math+CS/Stats+CS)\n\nThe academic standing requirement is a pretty strict requirement but also pretty simple. Basically requires you to have completed a certain number of credit hours before the term you want to start. So for sophomore transfers, the required number of credit hours would be 30 semester hours and 45 quarter hours. For junior level transfer it would 60 semester hours and 90 quarter hours.\n\nThe class requirement is what requires your planning. This is because for certain programs, you will be required to complete a sequence of classes and unless you know this before you start, it can be hard to incorporate this sequence into your schedule. Planning out your classes is also necessary to make sure you aren't overwhelming yourself with classes. Sometimes taking certain classes together will mean you will have no time to do anything else.\n\nI wish you the best of luck for transferring to Berkeley!",
          "author": "ptc_yt",
          "created": 1587497588,
          "upvotes": 3,
          "replies": {
            "fo5okwi": {
              "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo5okwi/",
              "text": "Hey dude this is super helpful!!! Thank you so much :))) rlly good advice here",
              "author": "rish-16",
              "created": 1587531016,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fo4sm40": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4sm40/",
          "text": "hey homie, i was a studying at a california community college. you can't transfer to UCB as a sophomore—they only accept freshman and junior transfers. i posted some stuff about my stats and whatnot [here](https://www.reddit.com/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4rtul/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
          "author": "transferAsFuck",
          "created": 1587510412,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo2vlh7": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2vlh7/",
      "text": "congratulations! i feel so happy and excited for you, it's like im vicariously experiencing my dream school acceptance from a few weeks ago! \n\nwould love to give you an internet hug right now",
      "author": "vex_illology",
      "created": 1587475150,
      "upvotes": 13,
      "replies": {
        "fo4s513": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4s513/",
          "text": "*hugs* :')",
          "author": "transferAsFuck",
          "created": 1587510161,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo33hu3": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo33hu3/",
      "text": "Congratulations, OP!  I truly hope you enjoy Berkeley.  They are lucky to have you.\n\nHave a nice day!",
      "author": "eccentricgalaxy",
      "created": 1587479844,
      "upvotes": 8,
      "replies": {
        "fo4s5kr": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4s5kr/",
          "text": "thank u 🥺",
          "author": "transferAsFuck",
          "created": 1587510170,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo36y45": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo36y45/",
      "text": "Congrats! How was the transfer process? I’d like to transfer in as well. If you mind sharing stats it would be appreciated",
      "author": "vegynvegyn",
      "created": 1587481695,
      "upvotes": 6,
      "replies": {
        "fo38tfi": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo38tfi/",
          "text": "hi just jumping on this reply because i wanted to ask the same thing hehe, congratulations!!!",
          "author": "poohbou",
          "created": 1587482674,
          "upvotes": 5,
          "replies": {
            "fo4rwns": {
              "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4rwns/",
              "text": "hey homie i just posted a response with some stats and stuff",
              "author": "transferAsFuck",
              "created": 1587510033,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fo3cfp8": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3cfp8/",
          "text": "You finish all lower GE classes plus the major requirement ones. You apply the fall before. The application is mostly the same.",
          "author": "thejimmycan",
          "created": 1587484505,
          "upvotes": 3,
          "replies": {}
        },
        "fo4rtul": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4rtul/",
          "text": "hey man, yeah i can give some insight. so after i got rejected as a freshman, i realized i needed to finesse my way in somehow. instead of going to a csu, i went to a ccc and i changed my major from psychology (lost interest anyway so it was lucky) to english (because english majors have a comparatively higher acceptance rate at ucb and ucla). however at the same time, i was premed; i'm not anymore because depression, anxiety, and a very busy schedule outside of school make STEM harder than it already is, so i withdrew from some courses this semester but not until some math classes fucked up my gpa and brought it down to a 3.42. however, since literally all of my subpar grades were in STEM and i had a 4.0 in my english classes anyway, i assume the AO reviewing my application probably... disregarded my poor grades? not sure tbh, but it definitely helped that i was applying as an english major and not a bio major or something. biggest tip: keep your grades UP for your major prep courses. i also didn't finish one of my major prep courses but i explained to berkeley the situation with that in my berkeley update in january and i guess my explanation was sufficient.\n\nanyway! probably the strongest part of my application were my ECs and personal statements. my ECs involved all things english—tutoring, peer editing, creative writing with a sizable online following, starting a club and then holding a leadership position in said club (this is probably what helped me most in getting in), and some random art stuff that i had local recognition for. i also made sure to list every award and honor i could think of including scholarships and deans list, and i also listed all the school programs im a part of (think stuff like EOPS and MESA) to show i took advantage of resources offered to me. if your school has UCB TAP, *find your TAP coordinator and talk to them*. i also did UCLA TAP and listed the courses i took for honors credit on my application.\n\nas for my personal statements, i catered everything to me being a diligent student of english. i basically talked about how writing and editing and communicating are the things that i feel i'm best at and how i used those skills to better my community and my peers, whether it be through editing papers or tutoring high school students or starting a club. probably this is the way to go when writing your essays—cater everything to how you and your experiences that are associated with your major have helped both yourself and people around you. your major and your prep for it should be the focus. also address shortcomings in your application if you can (where it's relevant) and how you improved later; don't just list hardships. this might seem like an obvious point but i edited quite a few people's essays during this process and you'd be surprised how often this happens on accident!\n\ni also filled out the additional comments section (550 words) COMPLETELY. i had some legitimate reasons for why i didn't preform as well academically as i could've so i explained everything surrounding those circumstances. do not expect the UCs to assume that you have something legitimate to explain poor grades—they don't know anything. did you start medication one semester and couldn't focus? put that. did you take care of a sick relative for half the year? put that (and also put it in your ECs). tell them everything about you that could put your accomplishments and hurdles into context so they can review you completely as an applicant and understand reasons behind dips in your academic record if they are present. i had a lot of \"extenuating circumstances\" to explain some of my dips in my academic performance because, when i had more time to focus on school and homework, i was getting a 4.0. essentially, don't be scared to tell them stuff that happened.\n\ni think that's about it... oh i'm also in state, low income, and first gen, and i finished my IGETC. best part is that you don't have to take the SAT again ;)",
          "author": "transferAsFuck",
          "created": 1587509989,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo40co3": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo40co3/",
      "text": "Congrats! I feel like we’re on the same boat. After graduating high school I got denied from every single UC and I was devastated because I had to go to CC. I got accepted to Berkeley last Friday and it felt surreal, I just really hope I get into UCLA because that’s my dream school and if you’re trying for UCLA as well I wish you the best of luck.❤️",
      "author": "MrCouchPotado",
      "created": 1587496021,
      "upvotes": 5,
      "replies": {
        "fo4nxe6": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4nxe6/",
          "text": "MEEEE BRO WE'RE THE SAME! ucla is the dream and i'm waiting with bated breath bruh. cal was so crazy to get into after getting rejected or waitlisted then rejected from every uc as a freshman omg",
          "author": "transferAsFuck",
          "created": 1587507868,
          "upvotes": 2,
          "replies": {
            "fo4o258": {
              "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4o258/",
              "text": "Yeah we got this shit, we’re gonna do great stuff, especially if you go to UCLA as well :)",
              "author": "MrCouchPotado",
              "created": 1587507939,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fo411bv": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo411bv/",
      "text": "Ayy congrats my dude. I understand how you feel though with UIUC instead of Cal. I got a fat reject from UIUC when I applied for freshman admission and they didn't even have the balls to give me a nice rejection letter. Just said \"STATUS - DENIED\" on my portal. \n\nBut I got accepted as a transfer and it feels amazing. Can't wait to be on campus in the fall (if we can get through this coronavirus shit first)",
      "author": "ptc_yt",
      "created": 1587496360,
      "upvotes": 4,
      "replies": {
        "fo4nu09": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4nu09/",
          "text": "so proud of you homie",
          "author": "transferAsFuck",
          "created": 1587507817,
          "upvotes": 1,
          "replies": {
            "fo4vsm3": {
              "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4vsm3/",
              "text": "thanks g",
              "author": "ptc_yt",
              "created": 1587512195,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fo2jn1d": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2jn1d/",
      "text": "congrats!!",
      "author": "OneRamenNoodle",
      "created": 1587464940,
      "upvotes": 2,
      "replies": {
        "fo2ksc3": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo2ksc3/",
          "text": "thank you so much :)",
          "author": "transferAsFuck",
          "created": 1587466152,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fo3dbtm": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3dbtm/",
      "text": "Congrats, you deserve it!!\n\nI'm applying there for an MS so hopefully, I get in, in the future.",
      "author": "Spelmakrt",
      "created": 1587484949,
      "upvotes": 2,
      "replies": {
        "fo4o50n": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4o50n/",
          "text": "best of luck to you and thanks!",
          "author": "transferAsFuck",
          "created": 1587507981,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo3eu5y": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3eu5y/",
      "text": "CONGRATULATIONS IM SO PROUD OF YOU ❤️❤️",
      "author": "heIianthus",
      "created": 1587485695,
      "upvotes": 2,
      "replies": {
        "fo4s9t6": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4s9t6/",
          "text": ":') thanks",
          "author": "transferAsFuck",
          "created": 1587510234,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo3jent": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3jent/",
      "text": "Congratulations on getting in! I hope to do my masters there (unfortunately I got rejected from EECS at UC Berkeley but I was accepted into CS at Georgia Tech so it’s not a bad backup)",
      "author": "A0NOM",
      "created": 1587487897,
      "upvotes": 2,
      "replies": {
        "fo4o0c1": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4o0c1/",
          "text": "lmao gatech is def not a bad backup, congrats!",
          "author": "transferAsFuck",
          "created": 1587507912,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo3whm5": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3whm5/",
      "text": ":)",
      "author": "Merenr",
      "created": 1587494119,
      "upvotes": 2,
      "replies": {
        "fo5aq28": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo5aq28/",
          "text": ":)",
          "author": "transferAsFuck",
          "created": 1587521224,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo3bctb": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3bctb/",
      "text": "Got accepted as a freshman for CS but stills can’t attend cause too expensive as an OOS",
      "author": "antarjyot",
      "created": 1587483971,
      "upvotes": 4,
      "replies": {
        "fo4oa4l": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4oa4l/",
          "text": "oof that sucks, congrats on the acceptance tho homie",
          "author": "transferAsFuck",
          "created": 1587508057,
          "upvotes": 2,
          "replies": {
            "fo4ocvy": {
              "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4ocvy/",
              "text": "Thank you so much, same to you! I know you’ll excel at Berkeley",
              "author": "antarjyot",
              "created": 1587508097,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fo3568u": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3568u/",
      "text": "Congratulations!!",
      "author": "qiedeliangxiu",
      "created": 1587480751,
      "upvotes": 1,
      "replies": {}
    },
    "fo39tb1": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo39tb1/",
      "text": "Congrats homie hope to see you at Cal in the fall.",
      "author": "Klays_Dealer",
      "created": 1587483189,
      "upvotes": 1,
      "replies": {
        "fo4ogf1": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4ogf1/",
          "text": "thanks bro i appreciate it",
          "author": "transferAsFuck",
          "created": 1587508150,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo39yjx": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo39yjx/",
      "text": "Congrat.  I assume those tears are of joy and happiness.",
      "author": null,
      "created": 1587483264,
      "upvotes": 1,
      "replies": {
        "fo4oavu": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4oavu/",
          "text": "yup! thanks :)",
          "author": "transferAsFuck",
          "created": 1587508067,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo3gznj": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3gznj/",
      "text": "Congratulations!!",
      "author": null,
      "created": 1587486744,
      "upvotes": 1,
      "replies": {}
    },
    "fo3hi06": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3hi06/",
      "text": "holy shit this sounds like my cousin this exact thing happened to her a few days ago too",
      "author": "commieman420",
      "created": 1587486993,
      "upvotes": 1,
      "replies": {
        "fo4o2jg": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4o2jg/",
          "text": "was she crying? i was crying (i'm not your cousin tho)",
          "author": "transferAsFuck",
          "created": 1587507944,
          "upvotes": 1,
          "replies": {
            "fo4rlry": {
              "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4rlry/",
              "text": "Not sure, she lives in San Clemente and I’m in Dallas, probably thought, she got accepted into every one she applied to this time.",
              "author": "commieman420",
              "created": 1587509866,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fo3hqr0": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3hqr0/",
      "text": "congrats!!",
      "author": "cupcakes833",
      "created": 1587487108,
      "upvotes": 1,
      "replies": {}
    },
    "fo3ih0v": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3ih0v/",
      "text": "Congrats! Hopefully we’re all allowed to like, go on campus this fall! Go bears!",
      "author": "MinifigW",
      "created": 1587487450,
      "upvotes": 1,
      "replies": {
        "fo4o0xw": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4o0xw/",
          "text": "fr bro",
          "author": "transferAsFuck",
          "created": 1587507921,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo3pta3": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3pta3/",
      "text": "[deleted]",
      "author": null,
      "created": 1587490963,
      "upvotes": 1,
      "replies": {
        "fo4nz5m": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4nz5m/",
          "text": "thanks homie :)",
          "author": "transferAsFuck",
          "created": 1587507895,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo3qzok": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3qzok/",
      "text": "People are crying for getting in a good may be one of the best university and here i am who know fully well that i will never get into a good university but still doesn't feel bad about it.\n\nIt is not like i don't want to study in a good university it is just that i can't get into one.",
      "author": "zainsci",
      "created": 1587491523,
      "upvotes": 1,
      "replies": {}
    },
    "fo3wwtr": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3wwtr/",
      "text": "Congrats!!!",
      "author": null,
      "created": 1587494329,
      "upvotes": 1,
      "replies": {}
    },
    "fo3x5t8": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo3x5t8/",
      "text": "congrats! see you there in the fall!",
      "author": "probably_a_person_",
      "created": 1587494450,
      "upvotes": 1,
      "replies": {}
    },
    "fo43tx1": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo43tx1/",
      "text": "I'm applying as a freshman, and I'm scared as hell me with my [low GPA](https://www.reddit.com/r/chanceme/comments/ft3c98/for_my_birthday_please_chance_me_for_every_uc/?utm_source=share&utm_medium=web2x). I'm glad that you're able to relive your school dreams! Hopefully, I can spend them with you.",
      "author": null,
      "created": 1587497728,
      "upvotes": 1,
      "replies": {
        "fo4nt31": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4nt31/",
          "text": "i hope you get in dude!!! freshman admissions is insanely competitive, there's other routes in if you don't get in immediately",
          "author": "transferAsFuck",
          "created": 1587507803,
          "upvotes": 2,
          "replies": {}
        },
        "fo4s0ot": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4s0ot/",
          "text": "I'm a current student at Berkeley and got in with a low gpa (UW: 3.55 W: 4.0/4.1). Tbh I wouldn't worry about it too much. From what I've seen from my time at Berkeley, the Berkeley admissions team seems to value essays and the stories from them (diversity) very highly compared to other \"top schools.\" My SAT was also similar to yours.",
          "author": "hiiamblueboy",
          "created": 1587510094,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo4446e": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4446e/",
      "text": "wait you reapplied as a rising junior?",
      "author": "Bjergsyn",
      "created": 1587497867,
      "upvotes": 1,
      "replies": {
        "fo4nqlp": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4nqlp/",
          "text": "yeah i got rejected as a freshman and reapplied as a rising junior after going to cc for 2 years",
          "author": "transferAsFuck",
          "created": 1587507766,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo45pmk": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo45pmk/",
      "text": "Congrats!! I got into Berkeley as a transfer a couple years ago. There's a great transfer community waiting for you!",
      "author": "UndercoverMaster3169",
      "created": 1587498639,
      "upvotes": 1,
      "replies": {}
    },
    "fo48t9l": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo48t9l/",
      "text": "Welcome to the family, Golden Bear.",
      "author": "mehatch",
      "created": 1587500168,
      "upvotes": 1,
      "replies": {}
    },
    "fo4f0vk": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4f0vk/",
      "text": "[deleted]",
      "author": null,
      "created": 1587503235,
      "upvotes": 1,
      "replies": {
        "fo4nogi": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4nogi/",
          "text": "no haha there's a ton of ppl who go to cc for a while and then get in",
          "author": "transferAsFuck",
          "created": 1587507737,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fo4h9m2": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4h9m2/",
      "text": "i got rejected by berkeley 2 years ago when i wrote about my homelessness, now i’m accepted after all my success; i don’t know how i feel anymore",
      "author": "spongeboobryan",
      "created": 1587504393,
      "upvotes": 1,
      "replies": {}
    },
    "fo4mcgd": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4mcgd/",
      "text": "Wait so did you take 2 gap years? Do five years in high school and 1 gap year?",
      "author": "Abisauce",
      "created": 1587507032,
      "upvotes": 1,
      "replies": {
        "fo4nkoo": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4nkoo/",
          "text": "no i went to community college for 2 years",
          "author": "transferAsFuck",
          "created": 1587507685,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo4or0x": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4or0x/",
      "text": "Where are you transferring from?",
      "author": "VTDMAN7",
      "created": 1587508305,
      "upvotes": 1,
      "replies": {
        "fo4s0go": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4s0go/",
          "text": "a california community college",
          "author": "transferAsFuck",
          "created": 1587510091,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo53rjf": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo53rjf/",
      "text": "Hi!! I’m in the same boat as you and I can’t stop crying either. 2 years later and we did it!! Silly question but do you feel nervous at all or is it just me? I live in Southern California and will have to move there and I am so nervous it’s crazy. Also I read in one of your responses that you are an English major? I’m an English major too and I was curious to know what you are planning to do with your degree? Sorry for all the questions I’m a little scared about what’s to come so any response would help out. Anyway I hope you excel in your studies!",
      "author": "mmaddoxXxX",
      "created": 1587516872,
      "upvotes": 1,
      "replies": {
        "fo59c17": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo59c17/",
          "text": "hi hi! thanks a bunch for the congratulations and i extend the same wishes to you! i'm kinda nervous but i'm waiting to hear from la until i make any final decisions and go into overdrive lol. yes i am an english major! idk what i wanna do with my degree yet because i wanted to be a doctor for a while but i don't want the stress of premed anymore so rn i'm just focusing on finishing school and getting my degree. maybe i'll go into writing or editing or something, not sure",
          "author": "transferAsFuck",
          "created": 1587520338,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fo5fg60": {
      "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo5fg60/",
      "text": "stats/ECs?",
      "author": "plyu506",
      "created": 1587524357,
      "upvotes": 1,
      "replies": {
        "fo5h8w6": {
          "link": "/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo5h8w6/",
          "text": "can be found [here](https://www.reddit.com/r/ApplyingToCollege/comments/g5cq27/still_crying_over_the_fact_that_i_got_accepted_to/fo4rtul/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
          "author": "transferAsFuck",
          "created": 1587525590,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}