{
  "sid": "q9y57z",
  "link": "/r/ApplyingToCollege/comments/q9y57z/premed/",
  "title:": "Pre-Med",
  "text": "Do med schools really care about where you do your pre med from? Or do they just look at the MCAT scores?\nI’m an international applicant, and most of the kids from my school are applying to the top colleges in the US, so the bar set for me is pretty high. I don’t really want to go to a top school because of the cost, but yet again I’m scared of the social embarrassment idk it just sounds stupid but it scares me a lot.",
  "author": "Additional_Fold7154",
  "created": 1634475268,
  "updated": 1634654152,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgzb0wa": {
      "link": "/r/ApplyingToCollege/comments/q9y57z/premed/hgzb0wa/",
      "text": "Some med schools do more than others. Its not a large factor but is something they consider. Often though they give higher ranked undergrads more leeway on GPA and have better access to extracirriculars. You will be fine without going to a high ranked undergrad but it usually only helps you",
      "author": "CH3OH-CH2CH3OH",
      "created": 1634476163,
      "upvotes": 4,
      "replies": {
        "hgzblxb": {
          "link": "/r/ApplyingToCollege/comments/q9y57z/premed/hgzblxb/",
          "text": "Cool enough, thanks a lot",
          "author": "Additional_Fold7154",
          "created": 1634476478,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgzbg8r": {
      "link": "/r/ApplyingToCollege/comments/q9y57z/premed/hgzbg8r/",
      "text": "Your GPA / MCAT / shadowing and volunteering are the most important aspects.",
      "author": "skieurope12",
      "created": 1634476393,
      "upvotes": 2,
      "replies": {
        "hgzbmp6": {
          "link": "/r/ApplyingToCollege/comments/q9y57z/premed/hgzbmp6/",
          "text": "Makes me feel better lol, thank uu",
          "author": "Additional_Fold7154",
          "created": 1634476490,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgzeeux": {
      "link": "/r/ApplyingToCollege/comments/q9y57z/premed/hgzeeux/",
      "text": ">Do med schools really care about where you do your pre med from?\n\nNot as much as many folks on here think.  They look at grades, MCAT, and activities that suggest you're serious about practicing medicine.  Undergraduate research, healthcare-related ECs, etc.  The \"best\" schools for pre-med are the ones that make those last two things as easy and straightforward as possible.  But, even if you don't attend one of the \"best\" pre-med schools, you can still (usually) engage in those activities.",
      "author": "jayphoward",
      "created": 1634477962,
      "upvotes": 2,
      "replies": {}
    },
    "hgzcnky": {
      "link": "/r/ApplyingToCollege/comments/q9y57z/premed/hgzcnky/",
      "text": "Not all med schools care but better undergrad schools tend to have better opportunities for premed",
      "author": "Cool_Tale3626",
      "created": 1634477044,
      "upvotes": 1,
      "replies": {}
    }
  }
}