{
  "sid": "qjh7nu",
  "link": "/r/ApplyingToCollege/comments/qjh7nu/can_we_send_official_sat_to_pennn_state_even_if/",
  "title:": "Can we send official SAT to pennn state even if it takes till after the deadline to reach?",
  "text": "I submitted my Penn State app and on next steps I read that they require official SAT from collegeboard. Should I rush scores(I really don't want to pay extra)? Or is it fine to send them rn and have them reach after Nov 1?",
  "author": "ryderNick",
  "created": 1635651201,
  "updated": 1635778190,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hiq6lm5": {
      "link": "/r/ApplyingToCollege/comments/qjh7nu/can_we_send_official_sat_to_pennn_state_even_if/hiq6lm5/",
      "text": ">To meet the application deadlines outlined below, you have to **submit a complete application** by the provided date.\n\nA complete application includes official SAT scores.\n\nYou can try send rush scores immediately, but Monday is very soon.\n\nAlso note\n\n>Those students who submit a complete application, including a **Self-Reported Academic Record (SRAR), by November 1** will have the best chance of admission to their first-choice campus and/or major\n\nWe didn’t get access to the SRAR until we got access to the MyPennState portal, two days after sending the Common App. I’ve been advising people to release the Common App to PSU a week ahead of the deadline.\n\nYou can call and see if there’s a way to access the SRAR before sending your application.",
      "author": "RichInPitt",
      "created": 1635652718,
      "upvotes": 2,
      "replies": {
        "hiqnnbv": {
          "link": "/r/ApplyingToCollege/comments/qjh7nu/can_we_send_official_sat_to_pennn_state_even_if/hiqnnbv/",
          "text": "F, I had my exams going on till yesterday so I rlly couldn't. I mailed them about both things, i think I'll just go test optional. Ig I'm a little fucked 💀 thank you so much for the reply though!",
          "author": "ryderNick",
          "created": 1635665531,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiq5e32": {
      "link": "/r/ApplyingToCollege/comments/qjh7nu/can_we_send_official_sat_to_pennn_state_even_if/hiq5e32/",
      "text": ">Should I rush scores(I really don't want to pay extra)?\n\nThey won’t arrive by Monday even if you do.\n\nAccording to their website, your application must be “complete“ by November 1st.",
      "author": "Strict-Special3607",
      "created": 1635651997,
      "upvotes": 1,
      "replies": {}
    }
  }
}