{
  "sid": "qu1yqs",
  "link": "/r/ApplyingToCollege/comments/qu1yqs/is_this_an_okay_essay_topic/",
  "title:": "Is this an okay essay topic?",
  "text": "So I’ve heard that it’s generally advised that college applicants avoid writing about mental health in their essays, but I really want to write one of my uc personal insight responses about how learning how to cook during quarantine really motivated me to eat & gave me purpose/something to look forward to while I was struggling with depression. Every day was starting to feel the same and I didn’t even have the energy feed myself but learning new recipes and cooking for myself and my family gave me something new & fun to look forward to and was really fulfilling. It helped both my physical and mental health allowing me to perform better in all areas of my life, which is meaningful to me. But if talking about it will negatively impact my application, I’d rather avoid the topic.",
  "author": "kayla1021",
  "created": 1636931083,
  "updated": 1637180190,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hknfdv8": {
      "link": "/r/ApplyingToCollege/comments/qu1yqs/is_this_an_okay_essay_topic/hknfdv8/",
      "text": "Yea go ahead! I’m sure it will be a nice essay since it is really based on something you went through. Two advices tho: try to not be graphic (example, write your depression in a poetric or metaphorical way, try to not be too rough with the word choice) and also find a way to let 100% clear you are over it, you are a sane person and of course you now understand your happiness.",
      "author": "javznotjavz",
      "created": 1636931344,
      "upvotes": 3,
      "replies": {
        "hknj9ef": {
          "link": "/r/ApplyingToCollege/comments/qu1yqs/is_this_an_okay_essay_topic/hknj9ef/",
          "text": "i agree, one main issue with mental health essays is that you always have to conclude with the fact that you are now \"healthy and will not fall into the same situations again during your time in college\" (not to be pessimistic, you most likely will, mental illness is sadly life-long), because many colleges will turn away at the though of their student dropping out or not doing well due to their mental health.",
          "author": "neonheadache",
          "created": 1636933024,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkyf9wa": {
      "link": "/r/ApplyingToCollege/comments/qu1yqs/is_this_an_okay_essay_topic/hkyf9wa/",
      "text": "If approached from a cautious angle then absolutely! I edit essays so let me know if you need any help framing your idea!",
      "author": "JuicyEssays",
      "created": 1637128272,
      "upvotes": 1,
      "replies": {}
    }
  }
}