{
  "sid": "q6dlso",
  "link": "/r/ApplyingToCollege/comments/q6dlso/no_money/",
  "title:": "no money",
  "text": "Jusr filled out Cornell net price calc🤗😊😍😙😘😙😏\nfound out I have to pay like 77k each year:) i never even knew that was possible ngl. But then again i don't know much about $$ \nSo no more ED for me:) cuz my parents have no money for my college and I don't think I could live with myself with loans.",
  "author": "Sufficient-Peace4040",
  "created": 1634011237,
  "updated": 1634072761,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 1.0,
  "comments": {
    "hgbl82c": {
      "link": "/r/ApplyingToCollege/comments/q6dlso/no_money/hgbl82c/",
      "text": "I’m going to applaud you for doing the responsible thing and running the net price calculator ahead of time. 👏👏👏\n\nBut did you do it with your parents help\nAnd all the right numbers?",
      "author": "admissionsmom",
      "created": 1634015941,
      "upvotes": 23,
      "replies": {
        "hgbm6et": {
          "link": "/r/ApplyingToCollege/comments/q6dlso/no_money/hgbm6et/",
          "text": "Yes my dad did it, and I believe it was correct",
          "author": "Sufficient-Peace4040",
          "created": 1634016602,
          "upvotes": 7,
          "replies": {
            "hgbmbnr": {
              "link": "/r/ApplyingToCollege/comments/q6dlso/no_money/hgbmbnr/",
              "text": "Ok. Then good on you for moving on!\n\nThere are tons of other amazing schools that would love to snatch you up and give you merit money",
              "author": "admissionsmom",
              "created": 1634016702,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "hgbjsxs": {
      "link": "/r/ApplyingToCollege/comments/q6dlso/no_money/hgbjsxs/",
      "text": "me with northeastern:",
      "author": "throwawaycap222",
      "created": 1634014982,
      "upvotes": 2,
      "replies": {}
    },
    "hgbp0dw": {
      "link": "/r/ApplyingToCollege/comments/q6dlso/no_money/hgbp0dw/",
      "text": "This somewhat happened to me in high school as well, so I went with the no name school that gave me the most money to avoid the cost. Eventually I ended up where I wanted to be in grad school paying half the price in half the time as undergrad :).",
      "author": "glutton2000",
      "created": 1634018679,
      "upvotes": 2,
      "replies": {}
    },
    "hgboxjo": {
      "link": "/r/ApplyingToCollege/comments/q6dlso/no_money/hgboxjo/",
      "text": "Keep in mind that your reasons for not applying ED at Cornell does not apply to regular admission. In most case, ED is binding so you would have to attend if admitted (not legally required but you would essentially be blacklisted if you don't). This also means you wouldn't be able to negotiate your financial aid.\n\nHowever, with regular admissions, you can go to any school you were admitted and compared financial aid between those schools (could negotiate for higher aid if other schools offered you more). So while I think you made a great decision of not applying for ED at Cornell, you can still apply there for regular admission if you really want to go. Plus, private schools generally give more aid and ironically can be more affordable than state schools.\n\n**TL;DR:** Basically the main difference is you can wait and see what other fin aid offers you get during reg admission but not w/ ED. Hope that helps. Good luck.",
      "author": "Disastrous_Fig_3762",
      "created": 1634018622,
      "upvotes": -1,
      "replies": {
        "hgc9jqw": {
          "link": "/r/ApplyingToCollege/comments/q6dlso/no_money/hgc9jqw/",
          "text": ">you can still apply there for regular admission if you really want to go. Plus, private schools generally give more aid and ironically can be more affordable than state schools.\n\nOP ran the NPC which said they’d have to pay $77k/year — which they can’t afford.  Cornell will NOT be offering a financial aid package that is substantially different from what the NPC says.",
          "author": "Strict-Special3607",
          "created": 1634036476,
          "upvotes": 7,
          "replies": {}
        }
      }
    }
  }
}