{
  "sid": "qj7x3n",
  "link": "/r/ApplyingToCollege/comments/qj7x3n/last_minute_guidance/",
  "title:": "Last minute guidance.",
  "text": "So I applied to 6 EA schools already: Loyola, Dayton, UMich, UIC, UIUC, and Purdue. All of these are my safeties except michigan of course.\n\nFor regular decision I have: Duke, Harvard, Notre Dame, Stanford, Northwestern, Case Western and Vandy.\n\nI realized I can do REA since I only applied to Public schools. Should I do Notre Dame REA? I was going to apply here anyways and they only have 2 200 word essays. I still would have two days to submit my app. Should I do it?",
  "author": "Drifx",
  "created": 1635619897,
  "updated": 1635778618,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hiobhsc": {
      "link": "/r/ApplyingToCollege/comments/qj7x3n/last_minute_guidance/hiobhsc/",
      "text": "~~Loyola Chicago & UDayton are both private universities; you won't be able to apply REA to Notre Dame.~~\n\nYou can apply REA to Notre Dame if you're ready. Sorry, I didn't check their website at first!\n\n[https://admissions.nd.edu/apply/early-action-regular-decision/](https://admissions.nd.edu/apply/early-action-regular-decision/)\n\n>A student applying Restrictive Early Action to Notre Dame may apply to other Early Action programs at either private or public colleges or universities.",
      "author": "toyota2003",
      "created": 1635620042,
      "upvotes": 2,
      "replies": {
        "hioc19k": {
          "link": "/r/ApplyingToCollege/comments/qj7x3n/last_minute_guidance/hioc19k/",
          "text": "I think Notre Dame ERA just won't let you apply to other ED schools private or public, but EA is fine as long as its not binding",
          "author": "Drifx",
          "created": 1635620260,
          "upvotes": 3,
          "replies": {
            "hioezzy": {
              "link": "/r/ApplyingToCollege/comments/qj7x3n/last_minute_guidance/hioezzy/",
              "text": "Oops, you're right. I just edited my comment.\n\nI'd apply REA to Notre Dame then, as long as you're all ready (i.e. - don't rush to get it in) & your essays and things are all set.\n\nBest of luck!",
              "author": "toyota2003",
              "created": 1635621516,
              "upvotes": 2,
              "replies": {
                "hiosvvb": {
                  "link": "/r/ApplyingToCollege/comments/qj7x3n/last_minute_guidance/hiosvvb/",
                  "text": "do you think I can write decent essays for Notre dame in just two days though? It'd be my #1 priority,",
                  "author": "Drifx",
                  "created": 1635627668,
                  "upvotes": 2,
                  "replies": {
                    "hiotsca": {
                      "link": "/r/ApplyingToCollege/comments/qj7x3n/last_minute_guidance/hiotsca/",
                      "text": "Some people might disagree with me, but yeah, I think you can. Make sure that you take lots of breaks in between the writing, editing, and revising process. Don't grind them out and then click submit right after.\n\nMaybe plan the outlines out this afternoon, then have dinner.\n\nWrite the essays tonight.\n\nSleep on it.\n\nTomorrow morning, read them out loud and read them over. Make some edits.\n\nHave lunch, watch TV, spend time with family, etc.\n\nTomorrow night, read them over again. Read them out loud! Make sure there's not any grammatical errors.\n\nAfter that, you could sleep on it again.\n\nWake up early on Monday (11/1) before school, and read them over one last time, and then be sure to read through your application preview to make sure there's not any errors there either. Then, you could submit your application. That's the latest I'd do it though; the CommonApp website has been known to crash in the late hours of 11/1 lmao.\n\n\\^\\^\\^\\^\\^ That's a rough outline; sometimes inspiration strikes and you just want to write. I gave you that outline so you understand that taking breaks is important.\n\nBest of luck! :) 🍀🍀🍀",
                      "author": "toyota2003",
                      "created": 1635628080,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hipbw5v": {
      "link": "/r/ApplyingToCollege/comments/qj7x3n/last_minute_guidance/hipbw5v/",
      "text": "Watch the ND/NC game now!",
      "author": "Radiant-Chipmunk-987",
      "created": 1635636643,
      "upvotes": 1,
      "replies": {}
    }
  }
}