{
  "sid": "qc2zg7",
  "link": "/r/ApplyingToCollege/comments/qc2zg7/transfer_student_application_question/",
  "title:": "Transfer student application question",
  "text": "So I am a second year who is considering transferring from my current college to a few other options. My high school gpa wasn’t great, but so far in college my gpa has been relatively high. The college I currently go to also has a good rep and is known for being a good school, it’s just not a great fit for me personally. I was wondering, if I have a gpa that is .1-.2 below the average to my target schools, but this gpa comes from a good college, so is this weighted more in the application compared to someone getting a good gpa out of high school? What I mean by this is if I have a 3.6-3.7 in college, does this look better in an application compared to students coming out of high school with the same gpa, or are the viewed equally?",
  "author": "DylanM2202",
  "created": 1634742442,
  "updated": 1634749535,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhdc54v": {
      "link": "/r/ApplyingToCollege/comments/qc2zg7/transfer_student_application_question/hhdc54v/",
      "text": "Looks better",
      "author": "chumer_ranion",
      "created": 1634742862,
      "upvotes": 1,
      "replies": {
        "hhddcpy": {
          "link": "/r/ApplyingToCollege/comments/qc2zg7/transfer_student_application_question/hhddcpy/",
          "text": "So do you think if I was around .1-.2 lower than average, would the fact that it’s a college GPA significantly help my chances?",
          "author": "DylanM2202",
          "created": 1634743355,
          "upvotes": 1,
          "replies": {
            "hhddluy": {
              "link": "/r/ApplyingToCollege/comments/qc2zg7/transfer_student_application_question/hhddluy/",
              "text": "The average you’re talking about being the average GPA of high school admits?  Yes there’s no need to match that GPA.  Idk anything about chances, but I do know that the expectations are different.",
              "author": "chumer_ranion",
              "created": 1634743457,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}