{
  "sid": "qzsjhv",
  "link": "/r/ApplyingToCollege/comments/qzsjhv/georgia_tech_dual_credit_or_ap/",
  "title:": "Georgia Tech - Dual Credit or AP",
  "text": "My brother is a high school freshman and wants to go to Georgia Tech. He wants to do a dual credit program at a local school that will give him 42 credit hours toward college. He should get good grades, but he won’t get any AP/IB classes or exams. Will this affect his chances of getting in there? I’ve heard that t20 schools want to see a lot of AP/IB. The other option is homeschooling, which is what he is currently doing. With homeschooling, he could take about 10 AP classes self studied. What is the best course of action for Georgia Tech specifically? He will probably get high 1400s to 1500s on his SAT. Thanks in advance!",
  "author": "BenStackinSilverMan",
  "created": 1637606842,
  "updated": 1637687304,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hlo8xv8": {
      "link": "/r/ApplyingToCollege/comments/qzsjhv/georgia_tech_dual_credit_or_ap/hlo8xv8/",
      "text": ">Will this affect his chances of getting in there\n\nNo\n\n>I’ve heard that t20 schools want to see a lot of AP/IB\n\nYou heard wrong. They want to see strong performance in challenging courses.",
      "author": "skieurope12",
      "created": 1637608369,
      "upvotes": 6,
      "replies": {}
    },
    "hlolfz1": {
      "link": "/r/ApplyingToCollege/comments/qzsjhv/georgia_tech_dual_credit_or_ap/hlolfz1/",
      "text": "The main perk of AP is quality control -- since it's tied to a standardized exam, AOs can use it as a common measuring stick for rigor. Dual enrollment classes, meanwhile, are a mixed bag; AOs can't be sure that they're rigorous.",
      "author": "a12435",
      "created": 1637613405,
      "upvotes": 3,
      "replies": {}
    },
    "hlomf15": {
      "link": "/r/ApplyingToCollege/comments/qzsjhv/georgia_tech_dual_credit_or_ap/hlomf15/",
      "text": "If Georgia Tech is the goal, and he’s instate, dual credit is the way to go because the credits will easily transfer. I know that GT also offers dual credit classes which your brother might be interested in and that might boost his chances as well.",
      "author": "bboywestcoast",
      "created": 1637613803,
      "upvotes": 1,
      "replies": {
        "hlopd4g": {
          "link": "/r/ApplyingToCollege/comments/qzsjhv/georgia_tech_dual_credit_or_ap/hlopd4g/",
          "text": "He’s OOS.",
          "author": "BenStackinSilverMan",
          "created": 1637614988,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}