{
  "sid": "r3wt2x",
  "link": "/r/ApplyingToCollege/comments/r3wt2x/i_dont_know_how_much_more_i_can_do_this/",
  "title:": "i don't know how much more i can do this",
  "text": "like, it's so funny how much I developed myself, reached out to people, and researched. It's so funny that I was getting 38/100 in middle school and now I'm worried that I won't get into a T10. Do good grades, amazing ECs, mouth-opening Essays...come naturally to some people? I know I did my best and I am a hard worker but I don't know if I can still be motivated. Having a break for a week, I realized how much I missed sleeping for 8+ hrs and watching Yt videos. I know that if I get into any of the colleges I apply to, I would be fine and I would still get an amazing education. But how great would it be if I get into an institution I had dreams about getting in and buying merch from. I don't know how I would survive with another semester after this break if I don't get in early.",
  "author": "sretss1212",
  "created": 1638077306,
  "updated": 1638204961,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.95,
  "comments": {
    "hmdc5gc": {
      "link": "/r/ApplyingToCollege/comments/r3wt2x/i_dont_know_how_much_more_i_can_do_this/hmdc5gc/",
      "text": "Think about this way, all you have to do is make it to Jan/February (for regular decision deadlines). That's only 1-2 months, out of a lifetime of deadlines, essays, time constraints that has come before this. Clearly you have overcome these obstacles so far.\n\nyou just gotta roll with it\n\nGood Luck!",
      "author": "Time_Astronaut_1153",
      "created": 1638079432,
      "upvotes": 9,
      "replies": {}
    },
    "hmdk2iw": {
      "link": "/r/ApplyingToCollege/comments/r3wt2x/i_dont_know_how_much_more_i_can_do_this/hmdk2iw/",
      "text": "no fr i went from a 1.5 in middle school to a 4.9",
      "author": "localramenconsumer",
      "created": 1638084738,
      "upvotes": 4,
      "replies": {}
    },
    "hme4g48": {
      "link": "/r/ApplyingToCollege/comments/r3wt2x/i_dont_know_how_much_more_i_can_do_this/hme4g48/",
      "text": "The only way I stay sane is the knowledge that this madness ends in a month. I just numb myself with work and Netflix and pray that I get into a decent college lmao.",
      "author": "Possible_Cry_5082",
      "created": 1638100831,
      "upvotes": 1,
      "replies": {}
    }
  }
}