{
  "sid": "qwfx09",
  "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/",
  "title:": "Should I apply as a transfer or freshman?",
  "text": "Long story short, I live in Peru and I'm currently at college here (I only have 40 credit hours in college atm). My GPA in both high school and college are pretty high but the only SAT I have taken is pretty bad. I got 1160 (540 in reading and 620 in math) and I really don't know what to do lmao. Also, I'm trying to apply for financial aid but some dude told me that there was not financial aid for international transfer students. I don't even know if that's or not because I haven't found anything on the topic that literally says that. So, should I apply as a transfer or a freshman? and should I even share my SAT scores with the universities? \n\nbtw, my extracurriculars are not extremely good",
  "author": "Mauriciogs2003",
  "created": 1637204146,
  "updated": 1637353585,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hl2o1iw": {
      "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/hl2o1iw/",
      "text": "I’d apply as a transfer for sure (I’m not sure if you could even apply as a freshman without it considered lying). No reason to waste 40 credits too. \n\nAnd, apply to test optional schools where you do not need to send your sat scores. If your score of 1160 is within the average range for the college you are applying to, then you should include it.",
      "author": "Voldemort57",
      "created": 1637204473,
      "upvotes": 2,
      "replies": {
        "hl2u4no": {
          "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/hl2u4no/",
          "text": "I was going to do that but I'm not totally sure If I my chances of being accepted will be lower if I apply as a transfer without an SAT than if I share my scores. Also, as I mentioned, I want to apply for financial aid, so, will applying as a transfer exonerate me from getting financial aid?",
          "author": "Mauriciogs2003",
          "created": 1637207382,
          "upvotes": 1,
          "replies": {
            "hl2uu1c": {
              "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/hl2uu1c/",
              "text": "I think you will still get financial aid. It will depend on the school, though. (But I think you will). \n\nYou will not be at a disadvantage for not providing an SAT score. If your SAT score is at or above average for your college, it’ll help you, but you will not be rejected *because* you don’t have an sat score. Colleges understand that these past two years have made taking the sat quite challenging.",
              "author": "Voldemort57",
              "created": 1637207734,
              "upvotes": 1,
              "replies": {
                "hl2v5js": {
                  "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/hl2v5js/",
                  "text": "TY!",
                  "author": "Mauriciogs2003",
                  "created": 1637207896,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl35o5c": {
      "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/hl35o5c/",
      "text": "Google \"*college name* international transfer financial aid\", and you'll see that most schools don't offer any. A few schools offer fin aid for intl transfers, but it's super limited (pretty much for people who can pay, let's say, ~70k out of 88k). I think Harvard, Yale, Princeton, and MIT might be need-blind for international transfers, but it's usually once in a decade opportunity. You should contact all of your schools and ask if you still can apply as a freshman (at some you can) because it's *a lot* harder to get in as a transfer",
      "author": "Apprehensive-Math240",
      "created": 1637213638,
      "upvotes": 2,
      "replies": {
        "hl482gh": {
          "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/hl482gh/",
          "text": "There's nothing I can do then... besides lying about being a freshman to get financial aid.",
          "author": "Mauriciogs2003",
          "created": 1637241517,
          "upvotes": 1,
          "replies": {
            "hl4tlzs": {
              "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/hl4tlzs/",
              "text": "Like I said, you should email your schools and ask. Some schools don’t accept transfers from foreign universities, so you’d have to apply as a first-year student there",
              "author": "Apprehensive-Math240",
              "created": 1637251181,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hl2vgyy": {
      "link": "/r/ApplyingToCollege/comments/qwfx09/should_i_apply_as_a_transfer_or_freshman/hl2vgyy/",
      "text": "You are a transfer student since you earned college credits after graduating from high school. For most American universities, you should probably not submit your SAT scores.",
      "author": "jjhoster",
      "created": 1637208058,
      "upvotes": 1,
      "replies": {}
    }
  }
}