{
  "sid": "q8wtam",
  "link": "/r/ApplyingToCollege/comments/q8wtam/i_dont_want_this_to_ruin_my_relationship_with_my/",
  "title:": "I don't want THIS to ruin my relationship with my teacher!!!!!!!",
  "text": "So here's my dilemma.. I'm a senior in high school, and therefore, am applying to colleges. I'm taking AP Calc BC, and I have built a really good relationship with my teacher. I went to her numerous times to ask her questions when I was struggling, and she has noticed how much hard work I'm putting into the class. She even told me today after class that she knew I was intimidated by the class at first, but that she sees how hard I'm working and how much I'm really improving. \n\nI really want to ask her to write me a recommendation letter because even though I've only had her for a couple of months, I strongly believe that she could write me a better recommendation than the other two teachers I've asked. Not only that, but she is the ONE teacher I actually went to for extra help and even showed that I was struggling with the class. The problem isn't me being afraid to ask her for a letter of recommendation, it's that my counselors said that the last day we should ask teachers for letters of recommendations is October 1st. \n\nMy earliest deadlines are November 1st, so technically, my teacher would still have a good chunk of time to write my essay. I'm just really scared that she would say no because I asked so late and that it will ruin the good relationship I have with her. \n\nI just don't know what to do. I want to trust my gut and ask her because I'm applying for BS/MD programs too and they require additional recommendations anyways, but again, I don't want to ruin my relationship with her for asking too late. \n\nAny advice???????",
  "author": "Exciting_North5392",
  "created": 1634329856,
  "updated": 1634331326,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgs7n2e": {
      "link": "/r/ApplyingToCollege/comments/q8wtam/i_dont_want_this_to_ruin_my_relationship_with_my/hgs7n2e/",
      "text": "i think trying to ask her politely won’t harm you at all! you can mention it in your email/request to her that you’re aware you’re past the deadline by which you should’ve asked her and that you’re apologetic. also, maybe add that if she can still consider writing a recommendation for you without it posing as an inconvenience to her, you would be very grateful! \n\ni do not think she will dislike you for this!",
      "author": "catgirljesse",
      "created": 1634330203,
      "upvotes": 1,
      "replies": {}
    },
    "hgs7nst": {
      "link": "/r/ApplyingToCollege/comments/q8wtam/i_dont_want_this_to_ruin_my_relationship_with_my/hgs7nst/",
      "text": "Ask her and tell that you totally understand if she can’t write it.",
      "author": "IglooWater",
      "created": 1634330212,
      "upvotes": 1,
      "replies": {}
    },
    "hgs7ymh": {
      "link": "/r/ApplyingToCollege/comments/q8wtam/i_dont_want_this_to_ruin_my_relationship_with_my/hgs7ymh/",
      "text": "You should def ask and state exactly what you said. Be true. But do it by mail, as you will let her think about it",
      "author": "Pristine-Coach6163",
      "created": 1634330345,
      "upvotes": 1,
      "replies": {}
    }
  }
}