{
  "sid": "qneelw",
  "link": "/r/ApplyingToCollege/comments/qneelw/newbie_questionparadox_why_wont_many_universities/",
  "title:": "Newbie Question(Paradox): Why won't many universities closed down fraternities and sororities if they seem to promote the exact values(elitism, classism, racism, toxic masculinity, hazing, body shaming) that Administrators and Professors are preaching and fighting against?",
  "text": "Hey guys,\n\n**I am not trying to be controversial.** However, to me, it seems to be a bit of a paradox that, on the one hand, administrators, professors, and student leaders seem to be all about inclusion and fighting against what seems like the \"ills of American society.\" Its expected that on the first week, the college president will give a speech on how the university is actively fighting for inclusive values\n\nYet, on the other hand, this whole underground culture exists and is ever-present on college campuses. I want to add that not every university works under these systems. It seems some colleges caught up with this contradiction and quickly shut it down. However, the \"frat culture\" remains in other universities, and it looks complicated to remove due to strong resistance. Maybe, it has to do with endowments from wealthy and privileged graduates.\n\nYes, I know some of these organizations aren't like how they are stereotyped. However, you can't say that many of them do partake in this culture. Moreover, some of the colleges that have banned these organizations have effectively ended these types of culture and managed to create a somewhat more porous college cultural society.",
  "author": "thecribs100",
  "created": 1636128479,
  "updated": 1636154884,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hjfowhz": {
      "link": "/r/ApplyingToCollege/comments/qneelw/newbie_questionparadox_why_wont_many_universities/hjfowhz/",
      "text": "Some reasons:\n\n1. Not all fraternities and sororities are like that,\n2. All they can do is revoke these groups' status as official student organizations; they can't really prevent students from freely associating however they choose.  They could expel students who are found to have joined a group unaffiliated with the school, but that sort of overreach would generate a ton of bad press and, if it's a public school, probably a (1A) lawsuit.\n3. Shutting out all frats and sororities across the board would piss off many influential and/or wealthy alumni.  As much as administrators might like to revoke these groups' status as official student organizations, they want to remain financially viable more than they want to shut down the Greek system.",
      "author": "jayphoward",
      "created": 1636131008,
      "upvotes": 3,
      "replies": {}
    },
    "hjfntq7": {
      "link": "/r/ApplyingToCollege/comments/qneelw/newbie_questionparadox_why_wont_many_universities/hjfntq7/",
      "text": "I can't speak to all Universities, but at least for the one I attend, frat/sororities aren't affiliated with them at all. This was especially an issue during COVID when one of the frats literally held a party that led to like 200 positive cases (in a school of a few thousand) which screwed us lmao.\n\nBut yeah, essentially the school just doesn't want to be held liable, and all frats are typically off-campus so unless they send cops to bust an underage party there's really nothing they can do.\n\nThere was a disaster with racism in the sororities which amounted to nothing. A lot of people talk a lot but then don't do anything. Like, we have a Facebook page where you can bitch about shit/complain about meta-school topics and there are always SJW's who riot about frats, but then I see them at every party lmao.",
      "author": "CLOWN_ALERTO",
      "created": 1636130601,
      "upvotes": 1,
      "replies": {}
    },
    "hjgd3mz": {
      "link": "/r/ApplyingToCollege/comments/qneelw/newbie_questionparadox_why_wont_many_universities/hjgd3mz/",
      "text": "If you simply make an assumption, then the conclusion will be true.\n\nWhether it’s true or not.\n\nAnd making statement like “you can’t say” means you have no interest in a meaningful discussion. (Even if you phrased it opposite of what you actually mean).",
      "author": "RichInPitt",
      "created": 1636140265,
      "upvotes": 0,
      "replies": {}
    }
  }
}