{
  "sid": "q7hqdx",
  "link": "/r/ApplyingToCollege/comments/q7hqdx/having_a_dilemma_i_know_im_going_to_disappoint_my/",
  "title:": "Having a dilemma: I know I’m going to disappoint my parents and I want to do some damage control in the meantime.",
  "text": "My parents and grandparents are convinced I will get into MIT. I have a 36 ACT, which is why they think that, but my gpa isn’t perfect, i suck at creative writing, and no non-family responsibility ECs. \n\nPlus, I don’t really *want* to. I wanna be a civil engineer, such id much rather go to a cheap school for 2/3 years rather than an amazing one for 4/5 for significantly more. Maybe a good graduate school could be cool, but I don’t see the value in going into debt for a non-prestigious field.\n\nI keep telling them I want to go to our 2nd best state school, and they keep trying to convince me to not even apply. They want the to only apply to 4 schools (MIT, state flagship, 2 of my choice)\n\nAnd I’m surprised they’re surprised I’m factoring in cost considering that they always complain that my $30 purchase of gas is the reason we can’t afford proper meals. \n\nIve directly said, repeatedly, “I’d rather go somewhere cheap than somewhere expensive and prestigious”, yet they refuse to entertain the idea. They say they’re paying and I’m being stupid, therefore they should get to choose where I apply, but the whole point is to **not** need their charity. ($40,000 in savings from my grandparents to pay for college).\n\nThis is mostly a rant, but how do I work them towards not hating me when decisions come out and I inevitably commit to the cheapest offer?",
  "author": "randomunnnamedperson",
  "created": 1634150623,
  "updated": 1634167052,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hgimlxo": {
      "link": "/r/ApplyingToCollege/comments/q7hqdx/having_a_dilemma_i_know_im_going_to_disappoint_my/hgimlxo/",
      "text": "Not sure of your family financial situation, but have you run the NPC? You may be surprised at what need-based schools will give. In other words, they sometimes beat the schools with large merit awards.",
      "author": "Thirdtimesacharm4me",
      "created": 1634151182,
      "upvotes": 3,
      "replies": {
        "hgiofyk": {
          "link": "/r/ApplyingToCollege/comments/q7hqdx/having_a_dilemma_i_know_im_going_to_disappoint_my/hgiofyk/",
          "text": "Based on FAFSA, our EFC is 35,000, but we have a lot of debt, the area has a high COL and I’m not an only child, so while we don’t qualify for much merit aid, we can’t really afford much. Plus, my parents are adamant on not letting me go into debt to the country, and I don’t really want to be in their debt/feel guilty since I know they can’t afford much.\n\nI do plan to work through college, but housing is expensive too. \n\nI do hope to apply to some good schools and see if they offer more aid than expected, though my application budget is relatively low and figuring out which schools that is likely to be has been difficult to say the least.",
          "author": "randomunnnamedperson",
          "created": 1634151923,
          "upvotes": 2,
          "replies": {
            "hgipsur": {
              "link": "/r/ApplyingToCollege/comments/q7hqdx/having_a_dilemma_i_know_im_going_to_disappoint_my/hgipsur/",
              "text": "It’s very complicated (the whole process). Wishing you all the best.",
              "author": "Thirdtimesacharm4me",
              "created": 1634152474,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgiv28f": {
      "link": "/r/ApplyingToCollege/comments/q7hqdx/having_a_dilemma_i_know_im_going_to_disappoint_my/hgiv28f/",
      "text": "Go to the states college unles they’re giving you a lot of need based aid",
      "author": "StocksTocker101",
      "created": 1634154594,
      "upvotes": 1,
      "replies": {
        "hgj3th2": {
          "link": "/r/ApplyingToCollege/comments/q7hqdx/having_a_dilemma_i_know_im_going_to_disappoint_my/hgj3th2/",
          "text": "That’s what I said I’m planning to do. How do I make it easier on my parents?",
          "author": "randomunnnamedperson",
          "created": 1634158174,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}