{
  "sid": "qwhjxh",
  "link": "/r/ApplyingToCollege/comments/qwhjxh/will_gap_years_and_homeschooling_affect_my/",
  "title:": "Will gap years and homeschooling affect my ability to get into a good school?",
  "text": "\nI am thinking of taking a gap year before going onto higher education. I am wondering if that would negatively impact my chances of getting into a good college/university. I would still be working so there won’t be a complete gap. I have been homeschooled so I just want to be able to gain a little more confidence in an environment with lots of people. My guardians have always been supportive of me getting into higher education, if a little bit nervous. They live in the middle of nowhere and someone could always look after me so it made sense. This might also be bad for some schools. I’m not sure. I have decent grades (all a’s except for a high b in mathematics).",
  "author": "HavenLivlage",
  "created": 1637209379,
  "updated": 1637353574,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hl2yy8k": {
      "link": "/r/ApplyingToCollege/comments/qwhjxh/will_gap_years_and_homeschooling_affect_my/hl2yy8k/",
      "text": "As long as you’re productive during your gap year, it won’t be a detriment. If used particularly effectively, a gap year could even make your app much stronger. Colleges do ask what you did during your gap year, so you just want to be able to answer that question effectively.",
      "author": "rainingsiberiancats",
      "created": 1637209865,
      "upvotes": 6,
      "replies": {
        "hl2z9wx": {
          "link": "/r/ApplyingToCollege/comments/qwhjxh/will_gap_years_and_homeschooling_affect_my/hl2z9wx/",
          "text": "If I do end up taking a gap year I will definitely try to keep a list of all the productive things I did during that time. Thank you!",
          "author": "HavenLivlage",
          "created": 1637210037,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}