{
  "sid": "qmbwcr",
  "link": "/r/ApplyingToCollege/comments/qmbwcr/boston_university_vs_boston_college/",
  "title:": "Boston University vs. Boston College?",
  "text": "Hi! I am considering applying to one of these schools as a psych major, possibly interested in premed but more likely just doing human brain research later. I was wondering which school would be better for this specific field, and also how do the vibes there differ (competitiveness, the people there, pros/cons, campus life)? \n\nDon't know if this is the right subreddit to ask, but any help would be greatly appreciated!",
  "author": "k_240",
  "created": 1635996879,
  "updated": 1636136239,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hj8o7nk": {
      "link": "/r/ApplyingToCollege/comments/qmbwcr/boston_university_vs_boston_college/hj8o7nk/",
      "text": "BU",
      "author": "yummymangoyum",
      "created": 1635996912,
      "upvotes": 5,
      "replies": {}
    },
    "hj8w6xv": {
      "link": "/r/ApplyingToCollege/comments/qmbwcr/boston_university_vs_boston_college/hj8w6xv/",
      "text": "In general, these are so different that you are likely to have a preference between them (BU large - around 17k undergrads, private, campus is urban streets, vs BC mid-size - around 10k undergrads, Jesuit/Catholic with traditional campus on the edge of city and D1 sports, more school spirit).\n\nLots of premeds at both. If you might be thinking premed, look into what grading is like at each.\n\nPsych is a popular major in general. BC offers psych in A&S as well as applied psych in the Lynch school.\n\nIf you need financial aid, run the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply.",
      "author": "elkrange",
      "created": 1636001650,
      "upvotes": 5,
      "replies": {}
    },
    "hj9v836": {
      "link": "/r/ApplyingToCollege/comments/qmbwcr/boston_university_vs_boston_college/hj9v836/",
      "text": "Neither would hold you back w.r.t. your career goals.  Pick the one you subjectively like better or that is less expensive.  Also read elkrange's post below; they're pretty different.",
      "author": "jayphoward",
      "created": 1636028898,
      "upvotes": 3,
      "replies": {}
    },
    "hj8s6sm": {
      "link": "/r/ApplyingToCollege/comments/qmbwcr/boston_university_vs_boston_college/hj8s6sm/",
      "text": "BU is def better than bc in premed especially with their early assurance program",
      "author": "LegendaryRevolver",
      "created": 1635999159,
      "upvotes": 2,
      "replies": {}
    }
  }
}