{
  "sid": "q763q8",
  "link": "/r/ApplyingToCollege/comments/q763q8/how_to_select_minor_field_of_study/",
  "title:": "How to Select Minor Field of Study?",
  "text": "Hey, so I'm a bit into the application process (kinda behind, but I'm catching up). I'm planning on majoring in biology for the pre-med track, but I also want to minor in Business just so I can have an another area of expertise in case my plans shift in the future.\n\nWhen applying to a college, it usually allows us to put our specified major, but there's no option for choosing our specified minor, so I was wondering how exactly do we select the Minor Field of Study? Does one select it after they are offered admission to a school, and should we potentially talk about in any of our essays when listing out or passions/why we want to go to a specific school if we can't select a Minor in the application?\n\n&#x200B;\n\nSorry if my wording sounds a little confusing lol. Thank you for any help in advance : )",
  "author": "EpicGamesLauncher",
  "created": 1634110635,
  "updated": 1634167099,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hggjgdb": {
      "link": "/r/ApplyingToCollege/comments/q763q8/how_to_select_minor_field_of_study/hggjgdb/",
      "text": "You don't always declare your minor at the admissions stage... You usually do that after joining the college and taking a certain number of courses in that field.",
      "author": "prsehgal",
      "created": 1634111738,
      "upvotes": 2,
      "replies": {}
    },
    "hggk545": {
      "link": "/r/ApplyingToCollege/comments/q763q8/how_to_select_minor_field_of_study/hggk545/",
      "text": "Like other comment said, minor is declared once you get admitted (you can do this anytime until the fall of senior year of college, but this may different based on college. Usually minors are not competitive and anyone can declare them.\n\nAlso, FYI, minor is usually to pursue personal interest/hobby, not for an alternative career path. While minors do help, its effect is very little. Usually if you want multiple option, I recommend double majoring because finding a job with a minor is very difficult. Of course, you don't have to worry about this for now.",
      "author": "idkname999",
      "created": 1634112372,
      "upvotes": 2,
      "replies": {}
    },
    "hggtrl3": {
      "link": "/r/ApplyingToCollege/comments/q763q8/how_to_select_minor_field_of_study/hggtrl3/",
      "text": "You can declare a minor as late as junior year of college at many schools. You can write about anything you'd like in a short answer question; it doesn't matter that you haven't selected a designated minor from a drop-down menu.",
      "author": "AO585858",
      "created": 1634120979,
      "upvotes": 1,
      "replies": {}
    }
  }
}