{
  "sid": "qtgiu5",
  "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/",
  "title:": "FAFSA and CSS Processing",
  "text": "I just submitted my CSS, IDOC, and FAFSA (November 13th) and the priority deadline for the Stanford REA Financial Aid Application is November 15th. I was unaware that it takes 3-5 days to process the information on the documents. I know the college can see that I submitted before the deadline, so will they count me has having applied before the priority filing date even if they receive it when it is processed after the 15th? \n\nI don't really care if I get my reward notification later than I would have if it were considered on time; I'm more concerned about whether the amount of money parents would hypothetically have to pay would increase. \n\nSince I'm applying REA, I'm assuming the amount wouldn't increase because they still would have received it way before the other Regular Decision applicants have likely submitted theirs, and it's not like REA decreases parent contribution. Is this an okay assumption to make?\n\n(Also, this is all in the context of whether I actually get accepted or not, which I probably won't, but if I somehow manage to!)",
  "author": "nnekai",
  "created": 1636858786,
  "updated": 1637180644,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkjfpvi": {
      "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hkjfpvi/",
      "text": "Nope, you’re fine. You met your deadline and the school will see that. Good luck!\n\nEdit: Your financial aid award would not be different if you were RD. Stanford will meet the demonstrated need of all of its accepted students.",
      "author": "Thirdtimesacharm4me",
      "created": 1636859264,
      "upvotes": 3,
      "replies": {
        "hkjga17": {
          "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hkjga17/",
          "text": "Oh, yes I know! I was just saying that even if it was processed late, since it’s still before the Regular Decision Priority Filling it wouldn’t increase vs. if it was processed after both the Early and Regular Priority Date. Thank you for your quick response!!!",
          "author": "nnekai",
          "created": 1636859537,
          "upvotes": 2,
          "replies": {
            "hkjhhoi": {
              "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hkjhhoi/",
              "text": "Yes, you are correct. The amount your family would need to pay will not increase. You are well within the timeframe and you are even in time for REA (financial aid wise) on your end.",
              "author": "Thirdtimesacharm4me",
              "created": 1636860135,
              "upvotes": 2,
              "replies": {
                "hkkchei": {
                  "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hkkchei/",
                  "text": "Alr, TY so much for helping !!",
                  "author": "nnekai",
                  "created": 1636877879,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hkjmk5s": {
          "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hkjmk5s/",
          "text": "i have a question, i dont have a 1099 and it asks for it under students i requested to do a bank statement instead. do u think it will happen before nov 15th which is my ED deadline? i submitted everything else today",
          "author": "radicalpisces",
          "created": 1636862574,
          "upvotes": 1,
          "replies": {
            "hkjo4f1": {
              "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hkjo4f1/",
              "text": "A 1099 is issued only if you were employed by someone and made over $600. If that doesn’t apply to you, then you don’t have to submit anything in that section. A bank statement isn’t going to tell them that info though, so hopefully the 1099 doesn’t apply to you?\n\nIf you did work for someone and made over $600, your employer should be able to give you a copy of the 1099.\n\nEdit: these are usually issued for people who did contract work (i.e. you didn’t have taxes withdrawn from your paycheck(s) ).\n\nEdit 2: A 1099 can also be issued if you had interest and dividend amounts in excess of $10 for a bank account, government payments, and other miscellaneous reasons. But the bottom line: they are about taxes that are due that weren’t already withheld. Does any of that sound like it might apply to you or your parents? If so, then the bank or employer will have sent this to you (and they can usually be pulled up online if it’s from a bank). \n\nFeel free to DM me if you have more questions that you don’t want to share publicly.",
              "author": "Thirdtimesacharm4me",
              "created": 1636863324,
              "upvotes": 2,
              "replies": {
                "hkjo89h": {
                  "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hkjo89h/",
                  "text": "i did a w2 and 1040",
                  "author": "radicalpisces",
                  "created": 1636863376,
                  "upvotes": 2,
                  "replies": {
                    "hks2b4v": {
                      "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hks2b4v/",
                      "text": "If you had a W2 and a 1040, I don’t see why they need a 1099 from you unless you have interest/dividends or some other income that affects taxes.",
                      "author": "Thirdtimesacharm4me",
                      "created": 1637016178,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hks2p69": {
                      "link": "/r/ApplyingToCollege/comments/qtgiu5/fafsa_and_css_processing/hks2p69/",
                      "text": "Just make sure all of the documents you have are in and uploaded to IDOC. The school(s) will then let CSS know if they want further documents and you upload them then. The important thing is meeting the initial deadline. That’s the best you can do. Most schools give leeway with time *after* that for CSS/IDOC to compile and process the straggler documents.",
                      "author": "Thirdtimesacharm4me",
                      "created": 1637016341,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}