{
  "sid": "r2z55h",
  "link": "/r/ApplyingToCollege/comments/r2z55h/should_i_respond_to_dukes_optional_lgbt_question/",
  "title:": "Should I respond to Duke's optional LGBT question if I couldn't have my response reviewed?",
  "text": "I think I could write a good response to this question that would add to my application, but I'm not out to any of the adults in my life and I wouldn't really feel comfortable asking any of my friends to review the essay.\n\nI'm not sure if it's worth spending the time to write- I think I could write a good/honest essay that fills out my application a bit, but I don't have any massive contributions based around this part of my identity and I've been fortunate enough to not face any type of significant discrimination. Rather, it's been more of a personal discovery/questioning/acceptance journey over the past year.\n\nIs it worth writing if I won't be able to have it reviewed? I wonder if it might help my application as a queer woman in engineering?\n\nProbably also worth specifying that I'm lesbian (not straight/cis writing this prompt about my thoughts on LGBT experience).",
  "author": "rjlindo22",
  "created": 1637967808,
  "updated": 1638205668,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hm7vhkt": {
      "link": "/r/ApplyingToCollege/comments/r2z55h/should_i_respond_to_dukes_optional_lgbt_question/hm7vhkt/",
      "text": "Yep its worth writing",
      "author": "ballingout2215",
      "created": 1637974129,
      "upvotes": 5,
      "replies": {}
    },
    "hm7vpj3": {
      "link": "/r/ApplyingToCollege/comments/r2z55h/should_i_respond_to_dukes_optional_lgbt_question/hm7vpj3/",
      "text": "I would.  Even if your essay is a little more rough around the edges it could add value to your application.  Just be extra careful writing it.",
      "author": "MrBulldog25",
      "created": 1637974241,
      "upvotes": 1,
      "replies": {}
    },
    "hm90anv": {
      "link": "/r/ApplyingToCollege/comments/r2z55h/should_i_respond_to_dukes_optional_lgbt_question/hm90anv/",
      "text": "ahah i had the same thought lol but eventually decided against it",
      "author": "fierrochasee",
      "created": 1637997068,
      "upvotes": 1,
      "replies": {}
    }
  }
}