{
  "sid": "q3rtob",
  "link": "/r/ApplyingToCollege/comments/q3rtob/wrote_my_commonapp_essay_about_community_service/",
  "title:": "Wrote my CommonApp Essay about Community Service. How f*cked am I?",
  "text": "So I decided to write my CommonApp Essay about community service.\n\n I feel like I've done a lot of solid work helping out underprivileged kids living around my area. I've worked at an underprivileged school where I used my computer skills to redesign their website and create online campaigns which directly resulted in them gaining close to a million dollars in funding. I've also personally helped out the children with their homework several weekends throughout the pandemic. I felt like simply listing these stuff on my ECs would be selling it short. I also feel like it significantly shaped my perspective on life. \n\nHowever yesterday I was reading some articles online and every single one of them said to AVOID WRITING ABOUT SOCIAL SERVICE IN YOUR COLLEGE ESSAYS AT ALL COSTS. And tbh it kind of makes sense because stuff like this becomes clichè more often than not.\n\nNow we're just 2 weeks away from college deadlines and there isn't enough time to rewrite the essay. I'm feeling so shitty right now like no prestigious college would ever accept me. My life is officially ruined.\n\nHELP ME!!!",
  "author": "mango1234570",
  "created": 1633673491,
  "updated": 1634078358,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hftxfws": {
      "link": "/r/ApplyingToCollege/comments/q3rtob/wrote_my_commonapp_essay_about_community_service/hftxfws/",
      "text": "2 weeks may not be enough time to scrap your essay, but it’s definitely enough to revise it. When you see blanket statement advice about topics not to write about, that just means that most people write those essays poorly and they end up being cliché! That DOESN’T mean YOU have to write that essay topic poorly or in a way that feels cliché. For a topic like this:\n1. Make sure you humanize the people you’re talking about. They’re people too, not props in your college essay. Unfortunately, because AO’s will have seen students writing essays like this use “underprivileged” schools and kids as props in their essays, you have to show that you understand that and don’t see yourself as some type of savior.\n2. Get specific about how this experience shaped your perspective. How has helping out affected the way you’ll engage with communities you are a part of moving forward, your plans for college, etc? Try to get as concrete as possible with this.\nI offer feedback on essays for like $3-$5 depending on word count so feel free to PM me if that’s something you’d be interested in! Good luck with this and don’t feel too discouraged – everyone doubts their essays in the last couple weeks before deadlines. It’ll all work out!",
      "author": "eloquinnce",
      "created": 1633680315,
      "upvotes": 4,
      "replies": {}
    },
    "hfu3p64": {
      "link": "/r/ApplyingToCollege/comments/q3rtob/wrote_my_commonapp_essay_about_community_service/hfu3p64/",
      "text": "All you really need is 3 days to write a fair essay. If you want to rewrite, YOU HAVE THE TIME!!",
      "author": "ssssseabass",
      "created": 1633686053,
      "upvotes": 3,
      "replies": {}
    }
  }
}