{
  "sid": "qpghf3",
  "link": "/r/ApplyingToCollege/comments/qpghf3/changing_course_and_school/",
  "title:": "Changing course and School",
  "text": "What do you think how easy it will be to change the course and school while selected for a program. Say I applied for physics in the college of art and science (mostly natural science comes under the school of art) but since then I want to pursue my degree in engineering (mostly school of engineering). \n\nHow hard it will be in changing my course and school after getting accepted with a certain scholarship? Will that bring change to my scholarship? Do I need to pay some extra amount for changing my major from natural science to engineering?",
  "author": "Comprehensive_Let219",
  "created": 1636386857,
  "updated": 1636653972,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjtfykv": {
      "link": "/r/ApplyingToCollege/comments/qpghf3/changing_course_and_school/hjtfykv/",
      "text": "You probably won’t be charged any money but at some colleges it can be very difficult if not impossible to transfer into engineering or computer science or business. So make sure you do your research ahead of time about the colleges internal transfer policies",
      "author": "admissionsmom",
      "created": 1636387825,
      "upvotes": 5,
      "replies": {
        "hjti03h": {
          "link": "/r/ApplyingToCollege/comments/qpghf3/changing_course_and_school/hjti03h/",
          "text": "Should I mail the admission counselor regarding this question?",
          "author": "Comprehensive_Let219",
          "created": 1636388654,
          "upvotes": 2,
          "replies": {
            "hjtifri": {
              "link": "/r/ApplyingToCollege/comments/qpghf3/changing_course_and_school/hjtifri/",
              "text": "You can usually find that info on their websites,  but yes you can ask them too — especially if the info isn’t easily available on their website",
              "author": "admissionsmom",
              "created": 1636388829,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hjupnxo": {
      "link": "/r/ApplyingToCollege/comments/qpghf3/changing_course_and_school/hjupnxo/",
      "text": "Depends on the school. High demand majors at some schools can be difficult to transfer.\n\nExample - UW basically says that it you’re not accepted into CS, you won’t be studying CS.\n\nEngineering and CS are typical high-demand majors.\n\nOthers are easier.\n\n(I assume by “scholarship” you mean an area of study. If you have a specific financial scholarship award with specific requirements, you’d need to check the specifics).",
      "author": "RichInPitt",
      "created": 1636406146,
      "upvotes": 1,
      "replies": {}
    },
    "hjwgzrm": {
      "link": "/r/ApplyingToCollege/comments/qpghf3/changing_course_and_school/hjwgzrm/",
      "text": "You should email the college now and tell them that you want to apply to the College of Engineering, not the College of Natural Sciences.",
      "author": "jjhoster",
      "created": 1636434605,
      "upvotes": 1,
      "replies": {}
    }
  }
}