{
  "sid": "r49lgb",
  "link": "/r/ApplyingToCollege/comments/r49lgb/tbh_i_wish_i_didnt_get_a_college_interview/",
  "title:": "tbh I wish I didn't get a college interview",
  "text": "I know that college interviews don't really mean anything and are just based on availability, but getting one from my dream college is giving me too much hope :( especially when I don't think my stats and ecs are good enough. Man, now I'm just nervous as heck for nothing since the ik interview isn't gonna help my application much anyways",
  "author": "thegoodestgrammar",
  "created": 1638120868,
  "updated": 1638204569,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hmflgq2": {
      "link": "/r/ApplyingToCollege/comments/r49lgb/tbh_i_wish_i_didnt_get_a_college_interview/hmflgq2/",
      "text": "you will be fine!! just approach it like a conversation and be ready to talk about why you love the school and what you want to study! i literally got one day notice for my REA school and it made me so nervous but it ended up going pretty well! remember that the interview won’t hurt you if it goes bad, but it can help you SOOOOO much if it goes well.",
      "author": "badenet759",
      "created": 1638126289,
      "upvotes": 3,
      "replies": {}
    },
    "hmfab1a": {
      "link": "/r/ApplyingToCollege/comments/r49lgb/tbh_i_wish_i_didnt_get_a_college_interview/hmfab1a/",
      "text": "OMG I SO FEEL IT. \n\nI really think my ED application for Penn is trash and I had been so mentally prepared for the rejection until they sent me an interview invitation. I mean, I think it went pretty nice yet it reinforced my anxiety and the whole 'what if' thing so bad. I HATE IT ((((",
      "author": "driven_as_heck",
      "created": 1638121878,
      "upvotes": 4,
      "replies": {
        "hmfd0vg": {
          "link": "/r/ApplyingToCollege/comments/r49lgb/tbh_i_wish_i_didnt_get_a_college_interview/hmfd0vg/",
          "text": "yeah this is basically me rn, and they just sent the email today saying that they're free TOMORROW, like idk how these interviews really work but omg that's such short notice dakjfaldsjfdlks",
          "author": "thegoodestgrammar",
          "created": 1638122984,
          "upvotes": 1,
          "replies": {
            "hmfdbrf": {
              "link": "/r/ApplyingToCollege/comments/r49lgb/tbh_i_wish_i_didnt_get_a_college_interview/hmfdbrf/",
              "text": "no it’s all gonna be fine i promise. just make some list of thinks you like about the college (preferably with some specificity) and then what you want the college to know about you. usually alumni interviews are very informal and kinda relaxed so don’t be worried much!! best of luck",
              "author": "driven_as_heck",
              "created": 1638123107,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}