{
  "sid": "r4er3a",
  "link": "/r/ApplyingToCollege/comments/r4er3a/how_do_i_get_more_informed/",
  "title:": "How do I get more informed?",
  "text": "I’m 17 years old.\n\nI don’t live in North America or any big country on that continent or other continents, and I have no clue how to apply for college, where to apply, when to apply, when to start looking for universities (I only have one/two in mind), how to apply for overseas bursaries/scholarships, etc., NOTHING. And since I don’t live in a super super established country I can’t just watch some youtube videos because my school system is very different and not many people from my country actually make useful videos like that on YouTube. \n\nWhere do I go? Who do I ask for help? Where do I start? If you have any guidance or tips, please share. Thank you in advance.\n\nOh I also think it’s useful to add that I notice that on TV, Americans have like a whole period dedicated to college counselling and you guys have college counsellors; where I live there’s none of that.",
  "author": "akademiese",
  "created": 1638134572,
  "updated": 1638204487,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hmg9glx": {
      "link": "/r/ApplyingToCollege/comments/r4er3a/how_do_i_get_more_informed/hmg9glx/",
      "text": "If you are a senior (graduating high school in 2022) you will want to apply this year probably with everything done by Jan 1st. Since I am American I really don’t know what resources are available to you. I would recommend creating a CommonApp account as a first step to see what you need for the two you have in mind. As for scholarships I would recommend emailing the US or other embassies for where you are interested in attending school at. Depending on the size of your country there might be programs they have that can help you. Also try emailing the international admissions office of the schools you are interested in.\n\nIn the US we like to put colleges into three categories: reach, match, and safety. Reach schools have either >10% admit or you are below the 50th percentile. Match you are in the 50th percentile, safety bellow. I don’t know if safety applies to international students tho.\n\nYeah, so most schools don’t have college counselors. There is not a dedicated period for college applications, though at some more heavily funded schools senior English class has a lot of stuff for college essays.\n\nSome US resources used to find schools:\n\nhttps://collegescorecard.ed.gov use the field of study to compare outcomes. Other search can be helpful but it also only have data for US student outcomes so your results may vary.\n\nhttps://collegesearch.collegeboard.org/home",
      "author": "TritonTheCat",
      "created": 1638135882,
      "upvotes": 3,
      "replies": {
        "hmgdgp1": {
          "link": "/r/ApplyingToCollege/comments/r4er3a/how_do_i_get_more_informed/hmgdgp1/",
          "text": "Thank you so much 🙏 this is very helpful, I’ll try my best to fit it to my situation.",
          "author": "akademiese",
          "created": 1638137495,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmgafvv": {
      "link": "/r/ApplyingToCollege/comments/r4er3a/how_do_i_get_more_informed/hmgafvv/",
      "text": "Check out r/intltousa as well as your local EducationUSA. I started out my whole journey by going to EducationUSA events and learning all about the overview of this process.",
      "author": "dominaxe",
      "created": 1638136271,
      "upvotes": 4,
      "replies": {
        "hmgdjow": {
          "link": "/r/ApplyingToCollege/comments/r4er3a/how_do_i_get_more_informed/hmgdjow/",
          "text": "Thank you 🙏",
          "author": "akademiese",
          "created": 1638137531,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmgtwvl": {
      "link": "/r/ApplyingToCollege/comments/r4er3a/how_do_i_get_more_informed/hmgtwvl/",
      "text": "What countries are you looking at applying to colleges in? (I know a decent amount about US, Canada, and UK.)\n\nWhat does your college profile look like? (Grades, test scores, extracurricular activities, etc)\n\nWhat is your budget? What is your family’s approximate income (important for applying for US scholarships)?\n\nWhat do you want in a college? Big or small? Lots of parties or a more studious vibe? Etc.",
      "author": "Stq1616",
      "created": 1638144480,
      "upvotes": 1,
      "replies": {}
    },
    "hmgvjnn": {
      "link": "/r/ApplyingToCollege/comments/r4er3a/how_do_i_get_more_informed/hmgvjnn/",
      "text": "I live in America so I can’t really help with the international stuff. But everything else I can definitely help you with! Message me if you have any questions!",
      "author": "Katelyn_L11",
      "created": 1638145199,
      "upvotes": 1,
      "replies": {}
    },
    "hmi8jie": {
      "link": "/r/ApplyingToCollege/comments/r4er3a/how_do_i_get_more_informed/hmi8jie/",
      "text": "Usually, the process is pretty same for every international country. Just start your research from google. Start learning about the countries’ you want to apply to educational systems and stuff. The more time you dedicate too, the more advanced you get at that field\n\nEDIT: I am same for all international students from whatever country if you apply to America, not for every country you apply to, ofc",
      "author": "driven_as_heck",
      "created": 1638170344,
      "upvotes": 1,
      "replies": {}
    }
  }
}