{
  "sid": "qn504b",
  "link": "/r/ApplyingToCollege/comments/qn504b/stressing_about_college_apps_bc_poor_gpa/",
  "title:": "Stressing about college apps bc poor gpa",
  "text": "I was dealing with a lot of issues during my time at high school. My lack of foresight as well as my inability to see past my emotional issues led me to coast and under achieve throughout high school. Now that collage applications are coming up my poor gpa (3.21 UW 3.42 W) are severely limiting my application options. I mean I have fairly strong EC's being the president of my schools investment club , VP of my schools muay thai club, involved in programing club, as well as speech and debate. Most of the courses I took were honors. I even took dual enrollment courses at my local community college. I by no means lack any form of talent or ability. The sole reason for my poor gpa is entirely caused by a lack of effort. The fact that if I tried a bit harder, I would have so many more options kills me. I know that I spent the majority of my time at high school just goofing off and taking nothing seriously, but to now face the consequences of it hurts. I know I have no one else to blame other than myself and I regret my choices, but I can't do anything at this point to change it. I currently have no chance of entering any of my dream schools and very little to be accepted by the decent schools near me. Currently my only real options I have right now are to attend my local college or try to transfer from community college. I know that my problems may seem trivial in front of those who did worse or faced more challenges, but I know I could've done better and should've done better. I am an incredibly lucky and talented person that has never really had to struggle with anything in my life. This is the first major failure in my life that is my fault and I am not taking it very well.",
  "author": "404-ERR0R-404",
  "created": 1636093790,
  "updated": 1636135725,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hje0z12": {
      "link": "/r/ApplyingToCollege/comments/qn504b/stressing_about_college_apps_bc_poor_gpa/hje0z12/",
      "text": "I'm literally in the polar opposite position 😑 I have super high grades and an outstanding gpa! But, due to being homeschooled, I have no extra curricular activities or electives to fill out my application.  Not even  a real teacher recommendation... I had to have my mom and fiance put those in for me 😭 best I got was two classes I took at a local community college to try to bulk up my application.",
      "author": "DrLili",
      "created": 1636097702,
      "upvotes": 0,
      "replies": {
        "hje5c3h": {
          "link": "/r/ApplyingToCollege/comments/qn504b/stressing_about_college_apps_bc_poor_gpa/hje5c3h/",
          "text": "You could always ask prof at community college for LOR. Also you are engaged already wow!",
          "author": "Ckqy",
          "created": 1636101668,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjeoibk": {
      "link": "/r/ApplyingToCollege/comments/qn504b/stressing_about_college_apps_bc_poor_gpa/hjeoibk/",
      "text": "That GPA plus a high test score is probably good enough to get you into several AAU member state flagship schools if you're willing to pay out-of-state tuition.",
      "author": "jayphoward",
      "created": 1636115752,
      "upvotes": 1,
      "replies": {}
    }
  }
}