{
  "sid": "qaidks",
  "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/",
  "title:": "Duke lgtbq+ supplement essay",
  "text": "The prompt asks to talk about your gender identity, expression or if you are part of lgtb community or not.\n\nI am not part of lgtb community but I am a female and identity as a girl/woman. Can I wrote about that as it comes under identity? More specifically how my identity has been impacted by my country and community and how I have grown to accept to accept my identity while breaking away from stereotypes and boxes that my country puts girls in? P.s. I come from a conservative, traditional country so I feel like I can talk about my identity in terms of that.",
  "author": "Rocket2011",
  "created": 1634545191,
  "updated": 1634653672,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.17,
  "comments": {
    "hh35igk": {
      "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh35igk/",
      "text": "> I am not part of lgtb community\n\nGuess you've answered your own question, since you can talk about your relationship with feminility on the background prompt",
      "author": "oliversolives",
      "created": 1634546485,
      "upvotes": 17,
      "replies": {}
    },
    "hh367pc": {
      "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh367pc/",
      "text": "No it’s a truly optional essay. You should only do it if you are LQBTQIA+. Everything else should be in the background essay box",
      "author": "Outherepoor",
      "created": 1634547127,
      "upvotes": 13,
      "replies": {
        "hh36eck": {
          "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh36eck/",
          "text": "This^^",
          "author": "Concerned-gay-guy",
          "created": 1634547299,
          "upvotes": 2,
          "replies": {}
        },
        "hh383ad": {
          "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh383ad/",
          "text": "Ok thank you",
          "author": "Rocket2011",
          "created": 1634548875,
          "upvotes": 2,
          "replies": {}
        },
        "hh3zeli": {
          "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh3zeli/",
          "text": "Okay so I was bullied pretty intensely all throughout middle school because I played volleyball. Lots of gay-slurs and the sorts. Now after puberty, I come off as a cis straight white man, and get treated as one. Sometimes I have conflicting feelings on whether I’m bisexual. However, the stuff I went through in middle school leaves me wondering if those feelings are from the doubt my aggressors shoved into my mind, or if them using queerness as a way to insult me has morphed into a subconscious homophobia that prevents me from admitting to myself I am what they made picked on me for. Is this something I talk about in the LGBTQ+ box? Or is that box just a way to let them know what your identity is for demographics and stuff.",
          "author": "seejaiy",
          "created": 1634566443,
          "upvotes": 1,
          "replies": {}
        },
        "hh38mg4": {
          "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh38mg4/",
          "text": "But I would like to ask about why does it say gender identity or expression in the question? Because gender identities include female and male etc. So why can't I write about my gender identity? Especially if I am unable to mention it in the background question as I have mentioned some thing else. Also would of we talk about being an ally to the lgtbq+ community?",
          "author": "Rocket2011",
          "created": 1634549357,
          "upvotes": -3,
          "replies": {
            "hh39cmv": {
              "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh39cmv/",
              "text": "Are you talking about the prompt that says;\n\n> Duke’s commitment to diversity and inclusion include sex orientation, gender identity, and gender expression..\n\nIn which case, you shouldn’t be writing in that box if you aren’t a part of the community. \n\nNot even if you are an ally. An ally simply means you support us. You don’t go through the same traumas we do. That’s why the box is there. For us to talk about it.\n\nMy sister came out as trans and was abused further by my father. Im non-binary and I haven’t dare to come out because of how they treat my sister. \n\nWe are lucky my dad didn’t murder her. \n\nIf you are talking about the prompt that says:\n\n> if you’d like to share perspective you bring or experience you’ve had that would help us understand you better, perhaps a community you belong to or your family or cultural background, we encourage you to do so here.\n\nYou could talk about living in a conservative country as a woman, since that shaped your experience.",
              "author": "Outherepoor",
              "created": 1634550013,
              "upvotes": 8,
              "replies": {
                "hh39pch": {
                  "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh39pch/",
                  "text": "I understand now. Thank you so much for answering my questions and being so open  I am genuinely sorry for what you and your siblings have/are going through. I wish you all the best in life ❤",
                  "author": "Rocket2011",
                  "created": 1634550327,
                  "upvotes": 3,
                  "replies": {
                    "hh39xzu": {
                      "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh39xzu/",
                      "text": "Thank you, and I’m more than happy to help!\n\nI know that in other countries, women can get assassinated for being different or not conforming. \n\nThe experience in common is that we either be ourselves or risk getting harmed by our own family. Nobody should have to go through that. \n\nHopefully your family was supportive of you breaking away from the stereotypes. \n\nI hope you get accepted into Duke!",
                      "author": "Outherepoor",
                      "created": 1634550541,
                      "upvotes": 2,
                      "replies": {
                        "hh3rqei": {
                          "link": "/r/ApplyingToCollege/comments/qaidks/duke_lgtbq_supplement_essay/hh3rqei/",
                          "text": "Thank you so much.  You are so lovely",
                          "author": "Rocket2011",
                          "created": 1634562667,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}