{
  "sid": "q5ahxl",
  "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/",
  "title:": "A nationally ranked artist who's NOT going to submit an art portfolio: is it okay?",
  "text": "Hello everyone, this is my first post here, and I would love to have some of your opinions.\n\nSo, I'm a nationally ranked artist (even had rank one), but my mother filmed all my stages as memories, not for further evaluation. The videos are low resolution (I can show you in inbox; I don't even know how that works on reddit but I'll learn) and the camera work is a bit shaky. Overall, it seems a bit unprofessional. Now, I don't have a camera or a good quality phone. Hiring a videographer is sort of off-limits in the pandemic.\n\nIn this case, would it be sus if I don't submit a portfolio despite saying I'm a national winner and how important dance is to me? My guidance counselor probably will mention my dance and my national awards too btw.\n\nOr should I submit it anyway? I think the bad resolution will be an inconvenience for whoever will be evaluating my portfolio. Will they get annoyed and think I'm not professional enough?\n\nFor context, I'm applying to few competitive unis, and my name as a winner of this competition is not available on the Internet.",
  "author": "ghum_ashche",
  "created": 1633880651,
  "updated": 1634073553,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hg49dr2": {
      "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg49dr2/",
      "text": "How exactly are you nationally recognized then...??",
      "author": "Concerned-gay-guy",
      "created": 1633882673,
      "upvotes": 3,
      "replies": {
        "hg4bvxa": {
          "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg4bvxa/",
          "text": "There's this competition in our country. It's considered the most prestigious dance competition. I'm 100% not a famous dancer, but I won a few times there. I also danced for some really reputed programs. That's it. Maybe 'recognized' isn't a good word, more like, I just won good awards",
          "author": "ghum_ashche",
          "created": 1633883772,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg49uca": {
      "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg49uca/",
      "text": "Are there any physical awards you can photograph? National competitions should have records right? Can you write to them for proof? Weird they wouldn’t post that on the ‘net. Will your applications have interviews in which you can explain everything or perhaps even forward videos?",
      "author": "pupuphlatter",
      "created": 1633882878,
      "upvotes": 2,
      "replies": {
        "hg4ct1j": {
          "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg4ct1j/",
          "text": "Yeah, there are physical awards. It's not in English though. I can write to the academy who organized the competition but I'm afraid they won't care. They must keep records, but God knows; I'm not sure they'll cooperate. I searched a million times for the name list of those who won but to no avail. Again, it won't be in English even if it's found. I can have my dance mentor vouch for me; she's a FAMOUS dancer in our country. I can also obviously explain in interviews, and I can forward videos but the videos I have are bad quality. I have photographs of me receiving the prize on stage, if that helps in any way.",
          "author": "ghum_ashche",
          "created": 1633884177,
          "upvotes": 1,
          "replies": {
            "hg4dpn3": {
              "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg4dpn3/",
              "text": "The way I see it, it’s all worth a shot, right? If getting into a desired program is important enough, you do everything you can. You can never “lose” as long as you’ve given it your all and tried to get as much info to them as possible. So write to ask these competitions. You’ll never know until you do. I wouldn’t worry about the language barrier. We live in a small world now and I am certain if they really wanted it translated, it’ll get translated. Finally, if you send all that info and submit the videos, you can rest easy that they have everything possible to form a reasonable assessment. Every piece helps…",
              "author": "pupuphlatter",
              "created": 1633884570,
              "upvotes": 1,
              "replies": {
                "hg4geqq": {
                  "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg4geqq/",
                  "text": "Ahh, thank youu! \n\nDancing doesn't have anything to do with my intended major though; it's just an EC I'm passionate about. But the question is, where am I going to send the certificates? I don't see any place in the commonapp. Won't they take my or my recommenders' word for it? As for the videos, again, the resolution is terrible. I'm afraid they'll get annoyed at my unprofessionalism in filming my stages.",
                  "author": "ghum_ashche",
                  "created": 1633885732,
                  "upvotes": 1,
                  "replies": {
                    "hg4iwd0": {
                      "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg4iwd0/",
                      "text": "Well that *completely* changes things. If this is an EC that has nothing to do with the target school’s recognition and the intended concentration then stating the names of the competitions is good enough (with the recommendation that makes mention). ECs help round out who you are.",
                      "author": "pupuphlatter",
                      "created": 1633886779,
                      "upvotes": 1,
                      "replies": {
                        "hg4ngso": {
                          "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg4ngso/",
                          "text": "Yayy thank you. I spent the entire day stressing about how to represent this EC, and I was starting to feel it was useless to sweat over it this much",
                          "author": "ghum_ashche",
                          "created": 1633888632,
                          "upvotes": 2,
                          "replies": {
                            "hg4pc34": {
                              "link": "/r/ApplyingToCollege/comments/q5ahxl/a_nationally_ranked_artist_whos_not_going_to/hg4pc34/",
                              "text": "Np. Just be as specific as room allows (year of competition, etc). I know they limit the amount of text you can type in. Good luck!",
                              "author": "pupuphlatter",
                              "created": 1633889390,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}