{
  "sid": "qb2iq4",
  "link": "/r/ApplyingToCollege/comments/qb2iq4/sophomore_grades_really_going_downhill_because_of/",
  "title:": "sophomore grades really going downhill because of moms diagnosis of cancer and my diagnosis of depression and panic disorder. Can this be a legitimate excuse?",
  "text": "My mom was diagnosed with cancer last year about this time of the year last year, and I thought I wont be affected by it. However, either it was that or just school stress in general, I started having major depressive episodes and panic attacks that quite often interfered with my performance in school. I was not able to concentrate in class especially during tests when I would also have panic attacks.\n\nAs side effects of her chemo and medicine, my mom has also been suffering from depression, which worsened  my own depression and panic disorder to the point I was getting panic attacks everytime I has contact with her. \n\nMy grades have been suffering, but I know I should be able to bring it back up the second semester. Does this all count as a legitimate excuse and if so, can it make up for the failing grades I have right now?\n\nEdit: I'm currently aiming for a t20",
  "author": "madeinchina___",
  "created": 1634612633,
  "updated": 1634652974,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hh76993": {
      "link": "/r/ApplyingToCollege/comments/qb2iq4/sophomore_grades_really_going_downhill_because_of/hh76993/",
      "text": "Mental health is health too. It counts 100%.",
      "author": "Familiar-Muscle-9168",
      "created": 1634619583,
      "upvotes": 5,
      "replies": {}
    },
    "hh6wkyu": {
      "link": "/r/ApplyingToCollege/comments/qb2iq4/sophomore_grades_really_going_downhill_because_of/hh6wkyu/",
      "text": "Of course it does, that sounds very stressful, you poor kid. For now, honestly, focus on your mental health and being there for your mom. They are far more important than anything else. Don’t worry about grades or college. Stress doesn’t get worse than this.",
      "author": "fishylegs46",
      "created": 1634613711,
      "upvotes": 6,
      "replies": {}
    },
    "hh6utel": {
      "link": "/r/ApplyingToCollege/comments/qb2iq4/sophomore_grades_really_going_downhill_because_of/hh6utel/",
      "text": "Definitely",
      "author": "Tarzan1415",
      "created": 1634612791,
      "upvotes": 3,
      "replies": {}
    },
    "hh80wxb": {
      "link": "/r/ApplyingToCollege/comments/qb2iq4/sophomore_grades_really_going_downhill_because_of/hh80wxb/",
      "text": "Of course!",
      "author": "Anonymia1101",
      "created": 1634644671,
      "upvotes": 1,
      "replies": {}
    }
  }
}