{
  "sid": "qv9pww",
  "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/",
  "title:": "How Do I Choose My Major and Will It Affect My Chance of Admission?",
  "text": "*After a long content hiatus, I'm back with a discussion on choosing majors/programs. Both Noelle and I will be focusing on more content again for A2C and our blog through the new year. Given the upcoming UC and regular decision deadlines, we hope this information is helpful to anyone still struggling with what majors/programs to apply for.* \n\nChoosing a major for college can seem like a daunting decision. The truth is that what you study as an undergrad probably WILL affect the direction of your future career. But it’s not as much as some students think. \n\nCollege majors do affect career opportunities, so if you have a particular career in mind, you should try to find the appropriate program. If you’re looking to become an engineer or nurse, then you definitely want to apply for those programs, as they will provide specific knowledge that is necessary for the job. But employers are oftentimes looking more for soft skills like communication, leadership, and problem solving. What’s your work ethic? Do you get along well with others? If you’re unsure as to what career you want, you can pick a program that will help you develop these attributes.\n\nIf you’re looking to go to grad school, there is definitely some flexibility as well. I’ve talked to med school admissions officers who mentioned that majoring in something other than biology sometimes helped an applicant stand out in the admissions process, as long as they took the required courses and did well on the MCATs. For law school or MBA programs, it can be even more flexible as to what your undergraduate degree is in. **The point is that your choice of major is NOT going to lock you into one small subset of future career outcomes**. And keep in mind, for many programs, it’s relatively easy to change your major once you arrive on campus. \n\n# Does my choice of major affect my chance of admission?\n\nThere’s a lot of debate out there about an applicant’s choice of major as it relates to their admissions chances for that school. This post is my personal take on this discussion, which I hope will get applicants to at least think about their chosen majors more carefully. \n\nOverall, **I don’t believe that** **an** **applicant’s choice of major ostensibly affects the acceptance rate to most undergraduate programs**, as many schools don’t even require that a student declare a major until sophomore year and understand that a large portion of students will change their majors. This is especially true for liberal arts colleges and top-ranked schools with core curriculum, as they are able to more easily predict class sizes due to the high number of required courses for graduation. \n\nBut there are always exceptions to the rule. Certain majors, especially those in business/engineering/other specialized programs, can have dramatically different acceptance rates - think Wharton Business School or CMU’s Computer Science School. And at large institutions, like the University of California school system, acceptance rates can be wildly different from program to program.  \n\nHowever, there’s more to this conversation beyond the surface of acceptance rates. I do think that **a student’s extracurricular/academic work and its relation to your intended major can affect how competitive of a student you are**. For example, a student I worked with thought they wanted to study political science and go to law school for much of their high school careers, participating in the typical poli-sci ECs of MUN, debate, volunteering for local election campaigns, and Amnesty International, only to realize the summer before senior year that they wanted to study biology and go into medicine. While I do believe that achievement in the above-mentioned activities have value, regardless of chosen major, I don’t believe they will be as strong an applicant applying as a biology major as they would a political science major, two programs that are vastly different. This can also be exacerbated by their choice of courses, perhaps taking AP Government and AP Macroeconomics instead of challenging themselves in AP Bio. \n\nLastly, for a more recent change of academic direction, a student might not be nearly as informed about their new field as the one they’ve been working towards already for years. In the “Why Major?” essays, they might be able to write a much stronger and more specific reason for studying a particular field, avoiding cliches like wanting to study biology to go to med school because they realized how much they just really wanted to help people.\n\nIn these cases, **I sometimes recommend that students consider reverse engineering their chosen major** to one they have more prior experience/achievement in and are more competitive for already. The later this shift in interest realization happens, the more likely I am to suggest this option. And this is generally just a consideration for a student’s reach schools. \n\n# When should I consider reverse engineering my chosen major?\n\n1. **Students who don’t have a strong preference of major to begin with.** If this is the case, then you don’t have much to lose.\n2. **Students whose extracurricular profiles are really different from the academic field they want to study in.** As mentioned in the example above, I believe activities are valued somewhat differently depending on what program you’re applying for.\n3. **Students applying to programs where it is quite easy to change majors once accepted.** If it’s not much of a hassle, then you don’t have much to lose here. \n\nHere’s the reasoning: If you’re applying for a BA in political science within the CAS (or equivalent) college of a school AND the biology program is within the same college, it might not be too difficult to change your major within your first or second year. For some schools, you don’t even declare your major until sophomore year and will be taking a lot of required core curriculum classes your first year anyways. In this case, why not stick with your original interests in political science and prevent any situation where you’re compared to another biology applicant with tons of achievement in that field - research experiences, Olympiad results, or challenging related coursework. \n\nIf you are a student who doesn’t really know what they want to study, you can certainly apply as undeclared, but maybe you have a couple of interests and just can’t choose between them. In this case, you could also apply for whichever program you seem more qualified for and express interest in double majoring in another program. I personally believe this to come off as more ambitious than applying undeclared. \n\n# When NOT to try to reverse engineering your chosen major\n\n1. **Students who find it hard to write passionately about your “optimal” chosen major.** Oftentimes, schools have a “Why Major?” or “Why Us?” supplemental essay that encourages you to explain your choice of intended area of study. If you can’t write passionately about a possible field of study, it might come off as uninspired in the essay.\n2. **Students who don’t have wildly different academic interests.** Your activities might have just as much admissions value for either of the majors you’re stuck deciding on, so you might as well choose the one you think you’re most interested in now. \n3. **Students applying to schools where changing majors is difficult**, like the UC school system. If you know that you really want to study something like biology, don’t risk the chance of not being allowed to transfer into that program later.\n\nThis strategy is certainly school specific, so you don’t want to necessarily use it for every school. Also keep in mind that for your target/safety schools, you may be competitive for your first-choice course of study anyways and you might not need to try to think about optimizing your application and would rather avoid any hassle in changing majors/programs. \n\n# A note on diversifying your chosen majors\n\nIf a student has multiple interests, we often recommend that they diversify their intended majors. Not only can you give yourself more time to decide which program might fit best, you can sometimes avoid choosing the most competitive programs at certain reach schools. Interested in all of Stern NYU’s business resources but don’t necessarily want to major in business? You can apply for a CAS major instead and think about getting your MBA later. For less competitive business schools at other universities, you probably have a better shot of getting accepted and can apply for the business school. We generally just advocate that for students with multiple interests or are unsure about what they want to study, that they choose the program that they’re most qualified for.\n\n# What about applying undeclared?\n\nIf you really don’t know what you want to study, you can of course apply as undeclared. There are a number of students in the same boat as you and many available spots open to students who want to take their time in choosing an academic direction. The only warning that I would give to students applying undeclared is that you shouldn’t come off as having NO idea as to what you want to study. I believe that it’s stronger in the admissions office to come off as having TOO MANY academic interests and you can’t pick one. Can’t choose between economics, business, and public policy? Explain these specific interests in your essays/additional information section instead of coming off as rudderless. \n\nIf you’re stuck between two particular programs and are thinking about applying undeclared, you can also say that you hope to double major in those programs and can come off as academically ambitious. The point is, just make sure to explain your reasoning for applying undeclared if you decide to do so. \n\n# School policies on declaring and changing majors\n\nOverall, there are a few general rules you can follow in regards to how flexible a school is with a student changing majors. \n\n1. **Smaller, more liberal arts/core curriculum schools will usually have more flexibility with changing majors**\n2. **Larger state universities with fewer core classes will make it harder to change majors, especially between different colleges within the university**\n3. **Changing majors into special programs that are competitive at that particular school can be difficult (business, engineering, computer science)**\n4. **Changing majors within your current college is generally easy**\n\nOf course there are always exceptions to the rule, which is why we’ve listed the specific policies for declaring and changing majors for the top-30 universities and top-10 liberal arts colleges below with links. Notice that the list for liberal arts colleges is short because they generally make it pretty easy to change majors as long as you’re likely to graduate on time. \n\nTry to pay attention to the language used by the school to indicate how many obstacles there may be to changing majors. For some schools, they’ll say unequivocally that “Students may change their majors at any time, provided that they will be able to complete the new program before graduation.” (Amherst), while for others, they state “Please note that submitting these requests does not guarantee approval” (UCLA) in reference to forms to request a change in major. While one is encouraging students to change majors, the other is warning of the possibility of having your request rejected. \n\n**\\*\\*\\*DISCLAIMER: These policies are complex and we may not have the FULL picture for major policies for every school\\*\\*\\***\n\n**Original Blog Post Here:** [**https://www.theadmissionsangle.com/2021/09/07/how-do-i-choose-my-major-and-will-it-affect-my-chance-of-admission/**](https://www.theadmissionsangle.com/2021/09/07/how-do-i-choose-my-major-and-will-it-affect-my-chance-of-admission/)\n\n# Top 30 Universities\n\n**Princeton**\n\n[B.S.E. students join their departments at the end of their first year by selecting courses for the next fall with their chosen department and declaring their selection on the registrar’s website in May. A.B. students declare their concentration in mid-April of their sophomore year by selecting their next fall’s courses with their chosen department’s designated adviser or departmental representative and then confirming their selection on the registrar’s website.](https://odoc.princeton.edu/advising/how-do-i)\n\n[Changes of departmental concentration are rare, but they are possible. The rule is that you must complete all the requirements for your new major, including independent work requirements.](https://odoc.princeton.edu/advising/how-do-i)\n\n**Columbia**\n\n[As a Columbia College student, you will declare your major online in March of your sophomore year.](https://www.cc-seas.columbia.edu/csa/cc_majordec/declaremajor)\n\n[If you want to change your major/concentration after the major declaration period, you can work with your advising dean to complete a change-of-major form.](https://www.cc-seas.columbia.edu/csa/cc_majordec/declaremajor)\n\n[If you are enrolled at either Columbia College or Engineering and you genuinely feel that you should attend the other, you may apply as an internal transfer student. Internal transfers must submit the Internal Transfer Application by March 1. There is no guarantee that you will be able to transfer to a different school.](https://undergrad.admissions.columbia.edu/ask/faq/question/2434)\n\n**Harvard**\n\n[About a third of undergraduates change fields after declaring their concentrations, which students do midway through their sophomore year. You would simply change concentrations in consultation with your departmental advisers.](https://college.harvard.edu/resources/faq/how-easy-it-change-my-concentration)\n\n**MIT**\n\n[Most students declare a major in the spring term of their first year at MIT. Those who do not must decide on a major by the end of their sophomore year.](https://registrar.mit.edu/registration-academics/academic-requirements/majors-minors/declaring-major)\n\n[If, in the course of your undergraduate study, you decide to change your major, there are a number of important things to keep in mind. You should consult with the undergraduate academic officer or administrator in the new department to determine what subjects from your current major could be used to satisfy requirements in the new one. We also encourage you to email us with questions about how changing your major would affect your GIR audit.](https://registrar.mit.edu/registration-academics/academic-requirements/majors-minors/changing-major)\n\n**Yale**\n\n[**First-year students and declaring a major** First-year students are not expected to declare a major during their first year on campus.  A few may do so in their second term— particularly students intending to major in a STEM field — but doing so isn’t required or expected, even for potential STEM majors.](https://advising.yalecollege.yale.edu/declaring-major)\n\n##### [How to declare a major](https://advising.yalecollege.yale.edu/declaring-major)\n\n[Students declare a major by 1) logging onto the SIS (Student Information Systems) site, 2) clicking the Academic Information menu item, and 3) clicking “Declare a Major/Degree - Yale College Only”.](https://advising.yalecollege.yale.edu/declaring-major)\n\n##### [How to Change a major](https://advising.yalecollege.yale.edu/declaring-major)\n\n[Follow the procedures above and insert your new major.](https://advising.yalecollege.yale.edu/declaring-major)\n\n[Some majors have an approval process](https://advising.yalecollege.yale.edu/declaring-major).  Read about those processes[ here](http://advising.yalecollege.yale.edu/courses-and-majors/majors-and-concentrations-require-application-review-or-audition)\n\n**Stanford**\n\n[**Choosing a Major**](https://registrar.stanford.edu/students/undergraduate-degree-progress/declaring-undergraduate-majors-honors-and-minors)\n\n[Each entering student at Stanford has full access to all undergraduate offerings in the Schools of Earth, Energy & Environmental Sciences, Engineering, and Humanities & Sciences. The curriculum is not strictly divided into upper and lower divisions, so you may enroll in courses for which you are appropriately prepared. Course prerequisites are intended to serve as a guide, rather than as a deterrent.](https://registrar.stanford.edu/students/undergraduate-degree-progress/declaring-undergraduate-majors-honors-and-minors)\n\n[Because some of the technical majors, such as engineering, have a more structured curriculum, students considering those majors should take some introductory courses in math and/or science during their first year.](https://registrar.stanford.edu/students/undergraduate-degree-progress/declaring-undergraduate-majors-honors-and-minors)\n\n[You are asked to choose a major by the time you achieve junior status, usually completion of 90 units, including units granted for transfer work or Advanced Placement. Even after this point you may change your major if your interests shift.](https://registrar.stanford.edu/students/undergraduate-degree-progress/declaring-undergraduate-majors-honors-and-minors)\n\n[**Declaring a Major**](https://registrar.stanford.edu/students/undergraduate-degree-progress/declaring-undergraduate-majors-honors-and-minors)\n\n[If you are undeclared and want to declare your major, log on to Axess. You then submit a request to the department in which you want to pursue a major. The department informs you of their decision whether to accept you into the major. You should contact the department directly to determine if any other requirements must be fulfilled to process your major declaration request.](https://registrar.stanford.edu/students/undergraduate-degree-progress/declaring-undergraduate-majors-honors-and-minors)\n\n[Note that students must declare a major prior to requesting to add a minor. ](https://registrar.stanford.edu/students/undergraduate-degree-progress/declaring-undergraduate-majors-honors-and-minors)\n\n[You may change your major at any time by declaring a new major in Axess.](https://registrar.stanford.edu/students/undergraduate-degree-progress/declaring-undergraduate-majors-honors-and-minors)\n\n**UChicago**\n\n[While for some students, choosing a major serves as a path to a specific career or profession, for others it represents a way to build skills that could apply to many different careers or to dig into a passionate academic interest. You can begin a major at any time, including your first quarter. Unless otherwise specified by the department, the deadline for declaring a major is Spring Quarter of your third year. Most students will change majors at least once during their time on campus.](https://collegeadmissions.uchicago.edu/academics)\n\n**Penn**\n\n[Application to a major should be made in the second semester of the sophomore year, prior to Advance Registration for the first semester of the junior year. Students who have not declared a major by the end of Advance Registration during the spring semester of their sophomore year will not be able to register for the next semester until they have declared. Athletes must be declared by the beginning of junior year to retain eligibility.](https://www.college.upenn.edu/declaring-major)\n\n[Changing or declaring your engineering major is a simple process. You will need to complete the appropriate form. You should fill out the form following the directions printed on it. You will need to see your current academic advisor as well as the Undergraduate Chair of the program into which you are moving. The completed form is returned to 109 Towne.](https://ugrad.seas.upenn.edu/student-handbook/advising/changing-your-major-curriculum/)\n\n[Students who wish to apply for an internal transfer between any of the four undergraduate schools should speak with an advisor in the school to which they are applying. Applicants should be prepared to discuss why the curriculum of the target school is a good fit for their academic interests and goals.](https://www.college.upenn.edu/transfer-within-university)\n\n* [Students are not eligible for transfer until they have completed 8 c.u. (or two semesters, whichever comes later) at Penn.](https://www.college.upenn.edu/transfer-within-university)\n* [Applications for internal transfer will not normally be considered after the end of the sophomore year.     ](https://www.college.upenn.edu/transfer-within-university)\n* [Students applying for internal transfer must be in good academic standing in their home school and should have no NR's, GR's or I's on their record.](https://www.college.upenn.edu/transfer-within-university)\n* [Internal transfers to any of Penn's undergraduate schools or divisions are not eligible to transfer again within the University.](https://www.college.upenn.edu/transfer-within-university)\n* [External transfers admitted to any of Penn's undergraduate schools or divisions are not eligible to transfer again within the University.](https://www.college.upenn.edu/transfer-within-university)\n* [Students in Penn's College of Liberal and Professional Studies are not eligible to apply for an internal transfer into the College of Arts and Sciences.](https://www.college.upenn.edu/transfer-within-university)\n\n**Caltech**\n\n[“Techers refer to their majors as an \"option.\" Most students select an option near the end of their first year, begin to specialize during their second year, and concentrate on their chosen field in their third and fourth years.”](https://www.admissions.caltech.edu/explore/academics/majors-minors)\n\n[“To change your option, simply download the Petition to Change Options form from the Registrar's website and follow the instructions. The Option Representative of your new option can assist you in selecting a new adviser.”](https://registrar.caltech.edu/current-students)\n\n[“In order to major in two options for the Bachelor of Science degree the student must present a rationale for the double option and a plan of study leading to completion of the degree in four years. A similar process is required to add a minor. Consult the Registrar's Office for appropriate procedures.”](https://registrar.caltech.edu/current-students) \n\n**Duke**\n\n[**Declaring a Major**](https://advising.duke.edu/students/second-year/declaring-major)\n\n[You can declare your major any time during your sophomore year but no later than the Friday before mid-semester break during your fourth semester of enrollment. ](https://advising.duke.edu/students/second-year/declaring-major)\n\n* [If your fourth semester at Duke is spring semester (as is for most students), the deadline to declare is the Friday before spring break. ](https://advising.duke.edu/students/second-year/declaring-major)\n* [If your fourth semester at Duke is fall semester, the deadline to declare is the Friday before fall break.](https://advising.duke.edu/students/second-year/declaring-major)\n\n[**Changing Majors within your school**](https://advising.duke.edu/major/change)\n\n[Once you have declared your major, you may change, add, or delete a major, minor, or certificate through the Office of the University Registrar.  A form is available online.  You don't have to submit another Long Range Plan to make changes to your program of study after your initial declaration.](https://advising.duke.edu/major/change)\n\n[**Changing Majors from Engineering Trinity College**](https://pratt.duke.edu/undergrad/students/policies/3537)\n\n[Currently enrolled Duke students can apply to transfer between the Pratt School of Engineering and Trinity College. If you are a Duke student who is taking time away from Duke, you may apply for readmission and transfer to Trinity College via the Office of Student Returns.](https://pratt.duke.edu/undergrad/students/policies/3537)\n\n[Applications to transfer are considered at the end of each semester, once final grades are reported.  Deadlines and processes for applying to transfer are described below.](https://pratt.duke.edu/undergrad/students/policies/3537)\n\n**Johns Hopkins**\n\n“[Students who enter the Krieger School of Arts and Sciences from high school will meet with an academic advisor to declare their major in April of their freshman year. Meanwhile, students who enter the Whiting School of Engineering (WSE) declare a specific engineering major on their application for admission. A student must take direct action to change the major.](https://pages.jh.edu/design/oliver/academic_manual2010-2011/majors.html)”\n\n“[Students in Arts and Sciences or Engineering may change their major by completing a Change of Major form available from the Office of the Registrar. Note that students may declare the Biomedical Engineering major only as entering freshmen or as one of a limited number of students accepted into the program after the freshman year.](https://pages.jh.edu/design/oliver/academic_manual2010-2011/majors.html)”\n\n**Northwestern**\n\n[While you can declare a major at any point, Weinberg does not require you to do so until the end of your sophomore year. This should tell you two things: that we want you to use your early coursework to try out different fields, and that most majors can be completed in about two years, provided you have gotten your feet wet with an introductory class or two.](https://weinberg.northwestern.edu/undergraduate/advising/faqs/first-year-faq.html)\n\n[If you want to have a major in another school, you will need to interschool transfer out of Weinberg. (You may have a Weinberg major even if you are in a different school; you would complete that school's degree requirements, including a major in that school, in addition to the Weinberg major's.) If you have changed your mind during the summer prior to your first year, you should contact the admissions office about how to change schools. Once you have begun your studies, you will need to apply to transfer schools. This is generally a simple process, but you can only apply to transfer during the first month of a given quarter—the transfer then goes into effect at the start of the following quarter. For all the details, including how interschool transferring can affect your decisions about your second first-year seminar, consult our rules and policies for interschool transfer.](https://weinberg.northwestern.edu/undergraduate/advising/faqs/first-year-faq.html)\n\n**Dartmouth**\n\n[“Students may declare their initial major after the beginning of their fifth term in residence. For most students it is in winter term of their sophomore year, and the major should be declared officially by no later than the second Thursday of spring term.”](https://www.dartmouth.edu/reg/guides/dartworks/dartworks_faq.html#aa)\n\n[Students may follow a detailed guide to change their majors in their DartWorks portal. It should be noted students can only drop majors if more than one is declared.](https://www.dartmouth.edu/reg/guides/dartworks/drop_major_minor.html) \n\n**Brown**\n\n[Students at Brown refer to their majors as concentrations. They must declare a concentration no later than the middle of their fourth semester, before pre-registering for their fifth semester. This is usually the spring semester of sophomore year. ](https://www.brown.edu/academics/college/degree/concentrations/declaring)\n\n[Brown students can follow a step-by-step guide to change their concentration, degree, or track in their ASK portals. Students may need to edit each course in their course plan to see new attributes specific to their concentration change.](https://ithelp.brown.edu/kb/articles/students-change-a-concentration-in-ask) \n\n**Notre Dame**\n\n[“The formal declaration of your future college takes place in the spring semester and requires a meeting with your first-year advisor who will help you complete the necessary paperwork. Before this meeting takes place, you will be asked to complete a set of mid-year self-reflection questions that will provide background information to help your advisor support you in making a well-informed decision about the future of your studies at Notre Dame.”](https://firstyear.nd.edu/advising/policies/program-declaration/)\n\n[In order to change a major, Notre Dame students must consult with the Director of Undergraduate Studies or program manager for advising in the relevant department or program. ](https://al.nd.edu/advising/academic-policies/declare-change-major/)\n\n[Once advised, students can access the Program Change/Declaration form from the Registrar Request forms in their MyNDC portal under the ACADEMICS tab.](https://www.notredamecollege.edu/academics/registrar/forms/)\n\n**Vanderbilt**\n\n[Vanderbilt students in AS, MHS, and engineering may declare a major after the completion of their second semester, but no later than their fourth semester, with assistance from their adviser in the CASPAR.](https://as.vanderbilt.edu/internal/policies/declaring-major.php)\n\n[To change majors, Vanderbilt students fill out the same form and follow the same process as declaring a major. The sections completed on the form vary depending on the changes wished to be made. Students must get approval from their academic advisers. Seniors who wish to make changes to their majors may do so only before the fifth class day of their senior year.](https://as.vanderbilt.edu/academics/declaring-major.php)\n\n[International students must adhere to different policies regarding change of major and change of level.](https://as.vanderbilt.edu/internal/policies/declaring-major.php) \n\n**Cornell**\n\n[“Most students declare a major during or at the end of the second semester of their sophomore year. Students entering their junior year without a major are considered not making progress towards their degree.”](https://as.cornell.edu/advising/choosing-majorminor)\n\n[Students can add a second and even third major. From there, they can drop an undesired major after contacting the undergraduate coordinator of the Director of Undergraduate Studies (DUS) in the major they wish to drop.](https://as.cornell.edu/advising/choosing-majorminor) \n\n**Rice**\n\n[“Undergraduate students must declare a major during or before the spring semester of their second year. Undergraduates may declare a major at any time before this deadline and always are free to change their major by completing the appropriate form.” ](https://registrar.rice.edu/students/majors-minors-and-university-certificates)\n\n[Students are always free to change their major by completing the Change of Major form. Area majors are an exception to this rule and must be declared by the fourth semester before graduation.](https://ga.rice.edu/undergraduate-students/academic-opportunities/majors-minors-certificates/)\n\n[Students can follow the linked steps to declare or change their major through the ESTHER portal.](https://registrar.rice.edu/students/majors-minors-and-university-certificates)\n\n**WashU**\n\n[“All first-year students come into WashU officially “undeclared” and work closely with their academic advisors to choose courses; explore new programs; determine majors, minors, and pre-professional programs; and discover their academic passions.](https://admissions.wustl.edu/academics/majors-and-programs/) [Students are asked to declare a major by the spring of sophomore year. When you're ready, go to WebSTAC and see Academics/Major Programs to declare your major.”](https://artsci.wustl.edu/resources/major-declaration)\n\n[Students can switch their majors within their schools from the WebSTAC portal with support from their academic advisors. Transferring to another division is possible, but not guaranteed. ](https://admissions.wustl.edu/common-questions/)\n\n**UCLA**\n\n[Students can apply “undeclared” but must declare their majors by the beginning of their junior years.](http://newstudents.ucla.edu/studyarea/) [For students who chose a major outside the College in one of the professional schools, check with the school to see if a supplemental application or any other action is required.](https://admission.ucla.edu/apply/freshman/choosing-major)\n\n[“Students who wish to make changes to their program, such as switching into the College of Letters & Science, declaring a double major or changing/adding a major/minor with over 150 units may be required to submit petitions to their UCLA College Advising unit for approval.  Please note that submitting these requests does not guarantee approval.”](https://caac.ucla.edu/petitions-forms/change-in-major-minor/)\n\n**Emory**\n\n[“At Emory, our liberal arts general education requirements are designed to help you become a well-rounded individual and explore a wide variety of topics. And you don’t have to declare a major until the second semester of your sophomore year.”](http://catalog.college.emory.edu/department-program/concentration.php)\n\n**UC Berkeley**\n\n[Each major has different requirements in order to declare and different processes. Most major departments in L&S have clear guidelines for declaration on the major’s website.](https://lsadvising.berkeley.edu/majors-minors/declare-or-change-major)\n\n[High demand or “impacted” majors have restrictions on declaration, usually due to demand exceeding the capacity of the major. These restrictions might be particular GPA requirements, require a minimum grade in a specific course, or have elements to the declaration packet beyond grades. Some of these majors also have restrictions on when you are able to apply (e.g. before reaching 80 units). As with all majors, it is important to review requirements for declaration as early as possible. ](https://lsadvising.berkeley.edu/majors-minors/declare-or-change-major)\n\n[College of Engineering: Admission via a change of college application is very competitive and highly unlikely, and students should not count on admission through this method. ](https://engineering.berkeley.edu/admissions/undergraduate-admissions/change-of-college/)\n\n[College of Natural Resources: Current UC Berkeley students interested in transferring to the Rausser College of Natural Resources from another college (Letters & Science, Engineering, Environmental Design, or Chemistry) may petition to do so if the change of college requirements are met.](https://nature.berkeley.edu/advising/change-college)\n\n[Students who were admitted to UC Berkeley as freshmen and are planning to apply to Haas during their sophomore or junior years. Continuing UC Berkeley students may only apply once.](https://haas.berkeley.edu/undergrad/admissions/)\n\nEach of the Berkeley Colleges has separate criteria for internal transfer admission.\n\n**USC**\n\n[Open majors can be declared at any time by any student in good standing (not on academic probation).](https://undergrad.usc.edu/programs/major/declaring/)\n\n[Competitive majors require specific prerequisite courses and usually a minimum GPA, but meeting the minimum requirements does not guarantee admission. Each application cycle may have only a limited number of places available, and the competitiveness of the major depends on how many students apply. These majors have application forms and application deadlines](https://undergrad.usc.edu/programs/major/declaring/).\n\n**Georgetown**\n\n[First-year students in sciences and languages enter with those majors declared in order to facilitate the four-year arc that those majors generally entail. Declared first-years may explore alternate majors through core and elective work, but remain with their entering major until the sophomore year, when they may change to Undeclared, or to a new major directly.](https://college.georgetown.edu/advising/faq/declare-a-major-minor/)\n\n[When you decide on a major, email the Director of Undergraduate Studies (new window) in the major department to request to declare the major and receive a faculty advisor assignment. Once you’ve secured this information, complete and submit an Academic Program Changes Form to be reviewed by your Advising Dean or Academic Counselor in the College Dean’s Office.](https://college.georgetown.edu/advising/faq/declare-a-major-minor/)\n\n[In order to transfer to a different undergraduate school, students have to complete an application that consists of an essay explanation of the request, along with an approval from the student’s dean.](https://thehoya.com/rethinking-best-fit-gu-school/#:~:text=In%20order%20to%20transfer%20to,approval%20from%20the%20student's%20dean.)\n\n**Carnegie Mellon**\n\n[The earliest a major can be declared during the second semester of Year 1. Primary majors should be declared no later than mid-semester of the last semester of Year 2.](https://www.cmu.edu/dietrich/advisory-center/exploring-majors/how-to-declare.html)\n\n[Transferring among colleges requires a separate application process and approval. Processes depend on the school.](https://www.cmu.edu/cfa/music/current-students/internal-transfer.html)\n\n**UMichigan**\n\n“[Students normally declare a major during the second term of their sophomore year. To declare a major, a student should contact the appropriate department and make an appointment with a department advisor.” ](https://lsa.umich.edu/lsa/academics/lsa-requirements/majors.html)\n\n“[A cross campus transfer applicant is any current or former U-M student (including U-M alumnus) who wishes to transfer from one school or college on the Ann Arbor campus to another. To apply, use our Cross Campus Transfer Application Form.](https://admissions.umich.edu/apply/other-applicants/change-school-or-college)”\n\n[Some colleges, such as the Ross School of Business, require a separate application portal. Pre-professional programs, such as Engineering and Dental Hygiene, require a separate application process including essays.](https://admissions.umich.edu/apply/other-applicants/change-school-or-college)\n\n**Wake Forest**\n\n[The initial declaration of major usually occurs in the Spring term of the Sophomore year or when the student has EARNED at least 40 credit hours. There is a designated period in February in which Sophomores declare both majors and minors en masse through the College academic departments, without each student needing to file individual declaration forms through the Office of the University Registrar. ](https://registrar.wfu.edu/declarations/)\n\n**UVA**\n\n[For the College of Arts and Sciences, “Students must enroll in either a major program offered by one of the departments or an interdepartmental program before the last day of classes in the fourth semester; the program must be approved by an official major advisor.”](https://college.as.virginia.edu/declaremajor)\n\n[Students planning to transfer to the University of Virginia School of Architecture, Batten, Commerce, Education, Engineering, or Nursing should visit these schools and investigate carefully the requirements for entrance and application deadlines. These undergraduate schools are separate from the College of Arts & Sciences and have their own admissions standards, programs, and goals.](https://college.as.virginia.edu/transfer-out)\n\n**Georgia Tech**\n\n[Georgia Tech's official major change policy states admitted first-year students may change their major during the fall of their first year on campus.](https://admission.gatech.edu/first-year/major-selection)\n\n[Some programs, such as CS, ME and ISyE have additional conditions that must be met for a change of major.](https://admission.gatech.edu/first-year/major-selection)\n\n**NYU**\n\n[College of Arts and Science students declare a major prior to the end of their sophomore year. Internal transfers among different colleges require a separate selective application process which can include essays, auditions, or portfolios. ](https://www.nyu.edu/admissions/undergraduate-admissions/how-to-apply/internal-transfers.html)",
  "author": "theadmissionsangle",
  "created": 1637074977,
  "updated": 1637179066,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 0.92,
  "comments": {
    "hkw9n4l": {
      "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/hkw9n4l/",
      "text": "Thank you for making this!",
      "author": "sparsh26",
      "created": 1637093533,
      "upvotes": 3,
      "replies": {}
    },
    "hkxcbzc": {
      "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/hkxcbzc/",
      "text": "Yep yep, most school don’t really care about major choices too much",
      "author": "ShoeGawd",
      "created": 1637109497,
      "upvotes": 2,
      "replies": {}
    },
    "hkuz8er": {
      "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/hkuz8er/",
      "text": "I couldn't fit the Top 10 LAC policies list in this post, so if you're interested, check it out in [our article](https://www.theadmissionsangle.com/2021/09/07/how-do-i-choose-my-major-and-will-it-affect-my-chance-of-admission/).",
      "author": "theadmissionsangle",
      "created": 1637075141,
      "upvotes": 2,
      "replies": {}
    },
    "hkxf5x8": {
      "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/hkxf5x8/",
      "text": "And I’d argue that ECs don’t have to line up with major all that much. If they did, what major is listed would be way more important and undermines your argument.\n\nETA - think of the STEM kid that gets into T5 with art or performance ECs.",
      "author": "pixelatedpix",
      "created": 1637110761,
      "upvotes": 1,
      "replies": {
        "hkxghy9": {
          "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/hkxghy9/",
          "text": "I'm not arguing that a student should *exclusively* have ECs related to their major. This can run the risk of coming off as really one-dimensional. I've also seen plenty of STEM kids get into T5 schools with art/performance ECs. \n\nMy point is that that those same students don't have ONLY art/performance ECs if they're applying STEM. In that case, I would consult that a student think carefully about applying for an engineering program.",
          "author": "theadmissionsangle",
          "created": 1637111351,
          "upvotes": 2,
          "replies": {
            "hkxh6pd": {
              "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/hkxh6pd/",
              "text": "If we’re talking the very top schools, agree for Caltech/MIT. Stanford, Harvard, Yale for example don’t declare majors until later.\n\nAnd the situation for UCs is different that what you’d describe. Bio (your example) for instance isn’t hard to switch in if you have the grades, unlike CS/Engineering, where, depending on the UC, can be extremely difficult even with good grades.",
              "author": "pixelatedpix",
              "created": 1637111655,
              "upvotes": 1,
              "replies": {
                "hkxv0qy": {
                  "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/hkxv0qy/",
                  "text": "I think I've stated, pretty clearly, that engineering/CS are programs that are difficult to transfer into, especially for UC schools. So if a student really wants to study in those fields, they should of course apply for them, regardless of their ECs.",
                  "author": "theadmissionsangle",
                  "created": 1637117736,
                  "upvotes": 1,
                  "replies": {
                    "hkyb4u3": {
                      "link": "/r/ApplyingToCollege/comments/qv9pww/how_do_i_choose_my_major_and_will_it_affect_my/hkyb4u3/",
                      "text": "Look, I put my comment in because you mentioned bio as something hard to get in.\n\nETA “If you know that you really want to study something like biology, don’t risk the chance of not being allowed to transfer into that program later.” If you had written CS or Eng, 100% true, but that’s hardly true for bio, so it was such an odd choice for an example.",
                      "author": "pixelatedpix",
                      "created": 1637125804,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}