{
  "sid": "q9y269",
  "link": "/r/ApplyingToCollege/comments/q9y269/should_i_talk_about_a_change_in_my_intended_major/",
  "title:": "Should I talk about a change in my intended major and if so where? Need some advice",
  "text": "A little background info here, up till 10th grade I was inclined towards international relations, political science etc and was thinking that I would end up going into this field and consequently  took courses that were really spread out and not specific towards anything, but, by the end of the 10th grade, and after some important thinking, I concluded that I really wanted to do something that had a mix of the social sciences with a practical approach, and I felt econ was the best fit for this and finalised it as my intended major with business as a second option as well. \n\nQuestions was whether this is worth talking about in my application, and if yes, where could I do this? \n\nI could mention it in the covid prompt, as Covid actually allowed me to step back a little, and made me consider my choices during lockdowns/quarantines, and I could also connect it to how the external economic environment influenced my choices a little, but an issue here is that, this section is for actual negative material consequences students might have faced, which im grateful for not going through, thus feel including it here might be a bit too much and inappropriate\n\nSecond option is that I could include it in my additional info section, where I could talk about how it affected me  academically, as I really couldnt focus on subjects I really wanted to do, resulting in pretty average grades, specially when compared to others in my batch, and how I ended up taking completely new courses in 11th and 12th, and actually ended up  performing pretty well, but the concern mentioning it here is that im not sure whether it'll give effective and relevant insight to AOs about me as an overall candidate \n\nWould love some advice, thank you!",
  "author": "ResponsibilityOne875",
  "created": 1634474957,
  "updated": 1634653891,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {}
}