{
  "sid": "qubiyp",
  "link": "/r/ApplyingToCollege/comments/qubiyp/can_my_transcript_be_submitted_after_the_dec_1st/",
  "title:": "Can my transcript be submitted after the Dec 1st deadline?",
  "text": "I’m applying to a college on Common App that has a Dec 1 deadline. My counselor has been saying that if we’re applying to a school with a Dec 1 deadline, then we need to submit the applications by Nov 17 if we want our transcripts and other documents submitted on time, but I always thought those documents could be sent after applying, even if the deadline has passed.",
  "author": "RoxyFoxy2678",
  "created": 1636963804,
  "updated": 1637180156,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hkp54nm": {
      "link": "/r/ApplyingToCollege/comments/qubiyp/can_my_transcript_be_submitted_after_the_dec_1st/hkp54nm/",
      "text": "depends on the school",
      "author": "indecisiveasff",
      "created": 1636964373,
      "upvotes": 2,
      "replies": {
        "hkp8h2g": {
          "link": "/r/ApplyingToCollege/comments/qubiyp/can_my_transcript_be_submitted_after_the_dec_1st/hkp8h2g/",
          "text": "I just checked the school’s website and it says all required materials needed by Dec 1, so I’d need to submit my app by Nov 17. Not sure if I should even apply anymore bc I still have two supplements to write and even if I were to submit the application now it could take days before I get my portal link so I can get my counselor to send the documents.",
          "author": "RoxyFoxy2678",
          "created": 1636967207,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkp9n55": {
      "link": "/r/ApplyingToCollege/comments/qubiyp/can_my_transcript_be_submitted_after_the_dec_1st/hkp9n55/",
      "text": "A December 1 deadline does mean materials must arrive at the college by December 1.\n\nI understand why a high school has an earlier deadline for a request to get material submitted by a deadline, especially with the Thanksgiving holiday. Our school says a request for a transcripts must be in 2 weeks ahead of when they need to get it to the college.  I wouldn‘t expect to request a transcript from the high school on 11/30 and expect the transcript to be at the school on 12/1.\n\nBut I don’t understand why it means the actual application, which you submit directly to the college, has to be anywhere else, earlier.",
      "author": "RichInPitt",
      "created": 1636968225,
      "upvotes": 2,
      "replies": {}
    }
  }
}