{
  "sid": "ffiltt",
  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/",
  "title:": "Bruh y’all gotta remember this is applying to college not applying to T20s",
  "text": "Seriously. I posted a long in-depth recounting of my high school years, and how I managed to get by the college process with almost no stress. In the comments, I was criticized when someone found I’d only been accepted to my safeties (because my others haven’t come out yet). \n\n\nIt’s disheartening. They told me it seemed like I slacked off in high school, and that that’s why I achieved “low levels of success.” \n\nCome on dawg. I just want people to know that the college process doesn’t HAVE TO BE HELL. It can be managed well. But some people just cannot handle me posting about how I got into good schools without stress, just bc I didn’t get into top 10 schools. \n\nI only bring it forward because their comments got an upsetting number of likes. \n\nI don’t care if you want to go to a top tier school, I really don’t, but come ON. I was just trying to give advice to those who find themselves stressing about the process, it was so uncalled for.",
  "author": "okay-boomerang",
  "created": 1583699481,
  "updated": 1634076936,
  "over_18": false,
  "upvotes": 1771,
  "upvote_ratio": 0.97,
  "comments": {
    "fjyquiu": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyquiu/",
      "text": "[deleted]",
      "author": null,
      "created": 1583702619,
      "upvotes": 462,
      "replies": {
        "fjyr0gn": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyr0gn/",
          "text": "Exactly, like it doesn’t bother me much, it’s just so shitty that they think that undermining ones happiness bc they chase prestige is okay",
          "author": "okay-boomerang",
          "created": 1583702721,
          "upvotes": 165,
          "replies": {}
        },
        "fjzfq76": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzfq76/",
          "text": "They’re also the ones who know that everything they do is pointless. They see someone who’s actually living a relatively enjoyable life and get salty. People need to realize that they should do what they love, not what they think colleges will love. If you’re forcing yourself to apply to “MIT math camp” or whatever, even if you don’t want to, you’re wasting your life. People rarely find long term success in trivial work they feel obligated to do. Those who are truly happy and self fulfilling follow their dreams. If you spend your whole high school career killing your self to get into Harvard, Princeton, Yale, any highly competitive school, you’re setting yourself up for failure. We’d all love to get into one of those -Princeton has been my dream school fire years- but the truth is, I probably won’t get in. Sure I have good grades, test scores, and EC’s. So does everyone else applying. But I’ve finally realized that my worth is not determined by whether a school admits me (randomly). Set your goals higher than something that’s only four years of your life. Set your sights for NASA, the government, something that will BETTER yourself and others. Do you truly believe that the most successful people out of HYPSM spent their entire lives vying for a spot in one of those schools? So ask yourself: why should you?",
          "author": "Mediocre_Psion",
          "created": 1583718662,
          "upvotes": 115,
          "replies": {}
        },
        "fjzjs4b": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzjs4b/",
          "text": "Certified u/KushBogga moment",
          "author": "Mikrill_in_october",
          "created": 1583721388,
          "upvotes": 19,
          "replies": {
            "fjzz37q": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzz37q/",
              "text": "What's so special about that user?",
              "author": "ayc15",
              "created": 1583734607,
              "upvotes": 3,
              "replies": {
                "fjzznip": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzznip/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1583735253,
                  "upvotes": 8,
                  "replies": {
                    "fk09d7q": {
                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk09d7q/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1583748196,
                      "upvotes": -7,
                      "replies": {
                        "fk0a8l7": {
                          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0a8l7/",
                          "text": "[removed]",
                          "author": null,
                          "created": 1583749377,
                          "upvotes": 4,
                          "replies": {
                            "fk0ansx": {
                              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0ansx/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1583749942,
                              "upvotes": -6,
                              "replies": {
                                "fk0d9dv": {
                                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0d9dv/",
                                  "text": "[removed]",
                                  "author": null,
                                  "created": 1583752981,
                                  "upvotes": 4,
                                  "replies": {
                                    "fk0k280": {
                                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0k280/",
                                      "text": "[removed]",
                                      "author": null,
                                      "created": 1583759196,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fjymb6o": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjymb6o/",
      "text": "success is measured in different ways. some people don't realize that. keep doing what you're doing ❤️",
      "author": "CandyCornGal10",
      "created": 1583699823,
      "upvotes": 327,
      "replies": {
        "fjzgoes": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzgoes/",
          "text": "Success can be enhanced by going to a T20 school. I’m not saying it will be, but there is always a possibility it can. Connections are a huge part of success (atleast in my mindset), and these connections you form in college will push to the top of the major you wish to pursue. Obviously this is my take on success, and everyone will have different opinions on it. However, I believe that you can’t connect the dots looking forward, you can only connect them looking backwards. You gotta trust that the dots will somehow connect your future. Making connections is important, find the fastest route to make important and valuable connections that will lead you to connect your dots. (In my case, the fastest route would be going to a T20)",
          "author": "Kushbogga",
          "created": 1583719290,
          "upvotes": -202,
          "replies": {
            "fjziwkm": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjziwkm/",
              "text": "This is a massive misunderstanding. Look at the average salary stats put out by colleges, it’s practically the sam amongst every t80 school. It really doesn’t matter, what matters is you out in your best work and do what feels right, not what is “the best”",
              "author": "DashUni",
              "created": 1583720802,
              "upvotes": 95,
              "replies": {
                "fjzj1pt": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzj1pt/",
                  "text": "I hope you know that by interacting with smarter people around you will constitute your drive to become more successful. This is why going to a top school matters, it’s not the education that you receive there, but rather, the connections you make.",
                  "author": "Kushbogga",
                  "created": 1583720899,
                  "upvotes": -89,
                  "replies": {
                    "fjzjjp4": {
                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzjjp4/",
                      "text": "Connections r important ur right, however, to say that going to a non t20 renders not getting good connections is simply false. If that were to be true there would be no successful people from t20s",
                      "author": "Mikrill_in_october",
                      "created": 1583721234,
                      "upvotes": 64,
                      "replies": {
                        "fjzjqfu": {
                          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzjqfu/",
                          "text": "I never said that going to a non t20 school will render you no good connections. I am stating that going to a T20 school will increase getting new and better connections due to the people who you interact on a daily basis",
                          "author": "Kushbogga",
                          "created": 1583721356,
                          "upvotes": -63,
                          "replies": {
                            "fjzkjiv": {
                              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzkjiv/",
                              "text": "Bro, I feel bad for you for having that mindset. Working hard in high school so u can get into the college that’s right for you at a stress level you can manage is fine, working your ass of and having no life just to go to a school with the “T20” title is not. You will end up hating yourself for it. There are tons of people who don’t go to T20 schools because it’s not the right fit for them and then they end up way better off and more successful than the kid who got extremely mentally damaged for taking on a workload they couldn’t handle.",
                              "author": "OGSHAGGY",
                              "created": 1583721903,
                              "upvotes": 41,
                              "replies": {
                                "fjzlvz9": {
                                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzlvz9/",
                                  "text": "The journey for my success isn’t an easy one, and I’m not going to make it easier on myself just to fit into the crowd. I have goals, dreams, and aspirations to achieve. I want to stand on the top of the finance world. I want to retire by 28. I want to become a millionaire. I want to continue to grow exponentially in my own way regardless of the mental struggles that fall upon me. \n\nIf I come to hate myself along the process, then so be it. However, my self-confidence is not that small for me to reach that stage (hopefully).",
                                  "author": "Kushbogga",
                                  "created": 1583722858,
                                  "upvotes": -11,
                                  "replies": {
                                    "fjzszjh": {
                                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzszjh/",
                                      "text": "Man stfu lmao, if u gonna have \"mental struggles\" then what even is the point of achieving all that shit. If you're gonna hate yourself by the time you get there and you know it then you should also know that when u get up there ur not gonna feel any amount of happiness and just say to yourself \" Dam, I rly wasted my life on this\"",
                                      "author": null,
                                      "created": 1583728429,
                                      "upvotes": 25,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "fjzmx2n": {
                              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzmx2n/",
                              "text": "Well, theres an inherent dilemma in choosing between \n\nA. being steeped in relative mediocrity among self-styled geniuses at a top 20 school or \n\nB. Rising to utmost prominence both socially and academically at an \"average\" school with \"average\" people\n\nAverage people constitute the vast majority of our nation, so coming out on top of a school full of em is valuable in its own sense. Making friends with the eggheads nerdos has its own merits, too. Thing is, the %of the currently successful population who graduated from T20 schools is infinitesimally smaller than the % of those who are currently successful and are alumni from \"average\" schools. \n\nYou can have your own opinion, but the real difference between getting into a state/city school and going to Brown isn't exactly life-changing, per se. Not to mention that for every successful Harvard graduate there's 3 who completely fall below expectations... Geniuses and smart people are a hit or miss type of crowd in general.",
                              "author": "Frostbrine",
                              "created": 1583723617,
                              "upvotes": 12,
                              "replies": {
                                "fjzo2cm": {
                                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzo2cm/",
                                  "text": "I totally agree with you. There is merit in both options. However, please keep in mind the social aspect of things. Majority of people that go to an “average” school do not have the mindset of rising to the top (as they were probably not trying in highschool either). Finding a friend group in such schools with the same goals as you would be quite hard, not saying it’s impossible, but a little harder than a school with prestige.",
                                  "author": "Kushbogga",
                                  "created": 1583724468,
                                  "upvotes": -4,
                                  "replies": {
                                    "fk0axgw": {
                                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0axgw/",
                                      "text": "Lmao I think you’re just upset with your current school and just going on about the grass is greener trope. I just want to let you know, that based on what you’ve said previously, I absolutely see and understand why you think that way, and for some part of it you’re right. If you wanted to get into let’s say investment banking, if you’re not at a target, it really is tough luck and networking. For almost all other highly competitive careers (tech, medicine, law, engineering), there is no such real thing as target, since they’re looking through school applications and the opportunity cost of them spending time on evaluation is way lower, or they simply have other metrics to evaluate people on (technical interviews, gpa, standardized tests)\n\nIt seems like you’re gunning for a career in IB or some desk job, or something finance related, I can’t tell you that you won’t love it and that’ll you won’t be come wildly rich. What I can tell you is that you are tunnel visioning in a field where it’s a literal rat race to the bottom. What you’re thinking applies to a very niche subset of people where connections will actually be required for anything. Most other careers rely on so many other metrics while finance and business is literally prestige + stat padding your resume.\n\nI think two things are going on here.\n\n1) you’re massively overrating the quality of kids at these institutions. Majority of these kids will either be legacy or rich as hell and party all the time (all t20s aside from engineering have huge party scenes) or will be other normal ass kids who happen to be pretty good at school. I go to a t20 (t21 if you wanna shove a stick up my ass, and it’s in the same state I’m presuming you’re in) and I have noticed that there are three types of kids. Kids who are pretty smart but party a lot and go out a lot (like maybe 1/4 of the class). Kids who study their ass off, grinding to be the best, and are the types of connections you’re imagining (maybe another 1/4). And the other half of normal kids who try to take a balanced approach. \n\nThe upper echelon of kids are everywhere basically t-100. It’s just a matter of how large they are in respect to the rest of the class. If you really work that hard, you’ll find yourself among that group. Doesn’t matter where.\n\n2) if you’re gunning for financial freedom, and retirement by age 28 and ruling the finance world, you have a long way to go buddy. Maybe the idea of target schools have made you jaded, but there are plenty of schools you probably haven’t heard of that are very respectable in certain fields (e.g. Rochester institute of technology for engineering, Williams university for math, University of Delaware for ChemE). And they probably have just as bright, if not brighter kids in their programs than t20s. I picked the school I went to irregardless of rank, but rather quality of life, novelty of the experience, and importantly if I fit in with the program and culture. And that’s what I advise most people to do. Look for the school that’s best in your desired field. If you don’t know, pick the school that’s best for undergraduates as a whole. Places like Harvard and Columbia don’t give a shit about undergrads since they don’t bring in research dollars (they’re still great programs, but if you’re trying to optimize undergrad experience, it’s not the place). There’s a lot more that goes into it then just the ranking of some website or bank.\n\nYou really just gotta chill. If you derive enjoyment from working hard and grinding to the top, you are certainly lauded to do so. I hope you do find success in finance and are able to retire by age 28 (shit I hope I do too).  But what I will tell you is that if you’re going to give advice out on this sub, realize that the stress of someone grinding for t20 connections may be literally worthless to them if they’re not going to utilize them. For somethings like med school, they’re not nearly as important as they are for business. \n\nSo you can say “for me and my career goals, it absolutely makes sense for me to want to go to a t20 and if your goals align with mine, here are my reasons why”\n\nBut you can’t say “there is absolute value in going to a t20 due to the connections you’ll make and the drive of the people to succeed”. That’s just simply not true for all disciplines or even all career goals.",
                                      "author": "SupahWalrus",
                                      "created": 1583750290,
                                      "upvotes": 7,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "fjzk8ks": {
                              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzk8ks/",
                              "text": "And I respectfully, disagree completely with that statement. Maybe “more” or “different” connections but the idea that there are exponentially greater experiences/connections to be had a t20 is false. I think you also forget that being top dog at a non t20 can also be extremely powerful(and in that come amazing connections too)",
                              "author": "Mikrill_in_october",
                              "created": 1583721694,
                              "upvotes": 12,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fk0g328": {
                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0g328/",
                      "text": "Buddy if you really want connections go to any big SEC or ACC school and join a fraternity. Fuck a top 20",
                      "author": "Jakesandose",
                      "created": 1583755825,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fjzjmzs": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzjmzs/",
              "text": "Success doesn’t even need to be measured in the amount of money made or the education gained. For some, just being happy can be defined as success. Honestly, what college someone goes to has no correlation to their “success”",
              "author": null,
              "created": 1583721294,
              "upvotes": 19,
              "replies": {
                "fjzkxz0": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzkxz0/",
                  "text": "I agree, everyone has there different opinion on success. I am simply stating my definition of success. Brought up in a strict family, I grew up with a different mindset. This mindset will hopefully take me to newer heights. Sure, you can state that being happy is success, but personally, I would rather set my goals of “success” higher than what others would normally achieve. \n\nAgain, this is just my take on success, I’m not here to start an argument",
                  "author": "Kushbogga",
                  "created": 1583722182,
                  "upvotes": -3,
                  "replies": {
                    "fjzlqfp": {
                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzlqfp/",
                      "text": "Exactly, you said it yourself, its “[your] definition of success.” But that cannot be applied to everyone. I think the reason you are being so heavily downvoted is because your original comment sounds like you are implying that the only way to gain success is by going to a good college, getting a good job, making money, you get the point. \nThat being said, your definition of success is no less valid than anyone else’s, but it’s not more valid either. Props to you though for having a strong mindset and I hope you achieve everything you set out to. Stay motivated, cheers!",
                      "author": null,
                      "created": 1583722747,
                      "upvotes": 16,
                      "replies": {
                        "fk2wffm": {
                          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk2wffm/",
                          "text": "Well, “To be happy to go to state school” is definitely good and it sounds right to 99% users in this sub, but just not for everyone. This man’s point of view is for sure something we lack of, why don’t we listen to him, but don’t downvote so much?",
                          "author": "u_sandhawk",
                          "created": 1583810814,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fjzryfj": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzryfj/",
              "text": "Many of you are right, but I think some of you guys need to chill. This user is just voicing his opinion (as are most people on reddit) and to some extent connections are very important. Although non-t20s have many valuable connections (many of which lead to non-t20 students making the same salary if not more than a t20 student), it is true you can find a greater number of professional connections at t20 institutions. Once again, just my humble opinion.",
              "author": "chemgod48",
              "created": 1583727532,
              "upvotes": 6,
              "replies": {}
            },
            "fk2w2re": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk2w2re/",
              "text": "I hate when people are downvoted because they say the fact that are politically incorrect.",
              "author": "u_sandhawk",
              "created": 1583810564,
              "upvotes": 2,
              "replies": {}
            },
            "fjzjxvh": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzjxvh/",
              "text": "[removed]",
              "author": null,
              "created": 1583721499,
              "upvotes": -6,
              "replies": {}
            }
          }
        }
      }
    },
    "fjyuf04": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyuf04/",
      "text": "that's not cool. to be real though, people that care enough to go on reddit to talk about college admissions are a self-selected group. they're mostly the kids that aspire to T20s or flagship state schools. it's just the nature of the beast.\n\nand expect haters on all posts you make unless you're awarded with a special flair. until i got off my \"old\" flair, i got a lot of bruh and ok boomer responses and threats on my PMs. ever since i got my newer flairs, those have stopped. internet behavior can be terrible so it's not necessarily you, it's just bad manners and stupidity. there's also the herd mentality. \n\nsometimes it takes multiple instances of getting triple digit downvotes to build your sense of self and realize that some people on here will never learn.\n\nstay true to you dude. who cares what some of the misguided kids think?",
      "author": "icebergchick",
      "created": 1583704803,
      "upvotes": 232,
      "replies": {
        "fjyumn4": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyumn4/",
          "text": "Entirely true and fair. Iceberg chick comes through w the wisdom once more!",
          "author": "okay-boomerang",
          "created": 1583704932,
          "upvotes": 69,
          "replies": {}
        },
        "fjzeynv": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzeynv/",
          "text": "Correct.",
          "author": "spiritcrusher77",
          "created": 1583718150,
          "upvotes": 11,
          "replies": {}
        },
        "fjzcoq3": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzcoq3/",
          "text": "Bruh. Ok boomer.",
          "author": "IamUnremarkable",
          "created": 1583716630,
          "upvotes": -64,
          "replies": {
            "fjzig9h": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzig9h/",
              "text": "Username checks out",
              "author": "TheBissin",
              "created": 1583720494,
              "upvotes": 34,
              "replies": {}
            },
            "fjzzurz": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzzurz/",
              "text": "Yes I see how unremarkable you are.",
              "author": "JyChoi25",
              "created": 1583735488,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "fjzfg2c": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzfg2c/",
      "text": "I agree, this reddit is just a stage for shut in dweebs to get validation by flexing their stats and academics and all that they've achieved in high school by sacrificing everything else in between... smh",
      "author": "Rugsssss",
      "created": 1583718473,
      "upvotes": 61,
      "replies": {
        "fk0pooh": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0pooh/",
          "text": "Agreed, but \"lying their stats and academics\" would probably be more accurate.",
          "author": "fabroca475",
          "created": 1583763291,
          "upvotes": 7,
          "replies": {
            "fk0wic2": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0wic2/",
              "text": "LMAO yes",
              "author": "Rugsssss",
              "created": 1583767694,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fjzodkh": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzodkh/",
      "text": "Also, this might be out of topic, most T20s school aren’t necessarily good. Some of you will be “but , why? Wow this guy is dumb”. Well I’m going into engineering, most of the T10 schools for engineering aren’t even there. I got into Purdue #8 and it’s no where near close the T20’s.",
      "author": "Cocorello_",
      "created": 1583724709,
      "upvotes": 18,
      "replies": {
        "fk00gbj": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk00gbj/",
          "text": "[deleted]",
          "author": null,
          "created": 1583736198,
          "upvotes": -23,
          "replies": {
            "fk0avye": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0avye/",
              "text": "lmao wtf...the top tech companies recruit at schools like Purdue, UIUC, UT Austin, and UW cuz they're T10 for CS, eventhough overall they're not T20s.",
              "author": "Klays_Dealer",
              "created": 1583750238,
              "upvotes": 10,
              "replies": {
                "fk0ayr7": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0ayr7/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1583750336,
                  "upvotes": -13,
                  "replies": {
                    "fk0gpzb": {
                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0gpzb/",
                      "text": "And that means that program prestige is what matters, because that's what companies look for.",
                      "author": "BelugaBunker",
                      "created": 1583756416,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fk1vptn": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk1vptn/",
              "text": "Why would you want a worse education?\n\nEdit: why would you want a worse education just because of name-brand value*\n\nObviously there are many factors outside education quality that are important",
              "author": "Bulbasaur2000",
              "created": 1583787804,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fjymslq": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjymslq/",
      "text": "On behalf of everyone nice one here, I would like to say, we are SO SO SO SO SORRY. While online communities like this offer so many great resources, it also allows people to show their true, ugly self. I wish people would be more understanding & open-minded about others, but people are nonetheless quick to judge. \n\nTo all the people who did this person wrong: karma’s a bitch. With your fucking rude personality, you ain’t getting ANYWHERE in life without daddy’s money. Sorry, thems the rule.\n\nand i oop-🤭",
      "author": null,
      "created": 1583700129,
      "upvotes": 102,
      "replies": {
        "fjyn4xb": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyn4xb/",
          "text": "Facts. I’m tryna give back to the community thhats helped me out so much, and when it comes down to it people here are more kind and helpful than they ever have been mean.",
          "author": "okay-boomerang",
          "created": 1583700344,
          "upvotes": 15,
          "replies": {
            "fjynh5h": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjynh5h/",
              "text": "[deleted]",
              "author": null,
              "created": 1583700550,
              "upvotes": 1,
              "replies": {
                "fjyol9o": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyol9o/",
                  "text": "I hope they don’t fall into depression. As a depression survivor myself, I really wouldn’t wish it on anyone, ever. I do hope they somehow come to understand that there’s more out there than where you go to undergrad.\n\nI had that same realization at my elite high school in freshman year before transferring as a sophomore. It’s ass. But it has to be learned.",
                  "author": "okay-boomerang",
                  "created": 1583701230,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fjzidky": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzidky/",
      "text": "A2T20s sounds like a Star Wars droid",
      "author": "spoonVEVO",
      "created": 1583720443,
      "upvotes": 18,
      "replies": {}
    },
    "fjzcm6f": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzcm6f/",
      "text": "It's ridiculous how much we forget about enjoying the high school experience and mainly to not even stress. I found your post to be informative and helpful, so props to you.",
      "author": "skarrly",
      "created": 1583716582,
      "upvotes": 14,
      "replies": {}
    },
    "fjzp0cy": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzp0cy/",
      "text": "honestly I feel that. I got accepted to my top school, but because it wasn't a t20 I didn't even make a post because I didn't want to get made fun of or something. its like I doesn't even really matter what you want. :(",
      "author": "natgochickielover",
      "created": 1583725183,
      "upvotes": 14,
      "replies": {}
    },
    "fjzpsmz": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzpsmz/",
      "text": "You know what they say, college is what you make of it. A big name might help but a toxic person at a t20 would still be a toxic person at a community college.",
      "author": "copypasteme",
      "created": 1583725791,
      "upvotes": 10,
      "replies": {}
    },
    "fjz49gq": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjz49gq/",
      "text": "Some people are jealous of the fact that you can succeed without dying of stress.",
      "author": "GreenConclusion",
      "created": 1583711041,
      "upvotes": 31,
      "replies": {
        "fjz565d": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjz565d/",
          "text": "Honestly fax. Like u rlly don’t need to kill urself with stress to meet your goals.",
          "author": "okay-boomerang",
          "created": 1583711635,
          "upvotes": 9,
          "replies": {
            "fk1k8yp": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk1k8yp/",
              "text": "My plan is to go to community college then transfer to local small four year, THEN go to a great school for my masters. Easy, stress free, and the music programs are fantastic around where I live (looking to be a musician). And, to top it all off, very affordable!",
              "author": "bassbehavior",
              "created": 1583781364,
              "upvotes": 2,
              "replies": {
                "fk1m16e": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk1m16e/",
                  "text": "Dope plan dude. I live in Nyc, so we have CUNYs which rocks!",
                  "author": "okay-boomerang",
                  "created": 1583782387,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fk01kks": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk01kks/",
      "text": ">in class\n\n*Hey, I'm a really intelligent fella!*\n\n>on A2C\n\n*Holy fuck I'm inadequate...*",
      "author": "RareLemons",
      "created": 1583737545,
      "upvotes": 8,
      "replies": {
        "fk13nus": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk13nus/",
          "text": "You’re still an intelligent fella :)",
          "author": "sstarbomb",
          "created": 1583771741,
          "upvotes": 2,
          "replies": {
            "fk140zd": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk140zd/",
              "text": "No most certainly not!\n\nNot going to an Ivy = borderline retardation.",
              "author": "RareLemons",
              "created": 1583771954,
              "upvotes": 3,
              "replies": {
                "fk1w3ge": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk1w3ge/",
                  "text": "Out of 10 colleges I applied to only one is an Ivy. You're not stupid.\n\nAlso most great schools aren't Ivies anyway.",
                  "author": "Bulbasaur2000",
                  "created": 1583788022,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fk01a9r": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk01a9r/",
      "text": "This subreddit is so useful, yet so discouraging. It's always a punch in the gut to see someone going somewhere that you could never get into. Who really cares tho, once you've actually started freshman year?",
      "author": "RareLemons",
      "created": 1583737199,
      "upvotes": 7,
      "replies": {}
    },
    "fjzia3n": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzia3n/",
      "text": "I go applied to a decent university that tuition isn’t so high because I’m not trying to drown in 100k+ student debt. The universities where I live aren’t even that great except for maybe one but the commute is not worth it. Apply to whatever you think is best, at the end of the day unless your job puts emphasis (majority don’t) on your school name then it’s not going to matter. What’s going to matter is your skills and degree.",
      "author": "sadxtortion",
      "created": 1583720380,
      "upvotes": 6,
      "replies": {}
    },
    "fjzkajj": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzkajj/",
      "text": "Yeah I got into multiple schools that are decent well known schools on tons of merit money already(penn state, loyola, Gonzaga, etc.) already and only my safeties have come out. Meanwhile, I didn’t overburden myself at all and was pretty stress free throughout high school. I also got a likely letter from a T40 and am applied to two T20s. I didn’t do IB, I didn’t take 40 APs, I took I think 9 or 10 throughout all of high school, I didn’t study for standardized tests, and I did 1-2 hrs of hw max everyday. I had fun w friends, I played video games, I played sports, etc. and didn’t lull myself over school. People need to stop putting so much stress on themselves. It’s not healthy.",
      "author": "OGSHAGGY",
      "created": 1583721732,
      "upvotes": 8,
      "replies": {}
    },
    "fjymgud": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjymgud/",
      "text": "Dude I feel you but at the same time it was one guy who critized you and his comment got 2 upvotes... just ignore and move on",
      "author": "bobscash",
      "created": 1583699921,
      "upvotes": 21,
      "replies": {
        "fjymmm8": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjymmm8/",
          "text": "I know that, but it’s something that’s happened before here, and has happened in more arenas than just this particular post. Hence the title.",
          "author": "okay-boomerang",
          "created": 1583700025,
          "upvotes": 9,
          "replies": {}
        },
        "fjynj0t": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjynj0t/",
          "text": "One dude is one too many.",
          "author": null,
          "created": 1583700582,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fjzajpi": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzajpi/",
      "text": "These kids don’t know the true meaning of life. They’re just robots and haven’t been happy in years. They prey on other people’s insecurities to be satisfied in stroking their immense ego’s. You simply have to ignore them, and sooner or later, they’ll cringe at their old self.",
      "author": "hersh123123",
      "created": 1583715188,
      "upvotes": 13,
      "replies": {}
    },
    "fjzlpf0": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzlpf0/",
      "text": "Yeah ngl there's definitely a bit of gatekeeping on this sub. Idk if that's what you'd call it but it's the closest think I can think of rn",
      "author": "Dutch_Windmill",
      "created": 1583722725,
      "upvotes": 7,
      "replies": {}
    },
    "fk0egi8": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0egi8/",
      "text": "Those are the types of kids who only do extracurricular based on what they think colleges want, not what they actually enjoy",
      "author": "fryfry55",
      "created": 1583754242,
      "upvotes": 3,
      "replies": {}
    },
    "fk0h8nk": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0h8nk/",
      "text": "Applying to college brings out the worst insecurities in some people, and the way they work that out is by trying to identify how other people have failed, either in their high school course or EC choices, their college search, eventual enrollment decisions, choice of major, career aspirations.  \n\nThey will critique these things while maintaining that they're just being \"honest\" and that it's tough love, etc etc.   But this is a smokescreen for their need to feel like they've got it all figured out.\n\nAnd for every person who can't stop themselves from putting down their peers for their choices, there are hundreds who will upvote it.  It is the worst thing about what can otherwise be a very cool and interesting subreddit.\n\nThere are millions of college students in the U.S.  They can't all go to a Top 20 school, they can't all major in finance, and they can't all work on Wall Street.  And it is 100% valid to have aspirations to do otherwise.",
      "author": "FeatofClay",
      "created": 1583756879,
      "upvotes": 3,
      "replies": {}
    },
    "fjzofaa": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzofaa/",
      "text": "While it does suck to get negative comments and they are not acceptable under any circumstances, this subreddit is pretty much “applying to T30s” more than “applying to college”\n\nKids who are applying to schools other than the big name schools we always see on here aren’t really in need of this subreddit. \n\nFor example I applied to Iowa State because 90% of my school is going there and I wanted to see what the fuss was all about. I put my name down on the common app, payed the fee and got accepted like 4 hours later, and bam that was the end of “applying to college”. No essays, no interviews, no nothing.\n\nMy other schools, Cornell and Rice for example, asked for essays, interviews, subject tests, etc... pretty much all the stuff that people ask about on here. So while it’s totally not okay to get hate comments about where you are going and how you got there, keep in mind that this subreddit is more for those high achievers. Think r/chanceme and r/SAT but a little more toned down",
      "author": "Diddythekid",
      "created": 1583724746,
      "upvotes": 4,
      "replies": {
        "fk0q765": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0q765/",
          "text": "Nah, I agree that in the other subreddits you listed people don't hate on each other as much but they list overinflated scores and stats so I would argue that it is just as intimidating as commenting there.",
          "author": "fabroca475",
          "created": 1583763640,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fjz237o": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjz237o/",
      "text": "the people who are like that and act like the biggest measure of success is getting into the most prestigious colleges are the same ppl who are doomed for failure in the real world",
      "author": "janesequence",
      "created": 1583709612,
      "upvotes": 5,
      "replies": {}
    },
    "fjzjhwk": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzjhwk/",
      "text": "the fact that you made it through stress free is amazing! everyone’s on their own journey and there isn’t one that’s better than any other. plus what authority does some teenager on reddit have to determine your metrics of success? keep living your life dude fuck all that shit",
      "author": "wormio69",
      "created": 1583721201,
      "upvotes": 2,
      "replies": {}
    },
    "fjzm4ox": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzm4ox/",
      "text": "and everyone measures success differently so even if by some stretch of the imagination getting into a t20 _was_ better, it still isn’t what everyone is looking for. some people just want the college experience, some people want to go for a good job (which you can get no matter where you graduate from), some people want good parties, and some people want bragging rights. if you’re seeking bragging rights then by all means apply to t20s but that’s not what everyone wants",
      "author": "criminalsquid",
      "created": 1583723035,
      "upvotes": 2,
      "replies": {}
    },
    "fjzp0b4": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzp0b4/",
      "text": "I agree. I applied to 12 schools in august — mostly state schools and i was alright. I got accepted to the top public school for my major and i’m happy about that.",
      "author": "PM_ME_UR_TASTY_PICS",
      "created": 1583725182,
      "upvotes": 2,
      "replies": {}
    },
    "fjzrhg7": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzrhg7/",
      "text": "I mean like the idea that a smart kid who doesn't challenge herself as much can enjoy high school / life and still turn out ok (not just in college)isn't really a new idea, peeps just don't like it. A ton of effort can bring about only marginal gains and it takes self awareness to step back sometimes\n\nthat shaming shit is uncool tho and not definitely not a2c vibe, so I feel for you on that",
      "author": "ikmZ62T3Vs",
      "created": 1583727144,
      "upvotes": 2,
      "replies": {}
    },
    "fjzwl5q": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzwl5q/",
      "text": "Yup",
      "author": "collegeapplyhobo",
      "created": 1583731891,
      "upvotes": 2,
      "replies": {}
    },
    "fk0aclt": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0aclt/",
      "text": "some of the comments on this shit are so yikes. just accept that it’s rude to say shit like “you can’t get into any T20s you have terrible stats”. there’s a difference between being realistic and just being a dick— at the end of the day, you *don’t* know what T20s may want. you can’t exactly look at someone’s stats and say for 100% sure that they have no shot. there’s a couple of posts on here about people who got into T20s with stats that weren’t A2C perfect. \n\nand even so, there’s nothing wrong with going to a safety or a “lesser” school! you might even get a better experience than if you went to an endlessly competitive school like Harvard. \n\nthis sub should be about support.",
      "author": "MySirenSongForYou",
      "created": 1583749527,
      "upvotes": 2,
      "replies": {}
    },
    "fk1n72r": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk1n72r/",
      "text": "I am going to a LAC ranked in the T30 but..... i feel you so hard. It was my reach school and even saying that made me feel mediocre bc everyone on here is HYSPM this and Ivy that. \n\nIt’s exhausting to read some of these grades too, like do y’all ever give yourselves a little break?",
      "author": "chickenmcnugggets",
      "created": 1583783047,
      "upvotes": 2,
      "replies": {
        "fk1najf": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk1najf/",
          "text": "EXACtly! And what school if u don’t mind? I’m looking at lots of LACs",
          "author": "okay-boomerang",
          "created": 1583783101,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fk6okml": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk6okml/",
      "text": "Right! This is not College Confidential. Goddamn that site was toxic asf",
      "author": "youthslipping",
      "created": 1583909346,
      "upvotes": 2,
      "replies": {}
    },
    "fjzmyhj": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzmyhj/",
      "text": "My two kids also went through high school stress-free and ended up in two T30’s, plus another handful of great schools including Penn State, Villanova and Va Tech.  Took around 7 AP’s in classes they enjoyed, had three EC’s that they loved and continue to do two years later as college sophomores.  Dad was a double-Ivy, but he was admitted in the days before the common app when you applied to one ivy that was a good fit and otherwise went on with your life.  We had no interest in encouraging our kids to go the T20 route even though they had great GPA’s and test scores.  We wanted them to enjoy their high school years, travel, hobbies, and time with friends and family.",
      "author": "HappyCava",
      "created": 1583723646,
      "upvotes": 3,
      "replies": {}
    },
    "fk0tt2g": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0tt2g/",
      "text": "Just don't give a fuck about random people on the internet </thread>",
      "author": null,
      "created": 1583765994,
      "upvotes": 1,
      "replies": {}
    },
    "fk0yzgf": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk0yzgf/",
      "text": "Eww the stupidity of some people. Don't even worry about them.",
      "author": "melinapeerl",
      "created": 1583769196,
      "upvotes": 1,
      "replies": {}
    },
    "fk15ih7": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk15ih7/",
      "text": "Don’t let them get to you. I got in to my dream school, which is a public college in nyc (I live in nyc), people in my high school consider my dream college as a safety school. Even though I got in to some private universities and even some out of state universities, I know I can’t afford them, and I don’t want to have a lot of student loans, and that’s okay with me.",
      "author": "nyc_idk",
      "created": 1583772819,
      "upvotes": 1,
      "replies": {
        "fk18td6": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk18td6/",
          "text": "I live in nyc too! CUNYs are awesome and I hope you have a great time. I’m very seriously considering Baruch!",
          "author": "okay-boomerang",
          "created": 1583774741,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fka29lf": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fka29lf/",
      "text": "The hero we need but don’t deserve",
      "author": "EpicGamesLauncher",
      "created": 1583990006,
      "upvotes": 1,
      "replies": {}
    },
    "fjyow2j": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyow2j/",
      "text": "[deleted]",
      "author": null,
      "created": 1583701417,
      "upvotes": -4,
      "replies": {
        "fjyqig5": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyqig5/",
          "text": "I don’t see anything that pointed to me saying you could get into a t20. That’s all projection on both your and the commenters part tbh, as I said I’m just happy where I am, not that I’ve gotten into ivies or whatnot. In all the post, title, comment replies, etc., nothing I said pointed to that implication.",
          "author": "okay-boomerang",
          "created": 1583702414,
          "upvotes": 14,
          "replies": {}
        },
        "fjyqoes": {
          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyqoes/",
          "text": "This sub is absolutely not for ppl applying to t20s btw. I’ve gotten so much out of this sub with absolutely no desire to go to a t20. There’s applying to ivy subs, and such.",
          "author": "okay-boomerang",
          "created": 1583702515,
          "upvotes": 6,
          "replies": {
            "fjyrz4y": {
              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyrz4y/",
              "text": "[deleted]",
              "author": null,
              "created": 1583703319,
              "upvotes": -12,
              "replies": {
                "fjyucfd": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyucfd/",
                  "text": "I don’t have a desire, I applied to all three of those on a whim right before the deadlines bc why the hell not. I’m going to Binghamton next year whether I get in there or not.",
                  "author": "okay-boomerang",
                  "created": 1583704760,
                  "upvotes": 6,
                  "replies": {
                    "fjzk9i3": {
                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzk9i3/",
                      "text": "then why would you apply...",
                      "author": "marketarian",
                      "created": 1583721711,
                      "upvotes": -2,
                      "replies": {
                        "fjzkbgz": {
                          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzkbgz/",
                          "text": "What do I have to lose?",
                          "author": "okay-boomerang",
                          "created": 1583721750,
                          "upvotes": 3,
                          "replies": {
                            "fjzkdkj": {
                              "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzkdkj/",
                              "text": "application fees, time spent writing essays...",
                              "author": "marketarian",
                              "created": 1583721790,
                              "upvotes": -3,
                              "replies": {
                                "fjzkit6": {
                                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzkit6/",
                                  "text": "The essays were fun! I did it like a challenge. Gave myself 24 hours. Fees waived!",
                                  "author": "okay-boomerang",
                                  "created": 1583721890,
                                  "upvotes": 3,
                                  "replies": {
                                    "fjzkkcq": {
                                      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzkkcq/",
                                      "text": "um ok lol",
                                      "author": "marketarian",
                                      "created": 1583721918,
                                      "upvotes": -5,
                                      "replies": {
                                        "fjzks72": {
                                          "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjzks72/",
                                          "text": "What? I was just vibing",
                                          "author": "okay-boomerang",
                                          "created": 1583722068,
                                          "upvotes": 4,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fjyujna": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fjyujna/",
                  "text": "I don’t think I emphasized any desire to chase prestige. Just because I applied to skme prestigious schools doesn’t mean at all that I spent my entire hs career trying to get into them, or that I’m set on going to one. \n\nAnd if they interpreted that, it’s on them not me. I never said any of that, and that’s a whole lot of reaching to do.",
                  "author": "okay-boomerang",
                  "created": 1583704882,
                  "upvotes": 2,
                  "replies": {}
                },
                "fk5ebzn": {
                  "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk5ebzn/",
                  "text": "\"There’s people who prioritize prestige and there are the people that prioritize mental health. You can’t have both.\" \n\nI'm sorry, but excuse me?\n\nLet's clarify some misconceptions.\n\nI applied to several t20s, and there are many things wrong with your statement above. First of all, although prestige is a factor, inevitably, it is merely a microcosm of the reasons why I chose to apply. Most of us educated college applicants would not risk wasting the four most crucial years of our lives attending a school we do not even think we will fit in. That's a waste of time and money. Therefore, the majority of t20 applicants heavily research their potential schools, visit campus if financially possible, and demonstrate interest. I am sure most other t20 applicants, especially this sub, can agree with me.\n\nFurthermore, implying that all t20 applicants are \"anxiety-ridden pretentious prestige-whores who don't care about their mental health\"  is just as prejudiced as calling all non-t20 applicants \"lazy underachievers\". \n\nAs a final caveat, my mental health is great, and I have been described as \"infallibly put-together\" by my peers, and even one of my college interviewers noted it! Yes, I acknowledge that I get stressed and sad sometimes (as is human), but not to the extent of a clinical diagnosis. It is a minority of people who have clinical depression/anxiety/etc, and of those individuals, they were most likely already mentally ill to begin with, not because of college apps. \n\nIt is natural to be stressed, but I and the vast majority of t20 applicants have coping strategies regarding this. Personally, if I knew I was not mentally stable, I would not be applying to t20s because mental health is incredibly valuable and I cherish it.\n\n I am sure some people are clinically anxious and depressed, but stating that ALL t20 applicants do not take care of, or prioritize, their mental health is a grossly prejudiced misgeneralization.\n\nThe vast majority of t20 applicants are diligent, resilient, and intelligent people. Do not downplay their merits by generalizing them as mentally unstable prestige seekers. That is unfair and offensive.",
                  "author": "vanillacrepe",
                  "created": 1583878768,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fk00mmy": {
      "link": "/r/ApplyingToCollege/comments/ffiltt/bruh_yall_gotta_remember_this_is_applying_to/fk00mmy/",
      "text": "Wow, they’re just jealous that someone is happy while they’re not. You’re doing great and I wish I could learn from you too. I really need to live my life more stress- free",
      "author": "Reginayoga",
      "created": 1583736403,
      "upvotes": 0,
      "replies": {}
    }
  }
}