{
  "sid": "qk81ee",
  "link": "/r/ApplyingToCollege/comments/qk81ee/how_do_i_get_started_researching_colleges/",
  "title:": "How do I get started researching colleges?",
  "text": "I'm almost halfway through 11th grade (idk what that is in american). I have no idea about colleges and what my dream school is. Not even sure what I want to apply in. I'm interested in business and tech and wanna do something fintech related. How do I start researching colleges. There's so many different variables and so many different things to do it all seems so huge from the outside. Please help me get started researching.",
  "author": "adityaagarwal_2105",
  "created": 1635747973,
  "updated": 1635777468,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiuz1mw": {
      "link": "/r/ApplyingToCollege/comments/qk81ee/how_do_i_get_started_researching_colleges/hiuz1mw/",
      "text": "It gets easier once you just sit down for a few hours and start to research. Sounds like you’re international so I would start by narrowing down the country (since idk if you wanna apply to American schools) if you do, start by looking at the things you want in a college. It’s as simple as looking up “schools with good business/tech majors”. You could also research based on financial aid, size, wether it’s public or private, liberal arts college or research. You’re right, there are a lot of factors but once you start to get the hang of finding the info you need quickly you can start eliminating a lot of schools quickly and get down the ones you love.",
      "author": "meo6",
      "created": 1635751663,
      "upvotes": 1,
      "replies": {}
    },
    "hiuz980": {
      "link": "/r/ApplyingToCollege/comments/qk81ee/how_do_i_get_started_researching_colleges/hiuz980/",
      "text": "start looking at different colleges daily (it’s easier if you start chiseling things off rather than cram everything later on)! it can be just searching a college you’ve heard of, looking at the programs they offer, and then writing down some notes (spreadsheets are super useful). i find using the nces college navigator really helpful with narrowing down what colleges are best for the majors im interested in. as long as you start somewhere, you can slowly start seeing what specific characteristics you like.",
      "author": "etgaudium",
      "created": 1635751868,
      "upvotes": 1,
      "replies": {}
    }
  }
}