{
  "sid": "r3q58o",
  "link": "/r/ApplyingToCollege/comments/r3q58o/question_about_personal_insight_question/",
  "title:": "Question About Personal Insight Question",
  "text": "Prompt 3\nWhat would you say is your greatest talent or skill? How have you developed and demonstrated that talent over time?\n\nI can’t decide which to write about and how I could possibly expand on each.\n\n1. Handwriting - I’ve always been complemented on my neat handwriting. Teachers have always kept my work because of it and some have even paid me to keep my class work. I don’t know what else I would write other than that.\n\n2. Ability to listen - I like to make people feel like they’re the only one in the room. I give everyone my full attention and respect. I’ve also been told I’m a good listener.\n\n3. Organized - I used to be a disorganized person but through time I’ve learned to organize my things. I would lose everything, spend hours looking for things and now everything around me is in order.\n\nThanks for your help!",
  "author": "I_Am_McLovin007",
  "created": 1638056404,
  "updated": 1638205524,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmc3jj8": {
      "link": "/r/ApplyingToCollege/comments/r3q58o/question_about_personal_insight_question/hmc3jj8/",
      "text": "1 looks like talent - the question, where do you want to take this talent? Have you furthered this talent?",
      "author": "svday",
      "created": 1638056899,
      "upvotes": 1,
      "replies": {
        "hmc7e6l": {
          "link": "/r/ApplyingToCollege/comments/r3q58o/question_about_personal_insight_question/hmc7e6l/",
          "text": "Well, I learned how to write in cursive and I’ll usually switch between that and script writing. I also learned calligraphy and do most of my writing on a notebook I keep. I’ve also done some canvas paintings, but it isn’t something I often do. I’m not sure if that last one would help.",
          "author": "I_Am_McLovin007",
          "created": 1638058634,
          "upvotes": 1,
          "replies": {
            "hmcjzvh": {
              "link": "/r/ApplyingToCollege/comments/r3q58o/question_about_personal_insight_question/hmcjzvh/",
              "text": "This is very good talent - expand on it in great detail - nothing is trivial - and how you plan further this talent at UC.",
              "author": "svday",
              "created": 1638064544,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}