{
  "sid": "qbxiox",
  "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/",
  "title:": "How I see T10+ Schools",
  "text": "Alright, I did some math. \n\nAveragely, there are about 5,300 schools just in the U.S. Yes, it ranges between all types of schools (like cosmetology to Harvard) but they are still colleges. \n\nThe T10 schools are about in the top 0.002% \nThe T20 schools are about in the top 0.004% \nThe T50 schools are about in the top 0.01% \nThe T100 schools are about in the top 0.019% \n\nI think T100 schools are still top schools. Sure there’s 100 in there, but it’s still the top 0.019% of 5300\n\nThat’s why I’ll still think I’m good even if I apply to a T50 school. According the my math it’s still the top 1%\n\nIf my math is wrong, because I’m not good at math, please type the actual answers into the comments. Thank you\n\nEdit: y’all I just wanted to put my opinion out here in hopes that it may help some people nervous about their college choices to know that it’s still okay no matter how top it is. There’s no need to insult me for being stupid and not knowing percentages because I was homeschooled by a mother who almost failed school and most of my high school years were virtual and graphs",
  "author": "Puzzled_Appearance_4",
  "created": 1634724657,
  "updated": 1634749516,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.65,
  "comments": {
    "hhcg424": {
      "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcg424/",
      "text": "That's a great argument, but as you pointed out that the 5300 count includes all types of institutions.\n\nA better number to use would be 3982, which is the total number of degree granting institutions in 2019-2020: https://nces.ed.gov/programs/digest/d20/tables/dt20_317.10.asp?current=yes\n\nThat makes a T100 the top 2.5% of all such institutions, which is still really good!",
      "author": "prsehgal",
      "created": 1634725829,
      "upvotes": 30,
      "replies": {
        "hhcgmgr": {
          "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcgmgr/",
          "text": "Ooo I didn’t think of it like that. I thought with all schools you still get some kind of degree. Neither one of my parents went to college so I don’t know much about the subject. I’m glad I still made a point though. I’ve been hearing seniors talk about their T10s and T20s and while I don’t know where my top schools lay in those categories I’m still very happy with them.",
          "author": "Puzzled_Appearance_4",
          "created": 1634726233,
          "upvotes": 7,
          "replies": {
            "hhch9za": {
              "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhch9za/",
              "text": "Yup, some folks are obsessed with the rankings, but that doesn't mean the other schools aren't great.",
              "author": "prsehgal",
              "created": 1634726743,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "hhcy6qh": {
      "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcy6qh/",
      "text": "You can be good well below the T50 too.  Even if you only wanted to attend the best programs, schools can be outstanding in specific areas even if you think they aren't amazing overall.\n\nU Iowa is widely considered to have one of the best creative writing programs in the country (and is usually considered the best at the graduate level).  Missouri is always near the top of journalism rankings by professionals in that field.  Schools like SUNY ESF, Colorado State, and Oregon State are great for the hands on conservation side of environmental science.  CU Boulder's physics department has had four Nobel prize winners on its faculty in the last 20 years.\n\nNone of those schools are T50s - many aren't in the T100 in the most popular ranking.",
      "author": "BrawnyAcolyte",
      "created": 1634736758,
      "upvotes": 6,
      "replies": {
        "hhd5gt3": {
          "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhd5gt3/",
          "text": "Funny how you brought up Iowa’s creative writing program because my friend is taking an online class there next summer for creative writing",
          "author": "Puzzled_Appearance_4",
          "created": 1634740056,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhcevrm": {
      "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcevrm/",
      "text": "I think u got ur math wrong t20 is 0.4% t50 is 1% t100 is 2%",
      "author": "Winter_Supermarket_9",
      "created": 1634724818,
      "upvotes": 13,
      "replies": {
        "hhcfe2k": {
          "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcfe2k/",
          "text": "Thank you! I never learned how to do percentages this way, so I just did it how I thought you were supposed to. Honestly the main goal of this post was to help me find someone to do it right. I’m in Math 3 and we haven’t talked about percentages yet, but I hope we do.",
          "author": "Puzzled_Appearance_4",
          "created": 1634725240,
          "upvotes": -5,
          "replies": {
            "hhcn8mo": {
              "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcn8mo/",
              "text": "What the heck is math 3, and how is a high school junior not able to do basic arithmetic?",
              "author": "Clashboy15",
              "created": 1634730852,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "hhcfhh6": {
          "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcfhh6/",
          "text": "Wait. Isn’t 0.4% 40%?",
          "author": "Puzzled_Appearance_4",
          "created": 1634725316,
          "upvotes": -1,
          "replies": {
            "hhcfkq3": {
              "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcfkq3/",
              "text": "0.4=40% 0.4%=0.004",
              "author": "Winter_Supermarket_9",
              "created": 1634725390,
              "upvotes": 8,
              "replies": {
                "hhcfnkb": {
                  "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcfnkb/",
                  "text": "Dang. Why they gotta make math difficult?? 0.4 and 0.4% both look the exact same ;-;",
                  "author": "Puzzled_Appearance_4",
                  "created": 1634725454,
                  "upvotes": -6,
                  "replies": {
                    "hhcncf9": {
                      "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcncf9/",
                      "text": "Bro either you're just doing some insane shitposting, or you gotta go back to elementary school",
                      "author": "Clashboy15",
                      "created": 1634730919,
                      "upvotes": 5,
                      "replies": {
                        "hhcuqu9": {
                          "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcuqu9/",
                          "text": "I’m not shitposting",
                          "author": "Puzzled_Appearance_4",
                          "created": 1634735085,
                          "upvotes": -1,
                          "replies": {
                            "hhcx79f": {
                              "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcx79f/",
                              "text": "Im sorry for the rude comments, but I do think they are coming from a place of curiosity and not malice. Usually you’d expect a junior to be able to do these types of conversion in their head. Homeschooled by a mother who almost failed school explains it all, but at some point you both have had to have thought that that was a bad idea?? Was public school just too mainstream?",
                              "author": "-Apezz-",
                              "created": 1634736287,
                              "upvotes": 4,
                              "replies": {
                                "hhd5nr3": {
                                  "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhd5nr3/",
                                  "text": "I didn’t choose to be homeschooled. I wanted public school, but I didn’t go. I was in public 3rd grade for 2 months and then pulled out to stay back home. I went public 6th and 7th and then had to stay home for 8th. Now I’m in public school and there’s so much I missed. I took my first science and history classes in 6th grade",
                                  "author": "Puzzled_Appearance_4",
                                  "created": 1634740142,
                                  "upvotes": 2,
                                  "replies": {
                                    "hhd94j9": {
                                      "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhd94j9/",
                                      "text": "Ah, I see. Again, sorry for the undeserved hate. I wish you the best in life",
                                      "author": "-Apezz-",
                                      "created": 1634741605,
                                      "upvotes": 1,
                                      "replies": {}
                                    },
                                    "hhdp9g8": {
                                      "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhdp9g8/",
                                      "text": "Damn",
                                      "author": "whoisapotato",
                                      "created": 1634748106,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhcq6xy": {
      "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcq6xy/",
      "text": "While yes a t50 school means u are in the top 2.5%, remember that t50 schools include massive public schools, and many schools on the lower end have significantly less students. So you won’t be top 2.5% in terms of college students.",
      "author": "run1234554",
      "created": 1634732640,
      "upvotes": 1,
      "replies": {
        "hhcxaiy": {
          "link": "/r/ApplyingToCollege/comments/qbxiox/how_i_see_t10_schools/hhcxaiy/",
          "text": "Somebody do a population weighted analysis \n\nNot me though I got EA supps to write 😓😓",
          "author": "-Apezz-",
          "created": 1634736331,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}