{
  "sid": "fw9eb7",
  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/",
  "title:": "Just got into a huge argument with my parents over not wanting to go to MIT",
  "text": "I just filled out the USC Housing application and got to the page to submit the $55 application fee... apparently talking to my parents about deciding between multiple schools didn't make it clear enough to them that I wasn't going to automatically commit to MIT. I was bombarded with 30 minutes of yelling, accusing me of \"being a pussy,\" \"being retarded,\" and \"having serious mental health issues\" in Chinese (Damn, what a failure I must be for that).\n\nObviously I was insanely happy when I got into MIT. I was over the moon for about an entire month. But after that initial euphoria went away, I began to really process what going to a school like that would mean. I've worked insanely hard for my grades in high school, and I was never the type that would be able to not study for tests in order to excel. I always felt stressed out by everything, and the \"college resume building\" aspect of my life took over my entire mindset. Although I've never had the guts to go to a therapist or seek professional medical attention, I'm sure I've experienced depression and anxiety far too many times during my four years in high school.\n\nThrough more research online and talking to current/former students, I've come to realize that MIT truly might destroy me. I'm already extremely fragile mentally, and the advice I've heard over and over again is to not go to school if you fall apart under stress. Sure, the graduation rate is extremely high and I'll probably be able to make it through, but at what cost to my mental health? High school has already broken me many times -- how is MIT not going to be even worse? The only thing I realized I truly like about MIT is the prestige associated with its name... and that's precisely why I don't want to go there right now.\n\nWhen I tried to tell my parents my thinking, they refused to even contemplate the reasons as to why I'm having doubts in terms of attending this \\*magical school\\*. They told me every college would be hard, and while that's certainly true, is it possible to deny the fact that MIT will almost certainly be more intense and riskier for my health than other, \"worse\" schools? The campus made me feel miserable when I visited, the horror stories I've heard have scared the shit out of me, and I honestly can't see myself enjoying my time at MIT. But my parents said that \"MIT is too prestigious for you not to go,\" that \"there is a reason why their yield rate is so high,\" that they \"couldn't stand to talk to me again if I chose to go such a bad school like USC.\"\n\nMaybe I did this to myself. My entire life, I've been a sheep to my parents. I listened to them when they insisted I needed straight A's since the beginning of middle school. I listened to them when they told me I couldn't hang out with my friends during the school year because a \"good, smart Chinese boy had better things to do with his time.\" I listened to them when they told me that a \"perfect ACT/SAT score will set you up for your entire life.\" I even almost listened to them when they told me to quit playing a sport, literally the one thing that has kept me sane throughout the past 6 years of my life. Now, they expect me to blindly listen to them again. But this time, I can't.\n\nI don't know what to do. I know that I will probably regret passing up the insane academic opportunities at MIT if I don't go. I know that I might never be able to heal my relationship with my parents if I don't go. I know that, if MIT doesn't destroy me, it is probably the best choice for me to go to college. But how do I know that it won't destroy me? I can do more research, but how can I know for sure that I will be fine if I go there? How do I make the right decision? I can't even discern my own thinking from that of my parents. I don't even know how to end this rant. I'm just a giant freaking mess. I feel stuck.",
  "author": "The1AndOnlyJZ",
  "created": 1586215438,
  "updated": 1634078249,
  "over_18": false,
  "upvotes": 1538,
  "upvote_ratio": 0.97,
  "comments": {
    "fmn2bcm": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn2bcm/",
      "text": "I find it funny all of the people who are so caught up in the academics and not caught up in other things. You OP are very intelligent for realizing that there is more to college than just the adcedemic reputation of a school. At the end of the day, I urge you to consider which college will make you the most happy. You don’t want to be a slave to a top university where you aren’t having any fun. If going to MIT makes you happy, go there. But if USC is where you want to go even if your parents are pushing back, go there",
      "author": "jakenimbo",
      "created": 1586216724,
      "upvotes": 536,
      "replies": {
        "fmn7mk8": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7mk8/",
          "text": "Big, big facts -- I'll try to block out my parents from this decision as much as I can",
          "author": "The1AndOnlyJZ",
          "created": 1586219918,
          "upvotes": 147,
          "replies": {
            "fmos4si": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmos4si/",
              "text": "This isn't to encourage you towards inaction. My father refused to help pay for me to go to college unless it was where he wanted and for the degree he wanted me to get. I decided not to go to college at 18. Instead I self taught and made the right friends who had the ability to train me in IT. I tried to go to college on my own dollar but my dad made too much and my mother refused to help. I instead doubled down and focused on my career. I ended up at IBM, I remember my orientation. I was in a group with a lot of fresh 20 somethings graduates who were stunned I got a job like I did with no degree. \n\nI realize that my choices definitely slowed down my adult life progression. But at 33 I've got a car that is nearly paid off, I just closed on a house, and I have a stable job. I'm making a very comfortable salary which is probably the upper limit without a degree. So now would be the time for me to finally go get my degree and I can bankroll myself, go on my terms and for what I want, and not have to rely on anyone. \n\nI encourage you to evaluate your decision beyond the mental fatigue to include the timing and the appropriateness of taking on debt for your education. It may be worth while to wait and then go after you've recovered mentally and matured your decision making / confidence in your own agency.",
              "author": "ShatterPoints",
              "created": 1586267320,
              "upvotes": 23,
              "replies": {
                "fmowoml": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmowoml/",
                  "text": "Hey just curios, what job did you get at IBM? And how was self-teaching ? And how did you get into IBM without a degree ??",
                  "author": "RisingVS",
                  "created": 1586269965,
                  "upvotes": 8,
                  "replies": {
                    "fmoytrv": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoytrv/",
                      "text": "I landed a job in their multi vendor support center. I was a \"Software Engineer\" for Microsoft products. The team I was on provided premier MS support for IBM customers. I regularly engaged in project planning, implementation, and short answer how-to for break fix for my customers. Internal to IBM I was a Technical Solutions Manager. So I also lead collaboration between business units and served as an SME for MS software solutions. \n\nI boot strapped my entire professional career. Each job I took I didn't have the entire ability to perform all that was required of me. I didn't admit that to anyone. I read as much as I could, built my own home lab and watched a zillion videos on each topic I needed to learn. As a result I've always been able to deliver on all of my job role requirements. I've even authored a few unique solutions for issues I've encountered. I still watch and read everything I can. I've gotten to the point where I have forgotten more than I know right now. But I remember enough to being myself up to speed on subject matter that I do not encounter on a daily basis. Of course over time I've developed a innate minimum amount of knowledge. So I do not have to re-learn absolutely everything.\n\nI got the job at IBM through a recruiter for a staffing company who posted the job ad on Craigslist. I thought it was a joke but applied anyway. I was immediately called back as I had a strong resume. I had a phone interview and the hardest material knowledge test I'd ever had to take. IBM changed my life, they required MS certifications in order to keep my job and they reimbursed me upon successful completion of each cert. The management also cared and helped develop my confidence and my technical ability. I poured everything I had into the job, I got converted from contractor to full blue IBMer in a year. I also was able to receive a solid yearly review after my first year as an IBMer.",
                      "author": "ShatterPoints",
                      "created": 1586271177,
                      "upvotes": 11,
                      "replies": {
                        "fs0j2md": {
                          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fs0j2md/",
                          "text": "You have a very impressive story.",
                          "author": "The_Toasty_Toaster",
                          "created": 1590610462,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fmrd7bh": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmrd7bh/",
                  "text": "I think if OP has a clear career path in engineering they'd best get their college education now. We grew up in a different time where the best people weren't necessary the ones with formal educations, but engineering is growing more complicated and the forefront of computing especially is highly dependent on theoretical understanding that college provide. Stochastic procceses/upper level statistics, linear algebra, vector calculus, are pretty much a must these days. Not to say you couldn't learn this all on your own (Khan Academy really is fantastic), but if OP got into MIT, it is clear that they are academically and socially mature enough to go to college. I also would wager that they will do well at USC, and confidence will come naturally. Just my thought as another person who has worked in industry. \n\nOn a side note, my dad sounds like yours. Even after getting into Caltech, my college options were: Iowa State for electrical engineering and that's it. I wanted to do aerospace engineering but my dad thought that was pretty stupid, because \"every house has electricity, how many people have an airplane?\". Hahaha.",
                  "author": "calvins3141",
                  "created": 1586319867,
                  "upvotes": 2,
                  "replies": {
                    "fms79c2": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fms79c2/",
                      "text": "On a side note statics was very interesting. I took free courses on that to understand vehicle dynamics. I'm about to design a piston / shim stack combo for passive dampers for a project car I have. Seriously considering a career change because engineering is fun to me. Though that might be the German in me...",
                      "author": "ShatterPoints",
                      "created": 1586348672,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fmnu9cb": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnu9cb/",
              "text": "How about you go to MIT for a year and if it gets too much it'll be EASY for you to transfer to USC. MIT IS the best school. Give it a shot.",
              "author": "900_korok",
              "created": 1586235459,
              "upvotes": 45,
              "replies": {
                "fmnvahp": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnvahp/",
                  "text": "And just like that you’re burdened in multiple thousands of dollars in student loan debt, just cause you wanted to try something out",
                  "author": "gabe_miller83",
                  "created": 1586236306,
                  "upvotes": 72,
                  "replies": {
                    "fmnzpcy": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnzpcy/",
                      "text": "Not sure what this is implying but USC is just as expensive as MIT without any aid or scholarships? And MIT’s aid is pretty generous anyway. Not sure what OP’s specific financial situation is or if they have scholarships but your statement honestly doesn’t make sense.",
                      "author": "square100",
                      "created": 1586240261,
                      "upvotes": 47,
                      "replies": {
                        "fmo07zk": {
                          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo07zk/",
                          "text": "I did get some merit money from USC so it would be about 30k less per year to attend there over MIT",
                          "author": "The1AndOnlyJZ",
                          "created": 1586240747,
                          "upvotes": 81,
                          "replies": {
                            "fmp272l": {
                              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp272l/",
                              "text": "I'd say saving $120K over 4 years is a damn good reason to not attend MIT on its own.",
                              "author": "fatdog1111",
                              "created": 1586273004,
                              "upvotes": 18,
                              "replies": {
                                "fmp6bdo": {
                                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp6bdo/",
                                  "text": "It highly depends on your career goals and how affordable that price tag is to your household. It's definitely a **strong** reason to reconsider, but it's not good blanket advice to dish out.\n\nThe real damn good reason to not attend is the incredibly strong negative prior. Nobody will enjoy attending a school they're forced to attend, and OP is probably making a good call here. It's too sad that traditional CPW is canceled this year because it helped me and many others in this situation make a decision.",
                                  "author": "whymauri",
                                  "created": 1586275243,
                                  "upvotes": 4,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fmoa24i": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoa24i/",
                  "text": "That’s the worst advice dude, if he thinks he is not a good fit for MIT, like most people, he shouldn’t go to MIT",
                  "author": "platypusboi555",
                  "created": 1586251151,
                  "upvotes": 15,
                  "replies": {
                    "fmoikoz": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoikoz/",
                      "text": "I may have misinterpreted your comment but most people who aren't a good fit don't get into MIT.",
                      "author": "sooryaanadi",
                      "created": 1586260130,
                      "upvotes": 3,
                      "replies": {
                        "fmoinas": {
                          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoinas/",
                          "text": "Yeah most people who apply and get rejected, and a lot of people who apply and get accepted",
                          "author": "platypusboi555",
                          "created": 1586260194,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fmov8hu": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmov8hu/",
              "text": "Congrats on USC! My brother is a freshman there and he likes it. Hope things go well, I know how pushy parents are I got one Asian parent and one Hispanic parent. Good luck!",
              "author": "ameliafuj",
              "created": 1586269139,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fmofbpg": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmofbpg/",
          "text": "agreed on all counts, OP",
          "author": "peteyMIT",
          "created": 1586256941,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmncvpq": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmncvpq/",
      "text": "The problem with getting into top tier schools is that your chances of getting FOMO are higher. There's no way of telling how you'll do at either school, so you'll just have to make a decision and stick with it. \n\nBased on your comment that the one thing you like about MIT is the prestige, it sounds like USC is a better fit for you. It's nothing to scoff at (I've met other Chinese parents like yours who think it's a crummy school; not sure why...), and while it might lack some things that MIT has, it'll likely have other things that MIT lacks. If you commit completely to USC and really take advantage of campus opportunities when you matriculate--no second thoughts, no \"If only I went to MIT\"--you'll very likely find your place on campus and have no regrets. Find some clubs and activities you'd be excited to get involved in if you went to USC; that generally helps with feeling at peace with a school. \n\nOne thing that helped me a lot when I was considering college was personal development. I was picking between MIT and Caltech, which are quite similar, and ultimately, I chose MIT because it was far from home (I'm from SoCal), bigger, and its students seemed more generally well-rounded in their interests. I was (still am) kind of awkward and didn't really know how to talk to people who weren't my personality \"type\", so I thought MIT would expose me to a greater diversity of people and force me to be more social. \n\nParent-wise, since I lived so close to Caltech that my parents could drive over anything they'd like (and they totally would), I thought staying in SoCal would slow down my becoming independent, and I wanted some more space. I'm not sure what your plans are for your relationship with your parents, or where you're from, but this is something to consider as well. \n\nThat said, there were a few things I wanted to say--\n\n\\-Since your mental health is really fragile, USC could also be very dangerous. It doesn't have the same reputation for academic rigor as MIT, but it could certainly present other stresses that could negatively impact you. Research mental health facilities at both places, and make sure you seek mental health ASAP. \n\n\\-I didn't like MIT very much when I visited during CPW (and my 2 visits before that weren't great either), but I enjoyed my four years there. Is there anything at all about MIT that you like about it besides the prestige? I find that a lot of the worst horror stories about MIT are either fringe cases or from the way past. There's a lot of smart kids that make you feel bad, and people do botch their mental health (but this happens at every campus), but it's a very \"move at your own pace\" type of school unless you're in an engineering major that has specific requirements each semester. \n\n\\-I'd recommend against going to MIT if you're likely to transfer out. The first semester is on PNR, but people have definitely transferred out in the past. If you commit to USC now, you'll have some time to negotiate with your parents and figure out finances in the event that they do decide to withdraw support; if you go to MIT and transfer somewhere, that'll be more jarring for them and leave you stranded on shorter notice.\n\n\\-What do you like about USC? Do you really like the school and think you'd fit well, or is it just your only other option? \n\nGood luck. This is certainly rough, and lemme know if you need an ear.",
      "author": "junyl_yangide",
      "created": 1586223205,
      "upvotes": 75,
      "replies": {
        "fmndpwp": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmndpwp/",
          "text": "Woah thanks so much for all of the feedback. I live in Illinois right now and my parents are going to move to Maine right after I graduate from high school. If I go to MIT they wouldn't be too close so that's not much of a factor for me. \n\nI don't think I'll be an engineering major so it's nice to hear from you that the school feels more self-paced. If I go to MIT, I'm definitely not going to approach with the mindset that I'll definitely be transferring out -- I'll definitely be embracing the school and doing the best I can to find happiness there. \n\nAbout USC: I really love California which is why Stanford was my dream school before my rejection (oof). I'm a huge sports guy so, although it probably shouldn't be, being able to watch their teams is a big part of why I love the school. The Trojan family is exceptionally strong in the LA area, and I would love to live there after college. I also received the presidential scholarship, which means I would be paying 29k less per year to attend USC and I'd be able to live in the McCarthy Honors Residential College, which is really, really nice",
          "author": "The1AndOnlyJZ",
          "created": 1586223739,
          "upvotes": 32,
          "replies": {
            "fmnxlhw": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxlhw/",
              "text": "Hey I'm not really part of this conversation but I wanted to say that being a sports fan and wanting to attend the games is totally a valid reason to want to go to USC (among other things ofc). Sports can be a huge part of school spirit and if you get involved in that I've heard that brings great sense of belonging. I wish you all the best wherever you choose to be!",
              "author": "mlaxgsp79",
              "created": 1586238319,
              "upvotes": 17,
              "replies": {
                "fmnz6j7": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnz6j7/",
                  "text": "Not OP, but thanks for this comment. I want a school with at least decent sports because I'm a huge sports guy, but I've talked to people who make it seem like I should go to a school with low-level D3 sports or that it shouldn't be a factor.",
                  "author": "CoIIege_AIt",
                  "created": 1586239766,
                  "upvotes": 8,
                  "replies": {}
                },
                "fmnxtr6": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxtr6/",
                  "text": "Thanks so much dude!",
                  "author": "The1AndOnlyJZ",
                  "created": 1586238523,
                  "upvotes": 4,
                  "replies": {}
                },
                "fmo4cjt": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo4cjt/",
                  "text": "Right? I ended up choosing Wisconsin over a different school because I love the sports culture. I also believe that had I gone elsewhere I wouldn’t be doing research in an area I adore (sports concussion/ other injury epidemiology) as a PhD student.",
                  "author": "BadBadger21",
                  "created": 1586244922,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "fmo2t8y": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo2t8y/",
              "text": "From this post the choice seems obvious. You love USC and everything seems aligned for you there — the dorms, the money, the sports, the state. You’ve only mentioned one downside: your parents. Can you enlist an uncle, aunt, grandparent, or family friend to help you plead the case for USC? (Really, for your future happiness!)",
              "author": "Imraith-Nimphais",
              "created": 1586243323,
              "upvotes": 10,
              "replies": {}
            },
            "fmq0lp8": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmq0lp8/",
              "text": "Nice, USC sounds like a pretty good fit for you! SoCal's a pleasant place to live in (and I say this as a native who doesn't super love it). \n\nMIT definitely does not have a strong sports presence; people do do athletics and we have intramural teams, but our only Div I sport is rowing, and let's just say that I've never been to a college sports game ever. \n\nGood luck with your parents, and let me know what you end up deciding! I'd suggest making a presentation of the career and academic opportunities at USC (especially of any that are unique to USC) and statistics on post-graduate success, but depending on how your parents are, that might just fall on deaf ears.",
              "author": "junyl_yangide",
              "created": 1586290711,
              "upvotes": 2,
              "replies": {}
            },
            "fmo4hwu": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo4hwu/",
              "text": ">I really love California which is why Stanford was my dream school\n\nThat seems to be such a difficult decision.Did you give up on Stanford ? If not and it is still your ultimate goal, why not trying a strategy like deferring USC by a year, attend MIT 1 year, then try to transfer to Stanford ? One thing you might also consider, that I didn't see you talking about yet, is what you want to do after graduating. The main advantage of MIT is that it gives you easy access to a lot of options after graduation (top companies, top network of alumni to work with, possibility to get in top grad schools like at Stanford). You can still try to achieve the same from USC of course, it is just harder. If you don't care much about these opportunities, then indeed MIT might not really seem useful.",
              "author": "Necto74",
              "created": 1586245077,
              "upvotes": 1,
              "replies": {
                "fmo4qlf": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo4qlf/",
                  "text": "Well I don't really want to go into a school with the mindset that I'm going to transfer out eventually... I mean sure I would try to transfer to Stanford or somewhere else if I truly felt unhappy at MIT, but that's not going to be a primary plan for me.",
                  "author": "The1AndOnlyJZ",
                  "created": 1586245325,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "fmuzl82": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmuzl82/",
              "text": "Though MIT doesn't have the best sports, Boston still offers 4 great sports teams, even though the Patriots are at least 30 minutes from the city. Also, you can get pretty good deals on Red Sox tickets and if you really want to, there are a ton of colleges in the area that have good hockey teams and BC is pretty good at football",
              "author": "mckid8",
              "created": 1586402478,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fmpw8eh": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpw8eh/",
          "text": ">  I was picking between MIT and Caltech, which are quite similar,\n\nCaltech used to have a reputation for being far worse, with a 75% graduation rate.  But I think they are much closer nowadays.",
          "author": "fretit",
          "created": 1586288474,
          "upvotes": 1,
          "replies": {
            "fmpyzrs": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpyzrs/",
              "text": "I believe their 6-year graduation rates have been pretty similar (in the low 90s) since 2006. 75% sounds about right for their 4-year graduate rate, though. I can't find any numbers on an official Caltech website, but other data-collecting websites cite their 4-year graduate rate as 79%. \n\nMIT and Caltech do have more cultural and academic similarities than most other schools, though, and Caltech still has a reputation for being (more) difficult.",
              "author": "junyl_yangide",
              "created": 1586289882,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fmng3k9": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmng3k9/",
      "text": "Unpopular opinion: it sounds like you have imposter syndrome. What I've learned since coming to my T5 (one that's known for being pretty difficult, i.e. not Harvard or Yale) is that *everyone* struggles. Everyone has to study to excel on tests, and everyone worked hard for their grades in high school. But not everyone shows it. Don't think that you're lesser than everyone else who got in, or that MIT will be *especially* challenging for you, just because you had to study in high school. You've faced stress and anxiety at times, but so has everyone else. You overcame those things enough to achieve what you did, so you should have confidence going forward!\n\nOf course, I don't know your full mental health history, and I can't tell you what you can or can't handle. If you visited MIT and didn't like the campus or didn't like the curriculum, then by all means choose USC where you'll be happier. But don't turn down the opportunity solely because you're intimidated. When I first came to my university, I had these kinds of thoughts too. I thought I only got in because I wrote good essays and not because I had achieved what the other kids had. But once I got here, I fit in just fine.\n\nEdit: I don't like to post my school / year for privacy reasons cuz sometimes I mention pretty specific things about myself, but if you want to know the school / hear more about this just shoot me a PM\n\nEdit 2: Based on the people who've PM'd me, I'd like to clarify something else: grades really aren't that important for your future. I have a 3.85 right now, which makes me a candidate for Phi Beta Kappa, but that doesn't necessarily mean I have job offers falling into my lap. As always, to get good internships / research, you have to put in the effort. That effort goes a lot farther towards post-grad outcomes than your GPA does.\n\nFor me, a lot of the reason high school was so anxious and stressful was that at most high schools you need an almost perfect GPA for schools like MIT. Get two B's and it's basically over. But that's not the case in college. Of course, students put pressure on themselves to compete for higher GPAs, but grades don't have as big a bearing on post-graduation outcomes as, say, high school GPA does for undergrad admissions.\n\nAt my school, it's pretty easy to get above a 3.5 if you put in good amount of effort. In STEM classes, the class average is going to a B / B+, and the top 15% will get an A. So if you're a completely average student, you'll probably end up with a 3.3. If you want a 3.9, which means consistently getting an A / being the top 15-30% in almost all of your classes, then those are the kids who are buckling down and heading straight home from the library each day. But you learn pretty quickly that *it doesn't matter what your GPA is*, except for a select few fields like if you want to go to an Ivy-level academic grad school / law school / med school, or MBB consulting. But for most jobs, GPA doesn't really matter as long as it's above 3.0. I know kids with 3.3s going to Goldman Sachs. I know students with 3.2s going to Facebook. If you don't want school to take over your life, it won't.",
      "author": "BewilderedStudent",
      "created": 1586225265,
      "upvotes": 313,
      "replies": {
        "fmnow74": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnow74/",
          "text": "Thanks so much for your perspective! I hope that if I attend MIT, my story will end up being similar to yours -- this gives me a bit more comfort",
          "author": "The1AndOnlyJZ",
          "created": 1586231297,
          "upvotes": 121,
          "replies": {
            "fmnvflf": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnvflf/",
              "text": "go to MIT pls",
              "author": "ranch-me-brotendo311",
              "created": 1586236425,
              "upvotes": 53,
              "replies": {
                "fmnxwbl": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxwbl/",
                  "text": "Lol I can feel you",
                  "author": "BredCatXD",
                  "created": 1586238588,
                  "upvotes": 19,
                  "replies": {}
                }
              }
            }
          }
        },
        "fmp4ui9": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp4ui9/",
          "text": "Hi, Stanford.",
          "author": "haf_ded_zebra",
          "created": 1586274466,
          "upvotes": 3,
          "replies": {}
        },
        "fmprnac": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmprnac/",
          "text": "UChicago? Because I'm headed there next year and I'm apprehensive in the same exact way; hopefully it works out as well for me as it did for you, but I'm genuinely terrified of drowning in the sheer difficulty of the coursework.",
          "author": "KS1618",
          "created": 1586286085,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fmn1azj": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn1azj/",
      "text": "Hey OP: I’m not a college admissions officer or parent, just a fellow high schooler, but I know how you feel. Just know that at the end of the day, you’re the one attending college. My lit teacher called college a place for not only education, but a transition period from adolescence to adulthood for a lot of people. You don’t pick a college based on rankings, but also a variety of factors like the culture, price, and size because it is going to be four important years of your life, regardless of what or where you study. Even if your parents don’t understand that, just know that if you know MIT isn’t the place for you, then you shouldn’t be forced to go solely based on prestige.\n\nUSC is a great school with amazing programs. I’m proud you got into both! I wish I could help you more but if you ever need someone to talk to, feel free to PM me!",
      "author": "toporbottomquark",
      "created": 1586216128,
      "upvotes": 359,
      "replies": {
        "fmn7fct": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7fct/",
          "text": "Thanks so much for your kind words! This is an insanely hard decision and I'll definitely keep your thoughts in mind",
          "author": "The1AndOnlyJZ",
          "created": 1586219794,
          "upvotes": 82,
          "replies": {
            "fmnkkbd": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnkkbd/",
              "text": "It's understandable what you're going through, and you're capable of MIT but please, as a fellow high schooler, USC is great! And you should not go to a school that makes you miserable, your undergrad does not define you.",
              "author": "velleyatti",
              "created": 1586228222,
              "upvotes": 30,
              "replies": {
                "fmns5dy": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmns5dy/",
                  "text": "He won't know if the school makes him miserable until he is there. All his projections are based on his anxieties and fear of not succeeding and also probably a desire not to live out the life his parents had planned for him. You won't know what makes you happy until you try it, whether a job, a school, or a relationship. You can only guess, and our guesses are often very wrong (note how many students switch majors within a year and how many people switch jobs).",
                  "author": "andieOO7",
                  "created": 1586233763,
                  "upvotes": 25,
                  "replies": {
                    "fmnwqi5": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwqi5/",
                      "text": "You're actually so right -- there is this inner feeling of wanting to rebel against my parents right now... I have to separate my thoughts completely from theirs",
                      "author": "The1AndOnlyJZ",
                      "created": 1586237559,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "fmntzhs": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmntzhs/",
                      "text": "This is true - and I think OP would be fine at MIT academically - but there are valid concerns made by OP here regarding mental health. However, I don’t think that OP will be significantly disadvantaged if he goes to USC over MIT and there’s so much more to a school than just the reputation and prestige",
                      "author": "toporbottomquark",
                      "created": 1586235235,
                      "upvotes": 10,
                      "replies": {}
                    },
                    "fmnt8rb": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnt8rb/",
                      "text": "well, that's also true, /u/The1AndOnlyJZ also don't be biased to do the opposite of what they want, it's your decision and don't let what they want influence you",
                      "author": null,
                      "created": 1586234633,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fmnw3ee": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnw3ee/",
              "text": "Will they pay for USC if you decide to go there? If not, how will you pay for it? It’s a vital consideration.",
              "author": "Hardlymd",
              "created": 1586236995,
              "upvotes": 3,
              "replies": {
                "fmnwrfa": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwrfa/",
                  "text": "They're threatening to not pay for it as of now... not sure how this will all play out in the future",
                  "author": "The1AndOnlyJZ",
                  "created": 1586237582,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "fmnt4q3": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnt4q3/",
          "text": "OP if you are reading, your parents are 100% right. Not going to MIT is a stupid decision. I would have killed for such an opportunity. \n\nSeriously? This isn't even worth debating. Just go to MIT. Anyway, goodluck on whatever decision you make.",
          "author": "BredCatXD",
          "created": 1586234543,
          "upvotes": -26,
          "replies": {
            "fmnuqra": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnuqra/",
              "text": "You’re missing the point here though. MIT is an amazing school but it’s not the best for everyone. And OP has valid concerns over mental health at MIT. I don’t think he’s “retarded” to have doubts over not wanting to go to MIT if he thinks he’s going to thrive better at USC. \n\nCollege is more than just academics and whatever path he chooses can possibly shape his life for the next years or so. You’re not just studying from hours on end, but you’re also possibly making life-long friendships and growing as an adult. I think it’s a much harder decision than just going to the best school you get into.",
              "author": "toporbottomquark",
              "created": 1586235850,
              "upvotes": 10,
              "replies": {
                "fmnww9y": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnww9y/",
                  "text": "I know all that. But I still think he should go to MIT lol",
                  "author": "BredCatXD",
                  "created": 1586237701,
                  "upvotes": 0,
                  "replies": {
                    "fmp2eu8": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp2eu8/",
                      "text": "so you're disregarding his genuine concerns regarding mental health? explain",
                      "author": "DJ_Saidez",
                      "created": 1586273125,
                      "upvotes": 2,
                      "replies": {
                        "fmp2qkl": {
                          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp2qkl/",
                          "text": "People have it worse I think. That's no excuse. But whatever man",
                          "author": "BredCatXD",
                          "created": 1586273307,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fmnuhs9": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnuhs9/",
              "text": "Their not 100% right, how is it justified to blatantly insult your child like that? Sure it’s an amazing school, people would kill for the opportunity, it’s something that just seems so right that as a fellow high schooler right now I would be set to move to Cambridge in an instant. However for someone as applied and intelligent as him to get into MIT, of course this excludes you as you didn’t go there:(, to have reasonable doubts over admission and attendance there is something to take into consideration and maybe try to look at it through his shoes...",
              "author": "fiji-911",
              "created": 1586235648,
              "upvotes": 8,
              "replies": {
                "fmnws2h": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnws2h/",
                  "text": "You might be right. I'm too stupid and broke that I didn't consider those issues properly.",
                  "author": "BredCatXD",
                  "created": 1586237597,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "fmnwvx7": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwvx7/",
              "text": "You sound like my parents :'(\n\nOn a serious note, I agree with the people who have already replied to you that this truly isn't just a prestige decision -- while I wish it was that simple, it just can't be",
              "author": "The1AndOnlyJZ",
              "created": 1586237692,
              "upvotes": 6,
              "replies": {
                "fmnxqmb": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxqmb/",
                  "text": "I wish you luck in your future endeavors.",
                  "author": "BredCatXD",
                  "created": 1586238448,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fmn2e4e": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn2e4e/",
      "text": "I agree that MIT is an incredibly prestigious school with amazing opportunities, and that college will be difficult -- and that you can find resources to help cope with that difficulty -- anywhere. However, I hesitate to agree with the other comment saying you should choose MIT. USC is by no means a bad school, and fit is incredibly important IMO. It's one thing if you're worried about not being successful at MIT, and another if you truly believe that you will be miserable there. You said that you did not enjoy the campus visit and you can't see yourself enjoying your time there. That makes me wary of telling you to go.\n\nI'm so sorry that your parents are not supportive of your struggles or your doubt when it comes to MIT. I can't tell you what the right decision is here; there's a lot to consider, between the benefits of MIT and your relationship with your parents. At the same time, at the end of the day it is your life, and you know yourself better than anyone else. If you think USC is the better option, I would do your best to pursue that.",
      "author": "in_THIS_economyy",
      "created": 1586216768,
      "upvotes": 67,
      "replies": {
        "fmn7nw6": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7nw6/",
          "text": "Thanks so much for your thoughts!",
          "author": "The1AndOnlyJZ",
          "created": 1586219941,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "fmn1qi5": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn1qi5/",
      "text": "USC is such an amazing school. At the end of the day, you don’t go to college so you can brag about the name. You go to get a good education and thus find a good job. With an amazing school like USC and the opportunities it provides, I’m sure you’ll be fine in the future :) You should always prioritize your mental health over academics. I understand how you feel, I’m attending a really hard high school and the last couple of years took a huge mental toll on me. I worked super hard while neglecting my mental health to get straight As, but I didn’t even get that. I barely even hung out with my friends outside of school. I’m also going to college this year, and I want to go University of Toronto just because of its prestige and I feel like I deserve it or something, but I know the competitive environment is gonna ruin me. So, I keep telling myself that it’s ok to choose an easier school, and that’s probably what I’m gonna do. I hope I don’t sound offensive, but this seems like your parents problem. They need to understand your point of view and how much a competitive environment can really take a toll on you.",
      "author": "potatocorn19",
      "created": 1586216382,
      "upvotes": 62,
      "replies": {
        "fmn7ko5": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7ko5/",
          "text": "Yeah man, I wish my parents weren't so inflexible... my older sister has cut many ties with them because there's almost never a time that they will listen to opposing opinions. She went to Duke on a full-ride over Yale and since then the relationship has been terrible between her and my parents.",
          "author": "The1AndOnlyJZ",
          "created": 1586219886,
          "upvotes": 42,
          "replies": {
            "fmneg7k": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmneg7k/",
              "text": "Sounds like you could get a lot of valuable support from your sister right now.",
              "author": "creddit_where_due",
              "created": 1586224206,
              "upvotes": 55,
              "replies": {}
            },
            "fmnrr8b": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnrr8b/",
              "text": "Duke is great though...",
              "author": "Abisauce",
              "created": 1586233457,
              "upvotes": 13,
              "replies": {}
            },
            "fmnqkmd": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnqkmd/",
              "text": "I would go to duke even if it cost more over yale lmao",
              "author": "Rhu_2002",
              "created": 1586232552,
              "upvotes": 6,
              "replies": {}
            },
            "fmnd8il": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnd8il/",
              "text": "A FULL RIDE TO YALE!!!!!!!!!!!  \nwas her reason similar to yours as to not choosing to go there?",
              "author": null,
              "created": 1586223433,
              "upvotes": -9,
              "replies": {
                "fmndwwb": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmndwwb/",
                  "text": "Her full-ride was to Duke haha (not super important)\n\nShe went to Duke because she loved the campus and the culture much more at Duke, and the scholarship program she was accepted to at Duke was extremely nice and it ended up contributing to most of her college experience",
                  "author": "The1AndOnlyJZ",
                  "created": 1586223865,
                  "upvotes": 35,
                  "replies": {
                    "fmp1s2w": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp1s2w/",
                      "text": "LMAO I READ TTHAT WRONG  \nim sorry  \nayyy go Duke then!!! honestly i wish u could visit both schools so u could make a better informed decision but at this point u gotta go with ur gut  \nand remember, its not the college u go to, but the people you meet, the connections you make, the networking you do, and the internships you get that land you jobs. east and west coast are pretty stem heavy so either way im sure you will find an amazing job esp with your intelligence!!\n\nall the best for your future!!",
                      "author": null,
                      "created": 1586272770,
                      "upvotes": 3,
                      "replies": {
                        "fmpgtis": {
                          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpgtis/",
                          "text": "Thanks so much",
                          "author": "The1AndOnlyJZ",
                          "created": 1586280580,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fmnteqy": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnteqy/",
          "text": "AFAIK MIT is highly collaborative, i.e. psets and such are so hard to do individually that you're basically forced to work with other people. at least, that's what i've heard and admissions prioritize having a community with this quality",
          "author": null,
          "created": 1586234769,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "fmnfgw8": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnfgw8/",
      "text": "If you feel mentally fragile now, you have the right instinct about MIT. People drop out there regularly. It is not an easy place to be. It might break you for a little while. Not forever though. And it might be necessary to take time off for a semester abroad or whatever to maintain your sanity. Stanford engineering was tough for me. MIT is way more hardcore in many of the disciplines. And it is a lot easier to fail. \n\nOnly you can make this decision. If you’re fragile now, it might be in your interest to defer a year. Commit and then take a year to build yourself up — unless you’ve got a bad home situation. \n\nSC has a social scene that isn’t the easiest to fit in with.  I don’t know what your personality is but you need to establish if you fit there. It’s not for everyone. I need more info to help so pls PM me.",
      "author": "icebergchick",
      "created": 1586224860,
      "upvotes": 39,
      "replies": {
        "fmnye27": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnye27/",
          "text": "I second this 100%. The top engineering programs are all extemelry difficult and require tremendous mental resolve, but MIT, CMU, GT, and Berkeley in particular have a serious stress culture in engineering and due to the enviornment are particularly brutal. While other engineering programs like Stanford, Michigan, UIUC (etc.) are equally difficult academically, they don't have the same stress culture because stress is mitigated by other enviornmental factors like more diversity in student majors, more relaxed students, and school spirit. To any student who doesn't eat/sleep/breathe engineering, I would caution you to select a top engineering school where there is an escape should you become overwhelmed.\n\nEdit: Btw, those of us in industry who are alums of these places are actively trying to change this culture at our alma mater, but it's largely driven by the student body and very hard to change. As much as I love GT, given the choice for my own child between GT/Michigan or GT/UCLA, I would want them to choose a better enviornment for their own mental health",
          "author": "calvins3141",
          "created": 1586239036,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "fmnw5fo": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnw5fo/",
      "text": "Hi OP, ive told my story a couple times on A2C but I'll tell it here again, because maybe it will help you.\n\nAbout 40 years ago I applied to two universities for a BS in EE. Iowa State, a school 20 minutes from my parents' house, and Caltech. I actually got accepted into Caltech, and then had to turn it down because there was no chance in hell my parents could afford for me to go there. At the time, I was... upset... To say the least. \n\nIn hindsight, this might've been the single best thing to happen to me in my life. As you might expect, I was pretty much the top student at IA State Engineering (and I had a full ride). When I graduated at the age of 21 I received offers from Stanford and GT, and since GT was fully funded, that's where I went. So by the age of 23 I had an MS in EE from Georgia Tech (which is a top 10 electrical engineering school) and I had paid exactly 0 dollars in tutition fees over the course of my undergrad and grad education. \n\nThese days I've got my dream job, dream house, a beautiful wife I love very much and two beautiful kids (who aren't really kids anymore, but they will always be kids to me). Imo, life is a lot bigger and longer than 4 years of undergrad education, and more importantly, the people who have what it takes to succeed do so independently of the school they attend. So turning down MIT? Not really a big deal in the long run. The amount of self-awareness and maturity you have to know that's the right descion for you speaks volumes about your character. Certainly more than I had at your age when put in a similar situation. I'll also point out that USC (unlike IA State) is one of the nation's top colleges and is no means a school one settles for. I think you'll be just fine.",
      "author": "calvins3141",
      "created": 1586237045,
      "upvotes": 13,
      "replies": {
        "fmnwfhu": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwfhu/",
          "text": "Thanks so much for your story! It's giving me a bit of comfort right now",
          "author": "The1AndOnlyJZ",
          "created": 1586237288,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fmntaly": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmntaly/",
      "text": "It sounds like you have really compelling reasons against MIT. It also sounds like the only reasons you have for MIT are from your parents. At the end of the day, this should be **your** decision because this is **your** life. Your parents' points are valid and worth considering, but so are yours.\n\nMental health is incredibly important to quality of life, and really, what's the point of being 'successful' if you're not happy? USC is an amazing school, so it's not even like you're setting yourself up for failure by going there. USC is widely recognized as an excellent school, so you will have amazing opportunities with an education from USC. \n\nAnother thing to consider -- are you going to grad school? If you think that you would do better at USC, then that might be the better choice.\n\nI think you should take a few days to step back from the situation. Then reevaluate how you, and only you, are feeling.",
      "author": "confusedjulia",
      "created": 1586234675,
      "upvotes": 9,
      "replies": {}
    },
    "fmnbr5z": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnbr5z/",
      "text": "Hey, it's easy to say \"go to MIT\" and I'm sure I would've chosen it over USC. But, I'm not as smart as you. I went to McGill ('Harvard' of Canada) after high school and it was hard and depressing and I dropped out. I went to rehab for depression. Maybe, if I went somewhere else I would've had a healthier experience. I don't know if I regret choosing McGill, but I am now at community college at 25 years old trying to transfer to a good UC. I chose prestige over happiness (I really liked UCSB), and it turned out to be a huge mistake. Think hard about if you can endure 4 years at MIT and if that would be worth the opportunities a degree from MIT can open up for you. If you got in, you got in for a reason and are smart enough to be there. But sometimes, there's more important things than rank and competition. I hope you make the right choice, whatever that might be.",
      "author": "jaescott",
      "created": 1586222489,
      "upvotes": 27,
      "replies": {
        "fmndhkc": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmndhkc/",
          "text": "this is random but i stayed at mcgill when i went to canada for the second time",
          "author": null,
          "created": 1586223589,
          "upvotes": -15,
          "replies": {}
        }
      }
    },
    "fmncykb": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmncykb/",
      "text": "Hi!\n\nI'm not a college admissions counselor, but one of my close family members went through this. She was elated at being accepted to a T3 school and she was mostly fine for the first year. However, her mental health started deteriorating so rapidly after that first year due to insane stress (she's also the kind of person who has to study for tests) and the incredibly toxic environment. To this day, she says that she wishes she didn't go there. Based on her experiences, I am so glad you're taking everything into account--education is necessary, but your health is the MOST important. Sending all of my best wishes and good luck! I'm with you on this one.",
      "author": null,
      "created": 1586223256,
      "upvotes": 18,
      "replies": {
        "fmndqnh": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmndqnh/",
          "text": "Thanks so much!",
          "author": "The1AndOnlyJZ",
          "created": 1586223752,
          "upvotes": 4,
          "replies": {}
        },
        "fmnu47o": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnu47o/",
          "text": "what school? not all schools are the same",
          "author": null,
          "created": 1586235342,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmnsvcs": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnsvcs/",
      "text": "First of all, USC is an amazing school that’s very prestigious and is not nearly as high stress as MIT. If I got into both I would probably choose USC as well, but that might also be because I’m not a stem major. On top of that, I love USC’s campus, even if the neighborhood it’s in isn’t perfect. MIT however, I absolutely hated campus wise. I hated the campus so much I didn’t even bother applying. It felt so cold and industrial. It may be a great school with lots of prestige, but do what you think is right!",
      "author": "OGSHAGGY",
      "created": 1586234335,
      "upvotes": 9,
      "replies": {}
    },
    "fmnmrun": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnmrun/",
      "text": "Remember that you’re the one who’s going to have to spend four or more years living,eating,socializing,and  most importantly, studying there - not your parents. I feel you on seeming like a sheep to parents and feeling like you just do whatever they tell you to do. Sometimes I think of the things that my family has steered me away from - whether it was intentional or not - and I regret it and later realize that I resent them for it. Go towards what you feel is the best fit for you. Do your research, and give your parents reasons to be excited for whichever college you choose. You are better off making this important decision on your own than blindly following what seems like the most prestigious school based off of reputation. Think of your goals and what you want to accomplish. Be proud of yourself kid, and have pride in what you do no matter what. It’s your life",
      "author": "eikeo",
      "created": 1586229758,
      "upvotes": 7,
      "replies": {
        "fmnp03s": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnp03s/",
          "text": "Thanks so much dude",
          "author": "The1AndOnlyJZ",
          "created": 1586231377,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmnckwn": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnckwn/",
      "text": "You wouldn’t be missing out by choosing USC over MIT. Both schools are amazing and regarded very highly. However, even if MIT did have better opportunities than USC, your mental health and happiness will play a bigger role in your success in college than the name of the school. You won’t be able to learn and grow and achieve at your fullest potential if you hate where you are. College is SO much more than just academics. Best of luck to you :)",
      "author": null,
      "created": 1586223017,
      "upvotes": 11,
      "replies": {
        "fmne2zg": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmne2zg/",
          "text": "Thanks so much!",
          "author": "The1AndOnlyJZ",
          "created": 1586223974,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fmnyv59": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnyv59/",
      "text": "At the end of the day, choose wherever you think is best for you. I will say, though, that, with some physical health issues that sporadically affect my mental ability, I was worried about MIT as well. However, the more research I did, the more I fell in love with the school and realized that the popular acronym IHTFP really showed the collaborative spirit there. From what I can gather, at MIT, it’s hard so the students are forced into collaboration to “beat” the school. I also found watching KJ Hardrict aka MITechGuy’s videos helpful as they have me a sense of the camaraderie of the student body. I recently talked to the founder of a mid sized tech company about getting an internship, and the conversation moved toward college. He said they (and other companies) pay MIT grads at least 10% more right out of the gate, because he says they have a whole different mindset that is invaluable to the company. Then again, that mindset doesn’t just magically appear, it’s brought out by the extremely demanding nature of the education. I know MIT is the right choice for me, but obviously everyone’s different, and it’s up to you. One other thing is that people spend a lot of time on their extracurriculars in addition to classes, so, by taking a standard 4 classes per semester but cutting down on extracurricular commitments, you could find it quite a bit more manageable. Then again, extracurriculars are important too. However, I don’t think you should sell USC short. It’s an incredible school with a ton of opportunities and, judging by what you say about your work ethic, I think you could really shine there as an excellent student! Let me know what you end up choosing!",
      "author": "CrowBS",
      "created": 1586239474,
      "upvotes": 5,
      "replies": {}
    },
    "fmn7080": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7080/",
      "text": "If MIT accepted you, then rest assured that they are confident you can handle it there. The MIT admissions office knows what they’re doing and they obviously saw something in you. You said that you‘re “fragile,” but I think you might be underestimating yourself. Plus, MIT’s experience makes people tough and strong such that whatever you do afterwords seems a lot easier. As long as you’re not premed or prelaw, aiming for a perfect GPA is not a priority and it’s okay to have setbacks - that’s normal. Also consider that the people from MIT you talked to, if they’re on Reddit, tend to be more dissatisfied with their college experience than the average student. Reddit is a place for venting after all.\n\nI’ll tell you that a campus visit is not an accurate snapshot of student life; a lot of colleges try to make it all sound rosy, but I remember my mit tour guide candidly telling me that it’s difficult there. Yet the students seem to brag about how badly they did - they’re not ashamed to fail or stumble because everything’s a learning experience.\n\nThat said, you know yourself the best and prestige does not overcome mental health. USC is still a good school and you’ll be successful at either university.\n\nIf you haven’t already paid your deposit, perhaps talk to some others from MIT who might give you a more balanced perspective.\n\nGood luck and congratulations!",
      "author": null,
      "created": 1586219532,
      "upvotes": 21,
      "replies": {
        "fmn88ej": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn88ej/",
          "text": "Won't be paying my deposit until May 1st that's for sure haha\n\nYeah, I've been talking to students from many sources, but mainly from Reddit/Quora, so you're right many of their opinions might not be very representative of the student body as a whole. There's no way I'm ruling either school out until the very last moment. Thanks for your thoughts!",
          "author": "The1AndOnlyJZ",
          "created": 1586220284,
          "upvotes": 6,
          "replies": {}
        },
        "fmn90p2": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn90p2/",
          "text": "This is true:  [OP made a post on MIT's subreddit and everyone essentially said the same thing.](https://www.reddit.com/r/mit/comments/edsaox/im_scared_of_mit/)",
          "author": "Klays_Dealer",
          "created": 1586220760,
          "upvotes": 9,
          "replies": {
            "fmn9uri": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn9uri/",
              "text": "Oh fuck I should probably re-read this thread lol",
              "author": "The1AndOnlyJZ",
              "created": 1586221277,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fmnzihe": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnzihe/",
      "text": "I'm a USC student who was sort of in your shoes: I turned down Cornell to go here. Do I regret it? I'd be lying if I said I didn't. It was very difficult to convince them and they put me through a lot of mental stress during the commitment period and after. But as time goes on, that feeling fades and fades, and my parents have accepted that I go here. From time to time they'll still shit on my school, especially since my brother goes to Yale but like... I'm across the country from them so it doesn't really matter. I can honestly say that the people here won't be as studious as people who go to MIT, which is sort of a given. But they're still very intelligent and very hard working and there's a surprising amount of them who turned down ivies themselves to go here. MIT does party pretty hard, from what I see and hear, but so do we. But we have three things better than any other school in the nation:\n\n1. Women\n2. Weed\n3. Weather\n\nThere are some things you should understand.\n\n1. We've had a lot of student deaths last semester, which have been covered up. I think something like 9 students died, one who lived in my dorm during week 0. Pretty scary stuff, and it's been understated. I'm surprised nobody in the comments has mentioned it. You might do better here mentally just because the weather's pretty nice (and the weather does have an effect on your mental health, for me at least) compare to MIT, but it's not as if we have the best mental health support in the world\n2. You might not have all the resources you would have if you attended MIT. Don't get me wrong, USC is an amazing school, but will you get the recruiters, the professors, the programs, the clubs at MIT? Probably not, especially the recruiters. Let me put it this way, students at MIT will probably have no trouble going to the Citadel, DE Shaw, or some other hedge fund and making tons of money their first year. USC, it's not so often. We do send lots of people to FAANG and Big 4 though\n3. There is still stress if you go here. I just took a linear algebra midterm today, and thank God corona got us all home. If I took the test in person, I probably would've failed it. Ironically, I've been studying using MIT OCW with Gilbert Strang. You will face difficult classes and nasty professors. If you're in CS, 104 is notorious for being time consuming, and our CS classes are in C++, which has a lot of idiosyncrasies that more modern programming languages don't have. It's not as if everything is easy here compared to MIT.\n\nIt's a difficult position to be in, and I relate to how your parents have been treating you. Reading this, you probably think that USC is terrible, but USC has been amazing. You get a more rounded college lifestyle and the people here are very collaborative (even the pre-med kids). Living in LA is so much more interesting than Boston. The professors are very approachable and easy to connect with. Also, for the housing app, if you made honors college (which you probably did if you got into MIT), choose McCarthy. There is absolutely no reason why you shouldn't. \n\nIf I had the choice all over again, between Rutgers, GT, USC, Cornell, and Cooper Union, I absolutely would pick USC or Rutgers (for the cost). Cornell honestly isn't even much of a consideration for me. If I had the choice between USC or MIT, it's a tough call, even without your parents weighing in. But if there's one thing I can guarantee you, it's that you really can't go wrong either way, and if you can manage your time well and seek out help when you need it, you will undoubtedly succeed. \n\nLet me know if you have any questions",
      "author": "whitelife123",
      "created": 1586240082,
      "upvotes": 4,
      "replies": {}
    },
    "fmo2o5t": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo2o5t/",
      "text": "[deleted]",
      "author": null,
      "created": 1586243175,
      "upvotes": 4,
      "replies": {
        "fmo3569": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo3569/",
          "text": "Holy shit thanks for the info dude",
          "author": "The1AndOnlyJZ",
          "created": 1586243667,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmo7wbo": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo7wbo/",
      "text": "I got into both USC and Yale when I was a hs senior. People were telling me I was being so stupid to choose USC over Yale because of the prestige and connections. I ended up choosing USC and dont regret it one bit. It really depends on what you want to do. Youre the only one who should decide since it's your life not theirs",
      "author": "fernthegreat",
      "created": 1586248713,
      "upvotes": 3,
      "replies": {}
    },
    "fmn7ale": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7ale/",
      "text": "Hey this might be a wild option but I wanted to throw it out there and see what other people say on it so u can make the best choice for yourself:\n\nWhat if u went to MIT for your freshman yr and (I'm assuming your parents will pay for MIT) if u dont like it, you can transfer to USC and take out less loans(assuming your parents choose NOT to pay for USC). Plus u make your parents content for now, take a chance for a year, and have the freedom to change to USC if u want. \n\nObviously downside is transfer hassle and moving across country and stuff",
      "author": "datscholar1",
      "created": 1586219713,
      "upvotes": 8,
      "replies": {
        "fmn81zd": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn81zd/",
          "text": "Man, I honestly thought about that but apparently transferring out of MIT is really hard after only one year (even harder than usual for a transfer) because the first year is a pass/fail grading system. There's no guarantee I'd get into USC or anywhere else anyway no matter when I'd try to transfer from MIT, and I got a half-tuition scholarship from USC that I would not be able to get if I went as a transfer later on",
          "author": "The1AndOnlyJZ",
          "created": 1586220176,
          "upvotes": 8,
          "replies": {
            "fmnh0kj": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnh0kj/",
              "text": "I agree with other commenter. From MIT, you should have a good shot at transferring to USC, although pass/fail could make it tough and u might be stuck there for 2 yrs idk.\n\nI'd say crunch the numbers and see what the cost is. If it's not close, go to USC for sure. However, if the cost isnt too far off, then u consider taking the gamble (after more thought and considering more factors)",
              "author": "datscholar1",
              "created": 1586225859,
              "upvotes": 5,
              "replies": {}
            },
            "fmnb3uv": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnb3uv/",
              "text": "Usually it’s easier to transfer to a ‘less prestigious and competitive’ college from a more ‘elite’ one, especially when the institution is MIT.\n\nI have asian parents and completely understand you but I still strongly would reconsider MIT.",
              "author": "Least-Awareness",
              "created": 1586222072,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fmnr92c": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnr92c/",
      "text": "(college admissions counselor here). Probably an unpopular opinion, but I would go to MIT, see how it is, and transfer out if you don't like it. You could even defer your USC admission if possible and have that as a back-up plan. I went to Cornell for undergrad and Harvard for grad school, and although people here may tell you education is similar across decent schools, a) I don't believe that. I sat in on my twin sister's classes at UMich and USC (her undergrad and grad schools) many times and there was no comparison in level, b) the amount of doors that the college name opens for you is unfathomable. As my dad says, you get access to \"a club\" for life, and it makes anything work-related (negotiating, starting your own business, etc.) easier because people see you as more competent and credible with that degree.\n\nIf you major in something that you actually like, the classes should be enjoyable even if you have to work hard. Don't you enjoy time spent learning things that fascinate you?  If you went to a competitive high school, no matter how hard you worked, college might surprise you in how \"easy\" it is, depending on your major choice and work ethic. In college I would do most of my work on the weekends so that during the week I could focus on going to class, working out, hobbies, etc. And in grad school, I taught 20 hours/week to cover living expenses and was fine. You really don't know how challenging MIT will be and you are being intimidated by its reputation. Tbh, Harvard was way easier than Cornell (Cornell had no problem failing me in Calculus lol); at Harvard (and maybe MIT too, many top schools) there's grade inflation and professors generally don't give less than B-.\n\n&#x200B;\n\nIf you go to MIT, you may be surprised. When I visited Cornell, I hated it. I found the campus too big, the people too preppy, and day I went was rainy. I wanted something smaller like Colgate. However, I wanted to study nutrition and Cornell had a better program so I went there. I feel like it was a 4-year vacation. Even if MIT is academically too much for you, you always have the option to transfer. Also, there are tons of mental health resources on campus included with your student health insurance, so even if you need weekly therapy or whatever as a crutch while adapting, you will have that option. I agree with your parents and think that you really don't know best at this point. Oftentimes, what we imagine or fear is the complete opposite of reality. I think you're overplaying MIT. Also, at Cornell and Harvard I helped tons of students and friends with their essays and tutored romance languages; I was also very social and active on campus. Point is, I met a lot of people and saw the quality of their work and their intelligence and was really only impressed with a handful of people. Not saying that I was \"better\" than them in some way, but that I had imagined this snooty Ivory Tower of little geniuses, which was the furthest thing from reality.\n\nAnyway, this is long. I just think you should have faith in yourself and give MIT a chance (Cambridge is so quaint, and Boston is fun) and if you really want to be in California, you can go there for Spring Breaks, summer internships, transfer if you hate MIT, or live there later in life. Most people in this thread have no idea what they're talking about because they're seeing things from a parochial view. We have one life that we know of. Get the best education you can, if it's too intense for you (which I doubt), transfer. Just try your hardest while being happy.  I think you're demonizing MIT--focusing on how you hated your visit, the horror stories you've heard, and how you think your mental health won't make it--because you don't think you will make it there and hence it's easier to reject it, than to try it and admit potential \"failure\" down the line. I do think if you go there, you will enjoy the lifestyle, your friends, your courses, and Boston/Cambridge. California will always be there; MIT won't. I just don't see why you wouldn't even give it a real shot when you can always transfer if it's too much. That seems like selling yourself short.",
      "author": "andieOO7",
      "created": 1586233072,
      "upvotes": 5,
      "replies": {
        "fmnro37": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnro37/",
          "text": "Damn... Thanks so much for the reply. You're right in that I'm letting myself get too scared of the name. I completely see what you're saying. This honestly has shifted my viewpoint on this decision a lot. Thank you so much.",
          "author": "The1AndOnlyJZ",
          "created": 1586233389,
          "upvotes": 3,
          "replies": {}
        },
        "fmnwx0r": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwx0r/",
          "text": "To address your point about schools being similar/not, I would say this largely depends on the major. I have sat in on quite a few upper div/grad engineering lectures at Stanford, Berkeley, and Michigan, and having graduated from GT, I will tell you all 4 of those schools offered classes of similar quality. While Ivy League schools may offer a dramatically better liberal arts education then their state school competitors, the same relationship between top privates and top publics is absolutely NOT true for some technical fields like engineering and CS. While schools like Stanford, MIT, CMU are top privates in engineering, their public rivals like Berkeley, Michigan, GT, UIUC are extremely comparable in terms of educational quality. This could in part be due to the fact that engineering is acreddited by ABET which forces standardization, but also because engineering in it's nature has well defined content. While I have never been to USC or MIT and sat in there, there are many equally successful USC and MIT grads at the company where I work. If I had to guess, USC engineering classes are roughly comparable to MIT.",
          "author": "calvins3141",
          "created": 1586237721,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmny6le": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmny6le/",
      "text": "What if you play a little poker? Call your parents' bluff by telling them you'll go to MIT only if they pay the full amount. My guess is they'll start thinking USC is a really good school.",
      "author": "baycommuter",
      "created": 1586238844,
      "upvotes": 3,
      "replies": {
        "fmnyagu": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnyagu/",
          "text": "LOL GOOD IDEA",
          "author": "The1AndOnlyJZ",
          "created": 1586238942,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fmo4e85": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo4e85/",
      "text": "hey op! Currently doing my Masters at USC and also went there for undergrad and have chinese parents and went to a pretty competitive high school/put pressure on myself to succeed and dealt with mental health issues throughout college lol. You're smart enough to think about more just college reputation. College is sooo much more than that. \n\nI'm not sure what your intentional major is, but I can speak about USC. What I love about USC is how they encourage students to take classes outside your department/cross major if possible. A major I always found interesting was CS/BA (Computer science/Business admin). Another major that is popular is IRGB (International relations/global business). There will be courses that will challenge you for sure from hearing my friends talk/my experience, but that's college. If you got elective spaces, highly suggest taking a film class as that's what USC is known for after all. I would also consider departmental resources. I was in Annenberg and Marshall, departments that are well-funded and well-connected lol. That has given them the room to host amazing networking events or guest speakers. \n\nMy peers at USC were extremely driven and that Trojan network has been real. I know I want to stay in LA because of my interests so I'm really taking advantage of that to grow my network. Some of my internships that I got was thru the Trojan network. USC is definitely a highly spirited school, probs the most spirited school I visited when I was doing my college tours back in high school. That was definitely a draw for me. I feel proud wearing my USC gear on campus/going around town in LA. It has been conversation starters with random strangers before haha. The weather is great too. But LA in general, is an amazing culture hub, especially if you're into entertainment, media, and tech (a growing area within LA/Silicon Beach). Feel free to PM if you got more questions! Congrats on both acceptances!",
      "author": "onpoint123",
      "created": 1586244971,
      "upvotes": 3,
      "replies": {}
    },
    "fmo7v2e": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo7v2e/",
      "text": "First of all, I'm sorry to hear about your parents, OP. Although they're entitled to have their opinions, you deserve to be supported no matter what choice you make. \n\nPersonally, I'm the happiest I've ever been at MIT and being in such a collaborative and high-energy environment has done wonders for my mental health--which I really struggled with in high school. The pressure of getting into college as well as other personal issues really excerbated my anxiety and depression. However, at MIT, I've found it really wonderful and liberating to be around people who are all really passionate about what they do and appreciate the cool things that other people do without feeling the need to compare. Sounds nerdy but I really enjoy my current research project (UROP) and I can geek out about it to someone I'm making small talk with without them judging, and then listen to whatever cool project they're working on! I'm really sad that this year's adMITs won't be able to experience our Campus Preview Weekend (CPW), which is usually an awesome chaotic jumble of fun events hosted by students/student groups/living groups across campus. I think I had similar struggles understanding if I truly wanted to go to MIT or if it was just for the prestige, and it was during CPW that me, and most students I know, really got to understand the MIT experience and appreciate the unique atmosphere on campus through conversations with both adMITs and students. If you're still uncertain about your decision, I encourage you to attend some of the informal virtual sessions that we'll be hosting (or reach out to me directly)! \n\nUltimately, if you got into MIT, it means that we know you'll be able to handle whatever academic challenges come your way. In terms of stress in the first year, MIT has mandatory PNR during the first semester, which gives all first years the opportunity to take a step back from the intense mindset towards grades they might have held during high school to explore  and find communities/groups/activities that they love. MIT also offers really accessible mental health counseling, which many students take advantage of (yay, no stigmas). We also have an awesome office called S\\^3 (Student Support Services) which you can talk to at any time if you're stressed or struggling with something and they can speak to your professors on your behalf. \n\nMIT doesn't accept the smartest individuals, they accept people who they see being happy and fitting into the on-campus community. For example, you mentioned you're an athelte. Athletics is a huge part of MIT student life, but not in the traditional sense. MIT does a lot to support its students athletes in pursuing their sport and all the athletes I know love being a part of their teams--it's just not a campus-wide spectacle sort of thing as it is at many state schools. In fact, because our dorms each have their own unique communities and culture (which is awesome), one of the dorms is sort of known as the place where a lot of athletes live and, as you can imagine, it's great being able to be around other athletes and live with your teammates if you are one. \n\nOverall, I just want you to know that you shouldn't doubt yourself because you have the capability to thrive at MIT. Take some time to engage with other adMITs and \"CPW\" events hosted by current students if you want to better understand the campus culture to see if you would enjoy it. However, you might ulimately find it not to be the place where you thrive the most--and that's okay!",
      "author": "impressionlevant",
      "created": 1586248673,
      "upvotes": 3,
      "replies": {}
    },
    "fmoey53": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoey53/",
      "text": "I haven't read through all the comments so I'm not sure if this has been brought up yet.... but please consider this:\n\n[https://web.mit.edu/facts/enrollment.html](https://web.mit.edu/facts/enrollment.html)\n\nMIT has 4530 undergraduates. (for 2019-20)\n\n[https://about.usc.edu/facts/](https://about.usc.edu/facts/)\n\nUSC has 20,500 undergraduates (for 2019-20)\n\nAll things being equal (pressure from parents, \"imposter syndrome\", fear of \"being destroyed\"/failure) - MIT's undergraduate community is not as huge as USC.   Please read MIT's statement of student support: [https://firstyear.mit.edu/tutoring-support/academic-support](https://firstyear.mit.edu/tutoring-support/academic-support) and review MIT's student resources: [https://resources.mit.edu/](https://resources.mit.edu/)\n\nIf MIT accepted you, they are confident that you will do well and are a good fit for their academic and social community.  I believe you will be amazing no matter where you go.  Do not let self-doubt, fear and tension with parents determine your future.  But just remember, no matter where you go you will face challenges (and celebrate successes!).  You will need to know how to ask for help and support from peers, faculty and administration.  My personal feeling is that MIT may provide better support and resources for you as an individual and student given the relative smallness of its undergraduate population.\n\n\\*Plus - Cambridge/Boston is awesome!!!\\*  (Source: husband went to MIT and I'm from Boston)\n\nGood luck in your decision making!  You got this!  Stay safe and healthy!",
      "author": "mitzvahmaven",
      "created": 1586256547,
      "upvotes": 3,
      "replies": {
        "fmpixd5": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpixd5/",
          "text": "Thanks so much!",
          "author": "The1AndOnlyJZ",
          "created": 1586281658,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmoljvh": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoljvh/",
      "text": "\"such a bad school like usc\" bruh, people are going to jail now to send their children to usc lmao",
      "author": "2020visiom",
      "created": 1586262690,
      "upvotes": 3,
      "replies": {}
    },
    "fmopnwu": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmopnwu/",
      "text": "Go to MIT. Take a gap year to de-stress. Take a light course load. Bet on yourself being able to handle the material, and bet on yourself finding better, more efficient, and even more relaxing ways to study. Here are 3 points that should highlight why you **will be told you're making the right choice** by Reddit, but you might not be:\n\n&#x200B;\n\n1) **If it's breaking you** in the first year, you can transfer to USC. I hate to be the \"MIT is more prestigious\" category, but this will open so many doors for you you can not even fathom; to base your decision here based on **an emotion** (the anticipation of stress) rather than **logic** (what steps can I take here to prevent it, what are the people that are at MIT and **not** stressed doing right) is nefarious to yourself, and self-destructive!\n\n&#x200B;\n\n2) In addition, make the following distinction: **Your GPA in high school determined your future. Therefore, you felt stress over your GPA.**\n\n**Your GPA in College does not determine your future. Employers are looking at it less than** ***ever*** ***before***\\*\\*. It is arguably okay to graduate with a 3.0 - imagined a chill, hardworking, but not-so-intense academic life wherein you get great grades, but don't stress and strain to the point of depression for them!\\*\\*\n\n&#x200B;\n\n**3) The actual in-course material at MIT vs USC are not going to be dramatically different.** Harvard students say this all the time. There is this cloud of illusion \"from the outside\" that makes it seem like one is dramatically harder, superior, and more difficult than the other; as if it's a higher tier of education. In truth, classes might be a bit more challenging, but we truly, genuinely live in a world where **GPA is just not that important anymore,** ***great*** **academics in college are just not that important anymore, curriculums are relatively the same in \"raw difficulty\", and college name & prestige carry** ***far more weight than ever before.***\n\n&#x200B;\n\nConsider that colleges don't scale with population size. The level of distinction between you and the rest of your cohort/age group in your major (as a percentage) is going to be so dramatically higher from MIT that it's mind-boggling now!\n\n&#x200B;\n\n**Don't make this life-changing decision based on negative emotions (fear, anxiety, depression, the fear of anxiety, the fear of depression). Genuinely bet on yourself doing well, and living in an adapted world.** Also, consider that the type of people you meet will also dramatically change your experience... you might meet people at MIT in your classes who help you reason in new ways that make course material super fucking easy.\n\n&#x200B;\n\n**Go to MIT. 100% take a gap year. And keep USC as a back-pocket option. Take it utterly easy on yourself for your first year GPA-wise - GPA is not that important anymore, but college name is more important than ever (from an employer's perspective).**\n\n&#x200B;\n\nGo get em :)",
      "author": "SexyTheSex",
      "created": 1586265717,
      "upvotes": 3,
      "replies": {
        "fmpf1fr": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpf1fr/",
          "text": "Thanks so much for the advice. I think my mental health has been improving slowly during this huge break due to COVID-19. Our family will be moving to Maine this summer so I’m not so sure if I would want to stay with them for another year in a place I wont really have any connection with. Any ideas as to why I should or shouldn’t take a gap year?",
          "author": "The1AndOnlyJZ",
          "created": 1586279678,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmp6acl": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp6acl/",
      "text": "I, like you, have Chinese \"tiger\" parents. I also know however, that no matter how badly I've fucken up over the past years, they've still \"loved\" me just the same amount. I can't speak for your family, but I'm sure that once they get over it, they will recognize that USC is a great school.\n\nI dunno if that helped, but just wanted to let you know there are others like yourself out there in similar family issues",
      "author": "Dogsidog007",
      "created": 1586275228,
      "upvotes": 3,
      "replies": {}
    },
    "fmp7fvf": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp7fvf/",
      "text": "sorry im late, I was actually in your situation a couple of weeks ago. I got accepted into a top 10 music school with arguably the best wind ensemble in the country and was ecstatic when I was accepted and it had everything I had thought I'd wanted, big school, big name, big programs, good reputation and I was able to be on campus and liked it. but then I got accepted into a state school, much much smaller, no big name, no low acceptance and for me I ended choosing the smaller school, there were a couple reasons but one I think you'd resonate with is competition. I was told literally by the professor of \"big school\" that it would be naive to say that all interactions and competition there would be healthy, and I know at small school 100% there would never be anything or anyone to be toxic or the like, and I know I can succeed better if I go into a smaller and more friendly environment. Also seeing that you VISITED campus and didn't see yourself there is HUGE. DO NOT GO if you got negative energy from the campus! You can be successful coming out of any school especially undergrad, honestly I've only ever talked to musicians about where they studied and no other professional, and honestly you'll probably get the same level of education from either school. Don't let your parents pressure you into these decisions, I don't know your financials but Ill guess it'll be you to take on debt (if even you have any) and in a couple of months you won't be living with them and Im going to assume you won't ever permanently live with them again. Do whats right for you!! Good luck :)",
      "author": "bigboogahooga",
      "created": 1586275840,
      "upvotes": 3,
      "replies": {
        "fmph60h": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmph60h/",
          "text": "Thanks so much!",
          "author": "The1AndOnlyJZ",
          "created": 1586280756,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmp8w9z": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp8w9z/",
      "text": "Go to MIT. It'll be fine and after 4 years you'll be free to do whatever you want for the rest of your life. The people telling you to go USC are just jealous and trying to sabotage you imo.",
      "author": "RebelProgression",
      "created": 1586276587,
      "upvotes": 3,
      "replies": {
        "fmpdqo0": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpdqo0/",
          "text": "this",
          "author": "lau1104lau1104",
          "created": 1586279015,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmn778i": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn778i/",
      "text": "[deleted]",
      "author": null,
      "created": 1586219653,
      "upvotes": 7,
      "replies": {
        "fmn7w4w": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7w4w/",
          "text": "I'm currently considering Applied Math, CS, Economics, Chemistry, and Environmental Science/Engineering (my parents even disapprove of those latter two options lol)\n\nI got a half-tuition scholarship at USC which brings the price down to 48k/year. MIT I got absolutely no aid and it would cost me about 77k/year. My parents told me they'll pay 40k/year of my tuition and the rest of it will be up to me.\n\nI completely understand your viewpoint and no doubt will I be thinking right into May 1st about this decision.",
          "author": "The1AndOnlyJZ",
          "created": 1586220077,
          "upvotes": 4,
          "replies": {
            "fmnav4n": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnav4n/",
              "text": "Oh. That’s why you go to USC. Tell them you’re not willing to take on 100k extra in loans. USC will also be hard. But that loan debt will cause you much bigger issues into your adult life than school stress will. \n\nIf they fight you, remain calm and note that if they want to cover the extra you’ll considerate it. Honestly I’d put them on blast for it. Tell some family friends about your situation. The loans, not the stress part. They’ll agree with you if they’re sane. \n\nIn general, I have a problem with parents forcing their kids towards certain schools without also being willing to fit the bill. Student loans can and have ruined lives. It shouldn’t be their call what your financial future looks like.",
              "author": "CollegeWithMattie",
              "created": 1586221916,
              "upvotes": 17,
              "replies": {}
            },
            "fmn8mjw": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn8mjw/",
              "text": "Will they pay for any of usc?",
              "author": "notveryGT",
              "created": 1586220526,
              "upvotes": 2,
              "replies": {
                "fmn8pu6": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn8pu6/",
                  "text": "Well they promised me before the application season started that they would do the 40k/year promise no matter what... seeing how pissed they are now though I'm not completely sure if they will",
                  "author": "The1AndOnlyJZ",
                  "created": 1586220579,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "fmn8stl": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn8stl/",
              "text": "[deleted]",
              "author": null,
              "created": 1586220630,
              "upvotes": 1,
              "replies": {
                "fmn945h": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn945h/",
                  "text": "Some things I'm considering are working on sustainability, CS at a tech company, and business analytics. Honestly, I'm really undecided right now but those are the basic directions I think I might wanna go down.",
                  "author": "The1AndOnlyJZ",
                  "created": 1586220820,
                  "upvotes": 2,
                  "replies": {
                    "fmnar9h": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnar9h/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1586221849,
                      "upvotes": 1,
                      "replies": {
                        "fmnbq4j": {
                          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnbq4j/",
                          "text": "This is my results post which has my profile: [https://www.reddit.com/r/collegeresults/comments/fqkvdf/asian\\_stem\\_male\\_w\\_almost\\_no\\_hooks\\_amazing\\_ea/](https://www.reddit.com/r/collegeresults/comments/fqkvdf/asian_stem_male_w_almost_no_hooks_amazing_ea/)",
                          "author": "The1AndOnlyJZ",
                          "created": 1586222470,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fmnszrw": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnszrw/",
              "text": "Imo, considering price is short-sighted when you're talking about a school like MIT. Look up articles with schools that have high Return on Investments. MIT is always up there (for example: [https://thebestschools.org/rankings/private-colleges-best-roi/](https://thebestschools.org/rankings/private-colleges-best-roi/)). I had \\~125k in loans after my schools but paid them all down in 1.5 years of a full-time job and a LOT of hustle. I was also an expat so had lower taxes, but still. If you graduate from MIT you will most likely have a high starting salary and pay down your loans within a few years. And the ROI will be much more than at 99% of schools, probably including USC though don't quote me on that. I see your parents' point -- they are trying to guide you toward what they believe will give you the best opportunities in life. Unless they only care about bragging rights to their friends, which I doubt, your parents likely want the best for you. Based on their experiences, they believe MIT is the best and I think you should see that with a more open mind. They want your well-being overall, and if MIT starts to degrade your mental health, I doubt they would complain if you wanted to transfer. Anyway, it wouldn't matter at that point. I used to be like you but the older I get, the more I prefer to not make my own mistakes (I've made enough for a lifetime during college) and to listen to the advice of my parents. I don't always agree with them, as you clearly don't, but you should believe they have good intentions and have thought this through also.",
              "author": "andieOO7",
              "created": 1586234432,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "fmnkmko": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnkmko/",
      "text": "USC is one of the best schools in the country. Your parent need to insult themselves. They clearly haven’t done any research to help you choose the right college.",
      "author": "Rit0tiR45",
      "created": 1586228265,
      "upvotes": 4,
      "replies": {}
    },
    "fmnh7yn": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnh7yn/",
      "text": "One thing you might want to consider doing is [deferring your enrollment](https://mitadmissions.org/help/faq/deferred-enrollment/) if you aren't entirely sure by May, and it might still be acceptable from your parents' standpoint.",
      "author": "Amosqu",
      "created": 1586225994,
      "upvotes": 2,
      "replies": {}
    },
    "fmnjita": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnjita/",
      "text": "I was gonna ask if they’re Chinese and here it is lol",
      "author": null,
      "created": 1586227516,
      "upvotes": 2,
      "replies": {}
    },
    "fmnolfl": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnolfl/",
      "text": "Hey OP! I'm a current student at MIT if you want to talk about anything :) I'm not going to try to make you go to MIT -- I also had some doubts about choosing where to go and if you want to chat I am here for you! <3",
      "author": "cloudyskies19",
      "created": 1586231075,
      "upvotes": 2,
      "replies": {}
    },
    "fmnoxwv": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnoxwv/",
      "text": "Hi, current MIT student here that used to be on this sub forever. (Was a mod for a while). I ended up trying to decide between USC and MIT and it was the hardest thing ever.\n\nPm me to talk about everything MIT to help you make a decision -- the good, the bad, the ugly.",
      "author": "ivsamhth5",
      "created": 1586231333,
      "upvotes": 2,
      "replies": {}
    },
    "fmnpwua": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnpwua/",
      "text": "No one ever talks about the weather. I know several people from California who could not take the Massachussetts winters. It can be pretty cold and miserable and if that is on top of general unhappiness then you really need to factor in how that will impact you.",
      "author": "VROF",
      "created": 1586232050,
      "upvotes": 2,
      "replies": {
        "fmnpz1x": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnpz1x/",
          "text": "I'm actually from the Midwest so that won't be too too bad -- but yeah I'd prefer Cali's weather for sure",
          "author": "The1AndOnlyJZ",
          "created": 1586232094,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmns894": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmns894/",
      "text": "Is there an option other than USC and MIT?\n\nAlso, you have three more weeks to resolve this. Don't feel stressed out.",
      "author": null,
      "created": 1586233826,
      "upvotes": 2,
      "replies": {
        "fmnsk1f": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnsk1f/",
          "text": "I have UNC and UMich, but I'd definitely prefer USC over both of them in terms of location, culture, and price",
          "author": "The1AndOnlyJZ",
          "created": 1586234087,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fmnsn5k": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnsn5k/",
      "text": "One thing to note is that while yes MIT is hard, you still deserve a spot there. The admissions committee concluded that you will succeed at the school better than at least 95% of the other applicants. So yes they have horror stories but perhaps, especially with the high graduation rate, it's not as bad as it can be made out to be. Just a thought.",
      "author": "Hpotter134",
      "created": 1586234154,
      "upvotes": 2,
      "replies": {}
    },
    "fmnssex": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnssex/",
      "text": "I really feel for your situation. Maybe there is a chance you could have the best of both worlds? Maybe do some research to see how much academic freedom MIT would give you and if it would be feasible for you to put together “an easiest course possible” schedule for yourself there? I’ve been researching this about Stanford because I feel very similarly to you about the pressure and stress and one thing I really like about Stanford is that you have people who have put together their schedule in ways where they’re doing 3 hours of homework everyday and there are others who have schedules with 45 minutes of homework (bare minimum and possibly only Freshman year). Again, I think you’re very smart for prioritizing your well-being and happiness this early in life, but it would also be a missed opportunity to get an MIT degree if there is some way you could both attend the school and feel good about yourself. I would also wager that many of those “nightmare cases” are probably the students who are really pushing themselves—you don’t have to do that. Anyways, these are just the thoughts of another Senior in a similar situation.",
      "author": "GreenPirelliBoy",
      "created": 1586234271,
      "upvotes": 2,
      "replies": {
        "fmnt578": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnt578/",
          "text": "You're completely right that I do have control over my schedule -- the insane thing is though that you're here talking about Stanford having 45 minutes to 3 hours of homework a day... the kids I've talked to from MIT are doing about 5-8 hours of homework a day... absolutely terrifying to me",
          "author": "The1AndOnlyJZ",
          "created": 1586234554,
          "upvotes": 3,
          "replies": {
            "fmntv2o": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmntv2o/",
              "text": "The examples I used for Stanford were more humanities/social sciences majors. Engineering probably would be more work—that sounds terrifying. Maybe try and get second, third, fourth opinions on how much work there is? Ask around on r/MIT ?",
              "author": "GreenPirelliBoy",
              "created": 1586235135,
              "upvotes": 1,
              "replies": {
                "fmntynh": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmntynh/",
                  "text": "I've asked a lot of people and it's mostly been that general consensus, but I'm definitely going to be talking more and more before the deadline -- it is so scary and that amount of work seriously just sounds like hell sometimes",
                  "author": "The1AndOnlyJZ",
                  "created": 1586235216,
                  "upvotes": 1,
                  "replies": {
                    "fmnud6x": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnud6x/",
                      "text": "Some concrete advice that I could give you though is to not wait to truly commit until as late as possible—just in case you find the hope that you could get the best of both worlds at MIT.",
                      "author": "GreenPirelliBoy",
                      "created": 1586235545,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fn44htr": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fn44htr/",
              "text": "In my experience (Stanford 2015 CS grad) you can load yourself with as much work as you want. 45 mins to 3 hrs is possibly valid even for engineering majors, I had some quarters where I did basically 0 homework and some where I was doing 20-40 hrs/week and it’s possible to graduate at either end of the spectrum. I don’t think I was ever doing 8 hours/day of homework though, even In my most challenging quarters",
              "author": "grovemau5",
              "created": 1586633884,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fmnsz8m": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnsz8m/",
      "text": "what are the horror stories that you have heard?\n\nit's YOUR choice, not your parents'\n\nedit: also, have you joined the MIT discord server to see what answers you'll get there? disclaimer: it's more biased for first-year students",
      "author": null,
      "created": 1586234420,
      "upvotes": 2,
      "replies": {}
    },
    "fmnw9gt": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnw9gt/",
      "text": "People keep talking about whatever makes you happy but you should consider the long-run outcomes and not whether you're happy these four years. Consider whether this will benefit you when you're 80 years old. Teenagers often lack foresight so I suggest you seek out trusted adults who aren't your parents for their advice.\n\nAlso MIT has easy classes and easy majors like any other school. People say UChicago is hard too but that's BS.",
      "author": "DarkSkyKnight",
      "created": 1586237143,
      "upvotes": 2,
      "replies": {
        "fmnwhd7": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwhd7/",
          "text": "For sure -- I've already talked with my sister for hours about the situation and I'll be trying to talk to some of my teachers as well",
          "author": "The1AndOnlyJZ",
          "created": 1586237334,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmnwsy8": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwsy8/",
      "text": "I want to mention some key pointers. You bro have worked hard. There is no doubt, right? For ? This time. I want to try to raise a point here. You're not stupid and once you're in that environment and then you see a different school. It's gonna be difficult. I'm just saying that Boston isn't a bad place. If you're thinking of partying, then Boston is okayish, but most places close by 10. But if you want to study, and you have a goal to maybe Change something in the world and what not, you can do anywhere, BUT the teachers matter. You can get great faculty advice in MIT. I've lived in boston and it seems like a pretty dead city to me, and I've seen mit campus (it's no great). Kid I'm in final year college. I got a sat 1330(not great ik but without studying) but let an opportunity slip, and then am here in another country in a stupid Engineering program. This brings you forward for 15 years if you take it(just an extra push). You may be able to do the same stuff in other colleges but you also may not. Mit according to me has another advantage. Harvard closeby. One of my friends at harvard dragged me with him to mit and he spammed every single professor out there to work under them and he went to their office because it was close by. You get an added advantage there.\nAnd you just gotta put on a happy face and go to school. You never knew what strikes next. Maybe USC isn't a fairy tale too. You'd have to make contacts at both places. USC would have great people too but here  added advantages. + If your parents can afford it, then go for it kid.",
      "author": "sahnisanchit",
      "created": 1586237619,
      "upvotes": 2,
      "replies": {}
    },
    "fmo048e": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo048e/",
      "text": "You’re very smart and I wish I had come to the realization you did. I was miserable throughout college because I picked it simply due to prestige and it almost killed me. Go to USC.",
      "author": "SloaneSoleil",
      "created": 1586240648,
      "upvotes": 2,
      "replies": {}
    },
    "fmonn47": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmonn47/",
      "text": "I really do feel for you. All my life my parents and family and friends were always like “you’re gonna go to MIT” and for the longest time I really did believe that MIT was my dream school. I mean like how could it not be? I loved STEM and like MIT is the place for STEM. Ergo, it’s my dream school. And these feelings were still with me even when I got my decision letter. I was so nervous and scared and when I found out I got in I was unbelievably happy I broke down crying. I had gotten into my dream school. I applied to other schools and would wait for them to come out but I knew I wanted to go to MIT. But then as the year progressed and I really researched MIT and then looked at other colleges I had gotten into I realized that MIT really never was my dream school. It was my parents dream school. The more and more I thought about it the more I realized I won’t be happy there and that’s the most important thing in college. I’ll admit I was scared to tell my parents that I no longer wanted to go to MIT but I just knew I couldn’t let myself spend four years at a place that won’t truly make me happy. I’m truly sorry that your parents have put up such strong opposition to your decision. But I believe that college is a time for you to not only get a great education but to explore new things and to find yourself. College is supposed to help you grow and be a better person and if a certain place will only tear you down and break you down than that’s not the place for you. The education doesn’t matter unless you’re in a healthy state to be receiving that education. I know it’s tough to like think about going to another school when it’s MIT and like IT’S MIT and it’s absolutely incredible especially when you’re meeting resistance from your parents or peers. But in the end, go wherever you feel most comfortable where you can feel happy because that’s where you’ll be able to thrive and really get the most out of your college experience. I hope this helps sorry it was a bit long.",
      "author": "spiceyriceylowpricey",
      "created": 1586264292,
      "upvotes": 2,
      "replies": {
        "fmpejbq": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpejbq/",
          "text": "This sounds exactly like what I’m experiencing — thanks so much for the advice",
          "author": "The1AndOnlyJZ",
          "created": 1586279424,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmotiy0": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmotiy0/",
      "text": "I live about 45 minutes outside of Cambridge, it's a beautiful city. I love going into Cambridge, there are so many eclectic shops and amazing restaurants. Kendall Square (where MIT is) is my favorite area in the city. Kendall Sq. is awesome, there is so much to do there. Will you be able to enjoy the area if you're unhappy? - No.\n\nMIT is a fantastic school,  no doubt but you need to decide for yourself whether or you'll be happy there. 10 years out of school no one cares where you went, they care about is how you're able to apply the skills that you've learned. It's not like USC has a super high acceptance rate, it's still very competitive. USC's acceptance rate is only \\~3% lower than Cornell's.",
      "author": "hyperactiveputz",
      "created": 1586268160,
      "upvotes": 2,
      "replies": {}
    },
    "fmoxi2y": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoxi2y/",
      "text": "Well I don’t think you should take advice from people on the internet lol, but since you asked, I would say go wherever you will enjoy the most. At the end of the day, the college or university you attend will not matter much once you graduate and go into your career. Both USC and MIT are great school and I’m sure that whichever school you choose to go to, you will definitely make it into your career of choice, whatever that may be. I wouldn’t even take into account where your parents want you to go because it is most likely driven by their desire for a good image within their social bubble, which is disgusting. I have asian friends and it disgusting how much their parents care about their image and how they force their kids to do things for THEIR OWN IMAGE. Your life belongs to you. Don’t let your parents own your life choices.",
      "author": "z_brown67",
      "created": 1586270441,
      "upvotes": 2,
      "replies": {
        "fmpgk2o": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpgk2o/",
          "text": "🙏",
          "author": "The1AndOnlyJZ",
          "created": 1586280448,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmoxvm8": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoxvm8/",
      "text": "i personally feel like you should choose USC. \n\nother than the fact that it sounds like it’s more fitting for you (which is important), it seems like you also really love the school. as you said you’ve been a “sheep” to your parents and listening to what they’ve been telling you since middle school. but right now you’re standing up to them for this school. it takes a lot to break out of a cycle and especially go against your parents, because for a lot of people their parents’ word is law. however, USC clearly means a lot for you to stand your ground and argue for it. so i think you should keep fighting for it. best of luck :)",
      "author": "hoekisspokeis",
      "created": 1586270653,
      "upvotes": 2,
      "replies": {}
    },
    "fmoywi2": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoywi2/",
      "text": "USC is an amazing school. It’s not MIT but there are people who would kill for the opportunity to go there. And I bet in another household there’s a kid similar to you who got into USC but doesn’t want to go there his parents are pressuring him. It’s still a top 20 school!!! And honestly wether you go to MIT or USC you’re going to get a great job out of it and in 20 years you won’t look back thinking about how much your university helped you academically. You’ll be thinking about the memories you had while you were there, and if those memories were shit and stressful you won’t be too happy.",
      "author": "chilledball",
      "created": 1586271219,
      "upvotes": 2,
      "replies": {}
    },
    "fmp4xfr": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp4xfr/",
      "text": "FIGHT ON!!!",
      "author": "larrylobster8",
      "created": 1586274508,
      "upvotes": 2,
      "replies": {}
    },
    "fmp5bpq": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmp5bpq/",
      "text": "Meanwhile USC is still fucking USC. Good luck man, you’ll do great no matter where you go!",
      "author": null,
      "created": 1586274715,
      "upvotes": 2,
      "replies": {}
    },
    "fmo14vx": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo14vx/",
      "text": "go to MIT loooooooool the impostor syndrome will get better the fact that you didnt go to MIT when you got in wont please go to MIT LOL",
      "author": "spookyspicyfreshmeme",
      "created": 1586241631,
      "upvotes": 4,
      "replies": {}
    },
    "fmn7dyj": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7dyj/",
      "text": "Seems like your parents haven't bothered to do jack shit in the way of doing any substantial research on either one of those schools and not which one has more internet points in whatever category, but whether its a best fit for you.",
      "author": "icebrgr",
      "created": 1586219770,
      "upvotes": 2,
      "replies": {}
    },
    "fmn7z38": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7z38/",
      "text": "Go to MIT man, if I had that opportunity of going to MIT, I would have taken it in a heartbeat. Give your best for the duration of MIT, after that take a break for a while to refresh your body and mind. Apply for a job you want, enjoy.",
      "author": "bunkclass",
      "created": 1586220127,
      "upvotes": 1,
      "replies": {}
    },
    "fmnoia4": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnoia4/",
      "text": "Something my dad told me that always stuck with me - the college process only begins once you’re accepted. \n\nDeciding on a college isn’t just a “oh well this ones ranked higher than this one” situation. Don’t be afraid to sacrifice a programs ranking in favor of something else.\n\nHows the campus feel to you?\n\nDiversity?\n\nWhat programs are offered on campus that you can do when you’re not studying?\n\nHow’s the area around it?\n\nIs the food good?\n\nParty scene?\n\nCost?\n\nHow good is the teaching?\n\nAre you happy with the way the dorms look?\n\nKeep in mind that that this isn’t high school, you’re not deciding on a school to go to from 7-2 everyday only to come home. You’re LIVING there (unless you’re not, then different story). You can be in the best ranking program ever but if you’re not happy with the way you’re living, was it really worth the cost?",
      "author": "ilikepieyeah1234",
      "created": 1586231013,
      "upvotes": 1,
      "replies": {}
    },
    "fmnpyws": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnpyws/",
      "text": "This one's on you. At the end of the day, you will bear the burden of your decision. Even if you are miserable at MIT, your parents will proudly tell everyone you go there and even if you excel at USC, they'll tell people you could've gone to MIT. For once, see past the bullshit of the rankings and prestige and find the place that'll be the best for you, as a student and a human being.",
      "author": "Yung_Rouleur",
      "created": 1586232091,
      "upvotes": 1,
      "replies": {
        "fmnxeml": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxeml/",
          "text": "Yes, thank you for this",
          "author": "The1AndOnlyJZ",
          "created": 1586238149,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmnqvc0": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnqvc0/",
      "text": "Have you thought about transferring? Maybe you can see if you like it and the. If you don’t just transfer. You will have a lot more freedom that way cause you are at college and more independent. Might wanna talk to an admissions counselor on how realistic transferring is.",
      "author": "GCcomic",
      "created": 1586232785,
      "upvotes": 1,
      "replies": {}
    },
    "fmnsry4": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnsry4/",
      "text": "I had to choose between Georgia Tech and UIUC, which is a different comparison since both are like in the top 10 in the CS industry (though Tech is prestigious overall vs. UIUC only being prestigious for engineering). I ended up choosing UIUC since its a fuller college experience and less stressful, and I'm prone to stressing out even over shit in high school, so Tech would be a bad for my mental health",
      "author": "Susurruz",
      "created": 1586234261,
      "upvotes": 1,
      "replies": {}
    },
    "fmntlca": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmntlca/",
      "text": "this is my exact situation with usc and caltech 🥺🥺 my parents don’t want me to go to usc but i don’t know if caltech is the place for me",
      "author": "winteraurora",
      "created": 1586234919,
      "upvotes": 1,
      "replies": {
        "fmntpai": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmntpai/",
          "text": "Luckily for me I got rejected from Caltech so I don't have to make that decision\n\nOn a serious note, yes this is so tough and I don't know how we're going to be able to decide :\\\\",
          "author": "The1AndOnlyJZ",
          "created": 1586235006,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmnuz5f": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnuz5f/",
      "text": "I feel you OP, the best thing I can tell you is go with your gut. As much as our parents want the best for us, at the end of the day we're the ones that are going to be putting in the time and work to make that happen. USC has made a very good name for itself in many careers and it is a fine choice for any. At the end of the day, sure some doors will open up to you if you go to MIT that otherwise wouldn't, but USC will open up several doors for you as well. I think that prestige is a minute factor in choosing a college. MIT and USC carry you to a certain point, what'll carry you past that point is what I call the you component (your values, ethics, creativity, etc.). The reason why MIT has such a high employability rate is because the students that go there end up developing their you components well, and this is because they fit with the school's vibe. If you think that USC will give you a better you component and better promote your growth then that's the school for you. If your parents don't understand your choice now, prove them wrong in the future. Trust me, if you go to MIT and you end up doing poorly because you don't fit with the program, they'll probably find a way to pin that on you anyways (I speak from personal experience). People will always find a way to blame whoever they want to blame.",
      "author": "frankiecastpenn",
      "created": 1586236044,
      "upvotes": 1,
      "replies": {
        "fmnw10h": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnw10h/",
          "text": "FACTS FACTS FACTS thanks so much for the advice dude",
          "author": "The1AndOnlyJZ",
          "created": 1586236936,
          "upvotes": 2,
          "replies": {
            "fmnwapr": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwapr/",
              "text": "No problem my friend! I'm rooting for you no matter what you end up going with.",
              "author": "frankiecastpenn",
              "created": 1586237173,
              "upvotes": 1,
              "replies": {
                "fmnwi6t": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwi6t/",
                  "text": "<3",
                  "author": "The1AndOnlyJZ",
                  "created": 1586237354,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fmnv61m": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnv61m/",
      "text": "I am literally in the same boat except I didn’t get accepted to mit",
      "author": "LividOrange1",
      "created": 1586236204,
      "upvotes": 1,
      "replies": {}
    },
    "fmnv65e": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnv65e/",
      "text": "I feel you. I got into UT but soon not even happy but freaked out because of the fear for my mental health. I talked to my parents and expressed how I wanted to attend University of Miami since I got into Marine Biology - my favorite major.\n\nMom said I’m crazy and she’s not paying the deposit  so I’m stuck in Texas lol. \n\nI hope you can talk to your parents :( UMiami has been sending me all these stuffs about the school and I feel extremely bad.",
      "author": "duskndawn162",
      "created": 1586236206,
      "upvotes": 1,
      "replies": {}
    },
    "fmnvabe": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnvabe/",
      "text": "I read all the replies on here and no one noticed the time-sensitive issue: what if corona affects entrance? Personally, I’m struggling to choose between Georgia Tech and Northeastern, also because of the stress culture. If we’re not allowed on campus in the fall, and worst comes to worst into spring of 2021, that could set a sour taste for the school for the coming years if you have to endure MIT online as opposed to in a classroom, held accountable to pay attention. Certainly not a deciding factor, but maybe something to think about? Regardless, congratulations! Both are excellent options!",
      "author": "jonah_sachs",
      "created": 1586236303,
      "upvotes": 1,
      "replies": {}
    },
    "fmnvd5x": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnvd5x/",
      "text": "Hey just wanna validate you a little bit, one of my close friends is one of the smartest people I know; he led our robotics team to worlds after we had never made states before, he made usaco plat, he worked at microsoft over the summer, all while regularly playing piano and tennis too. Last year he got accepted to MIT and Caltech, and probably some other really good schools too, and he turned them all down for USC. Since I'd always wanted to go to MIT, I asked him why he chose USC, and he said that their really intense academics were only a small part of the reason. I don't remember any of his other reasons cause this was like last year but USC was a better school for him than MIT.\n\nIt made me question whether or not I actually wanted to go to MIT, and though I ended up deciding that I did, I realized I would be just as happy at my other top choices. Ultimately my decision wasn't about rankings, but about how much I vibed with the culture at each school. I hope your parents realize how good of a school USC is, and more importantly, how much better of a school it is for you.\n\nEdit: if it helps, I am also a good bit terrified of the academic rigor. If you're not on the group chat already, I can share it w you and you can gauge other people's feelings as well.",
      "author": "Hazel-Ice",
      "created": 1586236368,
      "upvotes": 1,
      "replies": {}
    },
    "fmnvdif": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnvdif/",
      "text": "Dude honestly MIT and USC are both going to be equally hard and the learning environment at MIT will make it way easier to do well at MIT.",
      "author": "ranch-me-brotendo311",
      "created": 1586236376,
      "upvotes": 1,
      "replies": {}
    },
    "fmnvohx": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnvohx/",
      "text": "Personally, I live for the struggle and I hope that getting up everyday and doing the things that I think can break me makes me a much more resilient and strong person. In light of that, I wanted MIT’s academic rigor coupled with a double major and research(can I manage this? Probably not but pushing myself is how I grow). Yet at the same time, I had your doubt: what if, God forbid, I take my life because of stress? Mental health is seriously important and the only reason I shrug it off is a vague confidence that I will never give up(not very reassuring). \n\nIn your case, I definitely would advise against you going if you really do not believe you are up for the challenge and even more so if you don’t know what you’re doing it for. Another big thing is the campus: when my friends congratulate me I always mention that it really is a great school but a numerous people would be depressed because of the lack of greenery and the cold. You made the right decision and I wish you luck in communicating that to your parents who will, in all likelihood, remember that their love for you is not conditional on your decisions or what they perceive as your “achievements.”",
      "author": "Tyrifian",
      "created": 1586236634,
      "upvotes": 1,
      "replies": {}
    },
    "fmnwuc8": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwuc8/",
      "text": "I'm having trouble with my parents as well, though on the other end of the spectrum. I didn't get in any reaches that they hoped too much for and were beyond disappointed with my \"average\" colleges that they never thought I should go to. Every time I try to talk to them about deciding which school, they start grinding into me that \"none of them are good\" and \"I could have done better\". They were completely revolted by the idea of me not trying hard enough in their eyes to get in schools they want, so much so anything I got was practically nothing. As if choosing between my schools is a \"choosing between lesser evils\" situation, other than financial aid. \n\nI just want to say if you can, do what you want. Life's too short to be tied up in \"I wasted my parents' hopes and efforts because I didn't go to X school\". Different paths can lead to the same destination, and sometimes our parents who have a different perspective won't understand that, and that's fine. Don't doubt yourself that you \"aren't trying hard enough\" or \"took an easy route\", because there's nothing wrong with making a choice you believe best for you. : D",
      "author": "ADY_YDA",
      "created": 1586237653,
      "upvotes": 1,
      "replies": {
        "fmnxpu5": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxpu5/",
          "text": "Thanks so much man. Don't let your parents tie you down either -- an acceptance letter doesn't make you anymore of a person",
          "author": "The1AndOnlyJZ",
          "created": 1586238428,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmnxh21": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxh21/",
      "text": "Hey OP—I go to mit (a sophomore now). I think you guys got matched with people for cpw (everyone ?) but if you need another perspective or want to talk about anything, let me know. I like it a lot here, and it really sucks that you guys don’t get to come to CPW to check it out.",
      "author": "Theyellowtoaster",
      "created": 1586238211,
      "upvotes": 1,
      "replies": {}
    },
    "fmnzj0a": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnzj0a/",
      "text": "I’m sorry to hear that. As someone with Chinese parents, I was also raised to value grades and study hard. However, they also know that there’s more to life than just good grades, and support me in what ever college I choose as long as I am happy. In the end, I chose USC over NYU stern even though I know Stern is more prestigious and academically rigorous, because I know I will be miserable at Stern. I hope you follow your heart and make a decision that will make you happy in the end! :)",
      "author": "readilyreadit",
      "created": 1586240096,
      "upvotes": 1,
      "replies": {
        "fmo04e9": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo04e9/",
          "text": "Thanks so much! Maybe I'll see you on campus next year",
          "author": "The1AndOnlyJZ",
          "created": 1586240652,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmnzqf5": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnzqf5/",
      "text": "Please reach out to me if you want to talk more about MIT and hear a differing perspective. MIT has been an amazing experience for me so far, and though I know it’s different for everyone, perhaps my time at MIT can shed some light on the MIT experience.\n\nThat being said, please prioritize doing what is right for you. Your parents may have some harsh words for you, but it’s you who has to live with your decision for the next four years. Do not choose something you feel pressured into choosing, ESPECIALLY MIT. Stay safe and good luck :)",
      "author": "mpnobivucyxtzrewq",
      "created": 1586240289,
      "upvotes": 1,
      "replies": {}
    },
    "fmo0ame": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo0ame/",
      "text": "hey op, hope this helps:\na family friend of mine got into MIT, CMU, and GaTech for CS (probably some other t20's as well). he chose UF. he works at Amazon now, so i'd say he turned out well. he turned down MIT, CMU, and GaTech, because, at the end of the day, prestige is bullshit to how it should affect where you wanna go. \nUSC, by all means, is an AMAZING school and if your parents don't understand that, to hell with them (i have the same type of parents too). prestige is an elitist mindset that only lines the pockets of the rich pundits of higher academia at the expense of student mental wellbeing and financial wellbeing. trust your gut, and choose where you really wanna go. but don't put people who are willing to neglect your wellbeing for academia clout. this includes your parents. \nat the end of the day, school is school (esp. undergrad, which you have a fine selection of choices! congrats for that!!) you want to commit somewhere that makes you happy, that makes your instinctual feeling satisfied, that also has adequate mental health resources (!! don't neglect this). for this reason, i'd strongly recommend against attending MIT (from what you said in this post, you know you best, and no comments can truly speak for you) while your parents are your family, it's not worth draining yourself and possibly making your mental health so bad you can't turn back for their sake. \n\ntake care of yourself, no matter what you choose. make sure nobody gets in the way of that. and listen to your gut, it's pretty smart and knows the right choice.",
      "author": "pujan20",
      "created": 1586240817,
      "upvotes": 1,
      "replies": {}
    },
    "fmo1y5u": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo1y5u/",
      "text": "That sounds rly awful but may I ask as a fellow USC admit if you know anything abt scholarships there? I have no idea where to even look and I don’t have the money to go without them.",
      "author": "Doublebinded",
      "created": 1586242432,
      "upvotes": 1,
      "replies": {
        "fmo20jj": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo20jj/",
          "text": "You had to apply by December 1st in order to get one I believe -- I applied by that date and I got the Presidental scholarship for National Merit Finalists. I don't think there are any new scholarships that they can offer at this point.",
          "author": "The1AndOnlyJZ",
          "created": 1586242499,
          "upvotes": 1,
          "replies": {
            "fmo22um": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo22um/",
              "text": "I applied by Dec 1st but I didn’t get an email or anything so I don’t know where to look. I didn’t even get an email that I got in. I had to look at the admission page",
              "author": "Doublebinded",
              "created": 1586242565,
              "upvotes": 1,
              "replies": {
                "fmo2e84": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo2e84/",
                  "text": "Oh that's really weird... have you tried checking your financial aid on the FAST portal? It should appear there if you got anything",
                  "author": "The1AndOnlyJZ",
                  "created": 1586242888,
                  "upvotes": 1,
                  "replies": {
                    "fmo2g8m": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo2g8m/",
                      "text": "Yeah all it says i haven’t submitted all my materials but like my FAFSA and stuff is filled out so idk what that is.",
                      "author": "Doublebinded",
                      "created": 1586242945,
                      "upvotes": 1,
                      "replies": {
                        "fmo2ib6": {
                          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo2ib6/",
                          "text": "Check \"Required Info & Forms\" -- you should be able to see what they want from you there",
                          "author": "The1AndOnlyJZ",
                          "created": 1586243004,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fmo2ifv": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo2ifv/",
      "text": "你能进麻省理工真是牛逼了！",
      "author": "TingHoMarcus",
      "created": 1586243007,
      "upvotes": 1,
      "replies": {
        "fmo2mdw": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo2mdw/",
          "text": "我会说中文，但我听不懂。。。我正在使用Google翻译将其发送给您，但非常感谢！\n\n(I can speak Chinese but I can't read it... I'm using google translate to send this to you but thank you so much!)",
          "author": "The1AndOnlyJZ",
          "created": 1586243125,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmo3rrf": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo3rrf/",
      "text": "I’m not a senior, nor a parent, not even a college admissions officer. I’m a measly freshman. But I can relate to Chinese parents. In my opinion just give it your all! If MIT is too stressful then don’t do it or maybe take a long break. Whatever the case, everyone in this subreddit is here to support!",
      "author": "xXxLaggerSwagxXx",
      "created": 1586244313,
      "upvotes": 1,
      "replies": {}
    },
    "fmo7f2w": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo7f2w/",
      "text": "I'm going into 9th grade next year, and for my entire highschool career I will work hours and hours per day so I can achieve my dream of studying at MIT. If I were you, I would take the offer, but I don't have many things I can use to back up my opinion lmao",
      "author": "Cheese4life__",
      "created": 1586248179,
      "upvotes": 1,
      "replies": {}
    },
    "fmo7owb": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo7owb/",
      "text": "hey man, i’m going through the same exact situation right. I got into Columbia unexpectedly but i also was accepted to into NYU, my dream school. My asian parents have also been bombarding me about the brand name and the expectation of me going into the Ivy League. But thinking it through i feel that my life at Columbia would definitely take a toll on my mental health... i hope you pull through man, do what’s best for you because it’s the 4 years of your OWN life that you are dedicating to university, not your parents.",
      "author": "darylgoh",
      "created": 1586248481,
      "upvotes": 1,
      "replies": {}
    },
    "fmo999c": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo999c/",
      "text": "So relatable dude. I am Indian and initially, my parents were forcing me to go to U wash Seattle (for CS), but I know it isn't as good a school as it is considered. Thankfully I got through UC Berkley.",
      "author": "Bazinga212002",
      "created": 1586250235,
      "upvotes": 1,
      "replies": {}
    },
    "fmo9ugm": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo9ugm/",
      "text": "Welcome Trojan! Don’t worry too much about it my dude, we’ll take care of you. FTFO ❤️💛❤️💛",
      "author": "FeeshGawd",
      "created": 1586250909,
      "upvotes": 1,
      "replies": {}
    },
    "fmodzqm": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmodzqm/",
      "text": "Oh wow, honestly props to you for not giving into the whole prestige pitfall. Even I am still learning how to choose a uni that’s best for me and not choose something that everyone will praise me for. May I ask what helped you let go of this “ranking mentality” and decline MIT even though getting into it is an amazing feat?",
      "author": "Reginayoga",
      "created": 1586255515,
      "upvotes": 1,
      "replies": {}
    },
    "fmoe5f0": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoe5f0/",
      "text": "As a friend of multiple people who went to MIT (my year had like 20+ acceptances), I can tell you for sure that they all say it's not a typical college experience. MIT, more so than other prestigious schools thrive on the reputation of being exceptionally tough. Since it's an institute and not a comprehensive college, it is less diverse. At least three of friends were miserable there and they all say they would've enjoyed another school more. MIT is really only right for some people. It takes a specific type to go to MIT, get through it and enjoy it. Also, weather plays a pretty big role, sunny SoCal is probably a lot better for the mindset than harsh New England. \n\nA lot of Asian parents don't believe in mental health challenges, they think it's an indication of weakness; they even scoff at people talking about suicide. Tell them you want to enjoy college and that you are an adult and need to take responsibility for your own life and stop listening to them. It's super hard, but it's literally YOUR life at stake.",
      "author": "Seedlina",
      "created": 1586255686,
      "upvotes": 1,
      "replies": {}
    },
    "fmogr12": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmogr12/",
      "text": "I’m still only a junior but I know where I want to go based on money, distance from home, and specific programs that are offered. You seem like you’ve already considered these things and after that it’s just about overall happiness for the most part. If the stress you feel about grades and school is anything like mine, I would seriously suggest picking the school that seems easier. I know that when I get too stressed about school, I shut everything else in my life down. I don’t hang out with my family because I’m doing schoolwork. I don’t hang out with friends because I’m tired from doing schoolwork. I don’t clean my room or do anything productive except schoolwork and I check my grades several times a day and it’s really unhealthy and stressful. After a while I either break down entirely or manage to convince myself to slow down because I start realizing what I’m doing to myself. Personally, I couldn’t go to a school knowing that it’s going to be four years of that kind of living. Plus, some advice about your parents, I know you’re real worried about them cutting ties with you, but if they’re willing to do that over this, then they’ll be willing to do that later on when you decide that maybe you want a career they don’t want for you, or you want to marry someone they don’t approve of, or some other big change in your life. Some kind of falling out is inevitable with people who have to have it their way or the highway, especially with huge life decisions like this. I’m not saying your relationship with them isn’t worth preserving, but it is very possible that they’ll find something else to be upset with you over if not this, so you might as well do what will make you be happier and healthier.",
      "author": "the_puzzled_writer",
      "created": 1586258401,
      "upvotes": 1,
      "replies": {
        "fmpj3mc": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpj3mc/",
          "text": "Thanks so much — completely understand what you’re getting at. I’ll definitely be re-reading your comment soon as the deadline approaches",
          "author": "The1AndOnlyJZ",
          "created": 1586281750,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmojja4": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmojja4/",
      "text": "hey, commenting because I will be attending USC in the fall (and can totally relate to the housing struggles from yesterday)!  I'm not really stuck in a similar situation as you as my stats & ECs are not as good, but if you see yourself flourishing at USC without being financially strapped, def attend USC! I might be a bit biased, but your happiness and wellbeing are seriously the most important and should be valued over anything else. USC was never my top choice and I didn't do a lot of research when I was writing my app. But after being accepted, I fell in love with the school + realized that there are so many amazing opportunities available for us to succeed.\n\nultimately, choose what makes YOU the happiest!",
      "author": "angelaw527",
      "created": 1586260988,
      "upvotes": 1,
      "replies": {}
    },
    "fmoqnnk": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoqnnk/",
      "text": "I can imagine how you must have felt when your parents said those things to you. I would agree that they might not have been the most productive or sensitive, and might have made you feel insecure. But once you answer this question, I think you should be at more peace. Is your fear of failing keeping you from doing what you really want? In my experience fear is almost never worth your desires or aspirations. You don't ever want to look back on life and think \"I could have done it...just maybe\". Always give yourself that chance if that's truly what you want. You will surprise yourself. Yes it will probably be hard, yes you will doubt yourself. That is normal and all part of the process. But imagine. When you finally make it through, trying your absolute hardest (which doesn't have to be all As btw). But going after something that you really believe you would enjoy and benefit from and attempting to make it work is the BEST feeling. You Are smart, you ARE capable, you ARE strong. Don't underestimate yourself. :)\n\nAlso, your parents probably feel harsh because they love you, and they probably see so much potential in you. That's all. Parents are usually scared their kids will make the same mistakes as them or not be able to take advantage of the opportunities they wish they'd have. A lot of the times their fear manifest as anger; but trust, it comes from a good place. With that said, it must feel restricting to be fitting their mold instead of them allowing you to express yourself and try different things.\n\nIn the end bud, your mind is a powerful thing. Just take to to evaluate. And remember, trust in yourself all the way. Reach your highest brilliance.",
      "author": "emmaclairemadeline",
      "created": 1586266374,
      "upvotes": 1,
      "replies": {
        "fmpfzwt": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmpfzwt/",
          "text": "Thanks so much for the advice :)",
          "author": "The1AndOnlyJZ",
          "created": 1586280167,
          "upvotes": 1,
          "replies": {
            "fmph56a": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmph56a/",
              "text": "Ofc!!",
              "author": "emmaclairemadeline",
              "created": 1586280744,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fmowac6": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmowac6/",
      "text": "If you haven't started taking courses, how do you know you won't like it. Maybe what you read is not how things will go for you... Give it a try at least.",
      "author": "ThatProfessor3301",
      "created": 1586269734,
      "upvotes": 1,
      "replies": {}
    },
    "fmowt0y": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmowt0y/",
      "text": "The more competitive schools do have higher rates of anxiety and depression among students. Props to you for putting your mental health first, people always seems to forget that where you went to college isn't everything, and that you have a whole life ahead of you after you graduate. If you work hard, you can do extremely well at any college as long as you go out of your way to find opportunities.",
      "author": "Invealth",
      "created": 1586270036,
      "upvotes": 1,
      "replies": {}
    },
    "fmqo69d": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmqo69d/",
      "text": "Talk to your guidance counselor. They can help you with this.",
      "author": "waluigifan20",
      "created": 1586303516,
      "upvotes": 1,
      "replies": {}
    },
    "fmrf9l8": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmrf9l8/",
      "text": "I’m so glad I found this post. I got admitted into MIT too, and I was unsure about going as well. However, what you described is completely the opposite for me. When I visited MIT, I found it amazing, and loved all its nerdy quirks. Even tho I’m nervous about the academic life, I’ve always love a challenge and I think I’m laid-back enough to be able to power through any tough moments. \n\nMy Asian parents also strongly (and kinda demandingly) push me towards MIT, but I’m fortunate enough to have a caring brother who said he would support any decision of mine. I committed to MIT a half hour ago, but I made sure that it was truly what I wanted, and not what my parents have “brainwashed” (not really, but you get the idea) me into believing I would be happy there. \n\nI don’t know if you still read these, but something that I brought up around my parents was how it really depends on the person. Someone who goes to MIT but never focuses on their grades or opportunities or something could easily do worse in life than someone who stands out in a state school. Guilt trip them. If they love you and trust you, then they should believe you would do well no matter what university you go to.",
      "author": "greeneyedpanther",
      "created": 1586321501,
      "upvotes": 1,
      "replies": {
        "fmrfe07": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmrfe07/",
          "text": "Thanks so much for this. The more I talk to current and prospective students the more I'm convinced that I shouldn't be so scared of the place. Yes I do still read these but I just can't respond to all of them haha. Hopefully I'll see you on campus if I commit!",
          "author": "The1AndOnlyJZ",
          "created": 1586321597,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmtz1ru": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmtz1ru/",
      "text": "[deleted]",
      "author": null,
      "created": 1586381555,
      "upvotes": 1,
      "replies": {
        "fmupqwv": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmupqwv/",
          "text": "*Reddit has a 4 hour delay to fetch comments, or you can manually create a reminder on Reminddit.*\n\n**FireReed2178**, reminder arriving in **10.7 months** on [**2021-03-01 00:00:00Z**](https://www.reminddit.com/time?dt=2021-03-01 00:00:00Z&reminder_id=803f5949d70a4b70a88970341601bd0d&subreddit=ApplyingToCollege). Next time, remember to use my default callsign **kminder**.\n\n> [**r/ApplyingToCollege: Just_got_into_a_huge_argument_with_my_parents**](/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmtz1ru/?context=3)\n\n> kminder on March 1\n\n[**CLICK THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202021-03-01T00%3A00%3A00%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2FApplyingToCollege%2Fcomments%2Ffw9eb7%2Fjust_got_into_a_huge_argument_with_my_parents%2Ffmtz1ru%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Delete Comment**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%20803f5949d70a4b70a88970341601bd0d) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%20803f5949d70a4b70a88970341601bd0d) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/803f5949d70a4b70a88970341601bd0d) ^(·) [^(Update Time)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Time&message=updateReminderTime%21%20803f5949d70a4b70a88970341601bd0d%0Aon%20March%201%0A%0A%2AReplace%20reminder%20time%20above%20with%20new%20time%20or%20time%20from%20created%20date%2A) ^(·) [^(Update Message)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Message&message=updateReminderMessage%21%20803f5949d70a4b70a88970341601bd0d%20%0Akminder%20on%20March%201%0A%0A%2AMessage%20is%20on%20second%20line.%20Message%20should%20be%20one%20line%2A) ^(·) [^(**Add Timezone**)](https://www.reminddit.com/user/setTimezone?source=reddit&username=FireReed2178) ^(·) [^(**Add Email**)](https://reddit.com/message/compose/?to=remindditbot&subject=Add%20Email&message=addEmail%21%20803f5949d70a4b70a88970341601bd0d%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A)\n\n**Protip!** We have a community at r/reminddit!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20Reminder%20from%20FireReed2178)",
          "author": "remindditbot",
          "created": 1586396247,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmupw99": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmupw99/",
      "text": "Remind me on May 1",
      "author": null,
      "created": 1586396334,
      "upvotes": 1,
      "replies": {
        "fmvavtx": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmvavtx/",
          "text": "*Reddit has a 4 hour delay to fetch comments, or you can manually create a reminder on Reminddit.*\n\n**FireReed2178**, reminder arriving in **22 days** on [**2020-05-01 00:00:00Z**](https://www.reminddit.com/time?dt=2020-05-01 00:00:00Z&reminder_id=b189d4fbc6ad4f3499e22ce1527b8945&subreddit=ApplyingToCollege). Next time, remember to use my default callsign **kminder**.\n\n> [**r/ApplyingToCollege: Just_got_into_a_huge_argument_with_my_parents#2**](/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmupw99/?context=3)\n\n> kminder on May 1\n\n[**CLICK THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-05-01T00%3A00%3A00%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2FApplyingToCollege%2Fcomments%2Ffw9eb7%2Fjust_got_into_a_huge_argument_with_my_parents%2Ffmupw99%2F) to also be reminded. Thread has 2 reminders.\n\n^(OP can )[^(**Delete Comment**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%20b189d4fbc6ad4f3499e22ce1527b8945) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%20b189d4fbc6ad4f3499e22ce1527b8945) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/b189d4fbc6ad4f3499e22ce1527b8945) ^(·) [^(Update Time)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Time&message=updateReminderTime%21%20b189d4fbc6ad4f3499e22ce1527b8945%0Aon%20May%201%0A%0A%2AReplace%20reminder%20time%20above%20with%20new%20time%20or%20time%20from%20created%20date%2A) ^(·) [^(Update Message)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Message&message=updateReminderMessage%21%20b189d4fbc6ad4f3499e22ce1527b8945%20%0Akminder%20on%20May%201%0A%0A%2AMessage%20is%20on%20second%20line.%20Message%20should%20be%20one%20line%2A) ^(·) [^(**Add Timezone**)](https://www.reminddit.com/user/setTimezone?source=reddit&username=FireReed2178) ^(·) [^(**Add Email**)](https://reddit.com/message/compose/?to=remindditbot&subject=Add%20Email&message=addEmail%21%20b189d4fbc6ad4f3499e22ce1527b8945%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A)\n\n**Protip!** You can [add an email](https://reddit.com/message/compose/?to=remindditbot&subject=Add%20Email&message=addEmail%21%20b189d4fbc6ad4f3499e22ce1527b8945%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A) to receive reminder in case you abandon or delete your username.\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20Reminder%20from%20FireReed2178)",
          "author": "remindditbot",
          "created": 1586410950,
          "upvotes": 1,
          "replies": {}
        },
        "fp43u1w": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fp43u1w/",
          "text": "Chirp Chirp u/FireReed2178 cc u/The1AndOnlyJZ! ⏰ Here's your reminder from **22 days ago** on [**2020-04-09 01:38:54Z**](https://www.reminddit.com/time?dt=2020-04-09 01:38:54Z&reminder_id=b189d4fbc6ad4f3499e22ce1527b8945&subreddit=ApplyingToCollege). Thread has 2 reminders.. Next time, remember to use my default callsign **kminder**.\n\n> [**r/ApplyingToCollege: Just_got_into_a_huge_argument_with_my_parents#2**](/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmupw99/?context=3)\n\n> kminder on May 1\n\n\nIf you have thoughts to improve experience, [*let us know*](https://reddit.com/message/compose/?to=remindditbot&subject=FeedbackAfterNotify%21%20Reminddit%20Reminder%20%23b189d4fbc6ad4f3499e22ce1527b8945).\n\n\n\n^(OP can )[^(**Repeat Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Repeat%20Reminder&message=kminder%20on%20May%201%20%0Akminder%2022%20days%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0Aaction%21%20RepeatReminder%0Areminder_id%21%20b189d4fbc6ad4f3499e22ce1527b8945%0A) ^(·) [^(**Delete Comment**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%20b189d4fbc6ad4f3499e22ce1527b8945) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%20b189d4fbc6ad4f3499e22ce1527b8945) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/b189d4fbc6ad4f3499e22ce1527b8945)\n\n**Protip!** We have a community at r/reminddit!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20Reminder%20from%20FireReed2178)",
          "author": "remindditbot",
          "created": 1588291143,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmyoti9": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmyoti9/",
      "text": "Congrats on your acceptances OP! I had to make a similar decision for my Master's degree so I can relate to how incredibly stressful this can be. Sorry to hear of your parents' reactions. My parents were likewise adamant that I pick the more prestigious college - the prestige difference of the schools was greater than between USC and MIT, and they were mind-blown that I was hesitating. I ultimately chose the less prestigious school to avoid loan debt well into the 6 figures and since the program was more well-rounded.\n\nI do have regrets, partly cuz I found the campus culture and location uninspiring and limiting, whereas the other school was in a vibrant city with seemingly countless opportunities. That said I ended up where I hoped to for my first job after graduation and with manageable debt, so perhaps I made the right choice. However, in my field the college name isn't so important as long as one has solid training and experience, which my school provided. Depending on your career interests, MIT would likely offer more support than USC. Prestige plays a big role in some fields (e.g., business, law).\n\nIt sounds like you're underselling yourself - you seem very capable and bright and have obviously worked super hard. Don't doubt your ability to succeed. You might have confirmation bias regarding MIT. Yeah it's known to be tough but I wouldn't be too fearful of the rigour compared to USC. I've attended several universities in diff countries of varying reputations/perceived toughness (global rankings of \\~30-400, just googled this); they were all hard lol. \n\nAssuming money isn't a major issue, I agree with the posts here suggesting to try out MIT for a year and if it's not for you, consider transferring to USC. USC is no slouch of a school though and I think you can't really go wrong either way. :)",
      "author": "steph293",
      "created": 1586491510,
      "upvotes": 1,
      "replies": {}
    },
    "fp4mn6f": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fp4mn6f/",
      "text": "Where are you choosing?",
      "author": null,
      "created": 1588302391,
      "upvotes": 1,
      "replies": {
        "fp4xnid": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fp4xnid/",
          "text": "MIT :)",
          "author": "The1AndOnlyJZ",
          "created": 1588310137,
          "upvotes": 3,
          "replies": {
            "fp5cki1": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fp5cki1/",
              "text": "Congratulations!! You’ll do great.",
              "author": null,
              "created": 1588324299,
              "upvotes": 1,
              "replies": {
                "fp5dib0": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fp5dib0/",
                  "text": "Thank you!!",
                  "author": "The1AndOnlyJZ",
                  "created": 1588325305,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fmn6ry4": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn6ry4/",
      "text": "go to mit. I don't want to see you regretting your decision in the future.",
      "author": "Junior-City",
      "created": 1586219392,
      "upvotes": 0,
      "replies": {}
    },
    "fmn805u": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn805u/",
      "text": "i would give my left nut to get into MIT go to MIT",
      "author": null,
      "created": 1586220144,
      "upvotes": -1,
      "replies": {
        "fmn96de": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn96de/",
          "text": "You know, I thought the same thing before it really sunk in how hard it could/would be",
          "author": "The1AndOnlyJZ",
          "created": 1586220857,
          "upvotes": 9,
          "replies": {}
        },
        "fmnudyn": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnudyn/",
          "text": "Same haha, the notion of going to a school like MIT blows my mind, but I'm probably not going to make it.",
          "author": null,
          "created": 1586235563,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmnd0f5": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnd0f5/",
      "text": "[deleted]",
      "author": null,
      "created": 1586223289,
      "upvotes": 1,
      "replies": {
        "fmnds98": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnds98/",
          "text": "I mean if I could guarantee going to MIT for grad school then sure, but that's obviously not going to be an easy feat",
          "author": "The1AndOnlyJZ",
          "created": 1586223782,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmnolpr": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnolpr/",
      "text": "At the end of the day graduating with good grades, and good connections will benefit you a lot more than potentially being depressed and getting mediocre / bad grades at MIT. I’d honestly kill to go to USC, between its teachers, alumnus, location, etc. It’s one of the best schools on the west coast, and is a T25 school. Not like you’re going to community college or anything.",
      "author": "FreeQdoba",
      "created": 1586231082,
      "upvotes": 1,
      "replies": {
        "fmnpe3x": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnpe3x/",
          "text": "My parents literally compared USC to my local community college today Jesus Christ",
          "author": "The1AndOnlyJZ",
          "created": 1586231660,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmnqkt8": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnqkt8/",
      "text": "Hey OP. Fellow high schooler here. I totally understand what you’re going through. My parents have been entirely supportive of my decision in college and major, so when I didn’t get into NYU they were upset. But when it comes down to it, this is for you. NYU like MIT, is really tough mentally. I know a lot of kids at NYU who are totally miserable. In the end, you gotta look at what will make you happy. No one else. \n\nUSC is a fantastic school with a lot of good programs, and if you really see yourself there and think you’ll fit in and have a good time, then that’s the place to go. But if you’re in love with the MIT academics, how can you help your mental health? I know a lot of colleges offer access to professionals that you can talk to, and I know that there are other kids there struggling, and getting a strong group of friends that you can trust and talk to will be super beneficial. \n\nRegardless of what you do, I know all of us on this subreddit are super proud of you, and you’ll do amazing wherever you go!!",
      "author": "christinaruns",
      "created": 1586232556,
      "upvotes": 1,
      "replies": {}
    },
    "fmo67j4": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo67j4/",
      "text": "usc is already a great school! it’s not like ur turning down mit for a state school. and even if u did, it’s all about being happy. college is 4 years of ur life ur never gonna get back- you don’t want to spend it miserable",
      "author": "jackkarran",
      "created": 1586246872,
      "upvotes": 1,
      "replies": {}
    },
    "fmoc5f6": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoc5f6/",
      "text": "be grateful for what you got I think you can go to MIT then if something happens to you just transfer out or see a therapist.",
      "author": "Personal_Definition",
      "created": 1586253452,
      "upvotes": 1,
      "replies": {}
    },
    "fmose8s": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmose8s/",
      "text": "Take a gap year. fix yourself. Then go to MIT. It's a once in a lifetime opportunity. Mental health issues are very common and do not make you special. Go to MIT. Face your fear.",
      "author": "LittleMissAmbitious",
      "created": 1586267482,
      "upvotes": 1,
      "replies": {}
    },
    "fmoc5vk": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmoc5vk/",
      "text": "In all seriousness, go to MIT. Too difficult isn’t a good excuse when USC may be just as difficult in different ways.",
      "author": "MrTonyBoloney",
      "created": 1586253467,
      "upvotes": 0,
      "replies": {}
    },
    "fmnofjq": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnofjq/",
      "text": "You knew you never wanted to go to one of the best schools because you feel like you aren’t smart enough but you spent your time from middle school to build up that smart persona and get straight As through relentless studying in order to get admitted into a top school like MIT?\n\nYeah, as you have kinda touched on in your post, this decision is inconsistent with how you lived the rest of your life, which definitely would surprise me as a parent.",
      "author": "infinitecitationx",
      "created": 1586230959,
      "upvotes": -3,
      "replies": {
        "fmnpa9x": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnpa9x/",
          "text": "Hey man, it's kind of hard not to live according to your parents' wishes when they basically dictate your life since your birth -- I'm just trying my best here",
          "author": "The1AndOnlyJZ",
          "created": 1586231583,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fmnsvwo": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnsvwo/",
      "text": "[deleted]",
      "author": null,
      "created": 1586234348,
      "upvotes": 0,
      "replies": {
        "fmnt6eh": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnt6eh/",
          "text": "Bro this is A2C... chill out lol",
          "author": "The1AndOnlyJZ",
          "created": 1586234581,
          "upvotes": 3,
          "replies": {
            "fmnu5pz": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnu5pz/",
              "text": "Teenagers are fucking stupid.",
              "author": "RobotWelder",
              "created": 1586235376,
              "upvotes": 1,
              "replies": {
                "fmnu7tb": {
                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnu7tb/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1586235424,
                  "upvotes": 1,
                  "replies": {
                    "fmnvv6t": {
                      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnvv6t/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1586236796,
                      "upvotes": 0,
                      "replies": {
                        "fmnvyqn": {
                          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnvyqn/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1586236882,
                          "upvotes": 1,
                          "replies": {
                            "fmnx59x": {
                              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnx59x/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1586237922,
                              "upvotes": 0,
                              "replies": {}
                            },
                            "fmnxyxw": {
                              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxyxw/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1586238653,
                              "upvotes": 0,
                              "replies": {
                                "fmny2e6": {
                                  "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmny2e6/",
                                  "text": "Have a nice day!",
                                  "author": "The1AndOnlyJZ",
                                  "created": 1586238738,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fmn11lj": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn11lj/",
      "text": "Don’t be dumb. Choose MIT. U will need to go through hard times eventually at college. Why not just do it at one of the best universities in the world. Plus, if u believe that u might get stressed with MIT’s academics remember that they chose YOU. What you did in high school proves that you are capable of achieving. Just take things lightly. you already did the hard part: getting in! You don’t want to be living the rest of your life with this what if.",
      "author": "hibajibajee",
      "created": 1586215975,
      "upvotes": -38,
      "replies": {
        "fmn1ope": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn1ope/",
          "text": "chill with the \"don't be dumb\" part",
          "author": "USMNT_COYS",
          "created": 1586216352,
          "upvotes": 25,
          "replies": {}
        },
        "fmn2n6m": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn2n6m/",
          "text": "This is the kind of mindset which I despise. At the end of the day, you should choose the college based on how happy it makes you. Yes going to a T10 is nice but you won’t like it if you’re coerced into going there. You’ll go back to that what if and think, what if I had chosen USC? Would I have had a better time? At the end of the day, there’s a trade off but it’s better to go somewhere that is less prestigious and enjoy your experience there over a more prestigious school that feels like  a self inflicted prison",
          "author": "jakenimbo",
          "created": 1586216914,
          "upvotes": 7,
          "replies": {}
        },
        "fmndgv1": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmndgv1/",
          "text": "On one count, I agree with you: MIT is one of the best universities in the world. So is USC. OP is definitely smart enough to go there, but OP is thoughtfully taking other factors into account.",
          "author": null,
          "created": 1586223576,
          "upvotes": 0,
          "replies": {}
        },
        "fmn7q3j": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmn7q3j/",
          "text": "Imagine thinking getting into MIT is the hard part. Idiot.",
          "author": "lbtrole",
          "created": 1586219978,
          "upvotes": -4,
          "replies": {}
        }
      }
    },
    "fmnwsqt": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnwsqt/",
      "text": "If you're this worried about stuff like \"mental health\" or whatever this much then any college is gonna mess you up.",
      "author": "Catsaus",
      "created": 1586237614,
      "upvotes": -1,
      "replies": {
        "fmnxjtc": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmnxjtc/",
          "text": "Are you one of those people who think mental health is a hoax?",
          "author": "The1AndOnlyJZ",
          "created": 1586238277,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fmo4twz": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo4twz/",
      "text": "你他妈的智障吗？麻省比USC好多了。赶紧拒绝USC让我get off the waitlist",
      "author": "fong585",
      "created": 1586245422,
      "upvotes": -1,
      "replies": {
        "fmojwpo": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmojwpo/",
          "text": "stop being so rude...that's his personal choice and him choosing mit over usc is not going to 100% get u off the waitlist.",
          "author": "angelaw527",
          "created": 1586261313,
          "upvotes": 3,
          "replies": {}
        },
        "fmo55ra": {
          "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo55ra/",
          "text": " 嘿，我不感激你叫我智障，但我会考虑的",
          "author": "The1AndOnlyJZ",
          "created": 1586245759,
          "upvotes": 2,
          "replies": {
            "fmo5hv3": {
              "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmo5hv3/",
              "text": "要是我有多去参加课外活动我就不会在这里求你了，赶紧把usc推掉吧",
              "author": "fong585",
              "created": 1586246114,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "fmonp4a": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmonp4a/",
      "text": "Your parents are wrong.\n\nThere have been studies done that show that people who get accepted into top schools but choose to go elsewhere do just as well professionally as people who attend. You have what it takes! And USC is a great school as well. So go USC if you're sure MIT truly isn't a good fit.\n\nAll the best!",
      "author": "careerthrowaway10",
      "created": 1586264333,
      "upvotes": -1,
      "replies": {}
    },
    "fmor9xt": {
      "link": "/r/ApplyingToCollege/comments/fw9eb7/just_got_into_a_huge_argument_with_my_parents/fmor9xt/",
      "text": "Go to USC and show them up",
      "author": "gamer456ism",
      "created": 1586266780,
      "upvotes": -1,
      "replies": {}
    }
  }
}