{
  "sid": "r39uzx",
  "link": "/r/ApplyingToCollege/comments/r39uzx/i_regret_checking_off_the_box_on_the_psat_for/",
  "title:": "I regret checking off the box on the PSAT for student search service",
  "text": "I checked the box off because I thought that it would be nice to learn about colleges. However,…\n\n#PLEASE STOP SENDING ME SO MANY FUCKING EMAILS!!! IT’S DRIVING ME NUTS!!! PLEASE STOP SENDING ME SO MUCH PHYSICAL MAIL!!! MY PARENTS ARE QUESTIONING WHAT ALL THIS IS, AND THEY WANT ME TO READ ALL OF IT!!! I DON’T HAVE TIME AND THE PATIENCE TO READ ALL YOUR EMAILS AND MAIL!!!\n\n“Dear XXX, I’m very impressed with blah blah blah. You seem like the perfect student. Please take our personality quiz.”\n\nThe first time I saw that, I was excited. After seeing it 242 times, it seems very generic. I feel like all of these colleges use the same template for these emails.\n\n“I’m not sure I have your correct information. Please confirm it by clicking on this link. We want to ~~bombard your email and home mailbox with our college stuff~~ connect with you.”\n\nWell, no shit I’m not responding. I sure as heck ain’t gonna confirm any personal information because you’re going to send me even more spam.\n\nEdit: These emails are kinda creepy. I feel like they have some sort of tracker on me that knows when I’m awake and using my device. One day I’m up until 3 am doing homework and I keep getting college emails every hour. However, I go to sleep at 11 pm the next day and no college emails are sent to me from 11 - 3.",
  "author": "AnonymousCustomer123",
  "created": 1638004592,
  "updated": 1638205611,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hm9apfs": {
      "link": "/r/ApplyingToCollege/comments/r39uzx/i_regret_checking_off_the_box_on_the_psat_for/hm9apfs/",
      "text": "I’ve been getting those emails for two years now. 😔✊🏼",
      "author": "luvlvrluv",
      "created": 1638005560,
      "upvotes": 3,
      "replies": {}
    },
    "hm9b2b9": {
      "link": "/r/ApplyingToCollege/comments/r39uzx/i_regret_checking_off_the_box_on_the_psat_for/hm9b2b9/",
      "text": "I just wonder why those quizzes even exist. Who sits down and takes them? \n\nEvery letter that isn’t actually relevant to scholarships or admissions decisions might as well be thrown away immediately. I just wonder how much paper is absolutely wasted on this garbage.",
      "author": "Empty-Flight-9420",
      "created": 1638005862,
      "upvotes": 3,
      "replies": {}
    }
  }
}