{
  "sid": "qjtrcl",
  "link": "/r/ApplyingToCollege/comments/qjtrcl/can_i_apply_to_case_western_through_common_app_if/",
  "title:": "Can I apply to Case Western through common app if my teachers haven't completed there recommendations yet?",
  "text": "I wanted to apply to case for early action but my teachers haven't done there recommendations yet, even though I've given them a heads up a month ago. I have put them as recommenders on my common app. Could I still apply and have those finished a bit later?",
  "author": "eww329",
  "created": 1635699649,
  "updated": 1635778047,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "his9x71": {
      "link": "/r/ApplyingToCollege/comments/qjtrcl/can_i_apply_to_case_western_through_common_app_if/his9x71/",
      "text": "Yes, you may submit your app before your recommendations are ready.",
      "author": "elkrange",
      "created": 1635700782,
      "upvotes": 1,
      "replies": {
        "hit8rl3": {
          "link": "/r/ApplyingToCollege/comments/qjtrcl/can_i_apply_to_case_western_through_common_app_if/hit8rl3/",
          "text": "You can submit the application form, yes.   \n\n\nThis doesn’t mean your application is considered complete with other missing components. Some schools are strict on receiving all materials by the deadline while others allow some leeway for non-student-submitted material. But even those aren’t more than \\~a week or two.",
          "author": "RichInPitt",
          "created": 1635715543,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hisa3cv": {
      "link": "/r/ApplyingToCollege/comments/qjtrcl/can_i_apply_to_case_western_through_common_app_if/hisa3cv/",
      "text": "Does the school have a later document deadline? If so, you can apply now and they can submit their letters later. But you may want to remind them about the deadline again.",
      "author": "prsehgal",
      "created": 1635700855,
      "upvotes": 1,
      "replies": {}
    },
    "hisfq4u": {
      "link": "/r/ApplyingToCollege/comments/qjtrcl/can_i_apply_to_case_western_through_common_app_if/hisfq4u/",
      "text": "As long as theyre listed and it was started, it should be ok. But don't quote me because I'm using the coalition application.... on here, I had sorta the same issue. One of my recommendations started but didn't finish. So I panicked and just sent it to make it before the deadline. And wouldn't you know my luck... she finished it that night(I was just ever so POed lol). But because I added it, and it just wasn't finished.  It still added it after the fact when she did. On the coalition app, you can add recommendations after you click send but you can't remove them. I think its because  they probably just send the schools a \"ticket\" with generic info about you, then the schools use that to eventually pull your full application from the website....\n\nYet again  don't quote me lol",
      "author": "DrLili",
      "created": 1635703276,
      "upvotes": 1,
      "replies": {
        "hit90a5": {
          "link": "/r/ApplyingToCollege/comments/qjtrcl/can_i_apply_to_case_western_through_common_app_if/hit90a5/",
          "text": "Yea, don’t quote this as it’s not universally accurate.\n\nMultiple students have called Georgia Tech and had confirmed that \\*all\\* material must be received by the 11/1 deadline. GT is not alone.",
          "author": "RichInPitt",
          "created": 1635715655,
          "upvotes": 2,
          "replies": {
            "hitenm4": {
              "link": "/r/ApplyingToCollege/comments/qjtrcl/can_i_apply_to_case_western_through_common_app_if/hitenm4/",
              "text": "^^^ exactly... see... don't quote me lol. Thats all anecdotal of my personal experience. Plus not to play semantics but I wasn't talking about deadlines just purely if you hit submit before the deadline and there is still time.",
              "author": "DrLili",
              "created": 1635718288,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}