{
  "sid": "qwamkk",
  "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/",
  "title:": "Why do some universities have much more clout and name recognition compared to their rankings?",
  "text": "Basically the title. When talking to people around me and friends (and the general population), I seem to notice that some colleges such as NYU, Berkeley, and UCLA tend to have a lot more name recognition and impress people more than what their T30 status would suggest, even compared to colleges like Northwestern, Washu, Vanderbilt, Dartmouth, Uchicago, and the lower ivies. Why would be the case? Also, is it worth going to the above 3 schools for the lay prestige if the programs I am looking at are similarly ranked and the financial aid package is similar? Thanks.",
  "author": "SignificanceRound528",
  "created": 1637187965,
  "updated": 1637353603,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.45,
  "comments": {
    "hl1yf2v": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl1yf2v/",
      "text": "UCB is historically a top research output university, putting out more research than many higher ranked institutions. That’s why it has a higher global ranking (which is less education based & more research rep based). If you read the news regularly, you can’t go long before you hear a UCB professor quoted. UCLA is catching up (not quite globally yet), but the campus research has expanded. That’s also why UCSD is a global name now: research output. \n\nThe US News rankings look at some factors related specifically to undergrad education, which obviously will move rankings around vs pure research output (and even those rankings are more prestige based vs actual metrics of output).\n\nNYU and UCLA are both in world famous cities that are featured in movies a lot, so people may actually have heard of them vs a lot of places.",
      "author": "pixelatedpix",
      "created": 1637192787,
      "upvotes": 8,
      "replies": {}
    },
    "hl1ph5d": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl1ph5d/",
      "text": ">NYU, Berkeley, and UCLA tend to have a lot more name recognition and impress people more than what their T30 status would suggest\n\nOh, those lowly T30 colleges! Who could *ever* be impressed by the likes of *NYU*",
      "author": "freeport_aidan",
      "created": 1637188875,
      "upvotes": 22,
      "replies": {}
    },
    "hl1qfuw": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl1qfuw/",
      "text": "The schools you mention (NYU, Berkeley, UCLA) are HUGE and I think this naturally just leads them to have a much bigger presence in the public consciousness. Also, I think this really varies depending on who you're talking to. Sure, your average taxi driver or man on the street might know the name NYU very well, but your average recruiter/academic/business executive will know that a school like Cornell or UChicago is more impressive and prestigious.\n\nBut don't get me wrong, these are all great schools!",
      "author": "idorthavealife",
      "created": 1637189288,
      "upvotes": 3,
      "replies": {}
    },
    "hl267bo": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl267bo/",
      "text": "Well the general population may look more favorably upon those schools. But your target population (employers, graduate admissions, people who actually matter) will know all the T20 non/lower Ivies.\n\nBut lets be honest here.... T30 and T20 are no different... like not at all\n\nAs for your average A2Cer... they care more about other people complementing them on their school than their school itself",
      "author": "ssssseabass",
      "created": 1637196371,
      "upvotes": 5,
      "replies": {}
    },
    "hl1q19q": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl1q19q/",
      "text": "The general population doesn’t learn about universities by learning about who has the best business school or anthropology department, they learn about it from TV or sports.   \n\nIn terms of how much of an impact lay prestige makes, I think it depends on what you want to do. The more specialized the industry, the less likely lay prestige is gonna make a dent, because the people in those industries tend to be ‘in the know’. That’s why UChicago or UPenn etc. undergrad is a top feeder into finance and other prestige-sensitive industries as well as law schools/PhD programs even though the general population doesn’t really know they exist, for example. \n\nIf you’re doing something less specialized, or if you’re leaving North America/English speaking world, lay prestige might help you. I don’t really know. But I think people severely overestimate how much the prestige of an institution, whether lay prestige or ‘fancy’ prestige, affects their chances at success as opposed to their own hard work.",
      "author": "SnooKiwis7945",
      "created": 1637189114,
      "upvotes": 2,
      "replies": {}
    },
    "hl1q7j3": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl1q7j3/",
      "text": "> Also, is it worth going to the above 3 schools for the lay prestige if the programs I am looking at are similarly ranked and the financial aid package is similar?\n\nFYI, NYU has a reputation for weak financial aid. UCB and UCLA only give need-based aid in-state.\n\nWhy would lay prestige be important to you? Employers don't see this the same way.",
      "author": "elkrange",
      "created": 1637189188,
      "upvotes": 3,
      "replies": {}
    },
    "hl1x24y": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl1x24y/",
      "text": "Berkeley is simply underrated by the rankings. People in Silicon Valley consider it to be equal to Stanford. It may even look better because so many people at Stanford get in for donations.",
      "author": "ProteinEngineer",
      "created": 1637192178,
      "upvotes": 1,
      "replies": {}
    },
    "hl5kitx": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl5kitx/",
      "text": "Rankings are hugely subjective",
      "author": "thatcornellbitch",
      "created": 1637261736,
      "upvotes": 1,
      "replies": {}
    },
    "hl4j5vy": {
      "link": "/r/ApplyingToCollege/comments/qwamkk/why_do_some_universities_have_much_more_clout_and/hl4j5vy/",
      "text": "Personally I think it is the access to the “alumni network.”\n\nWhich is why it is so important to pick a school that has research/alumni that are congruent with your goals.\n\nI was talking to a professor at Case Western and he said, “… if I can help let me know, if you decide on CWRU or not - because you’ll be a colleague one day, and I’ll want to know you then.”\n\nPersonally I think Harvard and Yale are really good at “old school” professions… Law/Medicine/ et al. \n\nBioChem, BioEngineering? Maybe not the top choice to me. And that alumni connection?  Great if you want to intern with a congress-person… but idk if you want to get a position at Scripps Institute of Oceanography.\n\nPick a college that meets your goals.",
      "author": "b1gr3dd0g",
      "created": 1637246854,
      "upvotes": 1,
      "replies": {}
    }
  }
}