{
  "sid": "qgkyz6",
  "link": "/r/ApplyingToCollege/comments/qgkyz6/did_or_will_take_a_gap_year_vs_no_change_in/",
  "title:": "Did or will take a gap year vs No change in progression",
  "text": "Like many other applicants having trouble choosing one between these two options, I also took gap year after graduating from high school.\n\nI have asked the commonapp solution center twice but no one seemed to have a clear answer to this question. Some people say to choose \"no change in progression\" since I have completed high school without any interruptions.\n\nBut the problem is... isn't a gap year supposed to take after graduating from high school? If you somehow took a \"gap year\" during high school then it should be \"did or will take a time off\" instead.\n\nStill these two options are bothering me too much. Maybe I'm just getting too paranoid. But I really need someone to clarify this. \n\nbtw sorry if my english was broken :( it's my second language",
  "author": "bxrnthisway",
  "created": 1635296832,
  "updated": 1635301599,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi74xbq": {
      "link": "/r/ApplyingToCollege/comments/qgkyz6/did_or_will_take_a_gap_year_vs_no_change_in/hi74xbq/",
      "text": "I'm in the same boat. While I'd like to see some other responses, my thought process is that it the text box only pops up if you select the gap year option so that's all we need to select. A gap year is nontraditional, and it's *technically* not supposed to be taken at all but it's an option for your individual path.",
      "author": "Xymes",
      "created": 1635301409,
      "upvotes": 1,
      "replies": {
        "hi757fe": {
          "link": "/r/ApplyingToCollege/comments/qgkyz6/did_or_will_take_a_gap_year_vs_no_change_in/hi757fe/",
          "text": "Exactly. If we select no change in progression and say \"oh btw I had a gap year after graduating from high school\"... it looks a bit weird. Since additional information section is totally optional, I also think we should tick the gap year box and explain. Thank you for ur comment! Good luck on ur application process :)",
          "author": "bxrnthisway",
          "created": 1635301536,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}