{
  "sid": "qbhsol",
  "link": "/r/ApplyingToCollege/comments/qbhsol/how_do_you_stay_motivated_to_do_work/",
  "title:": "How do you stay motivated to do work?",
  "text": "This year has been horrible... I have lost motivation to do my school work and I’m easily distracted. When I’m not at work, I spend all my time on tik tok, Reddit, YouTube when I should be doing school work. I’m planning out my courses for next year when I should be doing working on school work and essays😞I’m so behind in my courses and I hope I get it together before I ruin my 4.0 unweighted GPA (4.4 weighted)... Is anyone going through this? How do you overcome this lack of motivation to do your school work, write essays and stop being lazy and distracted.",
  "author": "Wild_Jicama_7869",
  "created": 1634668560,
  "updated": 1634749791,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hh9klmz": {
      "link": "/r/ApplyingToCollege/comments/qbhsol/how_do_you_stay_motivated_to_do_work/hh9klmz/",
      "text": "Au fin du jour, it’s a choice. You can get all the advice you want about study buddies or motivational videos, whatever. The power to do it is in you only. No one will take you there. No one will draw your wagon. \n\nYou have to want it. And if you don’t, no one but yourself has the power to convince you otherwise.",
      "author": "tripletim",
      "created": 1634669200,
      "upvotes": 3,
      "replies": {
        "hh9n1zv": {
          "link": "/r/ApplyingToCollege/comments/qbhsol/how_do_you_stay_motivated_to_do_work/hh9n1zv/",
          "text": "Thanks for your advice! If you are extremely unmotivated what do you do? Do you just do it or do you have any strategies that make you do it?",
          "author": "Wild_Jicama_7869",
          "created": 1634670175,
          "upvotes": 1,
          "replies": {
            "hhb4oj9": {
              "link": "/r/ApplyingToCollege/comments/qbhsol/how_do_you_stay_motivated_to_do_work/hhb4oj9/",
              "text": "you drink coffee and sit down on a computer :)",
              "author": "tripletim",
              "created": 1634693475,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh9otl0": {
      "link": "/r/ApplyingToCollege/comments/qbhsol/how_do_you_stay_motivated_to_do_work/hh9otl0/",
      "text": "Honestly this is a weird tip but my go to is to rewatch legally blonde or watch a couple episodes of my hero acadamia. Both protagonists are just so inspiring and motivate me to get my shit together. \n\nThe motivation usually lasts a day or two",
      "author": "Tiredafternoonduck",
      "created": 1634670873,
      "upvotes": 2,
      "replies": {}
    },
    "hh9pvnc": {
      "link": "/r/ApplyingToCollege/comments/qbhsol/how_do_you_stay_motivated_to_do_work/hh9pvnc/",
      "text": "For me, I function best when I shift to a minder of \" work before reward\". When I get \" free rewards\" or heavily stimulating things without working for them, social media, junk food, etc, I don't feel happy and I slack with my goals. Ive shifted my perspective and feel like I have to earn the rewards or do something for them. I really love pizza, but I only allow myself to get it after I workout. I like reddit and YouTube, but I try to make sure I get my work done first. I like a coffee but I try not to have it if I slept in and didn't get up when I wanted to.\n\nThe other big thing for me has been time blocking. I have a few periods of work time in the day. I try to plan out the things I need to do, and the time I have to do them, and assign certain tasks to certain time zones. It really helps with avoiding procrastination if you give yourself set times to do things. Id do some googiling about that if you want to know more. \n\nAll of these things will require discipline tho. You gotta be willing to do what you want to, even if it doesn't feel good or easy at that moment.",
      "author": "maybehelpfulstranger",
      "created": 1634671280,
      "upvotes": 2,
      "replies": {}
    }
  }
}