{
  "sid": "q8icyx",
  "link": "/r/ApplyingToCollege/comments/q8icyx/selfreporting_sat_scores/",
  "title:": "Self-reporting SAT scores",
  "text": "For a school that superscores or looks at the highest section from each test attempt, can I self report only the reading section from 1 testing date and my math score from a different testing date. For example, 700RW from Aug 2020 and 800M from April 2021, not mentioning the other scores on the same day.",
  "author": "SnooMacaroons5794",
  "created": 1634279056,
  "updated": 1634331491,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgplahi": {
      "link": "/r/ApplyingToCollege/comments/q8icyx/selfreporting_sat_scores/hgplahi/",
      "text": "If they accept self reported scores, then CommonApp only lets you mention one score for each section - this could be your superscore if the school accepts superscores, or both sections from the same date if the school doesn't accept superscores.",
      "author": "prsehgal",
      "created": 1634280046,
      "upvotes": 1,
      "replies": {
        "hgplzli": {
          "link": "/r/ApplyingToCollege/comments/q8icyx/selfreporting_sat_scores/hgplzli/",
          "text": "oh okay thank you!",
          "author": "SnooMacaroons5794",
          "created": 1634280613,
          "upvotes": 1,
          "replies": {}
        },
        "hgq5lc6": {
          "link": "/r/ApplyingToCollege/comments/q8icyx/selfreporting_sat_scores/hgq5lc6/",
          "text": ">CommonApp only lets you mention one score for each section - this could be your superscore if the school accepts superscores, or both sections from the same date if the school doesn't accept superscores.\n\nActually, as specified on the common app, the section scores should ALWAYS be your two highest section scores.\n\nSchools that don’t superscore will ask a separate question for your highest single-sitting score.",
          "author": "Strict-Special3607",
          "created": 1634297202,
          "upvotes": 1,
          "replies": {
            "hgq67xa": {
              "link": "/r/ApplyingToCollege/comments/q8icyx/selfreporting_sat_scores/hgq67xa/",
              "text": "I have confirmed this with a couple of AO's... If the school doesn't superscore, they ask you to report a single test date instead of multiple ones, and all three scores (composite and both the sections) will then correspond to a single date.",
              "author": "prsehgal",
              "created": 1634297620,
              "upvotes": 1,
              "replies": {
                "hgq85zm": {
                  "link": "/r/ApplyingToCollege/comments/q8icyx/selfreporting_sat_scores/hgq85zm/",
                  "text": "Yes - they do ask for your highest single-sitting score. But they ask for it in a *separate question*.  \n\nThe general common app section asks for top scores in each section. (superscore) And, as I mentioned, schools that don’t superscore will ask their own separate question about SAT scores in the school specific section.  An applicant should NOT change the highest section scores they reported in the general common app section.\n\nFor instance, in my application for UIUC, I reported on the general common app section my highest section scores.  But, since UIUC doesn’t superscore, in the UIUC section, there is a separate question asking for the highest total score.",
                  "author": "Strict-Special3607",
                  "created": 1634298863,
                  "upvotes": 1,
                  "replies": {
                    "hgqaej6": {
                      "link": "/r/ApplyingToCollege/comments/q8icyx/selfreporting_sat_scores/hgqaej6/",
                      "text": "True, but UIUC is different... They ask for your highest composite score as well as your highest section scores - they claim that they don't look at your total superscore, but do consider the highest section scores in the evaluation process.",
                      "author": "prsehgal",
                      "created": 1634300212,
                      "upvotes": 1,
                      "replies": {
                        "hgqbiib": {
                          "link": "/r/ApplyingToCollege/comments/q8icyx/selfreporting_sat_scores/hgqbiib/",
                          "text": ">True, but UIUC is different...\n\nTo be clear, every school I applied to that does not superscore asked a SEPARATE QUESTION for SAT scores.\n\nThe point here is that applicants should NOT change their answer to the “highest section scores” question in the general common app portion to reflect their highest single-test score when applying to schools that don’t superscore. (Not least of all because they may forget to change them back for subsequent submissions.)\n\nIf a school that accepts self-reported scores doesn’t superscore… they will ask a separate question.",
                          "author": "Strict-Special3607",
                          "created": 1634300847,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}