{
  "sid": "qkecy5",
  "link": "/r/ApplyingToCollege/comments/qkecy5/payment_question/",
  "title:": "Payment Question",
  "text": "So, hypothetically speaking, if I were to submit my application at 11:58pm today, because I'm still finishing my common app and have to do 3 supps, and I don't get the payment in by midnight, will it not count me as early action? Again, hypothetically speaking. Thx",
  "author": "PoemNo7341",
  "created": 1635774460,
  "updated": 1636165115,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hivu222": {
      "link": "/r/ApplyingToCollege/comments/qkecy5/payment_question/hivu222/",
      "text": "You’ll need to get your application submitted before the deadline to ensure that it will count. You can’t submit before payment. Definitely give yourself a few hours at least.  You got this!!",
      "author": "admissionsmom",
      "created": 1635774936,
      "upvotes": 1,
      "replies": {}
    },
    "hivzhlz": {
      "link": "/r/ApplyingToCollege/comments/qkecy5/payment_question/hivzhlz/",
      "text": "Payment occurs before the app is actually submitted. Do not wait until the literal last minute - you WILL be late and then you will come here asking if it will be ok. (For most colleges, yes, it will be ok, but do you really need that stress when you can avoid it?) It takes time to do the little steps involved in submitting. There's an electronic signature page, where you need to check a bunch of boxes, etc. And of course payment. And, if the college's writing supplement is a separate submission, another electronic signature.",
      "author": "elkrange",
      "created": 1635777478,
      "upvotes": 12,
      "replies": {}
    },
    "hiwfk72": {
      "link": "/r/ApplyingToCollege/comments/qkecy5/payment_question/hiwfk72/",
      "text": "Go rd, you can't get good essays done in a day",
      "author": "Valthr4x_",
      "created": 1635784584,
      "upvotes": 4,
      "replies": {}
    },
    "hixbskk": {
      "link": "/r/ApplyingToCollege/comments/qkecy5/payment_question/hixbskk/",
      "text": "For the sake of the argument",
      "author": "blurry_a",
      "created": 1635797809,
      "upvotes": 3,
      "replies": {}
    }
  }
}