{
  "sid": "hgzip9",
  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/",
  "title:": "Dear colleges, please stop asking WHY I do stuff",
  "text": "I don’t know why I’m interested in the sciences. I’m just naturally drawn to it more than I am to the humanities. I want to help people with a career in the sciences, but I can’t pinpoint a specific incident that sparked my interest in STEM or made me want to help people.\n\nI don’t know why I like music or why I like basketball. I 👏 don’t 👏 know👏 why I do stuff sometimes, and I don’t wanna get to know me better\n\nAlthough i guess it is kinda cool that writing these essays requires me to reflect on a lotta things and try to understand myself more\n\nEdit: I understand that sometimes if you can’t say why, maybe it’s because your parents want you to become a doctor or apply to a certain school, but I feel like it’s not the case a lotta times. Sometimes you love what you do, but it’s hard to find an explanation as to why if you don’t dig deep enough or come up with a plausible story.\n\n##**Edit 2:**\nI understand the meaning behind colleges asking us why we want to apply or why we do X activity, and I agree that it's better to have a solid reason than to not have one. I recognize that I’m fortunate enough to have the chance to apply to college, but this is just a rant. It’s just something I was thinking of as I was writing my essays, it’s not meant to be taken seriously.",
  "author": "Ace_Possum",
  "created": 1593285226,
  "updated": 1634076394,
  "over_18": false,
  "upvotes": 2088,
  "upvote_ratio": 0.97,
  "comments": {
    "fw71tx8": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw71tx8/",
      "text": "Omg yes. And why x college? Um cuz I want a degree and you are a good college?? What else do you want me to say",
      "author": "cybering2718",
      "created": 1593286902,
      "upvotes": 919,
      "replies": {
        "fw7bqxq": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7bqxq/",
          "text": "Me applying for jobs at a grocery store telling them that stocking shelves is my passion",
          "author": "jdww213561",
          "created": 1593292043,
          "upvotes": 721,
          "replies": {
            "fw7g8ai": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7g8ai/",
              "text": "LMAO yes me applying to an ice cream shop saying that I have been looking forward to scooping ice cream for years",
              "author": "sjcoolios",
              "created": 1593294516,
              "upvotes": 279,
              "replies": {
                "fw7lx70": {
                  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7lx70/",
                  "text": "I deadass just walked into a store for an interview and by the time they started asking me stuff I forgot which store it was so that’s how thats going",
                  "author": "jdww213561",
                  "created": 1593297541,
                  "upvotes": 161,
                  "replies": {
                    "fw7t0y4": {
                      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7t0y4/",
                      "text": "OMG😂",
                      "author": "olani2003",
                      "created": 1593301657,
                      "upvotes": 25,
                      "replies": {}
                    }
                  }
                },
                "fw8dx52": {
                  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8dx52/",
                  "text": "Fr tho I’m an ice cream scooper and it’s deadass the most fun job I’ve had lmao. If I could do it for a living that would be my career.",
                  "author": "thesausagegod",
                  "created": 1593315031,
                  "upvotes": 16,
                  "replies": {
                    "fw8la3g": {
                      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8la3g/",
                      "text": "Ik I’m definitely sad cuz I’m not available during the times they need ppl to work, so I won’t get to see the smiles on the little kids’ faces 😢",
                      "author": "sjcoolios",
                      "created": 1593320257,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                },
                "fw8lnhd": {
                  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8lnhd/",
                  "text": "me applying to work at a clothing store and being asked to describe what the store is during my interview😑",
                  "author": "rrw03",
                  "created": 1593320541,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "fw76ij2": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw76ij2/",
          "text": "Lmaoo felt",
          "author": "BlueFlared1",
          "created": 1593289288,
          "upvotes": 58,
          "replies": {}
        },
        "fw7cduv": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7cduv/",
          "text": "I want to be honest and tell them I know they’ll give me some fat financial aid but apparently they don’t appreciate the honesty",
          "author": "jefgc",
          "created": 1593292398,
          "upvotes": 79,
          "replies": {
            "fw7j9mw": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7j9mw/",
              "text": "Let's be real for a minute.  If a girl said she wanted to date you because you were filthy rich, wouldn't you find that just a bit off-putting?  What if she wanted to marry you (and thereby be entitled to half your wealth)?\n\nWhat if you're interviewing for a job and you don't say anything about your skill set, the value you provide, and why you're excited about the position?  What if instead you just talk about the fat salary and awesome lifestyle it will enable you to have?  You're never getting that job.\n\nSame with colleges - don't say you want a lucrative career, access to their deep endowment funds, or even connections to their illustrious alumni network.  That's all so selfish, shallow, and simpleminded.  Instead, talk about how you and the college are a good fit for each other.  There's a great post on the \"Why This College\" essay linked at the bottom of this post:\n\nhttps://www.reddit.com/r/ApplyingToCollege/comments/fx9oco/juniors_start_here/",
              "author": "ScholarGrade",
              "created": 1593296070,
              "upvotes": 70,
              "replies": {
                "fw7o3vg": {
                  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7o3vg/",
                  "text": ">  Instead, talk about how you and the college are a good fit for each other.\n\nYes. I want to learn, and they want to teach. An excellent fit.",
                  "author": "jgzman",
                  "created": 1593298791,
                  "upvotes": 61,
                  "replies": {
                    "fw7op2p": {
                      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7op2p/",
                      "text": "But every college in the nation wants to teach. I mean at that point you could consider yourself a good fit for even one of the for-profit colleges, since they \"want to teach.\" It definitely feels like it isn't asking a lot to just ask, why here? Especially when there are soooo many other colleges throughout the country that you could attend.\n\nI've never heard the comparison to marriage/job interviews but that was a pretty awesome way to explain it!",
                      "author": "AdmissionsC",
                      "created": 1593299131,
                      "upvotes": 13,
                      "replies": {}
                    }
                  }
                },
                "fw8063q": {
                  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8063q/",
                  "text": "How hot is she?",
                  "author": "wjrasmussen",
                  "created": 1593306142,
                  "upvotes": 10,
                  "replies": {
                    "fw87hcv": {
                      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw87hcv/",
                      "text": "Asking the relevant questions.  Let's say she's a 1580 and 4.0 UW.",
                      "author": "ScholarGrade",
                      "created": 1593310882,
                      "upvotes": 26,
                      "replies": {
                        "fwadflr": {
                          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwadflr/",
                          "text": "The stereotypes are UNREAL. Im sorry but the fact that this admissions officer decides to say \"woman who wants your money\" tf???? why are you so shallow?? like I understand its an analogy, but your using a sexist example to talk about college applications. That is NOT the same radar",
                          "author": null,
                          "created": 1593368433,
                          "upvotes": -4,
                          "replies": {
                            "fwahg7h": {
                              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwahg7h/",
                              "text": "It's an analogy because it serves to illustrate the point.  It wasn't intended as a microaggression against women.  I could just as easily have said it was a man trying to date a woman for her money, but the way I wrote it is far more commonly represented in culture and therefore more familiar.  Also, OP appears to be male, so I went with what would be more relatable.\n\nThe whole point is that it would be a shallow and hurtful thing to say to someone you were dating.  It's similarly shallow to tell a college that you only want to attend there because it's prestigious and will give you a lucrative career.",
                              "author": "ScholarGrade",
                              "created": 1593370540,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fw81t1p": {
                  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw81t1p/",
                  "text": "At this point though, every single person is lying their asses off at every single interview.  Cool, now the person who's only after you for your money is at least honest about it so you know what to expect.  Otherwise they are still only in it for the money but now you are blindsided cause you believed them.\n\nAnd the relationship metaphor honestly doesn't work in the slightest.\n\nA relationship is a partnership.  A job or college application is a person and an organization both trying to screw the other as hard as possible so they get their moneys worth.\n\nRelationship is co-op, job/college is vs.",
                  "author": "Accomplished_Hat_576",
                  "created": 1593307218,
                  "upvotes": 12,
                  "replies": {
                    "fw8z7tr": {
                      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8z7tr/",
                      "text": "yeah, but the point is that both of you are PRETENDING that it’s a partnership.",
                      "author": null,
                      "created": 1593332806,
                      "upvotes": 3,
                      "replies": {
                        "fw9k2sv": {
                          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw9k2sv/",
                          "text": "tbh comparing something as insitutional as college or job interviews to an actual physical human relationship kinda breaks down the analogy. we need to keep up some level of social norms but we should be as honest as possible to people we care about",
                          "author": null,
                          "created": 1593352069,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fwag5ce": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwag5ce/",
          "text": "Ok real talk though - as a high school student who is completely separated from college lifestyle it is easy for schools to blend together. In reality the vibes, programs, coursework, social scene, etc. can be quite diverse between schools. For so many students I see listing schools they’re applying to, I find it difficult to believe that they would be happy at all of them. Each school really is unique, and if you can’t answer the question ‘why X school’ with more than ‘this school is good and I want to go to a good school’ you probably don’t know enough about it to assess if you would be happy there for four years. Some vague examples would perhaps be a highly STEM oriented student from MIT might hate the core curriculum of Columbia, or a student from a small school might be uncomfortable with Greek Life culture at state schools",
          "author": "lithium28",
          "created": 1593369856,
          "upvotes": 3,
          "replies": {}
        },
        "fw8dt0n": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8dt0n/",
          "text": "Well some people are genuinely passionate to attend particular colleges. Naturally, a college would want to accept that person",
          "author": "steeldaggerx",
          "created": 1593314951,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fw760eo": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw760eo/",
      "text": "lmao my common app essay (prompt 6) ended with something like \"I don't know why I'm so drawn to sciences, but it's impossible to drag me away from my love for them\"",
      "author": "curtislemay1906",
      "created": 1593289033,
      "upvotes": 201,
      "replies": {
        "fw78n0o": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw78n0o/",
          "text": "where'd you end up?",
          "author": "aadisaha17",
          "created": 1593290375,
          "upvotes": 51,
          "replies": {
            "fw7c3vv": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7c3vv/",
              "text": "Not far away from science",
              "author": "kka011098",
              "created": 1593292243,
              "upvotes": 128,
              "replies": {}
            },
            "fw7x7qx": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7x7qx/",
              "text": "a t20 tech school, if that narrows it down enough for you :)\n\nthe note from my admissions officer at the end of my acceptance letter was \"it's clear you have a deep passion for Science Engineering\"",
              "author": "curtislemay1906",
              "created": 1593304249,
              "upvotes": 41,
              "replies": {}
            }
          }
        }
      }
    },
    "fw7c40d": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7c40d/",
      "text": "This deserves a 1000 upvotes \n\nLiterally why can’t colleges know that I’m just a 17 year old shitty teenager and how I’m supposed to know that the subject is best for me \n\nLike come on dude",
      "author": "TheTroll121",
      "created": 1593292245,
      "upvotes": 239,
      "replies": {
        "fw7ij9e": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7ij9e/",
          "text": "\"Why\" is a really important thing in college and in life.  They want to see that you act out of purpose, intention, and passion.  If you're doing it because your mom is making you, then what happens when you don't live with her anymore?  If you're doing it to get into college, what happens when you get in?  Are you just going to kick back, rest on your laurels, and stop being the awesome person they admitted?\n\nGo watch Simon Sinek's fantastic TED talk, \"How Great Leaders Inspire Action\". It was (for a long time) one of the most watched TED talks and it inspired his book \"Start With Why.\"\n\nFinally, and I'm not trying to be harsh or anything in saying this, if you don't really have a \"why,\" maybe top colleges aren't for you. You can still get a great education at a less selective college and discover your why later.  But if you're not in that top group of students who have passions and values they pursue with purpose, you're probably not a good fit for T20-type colleges.",
          "author": "ScholarGrade",
          "created": 1593295697,
          "upvotes": 91,
          "replies": {
            "fw8hb7v": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8hb7v/",
              "text": "I understand the meaning behind colleges asking us why we want to apply or why we do X activity, and I agree that it's better to have a solid reason than to not have one. I recognize that I’m fortunate enough to have the chance to apply to college, but this is just a rant. It’s just something I was thinking of as I was writing my essays, it’s not meant to be taken seriously.",
              "author": "Ace_Possum",
              "created": 1593317352,
              "upvotes": 14,
              "replies": {
                "fw95fru": {
                  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw95fru/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1593339251,
                  "upvotes": 4,
                  "replies": {
                    "fw9hf9w": {
                      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw9hf9w/",
                      "text": "I get that. I recognize that I’m fortunate enough to have the chance to apply to college, but this is just a rant. It’s just something I was thinking of as I was writing my essays, it’s not meant to be taken seriously.",
                      "author": "Ace_Possum",
                      "created": 1593350182,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fw9ebdn": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw9ebdn/",
          "text": "ow about the age old question.. \"what do you want to be when you grow up?\"  Sorry folks. But even as an adult, that is married, with a mortgage, car payments, and a teen applying to colleges. I STILL have no clue.",
          "author": null,
          "created": 1593347786,
          "upvotes": 3,
          "replies": {}
        },
        "fwajp6e": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwajp6e/",
          "text": "It got 2k upvotes!",
          "author": null,
          "created": 1593371729,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fw7bjz8": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7bjz8/",
      "text": "This kind of “why” question comes up a lot after admissions too. Why do you want to be a leader for this student org? Why do you want this job/scholarship? Why do you want to be a part of XYZ?\n\nIt’s just a test to see if you’ve done your research and can come up with something half decent. As easy as it would be to just say “money” or “I’m just applying to random companies, and yours looked good,” you should get used to preparing good responses for this.",
      "author": "Hoosierthrowaway23",
      "created": 1593291931,
      "upvotes": 96,
      "replies": {
        "fw7c206": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7c206/",
          "text": " why is such a hard question to answer. I dont even know why they still ask it.",
          "author": null,
          "created": 1593292214,
          "upvotes": 26,
          "replies": {
            "fw7cykf": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7cykf/",
              "text": "> I dont even know why they still ask it.\n\n\"It’s just a test to see if you’ve done your research\"",
              "author": "GamingDevilsCC",
              "created": 1593292716,
              "upvotes": 28,
              "replies": {
                "fw7f5e9": {
                  "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7f5e9/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1593293934,
                  "upvotes": 6,
                  "replies": {
                    "fw8fg2j": {
                      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8fg2j/",
                      "text": "Because you might not give a shit, but they'd like to hire someone that does, pretty much. They've got no good reason to pick you over anyone else. \n\nSo it's less \"but why\" and more \"but why not?\"",
                      "author": "Nihil_esque",
                      "created": 1593316042,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fw7lmb7": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7lmb7/",
              "text": "That’s exactly why they still ask it. Asking why can really help you get an idea of a who a person is. Even for very simple questions, following up with why can be a really good way to find out more about a person.  \n  \nA - “What’s your favorite color?”  \n  \nB - “Blue, definitely blue.”  \n  \nA - “Any reason why?”  \n  \nB - “Hmm actually when I was young, I was always outside and remembered being fascinated by how vast the sky was. I thought it was really cool and it just stuck to me. My room was blue like the sky, I had a bunch of blue clothes, and—well—I’m buying my first house and it happens to be painted sky blue too!”  \n  \nThe idea is to make sure that someone still has some creativity and the ability to think through something. It’s far too easy to just lose your curiosity and creativity as you grow older.",
              "author": "Meeesh-",
              "created": 1593297367,
              "upvotes": 14,
              "replies": {}
            },
            "fw7ei83": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7ei83/",
              "text": "To be blunt, it’s not meant to be that difficult. I actually like this question because it’s consistent across almost every interview. You know it’s coming, so you can draw something up in advance that paints yourself in good light before the real part of the interview begins. Of course, a lot of people don’t bother to do this prep, which is also why it’s good for weeding out people who aren’t taking something that seriously.",
              "author": "Hoosierthrowaway23",
              "created": 1593293576,
              "upvotes": 19,
              "replies": {}
            },
            "fw8rdzh": {
              "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8rdzh/",
              "text": " If it a hard question to answer it makes more sense for them to ask it because they can see who answers it best.",
              "author": "FigurativeCherrySoda",
              "created": 1593325340,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fw7fd6l": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7fd6l/",
      "text": "*\"Ever since I was a child, I have been interested in science\"*",
      "author": "imdonetakeit",
      "created": 1593294055,
      "upvotes": 29,
      "replies": {
        "fw8y1oa": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8y1oa/",
          "text": "*I was born at a very young age*",
          "author": "IshwarKarthik",
          "created": 1593331647,
          "upvotes": 19,
          "replies": {}
        },
        "fw8i9t0": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8i9t0/",
          "text": "exactly all you have to do is say some bs like this and it’ll resonate with them lol",
          "author": "plantlover3",
          "created": 1593318042,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fw7dxps": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7dxps/",
      "text": "Any time a school asks about something, they are asking about you, not that thing. They are asking about you in a lot of different way as a favor to you, to give you more opportunities to show different parts of yourself. You are large, you contain multitudes. \n\nThink of this as a conversation, like on a first date or something. If someone asked you a date why did some science activity, for example, you probably wouldn’t say “idk man get off my back.”\n\nInstead, maybe you’d starting talking about a real cool thing you learned, or how learning all these little pieces make the whole world fit together, or how it connects to a career goal of yours. You might say, “It seems kind of dorky, but actually it’s really interesting ‘cause like...” Just cut out everything before “actually” and you’ll be well on your way. You’re never going to give a full answer, so don’t worry about that, but you can still give a good and true answer. \n\nWhen I work with students, I almost always start off having a conversation rather than having them write anything. They almost always know unconsciously what they think is interesting and worthwhile, it’s just probably no one has asked them before so they might have a hard time putting it into words. These are people willing to take you seriously, so maybe a good way to start is talking it through with someone who will ask you questions and take you seriously (a friend, a parent, a teacher, whatever).",
      "author": "yodatsracist",
      "created": 1593293258,
      "upvotes": 34,
      "replies": {
        "fw83dq9": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw83dq9/",
          "text": "Walt Whitman fan aye?",
          "author": "LoosePaleontologist0",
          "created": 1593308243,
          "upvotes": 3,
          "replies": {}
        },
        "fw9io6z": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw9io6z/",
          "text": "I understand the meaning behind colleges asking us why we want to apply or why we do X activity, and I agree that it's better to have a solid reason than to not have one. This is just a rant. It’s just something I was thinking of as I was writing my essays, it’s not meant to be taken seriously.",
          "author": "Ace_Possum",
          "created": 1593351084,
          "upvotes": 2,
          "replies": {}
        },
        "fwiqnca": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwiqnca/",
          "text": "This is exactly right. You could be involved in anything,but the reasons you like it are what matter. Essays and applications should be a formal presentation of you, but it is *you* at the end of the day. Don't join clubs just to join a club. Find things taht interest you and interest you and will grow you as a person.",
          "author": "therollingball1271",
          "created": 1593553431,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fw7fb3j": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7fb3j/",
      "text": "It's partially so they can vet you, make sure you're like minded. As well if you're doin something because you want to achieve status in that field, they want that under THEIR belts, not another college's. If you're trying to cure cancer Harvard wants to be the one to say it was them who did it because you came from them.\n\nWhile it is an opportunity to show off one's diversity and potential, it's a means of evaluating if you're valuable to them in the long run. If you stay all through your degree they make more $ than someone who takes your place and drops out cause they're not as career focused or whatever.",
      "author": "golddragon51296",
      "created": 1593294023,
      "upvotes": 10,
      "replies": {}
    },
    "fw7dk8d": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7dk8d/",
      "text": "I just don't understand how they don't realize kids don't mean half the stuff they write or say. It even works in interviews like why do you want a job in Walmart electronics? I want to make money why else I'm not interested in this.",
      "author": "theabhster",
      "created": 1593293052,
      "upvotes": 16,
      "replies": {
        "fw7mfvh": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7mfvh/",
          "text": "They realize it. They’ve been through it themselves. I personally think it’s a great question because it weeds out those very kids that don’t understand half the stuff they write or say. Isn’t that exactly the people they don’t want?  \n  \nEven for Walmart Electronics. Why Walmart Electronics? Why did Walmart Electronics make it onto the list of what you applied to? There are certainly companies that you didn’t apply to. Maybe it’s because you’re a techy person. Maybe because their mission aligns with yours. Maybe you had good experiences in the past and wanted to pass it forward.  \n  \n“I just want to make money” is missing the point. Let’s say you are eating at a Sushi restaurant and you volunteer to do a survey for them. When they ask “why did you choose to eat Sushi?”, you’re probably not going to say “because I want food”. Duh.  \n  \nYes you go out to eat when you are hungry. You get a job because you want money. That’s a given. When someone asks you why you want to work at a particular place or eat at a particular restaurant, they’re asking why that place over your other options.",
          "author": "Meeesh-",
          "created": 1593297834,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "fw7h1xf": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7h1xf/",
      "text": "I don't have to explain my hand fetish if I don't want to 😤",
      "author": "Untaken____Username",
      "created": 1593294940,
      "upvotes": 8,
      "replies": {}
    },
    "fw7k75d": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7k75d/",
      "text": "Make. Something. Up. If. You. Don’t. Know. That’s the exercise. No right answer. Just needs to be plausible.",
      "author": "icebergchick",
      "created": 1593296560,
      "upvotes": 22,
      "replies": {}
    },
    "fw7sic5": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7sic5/",
      "text": "I think it’s to stop people from saying, “ever since I was 5, I have wanted to be an otolaryngologist”. Like boy who even knows what an otolaryngologist is at 5..?",
      "author": "OddCar999",
      "created": 1593301347,
      "upvotes": 5,
      "replies": {}
    },
    "fw8xsox": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8xsox/",
      "text": "Instead of trying to find a specific cause, try writing about what you enjoy about doing the activity, what causes you to be particularly happy when doing the activity (i.e. what kinds of basketball moves make you the happiest when you pull them off? do you enjoy winning competitive games more, or training, or pickup basketball, or team camaraderie, or what?) and then reflect about why you enjoy those aspects of the activity instead of others. I.e. what makes your approach to basketball distinct from others.",
      "author": "PinheadXXXXXX",
      "created": 1593331397,
      "upvotes": 5,
      "replies": {
        "fw8zaa4": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8zaa4/",
          "text": "That’s great advice, thanks!",
          "author": "Ace_Possum",
          "created": 1593332874,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fw7vxvm": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7vxvm/",
      "text": "Everyone that gets into MIT had to make themselves look like a hyper altruist when they really just wanted to feel prestigious and make a lot of money.",
      "author": "Exystenc",
      "created": 1593303442,
      "upvotes": 6,
      "replies": {}
    },
    "fw8h80x": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8h80x/",
      "text": "That is who I am.  I am uniquely drawn to it and am passionate about it.  That is what I've said and it is what has got me hired to jobs I don't have qualifications or degrees in.  Passion is a greater driver than education.  You can be trained in something but it doesn't matter if that subject doesn't drive you to the next level.  Being passionate about a subject means you can delve deeper than others who just want to do what they are taught.  It also determines hire-ability which certain colleges are looking more towards than actual suitability.  If I can tell people 95% of my students are hired out of school, you will get more applicants.",
      "author": "CmdrTombes",
      "created": 1593317288,
      "upvotes": 3,
      "replies": {}
    },
    "fw8hh0q": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8hh0q/",
      "text": "You mean that as a teenager you don’t have your life’s meanings and passions completely settled out and that you you can do stuff for simply enjoying it? Utterly pathetic",
      "author": "GCSantiago",
      "created": 1593317468,
      "upvotes": 3,
      "replies": {}
    },
    "fw98a87": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw98a87/",
      "text": "when you have passions and 'why's and still get rejected-",
      "author": "a_fictionalcharacter",
      "created": 1593342217,
      "upvotes": 3,
      "replies": {
        "fw9ka9h": {
          "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw9ka9h/",
          "text": "tbh the asian parent formula hasn't changed, it's just morphed into this twisted view of passion that you HAVE to find it and that it's your SOLE one by the age of fuckin 18 lol or else you'll never find fullfillment in life. tl;dr today's asian parenting is just a rebranded version of old tiger parenting + some western hustle values",
          "author": null,
          "created": 1593352225,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "fw8wwmc": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8wwmc/",
      "text": "you could just narrate the first instance of when you were involved in that activity/subject and how you gradually later developed that. don’t rationalise your interests, but rather show how you somehow grew into them thanks to a few lucky moments (which also sounds more organic) during hs. it’s also a good example of the ‘show, don’t tell’ approach.",
      "author": "confuseboi",
      "created": 1593330510,
      "upvotes": 1,
      "replies": {}
    },
    "fwa4pfu": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwa4pfu/",
      "text": "Loss aversion",
      "author": "Foodie012",
      "created": 1593363911,
      "upvotes": 1,
      "replies": {}
    },
    "fwfky4d": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwfky4d/",
      "text": "It's not about why you got into it, it's what you want to do with it.",
      "author": "Hawkmoth",
      "created": 1593482129,
      "upvotes": 1,
      "replies": {}
    },
    "fwix3v7": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwix3v7/",
      "text": "Fact",
      "author": "ritasia",
      "created": 1593556699,
      "upvotes": 1,
      "replies": {}
    },
    "fw7n1yl": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw7n1yl/",
      "text": "Ikr wtf I didn't say I was a psych major",
      "author": "Smokabi",
      "created": 1593298187,
      "upvotes": 1,
      "replies": {}
    },
    "fw83grp": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw83grp/",
      "text": "They don't care why you do anything, they want to know how well you can present an logical argument and respond to prompts",
      "author": "crossfit_is_stupid",
      "created": 1593308299,
      "upvotes": 1,
      "replies": {}
    },
    "fw83p3s": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw83p3s/",
      "text": "If one applicant really has a strong reason driving them to their passion then I'm more likely to accept them over the person who doesn't know why.  Granted, when I first started college I didn't know why.  However, since I've figured out why I've been a much more dedicated student",
      "author": "Blutrumpeter",
      "created": 1593308451,
      "upvotes": 1,
      "replies": {}
    },
    "fw8i6uv": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8i6uv/",
      "text": "Then say you have an innate need to help people “ever since I was a child..” or “I’ve always excelled at/in/with..”\n\n bullshitting and asskissing will take you far.",
      "author": "plantlover3",
      "created": 1593317984,
      "upvotes": 1,
      "replies": {}
    },
    "fw8ofbe": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw8ofbe/",
      "text": "i relate to this sm, like why ask me why? why isn't it enough for me to just like science? what if there is no why and im just inexplicably fascinated by science!",
      "author": "Amazing_cake03",
      "created": 1593322780,
      "upvotes": 1,
      "replies": {}
    },
    "fw9gegz": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fw9gegz/",
      "text": "In high school and my early college years, I would agree with this 1000%. Now, I understand. \n\nImagine if you’re a girl (or a guy) and a guy says he wants to be your boyfriend. You will not just agree, but will ask a very natural question “why?” right? If he says “Don’t ask me why I just like you,” it’s not super convincing (though, relationships are weird, and some people may perceive this as romantic?), and even less convincing if he barely knows you (again, some may think this is love at first sight, but that’s wishful thinking), right? Imagine now the guy says “I also don’t know and don’t want to  know too much about myself...” this will raise a red flag as you may not get what you think you’re signing up for, and that’s very risky to the person being asked. \n\nNow, what do you do in this situation then?\n1) get to know yourself a little more and make the other person feel secure for accepting you\n2) you don’t need a life changing moment. Think about how different pieces come together into your interest in STEM. Elaborate your first paragraph a little, and that can be a good essay already. \n3) think about how you’re a good addition to the other party. You’ll want them to want you as much as you want them to make the relationship a mutual one.",
      "author": "acchang88",
      "created": 1593349409,
      "upvotes": 1,
      "replies": {}
    },
    "fwegwj4": {
      "link": "/r/ApplyingToCollege/comments/hgzip9/dear_colleges_please_stop_asking_why_i_do_stuff/fwegwj4/",
      "text": "If you do not want anything to be taken seriously then do not post it for others to read it. Write it in a journal like I do then re-evaluate it at a later date.",
      "author": "MyFirstSocialMedia",
      "created": 1593461026,
      "upvotes": 1,
      "replies": {}
    }
  }
}