{
  "sid": "q65rh4",
  "link": "/r/ApplyingToCollege/comments/q65rh4/paying_for_college/",
  "title:": "Paying for College",
  "text": "If my parents have a set amount of money that I can put towards college and they make enough money to disqualify me from financial aid, how do I go about paying to attend a college that I do not have the money for?\n\nLike, if I have $25k per year covered by my parents, how would I go about covering the other $40-50k it would cost to attend a great private university? I know there's a max on federal loans that is pretty minimal in the beginning. \n\nI am not considering asking for more money because I'd feel like I'm then disrespecting the extremely generous amount of money they've saved for me, plus my family lives very frugally, so I don't think my parents would budge. My Grandma might be willing to help because she and my deceased Grandpa saved really well, but I don't want to plan on it (plus, even if she did help out, it wouldn't be anywhere close to enough to cover the presumed $40-50k I need to account for).",
  "author": "seejaiy",
  "created": 1633986239,
  "updated": 1634072906,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hg9xexk": {
      "link": "/r/ApplyingToCollege/comments/q65rh4/paying_for_college/hg9xexk/",
      "text": "Your options are to take out loans, get financial aid or money from someone else, or go somewhere cheaper (highly recommend you don't blow 70k/year on undergrad, you should seriously consider going elsewhere if you don't expect to get any aid)",
      "author": "freeport_aidan",
      "created": 1633986578,
      "upvotes": 11,
      "replies": {
        "hgb7pud": {
          "link": "/r/ApplyingToCollege/comments/q65rh4/paying_for_college/hgb7pud/",
          "text": "Thanks",
          "author": "seejaiy",
          "created": 1634008442,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgadyez": {
      "link": "/r/ApplyingToCollege/comments/q65rh4/paying_for_college/hgadyez/",
      "text": "Merit Scholarships from private college?",
      "author": "roguezebra",
      "created": 1633994522,
      "upvotes": 2,
      "replies": {
        "hgafg1v": {
          "link": "/r/ApplyingToCollege/comments/q65rh4/paying_for_college/hgafg1v/",
          "text": "Not top ones",
          "author": "seejaiy",
          "created": 1633995259,
          "upvotes": 1,
          "replies": {
            "hgc2lth": {
              "link": "/r/ApplyingToCollege/comments/q65rh4/paying_for_college/hgc2lth/",
              "text": "Merit scholarships are a great idea… try for schools that have internal scholarships where you are at 90th percentile in GPA/test scores…Or your state flagship… \nKeep in mind for most majors you will be continuing your education after your BS/BA so whatever loans you take out for undergrad will just be added to that…if you really want prestige you can always go to a top school for grad school etc. so best to acquire least amount of debt before that even starts…",
              "author": "Imaginary-Tour-7127",
              "created": 1634030607,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}