{
  "sid": "qpp5yt",
  "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/",
  "title:": "Just finished my Stanford interview!!",
  "text": "I literally just finished my interview for REA at Stanford like 5 minutes ago. If you have any questions or need tips j lmk i’m happy to help out but i think it went pretty well overall!!",
  "author": "socallaghann",
  "created": 1636411026,
  "updated": 1636653439,
  "over_18": false,
  "upvotes": 87,
  "upvote_ratio": 0.98,
  "comments": {
    "hjvbwgb": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvbwgb/",
      "text": "bye im so scared, they havent contacted me yet and i submitted in like early/mid october",
      "author": "Worried_Scallion789",
      "created": 1636415428,
      "upvotes": 16,
      "replies": {
        "hjvm0n9": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvm0n9/",
          "text": "honestly, it says that it’s all based on if an alumni is available in ur area so i wouldn’t be worried if u didn’t receive anything, it’s not necessarily a deciding factor. make sure u check those spam and junk emails tho!!!",
          "author": "socallaghann",
          "created": 1636420054,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "hjv6tt6": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjv6tt6/",
      "text": "Congrats!  Were there any questions that you didn't expect, or was it all pretty routine?",
      "author": "the3twins",
      "created": 1636413198,
      "upvotes": 7,
      "replies": {
        "hjv7dq7": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjv7dq7/",
          "text": "honestly i thought it was a little weird bc he only asked me 3 questions but it was all stuff that u would expect like “what are u interested in studying,” “what do you like to do,” and “what r ur future career plans.” bc he didn’t ask me a lot of questions, i tried to dig as deep as i could w my answers so i think it was a pretty split conversation of like 15 minutes of him asking me questions and 15 of me asking him.",
          "author": "socallaghann",
          "created": 1636413435,
          "upvotes": 17,
          "replies": {
            "hjvax3j": {
              "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvax3j/",
              "text": "Was it an alumnus/a interview?",
              "author": "leadbunny",
              "created": 1636414990,
              "upvotes": 10,
              "replies": {
                "hjwqfob": {
                  "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjwqfob/",
                  "text": "To those that downvoted this, why? It's a fair question",
                  "author": "eccentric-Orange",
                  "created": 1636440808,
                  "upvotes": 7,
                  "replies": {}
                },
                "hjvm1y9": {
                  "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvm1y9/",
                  "text": "yes",
                  "author": "socallaghann",
                  "created": 1636420072,
                  "upvotes": 1,
                  "replies": {
                    "hjvmc8o": {
                      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvmc8o/",
                      "text": "So that's why you had that time breakdown. As someone who also does alum interviews, they aren't purely evaluative. It's meant to be a split between your having a chance to talk to an alum if you hadn't had the opportunity before and out getting to know you a little better, giving a voice to the written app. I hope you had fun and good luck! :)",
                      "author": "leadbunny",
                      "created": 1636420206,
                      "upvotes": 5,
                      "replies": {
                        "hjvntcp": {
                          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvntcp/",
                          "text": "yep! he was speaking a lot abt his experience around the time he attended which rlly guided my understanding over time even more which u appreciated. i didn’t wanna think of this as an end all be all event so i j thought of it as a nice conversation which helped me a lot. immediately after, i was caught off guard with how little of a time i spent answering questions as i was prepared for a lot more, however, i think i got my point across in my responses and had the chance to ask questions that actually mattered to me and weren’t j fabricated to fill up the time",
                          "author": "socallaghann",
                          "created": 1636420882,
                          "upvotes": 5,
                          "replies": {
                            "hjvo8sz": {
                              "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvo8sz/",
                              "text": "Fantastic!!! Love to hear of other good alum interviewers",
                              "author": "leadbunny",
                              "created": 1636421077,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjv8odt": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjv8odt/",
      "text": "Ayy congrats! How long after you submitted your app did you get an interview?",
      "author": "chipotlefrootloops",
      "created": 1636414000,
      "upvotes": 2,
      "replies": {
        "hjvg5yx": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvg5yx/",
          "text": "If it helps, I submitted my REA app a week before the deadline and got an interview request last night",
          "author": "did_i_inquire",
          "created": 1636417356,
          "upvotes": 7,
          "replies": {}
        },
        "hjvmmjs": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvmmjs/",
          "text": "I submitted my app 11:20 pm nov 1 and got it on Saturday",
          "author": "AvocadoCool",
          "created": 1636420338,
          "upvotes": 2,
          "replies": {}
        },
        "hjvny6c": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvny6c/",
          "text": "i submitted my app on october 18th and received the interview request on thursday last week",
          "author": "socallaghann",
          "created": 1636420941,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjv8y56": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjv8y56/",
      "text": "how much did you and the interviewer talk about specific/niche parts of Stanford? obv everyone knows the amazing programs and campus, but do you think it's worth researching a lot of highly specific info to talk about in the interview?",
      "author": "UrethraPlethora",
      "created": 1636414120,
      "upvotes": 1,
      "replies": {
        "hjvm73g": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvm73g/",
          "text": "my interviewer was an undergraduate and med school graduate, so it was niche in terms of those programs. i applied undecided so we primarily focused on the opportunities at the university that make those a good option so i would have a general knowledge, but not necessarily anything too specific. i also researched some courses that i would be interested in taking which i incorporated into some of my answers, but i don’t think that that was too necessary. i would probably over prepare a little but as it’s always good to have more knowledge than too little, but don’t feel disappointed if u don’t feel as though u shared enough bc u probably did",
          "author": "socallaghann",
          "created": 1636420139,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjvd12i": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvd12i/",
      "text": "Congratulations! I'm really happy to hear your interview went well!\n\nI got my email this morning and my Stanford interview is scheduled for Sunday.\n\nI can't think of anything specific right now, but please share how you prepared, what worked/didn't work, what kind of questions you got, etc. and anything you think would be helpful.",
      "author": "International-Ant803",
      "created": 1636415937,
      "upvotes": 1,
      "replies": {
        "hjvmkf9": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvmkf9/",
          "text": "nothing i say will make u any less nervous (believe me i felt the same way), but once i started talking it kinda became comfortable and it didn’t seem like a professional interview but more of just a nice conversation abt the university. prior to the interview, i made sure to get a few of my general facts straight of why i fell in love w the university, programs, courses im interested in, etc. while looking at common interview questions. i didn’t need to use a lot of details as he ultimately only asked me 3 questions that i j tried to answer as best as i could using my own knowledge and passions. for anyone, i think it’ll turn out fine so i wouldn’t stress too much abt it, after all it’s not a deciding factor in ur admission",
          "author": "socallaghann",
          "created": 1636420311,
          "upvotes": 3,
          "replies": {
            "hjvodwq": {
              "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvodwq/",
              "text": "thank you so much and good luck!",
              "author": "International-Ant803",
              "created": 1636421142,
              "upvotes": 1,
              "replies": {
                "hjvr3h7": {
                  "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvr3h7/",
                  "text": "good luck also i hope ur interview goes well and that we both get in!!",
                  "author": "socallaghann",
                  "created": 1636422370,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjvfinx": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvfinx/",
      "text": "I just got mine! Thank you for doing this, your responses to others would be so helpful",
      "author": "ShoeGawd",
      "created": 1636417063,
      "upvotes": 1,
      "replies": {
        "hjvml4n": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvml4n/",
          "text": "yes of course i’m happy to help!!",
          "author": "socallaghann",
          "created": 1636420320,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjvhece": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvhece/",
      "text": "what questions did you ask him?",
      "author": "ian_v12",
      "created": 1636417926,
      "upvotes": 1,
      "replies": {
        "hjvmrdd": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvmrdd/",
          "text": "we’ll he graduated in the 1970’s so nothing super recent, however, i asked him abt why he ultimately chose to attend, if the town of stanford had a lot to do or if he ventured out into san fran a lot, and if he believes that the name “stanford” on his degree gave him more opportunities than ppl at another university",
          "author": "socallaghann",
          "created": 1636420400,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjvljlz": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvljlz/",
      "text": "how rigorous was your preparation beforehand? Did you already have everything noted down and stuff?",
      "author": "Bashslash",
      "created": 1636419836,
      "upvotes": 1,
      "replies": {
        "hjvn5wq": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvn5wq/",
          "text": "i made sure to do some general research on what courses i’m interested in taking, why i believe the university is the best choice for me (which i pretty much intuitively knew), and i watched some youtube videos + read some articles on common questions just so i had some insight as to what i was gonna be asked (ultimately he only asked me 3 questions which i j tried to answer as thoroughly as possible while expressing all of my knowledge that i mentioned above)",
          "author": "socallaghann",
          "created": 1636420586,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjvz1zy": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjvz1zy/",
      "text": "[deleted]",
      "author": null,
      "created": 1636425916,
      "upvotes": 1,
      "replies": {
        "hjw0hs8": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjw0hs8/",
          "text": "he didn’t give me any sign as to what he was gonna write down in the report, other than the fact that most of the time the admissions committee is j looking to find out that ur something more than j a piece of paper. i don’t know if he recommended me or anything but he wished me the best of luck wherever i go bc he knows that even w everything perfect in my application, everyone is still unlikely to get in.",
          "author": "socallaghann",
          "created": 1636426570,
          "upvotes": 1,
          "replies": {
            "hjw2kdf": {
              "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjw2kdf/",
              "text": "[deleted]",
              "author": null,
              "created": 1636427519,
              "upvotes": 1,
              "replies": {
                "hjw3fk6": {
                  "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjw3fk6/",
                  "text": "well thank u lol but i do live in an area with most likely a lot of stanford alumnus so i am praying that this is a good sign but like i’m lowkey unqualified compared to the others who i’ve seen apply so idrk. hopefully it all works out but i’m rlly not tryna get my hopes up despite it being my top school😭",
                  "author": "socallaghann",
                  "created": 1636427912,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjzd98o": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjzd98o/",
      "text": "you seem so sweet in your responses!! I hope you get in :) I have my harvard rea interview this saturday do you have any tips on how to prepare? ty!!",
      "author": "ElevatorTemporary114",
      "created": 1636490907,
      "upvotes": 1,
      "replies": {
        "hjzoxoj": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjzoxoj/",
          "text": "thank you so much that’s very kind of you to say!! :) best of luck for ur harvard interview on saturday i hope we both get into our top schools!! as for any tips:\n\n1) have a little bit of background research done of common interview questions (j so ur not blindsided and have some idea of what ur gonna say)\n\n2) make sure u get ur facts straight abt why u are interested in the university. (u probably know this intuitively but i helped think abt my response prior to the interview as i wanted to fit in as much info as i could w/o rambling on)\n\n3) overprepare!!!! it may seem as though u didn’t share enough once the interview is done, however, it’s always better to have too much rather than too little and believe me u probably will have shared enough.\n\n4) have some questions prepared prior to the interview. some may arise while ur speaking, but this is probably one of ur only chances to ask questions to someone who went to the university so use it to ur advantage!!!\n\noverall, ur probably gonna be alright and i wouldn’t stress too much abt it. if it doesn’t go the way u want, j know that it’s not gonna make or break ur application. as soon as i was done w the interview, i was worried that he cut the interview short bc i wasn’t interesting enough, didn’t have enough depth in my responses, etc. but through reflection i know i did the best i could and i was honest which is ultimately what matters. i may not be in university yet, but i believe in the idea that ur gonna end up where ur supposed to so i know that if i don’t get into stanford or u don’t get into harvard, u will get into another amazing school. best of luck on saturday i hope it goes wonderful and please update me i would love to hear how it went!!!",
          "author": "socallaghann",
          "created": 1636495565,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjzlvgi": {
      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjzlvgi/",
      "text": "you should send in your evaluation of their interviewer",
      "author": "Delta280",
      "created": 1636494329,
      "upvotes": 1,
      "replies": {
        "hjzp02h": {
          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjzp02h/",
          "text": "do you know where i can do that? also should i send a thank u note to the interviewer?",
          "author": "socallaghann",
          "created": 1636495593,
          "upvotes": 2,
          "replies": {
            "hjzpq7e": {
              "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjzpq7e/",
              "text": "oh sorry haha, I don't actually know if you can. I was just referencing the office",
              "author": "Delta280",
              "created": 1636495895,
              "upvotes": 1,
              "replies": {
                "hjzpvhd": {
                  "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjzpvhd/",
                  "text": "lmao okay. j wondering, do you think it’s professional to send a thank you note to the interviewer or should i j leave it be",
                  "author": "socallaghann",
                  "created": 1636495956,
                  "upvotes": 2,
                  "replies": {
                    "hjzu7p6": {
                      "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjzu7p6/",
                      "text": "I think you're okay with leaving it be! Maybe if they send a survey out asking how your interview went you could respond to that!",
                      "author": "Delta280",
                      "created": 1636497750,
                      "upvotes": 2,
                      "replies": {
                        "hjzw9wl": {
                          "link": "/r/ApplyingToCollege/comments/qpp5yt/just_finished_my_stanford_interview/hjzw9wl/",
                          "text": "thanks for the advice!!",
                          "author": "socallaghann",
                          "created": 1636498615,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}