{
  "sid": "qn47f7",
  "link": "/r/ApplyingToCollege/comments/qn47f7/advice_activities_screwed_up/",
  "title:": "Advice? Activities screwed up :-(",
  "text": "Okay, so, I fucked up. I should be a competitive applicant to top schools. Feeling pretty confident, I submitted EA to a top 10 school. Except, yesterday morning, looking over the app, I realized I had put in the wrong amount of hours for a pretty significant activity - and AOs would be able to check and figure it out pretty easily. On the fly, I attached a respectful apology letter as an update. Not great, though I figure maybe they'll find my honesty charming and noble. Maybe. \n\nProblem is, I looked over my app this night, and realized I made the same mistake AGAIN! I put a massive fucking typo - 30 opponents, instead of 20 - for a tournament that I placed in. This one will be harder for AOs to check - 30 person tournaments are pretty damn rare, but most AOs probably don't know that I figure? And they're not unheard of anyway. But if I do get asked to verify it, I'll have to fess up and say I made a typo. Which no one will believe because the alternative is admitting to lying.\n\nSo I'm left with a conundrum: either I write ANOTHER letter saying sorry and admitting my mistake, or I hope the AOs don't notice this one, are fine with the last one, and let me in. I figure I might get away with 1 update, but admitting to 2 acts of sloppiness means my application is gonzo - so I haven't sent an email yet. But it would also be better to admit to a typo than have AOs assume its a lie. \n\nI'm also considering whether leaving 30 instead of 20 will make a significant difference to my chances. As in, would I be unfairly taking a spot from an otherwise better candidate if AOs didn't figure out that it was a typo? Right now, I don't think I would be - it feels pretty insignificant - but if I felt otherwise, I think I'd feel morally compelled to let them know the truth. \n\nSo should I tell them? Or should I wait, hope they don't notice, and fess up if I'm caught? Or should I just withdraw my application because I'm fucked both ways?",
  "author": "Pale_Oil_9527",
  "created": 1636090286,
  "updated": 1636135740,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjejv2w": {
      "link": "/r/ApplyingToCollege/comments/qn47f7/advice_activities_screwed_up/hjejv2w/",
      "text": "You're overthinking this",
      "author": "legendkneestart",
      "created": 1636113084,
      "upvotes": 2,
      "replies": {}
    },
    "hjevryu": {
      "link": "/r/ApplyingToCollege/comments/qn47f7/advice_activities_screwed_up/hjevryu/",
      "text": "Truth be told - nobody will care. so just let it be and chill",
      "author": "Arnavsmayan",
      "created": 1636119330,
      "upvotes": 1,
      "replies": {}
    },
    "hjfsx6a": {
      "link": "/r/ApplyingToCollege/comments/qn47f7/advice_activities_screwed_up/hjfsx6a/",
      "text": "While you are checking your app...why not check the entire thing? Then have two other people check it. Then run a spelling/grammar app several times. Then, check it again.",
      "author": "Radiant-Chipmunk-987",
      "created": 1636132565,
      "upvotes": 1,
      "replies": {}
    }
  }
}