{
  "sid": "qlhf4y",
  "link": "/r/ApplyingToCollege/comments/qlhf4y/dip_in_first_quarter_grade_for_a_particular/",
  "title:": "Dip in first quarter grade for a particular subject. How big of a problem will it be for my ed school Cornell?",
  "text": "Basically, I attend a full IB school. Throughout my entire high school years, I have consistently maintained a 7 in Chemistry. However, recently, I was in a traumatic accident and broke both my wrists with the right one requiring distal radius surgery. Because of this I cannot write nor type and as such, for subjects like Chemistry I have been using a scribe to aid in my test-taking. \n\n&#x200B;\n\nHowever, with a scribe I find that it's harder to formulate my own thoughts and answer questions correctly, especially under such time constraints. Because of this, I currently have a quarterly-grade of 5 instead of 7 for IB SL Chem (my teacher understood my predicament and predicted me a 7 regardless). Both the quarterly reports and predicted grades will be reported to the colleges.**This is the only subject where my grade has dropped**. Although, I am applying as a humanities centered major, I am a little worried on how this might impact my admissions chances, especially with such a dramatic drop. I feel like I do have a good explanation but at the same time I don't want to sound like im making excuses, especially as Chem was the only subject with this problem as I am more naturally inclined in other subjects like Math and English than in Chemistry.",
  "author": "Zealousideal-Ebb9814",
  "created": 1635896267,
  "updated": 1636136812,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hj2v2hp": {
      "link": "/r/ApplyingToCollege/comments/qlhf4y/dip_in_first_quarter_grade_for_a_particular/hj2v2hp/",
      "text": "Did you list this in additional info?",
      "author": "FuriousGeorge1435",
      "created": 1635896375,
      "upvotes": 3,
      "replies": {
        "hj2viju": {
          "link": "/r/ApplyingToCollege/comments/qlhf4y/dip_in_first_quarter_grade_for_a_particular/hj2viju/",
          "text": "Yes, but I did list it, but it was before my chem grade tanked. I mentioned how it was more difficult to type and stuff like that and how I've been afforded accommodations but I didn't really mention how it impacted/would impact my academic performance.\n\nThough, I think I can ask my teacher to make a comment on this whole ordeal on the quarterly report card",
          "author": "Zealousideal-Ebb9814",
          "created": 1635896559,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}