{
  "sid": "qmto30",
  "link": "/r/ApplyingToCollege/comments/qmto30/havent_started_my_essay/",
  "title:": "Haven't started my essay",
  "text": "I need to get my common app done by Nov 31st and I haven't even started. I always start to write my essays for school about 6 hours before they're due and I get an A on them and am proud of my work. I work EXTREMELY well under pressure but I don't want to play around with college app deadlines. I also want to get a few people's comments on them so I have to get them done early, then give them time to look at it, then time finalize it. I'm neurodivergent and need external pressure, I can't just set myself a deadline. I don't even know what I want to write it on. Any suggestions on how to get myself to do it?",
  "author": "CoochConnoiseur",
  "created": 1636057379,
  "updated": 1636135737,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.82,
  "comments": {
    "hjbwusa": {
      "link": "/r/ApplyingToCollege/comments/qmto30/havent_started_my_essay/hjbwusa/",
      "text": "Organize a meeting with a teacher or college counselor to go over your essay draft, try and set a date with them for next week, that way you need to have a solid draft to go over with them. Maybe set a date for a follow-up, so you get the edits done in time. Good luck!",
      "author": "Blue_Jay89",
      "created": 1636058888,
      "upvotes": 9,
      "replies": {
        "hjcg6ys": {
          "link": "/r/ApplyingToCollege/comments/qmto30/havent_started_my_essay/hjcg6ys/",
          "text": "This is a great idea, thank you!",
          "author": "CoochConnoiseur",
          "created": 1636066780,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjclq3v": {
      "link": "/r/ApplyingToCollege/comments/qmto30/havent_started_my_essay/hjclq3v/",
      "text": "you're exactly like my best friend!! she is one of the smartest people i know and is the most incredible writer but also needs external pressure/does it right before the deadline. if you  have a best friend/cousin/peer (i wouldn't reccommend your parents!!) that is willing to sit and work with you (the presence of another person is called body doubling and its a technique for focusing with adhd!) that may help!! and yes setting deadlines where you have to show people drafts is always helpful :)",
      "author": "Nearby-Gas503",
      "created": 1636069138,
      "upvotes": 5,
      "replies": {
        "hjcn8sc": {
          "link": "/r/ApplyingToCollege/comments/qmto30/havent_started_my_essay/hjcn8sc/",
          "text": "Thank you so much for this! I'll set a date to video chat with my friend. Honestly will use this for the rest of my life. I am eternally grateful :))",
          "author": "CoochConnoiseur",
          "created": 1636069784,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjbt7xp": {
      "link": "/r/ApplyingToCollege/comments/qmto30/havent_started_my_essay/hjbt7xp/",
      "text": "Sorry if I misused the flair, this is my first post",
      "author": "CoochConnoiseur",
      "created": 1636057471,
      "upvotes": 3,
      "replies": {}
    }
  }
}