{
  "sid": "io7624",
  "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/",
  "title:": "How do I work on college-apps after losing my dad?",
  "text": "Hi guys. I hope this doesn’t come off as really dramatic, and I am NOT trying to get attention. My dad died suddenly yesterday, and I am mentally, emotionally and physically destroyed right now. I can’t even think about what I am supposed to do in the next five minutes, and I am terrified to go into my house right now and not see him there. I have been working on college apps non stop for the past few months, most of them with my dad’s guidance. I still have to work on a good amount before I can send them in. I have an online interview for one of my top schools tomorrow morning. I also am taking a heavy course load in my classes, but thinking about doing the work right now is too much. How the heck should I wake up and move on with my own life when I can’t even get out of bed???? Does anyone have any advice??? Literally anything will help, because I have no idea what to do. Thank you 💛\n\nEdit: I called and cancelled the interview, and I have been resting, spending time with my family for these past couple of days. I can not thank you all enough for your kind words and the surplus of advice you’ve sent my way. I am beyond grateful, and I know I will get through this. Truly, thank you guys.",
  "author": "kenjifrenzy",
  "created": 1599484262,
  "updated": 1634078030,
  "over_18": false,
  "upvotes": 1624,
  "upvote_ratio": 0.99,
  "comments": {
    "g4bsudi": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4bsudi/",
      "text": "firstly, i am so so sorry for your loss and i think rather than drown in your work instantly you should take a few days to better collect yourself after such a tragedy.\n\neverything will be okay, please take at least a few days of time to yourself before jumping back into this process. start out slower, and plan out the whole thing again according to your circumstances. email the school about your situation and ask for a later date, anyone would sympathize with the place you are in right now.\n\nbut please remember your mental health is more important than any of this college business. i hope you come to terms with the tragedy and that you know that your dad will always love you even if he is a bit far away now.",
      "author": "hanistired",
      "created": 1599484819,
      "upvotes": 606,
      "replies": {
        "g4btgg1": {
          "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4btgg1/",
          "text": "thank you so so much. You don’t know how much this means to me, and how glad I am to hear that.",
          "author": "kenjifrenzy",
          "created": 1599485179,
          "upvotes": 213,
          "replies": {
            "g4cb1c5": {
              "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cb1c5/",
              "text": "ofc! if you ever need to talk, im here for you. i went through something similar with my grandma last year (although didn’t have college apps back then) and i know how rough things can get :((\n\ni know you will do your dad and yourself proud but make sure you take some time for yourself 💓",
              "author": "hanistired",
              "created": 1599493032,
              "upvotes": 63,
              "replies": {}
            },
            "g4d9l78": {
              "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d9l78/",
              "text": "If the admissions officer or teacher lost their parent, [at most schools they would get 3 or more days off to recover](https://hr.harvard.edu/staff-personnel-manual/time-away-work/other-paid-absences). You deserve the same or more. They will understand. \n\nFocus on caring for yourself and your family now. Your current and future school will still be there when you get back.",
              "author": "theotherkeith",
              "created": 1599507507,
              "upvotes": 39,
              "replies": {}
            }
          }
        }
      }
    },
    "g4bt0qt": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4bt0qt/",
      "text": "hey love! i would contact that college and let them know that you can't make it tomorrow morning. let them know sorta what happened and ask to reschedule. you're not in the best mindset right now, so just take a few days off. talk to an actually qualified person if you need to. take the days as they come and maybe try to reach out to your guidance counselor in a few weeks to update them\n\nat the end of the day, theres not much a2c can do for you, unfortunately. i love you, and your dad still loves you too, even if you cant see him physically ❤",
      "author": "silent-writer",
      "created": 1599484930,
      "upvotes": 205,
      "replies": {
        "g4btjs0": {
          "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4btjs0/",
          "text": "i can not thank you enough. ❤️",
          "author": "kenjifrenzy",
          "created": 1599485225,
          "upvotes": 69,
          "replies": {}
        }
      }
    },
    "g4bvf19": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4bvf19/",
      "text": "i am so so sorry for your loss. take some time off, spend time with your family, do not worry about college right now. maybe reschedule the interview and tell them what happened. again, i am so sorry. best of luck",
      "author": "gayclarinet",
      "created": 1599486119,
      "upvotes": 75,
      "replies": {}
    },
    "g4c0fyq": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4c0fyq/",
      "text": "hey i will never understand how you're feeling but i just want to say i'm so sorry for your loss. you're an amazingly strong person and you will get through this. please just focus on yourself and your mental and emotional health right now. spend time with your family and stay safe <3 i'm here to talk if you need someone to lend an ear or anything at all.",
      "author": "ipretendidonotsee",
      "created": 1599488412,
      "upvotes": 44,
      "replies": {}
    },
    "g4cj3ic": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cj3ic/",
      "text": "Hey can I PM u op? My dad died almost two year ago and it was a weird couple of weeks right after and I can’t imagine it being in the middle of app season. I have a few tips, but they’re nothing crazy",
      "author": "existentialcrisiz",
      "created": 1599496214,
      "upvotes": 30,
      "replies": {
        "g4cjmvj": {
          "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cjmvj/",
          "text": "That would be so incredibly helpful, so yes, of course.",
          "author": "kenjifrenzy",
          "created": 1599496459,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "g4c98dr": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4c98dr/",
      "text": "Hey, OP!  I just wanted to say that although I know a sorry may never illuminate the gravity of a dire scenario, I am truly sorry to hear about your father.  I hope things start to get better, and I am happy to provide an ear if you need one.  I agree with everybody else!  It's okay to ask for an alternate interview date, and you can take things one step at a time!\n\nGood luck.\n\nHave a nice day!",
      "author": "eccentricgalaxy",
      "created": 1599492264,
      "upvotes": 38,
      "replies": {}
    },
    "g4ccit3": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4ccit3/",
      "text": "It’s sad that you have to mention thay you’re not doing this for attention, I’m sorry dude. I wish you well.",
      "author": "Stressedstu",
      "created": 1599493642,
      "upvotes": 15,
      "replies": {}
    },
    "g4clnqq": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4clnqq/",
      "text": "I am so so so sorry! 🥺🥺 take some time off from college apps and focus on urself for a while (u still have plenty of time). Remember your health is the most important and please feel free to hmu/pm if u need anything or want to have someone to talk to. U got this and u are incredibly strong! 👑❤",
      "author": "ImpressiveGuide3",
      "created": 1599497410,
      "upvotes": 12,
      "replies": {}
    },
    "g4buzsc": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4buzsc/",
      "text": "Everything I was gonna say has already been mentioned. So I figured why not comfort a complete stranger. I’m sorry for the loss of your father, there’s a popular hymn in my church ‘Families can be together forever’. Don’t know if your religious or if I’m imposing here but try and find comfort in that or something else. You can do this!",
      "author": "WallStreet-Gambino",
      "created": 1599485910,
      "upvotes": 20,
      "replies": {}
    },
    "g4coq3x": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4coq3x/",
      "text": "I know I can’t fully understand what you’re going through, but I hope I can offer some advice. I lost my dad about a year ago or so now and the best thing I can recommend is to take a breather. You’ve just lost a huge role model in your life and it’s going to take a while to be alright. Don’t be afraid to make some calls and clear the next few days or even your week. People will understand that it’s necessary for you to have some time off. Go easy on yourself, overworking yourself as a distraction is the last thing you need right now. I hope you find peace soon, but it can take a while. My regards to you and yours.",
      "author": "Lynxus-7",
      "created": 1599498719,
      "upvotes": 9,
      "replies": {}
    },
    "g4c7y33": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4c7y33/",
      "text": "Sorry for your loss 😢",
      "author": "ContagiousClown",
      "created": 1599491721,
      "upvotes": 8,
      "replies": {}
    },
    "g4ckf31": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4ckf31/",
      "text": "I’m so so sorry for your loss. Losing a parent is never easy. Please make time for yourself and make sure you are taken care of. Speaking from personal experience it’s easy to neglect yourself by throwing yourself into work. Please don’t do this. If you need someone to talk to please don’t hesitate to reach out.",
      "author": "glamourkilled",
      "created": 1599496821,
      "upvotes": 6,
      "replies": {}
    },
    "g4crtdc": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4crtdc/",
      "text": "i'm so sorry for your loss, you're going through something really tough and im sending all my love to you during this time. i think you should take a break from college apps now, you wouldn't perform at your best and honestly you need a mental break from what had happened. your mental health is significantly more important than getting work done, so please take some time for yourself. tell your teachers what happened and hopefully they will understand and give you a break/some leniency. i would also email the school and tell them of the situation, they would not be heartless enough to put it against you. \n\nagain im so sorry for your loss and i wish i could hug you right now, it's okay to break down a bit and escape from the world in your bed. take all the time you need. i've been through a similar experience so if you would like to chat or vent or get whatever is in your heart out im here for you. <3\n\nagain",
      "author": "aiznus",
      "created": 1599499938,
      "upvotes": 8,
      "replies": {}
    },
    "g4ck67o": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4ck67o/",
      "text": "No matter what, it will be ok to take the next week off to mourn. Regardless of what some of the hypebeasts here say, your mental health matters before anything else.",
      "author": "digitalcephalopod",
      "created": 1599496708,
      "upvotes": 7,
      "replies": {}
    },
    "g4cq49u": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cq49u/",
      "text": "Focus on being mentally healthy. Colleges will understand if you tell them. I know how it feels to lose someone you love when you expect it the least (not my father tho, but it was still my grandpa), and I think I understand how you must feel. The best advice I can give you is to cry whenever you need to, and to have someone you can talk to. Talk to people, hug them... All that kind of things. Make sure you're mentally ok. Don't stress yourself out with unnecessary workload. I know that I am not directly answering your question, I don't have any answer I can give to you, but if you want to talk to me, to share your story, feel free. I know I'm just some random dude on the internet but if I can help you feel better in any way, feel free to ask. Best of luck",
      "author": "zelani06",
      "created": 1599499271,
      "upvotes": 7,
      "replies": {}
    },
    "g4c8qfb": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4c8qfb/",
      "text": "Oh my god I am so sorry. Pls try not to pressure yourself right now. Take a few days off and (ik as hard as it will be, try to work on healing) college apps aren’t the most important thing in the world rn <3",
      "author": "heyitsr25",
      "created": 1599492047,
      "upvotes": 6,
      "replies": {}
    },
    "g4ctuvd": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4ctuvd/",
      "text": "I also lost my father a few months ago, so I know what you're going through. I know juggling college applications and schoolwork has become much harder for you. But as others have said, you shouldn't focus on it right now, take as much time as you need to recover, and feel free to reach out to your friends, family, and teachers if you need them. I'm incredibly sorry for your loss, and know that your father will always be with you no matter the current circumstances. I know he will be extremely proud of you for accomplishing your goals. If you need someone to talk to about this situation, you can always PM me.",
      "author": "No_Battle500",
      "created": 1599500734,
      "upvotes": 4,
      "replies": {}
    },
    "g4cx205": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cx205/",
      "text": "Hey honey, I'm a little bit older than most people in this subreddit but I know what you're going through. My dad died when I was in high school (about 12 years ago now) and it was really difficult for me to cope with the grief while also maintaining my academic performance and planning for college apps. If you need anything or just want to vent/talk, please feel free to PM me. Lots of hugs. ♥️",
      "author": "caffeinatedlackey",
      "created": 1599502092,
      "upvotes": 5,
      "replies": {}
    },
    "g4c0k9n": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4c0k9n/",
      "text": "wow. So sorry for your loss💔",
      "author": "boluoladiran",
      "created": 1599488462,
      "upvotes": 7,
      "replies": {}
    },
    "g4cjva1": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cjva1/",
      "text": "I am so sorry for your loss, I have experienced the loss of my father few months ago. It has been really hard so I understand your feelings. Take a break it'll benefit you for the res of your life.",
      "author": "saadhabbal",
      "created": 1599496564,
      "upvotes": 3,
      "replies": {}
    },
    "g4cq665": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cq665/",
      "text": "I'm so, so sorry to hear about this. I agree with the others here, please take some time for yourself. Reschedule your interview, they'll most definitely understand. \n\nIf you can, let your teachers/counselor know about this too, so that they can adjust deadlines and workload allotted to you. Maybe take (at least) a week off and place no expectations to get schoolwork/apps done on yourself for that week. That may help alleviate at least some stress from yourself, and let you focus more on healing. Of course remember that you can consider reaching out to a professional if it ever gets too overwhelming. \n\nI'm wishing you the best for the future. <3",
      "author": "ProbablyMaybeMe",
      "created": 1599499291,
      "upvotes": 3,
      "replies": {}
    },
    "g4cuegz": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cuegz/",
      "text": "Dude, I’m so sorry! Please take the time to take care of yourself and your family; give yourself the space to feel everything you need to feel. I lost my uncle suddenly a little more than a week ago, and I had an anxiety attack during my math test a day after I found out. Please contact the colleges and your teachers, and let them know what happened, and take a few days off to regroup. I hope you find the peace and the hope that you need🙏🏾",
      "author": "dragon_qu33n1",
      "created": 1599500967,
      "upvotes": 2,
      "replies": {}
    },
    "g4cwx7v": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cwx7v/",
      "text": "So sorry for your loss.",
      "author": "moscato64",
      "created": 1599502038,
      "upvotes": 2,
      "replies": {}
    },
    "g4d8s3q": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d8s3q/",
      "text": "Hey, I'm really sorry you're going through this. I can't imagine what it's like for you to lose a parent. You're not being dramatic at all, you're just starting to go through the normal grieving process.\n\nLike others here are saying, please make sure you priorities you and your family's mental and emotional health right now. Sure college and school is important, but not by any means more important then these kinds of happenings. Your health comes first.\n\nIf you need to take a few days (or even longer) away from school stuff, then do that. I would also echo what others are saying and contact your school counselor. Hopefully they can help in contacting teachers and/or college counselors about your situation, so they know you're not going to be coming to school for a while. Also, just let the college know about your situation, and ask to reschedule. If they have any heart, they'll be more than accommodating to your situation.\n\nAgain, I'm very sorry you're going through this. I hope that you're going to be able to find peace, and I know you'll go on to make your Dad proud!",
      "author": "algerbrex",
      "created": 1599507160,
      "upvotes": 2,
      "replies": {}
    },
    "g4d9bz2": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d9bz2/",
      "text": "I am so sorry for your loss. Talk to your high school advisor, tell them what’s going on, tell the school you have an interview with what’s going on. Much love",
      "author": "kkgray00",
      "created": 1599507401,
      "upvotes": 2,
      "replies": {}
    },
    "g4dc2ao": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dc2ao/",
      "text": "Budd, I am really sorry for your loss. Imo you should take some time off from everything and try to improve your mental and emotional health.",
      "author": "grimreaper069",
      "created": 1599508564,
      "upvotes": 2,
      "replies": {}
    },
    "g4de31c": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4de31c/",
      "text": "Hey ... really really really sorry to hear that you have to go through this. Please take a break if you need to .. please leave apps if you need too; your mental health comes first! Please tell colleges if you need more time too.  \n\nAlso, make sure to find someone to vent too -- whether that be a therapist or a trusted adult. This is understandably a very very hard time for you, so make sure to get emotional support -- please don't feel the need to carry the weight all by yourself!\n\nI know it seems like everything is crumbling down right now but you will be okay. Breathe, do something you enjoy, and try your best to push through. It will get hard, yes, and you are juggling a lot, yes, but time will heal. Remember, please recheck your mental state every so often and don't feel pressured to do everything. \n\nGive yourself time and lots of love. You are amazing for being able to push through all of this. I hope everything gets better and I hope I was able to help! My pms are always open if you want to talk! Cheers!",
      "author": "aprilseasons",
      "created": 1599509378,
      "upvotes": 2,
      "replies": {}
    },
    "g4dl7re": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dl7re/",
      "text": "Hi. I’m going through something similar. You feel like you’ve lost all your hope, like the color is taken from the world. And even thinking about your future feels impossible. But you can do this. Baby steps make big steps. You don’t have to start now. Give yourself time to grieve. When you’re ready to take that first step, you’ll know. It will be extremely hard at first, but once you start it will get easier each time. You’re in my thought. Goodluck!",
      "author": "ry_0307",
      "created": 1599512355,
      "upvotes": 2,
      "replies": {
        "g4e35h7": {
          "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4e35h7/",
          "text": "Good Luck to the OP and good luck to you as well!",
          "author": "Techdout10",
          "created": 1599522345,
          "upvotes": 2,
          "replies": {
            "g4e8oe9": {
              "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4e8oe9/",
              "text": "Thank you!",
              "author": "ry_0307",
              "created": 1599525362,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g4e4bot": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4e4bot/",
      "text": "as cool as reddit is, I recommend you **go find professional help—not reddit advice**. Seeking professional help for mental health is not bad, it takes strength to ask for help.",
      "author": "copydex1",
      "created": 1599523052,
      "upvotes": 2,
      "replies": {}
    },
    "g4e5kvs": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4e5kvs/",
      "text": "this is absolutely awful, and i am so, so, so unimaginably sorry that you have to go through this.\n\nmy advice for you is to take a break and care for yourself first. contact the interviewer and explain what occurred to reschedule and talk to your teachers about your classwork; i'm sure they'd all be more than understanding.\n\nyou'll be in my thoughts and prayers op, stay strong",
      "author": "augustgirl15",
      "created": 1599523682,
      "upvotes": 2,
      "replies": {}
    },
    "g4ebgvl": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4ebgvl/",
      "text": "Sorry for your loss man, I think the best thing you can do is what your father would want u to do....go after your dreams! I know it will be tough but give it a go and if you can’t there is nothing to be ashamed of, take all the time you need and then start over. Colleges can wait🙏🏼❤️my pms are also open if u need someone to talk to",
      "author": "moawarta",
      "created": 1599527062,
      "upvotes": 2,
      "replies": {}
    },
    "g4edzt9": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4edzt9/",
      "text": "Sending lots of love your way. Stay strong <3",
      "author": "BananzaPants",
      "created": 1599528587,
      "upvotes": 2,
      "replies": {}
    },
    "g4efu4i": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4efu4i/",
      "text": "go outside and eat a banana :)",
      "author": "powerplayer75",
      "created": 1599529683,
      "upvotes": 2,
      "replies": {}
    },
    "g4eg65n": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4eg65n/",
      "text": "You do not sound dramatic in the slightest and I can't imagine what you're going through right now. I am so sorry for your loss, OP ❤",
      "author": "sapphireoreos",
      "created": 1599529880,
      "upvotes": 2,
      "replies": {}
    },
    "g4er5rk": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4er5rk/",
      "text": "Im so sorry for your loss",
      "author": "communistpotatoes",
      "created": 1599536835,
      "upvotes": 2,
      "replies": {}
    },
    "g4ex496": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4ex496/",
      "text": "Im sorry for your lost, I lost my dad august 19 so not too long ago. I don't really know but just try to take care of yourself as best as you can. Maybe email your teachers? And just remember that grieving isn't anything to be ashamed of and its totally ok if you can't get out of bed somedays. You probably need a lot of rest.",
      "author": "Finnayeetmyself_",
      "created": 1599541359,
      "upvotes": 2,
      "replies": {}
    },
    "g4dovdh": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dovdh/",
      "text": "I know your looking for college advice but in terms if your loss. Everyday find time lock yourself in a room when no one's home and have the biggest mental breakdown you've had. Cry until your eyes are dry. Don't be scared to look back on pictures and videos. \n\nThen take a nap or cold shower. Letting out the pain will clear your head some. Only time can heal you, but this is a nice push",
      "author": "Generic_E",
      "created": 1599513914,
      "upvotes": 2,
      "replies": {}
    },
    "g4du290": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4du290/",
      "text": "I’m so sorry for your loss, my condolence. In general, which personally helped me is to remember my goal and my family who are helping me everyday even if it’s a bit the memory’s are special for me.",
      "author": "kruemelmonstrr",
      "created": 1599516916,
      "upvotes": 2,
      "replies": {}
    },
    "g4duvf9": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4duvf9/",
      "text": "i'm so sorry for your loss :( hope everything turns out alright for you!",
      "author": null,
      "created": 1599517397,
      "upvotes": 2,
      "replies": {}
    },
    "g4dz63d": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dz63d/",
      "text": "I'm so sorry <3 \n\nCollege admissions often become seniors' whole world (i am one of the aforementioned seniors) that we neglect to see the big picture sometimes.\n\nMourning your dad and your mental health >>>>>>>>> college admissions in terms of priority. Good luck, and I'm so sorry for your loss!",
      "author": "greenmountcoffee",
      "created": 1599519956,
      "upvotes": 2,
      "replies": {}
    },
    "g4e0wiz": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4e0wiz/",
      "text": "listen brother. I am so sorry for your loss and i hope the best for ya. Right now if you can, reschedule all your meetings and talk to your colleges about what happened. you are not in a hood position mentally to do anything relating to college. \n\nLove ya man hopefully you get through this tough time",
      "author": "MrMyxzplk",
      "created": 1599520999,
      "upvotes": 2,
      "replies": {}
    },
    "g4e20bv": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4e20bv/",
      "text": "Cannot express enough how sorry I am to hear that. I'm a college counselor with a team of kind and knowledgeable people. We have helped many students going through rough times. I will get you set up with some hands-on guidance totally free. Just reach out and we got you.",
      "author": "TheBlueList",
      "created": 1599521662,
      "upvotes": 2,
      "replies": {}
    },
    "g4cnm2q": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cnm2q/",
      "text": "On the Common App there’s an additional information section. This section is for context. You should definitely talk about losing your dad in this section. You don’t have to hide this from colleges, it won’t make you look weak or anything. If anything it will help you. I’m so sorry for your loss, you can dm me if you want to talk :)",
      "author": "cristianp2103",
      "created": 1599498261,
      "upvotes": 2,
      "replies": {}
    },
    "g4d1h6b": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d1h6b/",
      "text": "🙏🏽🙏🏽❤️",
      "author": "doyouknowdaaway",
      "created": 1599504009,
      "upvotes": 1,
      "replies": {}
    },
    "g4d1od8": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d1od8/",
      "text": "praying for you OP. take time for yourself and your family. college apps could wait I would email the college. good luck if you ever need anything girlypop we are here. much love bro you’ve came this far your dad is so proud.",
      "author": "doyouknowdaaway",
      "created": 1599504098,
      "upvotes": 1,
      "replies": {}
    },
    "g4d1uox": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d1uox/",
      "text": "Keep up the good work babe you got this! Know that it’s ok to take breaks and your dad will always be rooting for you. I’m so sorry for your loss and know that I’m so proud of you!",
      "author": "Thatonekidlolzz",
      "created": 1599504178,
      "upvotes": 1,
      "replies": {}
    },
    "g4d3frb": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d3frb/",
      "text": "I’m so sorry for your loss. Maybe watching cute animal vids on YouTube can help? I think it’s fair for you to email them and push back the interview. They’ll understand. AOs evaluate everything in context so do what do can and put your mental health before everything. You’ll get through this 💕",
      "author": "alisonqiu",
      "created": 1599504859,
      "upvotes": 1,
      "replies": {}
    },
    "g4d4h13": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d4h13/",
      "text": "I am really sorry to hear this. Be confident that everything will be alright. Better days are ahead. ❤️",
      "author": "untrainedhunter",
      "created": 1599505304,
      "upvotes": 1,
      "replies": {}
    },
    "g4d52kf": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d52kf/",
      "text": "i am so sorry for your loss. i can't even fathom how that must feel. set aside the college work for a few days - don't worry about it, that stuff can wait. for your schoolwork, talk to your teachers - i'm sure they'll be understanding. just take some time to heal <3",
      "author": "flabbergasted101",
      "created": 1599505563,
      "upvotes": 1,
      "replies": {}
    },
    "g4d580w": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4d580w/",
      "text": "Sorry for your lose. Take care of yourself first. I am sure he would want that for you. Then you can slowly start over after you process it.",
      "author": "HappyPoe",
      "created": 1599505630,
      "upvotes": 1,
      "replies": {}
    },
    "g4djmfx": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4djmfx/",
      "text": "Dealt with something similar last year due to the passing of my grandma although not nearly as severe as ur situation. I would say that you should put off college apps until u feel mentally ready to \"mount the horse\" again.",
      "author": "HotSaucy1",
      "created": 1599511692,
      "upvotes": 1,
      "replies": {}
    },
    "g4dmbw3": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dmbw3/",
      "text": "I’m so sorry for your loss. I promise you that you’ll be ok even though it seems like you won’t right now. As for handling work it takes a lot of determination but I would recommend 1) breaks (naps are a good way to reset your brain) 2) healthy snacks (I know eating healthy snacks is a whole lot of work and there are more important things but you’ll be happy you did it when your body feels better) 3) talk to people ( it’s easy to isolate yourself but you need to see your friends and family as often as you can online or irl).",
      "author": "lolilikepotatoes",
      "created": 1599512821,
      "upvotes": 1,
      "replies": {}
    },
    "g4dmyk2": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dmyk2/",
      "text": "No one would blame you for taking some time off to find yourself. Although getting back to normalcy would seem like the best thing to do, don’t feel like you have to rush back to things.",
      "author": "Curtis64",
      "created": 1599513094,
      "upvotes": 1,
      "replies": {}
    },
    "g4dq8lj": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dq8lj/",
      "text": "I am very sorry for your loss, my best wishes to you and your loved ones. If you would like any advice, I would definitely communicate with your teachers/interviewer/any other programs you are apart of regarding your immense loss and ask for their support. I know it may be mentally exhausting to share your situation over and over again, so I would make a template email and forward it to the necessary people so that you can take time for your family and mental health. I am currently a UC Berkeley undergrad, so once you are ready, I can help you with some apps if you'd like. My best regards to you and your loved ones.",
      "author": "theoldbatblues",
      "created": 1599514681,
      "upvotes": 1,
      "replies": {}
    },
    "g4dt2d9": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dt2d9/",
      "text": "I’m so sorry for your loss. Take some time off, it’s advices during times like these. Please mourn, he  has done so much for you, and he means so much to you; going right back to work is not advisable. Take some time, grieve, cry, get angry. \nPlease reschedule your interview, explain your situation, he/she will understand.\n\nI’m so sorry. Sending my love ❤️",
      "author": null,
      "created": 1599516328,
      "upvotes": 1,
      "replies": {}
    },
    "g4dtuep": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4dtuep/",
      "text": "don’t let your mental health go to shit but explain to ur teachers and the interviewer whether in an email or in person about your loss and that you might seem out of it",
      "author": "Rippmeh",
      "created": 1599516788,
      "upvotes": 1,
      "replies": {}
    },
    "g4e47jv": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4e47jv/",
      "text": "Hey bro, as many others said sorry for your loss. I can never understand how you’re feeling. But I can offer some advice, take sometime off. Email the school and ask to reschedule, it’s off to your discretion wether or not to tell them. Regarding applications, your high school counselors will be able to help you. With college essays I recommend that you take a break from those and come back when you’re ready. Seriously please. For your classes, email your teachers. AP/DE Classes are accelerated so unfortunately you’ll be stuck a unit or two behind( Ik this sounds harsh and im sorry I don’t know how to word it without coming off mean) \n\nI hope this helps, and if you need anyone to talk to feel free to PM me.",
      "author": "jbiser361",
      "created": 1599522981,
      "upvotes": 1,
      "replies": {}
    },
    "g4ekvb3": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4ekvb3/",
      "text": "I am so sorry for your loss; I sincerely wish you and your family the best. Losing a loved one isn't easy in the least so please take your time and focus on yourself first. College may be important, but definitely not at the expense of your emotional and mental health. Don't directly jump back to work as that will drain you out, FOCUS ON YOU <3 \n\nI wish you all the best with college apps, and please, don't stress yourself out. Work slowly, consistently, and if you feel burned out, take your time! This obviously is a difficult situation to be in, and I'm sure colleges would understand your circumstance. Let them know what happened and they should rightfully give you some time. \n\nI hope the best lies in your future and I hope you have the best college experience! Please take care of yourself, work slowly in whatever manner makes you feel comfortable, and do focus on your family as well! 💛\n\nFeel free to talk anytime if you need to; my support is here for you lol\n\n\\~ *your sincere comrade*",
      "author": "unproblematic_mortal",
      "created": 1599532744,
      "upvotes": 1,
      "replies": {}
    },
    "g4elgzn": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4elgzn/",
      "text": "Hey. I am so sorry for your loss. I will pray for you. I am so sorry that I cannot give you advice, but I want you to know that you are loved.",
      "author": null,
      "created": 1599533114,
      "upvotes": 1,
      "replies": {}
    },
    "g4ep66r": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4ep66r/",
      "text": "I'm so sorry for your loss 💔",
      "author": "lolmary101",
      "created": 1599535505,
      "upvotes": 1,
      "replies": {}
    },
    "g4f2qs8": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4f2qs8/",
      "text": "I'm so sorry for your loss💛. Please Please PLEASE focus on yourself right now and your family. There is nothing more important than yourself. Do not put yourself through this unless you are mentally stronger. Sending out love and strength towards you. You got this❤️",
      "author": "funnymemer68",
      "created": 1599546298,
      "upvotes": 1,
      "replies": {}
    },
    "g4fh29e": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4fh29e/",
      "text": "Hello, I want to simply say that I am so so sorry. I cannot begin to imagine the heartbreak you are suffering from. It is crucial that you take time to grieve properly now, rather than accumulate pain that will hurt you much worse in the long run. I beg you to ask your interviewer for a different date, given your circumstances- and I have faith that they will be beyond understanding. Please take time for yourself. Understand that your time spent with your father is time that you will always cherish and has provided you will year of memories you may be very grateful for; conversely, understand that it is completely normal for you to feel devastated and that it only goes to show how much he impacted you. Your college applications and admissions have nothing to do with your relationship with him- then or now. He is so beyond proud of you for being his child, and nothing will ever diminish that pride. Again, I’m so sorry for everything you are going through right now. He loves you. I love you, feel free to pm me if you need to talk.",
      "author": "aliza-day",
      "created": 1599561841,
      "upvotes": 1,
      "replies": {}
    },
    "g4l1qnx": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4l1qnx/",
      "text": "Oh my goodness, I'm so sorry. If things still feel like too much, know that you can always take a gap year and apply to colleges next year during your time off.",
      "author": "Useful-Wish-7944",
      "created": 1599684442,
      "upvotes": 1,
      "replies": {}
    },
    "g4cfbi4": {
      "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4cfbi4/",
      "text": "r/stoicism Maybe this could help you out",
      "author": "lordsmobile6969",
      "created": 1599494766,
      "upvotes": -32,
      "replies": {
        "g4engcq": {
          "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4engcq/",
          "text": "Not funny at all asshole",
          "author": null,
          "created": 1599534369,
          "upvotes": 1,
          "replies": {
            "g4eo48s": {
              "link": "/r/ApplyingToCollege/comments/io7624/how_do_i_work_on_collegeapps_after_losing_my_dad/g4eo48s/",
              "text": "I wasn’t trying to be funny. I really was trying to help. I’m sorry if this came off the wrong way",
              "author": "lordsmobile6969",
              "created": 1599534804,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}