{
  "sid": "qcu0ui",
  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/",
  "title:": "Older brother doesn’t want me to apply to Brown, wants me to go to Dartmouth or Yale",
  "text": "hi y'all,\n\nthis might be a stupid question, but could you guys help me with ED/EA decision? My older brother doesn't want me to apply to Brown, even though he went there, and wants me to \"do better.\"\n\nHe wants me to apply ED/REA to Dartmouth or Yale instead, especially since he thinks its a better fit for me socially and since I mentioned I'm interested in following his career path (he's an investment banker), he's pushing for those two as they have better \"placement\" than Brown generally.\n\nHow do I navigate this? All three schools are at 5-6% acceptance rates (4.9, 5.8, 6.1 respectively I think), but I think I get a slight legacy boost at Brown because of my brother. I've also been there hundreds of times and I can do my Why Brown essay very easily. I do agree with him that Yale and Dartmouth (especially) are a better social fit for me, but I do enjoy the seemingly laid back vibes that Brown can provide. I also want to study Economics, which I know Yale and Dartmouth are ranked higher for, but the difference seems marginal and I would be able to take a lot of interesting courses at Brown pass/fail and just focus on learning.\n\nI get the logic of what my brother is thinking, and I know he wants me to go to a \"better\" school than he did, but I really do enjoy Brown and I'm just confused on why he doesn't want me to go to Brown, as he loved it there (at least 5 frat brothers would come over every holiday) and ended up on a great career track regardless. I would also have legacy at his frat and other organizations, and I'm sure he knows it would make my social life a lot easier, especially since I've met some brothers who would be seniors when I get on campus.\n\nHow do I go about this? Outside of the social aspect, I don't think there's that much of a difference in acceptance probability (east asian male, lower middle class, public school, stats are all competitive with perfect SATs and numerous sports and national academic comps). Career wise, it seems that I'll be set no matter what, even if it might be marginally less common for people to go into finance at Brown. He also tossed out the idea of Harvard, Princeton, or Wharton but didn't think they were worth it socially.\n\nWhat do I tell him? Is he right? I would also need financial aid (heavily) so REA at Yale would give me a chance to apply to other schools to see their financial aid package.",
  "author": "Embarrassed-Base-645",
  "created": 1634829172,
  "updated": 1636158535,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.93,
  "comments": {
    "hhi2dg1": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi2dg1/",
      "text": "your ED should really be used on the school that’s a clear favorite for you, regardless of what anyone else thinks. if you think you’d be happier at brown, ED brown. also, it sounds weird to me that your brother not only enjoyed brown but also got into investment banking upon graduating from brown and now doesn’t want you to do the same. maybe try talking to him and asking whether there’s another reason behind this?",
      "author": "calabash_bro",
      "created": 1634830460,
      "upvotes": 46,
      "replies": {
        "hhi3o35": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi3o35/",
          "text": "My ED was Brown but now I’m not sure. I also think he was really disappointed when he didn’t get into those school when he was applying. He was actually suppose to go to NW until he got off the waitlist for Brown. I don’t know. He said he wants for me to have an easier life, but wouldn’t have a better social life at Brown (because of his connections) do a lot more for me than going to a school I have no connections at?",
          "author": "Embarrassed-Base-645",
          "created": 1634830994,
          "upvotes": 11,
          "replies": {
            "hhi4m4f": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi4m4f/",
              "text": "You will make friends wherever you go.",
              "author": "the_journeyman3",
              "created": 1634831384,
              "upvotes": 7,
              "replies": {
                "hhi53s7": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi53s7/",
                  "text": "That’s fair. But it’s also organizations like which ones to join and such, which my brother could’ve provided.",
                  "author": "Embarrassed-Base-645",
                  "created": 1634831583,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhi8xgp": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi8xgp/",
              "text": "if it’s the social aspect you’re worried about, plenty of people go to schools without sibling connections and are able to network on their own. as a freshman at dartmouth, we get so much support from upperclassmen that it’s basically like having a ton of older siblings who all want us to succeed haha.\n\nif you’re not sure about EDing and think you’d have regrets if you went with one option over the other, just remember that you don’t have to apply early and your chances don’t increase that much if you do (especially for yale). if there are any questions you have about dartmouth, feel free to dm me!",
              "author": "calabash_bro",
              "created": 1634833147,
              "upvotes": 3,
              "replies": {
                "hhiekko": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhiekko/",
                  "text": "How is the social scene compared to Brown, especially Greek life?",
                  "author": "Embarrassed-Base-645",
                  "created": 1634835353,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhjawmb": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjawmb/",
              "text": "He is right about brown’s IB placements— not as good as others. Harvard and Wharton place the best, followed by Cornell and Dartmouth.",
              "author": "plainbread11",
              "created": 1634848375,
              "upvotes": 1,
              "replies": {
                "hhjb6xz": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjb6xz/",
                  "text": "Yes, he told me that Dartmouth places the best per capita comparable to Harvard and Wharton but I’m not sure what that exactly entails",
                  "author": "Embarrassed-Base-645",
                  "created": 1634848488,
                  "upvotes": 1,
                  "replies": {
                    "hhjboej": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjboej/",
                      "text": "Ok so I’m assuming you know what investment banking entails/the banks in question. \n\nHe means that students from H/W/D place into the elite boutique/bulge bracket banks. Think Lazard, Moelis, Goldman, JPM, Morgan Stanley etc \n\nThere’s middle market banks too that maybe other ivies place well into— like Wells Fargo, Jeffries etc \n\nBrown is a liberal arts college. It’s not seen as a finance school. If you’re trying for consulting then I’d say sure but for IB, no way. \n\nSource: went to a T20, did IB recruiting, got offers, saw who I was competing against. I ended up not pursuing IB after college because I like my work life balance but if finance is your passion and you like money, it’s a place to be.",
                      "author": "plainbread11",
                      "created": 1634848679,
                      "upvotes": 4,
                      "replies": {
                        "hhk1lww": {
                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk1lww/",
                          "text": "brown is fine for ib lol it just tends to attract less finance freaks",
                          "author": "styleforit17",
                          "created": 1634860276,
                          "upvotes": 3,
                          "replies": {
                            "hhk1xfs": {
                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk1xfs/",
                              "text": "It’s fine for IB as any top 20 school will be, but it definitely doesn’t send nearly as many kids into the top banks. It’s known as a liberal arts school and like I said, it’s a completely different conversation if OP was shooting for consulting, marketing or the like",
                              "author": "plainbread11",
                              "created": 1634860426,
                              "upvotes": 1,
                              "replies": {
                                "hhk1zg6": {
                                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk1zg6/",
                                  "text": "because less kids from brown go into ib💀",
                                  "author": "styleforit17",
                                  "created": 1634860453,
                                  "upvotes": 0,
                                  "replies": {
                                    "hhk23k8": {
                                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk23k8/",
                                      "text": "Yes…because it’s a liberal arts school? Which is why it’s not a conducive environment if OP wants to go into finance",
                                      "author": "plainbread11",
                                      "created": 1634860507,
                                      "upvotes": 0,
                                      "replies": {
                                        "hhk25fk": {
                                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk25fk/",
                                          "text": "a lac is fine for finance but anyway",
                                          "author": "styleforit17",
                                          "created": 1634860533,
                                          "upvotes": 1,
                                          "replies": {
                                            "hhk2aax": {
                                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk2aax/",
                                              "text": "Lol no. You’re sorely mistaken. \n\nI literally went to a LAC b school and am speaking from this perspective after having done IB recruiting.",
                                              "author": "plainbread11",
                                              "created": 1634860597,
                                              "upvotes": 1,
                                              "replies": {
                                                "hhk2cdx": {
                                                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk2cdx/",
                                                  "text": "a B school. Which Brown, thankfully, is not.",
                                                  "author": "styleforit17",
                                                  "created": 1634860625,
                                                  "upvotes": 0,
                                                  "replies": {
                                                    "hhk2kp0": {
                                                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk2kp0/",
                                                      "text": "The only Ivy League LAC/Econ degree that a top IB will respect is from Harvard or Dartmouth, maybe Cornell. A LinkedIn search of investment banking analysts will confirm as much. \n\nMore often than not unless it’s Harvard Econ you need to be in a proper finance program in a b school.",
                                                      "author": "plainbread11",
                                                      "created": 1634860736,
                                                      "upvotes": 2,
                                                      "replies": {
                                                        "hhk2mn9": {
                                                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk2mn9/",
                                                          "text": "okay 💗",
                                                          "author": "styleforit17",
                                                          "created": 1634860763,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hhjiqaq": {
                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjiqaq/",
                          "text": "From what my brother said, it sounds like it’s easy from any Ivy but some schools are just marginally better than others and alums from specific funds will have school-specific internships",
                          "author": "Embarrassed-Base-645",
                          "created": 1634851628,
                          "upvotes": 1,
                          "replies": {
                            "hhjrz6h": {
                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjrz6h/",
                              "text": "Sure but brown is definitely not going to place often in top banks. Do what you want",
                              "author": "plainbread11",
                              "created": 1634855738,
                              "upvotes": -2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hhqygc1": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhqygc1/",
              "text": "Maybe it’s because your brother had a lot more trouble getting an IB job as a Brown graduate instead of a Yale or Dartmouth graduate?",
              "author": "MakingCake1",
              "created": 1635002406,
              "upvotes": 1,
              "replies": {
                "hi09vmr": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hi09vmr/",
                  "text": "I’m relatively sure it would be relatively easy at any Ivy League school - I think it was just the marginally better finance environment at those schools",
                  "author": "Embarrassed-Base-645",
                  "created": 1635182115,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhi4bxx": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi4bxx/",
      "text": "Isn't his call.  ED/REA at the school \\*you\\* must want to attend.",
      "author": "jayphoward",
      "created": 1634831269,
      "upvotes": 13,
      "replies": {
        "hhi51dw": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi51dw/",
          "text": "Right, completely agree with that. Just annoying because now I’m doubting my decision.",
          "author": "Embarrassed-Base-645",
          "created": 1634831556,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhi47vp": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi47vp/",
      "text": "My understanding is that sibling legacy isn’t much of a boost and at best is considered “secondary legacy” as compared to primary legacy from a parent. So if this is the reason you are leaning toward Brown, you might want to reconsider.",
      "author": "Octocorallia",
      "created": 1634831222,
      "upvotes": 16,
      "replies": {
        "hhi4yqu": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi4yqu/",
          "text": "I’ve also just visited Brown literally dozens of times every year so it’s just hard to not take a shot at the place I always thought would be my college - it’s hard to think Brown was the only college and then switch to another school 10 days before the deadline",
          "author": "Embarrassed-Base-645",
          "created": 1634831526,
          "upvotes": 5,
          "replies": {
            "hhi6x8e": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi6x8e/",
              "text": "Sometimes it is good to re-evaluate old assumptions and chart your own path. Good luck with your decision!",
              "author": "Octocorallia",
              "created": 1634832337,
              "upvotes": 2,
              "replies": {
                "hhi7ibo": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi7ibo/",
                  "text": "Thank you!",
                  "author": "Embarrassed-Base-645",
                  "created": 1634832577,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhi218t": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi218t/",
      "text": "from how you’ve written this, i think he’s right, and i think you think he’s right too",
      "author": "whoreforbrown",
      "created": 1634830318,
      "upvotes": 16,
      "replies": {
        "hhi2wgj": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi2wgj/",
          "text": "Logically, I see his point, but emotionally it’s hard for me to turn my back on a school that I assumed I would go to for years and that I really enjoy, if that makes sense?",
          "author": "Embarrassed-Base-645",
          "created": 1634830678,
          "upvotes": 10,
          "replies": {
            "hhi7pwp": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi7pwp/",
              "text": "Any of those schools are amazing man don’t sweat it.",
              "author": "YolkyBoii",
              "created": 1634832661,
              "upvotes": 3,
              "replies": {}
            },
            "hhja5as": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhja5as/",
              "text": "I agree with them, you sound like you are considering other ivies bc of your career path along with what you’re brother is saying",
              "author": "Intelligent_Ad_8338",
              "created": 1634848070,
              "upvotes": 1,
              "replies": {
                "hhjb3a3": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjb3a3/",
                  "text": "Yeah, what my brother is saying is logical and was just kind of out of nowhere especially this late in the process",
                  "author": "Embarrassed-Base-645",
                  "created": 1634848448,
                  "upvotes": 1,
                  "replies": {
                    "hhjeatq": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjeatq/",
                      "text": "Ooo totally understand, same with my sisters lol. Probably do like thorough research on them and see which helps u in the long run? Ik college experience is everything but all universities give the same type of degree. Which will better prepare u for your future? Which will help give u opportunities yk? Can you apply to all of them and see which you would get into and then make ur decision? You could tell your brother ur thinking about it but still apply to all just to see what ends up happening?",
                      "author": "Intelligent_Ad_8338",
                      "created": 1634849742,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hhibg3c": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhibg3c/",
          "text": "Don’t listen to this person. Just trying to reduce comp for brown.",
          "author": "ConfidentMangoApple",
          "created": 1634834134,
          "upvotes": 6,
          "replies": {
            "hhie51n": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhie51n/",
              "text": "Oh man, I didn’t even see the username haha",
              "author": "Embarrassed-Base-645",
              "created": 1634835186,
              "upvotes": 6,
              "replies": {
                "hhj841j": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj841j/",
                  "text": "truly wasn’t advice given out of malice :/ i just said this since you mentioned the other schools being a better social + major fit",
                  "author": "whoreforbrown",
                  "created": 1634847269,
                  "upvotes": 1,
                  "replies": {
                    "hhjaxdl": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjaxdl/",
                      "text": "Nah 100% thank you",
                      "author": "Embarrassed-Base-645",
                      "created": 1634848383,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hhipcdw": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhipcdw/",
                  "text": "Yea be careful where you get your advice",
                  "author": "ConfidentMangoApple",
                  "created": 1634839675,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "hhickqa": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhickqa/",
              "text": "Hahaha, I see what you're saying...",
              "author": "the3twins",
              "created": 1634834577,
              "upvotes": 2,
              "replies": {
                "hhip9g2": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhip9g2/",
                  "text": "People here are evil dude",
                  "author": "ConfidentMangoApple",
                  "created": 1634839641,
                  "upvotes": 1,
                  "replies": {
                    "hhjacqo": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjacqo/",
                      "text": "Wait omg ur first to talk HAHAH",
                      "author": "Intelligent_Ad_8338",
                      "created": 1634848154,
                      "upvotes": 1,
                      "replies": {
                        "hhjd3cv": {
                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjd3cv/",
                          "text": "AHAHAHHAA",
                          "author": "Izyizzy200",
                          "created": 1634849248,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "hhjewt1": {
                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjewt1/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1634849998,
                          "upvotes": 1,
                          "replies": {
                            "hhjfeuz": {
                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjfeuz/",
                              "text": "Who you talking abt? Cuz I got the best stats and ecs😳",
                              "author": "Intelligent_Ad_8338",
                              "created": 1634850208,
                              "upvotes": 2,
                              "replies": {
                                "hhjhpxi": {
                                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjhpxi/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1634851195,
                                  "upvotes": 1,
                                  "replies": {
                                    "hhjincp": {
                                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjincp/",
                                      "text": "Oooo teaaa, just got my score and got a 36 act, 4.0 uw and 4.3 weighted, health related ecs with bunch of leadership positions in other clubs while still making time to be well known in my community, is in the top 10% of the most competitive school in our tricounty area. If ur trying to bring ppl down just so they don’t apply ( which seems Is like what u usually do based on ur comment history) I would say ur the one trying to eliminate some of ur competitors, which you don’t have to worry abt btw. You cant compare urself to ppl with better apps than u. Maybe tone down ur attitude and work on how to better represent ur self in ur essays. god help ur patients if u decide u want to become a doctor. Also never took the sat 😭😭",
                                      "author": "Intelligent_Ad_8338",
                                      "created": 1634851591,
                                      "upvotes": 2,
                                      "replies": {
                                        "hhjlutm": {
                                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjlutm/",
                                          "text": "CONGRATS bby and agreed 100000%,",
                                          "author": "Izyizzy200",
                                          "created": 1634852981,
                                          "upvotes": 2,
                                          "replies": {}
                                        },
                                        "hhjk6y0": {
                                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjk6y0/",
                                          "text": "Not putting anyone down nor am I trying to decrease competition. I have no idea where you are applying and I couldn’t care less. I have my suspicions about the 36 ACT that you just made up but I’ll keep my reservations. Your ecs have no theme, a 4.3 weighted is weak, and In your chance me you said you were in top 10%-15%. Your new profound updates seem rather convenient in this conversation but whatever.",
                                          "author": "ConfidentMangoApple",
                                          "created": 1634852262,
                                          "upvotes": 0,
                                          "replies": {
                                            "hhjkx4n": {
                                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjkx4n/",
                                              "text": "It’s as if ur stats can change as ur getting in transcripts and test scores🙀 and don’t go deleting negative comments towards others now.",
                                              "author": "Intelligent_Ad_8338",
                                              "created": 1634852575,
                                              "upvotes": 2,
                                              "replies": {
                                                "hhjonbu": {
                                                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjonbu/",
                                                  "text": "[deleted]",
                                                  "author": null,
                                                  "created": 1634854224,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hhjp9ah": {
                                                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjp9ah/",
                                                      "text": "Oh wow so ur uneducated and confident LMAO YIKES. I said test opt only bc I didn’t see my score yet, also I took it on sept 11, scores can come in as early as 11 days to 3-8 weeks….meaning…. If I got my score last weekend….it was between the time frame the ACT says they do. You literally trying to tell me MY score isn’t what it is, is funny🤣 Try to make ur argument based on facts HAHA. Again see how u worry abt other ppl and their stats when u should focus on urself?",
                                                      "author": "Intelligent_Ad_8338",
                                                      "created": 1634854502,
                                                      "upvotes": 2,
                                                      "replies": {
                                                        "hhjpl4e": {
                                                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjpl4e/",
                                                          "text": "[deleted]",
                                                          "author": null,
                                                          "created": 1634854650,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "hhjqgdr": {
                                                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjqgdr/",
                                                              "text": "Again yikes, u act like ur the admission counselors. You know nothing of how my profile “will” back me up. And call whatever u want a lie, it’s my stats not urs🥱 A reminder that having the highest of stats will not be the only thing getting u in to competitive schools, your character and how u present ur self in those essays and interviews are. I srsly hope u do some self cleansing and actually try to be a better person wtf\n\nEDIT: Now ur deleting everything bc yk ur wrong?",
                                                              "author": "Intelligent_Ad_8338",
                                                              "created": 1634855040,
                                                              "upvotes": 2,
                                                              "replies": {}
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hhiclrm": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhiclrm/",
              "text": "?? i love the school and will totally share every reason to apply. op was explicitly saying the other schools are a better fit",
              "author": "whoreforbrown",
              "created": 1634834589,
              "upvotes": 2,
              "replies": {
                "hhj7hrk": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj7hrk/",
                  "text": "Nice cap now move along. He has an obvious advantage for brown and only believed he would be a better fit at Darty or Yale because of his brother. He himself seemed like he wanted to attend brown.",
                  "author": "ConfidentMangoApple",
                  "created": 1634847025,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhicmq5": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhicmq5/",
              "text": "?? i love the school and will totally share every reason to apply. op was explicitly saying the other schools are a better fit",
              "author": "whoreforbrown",
              "created": 1634834599,
              "upvotes": 2,
              "replies": {}
            },
            "hhjbkkt": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjbkkt/",
              "text": "do you really think that one person cares about one guy applying to brown when brown hands like over thousands of acceptances?",
              "author": "That-Catch2289",
              "created": 1634848638,
              "upvotes": 1,
              "replies": {
                "hhjd1qe": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjd1qe/",
                  "text": "Rightttttt",
                  "author": "Izyizzy200",
                  "created": 1634849229,
                  "upvotes": 1,
                  "replies": {
                    "hhje7ot": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhje7ot/",
                      "text": "Yo can u leave me alone. Blocked",
                      "author": "ConfidentMangoApple",
                      "created": 1634849705,
                      "upvotes": 0,
                      "replies": {
                        "hhjhxtv": {
                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjhxtv/",
                          "text": "and im replying back to her comment not yours naval architect",
                          "author": "Izyizzy200",
                          "created": 1634851288,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hhje6uj": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhje6uj/",
                  "text": "Probably not but this person in particular I’ve seen always skew her answer away from Brown whenever someone is deciding between Brown and another school. Not saying she may genuinely be trying to help, just saying op should be aware of all circumstances when listening to others.",
                  "author": "ConfidentMangoApple",
                  "created": 1634849696,
                  "upvotes": 0,
                  "replies": {
                    "hhjwi5m": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjwi5m/",
                      "text": "what? people have legit dmed me asking for reasons they should apply since i’m so enthusiastic about the school!",
                      "author": "whoreforbrown",
                      "created": 1634857858,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhi5mwr": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi5mwr/",
      "text": "I'm happy to answer any Dartmouth questions you have. \n\nI think he has a point, but all three schools are so good that there isn't a super wrong answer here.",
      "author": "biggreen10",
      "created": 1634831800,
      "upvotes": 3,
      "replies": {
        "hhi6l2q": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi6l2q/",
          "text": "Did you go? What did you major in? I was planning to participate in Greek life at Brown, is it similar to what Dartmouth’s Greek life is like? I heard the social scene at Dartmouth is by far the best within the Ivies, is that true?",
          "author": "Embarrassed-Base-645",
          "created": 1634832196,
          "upvotes": 3,
          "replies": {
            "hhi8q9v": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhi8q9v/",
              "text": "I did go! I majored in philosophy and had minors in bioethics and anthropology. I also completed about 66% of the pre-med courses.\n\nI've been to one fraternity at Brown, and it was in a dorm, I'm not positive if some of theirs have houses or if they are all in dorms. I was in a fraternity and really enjoyed my experience. \n\nThe social scenes are going to differ a lot, just by the nature of each school. I certainly enjoyed ours, but some folks didn't and might have like going out in Manhattan more.",
              "author": "biggreen10",
              "created": 1634833067,
              "upvotes": 3,
              "replies": {
                "hhiergv": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhiergv/",
                  "text": "Yeah, I’m not interested in Harvard, Penn or Columbia because of their urban environment. I’d much rather prefer Dartmouth’s environment. There is no P/F at Dartmouth, correct?",
                  "author": "Embarrassed-Base-645",
                  "created": 1634835428,
                  "upvotes": 3,
                  "replies": {
                    "hhif6q5": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhif6q5/",
                      "text": "There is, but it isn't called Pass/Fail. We have the [NRO](http://dartmouth.smartcatalogiq.com/current/orc/Regulations/Undergraduate-Study/Requirements-for-the-Degree-of-Bachelor-of-Arts/Non-Recording-Option). Basically you say I want to take a class NRO, and if I get lower than X grade, I get a pass, otherwise you get the grade. If you fail, you fail.",
                      "author": "biggreen10",
                      "created": 1634835594,
                      "upvotes": 2,
                      "replies": {
                        "hhifl2n": {
                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhifl2n/",
                          "text": "You get to set the grade at which you would prefer a pass? That’s pretty cool!",
                          "author": "Octocorallia",
                          "created": 1634835752,
                          "upvotes": 5,
                          "replies": {
                            "hhifs2f": {
                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhifs2f/",
                              "text": "Yeah. So if you took Philosophy 3 and said, \"I'm interested in logic, but I don't want to risk my GPA.\" You could set your NR limit at B+. If you get a B through D, you get NR and no impact on your GPA, if you get B+, A-, or A, you get that grade as if you never elected to use the NRO.",
                              "author": "biggreen10",
                              "created": 1634835826,
                              "upvotes": 4,
                              "replies": {
                                "hhizvaa": {
                                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhizvaa/",
                                  "text": "Got it, and you only get 3 NROs, correct?",
                                  "author": "Embarrassed-Base-645",
                                  "created": 1634843953,
                                  "upvotes": 2,
                                  "replies": {
                                    "hhizzw7": {
                                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhizzw7/",
                                      "text": "You only get 3 NRs, if you get above your cutoff you get the NRO refunded.",
                                      "author": "biggreen10",
                                      "created": 1634844005,
                                      "upvotes": 2,
                                      "replies": {
                                        "hhj11w8": {
                                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj11w8/",
                                          "text": "Oh, awesome thanks! What did you use it on?",
                                          "author": "Embarrassed-Base-645",
                                          "created": 1634844435,
                                          "upvotes": 2,
                                          "replies": {
                                            "hhj1a84": {
                                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj1a84/",
                                              "text": "I'm not sure I did use it ever. I maybe set it once, but exceeded the grade limit. It is important to note that a course with an NR can't be used for distributive requirement or major/minor requirement. And between distribs, major, minors, and pre-med I didn't have all that many courses.",
                                              "author": "biggreen10",
                                              "created": 1634844528,
                                              "upvotes": 1,
                                              "replies": {
                                                "hhj3ywb": {
                                                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj3ywb/",
                                                  "text": "Ah, so very niche",
                                                  "author": "Embarrassed-Base-645",
                                                  "created": 1634845618,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hhj46ir": {
                                                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj46ir/",
                                                      "text": "A touch, but plenty of people use them.",
                                                      "author": "biggreen10",
                                                      "created": 1634845705,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "hhjanf6": {
                                                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjanf6/",
                                                          "text": "Any cons of Dartmouth that’s overlooked?",
                                                          "author": "Embarrassed-Base-645",
                                                          "created": 1634848271,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "hhjay1a": {
                                                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjay1a/",
                                                              "text": "This is a great question, but is going to vary a LOT by person, and it can be hard to compare. I was definitely let down by my academic advising as a freshman. Part of that was on me for not fully engaging (I had to get to practice!), but I definitely got off to a rocky start that wasn't necessary. I think they have addressed this to some degree since 2006 however.",
                                                              "author": "biggreen10",
                                                              "created": 1634848391,
                                                              "upvotes": 1,
                                                              "replies": {
                                                                "hhjbia8": {
                                                                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjbia8/",
                                                                  "text": "Got it, thank you! Did you ever run into any issues regarding the rural environment? I don’t need a Costco but I don’t want to rely on Amazon for everything. Also, did you have a car?",
                                                                  "author": "Embarrassed-Base-645",
                                                                  "created": 1634848612,
                                                                  "upvotes": 1,
                                                                  "replies": {
                                                                    "hhjfn92": {
                                                                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjfn92/",
                                                                      "text": "There's a BJs about 15 min away, along with Walmart, and other big box stores. \n\nI was able to borrow a friend's car (her parents were professors and lived in town) freshman year, but freshmen typically cannot have cars. From there I had one on and off until senior year when I had one all the time. \n\nI didn't mind being in a small town, it had more or less everything I wanted.",
                                                                      "author": "biggreen10",
                                                                      "created": 1634850304,
                                                                      "upvotes": 1,
                                                                      "replies": {
                                                                        "hhjixpt": {
                                                                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjixpt/",
                                                                          "text": "Perfect, thank you. Were there other schools you considered alongside Dartmouth?",
                                                                          "author": "Embarrassed-Base-645",
                                                                          "created": 1634851718,
                                                                          "upvotes": 1,
                                                                          "replies": {
                                                                            "hhjjjy9": {
                                                                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjjjy9/",
                                                                              "text": "I was split EDing to Yale, Dartmouth, or Williams. I also liked Brown, Colgate, Hamilton, Tufts.",
                                                                              "author": "biggreen10",
                                                                              "created": 1634851986,
                                                                              "upvotes": 1,
                                                                              "replies": {}
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhip3z8": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhip3z8/",
      "text": ">I would also need financial aid (heavily) ... it almost feels like I’m leaving something on the table now by not going to a Yale or Dartmouth? I don’t know how to describe it.\n\nYour brother sounds like a prestige whore (exactly [this person](https://www.urbandictionary.com/define.php?term=prestige%20whore)) and you are ***NOT*** going to Yale or Dartmouth. You haven't got into any school yet and you sound like a very arrogant person who doesn't fit in well at Brown. Did your brother need FA since he got off the waitlist? Please read [U. administration seeks to address lack of middle-income applicants](https://www.browndailyherald.com/article/2021/10/u-administration-seeks-to-address-lack-of-middle-income-applicants). Your situation might be very different from your bother's. But the fact that you're asking this question now means you shouldn't ED to Brown. Unless you're a full-paid student or your family income is low enough that your family won't pay out of pocket, you probably would get a  better deal if you apply RD, assuming you can get into multiple competitive schools.",
      "author": "JJKKLL10243",
      "created": 1634839580,
      "upvotes": 1,
      "replies": {
        "hhizzrf": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhizzrf/",
          "text": "That’s a great point regarding ED vs RD, thanks!",
          "author": "Embarrassed-Base-645",
          "created": 1634844004,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhifzcp": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhifzcp/",
      "text": "Does he think you are trying to be him and he wants you to be YOU?",
      "author": "calmbythewater",
      "created": 1634835903,
      "upvotes": 1,
      "replies": {
        "hhij2d0": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhij2d0/",
          "text": "I assume that his brother has his best interest at heart. He knows Brown, knows his brother, and knows what it takes to get into investment banking. Unless his brother is trying to sabotage him (unlikely) he should weigh what is brother is saying more than any of us random people on a chat board.",
          "author": "Octocorallia",
          "created": 1634837125,
          "upvotes": 3,
          "replies": {
            "hhj0lrn": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj0lrn/",
              "text": "No, you’re right. As much as it threw me off, I do think my brother just wants the best for me.",
              "author": "Embarrassed-Base-645",
              "created": 1634844252,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhipe92": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhipe92/",
      "text": "Just ignore him.",
      "author": "Classical_Music26",
      "created": 1634839696,
      "upvotes": 1,
      "replies": {}
    },
    "hhijl0q": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhijl0q/",
      "text": "lol brown is full of the new hippies whos parents dont have roots in the financials, military-industrial, legal or political sector. go to dartmouth or yale where the WASPs are, your brother is right\n\ndartmouth and brown are both third tier institutions, but at least the important people (WASPs) will respect you if you were an athlete at dartmouth\n\nsafest pick is yale, more prestigious than most schools to the upper echelon of western civilization, moreso than the schools such as harvard, stanford or mit that the stem centric immigrants and minorities tunnel vision",
      "author": "ihatenehgurrs-alot",
      "created": 1634837335,
      "upvotes": -4,
      "replies": {
        "hhikq1y": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhikq1y/",
          "text": "What are you even talking about???! This makes so little sense, stop spewing this non-sense to kids trying to apply to college.",
          "author": "biggreen10",
          "created": 1634837795,
          "upvotes": 4,
          "replies": {
            "hhj7p17": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj7p17/",
              "text": "This ^",
              "author": "ConfidentMangoApple",
              "created": 1634847105,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hhj10sg": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj10sg/",
          "text": "I genuinely don’t know what you’re talking about and it’s crazy to me you’re considering top 10 and Ivy League schools as third tier when kids would give up an arm to go",
          "author": "Embarrassed-Base-645",
          "created": 1634844422,
          "upvotes": 3,
          "replies": {
            "hhj3yz4": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj3yz4/",
              "text": "I know this is ad hominem but reading *this guy's username* and his focus on calling \"WASPs\" the \"upper echelon of western society\" versus \"immigrants and minorities\" should tell you enough about what kind of character they have",
              "author": "dreamsungzen",
              "created": 1634845619,
              "upvotes": 1,
              "replies": {
                "hhjalrf": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjalrf/",
                  "text": "Ah, I really gotta start reading usernames first",
                  "author": "Embarrassed-Base-645",
                  "created": 1634848253,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhj1tfh": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj1tfh/",
              "text": "if you dont have a vacation house in nantucket you wont know what im talking about for another decade or so, brown and dartmouth are leagues below why/oxbridge, seperated by the likes of princeton, top lacs, lse and imperial, and equal to the likes of stanford and mit",
              "author": "ihatenehgurrs-alot",
              "created": 1634844747,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhibuef": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhibuef/",
      "text": "The people who are telling u not to apply to brown are the ones applying to brown. Choose the one u like the most but also the one that gives u the beat chance. Legacy is a huge huge boost so keep that in mind when making your decision.",
      "author": "ConfidentMangoApple",
      "created": 1634834290,
      "upvotes": -1,
      "replies": {
        "hhieviq": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhieviq/",
          "text": "Thank you! That being said, it almost feels like I’m leaving something on the table now by not going to a Yale or Dartmouth? I don’t know how to describe it.",
          "author": "Embarrassed-Base-645",
          "created": 1634835472,
          "upvotes": 0,
          "replies": {
            "hhj82bs": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj82bs/",
              "text": "Brown was ranked the happiest Ivy League by students. It’s campus is beautiful. It has grade inflation (great for Econ). Plus u have a huge advantage with sibling legacy. I see it like this, you have a high chance of getting in one, if you give up on that chance for a lower chance at two others, you may end up losing all of them.",
              "author": "ConfidentMangoApple",
              "created": 1634847251,
              "upvotes": 1,
              "replies": {
                "hhjasei": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjasei/",
                  "text": "You’re right, bird in the hand is worth two in the bush and all that",
                  "author": "Embarrassed-Base-645",
                  "created": 1634848327,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhio34p": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhio34p/",
      "text": "1. Not sure about Brown but for most schools, sibling legacy does not mean much. So if you are applying for Brown because you think it will significantly boost your chance, it most likely won't.\n2. Is Dartmouth necessary better than Brown though? For Yale, that is true but not true about Dartmouth. Also for investment banking, why is Columbia not being considered? Being in NYC has significant advantage when it comes to these kind of things.\n3. My take: if you are on the edge, REA at Yale and applying to both Dartmouth/Brown RD probably the best choice. Perhaps you will get rejected by one and your decision will be easy. If you get accepted by both, it is not a bad problem to have.",
      "author": "idkname999",
      "created": 1634839157,
      "upvotes": 0,
      "replies": {
        "hhj0vv9": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj0vv9/",
          "text": "1.\tDidn’t realize that, thanks\n2.\tfor finance, apparently it’s leagues better. Columbia also doesn’t send as many into finance apparently or “the buy side” out of undergrad and I personally don’t want to be in a big city. Campus culture is also a big part for me, and Columbia is lacking.\n3.\tI’m also considering just doing REA at Yale as a compromise and shoot an application to other schools no matter what and decide in march",
          "author": "Embarrassed-Base-645",
          "created": 1634844366,
          "upvotes": 1,
          "replies": {
            "hhj7ljz": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj7ljz/",
              "text": "Sibling legacy gives u a 1.5x advantage",
              "author": "ConfidentMangoApple",
              "created": 1634847067,
              "upvotes": 1,
              "replies": {
                "hhj9lqv": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhj9lqv/",
                  "text": "Lol, 1.5x, so specific.\n\nGive me a source that says sibling legacy gives you 1,5x, Do you think AO pulls out a calculator when deciding your application? Pretty funny.\n\nHere is my source:\n\nAdmission officers give “small” consideration to grandparent legacy status and “almost no” weight to sibling legacy cases,\n\n[https://www.browndailyherald.com/article/2014/04/students-question-use-of-legacy-admission](https://www.browndailyherald.com/article/2014/04/students-question-use-of-legacy-admission)",
                  "author": "idkname999",
                  "created": 1634847855,
                  "upvotes": 1,
                  "replies": {
                    "hhjaq1d": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjaq1d/",
                      "text": "Every little bit helps!",
                      "author": "Embarrassed-Base-645",
                      "created": 1634848301,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hhjfygh": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjfygh/",
                      "text": "It was a numeric told to me by an admission officer so I don’t have a written source. Whatever the case may be, an advantage is an advantage.",
                      "author": "ConfidentMangoApple",
                      "created": 1634850436,
                      "upvotes": 1,
                      "replies": {
                        "hhjgumj": {
                          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjgumj/",
                          "text": "Hmm, was the AO from Brown? Kind of hard to believe a school that is the caliber of Brown gives such specific formula into their admission process (especially considering that it is suppose to be holistic). Additionally, kind of odd that they implement such drastic change in their admission process in the last 6 years.\n\nEither way, advantage is an advantage. However, it is clear that the OP isn't optimizing his/her way into college. Increase your GPA by 0.01 is also an advantage but practically, it makes no difference.",
                          "author": "idkname999",
                          "created": 1634850821,
                          "upvotes": 1,
                          "replies": {
                            "hhji2xg": {
                              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhji2xg/",
                              "text": "It was northwestern",
                              "author": "ConfidentMangoApple",
                              "created": 1634851348,
                              "upvotes": 1,
                              "replies": {
                                "hhjil7i": {
                                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjil7i/",
                                  "text": "My guy, every school has different policy on legacy. Harvard/Princeton flat out stated that they do not consider sibling legacy.",
                                  "author": "idkname999",
                                  "created": 1634851566,
                                  "upvotes": 1,
                                  "replies": {
                                    "hhjkc8v": {
                                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjkc8v/",
                                      "text": "Considering it vs not considering it is a huge difference. If it had little impact the consideration wouldn’t even be asked. Don’t compare legacy to something as minute as an increase in gpa by 0.01.",
                                      "author": "ConfidentMangoApple",
                                      "created": 1634852327,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhjer5u": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjer5u/",
      "text": "10 years out of college, and having gone to a top 5 school for undergrad, my two cents is to spend MUCH more time thinking about your career than you do thinking about your \"dream\" college.  My sense from your post is that you might be doing the opposite.\n\nDo you know what career you want to have? That's the ideal question in my opinion.\n\nDoctor? Lawyer? Teacher? Inventor? Business? Something else? Have you volunteered/worked in your field of interest to test your hypothesis? 10 years from now, nobody will care if you went to Harvard, Stanford, Princeton, Yale, or Arizona State... including you. What you'll care about is what career you have and whether it supports your dreams and lifestyle. If you go to a fancy school and have to borrow 6 figures in student loans for undergrad, you might even regret choosing your dream school upon realizing you could have landed the same career and had just as much fun elsewhere.\n\nMost of this \"dream school\" stuff is simply successful marketing of a product. Schools invest heavily in selling you on how different and special they are when they are mostly the same. Your undergrad degree is a product. Don't over pay for it, and make sure it does something useful for you. You'll know it was useful if you progress towards your dream career with little to no debt from undergrad.",
      "author": "DebtFreeFamilyTree",
      "created": 1634849932,
      "upvotes": 6,
      "replies": {}
    },
    "hhkgn6c": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhkgn6c/",
      "text": "Okay lemme try and give you my perspective on the pros and cons of Brown: \n\nIf you’re looking for a relatively laid back vibe, Brown is a much better choice than Dartmouth and Yale. \n\nIf you’re looking for a place where you don’t want to be surrounded in a petri dish of aspiring finance bros, Brown is a much better place than Dartmouth, and Yale is an equally good choice. \n\nIf you’re looking for a place where you can take advantage of grade inflation (because GPA is sacrosanct in finance recruiting), Brown is a much better choice. \n\nIf you’re looking for a place where you can pursue a very interesting or your own custom major, Brown is the better choice. \n\nNow - if you’re looking at a place where you can maximize your chances of working at elite boutiques/HF/PE then Dartmouth and Yale are both better choices. The thing is, even at these schools, it’s a small minority getting these roles. Sure, Browns alumni presence on Wall St isn’t at rampant as Dartmouth’s, and its name isn’t quite as hallowed as Yale’s, but for all practical purposes you can do as well from Brown than these schools. \n\nThe fact that you’re able to write the Why Brown essay easily shows that it’s an amazing fit for you. It also means that you have a better chance of getting in than somewhere where you have to force it out. \n\nI feel like the reason Brown doesn’t naturally fit into Wall St jobs (and you should probably verify this with your brother) is that finance jobs, especially IB, are an absolute grind. So going to a place like Wharton where there’s that competitive culture from the get go, or doing a STEM degree from a T20 shows to prospective employers that you can put in the work. Brown, however, is known for a lax culture and massive grade inflation, so perhaps one won’t naturally develop the same work ethic as they would elsewhere. So if you do go to Brown, I would advise you to actively seek internships, and take on some rigorous courses to show employers you’ve got what it takes, and actually build the work ethic needed for finance. \n\nIn short - I’d say go Brown. There are a million things other than career prospects that should feed into your decision, but be aware of the couple of disadvantages you *may* have.",
      "author": "Berated-Penguin",
      "created": 1634867317,
      "upvotes": 1,
      "replies": {
        "hhknwpw": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhknwpw/",
          "text": "Thank you so much for all this, duly noted.",
          "author": "Embarrassed-Base-645",
          "created": 1634870803,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhjkbkv": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjkbkv/",
      "text": "Apply to Brown\n\n\nSincerely,\n\nA Brown Alum\n\n\nOn a serious note, I really would not stress about the differences between schools all that much. You'll enjoy/hate college as a function of your own decisions much more than which particular school you go to, especially when the comparisons are between the Ivies. \n\nIt's true that Yale and Princeton have higher rates of IB graduates. It's also true that Brown has extensive interest from IB recruiters and many of my friends work in that field. Getting into IB is very much about connections...and if you have a brother in the field to the extent that you can have your pick of Ivies, you already have a ridiculous leg up. \n\nI am unsure how much your family makes, but I absolutely needed a generous finaid package. Brown exceeded the offers for my in state college by a long shot. In general, getting into an Ivy means you'll have really nice financial support.\n\nGood luck!",
      "author": "Vergilx217",
      "created": 1634852319,
      "upvotes": 1,
      "replies": {
        "hhjweqm": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjweqm/",
          "text": "Thank you! Did you enjoy the social scene",
          "author": "Embarrassed-Base-645",
          "created": 1634857813,
          "upvotes": 1,
          "replies": {
            "hhk4o4p": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk4o4p/",
              "text": "hell ya! there's a really active scene for parties of all shapes and sizes, and the people are super friendly and open to meeting you. really vibrant campus, really excellent people around, just be careful not to end up at Jo's too often",
              "author": "Vergilx217",
              "created": 1634861746,
              "upvotes": 1,
              "replies": {
                "hhknpt1": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhknpt1/",
                  "text": "Is that the pizza place?",
                  "author": "Embarrassed-Base-645",
                  "created": 1634870708,
                  "upvotes": 1,
                  "replies": {
                    "hhkpd4f": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhkpd4f/",
                      "text": "late night campus eatery\n\nperfect place for mozzarella sticks at 2am after a night out (before covid at least)",
                      "author": "Vergilx217",
                      "created": 1634871526,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhjqzv3": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjqzv3/",
      "text": "OP, from ur comments, it seems like ur depending on ur brother a little too much... I suggest u try to branch out. That's the only way ur going to be able to know what *you* like/want",
      "author": "-lufepoh-",
      "created": 1634855285,
      "upvotes": 1,
      "replies": {
        "hhjwhiy": {
          "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhjwhiy/",
          "text": "No, that’s very fair, but he’s never steered me wrong yet",
          "author": "Embarrassed-Base-645",
          "created": 1634857849,
          "upvotes": 1,
          "replies": {
            "hhk5j8o": {
              "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhk5j8o/",
              "text": "😂😂 understandable! If he's never steered u wrong though, why not trust him about trying for more prestigious schools (by his definition)? What major do u want to pursue?",
              "author": "-lufepoh-",
              "created": 1634862152,
              "upvotes": 1,
              "replies": {
                "hhkns5w": {
                  "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhkns5w/",
                  "text": "I plan to major in economics so any school in the Ivies would do",
                  "author": "Embarrassed-Base-645",
                  "created": 1634870741,
                  "upvotes": 1,
                  "replies": {
                    "hhl7j6m": {
                      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhl7j6m/",
                      "text": "I kinda agree with ur brother here. Brown is a good school, but why not try for better?",
                      "author": "-lufepoh-",
                      "created": 1634882676,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhqz1ju": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hhqz1ju/",
      "text": "Listen to your brother. He has your best interests at heart.",
      "author": "MakingCake1",
      "created": 1635002769,
      "upvotes": 1,
      "replies": {}
    },
    "hiy9dd4": {
      "link": "/r/ApplyingToCollege/comments/qcu0ui/older_brother_doesnt_want_me_to_apply_to_brown/hiy9dd4/",
      "text": "I go to Brown n we have tons of people going into ib each year, but yes Dartmouth is the most  finance-oriented of the three.  If you're into frats, then Dartmouth would also be more of that. That said Brown has a lovely location (enough to do in providence, and Boston is an hour away), is pretty liberal and accepting, hella gay, and you can get whatever you want from the social scene here. Open curriculum is hella sexy and the quarter system tends to be pretty intense. That said, Dartmouth is known for being the other 'chill' ivy so it shouldn't be too rough I'd expect.",
      "author": "mithrandir767",
      "created": 1635812140,
      "upvotes": 1,
      "replies": {}
    }
  }
}