{
  "sid": "qtmkxv",
  "link": "/r/ApplyingToCollege/comments/qtmkxv/my_high_school_does_not_offer_ap_exams_and_taking/",
  "title:": "My high school does not offer AP exams and taking them from a different institution is very costly. So I couldn't take any AP exams. Will this affect my acceptance? Should I include in my essay that I couldn't take any AP exams?",
  "text": "Thanks in advance!",
  "author": "_black_eyes_",
  "created": 1636883357,
  "updated": 1637180392,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkklka0": {
      "link": "/r/ApplyingToCollege/comments/qtmkxv/my_high_school_does_not_offer_ap_exams_and_taking/hkklka0/",
      "text": "It won't negatively impact you – just indicate that in the additional information section, and if there is any other place to explain your academics, then I'd recommend adding it there too.",
      "author": "ilabet",
      "created": 1636884762,
      "upvotes": 2,
      "replies": {}
    },
    "hkkk4gw": {
      "link": "/r/ApplyingToCollege/comments/qtmkxv/my_high_school_does_not_offer_ap_exams_and_taking/hkkk4gw/",
      "text": "No it should not effect anything. Most major schools have lists of what each school offered.",
      "author": "jonbush1234",
      "created": 1636883660,
      "upvotes": 1,
      "replies": {}
    },
    "hkkl5qq": {
      "link": "/r/ApplyingToCollege/comments/qtmkxv/my_high_school_does_not_offer_ap_exams_and_taking/hkkl5qq/",
      "text": "I don't think it will negatively impact your admissions chances if you don't take the exams, but if you can take the AP tests at another institution and do well.. I mean that *would* help your chances. College Board does offer exam fee reductions, so that's something to look into.",
      "author": "ladidadidadidada",
      "created": 1636884457,
      "upvotes": 1,
      "replies": {
        "hkklfny": {
          "link": "/r/ApplyingToCollege/comments/qtmkxv/my_high_school_does_not_offer_ap_exams_and_taking/hkklfny/",
          "text": "I tried with other institutions. Some reject me saying that the exams are reserved only for their students, while some hike the price upto thrice the original one, so my parents are not willing to pay for them and I can't afford them.",
          "author": "_black_eyes_",
          "created": 1636884664,
          "upvotes": 1,
          "replies": {
            "hkktpnw": {
              "link": "/r/ApplyingToCollege/comments/qtmkxv/my_high_school_does_not_offer_ap_exams_and_taking/hkktpnw/",
              "text": "Alternate test centers charging 3x the already high price of an AP exam sounds super sketchy.  \n\nYou’re fine not doing the AP if your school doesn’t offer AP classes and you won’t be penalized at all for admissions purposes. Keep asking around local public and private schools if you do want to sit for an AP, but def nbd if you don’t.",
              "author": "GrantTheFixer",
              "created": 1636890739,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkl3qwn": {
      "link": "/r/ApplyingToCollege/comments/qtmkxv/my_high_school_does_not_offer_ap_exams_and_taking/hkl3qwn/",
      "text": "\nYou don't need to take AP tests if it is not offered to you in your school. Your high school grades, SAT/ACT test scores, English proficiency test scores (if required) is enough for admissions consideration in addition to your completed application and financial aid application (if needed).\n\nIf your high school curriculum is seen as rigorous then it should be definitely enough.\n\nAlso check out r/IntltoUSA",
      "author": "rama2476",
      "created": 1636896891,
      "upvotes": 1,
      "replies": {}
    },
    "hknl2b1": {
      "link": "/r/ApplyingToCollege/comments/qtmkxv/my_high_school_does_not_offer_ap_exams_and_taking/hknl2b1/",
      "text": "No, you aren’t expected to take courses that are not offered. You will be evaluated in the context of your school’s offerings, typically reported on the school profile.\n\nYou should be able to see your school profile. If it’s not documented (which would be odd), you can mention it.",
      "author": "RichInPitt",
      "created": 1636933808,
      "upvotes": 1,
      "replies": {}
    }
  }
}