{
  "sid": "q7b4ko",
  "link": "/r/ApplyingToCollege/comments/q7b4ko/would_it_be_okay_to_have_a_freshmansophomore_year/",
  "title:": "Would it be okay to have a freshman/sophomore year teacher be a recommender?",
  "text": "I don’t have too many teachers because a lot retired the year after I had them, hard to get into contact with, and I also moved schools between sophomore and Junior year. I was wondering if it would be good to have a freshman and sophomore year teacher I had be one to write a recommendation letter, and also a junior and senior year teacher I have, or would colleges only want the junior year teachers",
  "author": "Unluckyducky73",
  "created": 1634131586,
  "updated": 1634167064,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hghmz7r": {
      "link": "/r/ApplyingToCollege/comments/q7b4ko/would_it_be_okay_to_have_a_freshmansophomore_year/hghmz7r/",
      "text": "One sophomore teacher is probably ok.  My kid had a freshman year teacher that would tell his other classes \"ZZZ is the best student I've ever had in 10 years\" so you know the letter would have been good, but my kid and the college counselor both nixed that idea.  Sigh.",
      "author": "the3twins",
      "created": 1634136873,
      "upvotes": 2,
      "replies": {
        "hgj955j": {
          "link": "/r/ApplyingToCollege/comments/q7b4ko/would_it_be_okay_to_have_a_freshmansophomore_year/hgj955j/",
          "text": "Alright ya I think I’ll do it then. This sophomore and freshman year teach also taught a student that got accepted to Harvard and the teacher said I remind her of him, it seemed like she really liked me so I think she’s be a great resource\n\nDo you know if also having a coach from that long ago would be good as well? He was my coach 8th, freshman and sophomore year, and saw my work both in school and out, and because of covid I don’t really have any other people like that who saw me working out of school/during extracurriculars",
          "author": "Unluckyducky73",
          "created": 1634160408,
          "upvotes": 1,
          "replies": {
            "hgjebv9": {
              "link": "/r/ApplyingToCollege/comments/q7b4ko/would_it_be_okay_to_have_a_freshmansophomore_year/hgjebv9/",
              "text": "Hard to say, because you're only looking at 2 teacher recs and 1 'other' rec.  It'd be nice if 2 of the 3 were people who knew you in the last 1 yr or so.  Is it possible since he's the 'other' that he not necessarily specify \\*when\\* he coached you, and just say he's your coach?",
              "author": "the3twins",
              "created": 1634162652,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}