{
  "sid": "qga5ym",
  "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/",
  "title:": "To the AOs and Counsellors, why is the sports essay an eyeroller in your opinion?And how can it be better.",
  "text": "I wrote my personal essay based on alesson I learnt from making an error in sports. If this seems cliche to you, tell me why? Moreover, what to can be done to make a sports essay outstanding.",
  "author": "m-n_10",
  "created": 1635265596,
  "updated": 1635301535,
  "over_18": false,
  "upvotes": 54,
  "upvote_ratio": 0.97,
  "comments": {
    "hi4u2a9": {
      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi4u2a9/",
      "text": "Hi! I asked admissionsmom this in the AMA last Friday, and this is what she said\n\n>I tend to cringe when I read sports essays because usually they have long boring descriptions of sweat and pain and events outside the writer. If they really focus on inner you and what you've learned about yourself in the process of sports, then they can work but really dig inside and think about what message about you you want to share about yourself by using sports as the vehicle to share the message of who you are.",
      "author": "Admiralsky",
      "created": 1635266821,
      "upvotes": 63,
      "replies": {
        "hi50i45": {
          "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi50i45/",
          "text": "That’s a variation of what I was just about to write! 😊",
          "author": "admissionsmom",
          "created": 1635269342,
          "upvotes": 19,
          "replies": {
            "hi52zxj": {
              "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi52zxj/",
              "text": "But (and hear me out) what if the sports descriptions and evrything to do with sports is all in the anecdotal introduction to my essay.?  Is this still feasible considering the fact that the rest of my essay is pretty much philosophical?",
              "author": "m-n_10",
              "created": 1635270321,
              "upvotes": 10,
              "replies": {
                "hi53t0b": {
                  "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi53t0b/",
                  "text": "I really don’t want a description of what happened in the sports.  I just want to learn about you.  Of course I’m not seeing your essay to hear what you mean by the anecdotal part but I wouldn’t set a sports scene or anything. I’d jump straight into your values",
                  "author": "admissionsmom",
                  "created": 1635270639,
                  "upvotes": 21,
                  "replies": {
                    "hi5ph4p": {
                      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi5ph4p/",
                      "text": "Ok so now I'm interested as well. I've chosen common app prompt 6 (writing about an interest that makes you lose track of time). I've started with a kind of anecdotal introduction, which I'm\nhoping shows the reader my interest, and then transitioning to explaining why my topic is interesting to me. Would you suggest not having a (about 150 word) anecdotal intro for this type of essay as well? Or just for sports ones? Sorry if that doesn't make sense, I'm trying to be vague because I don't particularly want to mention the specific topic.",
                      "author": "noah8597",
                      "created": 1635279074,
                      "upvotes": 5,
                      "replies": {
                        "hi5rff0": {
                          "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi5rff0/",
                          "text": "Most admissions essays start with some kind of anecdote. I’ll be honest — it’s not my favorite way of beginning an essay but it does work much of the time. Like pretty much every thing with college admissions there are no hard and fast rules. And what I find often, but not always, with essays that start with an anecdote, is they feel like the applicant is trying to follow some kind of formula they’ve found for college essays. \n\nJust don’t spend a lot of time on an anecdote if you do go that way. I read lots of essays and I read them very quickly.  I want to know about you. Not whatever the anecdote is. \n\nBut for sports essays in particular I’d be very careful.",
                          "author": "admissionsmom",
                          "created": 1635279822,
                          "upvotes": 5,
                          "replies": {
                            "hi5sovw": {
                              "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi5sovw/",
                              "text": "Yeah! It's kinda weird topic to hide so Ill just say that my essay is about ethics and my intro is a description of the trolley problem (it's a bit long but written in a fun and informal style). Too much?",
                              "author": "noah8597",
                              "created": 1635280312,
                              "upvotes": 2,
                              "replies": {
                                "hi69o7c": {
                                  "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi69o7c/",
                                  "text": "As long as it gets to you quickly",
                                  "author": "admissionsmom",
                                  "created": 1635287269,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hi4xmjd": {
      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi4xmjd/",
      "text": "As a reviewer, I simply don't care who wins a high school sports event.  What I care about is what I can learn about YOU, the applicant, in your essay, and how you might fit into the community I've been tasked with curating.  In most sports essays, I learn that you do the sport, that you have some struggle or challenge related to it (like an error you made), and that you're really invested in it.  You maybe got through that challenge or got better at your sport by working hard.  But that's it.  And those things could be inferred from a single entry in your activities section or a line in a letter of recommendation.  Even a single phrase in your essay could cover that - and besides, it's not an especially compelling list of insights anyway.  So I either need something much more personally meaningful, or else some other reason why the sports story is important or valuable to you.\n\nYou won't draw the reader in from the tension or drama of your sports event because they aren't there to be entertained and they're never going to care who wins, who loses, who gets hurt, or whatever other narratives you try to peddle.  It's nearly impossible to make the plot compelling.  Making matters worse, writing about a sports event is a somewhat common topic, which means that the bar is higher to stand out.  Most students draw quite predictable conclusions from it - that running taught you perseverance or that basketball taught you to value teamwork.  That ends up sort of going in one ear and out the other, and your essay becomes easily forgettable.  Plus I could take my pick of several dozen really strong applicants who had essentially that exact theme in their essay - so you're not helping yourself stand out.\n\nHere's a quote from my full essay guide, which I recommend you read if you get the chance:  \n\n>\"If you really want to go with a common topic, approach it in an uncommon way or draw uncommon personal insights from it. Don’t talk\nabout how cross country taught you the value of hard work, team work, leadership, discipline, or\nperseverance. Don’t make easy and trite connections or be simple and predictable.\n\n>Here’s a great way to test this - does your connection immediately make sense when taken out\nof context? If so, then it’s too easy. Let’s say you’re considering saying that you learned about\npatience, creativity, artistry, true beauty, or attention to detail from your photography hobby.\nRight away you know that’s too simple because no additional detail or explanation is necessary\nfor someone else to immediately understand or make sense of it. Instead, look at your list of\ncore values, foundational beliefs, motivations, aspirations, personal strengths, etc and pick\nsomething that doesn’t immediately make sense. So you look at your list and realize that\nphotography helped you develop your sense of fearlessness. I would love to read an essay about\nhow a student became more daring because of his/her photography hobby.\n\n>Going back to cross country, say it increased your insights about generosity, creativity, or\ncommunication. Those are way more interesting than discipline or other standard sports tropes.\nOnce you’ve picked your topic and connected core value, go try it out on someone - your mom,\nsibling, friend, cashier, etc. If they say it sounds like a great idea and makes lots of sense, it’s\nprobably too simple, too common, and a bad idea for standing out. Instead if it goes something\nlike this, you might be on the right track:\n\n>You: “I have my college essay all planned out. It’s about how playing accordion taught\nme to value compassion.”\n\n>Cashier: “Sir, this is a Kroger. Also, what?!?”\n\n>Now we’re talkin’.\"\n\nAs I mentioned, one way to address this would be to connect your sport to a core value of yours that isn’t predictable. What if instead of learning to focus more or work harder, your sport taught you to express honesty, or include social outcasts, or listen to others, or something deeply important to you? That would be more interesting and less predictable.  Then, you could show other examples that demonstrate those same core-values at work.\n\nObviously you should choose personal insights that are real and relevant for you - I included the examples just to give you the idea of what I'm driving at. Last year I had a student write a predictable, cookie-cutter essay about hockey...for UChicago.  We reformed it into an essay about leadership where hockey was just a small backdrop.  We cut all the scenes of in-game action so we could focus on the interpersonal relationships, leadership challenges/solutions, and personal growth, and the student was admitted.  Don't write about sports; write about YOU.\n\nFinally, all of this changes a bit if you're a recruited athlete.  If that's the case, you still need personal insights, but showing commitment to your sport, what it means to you, etc becomes much more interesting, meaningful, and compelling to the admissions office.",
      "author": "ScholarGrade",
      "created": 1635268211,
      "upvotes": 31,
      "replies": {
        "hi66gky": {
          "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi66gky/",
          "text": "Hey! I'm in a similar spot, and I have some questions. \n\nI drive a racecar. I keep pushing myself into a paradox where I worry that an AO won't understand the sport, so I explain it thru stories and accidentally make my essay into a classic sports essay. All I really want to do is talk about how being involved in such a pro sport has clashed with my school life but I keep dwelling too much on explaining the sport. I think the main thing is that I really want to push the point across that what I do is really insane. It's easy when they know the workings of a sport like football and nothing about what I do. Any advice? Should I just not even dwell on the workings of the sport and hope that they just assume that it's rugged?",
          "author": "aidanisverycool_",
          "created": 1635285862,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hi52dec": {
      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi52dec/",
      "text": "What's generic is the \"big game\" essay. Those usually follow the same pattern. \n\nNow, if you are writing about something more specific and making it personal (and it sounds like you are), I think you could have a solid essay.",
      "author": "UVaDeanj",
      "created": 1635270074,
      "upvotes": 13,
      "replies": {
        "hi535wk": {
          "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi535wk/",
          "text": "My essqy sounds more like the latter. Thnx for the feedback.",
          "author": "m-n_10",
          "created": 1635270387,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi4rirq": {
      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi4rirq/",
      "text": "It’s as cliche as cliche as can be, narrowly edging out “dead grandma” last year.",
      "author": "Strict-Special3607",
      "created": 1635265825,
      "upvotes": 8,
      "replies": {
        "hi58zpo": {
          "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi58zpo/",
          "text": "haha totally didn’t write anything about that…😁😗😐😕😔",
          "author": "melmanlookalike",
          "created": 1635272686,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hi4y4lr": {
      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi4y4lr/",
      "text": "i wrote my essay on sports & got into all the schools i applied to, so they can work",
      "author": "Witty-Evidence6463",
      "created": 1635268413,
      "upvotes": 4,
      "replies": {
        "hi506r3": {
          "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi506r3/",
          "text": "Or… “it’s possible to get in despite doing so.”\n\nYou’ll never know which.\n\n😎",
          "author": "Strict-Special3607",
          "created": 1635269222,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "hi4weft": {
      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi4weft/",
      "text": "I disagree with this \"common\" feedback. \n\nA sports essay can be great if you focus on the following:\n\n* What have you learned both about yourself and the world as a result of a conflict in this sport and then its resolution? \r\n* AND How have you grown because of these challenges?\r\n* OPTIONAL: If given the opportunity to repeat this experience, what would you do differently?\r\n* What weaknesses have you identified in yourself after experiencing these challenges? \r\n* AND How have you tried to overcome these weaknesses? \r\n* AND How do you plan on overcoming these weaknesses in the future?",
      "author": "career-tuners",
      "created": 1635267729,
      "upvotes": 2,
      "replies": {}
    },
    "hi6xk0f": {
      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi6xk0f/",
      "text": "!remindme 1 day",
      "author": "hiworld12333",
      "created": 1635298076,
      "upvotes": 1,
      "replies": {
        "hi6xm2y": {
          "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi6xm2y/",
          "text": "I will be messaging you in 1 day on [**2021-10-28 01:27:56 UTC**](http://www.wolframalpha.com/input/?i=2021-10-28%2001:27:56%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi6xk0f/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fqga5ym%2Fto_the_aos_and_counsellors_why_is_the_sports%2Fhi6xk0f%2F%5D%0A%0ARemindMe%21%202021-10-28%2001%3A27%3A56%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20qga5ym)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "author": "RemindMeBot",
          "created": 1635298103,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi6zba7": {
      "link": "/r/ApplyingToCollege/comments/qga5ym/to_the_aos_and_counsellors_why_is_the_sports/hi6zba7/",
      "text": "Hey, my essay is technically a sport but it’s pretty uncommon and it’s premise is pretty unique",
      "author": "menialchocolates",
      "created": 1635298865,
      "upvotes": 1,
      "replies": {}
    }
  }
}