{
  "sid": "q5mpb4",
  "link": "/r/ApplyingToCollege/comments/q5mpb4/sending_sat_scores/",
  "title:": "Sending SAT scores???",
  "text": "Do I send my SAT score reports through college board even though I am self reporting them on Common App? Also, how far in advance should I send my score reports if I am applying Nov 1???",
  "author": "Confident_Kitchen555",
  "created": 1633921028,
  "updated": 1634073476,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hg6ow1n": {
      "link": "/r/ApplyingToCollege/comments/q5mpb4/sending_sat_scores/hg6ow1n/",
      "text": "First, check each of your colleges' websites to see what score reporting methods they accept. Many colleges now accept scores self-reported in the app (or portal), for free, to be followed by an official report only if you later enroll. However, other colleges still require official score reports sent directly from the testing agency prior to admission.",
      "author": "elkrange",
      "created": 1633921602,
      "upvotes": 1,
      "replies": {}
    },
    "hg6onfu": {
      "link": "/r/ApplyingToCollege/comments/q5mpb4/sending_sat_scores/hg6onfu/",
      "text": "Hi!\n\nYes, the score sends in college board are necessary for colleges that require official SAT score reports. They are a separate step from the common app, so technically you can submit an application and a week later, submit your SAT score report. Ideally, I would recommend submitting your scores at least a couple of weeks in advance just to get it out of the way and be safe. You can always check in on the College Board Score Send History ([https://studentscores.collegeboard.org/scoresends](https://studentscores.collegeboard.org/scoresends)) in order to find out the status of your scores (i.e. pending, sent, etc.) Good luck!",
      "author": "abert_",
      "created": 1633921472,
      "upvotes": 0,
      "replies": {
        "hg6pk0r": {
          "link": "/r/ApplyingToCollege/comments/q5mpb4/sending_sat_scores/hg6pk0r/",
          "text": ">Yes, the score sends in college board are necessary for colleges that require SAT/colleges you want to have look at your score.\n\nOnly if the school requires official score reports.",
          "author": "Strict-Special3607",
          "created": 1633921965,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}