{
  "sid": "qc2ilc",
  "link": "/r/ApplyingToCollege/comments/qc2ilc/supplementary_material/",
  "title:": "Supplementary material",
  "text": "Supplementary material: I participated in a very prestigious music festival singing in a choir, there’s a video on YouTube of the performance, but there are 150+ people on stage. Should I submit it? The performance is of very high-level. (I’m a international students so I thought that a video might give an idea of what I wrote about an EC in the respective section). \n\nTHE COLLEGE WEBSITE STATES “If not a solo recording, please indicate your\nperformance in the description\nsection of the media details”.",
  "author": "angelikesunsets",
  "created": 1634741196,
  "updated": 1634749575,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhd8fvk": {
      "link": "/r/ApplyingToCollege/comments/qc2ilc/supplementary_material/hhd8fvk/",
      "text": "I'd say do it!! It cannot harm your application, just improve it and give it more credibility. Personally I'd say maybe point out a circle on the video itself depicting where you're located on stage (just use an editing app and a drawing tool) since the AO might not even know what you look like.",
      "author": "anuxietys",
      "created": 1634741326,
      "upvotes": 1,
      "replies": {
        "hhdcaau": {
          "link": "/r/ApplyingToCollege/comments/qc2ilc/supplementary_material/hhdcaau/",
          "text": "Yep, that would be a good idea, thank you! the only problem is that the video continues to change (I mean sometimes it shows the orchestra, others the choir, etc) so I don’t think I can draw a circle. Should I upload it anyway?",
          "author": "angelikesunsets",
          "created": 1634742922,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhd8vfp": {
      "link": "/r/ApplyingToCollege/comments/qc2ilc/supplementary_material/hhd8vfp/",
      "text": "More importantly, the website also states, \"While we request that the volume of supplementary credentials be kept to a minimum, there may be occasions where such credentials provide valuable information that the standard application does not. \"\n\nSounds like you sufficiently covered it elsewhere in your application.",
      "author": "skieurope12",
      "created": 1634741500,
      "upvotes": 1,
      "replies": {
        "hhdcz2q": {
          "link": "/r/ApplyingToCollege/comments/qc2ilc/supplementary_material/hhdcz2q/",
          "text": "Yep, I tried to describe it in 150 characters in the ECs section. I put the number of spectators Ann other info, but of course a 150-character description cannot convey the same idea the video would. \nWould it be okay if a send you the YouTube link so that you can tell whether to upload it or not?",
          "author": "angelikesunsets",
          "created": 1634743205,
          "upvotes": 1,
          "replies": {
            "hhdebr8": {
              "link": "/r/ApplyingToCollege/comments/qc2ilc/supplementary_material/hhdebr8/",
              "text": "Be my guest",
              "author": "skieurope12",
              "created": 1634743752,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}