{
  "sid": "qaaxwn",
  "link": "/r/ApplyingToCollege/comments/qaaxwn/advice_on_umich_community_essay/",
  "title:": "Advice on UMich Community Essay",
  "text": "**Supplemental Question:** Everyone belongs to many different communities and/or groups defined by (among other things) shared geography, religion, ethnicity, income, cuisine, interest, race, ideology, or intellectual heritage. Choose one of the communities to which you belong, and describe that community and your place within it. (Max 300 Words) \n\nMy personal essay is about my assimilation to American culture and renouncement of Indian culture to feel a sense of belonging and how it wasn't the best idea. For my community essay, the plan was to sort of expand on this idea and show how I now live on the edge of both cultures. Do you think there will be too much overlap? Should I think of another community that I'm a part of (which will be quite hard because I'm pretty bland)? \n\nThe only other topic that comes to mind is my high school community. It sounds weird, but my campus consists of 3 schools and roughly 6,000 students (something not many people have). \n\nAll feedback is greatly appreciated!",
  "author": "RegretIcy886",
  "created": 1634515373,
  "updated": 1634653719,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh1t6uz": {
      "link": "/r/ApplyingToCollege/comments/qaaxwn/advice_on_umich_community_essay/hh1t6uz/",
      "text": "I think the topic is rich enough to warrant a second essay around the same ideas.  But I would strive to say something different in the community essay (not opposing, just separate in some way).  Maybe focus on some particular aspect of your Indian-American experience that you only touched on in your 1st essay?  Or get more granular if your 1st essay was high concept?  Or frame the 2nd essay around a particular experience or interaction that you've had?  300 words isn't too much, so you can get away with a slice of life approach.\n\nIf you have something meaningful to say that goes beyond (or in a different direction) the 1st essay, I think it's ok if there's a slight topical overlap.\n\nGood Luck!",
      "author": "Repulsive-Nerve-5558",
      "created": 1634516016,
      "upvotes": 3,
      "replies": {
        "hh1v4az": {
          "link": "/r/ApplyingToCollege/comments/qaaxwn/advice_on_umich_community_essay/hh1v4az/",
          "text": "In my personal essay, I never went into depth about how both cultures intertwined, so I think I can expand on that. \n\nThank you for the feedback and the luck :)",
          "author": "RegretIcy886",
          "created": 1634516972,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}