{
  "sid": "qcz9q5",
  "link": "/r/ApplyingToCollege/comments/qcz9q5/is_saying_a_big_goal_is_like_being_ambitious_bad/",
  "title:": "is saying a big goal is like \"being ambitious\" bad?",
  "text": "this title makes no sense but basically:\n\nif i say smth like (acting is NOT my actual career goal): \"my career goal (acting, and, if im being ambitious, being the first \\[my identity\\] celebrity to star in a uhhh idfk horror film).\" the career is not acting but.. yeah.\n\nserious q, does that show that im like not confident in myself - like that i dont think i can get from being an \"actor\" to a \"celeb\" (pretend becoming a celeb is something that u just need like hard work and experience for... like not everyone in that career does it but yeah)??? or like wow so awesome that i have this concrete goal of becoming an \"actor\" but like i also have additional ambitions tacked on\n\nim so sorry if im overthinking this but LOL i wanna present myself in the best light",
  "author": "starshinez05",
  "created": 1634844079,
  "updated": 1634848689,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhj2wtk": {
      "link": "/r/ApplyingToCollege/comments/qcz9q5/is_saying_a_big_goal_is_like_being_ambitious_bad/hhj2wtk/",
      "text": "Why would you say “***if*** I’m being ambitious” one way or the other?\n\n1.) Isn’t any/everyone applying to college “ambitious”?\n\n2.) What happens if it turns out you’re actually NOT all that ambitious?\n\nSimply saying “one day I hope to…” with a sufficiently aspirational yet achievable goal makes the point without looking like you’re hedging your bets.",
      "author": "Strict-Special3607",
      "created": 1634845193,
      "upvotes": 1,
      "replies": {
        "hhj38ta": {
          "link": "/r/ApplyingToCollege/comments/qcz9q5/is_saying_a_big_goal_is_like_being_ambitious_bad/hhj38ta/",
          "text": "thank you so much! lol, i just couldnt put my finger on why it felt weird to me :p but ty!!!!",
          "author": "starshinez05",
          "created": 1634845328,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}