{
  "sid": "q8tje3",
  "link": "/r/ApplyingToCollege/comments/q8tje3/caltech_sports/",
  "title:": "CalTech Sports??",
  "text": "I’m a competitive swimmer and I definitely have the times and ability to swim at CalTech but my grades are lacking. I still have a 103 gpa but I’m not sure if it’s enough. I want to reach out to the coach but does CalTech recruit? And if so, can my athletics make up for my grades?",
  "author": "izzy5108",
  "created": 1634319879,
  "updated": 1634331316,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hgrl40y": {
      "link": "/r/ApplyingToCollege/comments/q8tje3/caltech_sports/hgrl40y/",
      "text": "Please understand CalTech is right around 1,000 total undergraduate students plus another 1,000 graduate students (and change).  \n\nThe class of 2024 was 244 enrolled students.  \n\nhttps://www.admissions.caltech.edu/apply/first-year-freshman-applicants/class-profile  \n\nThey are a Division III school in the Southern California Intercollegiate Athletic Conference  \n\nhttps://en.wikipedia.org/wiki/Southern_California_Intercollegiate_Athletic_Conference  \n\nThere are no athletic scholarships @ CalTech, so the coaching staff don't have much of anything to offer you.  \n\nhttps://www.latimes.com/sports/la-xpm-2012-jul-15-la-sp-plaschke-cal-tech-20120715-story.html  \n\n\n-----  \n\nCalTech likes to win against their rival institutions, but their track record is pretty terrible in all sports - read that LA Times article.  \nCalTech would love to have high-class athletes attend their school.  \n\nBut the savagery of their academics, and the non-negotiable mandate that all student-athletes take full course-loads (there are no dummy courses for athletes at CalTech) kinda makes it hard for athletes to devote as much energy to their sport as they would like.  \n\nRead this article from 2011:  \n\nhttps://www.espn.com/los-angeles/news/story?id=6149755  \n\n> It was the first victory for the Division III Beavers since beating the University of La Verne 48-47 on Jan. 23, 1985, a span of 310 games in Southern California Intercollegiate Athletic Conference play.  \n\n\n-----  \n\nWith respect, if you are competitive-level, serious athlete, and you'd like your sport to help get you through college, CalTech is probably the wrong school for that goal.",
      "author": "VA_Network_Nerd",
      "created": 1634320714,
      "upvotes": 4,
      "replies": {
        "hgrnelf": {
          "link": "/r/ApplyingToCollege/comments/q8tje3/caltech_sports/hgrnelf/",
          "text": "I am a competitive athlete however, in college, I’m focusing more on my education and hope to still swim on the side. I was just wondering if my swimming ability would make up a little for my grades. My grades are almost at the CalTech level and my swimming is above so I’m hoping that it will be enough! I heard that CalTech was looking forward to recruiting more athletes. Thanks sm for the information though!",
          "author": "izzy5108",
          "created": 1634321673,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hgrwuly": {
      "link": "/r/ApplyingToCollege/comments/q8tje3/caltech_sports/hgrwuly/",
      "text": "Just email the coach",
      "author": "MidnightFerret123",
      "created": 1634325583,
      "upvotes": 3,
      "replies": {
        "hgsa24n": {
          "link": "/r/ApplyingToCollege/comments/q8tje3/caltech_sports/hgsa24n/",
          "text": "Exactly. Talk to the coach, if he thinks you're admissible, they'll do a pre-read and you'll get a good idea if they'll admit you.",
          "author": "the3twins",
          "created": 1634331268,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgrjj0l": {
      "link": "/r/ApplyingToCollege/comments/q8tje3/caltech_sports/hgrjj0l/",
      "text": "https://www.gocaltech.com/information/PSAs",
      "author": "elkrange",
      "created": 1634320073,
      "upvotes": 1,
      "replies": {}
    }
  }
}