{
  "sid": "qpl79w",
  "link": "/r/ApplyingToCollege/comments/qpl79w/am_i_screwed/",
  "title:": "Am I screwed?",
  "text": "I’m applying to college and I just realized that four schools have received my free ACT Score report. I planned on going with my SAT Scores and never put much thought into my ACT and only attempted once. Needless to say, the ACT score was horrible but now it is sent to the colleges that i’m applying to. My ACT is listed as official scores and my SAT score is only self reported. Will the college take into account my ACT Scores or just ignore them? Is it far too late to cancel the ACT Scores?",
  "author": "Electrical-Bend9915",
  "created": 1636399936,
  "updated": 1636653844,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjulux0": {
      "link": "/r/ApplyingToCollege/comments/qpl79w/am_i_screwed/hjulux0/",
      "text": "Schools will generally use the highest scores that you send, superscoring within the same test type, if beneficial",
      "author": "RichInPitt",
      "created": 1636404626,
      "upvotes": 3,
      "replies": {}
    },
    "hjuf2xt": {
      "link": "/r/ApplyingToCollege/comments/qpl79w/am_i_screwed/hjuf2xt/",
      "text": "You can’t cancel them but if you haven’t self reported the scores the college isn’t going to look at them",
      "author": "1800needhelpasap",
      "created": 1636401897,
      "upvotes": 1,
      "replies": {}
    },
    "hjuk6y5": {
      "link": "/r/ApplyingToCollege/comments/qpl79w/am_i_screwed/hjuk6y5/",
      "text": "If you applied the college and asked to be consider with your test score, they will consider the official sent ACT score and also your self reported SAT score.. I don’t think that you can ask them to ignore the ACT score that is sent officially unless you change the application to test optional.",
      "author": "poohland",
      "created": 1636403964,
      "upvotes": 1,
      "replies": {
        "hjum03s": {
          "link": "/r/ApplyingToCollege/comments/qpl79w/am_i_screwed/hjum03s/",
          "text": "They will “consider” them in that they will use the highest of what was sent. If ACT scores are all lower than the SAT scores, the ACT scores will be discarded/ignored.",
          "author": "RichInPitt",
          "created": 1636404683,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}