{
  "sid": "q5inoj",
  "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/",
  "title:": "Why Comp Sci",
  "text": "I just got this question in my mind, why do you (comp sci majors) choose comp sci as a major, and a career option? Please write thoroughly if possible, I'm interested in knowing!",
  "author": "Gpanda4267",
  "created": 1633906132,
  "updated": 1634072998,
  "over_18": false,
  "upvotes": 65,
  "upvote_ratio": 0.97,
  "comments": {
    "hg6k4ji": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6k4ji/",
      "text": "As someone who didn't major in comp sci but legitimately loved the classes, maybe I can explain why if I did it over again I'd consider majoring regardless of the money:\n\nThe field of programming has essentially endless potential to improve quality of life. It can increase accessibility, accuracy, response time, you name it in almost any industry or application you can think of. People talk about CS as a sellout major, yet I see it as almost hte opposite because you can still follow your passion -- health care needs programmers; nonprofits need programmers; government needs programmers; pretty much all of science needs programmers -- the possibilities are basically endless in terms of using a CS major to do something sincere and socially beneficial if that's what you're going for. On top of that, it's a huge problem-solving thrill that I just didn't get in other departments' classes, even science classes within my physics major. There's something so satisfying about setting up your code, debugging it, formatting it, and documenting it until it's this flawless, professional product that might even stand the test of time.",
      "author": "thezander8",
      "created": 1633919146,
      "upvotes": 53,
      "replies": {
        "hg71z2q": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg71z2q/",
          "text": "totally agree and second the part about the problem-solving thrill. my cs classes have been the more difficult of my classes, but the satisfaction of having your code pass all of the tests is something no other class comes close to.",
          "author": "maddiesquesadilla",
          "created": 1633929017,
          "upvotes": 7,
          "replies": {}
        },
        "hg9wb0x": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg9wb0x/",
          "text": "Big agree on the problem-solving part! It is soooo satisfying to see everything come together at once. Academically, I probably have other paths I could pursue instead of comp sci and maybe make the same amount of money, but my attachment to comp sci and the satisfaction from making stuff is just too awesome for me to let it go",
          "author": "Flight-Perfect",
          "created": 1633986064,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg5u6xi": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg5u6xi/",
      "text": "High pay, don't need graduate school, low bar to clear in terms of writing ability and \"social intelligence\".\n\nMost people T20-targeting students are hoping to land positions at 3-sigma employers that pay considerably more than everyone else in the industry.",
      "author": "jayphoward",
      "created": 1633906577,
      "upvotes": 69,
      "replies": {
        "hg6cspz": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6cspz/",
          "text": "I’m not the OP, but I am just curious: how would you write what you just said in a college application? I always imagined that colleges want the reasoning behind your major to be something profound and exclusive to you.",
          "author": "LawlessDoctor",
          "created": 1633915534,
          "upvotes": 15,
          "replies": {
            "hg6f2fe": {
              "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6f2fe/",
              "text": "You probably wouldn't want to.  \"I'm not that interested in CS but want to make a lot of money, and also I don't write very well and I'm awkward in social situations,\" isn't a great pitch.",
              "author": "jayphoward",
              "created": 1633916629,
              "upvotes": 53,
              "replies": {}
            },
            "hg7naz6": {
              "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg7naz6/",
              "text": "I wrote passion for problem solving ✨",
              "author": "Aromatic-Opinion-945",
              "created": 1633946707,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "hg78i8z": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg78i8z/",
          "text": "Which schools would you best recommend? Is northeastern good for that?",
          "author": "snaiii",
          "created": 1633933757,
          "upvotes": 5,
          "replies": {
            "hg7zvk1": {
              "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg7zvk1/",
              "text": "Personally I think it's more about the student than the school he or she attends.  What he/she does outside of class, how well he/she is prepared for interviews, etc.",
              "author": "jayphoward",
              "created": 1633955891,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg6qd5y": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6qd5y/",
      "text": "Computer Science is industry-agnostic, with relatively high-compensation.  \n\nThe industry-agnostic part is often more attractive than the compensation aspect.  \n\nA CS degree empowers you to work in pretty much every industry-sector you can name.  \n\nTech Sector? Yup.  \nPharmaceuticals? Yup.  \nGas/Oil/Power? Yup.  \nChemical Processing? Sure.  \nBanking & Finance? Heck yeah.  \nAutomotive? Yep.  \nMilitary Industry? Sure.  \nFarming/Agriculture? Sure thing.  \nTrash/Recycling? Yep.  \n\n\nThis leads to powerful career flexibility.",
      "author": "VA_Network_Nerd",
      "created": 1633922405,
      "upvotes": 19,
      "replies": {
        "hg7pbt3": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg7pbt3/",
          "text": "Yes. This is literally what I said except you used less words, lol",
          "author": "DavidTej",
          "created": 1633948432,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg608mg": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg608mg/",
      "text": "Da cash.\n\nAlso because I may want to go to law school, so I can have a relatively good paying job to pay for it if/when the time comes that I decide to apply.\n\nCS allows to to work freelance (and make a lot of money) while going to law school, or if I decide to stick with CS, then there are also a ton of opportunities there as well. Overall, it’s just a plan for a job that interests me, and is a good paying option.",
      "author": "TakeTheWs",
      "created": 1633909345,
      "upvotes": 16,
      "replies": {}
    },
    "hg5v8yp": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg5v8yp/",
      "text": "$$$$",
      "author": "the_journeyman3",
      "created": 1633907050,
      "upvotes": 15,
      "replies": {
        "hg7vuxk": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg7vuxk/",
          "text": "Surgeons also earn a lot of money",
          "author": "DeliciousWorth798",
          "created": 1633953354,
          "upvotes": 1,
          "replies": {
            "hg82lwc": {
              "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg82lwc/",
              "text": "Surgeons need to stack a $250k medical school education on top of their undergrad to earn those large salaries.  \n\nA good application developer only needs an undergrad, and arguably, they don't even need that.",
              "author": "VA_Network_Nerd",
              "created": 1633957431,
              "upvotes": 6,
              "replies": {}
            },
            "hg9zj5l": {
              "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg9zj5l/",
              "text": "Bro after 4 years of med school and then at least 5 years of residency (and then potentially fellowship afterwards) you’re going to be wishing you picked something easier to support yourself on than surgery\n\nDon’t go to medical school if your primary goal is job security and income unless your family is rich and can get you through without any debt. \n\nEven then it’s not the financial burden it’s the mental and physical burden that’ll do a number on you",
              "author": "MundyyyT",
              "created": 1633987566,
              "upvotes": 3,
              "replies": {}
            },
            "hg8j7ew": {
              "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg8j7ew/",
              "text": "ROI on CS is much better",
              "author": "the_journeyman3",
              "created": 1633965266,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg5tgof": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg5tgof/",
      "text": "https://www.youtube.com/watch?v=m37G-06ibAU&ab\\_channel=CMMDieguez81",
      "author": "freeport_aidan",
      "created": 1633906247,
      "upvotes": 14,
      "replies": {
        "hg5zzda": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg5zzda/",
          "text": "I guessed the video before even playing it 😂\n\nMr Krabs is the best lmao",
          "author": "Berkeley_Simp",
          "created": 1633909223,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hg68cqx": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg68cqx/",
      "text": "Daddy made me 👿",
      "author": "Anarcho-Rag",
      "created": 1633913376,
      "upvotes": 11,
      "replies": {}
    },
    "hg6e5a5": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6e5a5/",
      "text": "I used to like being on the client side of technology but I became too attached to it, especially towards video games like CSGO, R6, Valorant, and more. But I reached an epiphany where I realized that just playing is making me stagnant, but developing makes me learn and grow. So I have coded one video game, now on my second, but I do it to solve things that I want. While my games are not public, I play them by myself or with a few friends, locally. So I want to go to college to further learn how to make games and apps better and work with other students from all different majors to make a large game, system that would satisfy our creative ambitions",
      "author": "AvocadoCool",
      "created": 1633916182,
      "upvotes": 11,
      "replies": {}
    },
    "hg6i85z": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6i85z/",
      "text": "Already wasted most of my life on computers... why not waste more?",
      "author": "randomAccount439",
      "created": 1633918177,
      "upvotes": 10,
      "replies": {
        "hg8qyg6": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg8qyg6/",
          "text": "If I was not broke I would give you an award",
          "author": "Tanyk",
          "created": 1633968530,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg7p9qw": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg7p9qw/",
      "text": "We have this textbook in my programming class that I think explained my favourite thing about computers. It's pretty long tho:\n\nEvery profession has tools that make the job easier to do. Carpenters use hammers, saws, and measuring tapes. Mechanics use wrenches, screwdrivers, and ratchets. Electronics technicians\r  \nuse probes, scopes, and meters. Some tools are unique and can be categorized as belonging to a single profession. For example, surgeons have certain tools that are designed specifically for surgical operations. Those tools probably aren’t used by anyone other than surgeons. There are some tools, however, that are used in several professions. Screwdrivers, for instance, are used by mechanics, carpenters, and many others. \n\nThe computer is a tool used by so many professions that it cannot be easily categorized. It can perform so many different jobs that it is perhaps the most versatile tool ever made. To the accountant, computers balance books, analyze profits and losses, and prepare tax reports. To the factory worker, computers control manufacturing machines and track production. To the mechanic, computers analyze the various systems in an automobile and pinpoint hard-to-find problems. The computer can do such a wide variety of tasks because it can be programmed. It is a machine specifically designed to follow instructions. Because of the  \ncomputer’s programmability, it doesn’t belong to any single profession. Computers are designed to do whatever job their programs, or software, tell them to do. \n\nComputer programmers do a very important job. They create software that transforms computers into the specialized tools of many trades. Without programmers, the users of computers would have no software, and without software, computers would not be able to do anything. \n\nComputer programming is both an art and a science. It is an art because every aspect of a program should be carefully designed. Here are a few of the things that must be designed for any real-world computer program:  \n• The logical flow of the instructions  \n• The mathematical procedures  \n• The layout of the programming statements  \n• The appearance of the screens  \n• The way information is presented to the user  \n• The program’s “user friendliness”  \n• Manuals, help systems, and/or other forms of written documentation",
      "author": "DavidTej",
      "created": 1633948382,
      "upvotes": 5,
      "replies": {}
    },
    "hg5zw62": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg5zw62/",
      "text": "Money",
      "author": "Berkeley_Simp",
      "created": 1633909181,
      "upvotes": 5,
      "replies": {}
    },
    "hg6hsaj": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6hsaj/",
      "text": "Gotta pay the bills",
      "author": "kolune",
      "created": 1633917949,
      "upvotes": 4,
      "replies": {}
    },
    "hg6p5ig": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6p5ig/",
      "text": "I’ve loved coding since I used html (yes ik it’s technically a markup language, calm down)in like 3rd grade. I could go on explaining about my long term infatuation with CS. But to answer your question it just seems like the most logical  path in a field that I already enjoy.",
      "author": "Kidfromwakanda",
      "created": 1633921744,
      "upvotes": 4,
      "replies": {}
    },
    "hg5y3hs": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg5y3hs/",
      "text": "I've personally been into computer science basically since I've had computers, so it was a natural progression to me",
      "author": "MunixEclipse",
      "created": 1633908347,
      "upvotes": 3,
      "replies": {}
    },
    "hg77sh2": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg77sh2/",
      "text": "I’m surprised (but not really) by the amount of $$$ responses. I want it because it’s what I’m good at and what I love. I stared coding through scratch almost a decade ago now (oof) and never looked back. I have no clue what specialization/focus I want in it, but I want to make something that does something.",
      "author": "MTsterfri",
      "created": 1633933214,
      "upvotes": 2,
      "replies": {}
    },
    "hg7l8x5": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg7l8x5/",
      "text": "Its fun! I love making games on the LOVE engine and I would like to learn more advanced programming techniques in college.",
      "author": "ulikejazzzz",
      "created": 1633944886,
      "upvotes": 2,
      "replies": {}
    },
    "hg9k1b6": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg9k1b6/",
      "text": "I wanna work with bioinformatics for bioengineering in the future. Basically my grandparents have degenerative diseases and I wanna do research on these fields to help develop treatments\n\nEdit: Also if grad school/research don't work out I'll still have a valuable degree for the job market",
      "author": "terpomojj",
      "created": 1633980638,
      "upvotes": 2,
      "replies": {}
    },
    "hg5v4j2": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg5v4j2/",
      "text": "most people: good career outlook\n\nme: loved CS courses in high school and actually interested in the topic",
      "author": "idkname999",
      "created": 1633906997,
      "upvotes": -13,
      "replies": {
        "hg63igp": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg63igp/",
          "text": "Ah so ur not like the other girls 😬",
          "author": "-lufepoh-",
          "created": 1633910950,
          "upvotes": 32,
          "replies": {}
        },
        "hg6b05i": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6b05i/",
          "text": "why downvoted?",
          "author": "SnooChipmunks1902",
          "created": 1633914683,
          "upvotes": 3,
          "replies": {
            "hg6b9gc": {
              "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6b9gc/",
              "text": "I would guess that I unintentionally sounded condescending with that comment lol.\n\nOops.",
              "author": "idkname999",
              "created": 1633914814,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "hg71o7c": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg71o7c/",
          "text": "Downvotes are all those who are getting into CS just for the $$$",
          "author": "Rocky7886",
          "created": 1633928816,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hg6yg0n": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg6yg0n/",
      "text": "Honestly, I love computers, and have always had a \"talent\" for fixing and trouble shooting them. \n\nAs a career, I want to continue fixing computers and help protect them (something like cyber security meets IT technician/specialist I guess)  \n\nFrom what I understand, computer science is the way to go since apparently doing a cyber security or computer engineering degree isn't as competitive in the job market. \n\nI'm also into business and I was considering a management information systems major at one point, but quite a few people suggested that I not. 🤷",
      "author": "AccelerDragon",
      "created": 1633926835,
      "upvotes": 1,
      "replies": {
        "hga55c5": {
          "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hga55c5/",
          "text": "Demand for cyber's going up my dude",
          "author": "-lufepoh-",
          "created": 1633990220,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg71w7g": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg71w7g/",
      "text": "It was genuinely one of the only subjects I enjoyed at school. It’s so fun, especially when u can actually get ur code to work. It’s just fun. I’ll have fun as long as it’s something coding",
      "author": "tsunakas",
      "created": 1633928964,
      "upvotes": 1,
      "replies": {}
    },
    "hg7y50n": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg7y50n/",
      "text": "💰",
      "author": "nftr35",
      "created": 1633954841,
      "upvotes": 1,
      "replies": {}
    },
    "hg8qt99": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg8qt99/",
      "text": "Okay this might sound like the BS most people include in their college essays but I have just always been a nerd. Started making robots in the 7th grade, that got me into coding. Something about my code coming to life in the form of the robots I worked on fascinated me more than anything. That led to the development of multiple apps and now I can't see myself doing anything else.",
      "author": "Tanyk",
      "created": 1633968469,
      "upvotes": 1,
      "replies": {}
    },
    "hg8yrg4": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg8yrg4/",
      "text": "It’s all about the money money money",
      "author": "Huxitige",
      "created": 1633971744,
      "upvotes": 1,
      "replies": {}
    },
    "hg9cs1e": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg9cs1e/",
      "text": "i like the feeling when my program works after hours of debugging",
      "author": "lytrii",
      "created": 1633977534,
      "upvotes": 1,
      "replies": {}
    },
    "hg9ne32": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg9ne32/",
      "text": "I just like programming because it's like solving puzzles with a definite goal and yet endless ways to solve it",
      "author": "TheSnazzyBoi",
      "created": 1633982104,
      "upvotes": 1,
      "replies": {}
    },
    "hg9r40f": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg9r40f/",
      "text": "I know this isn’t very thorough, but it’s super fun and I couldn’t see myself doing anything else",
      "author": "kohinoor0607",
      "created": 1633983747,
      "upvotes": 1,
      "replies": {}
    },
    "hg9zr4d": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg9zr4d/",
      "text": "Job income and security. I don’t have a burning passion for it, nor do I want to.",
      "author": "MundyyyT",
      "created": 1633987670,
      "upvotes": 1,
      "replies": {}
    },
    "hgaq45k": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hgaq45k/",
      "text": "I'm thinking about being a computer sci as a pre med. So if Medical School doesn't work at least I have something else to fall upon on.",
      "author": "MoistWoodpecker9",
      "created": 1634000409,
      "upvotes": 1,
      "replies": {}
    },
    "hg9k1n7": {
      "link": "/r/ApplyingToCollege/comments/q5inoj/why_comp_sci/hg9k1n7/",
      "text": "$$$$$$$$$$$$$$$$$$$\n\nYes, literally. Don't buy the bullshit about passion and all that boring nonsense. Passion helps, but I swear this degree and career path is the only that is gatekept so hard where people make it sound like if you aren't passionate, you can't (or shouldn't) get a job. Nobody ever claims you need to be passionate about consulting. Nobody ever claims you need to be passionate about banking/finance. And the idea that being passionate at something makes you better at it than someone who isn't passionate is bunk. If you find it miserable, don't do it because you'll burn out, but choosing to do it for the money and not having a super-innate passion is just fine. That's the type of jobs *most people* do lol",
      "author": "doneanddead",
      "created": 1633980642,
      "upvotes": 0,
      "replies": {}
    }
  }
}