{
  "sid": "q45837",
  "link": "/r/ApplyingToCollege/comments/q45837/i_need_help_with_the_most_simply_questions/",
  "title:": "I need help with the most simply questions",
  "text": "So I was applying to a university, I am planning on transferring by fall 2022. \n\nThe application asks what degree I am planning to get from the community college (I think it’s asking for the community college degree) but when I see the options for the associates I don’t see the one I’m looking for, the one I need is under Bachelors. But there also another option that just says Diploma, should I pick diploma? \n\nAnother question I have is, the application asks when I start my first semester at the community college, I started in fall 2019 but failed all my classes, so I restarted in spring 2020 and passed, should I put fall or spring on the application (even though I failed fall)?\n\nAlso idk if this one will be properly answered but how do I see my transcript because my portal won’t load to show me my transcript. \n\nThanks",
  "author": "Rabbitboi69",
  "created": 1633722209,
  "updated": 1634074443,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hfwcplx": {
      "link": "/r/ApplyingToCollege/comments/q45837/i_need_help_with_the_most_simply_questions/hfwcplx/",
      "text": "Degree choice would be at college you are transferring to, usually. \n\nFall 2019 since you are required to send college transcript of all classes. \n\nYou should be able to request an unofficial transcript for your personal records.",
      "author": "roguezebra",
      "created": 1633725305,
      "upvotes": 1,
      "replies": {
        "hfwcv5a": {
          "link": "/r/ApplyingToCollege/comments/q45837/i_need_help_with_the_most_simply_questions/hfwcv5a/",
          "text": "Ok got it… thank You so much",
          "author": "Rabbitboi69",
          "created": 1633725369,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}