{
  "sid": "q46j6s",
  "link": "/r/ApplyingToCollege/comments/q46j6s/after_submitting_common_app/",
  "title:": "After Submitting Common App",
  "text": "Once you Submit common app to apply, when do you typically hear from the school. What is the process? Do they email you days later with additional information needed i.e. test scores, or do you just hear back when a decision is made?",
  "author": "Bg1856",
  "created": 1633726217,
  "updated": 1634074271,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hfwq8as": {
      "link": "/r/ApplyingToCollege/comments/q46j6s/after_submitting_common_app/hfwq8as/",
      "text": "The others described the portal login process. It is your responsibility to check the portal to make sure everything (like test scores) gets received. The portal will tell you whether the school has it.\n\nFor test scores specifically, check the college's website to see what score reporting methods it accepts. Many colleges now accept scores self-reported in the app or portal, for free, to be followed by an official report only if you later enroll. Other colleges still require an official score report prior to admission, and it's on you to order that.\n\nDo not expect an email telling you that you have missing documents. That email might never come.",
      "author": "elkrange",
      "created": 1633731095,
      "upvotes": 5,
      "replies": {}
    },
    "hfwg3rs": {
      "link": "/r/ApplyingToCollege/comments/q46j6s/after_submitting_common_app/hfwg3rs/",
      "text": "Allow 2-5 business days for an email and portal link.",
      "author": "Strict-Special3607",
      "created": 1633726724,
      "upvotes": 2,
      "replies": {}
    },
    "hfwg6vm": {
      "link": "/r/ApplyingToCollege/comments/q46j6s/after_submitting_common_app/hfwg6vm/",
      "text": "Varies by college, but in general, you get an email within a couple if days with login instructions for their portal where any updates are usually posted.",
      "author": "skieurope12",
      "created": 1633726762,
      "upvotes": 2,
      "replies": {}
    }
  }
}