{
  "sid": "qcdndy",
  "link": "/r/ApplyingToCollege/comments/qcdndy/is_a_project_car_a_good_project_for_the_mit_maker/",
  "title:": "Is a project car a good project for the MIT Maker Portfolio?",
  "text": "Hey yall! Was planning on applying to MIT, and saw they had a portfolio option for projects that may not fit elsewhere in the application. This past summer, I bought my first car which served double duty as a project car. It initially was infested and didn't run, but now serves as my daily driver (and is even manual swapped) with all labor done myself. From what I've seen of example portfolios, most people's projects are something they've built or created or coded themselves. While sure, I did rebuild the car and do all the research myself, it was based on 20 years worth of forums, service manuals etc. that other people have made. So would MIT really care since all I really show there is that I know how to read?\n\nThis extends to some other projects that I have done, such as replica Nanoleaf panels. I did all the labor of designing, 3d printing, finishing, Soldering, and coding them (mind you the finished product is massive) , but other people were the ones who made the STL file temples, the arduino code, etc. Hell, even the idea of light up panels is just a Nanoleaf clone.\n\nIf anyone here could give advice on it I'd really appreciate it. Hell, even if someone could just say if it would do better for my application if I DIDN'T submit it in case it would end up being harmful, I'd love to hear it! Thank you all in advance!",
  "author": "darkherobrine21",
  "created": 1634771598,
  "updated": 1634848781,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhgciv4": {
      "link": "/r/ApplyingToCollege/comments/qcdndy/is_a_project_car_a_good_project_for_the_mit_maker/hhgciv4/",
      "text": "yeah. the car and the nanoleaf panels are definitely both worth submitting. at the very least nothing bad would happen if you submitted them",
      "author": "Saturnly",
      "created": 1634789838,
      "upvotes": 1,
      "replies": {}
    }
  }
}