{
  "sid": "qrl9wo",
  "link": "/r/ApplyingToCollege/comments/qrl9wo/top_public_schools/",
  "title:": "Top Public schools",
  "text": "Is there abbreviation for big name state colleges like HYPSM?\nI mean big name state colleges",
  "author": "Lost_Umpire",
  "created": 1636637169,
  "updated": 1636652746,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk78lm2": {
      "link": "/r/ApplyingToCollege/comments/qrl9wo/top_public_schools/hk78lm2/",
      "text": "UCLAUCBUMUVAUNC\n\nPronounced ookla ookboo moova oonk",
      "author": "Strict-Special3607",
      "created": 1636638014,
      "upvotes": 20,
      "replies": {}
    },
    "hk79q0k": {
      "link": "/r/ApplyingToCollege/comments/qrl9wo/top_public_schools/hk79q0k/",
      "text": "Can't you just lump them all together and say \"Good Schools\"?",
      "author": "VA_Network_Nerd",
      "created": 1636638570,
      "upvotes": 1,
      "replies": {}
    },
    "hk7jqvj": {
      "link": "/r/ApplyingToCollege/comments/qrl9wo/top_public_schools/hk7jqvj/",
      "text": "PSA, public universities tend to offer little to no need-based financial aid to out-of-state students and charge them more. There are a few exceptions (UM, UNC, UVA).  Domestic applicants should run the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based financial aid estimate before you apply.",
      "author": "elkrange",
      "created": 1636643219,
      "upvotes": 1,
      "replies": {
        "hk7k9yb": {
          "link": "/r/ApplyingToCollege/comments/qrl9wo/top_public_schools/hk7k9yb/",
          "text": "Many of them give out decent merit aids I thought?",
          "author": "Lost_Umpire",
          "created": 1636643452,
          "upvotes": 1,
          "replies": {
            "hk7oapi": {
              "link": "/r/ApplyingToCollege/comments/qrl9wo/top_public_schools/hk7oapi/",
              "text": "Which schools are you thinking of? Your title mentions \"top\" publics. The purpose of merit scholarships is to attract good students to a school who would otherwise attend elsewhere. Top schools do not need to offer merit to attract good students.\n\nIf you want big merit at public universities, you need to look lower down in ranking. \n\nHere's a copy and paste. Some general thoughts on paying for college:\r  \nPublic universities tend to offer little to no need-based financial aid to out-of-state students and charge them more.\r  \nSome public universities offer large merit scholarships to out-of-state students.\r  \nSome private universities offer generous need-based financial aid; privates do not differentiate between in-state and out-of-state.\r  \nFirst see whether you are eligible for any need-based financial aid. Run the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. (Sometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions.) Federal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. Larger loans require a parent signature and are usually not reasonable amounts to borrow.\r  \nIf the need-based estimate does not make the college affordable for your family, then look for merit scholarships. Often, the best merit scholarships are offered by the colleges themselves. Look for colleges that offer competitive merit scholarships according to their websites, where your scores and grades are over the 75th percentile for that college.\r  \nAlso look for colleges that offer big automatic merit scholarships to out-of-state students for your level of stats. Usually there will be a chart on their website with the levels of stats and scholarship amounts. Example: https://scholarships.ua.edu/freshman/out-of-state/; see also UAH, U Maine, U Kentucky, U Mississippi, U Arizona, Arizona State, Wyoming, UTD, etc. Then compare the scholarship amount to the out-of-state cost of attendance to see whether the scholarship would make the college affordable for your family.",
              "author": "elkrange",
              "created": 1636645212,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}