{
  "sid": "qw3te7",
  "link": "/r/ApplyingToCollege/comments/qw3te7/i_just_missed_some_events_of_colleges_what_now/",
  "title:": "i just missed some events of colleges, what now ?",
  "text": "ok, yeah I am lazy and couldn't attend them as they are mostly between 2 A.M -4 A.M here \n\nhence I missed events of colleges that say in their CDS that the level of applicant's interest is 'CONSIDERED', but I open their all e-mails and also fill any extra forms they ask generally to receive extra emails from them \n\npleassseee any admission officer or expert can advise if those events are going to hamper my chance \\[I am so worried right now\\] !! \\[for context the colleges are: Dartmouth, duke, brown, rice university\\] \\[welp\\] \n\nand what can I do now, any advice plzzz",
  "author": "naruto_-namikaze",
  "created": 1637168717,
  "updated": 1637373461,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hl0bect": {
      "link": "/r/ApplyingToCollege/comments/qw3te7/i_just_missed_some_events_of_colleges_what_now/hl0bect/",
      "text": "Don't worry, you'll be fine... But try signing up for a future event and attend that one.",
      "author": "prsehgal",
      "created": 1637168818,
      "upvotes": 6,
      "replies": {
        "hl0bosk": {
          "link": "/r/ApplyingToCollege/comments/qw3te7/i_just_missed_some_events_of_colleges_what_now/hl0bosk/",
          "text": "yes for sure !!! but will those events be counted against me or they don't hold not significant weight \n\nalso thanks a lot sir for help !!",
          "author": "naruto_-namikaze",
          "created": 1637168931,
          "upvotes": 1,
          "replies": {
            "hl0c4k5": {
              "link": "/r/ApplyingToCollege/comments/qw3te7/i_just_missed_some_events_of_colleges_what_now/hl0c4k5/",
              "text": "Don't worry, they won't be counted against you.",
              "author": "prsehgal",
              "created": 1637169102,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hl0rpsp": {
      "link": "/r/ApplyingToCollege/comments/qw3te7/i_just_missed_some_events_of_colleges_what_now/hl0rpsp/",
      "text": "dependent on the events",
      "author": "NYUHuey",
      "created": 1637175151,
      "upvotes": 1,
      "replies": {}
    },
    "hl15a81": {
      "link": "/r/ApplyingToCollege/comments/qw3te7/i_just_missed_some_events_of_colleges_what_now/hl15a81/",
      "text": "rice university takes demonstrated interest very seriously. so though it may not harm you significantly, attending those events could greatly help if ur application is borderline",
      "author": "Rakhca",
      "created": 1637180562,
      "upvotes": 1,
      "replies": {}
    },
    "hl1e52z": {
      "link": "/r/ApplyingToCollege/comments/qw3te7/i_just_missed_some_events_of_colleges_what_now/hl1e52z/",
      "text": "Brown does not track demonstrated interest",
      "author": "RightWhereY0uLeftMe",
      "created": 1637184167,
      "upvotes": 1,
      "replies": {}
    },
    "hl9iaig": {
      "link": "/r/ApplyingToCollege/comments/qw3te7/i_just_missed_some_events_of_colleges_what_now/hl9iaig/",
      "text": "Just a side note, I wouldn’t rely heavily on the markings on the CDS, as they can be a little misleading. A number of schools mark that they consider demonstrated interest when what they really mean is they consider your answer to their “Why us” essay. For instance, from the Duke admissions FAQ page:\n\n>\t“Demonstrated interest” as most people use the term is not a plus factor in our process.  Students don’t need to visit the campus, and we discourage students from contacting the Admissions Office in order to demonstrate their interest in us. There is no benefit to emailing or meeting your regional admissions officer.\n>\n>\tWhat we do recommend is that students take the time to explore what Duke has to offer them in light of their hopes and expectations for college, and to think carefully about why there may be a good match between them and us. That will allow them to write a thoughtful and detailed answer to our essay on this subject. Our experience is that students who have fully investigated Duke, whether virtually or in person, are better able to articulate why Duke is a good match for them. We do our best to make enough information about Duke available to everybody.\n>\n>\tIf you want a term to use what we look for, you could say that applicants should be able to communicate their “demonstrated knowledge” through their application rather than their “demonstrated interest” through the number of times they have visited, met, or contacted us.",
      "author": "apad201",
      "created": 1637335496,
      "upvotes": 1,
      "replies": {}
    }
  }
}