{
  "sid": "qhvu43",
  "link": "/r/ApplyingToCollege/comments/qhvu43/wishing_i_tried_for_harder_schools/",
  "title:": "Wishing I tried for harder schools",
  "text": "This is kinda stupid but as of right I’ve applied to 11 schools (i had a fee waiver so it didn’t break the bank), and as of today i’ve been accepted into 8 of those schools. I have not currently been rejected, i’m waiting for the last three decisions.\n\nNow this is where it gets kinda stupid, with only three schools left, I’m kinda wishing I would have gone for some more reach schools. Even if they were just harder to get into state schools, I feel like I didn’t really go out of the zone of safety schools. I still could of course apply to these schools, but all things considered I’m simply not prepared to do so and the competitive season for my sport is coming up (which is why I tried doing all my apps so early, I didn’t want to be overwhelmed), so I don’t think I would have time to anyway.\n\nIf the schools I had picked had been harder to get into I think I would have been fine. I’m not ungrateful for the success I’ve had so far I just feel like I didn’t try as hard as I could…",
  "author": "-_-sins-_-",
  "created": 1635452915,
  "updated": 1636166946,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hifkkgq": {
      "link": "/r/ApplyingToCollege/comments/qhvu43/wishing_i_tried_for_harder_schools/hifkkgq/",
      "text": "Then apply to more... its only October",
      "author": "ssssseabass",
      "created": 1635455822,
      "upvotes": 39,
      "replies": {}
    },
    "hifksyd": {
      "link": "/r/ApplyingToCollege/comments/qhvu43/wishing_i_tried_for_harder_schools/hifksyd/",
      "text": "Just pick one hard reach school then and apply now. Chances are, you already have most of what you need except for completing some supplemental essays. Write those this weekend and complete and submit the application next weekend. One school is doable and then you can stop asking yourself “what if.”",
      "author": "cmac6767",
      "created": 1635455919,
      "upvotes": 11,
      "replies": {}
    },
    "hifkxmn": {
      "link": "/r/ApplyingToCollege/comments/qhvu43/wishing_i_tried_for_harder_schools/hifkxmn/",
      "text": "Unless one is ED you don’t have to accept any until May. Just apply to some more - you have plenty of time and no pressure . Ideal!",
      "author": "WorriedTurnip6458",
      "created": 1635455973,
      "upvotes": 2,
      "replies": {}
    },
    "hifl6h0": {
      "link": "/r/ApplyingToCollege/comments/qhvu43/wishing_i_tried_for_harder_schools/hifl6h0/",
      "text": "What others have said. If you have no time for EA work, You've still got plenty of time to try out an RD app.",
      "author": "LadyMjolnir",
      "created": 1635456075,
      "upvotes": 2,
      "replies": {}
    },
    "hifvlyb": {
      "link": "/r/ApplyingToCollege/comments/qhvu43/wishing_i_tried_for_harder_schools/hifvlyb/",
      "text": "Apply RD for a couple of reach schools. It shouldn't be that hard. If you need help reach out. I've got time.",
      "author": "stories_as_models",
      "created": 1635460668,
      "upvotes": 1,
      "replies": {}
    }
  }
}