{
  "sid": "qusuei",
  "link": "/r/ApplyingToCollege/comments/qusuei/how_to_and_what_might_i_need_to_know_and_look_for/",
  "title:": "How to, and what might I need to know and look for when starting application process for college, loans or grants?",
  "text": "Posting this instead of surfing the internet for answers because I legitimately know nothing about this process whatsoever so I have no idea where I’d even start. And there’s no one in my family or close friends that went that could give me advice.\n\nThe process feels rather large and intimidating, probably due to my lack of knowledge on the subject. So I felt having direct explanations person to person on the matter might help me be more at ease and procrastinate less.\n\nMust you apply and be accepted to colleges first in order to apply for loans? \n\nDo you deal with them separately or does the college deal directly with the loaner for you when an agreement is struck? \n\nCan college loans cover living expenses as well, and if so is there particular way or thing I need to do to get them to do so?\n\nAre grants worth looking into? I kind of assumed the probability of getting a grant was very low, or else everyone would do it instead of loans.\n\nWill the value of loans achievable be dependent on my credit or the cost of the subject I choose to study, or both?\n\nShould I try and be selective about colleges to apply for? Like are community colleges or at home programs worth settling for? Will having a GED instead of a high school diploma effect the possibility of acceptance to colleges, and if so how broad an effect should I be prepared for?\n\nI have more questions but this is a start. Any and all info, wisdom and advice on the experience from someone who has been through it would be greatly greatly appreciated. I don’t come from money, quite the opposite often struggling. College was something I sort of sub/semi-consciously accepted at a young age wouldn’t be possible for me but now I’d at least like to try.\n\n\nEdit: It just occurred to me that another main question I should ask is, what should I NOT do and what should I avoid during the process? Wherever there is money involved there are people or establishments with intent to capitalize and take advantage.",
  "author": "CartooNetworKid",
  "created": 1637016995,
  "updated": 1637179706,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hksgkzy": {
      "link": "/r/ApplyingToCollege/comments/qusuei/how_to_and_what_might_i_need_to_know_and_look_for/hksgkzy/",
      "text": "You have a lot of questions. Try the wiki at the top of the subreddit for basic college admissions info, try the search bar at the top of the subreddit, and try googling your questions to see what else you can find.\n\nSome general thoughts on paying for college:\r  \n\r  \nFirst see whether you are eligible for any need-based financial aid. Run the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. (Sometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions.) \n\nFederal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. Larger loans require a parent signature, go against parent credit, involve interest accrual and repayment during college, and are usually not reasonable amounts to borrow.\r  \nIf the *need-based* estimate does not make the college affordable for your family, then look for *merit scholarships*. ***Often, the best merit scholarships are offered by the colleges themselves.*** Look for colleges that offer competitive merit scholarships according to their websites, where your scores and grades are over the 75th percentile for that college.\r  \nAlso look for colleges that offer big automatic merit scholarships to out-of-state students for your level of stats. Usually there will be a chart on their website with the levels of stats and scholarship amounts. Example: https://scholarships.ua.edu/freshman/out-of-state/; see also UAH, U Maine, U Kentucky, U Mississippi, U Arizona, Arizona State, Wyoming, UTD, etc. Then compare the scholarship amount to the out-of-state cost of attendance to see whether the scholarship would make the college affordable for your family.",
      "author": "elkrange",
      "created": 1637022356,
      "upvotes": 1,
      "replies": {}
    }
  }
}