{
  "sid": "qaoloc",
  "link": "/r/ApplyingToCollege/comments/qaoloc/i_have_no_idea_what_to_write_about_for_my_essay/",
  "title:": "i have no idea what to write about for my essay",
  "text": "i am so frustrated and lost lol. i was going to write a story about my mental health bc it’s a big part of who i am (i’ve been dealing with it for five years). but i do not want to write a sob story and i don’t want admissions officers to take pity. i haven’t really had any interests bc i was depressed lol so i’m just very stuck at the moment. i’m also a very bad writer and it’s hard for me to put my thoughts into words. what are some good questions to ask yourself to brainstorm? also just any advice would be greatly appreciated",
  "author": "ahaaahaaaa",
  "created": 1634569770,
  "updated": 1634653323,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh4cuqy": {
      "link": "/r/ApplyingToCollege/comments/qaoloc/i_have_no_idea_what_to_write_about_for_my_essay/hh4cuqy/",
      "text": "Look at college guy's website, he has a bunch of brainstorming exercises/ideas. Mostly centered around values/interests. You want to show yourself in the best possible light so I'd suggest focusing on a value you have and showing it.\n\nEveryone has interests! You could even talk about music/games/shows u like and connect it back to yourself. Maybe take a walk and take note of things in nature?\n\nI'd personally avoid talking about mental health in the essay because  \n1. It's a common topic  \n2. It makes you seem like a liability esp. if you haven't 'dealt with it'",
      "author": "JunoIsMyLove",
      "created": 1634572281,
      "upvotes": 2,
      "replies": {
        "hh6axgz": {
          "link": "/r/ApplyingToCollege/comments/qaoloc/i_have_no_idea_what_to_write_about_for_my_essay/hh6axgz/",
          "text": "thank you so much! is the website collegeessayguy. com ?",
          "author": "ahaaahaaaa",
          "created": 1634603072,
          "upvotes": 1,
          "replies": {
            "hh6ba1h": {
              "link": "/r/ApplyingToCollege/comments/qaoloc/i_have_no_idea_what_to_write_about_for_my_essay/hh6ba1h/",
              "text": "Yes",
              "author": "JunoIsMyLove",
              "created": 1634603245,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}