{
  "sid": "qg1w1l",
  "link": "/r/ApplyingToCollege/comments/qg1w1l/how_to_get_into_top_universities_ex_ivies_even/",
  "title:": "How to get into top universities (Ex: Ivies) even though I have a low gpa and already enrolled in another university (not community)",
  "text": "Ok so Ill post this in r/ApplyingToCollege and r/CollegeTransfer subreddits, but also thought that it kinda extends beyond the topic of these subreddits thats why I posted it in r/college too.\n\nFinished 2021 with A-levels^(1) (phy and chem Cs and math D; very bad) and my transcript from grade 9 all the way to grade 12 (A levels) are filled with Bs, Cs and Ds (one or two subjects with As), but right after getting these grades I want to attend the top universities like the Ivies. Ive already applied to a uni in Canada with these grades and got accepted at that uni for Jan 2022, ranked \\~300th globally so its a pretty ok uni.\n\nMy school is kinda broke so it doesnt offer tests (like SAT, APs etc.) and extracurriculars. But this is not going to stop me. Now I came up with a plan to pave my way onto being eligible for the top unis. I plan to retake my exams (A levels) and take the tests (SAT, APs, IBs) during my year at the Canadian uni. I also plan on doing some ECs during my time at uni (skiing, student leader opportunities at the Canadian uni, internships etc.) (also please let me know some of the ECs I can pursue while at uni). With these in mind, Ill try to score excellent marks in these while I'm at the Canadian uni so I can finish all of these tests, exams and ECs by mid of 2nd year at the Canadian uni (given that I work rigorously and effectively to get all this done by mid 2nd year). After all this, I can use these qualifications to transfer to the top unis through credit transfer, basically transfer student at the end of 2nd year.\n\nI want to hear your thoughts on this and point out any faults in it, like my time management between these qualifications and the workload of the uni, or is it even possible to get into these top unis through the path I plan on taking. Oh and I'm okay with attending these top unis, I don't have any social, cultural or racial issues with these top unis. I want to get into these unis to pursue my future goals. Thanks\n\n^(1) A-levels are subject-based qualifications, where the exams take place at the end of grade 12.",
  "author": "pearslash",
  "created": 1635236990,
  "updated": 1635301727,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hi47ht6": {
      "link": "/r/ApplyingToCollege/comments/qg1w1l/how_to_get_into_top_universities_ex_ivies_even/hi47ht6/",
      "text": "I would recommend focusing more on your college GPA than on retaking high school tests. As a transfer student how you do in college is what really matters. Frankly trying to transfer into top tier US schools as an international transfer applicant is an uphill battle, but you are certainly welcome to try. I would just recommend also applying to some Canadian universities if you just want to leave your current school for a better one.\n\nTl;dr: Focus on your college GPA above all. Do ECs that you’re interested in or help your career. But don’t just take high school tests over again, especially since you’re now in college so you’re just taking regular classes for college credit.",
      "author": "WanderingMage03",
      "created": 1635257684,
      "upvotes": 3,
      "replies": {}
    },
    "hi3r3r1": {
      "link": "/r/ApplyingToCollege/comments/qg1w1l/how_to_get_into_top_universities_ex_ivies_even/hi3r3r1/",
      "text": "> my transcript from grade 9 all the way to grade 12 (A levels) are filled with Bs, Cs and Ds (one or two subjects with As)  \n\nHarsh reality: Those grades are not the kinds of things top-tier schools are looking for.  \n\nTop-Tier universities all have one thing in common: Aggressive academic rigor that really push students to learn deeply and meaningfully.  \n\nYou need an academic track-record that indicates you are capable of taking advanced coursework and succeeding in it.  \n\nIf Brown were to do you a favor and accept you as a transfer-admit, you'd probably just flunk out.  \n\nI don't mean any of that as a personal attack, and I apologize for the bluntness of my feedback.  \n\n> I plan to retake my exams (A levels) and take the tests (SAT, APs, IBs) during my year at the Canadian uni.  \n\nI didn't think you could retake your A-levels after High School Graduation, and I know you can't take the AP/IB tests after graduation.  \n\nYou can take CLEP tests, but I don't think that will boost your attractiveness to top-tier schools.  \n\n\n> I also plan on doing some ECs during my time at uni (skiing, student leader opportunities at the Canadian uni, internships etc.) (also please let me know some of the ECs I can pursue while at uni).  \n\nThe best and most attractive EC activities are the ones you are excited to pursue to help you achieve a personal goal, usually career-oriented.  \n\nMost ECs that people do that they believe will look good on an application look like you did them so they will look good on an application.  \n\n\n> I want to hear your thoughts on this and point out any faults in it  \n\nI think you should spend some time identifying what your goals are and asking how your current university can best help you access them.  \n\nYou may be able to transfer into a better school, but you are not likely going to be able to transfer into a top-tier/elite university.  \nYour academic transcript is the bigger problem than your lack of ECs.",
      "author": "VA_Network_Nerd",
      "created": 1635249508,
      "upvotes": 2,
      "replies": {}
    }
  }
}