{
  "sid": "r304r8",
  "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/",
  "title:": "feeling very behind",
  "text": "where is everyone right now with applications? it feels like everyone i know and their dog has submitted at least one so far. meanwhile i’m still struggling with my common app essay and only have 1 supplement done. is it better to submit way before the regular deadline or does it not matter? \n\non the upside i have all my letters of rec in and fafsa/css are done. i’m hating myself because everything is done except for those darn essays :(\n\ni’m not a good writer and end up scrapping every draft",
  "author": "throwawaycap222",
  "created": 1637970904,
  "updated": 1638205629,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hm7zsvj": {
      "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm7zsvj/",
      "text": "It feels like everyone has submitted ED applications because the people who post during ED season are people sending ED applications.\n\nFrom recent traffic, you might infer that every student in the world is apply to UC schools.  A month ago, they were barely mentioned.\n\nIn about a month you'll be hearing from many, many students applying RD.",
      "author": "RichInPitt",
      "created": 1637976325,
      "upvotes": 10,
      "replies": {}
    },
    "hm7q7lr": {
      "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm7q7lr/",
      "text": "Most people won’t submit RD applications until they have heard back from their REA or ED schools. A lot of these schools notify applicants in mid December. So for a lot of people, they won’t submit applications for another month.",
      "author": "anonymous121356",
      "created": 1637971468,
      "upvotes": 9,
      "replies": {}
    },
    "hm888ez": {
      "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm888ez/",
      "text": "just started uc apps yesterday lmao, and havent touched common app :)",
      "author": "apushnig",
      "created": 1637980577,
      "upvotes": 3,
      "replies": {}
    },
    "hm7q4kv": {
      "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm7q4kv/",
      "text": "It looks better if you submitted early. But since you haven’t finished your essays yet, I would personally wait until they’re all perfect. A rushed application wouldn’t look so great",
      "author": "Top-Cryptographer-81",
      "created": 1637971427,
      "upvotes": 1,
      "replies": {
        "hm7qtjf": {
          "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm7qtjf/",
          "text": "damn i thought schools dont start looking through the RD pile until after deadlines pass :(",
          "author": "throwawaycap222",
          "created": 1637971767,
          "upvotes": 1,
          "replies": {
            "hm7s8ls": {
              "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm7s8ls/",
              "text": "they could but they’re probably working on the early applications rn.",
              "author": "Top-Cryptographer-81",
              "created": 1637972482,
              "upvotes": 1,
              "replies": {
                "hm7wjmv": {
                  "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm7wjmv/",
                  "text": "Submitting early action is the only benefit of submitting early. After EA, submitting your RD earlier or later makes no difference (as that would be rolling admissions which most schools are not) So if you submit today vs jan 1st for an RD application it makes no difference",
                  "author": "Dry-Comfortable-2042",
                  "created": 1637974674,
                  "upvotes": 5,
                  "replies": {
                    "hm7yc5a": {
                      "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm7yc5a/",
                      "text": "certain colleges have scholarship consideration or certain program deadlines. But in general yeah",
                      "author": "Top-Cryptographer-81",
                      "created": 1637975579,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hm7xwa6": {
      "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm7xwa6/",
      "text": "I am also not done so you shouldn't feel too bad. I also only have my common app essay left. The RD deadlines are still a bit off so I wouldn't think it matters unless you were going for EA/EDII. \n\nIf you are struggling a lot with your essays, I would suggest doing an introspection sheet or looking back at your past drafts and trying to pick apart what you like and how it feeds into what you ultimate want your essay to say about you!",
      "author": "jokiii_",
      "created": 1637975355,
      "upvotes": 1,
      "replies": {}
    },
    "hm8qtvs": {
      "link": "/r/ApplyingToCollege/comments/r304r8/feeling_very_behind/hm8qtvs/",
      "text": "Yo I don’t even have my letters of rec/fasfa let alone common app essay 😂 I’m currently focusing on my UCs and then I will grind common app. You shouldn’t be worrying ur fine",
      "author": "i_have_negativekarma",
      "created": 1637990777,
      "upvotes": 1,
      "replies": {}
    }
  }
}