{
  "sid": "qfqmsn",
  "link": "/r/ApplyingToCollege/comments/qfqmsn/i_have_no_idea_what_im_doing_and_i_dont_know/",
  "title:": "I Have No Idea What I’m Doing And I Don’t Know Where To Go For Help",
  "text": "I just made this account today so I’m very new to Reddit so i don’t really know how this works\n\nI applied for two colleges but ended up not registering for classes or anything like that, eventually deciding to enroll for next semester. The time to reapply is coming up and I still don’t really have a clue what is going on and what I am supposed to be doing and by not going to college when originally intended, I will to start fixing a bunch of things.\n\nNeedless to say, I have a lot of questions.\n\n1) I submitted my fafsa (and i might likely have to renew it now?? I’m not sure) and i still don’t know how much financial aid i qualify for and how to check that. I think I saw the EFC amount but i don’t really know what EFC really means if i am being honest \n\n2) I don’t really understand how payment is going to work or how much ill have to pay. My mom keeps making it sound like ill get to college with my tuition completely paid because i got good grades, but I’m not sure. I don’t have a bank account or anything so unfortunately ill have to rely on my mom to help figure that out i guess, i say unfortunately because between the two of us i cant tell who is more confused about the entire process\n\n3) I would like to have information on how to apply for pell grants and scholarships before i apply.\n\n4) I feel like I will end up taking too long to apply and i worry that i wont be able to complete the process to get in this semester. My mom also said something about losing a state scholarship, so I’m worried that if we haven’t already lost the scholarship, that we will if i don’t register for classes in time. Can you lose a state scholarship before you are even enrolled in classes?  \n\nif anyone out there has read all this then thanks for reading and sorry this turned out so long",
  "author": "GoodOldSoup",
  "created": 1635196601,
  "updated": 1636166215,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi1ric7": {
      "link": "/r/ApplyingToCollege/comments/qfqmsn/i_have_no_idea_what_im_doing_and_i_dont_know/hi1ric7/",
      "text": "> I just made this account today so I’m very new to Reddit so i don’t really know how this works  \n\nYou found /r/ApplyingToCollege  so, so far you are doing really good!  \n\n\n> I applied for two colleges  \n\nI assume both schools accepted you as a student?  \n\n> ended up not registering for classes or anything like that, eventually deciding to enroll for next semester.  \n\nFine, I suppose.  \nYou can only attend one of the two schools, so make a decision.  \n\n>  I submitted my fafsa (and i might likely have to renew it now?? I’m not sure) and i still don’t know how much financial aid i qualify for and how to check that.  \n\nCall the university and ask them.  \nSpeak with a human.  \n\n> I think I saw the EFC amount but i don’t really know what EFC really means if i am being honest   \n\nIt's supposed to mean one thing, but it kind doesn't mean anything anymore.  \nFocus on what the college actually offers you in aid.  \n\n> I don’t really understand how payment is going to work or how much ill have to pay.  \n\nCall the university FInAid office.  \nAsk them.  \n\n> My mom keeps making it sound like ill get to college with my tuition completely paid because i got good grades, but I’m not sure  \n\nIn order to receive Merit Aid awards, you need to essentially be \"overqualified\" for the college in question.  \n\n\n> I don’t have a bank account or anything so unfortunately ill have to rely on my mom to help figure that out i guess, i say unfortunately because between the two of us i cant tell who is more confused about the entire process  \n\nI encourage you to open a standard checking & savings account in your own name once you turn 18 years old.  \nIt's acceptable if you use the same bank as your mother, and even allow her to access it.  \nBut you should have your own account.  \n\n> I would like to have information on how to apply for pell grants and scholarships before i apply.  \n\nSome of that happens automatically.  \nAsk your school's FinAid office for further info.  \n\n\nThis training class will probably help:  \n\nhttps://www.khanacademy.org/college-careers-more/college-admissions  \n\nThis might not hurt either:  \n\nhttps://www.khanacademy.org/college-careers-more/personal-finance",
      "author": "VA_Network_Nerd",
      "created": 1635204415,
      "upvotes": 3,
      "replies": {
        "hi7kyjh": {
          "link": "/r/ApplyingToCollege/comments/qfqmsn/i_have_no_idea_what_im_doing_and_i_dont_know/hi7kyjh/",
          "text": "Thank you for the advice!",
          "author": "GoodOldSoup",
          "created": 1635309701,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi28abr": {
      "link": "/r/ApplyingToCollege/comments/qfqmsn/i_have_no_idea_what_im_doing_and_i_dont_know/hi28abr/",
      "text": "There is a wiki at the top of the subreddit that might help answer some of your questions about the admissions process in general.\n\nAlso spend some time on both the admissions and financial aid pages of the college's website. There you will find instructions to apply for the college and how to apply for financial aid.\n\nYou can run the *Net Price Calculator* on the college's financial aid website, with the help of a parent, to see a need-based estimate.  Look closely at the estimate for what types of financial aid are included, such as grants vs loans. Federal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. Larger loans require a parent signature and are usually not reasonable amounts to borrow.\n\nIt's a good idea to call the financial aid office for questions and clarification.",
      "author": "elkrange",
      "created": 1635212162,
      "upvotes": 1,
      "replies": {
        "hi7l8kf": {
          "link": "/r/ApplyingToCollege/comments/qfqmsn/i_have_no_idea_what_im_doing_and_i_dont_know/hi7l8kf/",
          "text": "Thank you for the input!",
          "author": "GoodOldSoup",
          "created": 1635309869,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}