{
  "sid": "qhwc3d",
  "link": "/r/ApplyingToCollege/comments/qhwc3d/whats_your_second_favorite_school/",
  "title:": "What's your second favorite school?",
  "text": "You might have a dream school, a top choice, and perhaps a safety or two, but what's your *second* favorite school, the one where you might not be applying ED but would be just as thrilled to attend if given the choice?",
  "author": "mitskoshi",
  "created": 1635454370,
  "updated": 1636157173,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hifjjbv": {
      "link": "/r/ApplyingToCollege/comments/qhwc3d/whats_your_second_favorite_school/hifjjbv/",
      "text": "I got into and am attending my favorite school.\n\n\nBefore applying, I would have said Brown was my second favorite. The open curriculum and general flexibility in their curriculum  is and was the best single thing in any school ever. However, my aid package from brown was horrid and it kinda soured me on the school. \n\nDon’t have a clear second favorite then at that point. The one I keep talking about the most to people is Gustavus Adolphus. Good school, solidly in the safety range, most aid I received from a safety ( other than my state school), good programs, no app fee, no supplements, solid personality.",
      "author": "maybehelpfulanthony",
      "created": 1635455393,
      "upvotes": 1,
      "replies": {}
    },
    "hifkvv1": {
      "link": "/r/ApplyingToCollege/comments/qhwc3d/whats_your_second_favorite_school/hifkvv1/",
      "text": "ohio state university. i loved my entire visit: got to experience the social life, got a good impression of the school and my mom went there which already made me think i would love it but the visit just sealed the deal for me. my dream school is stanford so i’m not expecting to get in but i would be just as happy going to ohio state if i get admitted and get good financial aid/scholarship",
      "author": "socallaghann",
      "created": 1635455952,
      "upvotes": 3,
      "replies": {}
    },
    "higbi94": {
      "link": "/r/ApplyingToCollege/comments/qhwc3d/whats_your_second_favorite_school/higbi94/",
      "text": "Pitt ig?",
      "author": "-IndigoMist-",
      "created": 1635468078,
      "upvotes": 3,
      "replies": {}
    },
    "hig8k11": {
      "link": "/r/ApplyingToCollege/comments/qhwc3d/whats_your_second_favorite_school/hig8k11/",
      "text": "Kenyon\n\nIt's not my first choice, or even one of my reach schools. I'd probably go to any reach school over kenyon (it's in my mid tier list) but it gives me the best gilmore girls small town charm vibes ever and I would be 10000% content going there.",
      "author": "Waste-Eye8733",
      "created": 1635466692,
      "upvotes": 2,
      "replies": {}
    },
    "higu3ch": {
      "link": "/r/ApplyingToCollege/comments/qhwc3d/whats_your_second_favorite_school/higu3ch/",
      "text": "Carleton for me. I still don't know if I'll apply ED2 or RD, but I'm in love",
      "author": "dontatmeplz3",
      "created": 1635476655,
      "upvotes": 1,
      "replies": {}
    },
    "hih851m": {
      "link": "/r/ApplyingToCollege/comments/qhwc3d/whats_your_second_favorite_school/hih851m/",
      "text": "My daughter's is Stanford.  She didn't ED as MIT is her first.",
      "author": "RichInPitt",
      "created": 1635484596,
      "upvotes": 1,
      "replies": {}
    }
  }
}