{
  "sid": "qeh6bp",
  "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/",
  "title:": "college essay advice",
  "text": "please help\ni’m a senior and i have not yet written my college essay, i know i’m super late but i’ve written like 2 and i hate them bc they’re not good enough for college \nnow i’m trying to write another one and i need opinions \ni wanna write about my cat, and i’m gonna connect to high school\nso i got my cat my freshman year of high school, and i didn’t like him at first but now i absolutely adore him. i wanna make that a metaphor to how i didn’t like high school at first because i immigrated to america then, then eventually grew to love it & find myself. is it too cliche? or disconnected? i have no idea how to even start. please help me. i’ve read countless essays all over the internet + essays my classmates have written. i don’t know how to make my essay unique or anything and i’m terrible at creative writing. my strong suit is academic writing lol. anyways pls give me advice. here’s the prompt\n\nEssay Topic A: Tell us your story. What unique opportunities or challenges have you experienced throughout your high school career that have shaped who you are today?",
  "author": "fifesbitch",
  "created": 1635035394,
  "updated": 1635182919,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hht72fh": {
      "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hht72fh/",
      "text": "I mean nothing really is unique as millions of essays have been written, I think the cat essay sounds great as long as you remember what you are trying to tell AO's. Also  you are not behind. You may think the previous essays you written were just wastes of time but they are 100% apart of the process in writing college essays!",
      "author": "Dry-Comfortable-2042",
      "created": 1635039549,
      "upvotes": 3,
      "replies": {
        "hht783u": {
          "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hht783u/",
          "text": "thank you!! how do you suggest i should begin the essay? i cant think of a hook for the life of me",
          "author": "fifesbitch",
          "created": 1635039626,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhtj3bg": {
      "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hhtj3bg/",
      "text": "Rather than say you didn’t like high school can you convey something like you didn’t feel you fit into your high school and how you overcame that? That is much stronger than saying you didn’t like school..",
      "author": "Shan4276",
      "created": 1635045547,
      "upvotes": 1,
      "replies": {
        "hhtj7u9": {
          "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hhtj7u9/",
          "text": "yeah that’s what i meant lol i just got kinda lazy trynna explain it. but yes that’s exactly what i’m writing about because immigrating here was like a hard experience",
          "author": "fifesbitch",
          "created": 1635045619,
          "upvotes": 2,
          "replies": {
            "hhtk7jr": {
              "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hhtk7jr/",
              "text": "That sounds like a fantastic topic . 👍",
              "author": "Shan4276",
              "created": 1635046173,
              "upvotes": 1,
              "replies": {
                "hhtk8ms": {
                  "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hhtk8ms/",
                  "text": "thank you!!",
                  "author": "fifesbitch",
                  "created": 1635046189,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhtsthi": {
      "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hhtsthi/",
      "text": "I think you def need to really personalize the story to your individual experience because the immigrant culturally adjusting essay can be a bit cliche. But I like the idea of the cat and it could turn out really good.",
      "author": "CompetitiveComb7509",
      "created": 1635051158,
      "upvotes": 1,
      "replies": {
        "hhtswcr": {
          "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hhtswcr/",
          "text": "okay!! will try to do so. thanks!",
          "author": "fifesbitch",
          "created": 1635051210,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhtcpfq": {
      "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hhtcpfq/",
      "text": "Quick essay tip, please pay attention to your capitalization and punctuation use when actually writing the essay.",
      "author": "KaiwenKHB",
      "created": 1635042297,
      "upvotes": 0,
      "replies": {
        "hhte2fe": {
          "link": "/r/ApplyingToCollege/comments/qeh6bp/college_essay_advice/hhte2fe/",
          "text": "quick tip, understand the use of casual conversation. this is reddit.",
          "author": "fifesbitch",
          "created": 1635042976,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}