{
  "sid": "qurzsn",
  "link": "/r/ApplyingToCollege/comments/qurzsn/my_counselor_told_me_to_put_down_an_award_that_i/",
  "title:": "My counselor told me to put down an award that I am not sure I have.",
  "text": "Counselor told me to put down an athlete scholar reward for having good grades while playing sports. I did play sports and did receive 4.0's but I don't remember ever receiving this reward (I don't know if its because I participated in less rigorous sports like xc and tennis). Should I email my ao and tell them I am not sure, or is the reward relatively small and I shouldn't be too worried about if I actually received it or not.",
  "author": "fysics1hurtedmyhead",
  "created": 1637014590,
  "updated": 1637179610,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hksqca0": {
      "link": "/r/ApplyingToCollege/comments/qurzsn/my_counselor_told_me_to_put_down_an_award_that_i/hksqca0/",
      "text": "If you have free space and nothing better to put, I'd say put it down. No AO will probably ask for proof in the first place, and even if they do, counselor's assurance is all they'll need, which you already have. So what's the issue🤷",
      "author": "Concerned-gay-guy",
      "created": 1637026753,
      "upvotes": 1,
      "replies": {}
    },
    "hkt59mb": {
      "link": "/r/ApplyingToCollege/comments/qurzsn/my_counselor_told_me_to_put_down_an_award_that_i/hkt59mb/",
      "text": "I received the Academic All-State Award for Tennis (I think this is the award you're talking about?). However, my school handled the whole application process and so I wasn't aware of whether or not I received it until a few days ago. I've been told that the award looks pretty good by several coaches and counselors, so definitely make sure of your award status.",
      "author": "HotAd606",
      "created": 1637033396,
      "upvotes": 1,
      "replies": {}
    },
    "hksfqhr": {
      "link": "/r/ApplyingToCollege/comments/qurzsn/my_counselor_told_me_to_put_down_an_award_that_i/hksfqhr/",
      "text": "When in doubt, always email the AO :)",
      "author": "justastudent-vibing",
      "created": 1637021978,
      "upvotes": -2,
      "replies": {}
    }
  }
}