{
  "sid": "r4matd",
  "link": "/r/ApplyingToCollege/comments/r4matd/uc_app_if_theres_anything_you_want_us_to_know/",
  "title:": "UC App - If there’s anything you want us to know about you - now’s your chance… prompt",
  "text": "Is this the equivalent to the Common App extenuating circumstances question ie only answer it if you have something serious to say, or is this an opportunity to tell them something extra about your background, culture, etc. It\nAllows for essay length.",
  "author": "WorriedTurnip6458",
  "created": 1638156623,
  "updated": 1638204581,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hmhlybm": {
      "link": "/r/ApplyingToCollege/comments/r4matd/uc_app_if_theres_anything_you_want_us_to_know/hmhlybm/",
      "text": "It literally says it shouldn’t be an essay but rather a place to explain unusual personal or family circumstances.",
      "author": "GoatZizGoat25",
      "created": 1638157195,
      "upvotes": 3,
      "replies": {
        "hmhmql9": {
          "link": "/r/ApplyingToCollege/comments/r4matd/uc_app_if_theres_anything_you_want_us_to_know/hmhmql9/",
          "text": "Yes I know it’s not an essay ( my point was there’s lots of space) but do most people leave this blank or talk about negative academic impacts ( schedule conflict, sick mom, no internet for online school etc), or to people also use it to talk about other interesting (potentially positive) things? I think it’s the first one but I don’t want to leave it blank if I’ve misunderstood.",
          "author": "WorriedTurnip6458",
          "created": 1638157570,
          "upvotes": 1,
          "replies": {
            "hmho2i3": {
              "link": "/r/ApplyingToCollege/comments/r4matd/uc_app_if_theres_anything_you_want_us_to_know/hmho2i3/",
              "text": "From my understanding, it should be extenuating circumstances. So basically you can explain health issues, having to support your family, or other circumstances that may have affected you. \n\nThere’s another section for extenuating circumstances related to academics, so I think this section is more for how your circumstances have affected your ECs and non-academic things. \n\nCan also be any other important information you want to highlight, but don’t write an essay. \n\nIt’s completely optional too so if you don’t have anything to write then don’t.",
              "author": "GoatZizGoat25",
              "created": 1638158184,
              "upvotes": 1,
              "replies": {
                "hmhpi4a": {
                  "link": "/r/ApplyingToCollege/comments/r4matd/uc_app_if_theres_anything_you_want_us_to_know/hmhpi4a/",
                  "text": "Thanks - that’s good.",
                  "author": "WorriedTurnip6458",
                  "created": 1638158857,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}