{
  "sid": "qfu38o",
  "link": "/r/ApplyingToCollege/comments/qfu38o/ed_and_financial_aid/",
  "title:": "ED and financial aid?",
  "text": "Is it too risky to apply ED and not know how much financial aid you are getting? I ran the Net Price Calculator and the number there is affordable, but my parents are small business owners, so it might complicate the financial aid. How negotiable is financial aid, especially when you apply ED, and under what circumstances can you back out of ED due to financial reasons? (people usually say if it varies a lot from Net Price Calculator, but like how much?)",
  "author": "International-Dot-94",
  "created": 1635207032,
  "updated": 1635302148,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi1xnzo": {
      "link": "/r/ApplyingToCollege/comments/qfu38o/ed_and_financial_aid/hi1xnzo/",
      "text": ">Is it too risky to apply ED and not know how much financial aid you are getting?\n\nIf you’re comfortable paying what the NPC says you’ll have to pay (and comfortable that you’ve entered all the info correctly) you’re good.",
      "author": "Strict-Special3607",
      "created": 1635207281,
      "upvotes": 1,
      "replies": {
        "hi1y8h1": {
          "link": "/r/ApplyingToCollege/comments/qfu38o/ed_and_financial_aid/hi1y8h1/",
          "text": "yeah but the NPC only asks for net profit (aka earnings from work) of their businesses, but the CSS profile also asks for gross receipts and expenses and stuff\n\nim scarred the college will ask my parents to adjust their business expenses inorder to pay for my tuition",
          "author": "International-Dot-94",
          "created": 1635207545,
          "upvotes": 1,
          "replies": {
            "hi1z7jo": {
              "link": "/r/ApplyingToCollege/comments/qfu38o/ed_and_financial_aid/hi1z7jo/",
              "text": ">im scarred the college will ask my parents to adjust their business expenses\n\nThey won‘t ask you to do anything but “pay $xx,xxx for school.”\n\nHow you get there is up to you.",
              "author": "Strict-Special3607",
              "created": 1635208000,
              "upvotes": 1,
              "replies": {
                "hi24m0w": {
                  "link": "/r/ApplyingToCollege/comments/qfu38o/ed_and_financial_aid/hi24m0w/",
                  "text": "i don't mean it that way but they will see that they have money and think they can use it to pay for college instead of expenses for their business or at least i am scarred that is how they will perceive it as",
                  "author": "International-Dot-94",
                  "created": 1635210472,
                  "upvotes": 1,
                  "replies": {
                    "hi25ht6": {
                      "link": "/r/ApplyingToCollege/comments/qfu38o/ed_and_financial_aid/hi25ht6/",
                      "text": "From what I’ve read, small business owners can usually work through those details with the school financial aid office.",
                      "author": "Strict-Special3607",
                      "created": 1635210886,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hi26w1v": {
      "link": "/r/ApplyingToCollege/comments/qfu38o/ed_and_financial_aid/hi26w1v/",
      "text": "If you are an international student, the Net Price Calculator may not apply to you.",
      "author": "elkrange",
      "created": 1635211527,
      "upvotes": 1,
      "replies": {}
    }
  }
}