{
  "sid": "qxxqw0",
  "link": "/r/ApplyingToCollege/comments/qxxqw0/how_do_i_build_a_portfolio/",
  "title:": "How do I build a portfolio?",
  "text": "I have everything I need for a Portfolio but I have absolutely zero clue where to put it. Does anyone know the best place to house my work for universities to see?",
  "author": "Chitanozaurusu",
  "created": 1637382491,
  "updated": 1637688510,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hlcpb2d": {
      "link": "/r/ApplyingToCollege/comments/qxxqw0/how_do_i_build_a_portfolio/hlcpb2d/",
      "text": "Sorry, can you specify what you mean by portfolio? If you're talking about an art portfolio then I can likely help with what question you have.",
      "author": "the_custard",
      "created": 1637384667,
      "upvotes": 2,
      "replies": {
        "hlcyfdy": {
          "link": "/r/ApplyingToCollege/comments/qxxqw0/how_do_i_build_a_portfolio/hlcyfdy/",
          "text": "Yeah sorry for not being specific. The university I'm looking I to requires an art portfolio for the program I'm applying to. I have everything I need for the portfolio I just don't know what to use to make a portfolio",
          "author": "Chitanozaurusu",
          "created": 1637390811,
          "upvotes": 1,
          "replies": {
            "hle24qd": {
              "link": "/r/ApplyingToCollege/comments/qxxqw0/how_do_i_build_a_portfolio/hle24qd/",
              "text": "generally in your application or the school's website there would be instruction on how to submit a portfolio. i'd assume nearly all schools use slideroom for the portfolio, but each uni has their own site on it. try searching up the school and anything about their portfolio submissions to see if links to the submission site comes up, otherwise contact admission counselors and etc. i know others applying to an art program in a uni and there was always a link somewhere to it.",
              "author": "the_custard",
              "created": 1637420037,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}