{
  "sid": "qp00lw",
  "link": "/r/ApplyingToCollege/comments/qp00lw/in_an_interview_how_do_you_answer/",
  "title:": "in an interview, how do you answer:",
  "text": "\"is there anything you want me to write down about you/add?\"\n\n\"any questions for us?\"\n\nand what do some bad/meh ways these are answered?",
  "author": "thifting",
  "created": 1636325590,
  "updated": 1636654031,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 1.0,
  "comments": {
    "hjqkohb": {
      "link": "/r/ApplyingToCollege/comments/qp00lw/in_an_interview_how_do_you_answer/hjqkohb/",
      "text": "1 - a story, or a why answer in response to your passion or the school\n\n2 -  do your research you shouldn't apply (or interview) at a school you don't want to go to and if you want to go to that school you should know why other than their ranking\n\n3 - say no, or say because their ranking",
      "author": "Sufficient_Pickle702",
      "created": 1636327409,
      "upvotes": 7,
      "replies": {}
    },
    "hjrap4m": {
      "link": "/r/ApplyingToCollege/comments/qp00lw/in_an_interview_how_do_you_answer/hjrap4m/",
      "text": "Hey! So I interviewed at American U and Case Western Reserve and these are some of the questions I asked!\n\n• I was lucky enough to have the privilege of touring, but unfortunately there weren’t any students on campus. I was wondering what the feel of campus is when the students are there? - looking for an answer about energy, school spirit, general student body\n\n• *ask question about specific thing on campus pertaining to the things you talked about in the interview* I asked case about their internship program with the Cleveland museum of art (I’m going into communications and art history) and American about their farmer’s market as I volunteer at one regularly. \n\n• you should ALWAYS ask a question. ALWAYS. It shows genuine interest in the school. Don’t ask something stupid and broad, make it specific.",
      "author": "ItsEggTime_113",
      "created": 1636339412,
      "upvotes": 6,
      "replies": {}
    },
    "hjqp41g": {
      "link": "/r/ApplyingToCollege/comments/qp00lw/in_an_interview_how_do_you_answer/hjqp41g/",
      "text": "Might be a little too pithy, but re: the first:\n\n\"Nothing in particular.  I guess you can put down that I genuinely enjoyed our chat today and and look forward to contributing to the {school} community next year if given the opportunity.\"\n\nKind of a non-answer, but arguably better than, \"Uh, no, nothing comes to mind.\"\n\nRe: the second, yes, you should absolutely ask questions.  Having no questions to ask is itself somewhat of a red flag.  Think of it as a two-way interview.  They're evaluating you to see if you're a good fit for the school, but you're also evaluating the school to see if it's a good fit for you.  Some ideas:\n\n\"What did you enjoy most about your time at {school}?\"\n\n\"What was most challenging?\"\n\n\"What are some opportunities for me to contribute at {school} that might not be immediately obvious?\"\n\n\"As someone who's been through this process and come out on the other side, what's one piece of advice you'd give to someone in my position?\"",
      "author": "jayphoward",
      "created": 1636329339,
      "upvotes": 4,
      "replies": {}
    }
  }
}