{
  "sid": "q8amus",
  "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/",
  "title:": "Do Standardized Tests ( SAT, ACT, AP, IB, etc) not matter any more? Was all this hard work just a waste of time?",
  "text": "I am a super worried senior. I took 5 APs last year and self studied for the AP Macro exam. I also took two AP exams before that. I got all fives except for one 4 on Physics 1. Last year, my GPA took a nose dive since I got a B+ second semester of Lang, despite having all As in other classes. The reason was many students in my class were cheating their way through the Pandemic. Our school crawls with those type of kids. Flunked the AP exams too, but they r like “AP exams don’t matter, SAT don’t matter. I got a great GPA by cheating so like every college would love me now. Don’t forget the Essays too! I am getting my outside college counselor to write it for me! SAT is messed up. It defines kids by numbers. I am more than a number! Get rid of the SAT. All schools should be test blind! Your SAT and AP don’t mean sh*** now” Just sucks for kids like me who actually were stupid and moral and did not cheat. Lol. I was too stupid/moral to cheat and now my GPA is far from a 4.0 . I honestly thought that one way to mitigate for this would be to do well on the AP exams, for which I studied for and did well on. However, I am now hearing more and more students saying that the AP exams don’t matter, and the SAT (which I got a 1570 on) does not matter. They claim only the GPA (which they are so proud to point out) that they cheated to get us all that matters, and that their high GPA would make them much more competitive for college admissions than me. Now, I am very depressed. Every thing I worked my ass for us now down the drain. My GPA will hold me back and I just can’t get over the fact that kids who cheated their way through the entirety of their Junior year will now have an advantage over me in this test optional college admissions environment. Sorry for this being so long. I am basically ranting. Lol 😂",
  "author": "GrassComfortable6626",
  "created": 1634251846,
  "updated": 1634331485,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "hgo3gui": {
      "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo3gui/",
      "text": "If 1 B+ is what worries you, your GPA is fine lol. Beyond a certain range, all your GPA will signify is that you're an excellent, competitive student (same applies to test scores).\n\nWhat's way more important is whether you are an interesting addition to campus, which is where your essays and the rest of your app applies. Don't sweat it, you're fine.",
      "author": "Vergilx217",
      "created": 1634252074,
      "upvotes": 15,
      "replies": {}
    },
    "hgo3r83": {
      "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo3r83/",
      "text": "Test optional does not mean test not valuable. Except for the very few colleges that are test-blind, a 1570 will enhance your application.\n\nAP courses show rigor. The exams themselves were never important for admissions, but can be useful for credit or placement.\n\nAnd a B+ in one class is hardly the end of the world. It certainly won't be the reason a college rejects you \n\nGood luck.",
      "author": "skieurope12",
      "created": 1634252207,
      "upvotes": 8,
      "replies": {}
    },
    "hgo3ukl": {
      "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo3ukl/",
      "text": "Dude? Of course a 1570 is going to help you. That’s an amazing score. Also APs never really mattered it’s just whether you get college credit or not. Anyways, unfortunately GPA is highly important at a lot of schools and I’ve heard from t he collegeresults sub that a low GPA is hard to overcome. But bro you got one fucking B. Mostly 5s, 1570, 1 B wtf are you ranting about. And stop with the “everyone was cheating.” That’s simply not true. And also something you can’t control. Sorry for sounding passive aggressive but just take a chill pill and relax you’ll do fine.",
      "author": "NightCrawler442",
      "created": 1634252247,
      "upvotes": 5,
      "replies": {
        "hgo4aod": {
          "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo4aod/",
          "text": "First off, I am sure many people did not cheat. But there is no denying the fact that a considerable, considerable, number of people cheated their way through online school last year. I guess I am just angry at people who will reap all the benefits of a high GPA focused college admissions through cheating while I am left in the dirt with my mediocre GPA and standardized tests that outlived their time.",
          "author": "GrassComfortable6626",
          "created": 1634252456,
          "upvotes": -3,
          "replies": {
            "hgo5a25": {
              "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo5a25/",
              "text": "Mediocre GPA? Please relax",
              "author": "Snoo_62176",
              "created": 1634252907,
              "upvotes": 7,
              "replies": {}
            },
            "hgo6f4r": {
              "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo6f4r/",
              "text": "Bro this gotta be satire 😂",
              "author": "NightCrawler442",
              "created": 1634253440,
              "upvotes": 7,
              "replies": {}
            },
            "hgowfmi": {
              "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgowfmi/",
              "text": "Mediocre GPA? Fuck I hate this subreddit",
              "author": "Thunderbird23",
              "created": 1634265436,
              "upvotes": 3,
              "replies": {}
            },
            "hgo7bzm": {
              "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo7bzm/",
              "text": "hope ur joking, if u didn’t cheat through online school last year then YOU are in a disadvantage",
              "author": "Tr4pMLG",
              "created": 1634253872,
              "upvotes": 6,
              "replies": {
                "hgo7e7f": {
                  "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo7e7f/",
                  "text": "I guess I am. Thanks. Reminded of that everyday.",
                  "author": "GrassComfortable6626",
                  "created": 1634253901,
                  "upvotes": -3,
                  "replies": {
                    "hgqypje": {
                      "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgqypje/",
                      "text": "1 B is not going to kill your GPA.",
                      "author": "leaf1598",
                      "created": 1634311573,
                      "upvotes": 2,
                      "replies": {
                        "hgrxqvg": {
                          "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgrxqvg/",
                          "text": "assuming his parents prob put a lot of pressure on him. usually that is how it goes with people like him at my school. i jus think it’s stupid. All this won’t matter at all after college",
                          "author": "Tr4pMLG",
                          "created": 1634325956,
                          "upvotes": 1,
                          "replies": {
                            "hgrzmzj": {
                              "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgrzmzj/",
                              "text": "Honestly eventually grades won’t matter. Obviously working hard matters, but to be incredibly nit-picky over a B is extremez",
                              "author": "leaf1598",
                              "created": 1634326759,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgo5083": {
      "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo5083/",
      "text": "Your stats are incredible!  Definitely, apply wherever you want - you have a competitive shot at all the top schools.  \n\nSeveral years ago, my kid's friend took AP Euro History and got a B+ for the year.  She killed it on the exam, got a 5, and when school restarted, went back to that teacher, and argued that she did indeed know the material - he bumped her up to an A-.  Naive me, I hadn't know before my kid told me that story, that grades from the year prior could be changed.  Maybe you could try that.",
      "author": "the3twins",
      "created": 1634252782,
      "upvotes": 1,
      "replies": {
        "hgo73v2": {
          "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgo73v2/",
          "text": "Yeah already did. My grade was a 89.43 he refused to bump it up. Claimed I was on a downward curve in terms of grades. I got an A- first semester.",
          "author": "GrassComfortable6626",
          "created": 1634253765,
          "upvotes": 1,
          "replies": {
            "hgqysa0": {
              "link": "/r/ApplyingToCollege/comments/q8amus/do_standardized_tests_sat_act_ap_ib_etc_not/hgqysa0/",
              "text": "Honestly don’t stress. If a school rejects you because of one B then grades probably weren’t the main reason.",
              "author": "leaf1598",
              "created": 1634311606,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}