{
  "sid": "qc2a9j",
  "link": "/r/ApplyingToCollege/comments/qc2a9j/34_35_ss_act993_gpa_scared_about_applying_into/",
  "title:": "34 (35 SS) ACT/99.3 GPA Scared about applying into engineering programs... feel my APs are not up to snuff. Can I still get accepted into a school if I get rejected from their engineering program?",
  "text": "I have tried to keep my course-load fairly balanced throughout HS because I am predominantly undecided and was always interested in the humanities. I have recently (past year) become enamored with engineering. I, however, have only taken/will be taking AP Lang, Lit, US Hist, Gov, APES, and Chem. Partly because of COVID, partly because of anxiety, I neglected to take Calc junior year, and instead took Pre-calc H. I 100% should have because my average was a 99, and I still regret my decision. With my high GPA and ACT score, I am planning on applying to some prestigious colleges, and was wondering if I should even bother. Should I apply to them as an undecided major instead and give up on engineering? What happens if I apply into a school as a prospective engineering major, but don't get accepted into their engineering program? Do I get flat out rejected? Am I allowed to choose a major in their general school? I am just scared of applying as an engineering major, but then getting rejected because of my courses, and then not be able to pursue even a non-engineer major at my favorite schools.\n\nBTW I still have the option to add in a one semester independent study (AP Gov is already one), but I basically can only take AP Psych. Is it even worth it? \n\n&#x200B;\n\nAlso, 4 on chem, and 5 on lang and apush. \n\nThanks... I'm honestly scared guys. I don't want my hard work to go to waste because of me being and idiot and not choosing to take Calc junior year. Should I try and explain why I didn't take calc in the COVID essay? The last semester of sophmore year was online and I learned nothing, so I was scared of not being prepped for calc junior year.",
  "author": "KingTiger189",
  "created": 1634740556,
  "updated": 1634749577,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhd776e": {
      "link": "/r/ApplyingToCollege/comments/qc2a9j/34_35_ss_act993_gpa_scared_about_applying_into/hhd776e/",
      "text": ">What happens if I apply into a school as a prospective engineering major, but don't get accepted into their engineering program?\n\nAs with almost every question about the college application process, the answer depends on which school you’re talking about.\n\nSome schools accept by specific major, some don’t. Some allow you to list a second choice major, some don’t.",
      "author": "Strict-Special3607",
      "created": 1634740808,
      "upvotes": 1,
      "replies": {
        "hhd86vy": {
          "link": "/r/ApplyingToCollege/comments/qc2a9j/34_35_ss_act993_gpa_scared_about_applying_into/hhd86vy/",
          "text": "My guidance counselor told me the same thing. I have emailed the schools I am EAing to, and one of them still has not responded, and the other just gave me a generic response linking me to information sessions that have passed. I have tried to comb their FAQs, but I have not found anything pertaining to me issue. Also, at least on the common app, none of my EA schools allow me to pick a second major.",
          "author": "KingTiger189",
          "created": 1634741223,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhd9p9g": {
      "link": "/r/ApplyingToCollege/comments/qc2a9j/34_35_ss_act993_gpa_scared_about_applying_into/hhd9p9g/",
      "text": "You have nearly perfect scores and grades.  Whether you should bother to apply to highly selective schools mostly comes down to the \\*other\\* aspects of your application and/or your personal traits (1st gen, under-represented minority, etc.)\n\nIf you want to be an engineer then I strongly advise against listing a different major in an attempt to \"game\" the admissions process.  Be content with whatever school will admit you as a prospective engineering major.\n\nAlso sign up for Calc AB for your senior year.  Plenty of students are on a math schedule that has them taking Calculus as a senior.  That's still accelerated by one year vs. the default.",
      "author": "jayphoward",
      "created": 1634741850,
      "upvotes": 1,
      "replies": {
        "hhdapit": {
          "link": "/r/ApplyingToCollege/comments/qc2a9j/34_35_ss_act993_gpa_scared_about_applying_into/hhdapit/",
          "text": "Sorry if it was not clear, but I am a senior. I am currently taking just Calculus H. Also, I am a white male, have an engineering focused common app personal essay, and I believe my ECs are a strong point.\n\n&#x200B;\n\nMock Trial(our team is pretty good and I am a starter), Model UN( club leadership), Boy Scout, Tech Club, various art clubs, a service club, and I might be a co-founder of an engineering club.",
          "author": "KingTiger189",
          "created": 1634742262,
          "upvotes": 1,
          "replies": {
            "hhdc1eu": {
              "link": "/r/ApplyingToCollege/comments/qc2a9j/34_35_ss_act993_gpa_scared_about_applying_into/hhdc1eu/",
              "text": "You’re fine.",
              "author": "PugTrafficker",
              "created": 1634742819,
              "upvotes": 1,
              "replies": {}
            },
            "hhdha7p": {
              "link": "/r/ApplyingToCollege/comments/qc2a9j/34_35_ss_act993_gpa_scared_about_applying_into/hhdha7p/",
              "text": "Your scores/grades are strong, you're saying your ECs are strong.  The only potential issue is that you're just now taking Calc as a senior?  That's not a big deal.  Would it look better if you were taking Calc BC right now?  Sure.  But the fact that you're not is not disqualifying.",
              "author": "jayphoward",
              "created": 1634744949,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}