{
  "sid": "qf4hdc",
  "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/",
  "title:": "How to write \"why this major essay?\" if common app essay talks about why I want to get into engineering?",
  "text": "Hi all,\n\nWhat do I put down for the \"why this major essay?\" if my common app talks about my story of wanting to become an engineer?\n\nI know I can just take parts of my common app and paste it in, but from what I have researched, it is best if I don't put down the same information. (It is better to put new information so they get to know more about you.)\n\nAny help is appreciated!\n\nThanks",
  "author": "Snoo39607",
  "created": 1635120051,
  "updated": 1635182732,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhxisty": {
      "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/hhxisty/",
      "text": "I mean the best idea would have been to not write your peraonal statement with anything that could potentially overlap with the two most common supplemental prompts: why this school? and why this major? But to answer your question, you could explain why you want to study engineering specifically at that school while also including additional insight on why you want to go into engineering in general.",
      "author": "AuthenticPhantom",
      "created": 1635122880,
      "upvotes": 5,
      "replies": {}
    },
    "hhxius8": {
      "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/hhxius8/",
      "text": "I think one idea is to go into why you want to go into that specific college's program. Anything unique they might offer in it, opportunities they have based on location/associations with places outside the school. Obviously, you don't want to just say what they describe themselves as on their website, but while your common app essay may be about engineering on the whole, you can use this essay to explain your interest in this specific school's engineering program, since there are so many others to choose from.",
      "author": "NoTelevision666",
      "created": 1635122909,
      "upvotes": 2,
      "replies": {
        "hhxiy8h": {
          "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/hhxiy8h/",
          "text": "thanks, makes sense",
          "author": "Snoo39607",
          "created": 1635122956,
          "upvotes": 1,
          "replies": {
            "hhxj6ez": {
              "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/hhxj6ez/",
              "text": "anytime! i wish u luck :)",
              "author": "NoTelevision666",
              "created": 1635123071,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhxj3ni": {
      "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/hhxj3ni/",
      "text": "Does that application have a separate \"why this school\" essay?  If not, you could talk about what specifically about their engineering program is attractive you.  \n\nAnother option would be to write a different common app essay for that school, and repurpose your common app essay as a why major one (with appropriate editing to best fit the prompt).  There is no requirement to submit the same common app essay in every application.",
      "author": "BrawnyAcolyte",
      "created": 1635123033,
      "upvotes": 1,
      "replies": {
        "hhxjbf2": {
          "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/hhxjbf2/",
          "text": "Purdue\r  \nHow will opportunities at Purdue support your interests, both in and out of the classroom? (Respond in 100 words or fewer.)\\*\r  \n\r  \nBriefly discuss your reasons for pursuing the major you have selected. (Respond in 100 words or fewer.)\\*\n\nThese are the two questions form purdue west lafayette. One is about why and the other is about why this school. Thoughts?",
          "author": "Snoo39607",
          "created": 1635123140,
          "upvotes": 1,
          "replies": {
            "hhxjo18": {
              "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/hhxjo18/",
              "text": "100 words or fewer helps a lot - I think you can talk about the opportunities that Purdue engineering offers for the second prompt, and talk about anything non-engineering that attracts you to Purdue for the first one.",
              "author": "BrawnyAcolyte",
              "created": 1635123318,
              "upvotes": 1,
              "replies": {
                "hhy8twz": {
                  "link": "/r/ApplyingToCollege/comments/qf4hdc/how_to_write_why_this_major_essay_if_common_app/hhy8twz/",
                  "text": "that makes sense, thank you",
                  "author": "Snoo39607",
                  "created": 1635137171,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}