{
  "sid": "qaof44",
  "link": "/r/ApplyingToCollege/comments/qaof44/can_i_update_my_ea_application_for_the_nov_sat/",
  "title:": "Can I update my EA application for the Nov SAT?",
  "text": "Didn’t have the opportunity to take many SATs so I need to take this November one, can I update the app 2 weeks later to add it in?",
  "author": "ComprehensiveCat1505",
  "created": 1634569231,
  "updated": 1634653343,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh4bx40": {
      "link": "/r/ApplyingToCollege/comments/qaof44/can_i_update_my_ea_application_for_the_nov_sat/hh4bx40/",
      "text": "Check the deadline pages of your colleges' websites. Some may accept Nov scores, many may not. Most probably consider the scores if they just happen to arrive before before the application is reviewed, which is not something you can know or control.\r  \n\r  \nAlso check each of your colleges' websites to see what score reporting methods they accept. Many colleges now accept scores self-reported in the app (or portal), for free, to be followed by an official report only if you later enroll – self-reporting is much faster, as typically you can simply enter the scores into the portal yourself. Other colleges still require official score reports sent directly from the testing agency prior to admission, which obviously takes a lot longer.",
      "author": "elkrange",
      "created": 1634571892,
      "upvotes": 2,
      "replies": {}
    },
    "hh5wclc": {
      "link": "/r/ApplyingToCollege/comments/qaof44/can_i_update_my_ea_application_for_the_nov_sat/hh5wclc/",
      "text": "Check the school for the last accepted test date.\n\n I’ve seen a few that accept November, but most don’t. And at least one asked you to indicate on the application that a November score was coming, so the application could be held until it was received.",
      "author": "RichInPitt",
      "created": 1634596070,
      "upvotes": 1,
      "replies": {}
    }
  }
}