{
  "sid": "qb65a9",
  "link": "/r/ApplyingToCollege/comments/qb65a9/anyone_who_applied_to_princeton/",
  "title:": "Anyone who applied to Princeton?",
  "text": "Confused about the graded paper they need us to submit. As a CBSE students, we don't normally write papers that are graded in my final transcript or included anywhere.",
  "author": "SiddAMA21NG",
  "created": 1634627296,
  "updated": 1636157783,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh7ocpb": {
      "link": "/r/ApplyingToCollege/comments/qb65a9/anyone_who_applied_to_princeton/hh7ocpb/",
      "text": "You’ve never had to complete a writing assignment for any of your classes? What assignments do you do for your English or literature or language class?",
      "author": "DarthKnah",
      "created": 1634634886,
      "upvotes": 3,
      "replies": {
        "hh87d5z": {
          "link": "/r/ApplyingToCollege/comments/qb65a9/anyone_who_applied_to_princeton/hh87d5z/",
          "text": "Schools in India typically test only through written exams (which does include essay writing but only as a small part of the paper) and do not include assignments like quizzes, essays writing etc.",
          "author": "sidroid123",
          "created": 1634648363,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh86qx8": {
      "link": "/r/ApplyingToCollege/comments/qb65a9/anyone_who_applied_to_princeton/hh86qx8/",
      "text": "My brother also applied to Princeton from a CBSE school. \n\nWhat he did was write an essay on a random topic separately and have his English teacher grade it using the American system (A, A+/- B, C etc.). \n\nObviously for this, your school and teacher need to be supportive.",
      "author": "sidroid123",
      "created": 1634648038,
      "upvotes": 2,
      "replies": {}
    },
    "hh7vt06": {
      "link": "/r/ApplyingToCollege/comments/qb65a9/anyone_who_applied_to_princeton/hh7vt06/",
      "text": "I am applying to Princeton but I am from ISC. In our school in particular and ISC schools in general, we have to write projects which basically equate to a graded paper for us. Afaik, there should atleast be a written project for English if you are from Science. Does CBSE not have projects?",
      "author": "Resident_Ad8455",
      "created": 1634641219,
      "upvotes": 1,
      "replies": {}
    },
    "hh91ko1": {
      "link": "/r/ApplyingToCollege/comments/qb65a9/anyone_who_applied_to_princeton/hh91ko1/",
      "text": "There's no way you haven't written essays or papers for CBSE board. Let alone essays, the coursework for class 12th English atleast includes articles, report writing & summer assignments that include analysis work. This, I assume, is what would suffice? Unless you didn't attend English classes as attentively(I can't blame you, this is the tale of every CBSE student though). I personally don't find Princeton to be a fit for me but from what I've heard, what I mentioned should work. One clever thing to do would be to get your English summer assignment graded or if your school has the SEWA program(which I think is compulsory now? Like it's social work or something, I had mine since 9th), put your research work for that as papers after getting them graded by your teachers. Even science subjects have assignments like that, for example, my 12th grade Chemistry summer assignment was about soy milk(these projects work too + they constitute the internal marks). Best of luck!",
      "author": "Used-Protection-4677",
      "created": 1634661650,
      "upvotes": 1,
      "replies": {}
    }
  }
}