{
  "sid": "qga1to",
  "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/",
  "title:": "Happy Tuesday before Nov 1, Early Birds! Quick Tips for Finalizing Those Early Apps",
  "text": "Happy Tuesday Beautiful Early Bird Seniors,\n\nIt's been exciting seeing so many of you completing your early apps and getting them submitted! Congrats and good luck to you all. 💙 🍀\n\nFor those of you still in the weeds -- or even if you haven't yet begun to dive in 😳, I want to remind you to take time this week to just breathe. Write your little asses off and do the best you can, but remember to pause and breathe.\n\nHere are a few more reminders for finalizing your early apps:\n\n* DO NOT wait until the very last minute or even hour. Something will go wrong. Your electricity will go out. You'll come down with the flu. The Internet will go out. The zombie apocalypse will arrive. Your credit card won’t work. The website will crash. Your pet will have a crisis. Try to give yourself at least a couple of days, but at the **very least** give yourself eight hours of cushion time.\n* Get up from your computer and walk around every hour or so. Go outside. Let your brain reset occasionally.\n* Be sure to preview your essays after loading them into the app, and see that the spacing is the way you want it. Chrome will automatically bold your essays and add an extra paragraph space between paragraphs. You can easily unbold and remove the space.\n* Read your essays OUT LOUD — to someone else if possible. You will notice missing words and funny verb tenses. Listen and feel for bumps. That’s where you need to edit. Make sure it sounds like you. Couple of hints:\n\n1. Read your essay to your phone recorder and then listen back for the bumps.\n2. Print up the preview copies and read them to look for bumps and typos.\n3. Read your sentences backward -- the last sentence to the first sentence. It will help you read the words on the paper and not what you think it says.\n4. [Here’s a link to some more of my editing hints](https://drive.google.com/file/d/1aAYpN_N6RSR6cQ1c90pIX0IfZzrMbj_W/view?usp=sharing).\n\n* Don't be a Thesaurus Rex. If it sounds like you've swallowed a thesaurus, go back and use words you know and understand. It's really disconcerting as a reader to feel that bump with a word that just isn't right. Use words you know -- and understand.\n* Stop and breathe. You might start feeling overwhelmed; just take 5 minutes and close your eyes and take deep belly breaths. You will be amazed at how much better you feel.\n* In your essays, your tone should be casual and conversational. Like you’re talking to an older cousin you respect. It’s ok to use contractions. Eliminate adverbs, especially all verys and reallys.\n* After submitting, look through and make sure all the parts went through. Especially check to make sure that your supplements were submitted. You often need to go back and send them after paying and sending the common app.\n* For Common App deadlines of Nov 1, you have until 11:59 PM your time on Nov 1 — do not wait until then to submit — see my above notes about zombie apocalypses and websites crashing.\n* For many colleges, it’s ok for your supplementary materials like LORs, transcripts, and test scores to arrive after the app. Check the colleges’ websites to determine their deadlines. You do not need to wait for them to be in before you hit submit.\n* If you haven’t sent your test scores yet to schools that require official scores, do that today.\n* Recognize that this learning process is what college admissions is really all about. Reflect on how much you are learning about yourself right now as you are going through this. No matter where you go to college, you will be more in tune with who you are for having gone through this journey of self-exploration. Be proud of it.\n* This is the part you can control. Show them the best you on your very best day.\n* Once you’ve let those beautiful baby bird early apps go from your nest, let them fly. Be sure to check up on your portals in the next few days and see what you need to finish, but beyond that move on to your other apps.\n* Take another deep breath and go for a nice long walk.\n\nOk! That's a long enough procrastination break -- now giddy-up; get back to work! 👏👏👏\n\nYou got this!\n\nRemember to breathe,\n\n💙 admissionsmom\n\n(Oh! One more thing - try using Chrome if you aren't using it already and you're having trouble submitting 🙃. )",
  "author": "admissionsmom",
  "created": 1635265285,
  "updated": 1635301534,
  "over_18": false,
  "upvotes": 140,
  "upvote_ratio": 0.99,
  "comments": {
    "hi4qigy": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4qigy/",
      "text": "You’re an angel!! Thank you so very much❤️❤️❤️",
      "author": "Cloud1628",
      "created": 1635265435,
      "upvotes": 14,
      "replies": {
        "hi4r9w6": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4r9w6/",
          "text": "Good luck!!! Let me know if you have last minute questions! 🍀💖😊",
          "author": "admissionsmom",
          "created": 1635265728,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hi4r8e2": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4r8e2/",
      "text": "Can you answer the question that seems to confound even the most confident HYPSM-type applicant?\n\nDoes November 1st mean 11:59pm on October 31st? 12 midnight Nov 1st? 12 midnight Oct 31? 11:59pm November 1st?\n\n😜",
      "author": "Strict-Special3607",
      "created": 1635265712,
      "upvotes": 13,
      "replies": {
        "hi4rone": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4rone/",
          "text": "I did! It’s in my post!\n\nFor common app schools you have until Nov 1 at 11:59 your time. Do not wait until then. \n\nAlways check from the source — your colleges and common app if it’s a common app college. https://appsupport.commonapp.org/applicantsupport/s/article/When-is-the-deadline-for-my-application-submission\n\nIndividual colleges who don’t use common app have differing deadlines so check with them.",
          "author": "admissionsmom",
          "created": 1635265889,
          "upvotes": 7,
          "replies": {
            "hi4txts": {
              "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4txts/",
              "text": ">For common app schools you have until Nov 1 at 11:59 your time.\n\nAM or PM?\n\n😎",
              "author": "Strict-Special3607",
              "created": 1635266774,
              "upvotes": 7,
              "replies": {
                "hi4ueak": {
                  "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4ueak/",
                  "text": "PM! Thanks for noting that.  need to edit my post!",
                  "author": "admissionsmom",
                  "created": 1635266951,
                  "upvotes": 6,
                  "replies": {
                    "hi4vddm": {
                      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4vddm/",
                      "text": "Hopefully you know I was kidding. (Except for the part about way too many people not understanding how the clock and the calendar work.)",
                      "author": "Strict-Special3607",
                      "created": 1635267330,
                      "upvotes": 6,
                      "replies": {
                        "hi4wgze": {
                          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4wgze/",
                          "text": "Of course! I'm always happy to be corrected -- and grateful!",
                          "author": "admissionsmom",
                          "created": 1635267757,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hi597ny": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi597ny/",
      "text": "i submitted all of my early schools on sunday.  i'm trying to give myself a mental break for a week before i get started on the RD schools",
      "author": "spectre729",
      "created": 1635272776,
      "upvotes": 8,
      "replies": {
        "hi59ph3": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi59ph3/",
          "text": "Woo Hoo!!! 🤠🤠🤠Enjoy that feeling!! Take a few days off for sure. 🧘🏻‍♀️💖",
          "author": "admissionsmom",
          "created": 1635272972,
          "upvotes": 3,
          "replies": {}
        },
        "hi5jpm5": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi5jpm5/",
          "text": "just gotta do 2 more nov 1st ea’s, then just gotta chill for a good week or couple.",
          "author": "MRSEASONS",
          "created": 1635276872,
          "upvotes": 2,
          "replies": {
            "hi6l17t": {
              "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi6l17t/",
              "text": "Good luck!!🍀",
              "author": "admissionsmom",
              "created": 1635292378,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi4xn7a": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4xn7a/",
      "text": "As the other comment says, you really are an angel",
      "author": "Born-On-My-Birthday",
      "created": 1635268219,
      "upvotes": 3,
      "replies": {
        "hi4z0vs": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4z0vs/",
          "text": "Good luck!! Remember to take time to breathe this week!! 💖😊",
          "author": "admissionsmom",
          "created": 1635268765,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi5t7kr": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi5t7kr/",
      "text": "Thank you for this! Do you know where students tend to mess up? The small creeping seemingly unimportant things that turn out to be important?",
      "author": "Glum-Entertainment39",
      "created": 1635280508,
      "upvotes": 3,
      "replies": {
        "hi69u47": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi69u47/",
          "text": "Not submitting the essay that requires you to go back and submit it after applying \n\nNot inputting test scores or AP scores if you want to share them \n\nNot checking the preview carefully to make sure all the parts are completed \n\nNot reading every essay out loud and backwards",
          "author": "admissionsmom",
          "created": 1635287342,
          "upvotes": 2,
          "replies": {
            "hi6z57m": {
              "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi6z57m/",
              "text": "A quick question. Do most colleges accept the self reported scores on the common app? I’m really debating whether I have to rush order them or not",
              "author": "FlamingIce12",
              "created": 1635298789,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi4xv8t": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4xv8t/",
      "text": "I am an international applying EA to a few schools. My country's grading system is different from that in the USA. Though I haven't yet come to the part where I need to enter my school grades, when I do, and if I have any questions, can I dm you?",
      "author": "Born-On-My-Birthday",
      "created": 1635268309,
      "upvotes": 2,
      "replies": {
        "hi4z8e1": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi4z8e1/",
          "text": "You can of course — but I don’t know that I’ll be the best help with that. You might need to ask over in r/IntlToUsa to get some help from people who are more likely to know how to help you.",
          "author": "admissionsmom",
          "created": 1635268846,
          "upvotes": 3,
          "replies": {
            "hi50l5q": {
              "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi50l5q/",
              "text": "Oh, okay. Thanks.",
              "author": "Born-On-My-Birthday",
              "created": 1635269374,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hi51a1w": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi51a1w/",
      "text": "Thanks for all the tips - I'm another mom on this subgroup and on my 3rd kid but still feel like I'm forgetting something.",
      "author": "rubyreadit",
      "created": 1635269646,
      "upvotes": 2,
      "replies": {
        "hi52tr5": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi52tr5/",
          "text": "Believe me — I’m constantly making lists and sending notes to my students! And I’ve been through 3 of my own kids and countless students here on a2c and privately! And it seems like it gets a little more complicated every year.",
          "author": "admissionsmom",
          "created": 1635270253,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hi57s9p": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi57s9p/",
      "text": "Thank you so much! I have a question. Im confused about the testing section in common app. When it asks how many tests I want to self report and if I put 1 it asks me to report my highest reading and highest math. If I report a single section from two different tests, do I have to put 2 tests for the first question?",
      "author": "jackiechan_4",
      "created": 1635272217,
      "upvotes": 2,
      "replies": {
        "hi59lpf": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi59lpf/",
          "text": "Yeah. To my understanding if you’re reporting from 2 different test dates you’d put 2 and then add your highest score",
          "author": "admissionsmom",
          "created": 1635272930,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi5k1sq": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi5k1sq/",
      "text": "Hi! Thank you for this. Not sure if this has been asked but I realised in the Docs there's a sentence that says \"-- and while you’re at it go ahead and replace passion. Remember the goal is to sound like you’re having a conversation.\"   \n\n\nDo you mean to replace the word \"passion\"? (if yes, why?)",
      "author": "NotAFourPointer",
      "created": 1635277003,
      "upvotes": 2,
      "replies": {
        "hi5nds3": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi5nds3/",
          "text": "Yes. Just because it’s so overused and every essay I read mentions passion.  I’ve heard a number of other app readers say the same. And I imagine that if I’m sick of it app readers for colleges will really get tired of it.",
          "author": "admissionsmom",
          "created": 1635278276,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi6fmsi": {
      "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi6fmsi/",
      "text": "Wow, thank you for sharing this! I'm starting my essay and have been caught up in comparisons - is it the end of the world if I don't have a burning passion for some one thing, or have a single experience which shaped me as a person that I *must* share? I feel like just saying that I have high grades and a commitment to contribute on campus in the things I do well will fall flat in the eyes of colleges.",
      "author": "jintamai",
      "created": 1635289926,
      "upvotes": 2,
      "replies": {
        "hi6kz0q": {
          "link": "/r/ApplyingToCollege/comments/qga1to/happy_tuesday_before_nov_1_early_birds_quick_tips/hi6kz0q/",
          "text": "You def don’t have to have a burning passion to apply to college. \n\nJust make sure you do a good job of explaining who you are and creating an image of you on their campus.",
          "author": "admissionsmom",
          "created": 1635292350,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}