{
  "sid": "qr5h1g",
  "link": "/r/ApplyingToCollege/comments/qr5h1g/should_i_apply_to_ut_austin/",
  "title:": "Should I apply to UT Austin",
  "text": "Hello i am a high school senior and I am debating to if I should apply to UT Austin Journalism (Moody). UT was never on my radar since living in Texas we have always been told UT “only accepts the top 6 %” however UT Austin has been sending me a lot of mail throughout the last year saying they were interested of me because of my “Academic achievements” I am in AP classes and I am in Yearbook and was previously in Newspaper, also in debate. I do have a 3.4 gpa which is obviously not top 6 % but from what I have read is UT does accept some students in less competitive majors that say have “decent” grades.",
  "author": "AnonymousJTP",
  "created": 1636581934,
  "updated": 1636652882,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk4j2b9": {
      "link": "/r/ApplyingToCollege/comments/qr5h1g/should_i_apply_to_ut_austin/hk4j2b9/",
      "text": "It auto admits too 6%. But u can get in from outside that. Like at super competitive schools, really smart people are gonna be outside t6% but they still get in",
      "author": "grdgree",
      "created": 1636582264,
      "upvotes": 2,
      "replies": {}
    },
    "hk4k7l9": {
      "link": "/r/ApplyingToCollege/comments/qr5h1g/should_i_apply_to_ut_austin/hk4k7l9/",
      "text": "You can still be admitted to UT via holistic admissions even if you're not top 6%.  Also, the GPA used to determine class rank (for the purpose of Texas guaranteed admissions) is kind of...weird.  If 3.4 is your unweighted GPA \\*and\\* you have a lot of weighted core classes \\*and\\* your high school isn't that competitive then a 3.4 UW might actually be close to top 6%.  It's not super likely, but within the realm of possibility.\n\nThough, even if you're not top 6%, if you're, say, top 15% and have good test scores, then that could also be enough.  Journalism is one of the less competitive majors in terms of grades/scores, and in theory your newspaper experience should count for something.  Could always give it a shot.\n\nYou may also be offered the deal where you have to attend a different UT campus for a year then transfer in.  If that's something you'd consider, then that strengthens the case for applying.",
      "author": "jayphoward",
      "created": 1636582734,
      "upvotes": 2,
      "replies": {}
    }
  }
}