{
  "sid": "q9gv31",
  "link": "/r/ApplyingToCollege/comments/q9gv31/need_help_on_which_school_i_should_consider_high/",
  "title:": "Need help on which school I should consider (High School)",
  "text": "Ok so I am not sure on whether this is the correct subreddit but I would think this would reach the correct people with the most reasonable answers. So I am currently a sophomore attending a school ranked top 5 in New Jersey and is considered a top STEM school. To get into this school I had to take tests and they take the best of each county/ district. The last year and a half I have attended this school I have felt it is not for me, it lacks social aspect considering it is all nerds and the friends I have don't really feel like the people I like. Because of this I have considered going back to my home high school which is far from being considered the best, but has a IB program similar to the magnet school and has a high school experience with all my friends for the past 10 years attending it. Although it is foolish of me to choose a school because of its high school experience I just don't feel like the school fits me, what I also don't want it is regret I am doing well at the magnet school with being top 25ish in the class. So if I decide to transfer back I don't want to miss on opportunities for college as it is ranked well for being prepped for college, but once again high school is only a one time experience. Also I forgot to mention if I were to attend my home high school I would finish valedictorian. Additionally, I want to mention how I feel as if I would have more chances at my home high school i.e more sports, club positions, and more.",
  "author": "OkHandle3955",
  "created": 1634406484,
  "updated": 1634423221,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgvur68": {
      "link": "/r/ApplyingToCollege/comments/q9gv31/need_help_on_which_school_i_should_consider_high/hgvur68/",
      "text": "If you don't like it where you're at, then go back.  So long as you have a full slate of APs available to you it shouldn't matter much.  Bear in mind you'll only have one year to get involved in stuff, though, before you have to start working on applications.  May be limiting.",
      "author": "jayphoward",
      "created": 1634406751,
      "upvotes": 1,
      "replies": {
        "hgvytkn": {
          "link": "/r/ApplyingToCollege/comments/q9gv31/need_help_on_which_school_i_should_consider_high/hgvytkn/",
          "text": ">it where you're at, then go back.  So long as you have a full slate of APs available to you it shouldn't matter much.  Bear in mind you'll only have one year to get involved in stuff, though, before you have to start working on applications.  May be limiting.\n\nThank you I will take it into consideration, I already have a well resume of experience and volunteer hours I just need to take APs and IBs.",
          "author": "OkHandle3955",
          "created": 1634408539,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgvzdur": {
      "link": "/r/ApplyingToCollege/comments/q9gv31/need_help_on_which_school_i_should_consider_high/hgvzdur/",
      "text": "I'm going with Plan B...enjoy being with your friends and having some fun. Life is too short to spend at a school that \"never fits\"...like long underwear!",
      "author": "Radiant-Chipmunk-987",
      "created": 1634408779,
      "upvotes": 1,
      "replies": {}
    }
  }
}