{
  "sid": "qzbqkf",
  "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/",
  "title:": "Going insane",
  "text": "Sometimes I wake up and I'm like yeah I'm getting into my dream school and I'm super confident about it and other days I wake up and I feel like I shouldn't even bother applying cuz I won't even get into my safeties. There is no in between. \nI have good stats, 3.9 uw gpa, pretty strong ECs I think, and probably somewhat good essays I hope. I don't have any aps but I have around 70 college units and I'll graduate with an associates degree (still applying as a freshman). Idek what to think anymore. Applying as a CS major so even at my safeties it might be tough cuz it's super impacted but idk anything about admissions so yeah. I've submitted my safety applications and I'm trying not to think about it so I can finish up my other apps but Im going insane rn. I know my stats should be good enough to get into my safeties and I'm fine going anywhere but part of me keeps thinking that I'm still going to get rejected from everywhere",
  "author": "depressed_oranje",
  "created": 1637551175,
  "updated": 1637687389,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 0.93,
  "comments": {
    "hlljewv": {
      "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hlljewv/",
      "text": "why is this exactly how I feel all the time\n\nit's ok, I spend like 50% of my time thinking \"yea I have a strong chance of getting into my dream school\" and the other 50% thinking \"there's not a chance in hell I'm good enough\"",
      "author": "fortuitous_rain515",
      "created": 1637552868,
      "upvotes": 10,
      "replies": {
        "hllnp3j": {
          "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hllnp3j/",
          "text": "EXACTLY i don't know how to feel about anything anymore cuz some days I'm not worried at all and other days I'm literally just crying instead of doing anything cuz I don't think I'm getting into anywhere I'm applying and I'm just losing it",
          "author": "depressed_oranje",
          "created": 1637555049,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlll5j9": {
      "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hlll5j9/",
      "text": "It depends on the admit rates of the colleges where you’re applying. Did you apply to some colleges which admit 50%+ of their applicants? \n\nAlso, I think it’s a myth that CS programs are impacted. I have heard that this is the case for some public universities in CA but it’s not universally true.",
      "author": "jjhoster",
      "created": 1637553741,
      "upvotes": 2,
      "replies": {
        "hllmyz1": {
          "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hllmyz1/",
          "text": "One of my safeties is SJSU and I just learned today that apparently u need like a 4.0 to get in so uhm. Panic",
          "author": "depressed_oranje",
          "created": 1637554677,
          "upvotes": 1,
          "replies": {
            "hllqyry": {
              "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hllqyry/",
              "text": "I think you need some options outside of CA.",
              "author": "jjhoster",
              "created": 1637556807,
              "upvotes": 1,
              "replies": {
                "hllst15": {
                  "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hllst15/",
                  "text": "Cant leave sadly",
                  "author": "depressed_oranje",
                  "created": 1637557892,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hllpfry": {
      "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hllpfry/",
      "text": "Apply to a college with rolling admission and/or with automatic admission criteria. You'll hear back pretty soon and it'll relieve a lot of stress.",
      "author": "a12435",
      "created": 1637555956,
      "upvotes": 2,
      "replies": {
        "hllsx28": {
          "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hllsx28/",
          "text": "Yeah I probably should. Do you by any chance have any recommendations? I know almost nothing about anything so I'm gonna have to do some research",
          "author": "depressed_oranje",
          "created": 1637557958,
          "upvotes": 1,
          "replies": {
            "hlmunme": {
              "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hlmunme/",
              "text": "Texas A&M is a good school with rolling admissions.",
              "author": "LazerSn0w",
              "created": 1637586618,
              "upvotes": 1,
              "replies": {}
            },
            "hlnap9q": {
              "link": "/r/ApplyingToCollege/comments/qzbqkf/going_insane/hlnap9q/",
              "text": "Arizona State and University of Arizona are solid choices. I got my decision back from ASU about a week after I submitted! They also have merit scholarships for out of state students.\n\nIf you're interested, you might also consider the United Kingdom. Aside from Oxford / Cambridge, British universities are rolling and will probably give you a decision in about a month or so. The focus there is on AP scores more than anything else. I applied to St. Andrews, Durham, UCL, and LSE. Keep in mind, however, that you do need to choose a specific subject to apply for, and it's not nearly as flexible as the US when it comes to changing majors after you're in college.",
              "author": "a12435",
              "created": 1637594578,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}