{
  "sid": "r2wipp",
  "link": "/r/ApplyingToCollege/comments/r2wipp/publishing_research_fast/",
  "title:": "publishing research (fast)",
  "text": "I’ve been on this sub all year, worrying about not having groundbreaking extracurriculars or the standard NPO/research paper models. before this sub I was genuinely not even aware that high school students could possibly publish research. \n\nI was looking through old files just now, and I made the discovery that I actually *have* written a research paper. I wrote one for my global perspectives class in 2020, but it ended up not being officially assessed because of covid and it’s been sitting on my computer ever since. I’ve just been reading it and it really isn’t bad. it has something to do with sociology/media. \n\nit’s obviously a very inconvenient point in time to remember this. I have already submitted my ed application, and rd deadlines are in january. my question is, is there possibly anything I can do with this paper in the limited time I have left? do you know any platforms or journals that publish high school research that could get back to me soon enough? I know the answer tends towards the negative but I would really appreciate any advice.",
  "author": "saintvellum",
  "created": 1637959915,
  "updated": 1638205799,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.57,
  "comments": {
    "hm7j1he": {
      "link": "/r/ApplyingToCollege/comments/r2wipp/publishing_research_fast/hm7j1he/",
      "text": "no, if u do findd something it would be not very good anyway",
      "author": "apushnig",
      "created": 1637967959,
      "upvotes": 7,
      "replies": {
        "hm8ypdf": {
          "link": "/r/ApplyingToCollege/comments/r2wipp/publishing_research_fast/hm8ypdf/",
          "text": "yeah, I suppose so. thank you for your answer:)",
          "author": "saintvellum",
          "created": 1637995922,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm899hn": {
      "link": "/r/ApplyingToCollege/comments/r2wipp/publishing_research_fast/hm899hn/",
      "text": "tbh if you wrote it for a class it probably won't be good enough to publish in a real journal. Being up to date with the lit and finding a novel problem as well as having the analytical skills to answer it are just not there for hs students unmentored especially without dedicated months towards their research. That being said publication in legitimate journals takes a long time (months), I have had works ranging from 4 months to a year and in between",
      "author": "CH3OH-CH2CH3OH",
      "created": 1637981103,
      "upvotes": 4,
      "replies": {
        "hm8ynd4": {
          "link": "/r/ApplyingToCollege/comments/r2wipp/publishing_research_fast/hm8ynd4/",
          "text": "it was more like a project to be completed by the end of 2-3 years rather than just a class assignment and i did put months of work and research into it. but yes, I figured that publishing is not quite so simple, thank you for your insight!",
          "author": "saintvellum",
          "created": 1637995883,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}