{
  "sid": "qse9e7",
  "link": "/r/ApplyingToCollege/comments/qse9e7/college_admissions_question/",
  "title:": "College admissions question",
  "text": "So I took a gap year due to Covid and decided to apply for college next year in fall and was wondering would they be using my highschool gpa or do I have to take the sat I graduated in June of this year",
  "author": "Oceanstreasure",
  "created": 1636732725,
  "updated": 1636745321,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkcle34": {
      "link": "/r/ApplyingToCollege/comments/qse9e7/college_admissions_question/hkcle34/",
      "text": "You will need to submit your GPA\n\nSee the SAT policies of individual schools as well as the A2C FAQ for questions about submitting test scores",
      "author": "freeport_aidan",
      "created": 1636734934,
      "upvotes": 2,
      "replies": {}
    },
    "hkclqsd": {
      "link": "/r/ApplyingToCollege/comments/qse9e7/college_admissions_question/hkclqsd/",
      "text": "You graduated in June 2021 and you are hoping to start college in fall 2022?\n\nYes, they would use your high school GPA. Your high school transcript is the most important part of your application (assuming you are a freshman applicant and have not taken college classes after high school graduation).\n\nYes, you should take the SAT or ACT if you can. Many colleges are test optional, though having a score may still be beneficial if it is high enough compared to the score ranges published by the college. However, if you are looking at colleges with January deadlines (that is, most selective colleges), the time to register for the December test date is rapidly closing.\n\n**To do ASAP:**\n\n\\- Make a list of colleges you are interested in and their deadline options.\n\n\\- Look at their acceptance rates for a rough idea of whether they are competitive for admission. [https://nces.ed.gov/collegenavigator/](https://nces.ed.gov/collegenavigator/)\n\n\\- Run the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based financial aid estimate before you apply.\n\n\\- If you are trying to meet January deadlines, consider trying to take SAT or ACT in December. Register on the College Board or ACT websites. See r/Sat, r/ACT. There are official practice tests available online, free, to help you determine which one you should take. The late registration deadline for the December SAT is Nov 23 [https://collegereadiness.collegeboard.org/sat/register/dates-deadlines](https://collegereadiness.collegeboard.org/sat/register/dates-deadlines)\n\nIf the colleges you are interested in are less selective, perhaps you will find that they have late deadlines, which would allow you to take the March SAT. A good score can be useful for merit scholarships as well as admission.",
      "author": "elkrange",
      "created": 1636735075,
      "upvotes": 2,
      "replies": {}
    }
  }
}