{
  "sid": "q5askr",
  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/",
  "title:": "r/chanceme is really something",
  "text": "just saw a commenter say that they were unsure about applying to dartmouth and cornell because the acceptance rates were high… HUH??",
  "author": "skysoupie",
  "created": 1633881596,
  "updated": 1634072916,
  "over_18": false,
  "upvotes": 553,
  "upvote_ratio": 0.99,
  "comments": {
    "hg47sgu": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg47sgu/",
      "text": "Every day is “Shitpost Wednesday“ over there.",
      "author": "Strict-Special3607",
      "created": 1633881968,
      "upvotes": 501,
      "replies": {
        "hg5md42": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5md42/",
          "text": "fr. if the kids on that sub have this little understanding of statistics, i'm not that confident in their chances at any t20s.",
          "author": "skysoupie",
          "created": 1633903064,
          "upvotes": 93,
          "replies": {}
        },
        "hg5mgjc": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5mgjc/",
          "text": "This post actually wins the internet.",
          "author": "BuffsBourbon",
          "created": 1633903108,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "hg4a2ji": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4a2ji/",
      "text": "its a whole circus over there",
      "author": "wlwhy",
      "created": 1633882979,
      "upvotes": 75,
      "replies": {}
    },
    "hg4ccdx": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4ccdx/",
      "text": "After I apply I'm going to post there just for fun so I can compare my results to what they predict. I suspect they'll call my pretty decent ECs weak, tell me my 1540 SAT is too low, call me an idiot for taking choir for 4 years which lowered my GPA minimally, and tell my I have no chance at my safeties.\n\nTLDR: Don't go on r/chanceme looking for actual advice. It's filled with unqualified high schoolers looking for an ego boost.",
      "author": "FuriousGeorge1435",
      "created": 1633883974,
      "upvotes": 279,
      "replies": {
        "hg4hrhd": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4hrhd/",
          "text": "Someone should post there after they get a full scholarship to MIT and see how many people grade them to only be fit for community college",
          "author": "uhbububub",
          "created": 1633886299,
          "upvotes": 144,
          "replies": {
            "hg4ro4n": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4ro4n/",
              "text": "My friend did this for UChicago and half of the kids told him that he should consider more safeties lmfao that place is a zoo",
              "author": "SwamiTsunami",
              "created": 1633890352,
              "upvotes": 108,
              "replies": {
                "hg5qf7n": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5qf7n/",
                  "text": "Was he an unhooked Asian male in CS from a competitive area?",
                  "author": "CarpetsAreTasty",
                  "created": 1633904894,
                  "upvotes": 31,
                  "replies": {
                    "hg5wtni": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5wtni/",
                      "text": "lmaooo I feel attacked",
                      "author": "ritzzzcrackers",
                      "created": 1633907757,
                      "upvotes": 5,
                      "replies": {
                        "hg6pah5": {
                          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6pah5/",
                          "text": "me too lol",
                          "author": "CompetitiveTable1",
                          "created": 1633921821,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hg4u7c8": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4u7c8/",
                  "text": "I mean, that's not necessarily wrong. Even though he got into UChicago, he couldn't have known that would happened before he applied and should've had at least 1-2 safeties. \n\nNow if he already had some safeties then that's another story lol and r/chanceme proves to be incompetent yet again.",
                  "author": "FuriousGeorge1435",
                  "created": 1633891396,
                  "upvotes": 40,
                  "replies": {
                    "hg4ueu8": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4ueu8/",
                      "text": "Yeah he did my original comment wasn’t very clear, what I meant was that they were saying his stats (which were excellent) wouldn’t even get him considered, therefore he should consider his safeties more seriously",
                      "author": "SwamiTsunami",
                      "created": 1633891481,
                      "upvotes": 35,
                      "replies": {
                        "hg4zgn5": {
                          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4zgn5/",
                          "text": "Bruh",
                          "author": "PsychologicalSwan0",
                          "created": 1633893565,
                          "upvotes": 9,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hg522mm": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg522mm/",
              "text": "I did this after getting into UC Berkeley.\nThey told me I was aiming too high and that my profile was too standard.",
              "author": "rtdesai20",
              "created": 1633894646,
              "upvotes": 25,
              "replies": {}
            },
            "hg5rmrp": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5rmrp/",
              "text": "MIT doesn't give scholarships. If you get a full ride to MIT you are probably low-income or underprivileged in some other way, which is a huge boos to your application.",
              "author": "CarpetsAreTasty",
              "created": 1633905430,
              "upvotes": 2,
              "replies": {
                "hg5vj7p": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5vj7p/",
                  "text": "I know I was making a point",
                  "author": "uhbububub",
                  "created": 1633907175,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hg4hlap": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4hlap/",
          "text": "Lmao imma do the same",
          "author": "ultraprogger",
          "created": 1633886227,
          "upvotes": 13,
          "replies": {}
        },
        "hg4q1is": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4q1is/",
          "text": "What’s important in chanceme is to take the advice from the private admissions consultants if you can. \n\nDoing that would give you a much more accurate chance.",
          "author": "Berkeley_Simp",
          "created": 1633889682,
          "upvotes": 10,
          "replies": {
            "hg4uamc": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4uamc/",
              "text": "How many private admissions consultants actually are there on that sub though?",
              "author": "FuriousGeorge1435",
              "created": 1633891433,
              "upvotes": 9,
              "replies": {
                "hg4uns8": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4uns8/",
                  "text": "They probably make like 1/10ths of actual commenters",
                  "author": "Berkeley_Simp",
                  "created": 1633891580,
                  "upvotes": 9,
                  "replies": {
                    "hg4v2ii": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4v2ii/",
                      "text": "I didn't know that. I guess there actually is some (rare) helpful content on that sub then.",
                      "author": "FuriousGeorge1435",
                      "created": 1633891748,
                      "upvotes": 5,
                      "replies": {
                        "hg5sapx": {
                          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5sapx/",
                          "text": "I wouldn't go on there regardless. The sub is filled with salty people who couldn't get into any T20's so they just tell everybody else that they'll never get into a T20.",
                          "author": "HeisenbergNokks",
                          "created": 1633905729,
                          "upvotes": 6,
                          "replies": {
                            "hg5tfhq": {
                              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5tfhq/",
                              "text": "Like I said, I'm only gonna make 1 post on there just for fun either after I've applied or once I've already gotten my decisions so I can see how close they get it. Despite the fact that there's apparently some helpful information on there, I still think it's far outweighed by the toxicity, especially if you're a vulnerable high schooler looking for real predictions about their life for the next four years.",
                              "author": "FuriousGeorge1435",
                              "created": 1633906232,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        },
                        "hg4x7r9": {
                          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4x7r9/",
                          "text": "Yeah for sure. You just need to know how to filter it.",
                          "author": "Berkeley_Simp",
                          "created": 1633892642,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hg4oi6k": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4oi6k/",
          "text": "I was gonna do the same thing too 💀",
          "author": "did_i_inquire",
          "created": 1633889061,
          "upvotes": 3,
          "replies": {}
        },
        "hg6atce": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6atce/",
          "text": "i’ve made a post there before and yeah, their “advice” and judgements are garbage.  if i get in to a top school i want to make another post and see what they say my chances are for the school i got into haha, cause i guarantee they would tell me i should consider applying to community college and that even then i’d have a .0001% chance of getting in",
          "author": "cherrycrocs",
          "created": 1633914584,
          "upvotes": 3,
          "replies": {
            "hg6blfr": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6blfr/",
              "text": "Last year my friend made a post for fun just to see what they would say. He was applying as an Indian male to CS with a 1530 SAT and no major spike (other than taking classes in CS at school). Two of his high target/low reach schools were UMD and Northeastern, and he was applying to some higher reaches too. They said he would get into neither and had zero chance at his high reaches needed to lower his expectations. He got waitlisted at most of his high reaches, and not only got into both UMD and NEU but also got sizeable merit aid at both. \n\nr/chanceme is clueless.",
              "author": "FuriousGeorge1435",
              "created": 1633914968,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "hg4sysr": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4sysr/",
          "text": "Yes great idea!",
          "author": "Snoo_62176",
          "created": 1633890889,
          "upvotes": 2,
          "replies": {}
        },
        "hg58pc8": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg58pc8/",
          "text": "[deleted]",
          "author": null,
          "created": 1633897285,
          "upvotes": 2,
          "replies": {
            "hg5s1un": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5s1un/",
              "text": "Cope, most of it is completely real. That is the caliber of most T20 applicants; they are the people you'll be competing against.",
              "author": "CarpetsAreTasty",
              "created": 1633905615,
              "upvotes": -7,
              "replies": {
                "hg5vi1p": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5vi1p/",
                  "text": "Dog you’re a junior, settle tf down. A majority most definitely exaggerate what they do at the least, that’s just how it is, if not flat out lie. You don’t have to be an internationally recognized student to get into a T20",
                  "author": "pumpkin123_",
                  "created": 1633907159,
                  "upvotes": 9,
                  "replies": {}
                },
                "hg5x9ko": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5x9ko/",
                  "text": "my man,,, please go touch some grass until next year. none of us are on this sub to listen to some junior promote his insane ideas about hypsm.",
                  "author": "skysoupie",
                  "created": 1633907956,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "hg5r2t8": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5r2t8/",
          "text": "No, chanceme is actually a great place, in fact I think it is usually too nice and overestimates your chances. They should be even harsher to be more realistic.\n\nThe thing is though, a lot of what's \"good\" and what's \"bad\" depends on your demographics, even when you have no hooks. If you are an unhooked white male in humanities, for instance, then a 1540 on the SAT is a great score; on the other hand, if you are an unhooked Asian male in CS from the Bay Area, then anything below 1580 is garbage. People like me cannot afford to score a 1540 on the SAT or take 4 years of choir. Even supposedly \"strong\" ECs like USAMO or research with a professor don't guarantee us anywhere. So just think of the standards from the perspective of an unhooked Asian male in CS from a competitive magnet school in a competitive area, and it will make more sense.",
          "author": "CarpetsAreTasty",
          "created": 1633905185,
          "upvotes": -11,
          "replies": {
            "hg5t1cv": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5t1cv/",
              "text": ">if you are an unhooked Asian male in CS from the Bay Area, then anything below 1580 is garbage. People like me cannot afford to score a 1540 on the SAT or take 4 years of choir.\n\nYeah, see, this is just not true. Once you get past a certain threshold, say a 1520, any increase to your SAT will barely help you at all, even compared to other Asian Bay Area CS applicants. And 4 years of choir instead of 4 years of study halls helps you more than it hurts you; it shows involvement in your school community and an interest (and talent if you reach a high level) in something, however unrelated to your it may be. \n\n>Even supposedly \"strong\" ECs like USAMO or research with a professor don't guarantee us anywhere.\n\nOf course it doesn't. The rest of your application needs to be good, too, and most essays just aren't. And while most LORs are decent, since no teacher is going to write an actively negative one, few are very helpful to the student because most students don't connect with their teachers on a personal level and instead just do well in their class and expect a bomb LOR. People vastly overestimate the quality of their essays and LORs, so when they don't get in, they start blaming their stats and ECs instead.",
              "author": "FuriousGeorge1435",
              "created": 1633906058,
              "upvotes": 8,
              "replies": {
                "hg5tn3k": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5tn3k/",
                  "text": ">And 4 years of choir instead of 4 years of study halls helps you more than it hurts you\n\nBut 4 years of choir is worse than 4 more AP classes, and 90+% of your school is stacking as many APs as possible.\n\n>People vastly overestimate the quality of their essays and LORs, so when they don't get in, they start blaming their stats and ECs instead.\r  \n\r\n\nI agree people vastly overestimate the quality of their essays/LORs, but people also vastly overestimate the importance of them. Essays and LORs only make a difference in the edge cases where they truly stand out.",
                  "author": "CarpetsAreTasty",
                  "created": 1633906328,
                  "upvotes": -8,
                  "replies": {
                    "hg5utic": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5utic/",
                      "text": ">But 4 years of choir is worse than 4 more AP classes, and 90+% of your school is stacking as many APs as possible.\n\nThis is where we disagree. If the extra AP classes are very major-related, then fine, but adding AP World History in 9th grade instead of choir when you're going a CS major isn't going to do much for you, especially if your school has a strong and well-known choir program. \n\n>people also vastly overestimate the importance of them. Essays and LORs only make a difference in the edge cases where they truly stand out.\n\nThis is self-contradictory. They're not important, but they can make a student truly stand out? Plus, when students are so close in stats, they're not going to look for which student's SAT is 20 points higher, or which student did slightly better in USAMO. No, they're going to look at the essays and LORs and see which student they want at their school. If neither student has very good essays or LORs, then unless their ECs/awards are out of this world (even more so than the typical Asian Bay Area CS applicant), then neither will get in.",
                      "author": "FuriousGeorge1435",
                      "created": 1633906859,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hg4b5qn": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4b5qn/",
      "text": "As a rule of thumb never I NEVER go on that subreddit",
      "author": "Tiko1787",
      "created": 1633883458,
      "upvotes": 47,
      "replies": {}
    },
    "hg4qx25": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4qx25/",
      "text": "One time the official FSU account commented on my chanceme telling me to apply lmao",
      "author": "spacelemonadecadet",
      "created": 1633890045,
      "upvotes": 43,
      "replies": {
        "hg574x1": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg574x1/",
          "text": "Did you?",
          "author": "Messyace",
          "created": 1633896660,
          "upvotes": 5,
          "replies": {
            "hg57awa": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg57awa/",
              "text": "Mahh fuck fsu",
              "author": "spacelemonadecadet",
              "created": 1633896726,
              "upvotes": 22,
              "replies": {
                "hg5fqt5": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5fqt5/",
                  "text": "menace",
                  "author": "murpalim",
                  "created": 1633900201,
                  "upvotes": 12,
                  "replies": {}
                },
                "hg6bbv2": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6bbv2/",
                  "text": "u/FSUAdmissions",
                  "author": "SozinsComet1",
                  "created": 1633914845,
                  "upvotes": 5,
                  "replies": {
                    "hg6nmqs": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6nmqs/",
                      "text": ">u/FSUAdmissions\n\nMadlad",
                      "author": "Proud-Pie3557",
                      "created": 1633920931,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "hg6ocdo": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6ocdo/",
                  "text": "i'm applying :(",
                  "author": "MileyMelays",
                  "created": 1633921309,
                  "upvotes": 0,
                  "replies": {
                    "hg6of0e": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6of0e/",
                      "text": "🐊🐊🐊",
                      "author": "spacelemonadecadet",
                      "created": 1633921348,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hg50mfs": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg50mfs/",
      "text": "My Indian parents: You sure you really want to consider \\_\\_\\_\\_\\_\\_? Their acceptance rate is higher than 30%",
      "author": "Code_sucks",
      "created": 1633894050,
      "upvotes": 29,
      "replies": {
        "hg7qn3s": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg7qn3s/",
          "text": "My parents with ANY college that isn't fucking HYPSM or an Ivy :/",
          "author": "Feels_Bad_Man19",
          "created": 1633949518,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hg5mqwh": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5mqwh/",
      "text": "Like: Chance me with MEDIOCRE STATS\n\nThe stats: GPA: 5/5        SAT: 1650/1600",
      "author": "Zestyclose-Suit-5307",
      "created": 1633903242,
      "upvotes": 20,
      "replies": {}
    },
    "hg4mtgy": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4mtgy/",
      "text": "Only go on chanceme if you’re a masochist.",
      "author": "I_Fuck_Watermelons_",
      "created": 1633888367,
      "upvotes": 20,
      "replies": {}
    },
    "hg4d1if": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4d1if/",
      "text": "Bro some guy had better stats than me and was trying to get into Vermont. Like, is that the type of school I should be going to what??",
      "author": "mac_swagger",
      "created": 1633884281,
      "upvotes": 47,
      "replies": {
        "hg4g4x4": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4g4x4/",
          "text": "Why is Charles the second of Spain your profile pic😭",
          "author": "HistoryIsDaBest123",
          "created": 1633885620,
          "upvotes": 30,
          "replies": {
            "hg4g8ss": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4g8ss/",
              "text": "Cuz he’s funny looking lmfao🤣",
              "author": "mac_swagger",
              "created": 1633885663,
              "upvotes": 49,
              "replies": {
                "hg4gg0g": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4gg0g/",
                  "text": "He was arguably the ugliest person ever😫",
                  "author": "HistoryIsDaBest123",
                  "created": 1633885747,
                  "upvotes": 10,
                  "replies": {
                    "hg4r0c3": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4r0c3/",
                      "text": "Until I was born",
                      "author": "Pitsuh",
                      "created": 1633890083,
                      "upvotes": 39,
                      "replies": {
                        "hg70821": {
                          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg70821/",
                          "text": "too relatable man",
                          "author": "Vic_is_awesome1",
                          "created": 1633927891,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hg4kzct": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4kzct/",
          "text": "Your chances to Vermont are slim to none, maybe try winning IMO gold or something? ^(/s)",
          "author": "friendsgreenwich_",
          "created": 1633887620,
          "upvotes": 13,
          "replies": {}
        },
        "hg4fvag": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4fvag/",
          "text": "A2C can under (and over) rate themselves to an extent but chanceme is that on steroids, if you don’t have a weighted 4.7 with 12 5’s on your AP’s, no olympiad/hackathon/whatever gold medals, you haven’t started any non profits and you only have a 1510 you’re destined to go to (insert state school/directional state school/community college)",
          "author": "myfedoraismlg",
          "created": 1633885509,
          "upvotes": 29,
          "replies": {
            "hg4hdcc": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4hdcc/",
              "text": "Frankly, they are rude but not too far off. UCLA 75percentile is 4.86 weighted gpa and 1550 SAT in 2019 for OOS. That is for ALL UCLA admits. CS is even ridiculous. It has got even tougher since 2019.",
              "author": "svday",
              "created": 1633886138,
              "upvotes": 15,
              "replies": {
                "hg4oqsg": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4oqsg/",
                  "text": "The GPA part is kinda valid, but they really overestimate the ECs part. You don’t need to be an international Chem Olympiad champion to get into HYPSM.",
                  "author": "did_i_inquire",
                  "created": 1633889157,
                  "upvotes": 14,
                  "replies": {
                    "hg5swbi": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5swbi/",
                      "text": "I don't think they overestimate ECs either, it's just that the competition is truly fucking brutal out there. Sure you don't need to be on an international olympiad team to make HYPSM, but if you don't have an olympiad camp then you'll need something like 3x USAMO + USACO Plat + 2x USAPhO + ISEF finalist, and even that is in many cases not good enough for HYPSM.",
                      "author": "CarpetsAreTasty",
                      "created": 1633905997,
                      "upvotes": -9,
                      "replies": {
                        "hg60ksj": {
                          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg60ksj/",
                          "text": "Nope.\n\nYou’re making the invalid assumption that the USAMO/ISEF/etc. competitors who get rejected from HYPSM get tossed for not being “good enough” academically.\n\nFrom the limited stuff I know about college admissions, that’s generally not why. If you can’t convey that you’re a genuine “people” person in your applications, someone who’s got the potential to do amazing things in the world, you’re likely not getting in. \n\nBeing able to solve tough math and chemistry problems is impressive, but there’s little reason for a university like Harvard to accept an Olympiad champion if they don’t think they can make a meaningful impact on campus.\n\nAlso, AOs are people, too. I’d rather take a 1500, 3.9 GPA kid who’s mature and seems like a fun guy than a 1600 4.0 Olympiad robot with limited interests outside of niched math competitions.",
                          "author": "did_i_inquire",
                          "created": 1633909508,
                          "upvotes": 8,
                          "replies": {
                            "hg9zlvh": {
                              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg9zlvh/",
                              "text": "Why does this dumb circlejerk constantly get repeated? Aside from your stats and ECs/awards, all colleges have to work with are your essays and rec letters. Do you seriously think a student's carefully edited 500-word essay written over several months that's been looked at by a college consultant says anything about what they are actually like? And virtually every rec letter says that the student is mature and pleasant to be around, or something along those lines. As long as you are a somewhat normal person, colleges literally can't tell how \"mature\" or \"fun to be around\" you are.\n\n&#x200B;\n\n>Also, AOs are people, too. I’d rather take a 1500, 3.9 GPA kid who’s mature and seems like a fun guy than a 1600 4.0 Olympiad robot with limited interests outside of niched math competitions.\n\nBut you are not an AO. If AOs thought like you, then T20s should be filled with popular, attractive, well-rounded kids, and yet these \"olympiad robots\" tend to be the most successful in college admissions.",
                              "author": "CarpetsAreTasty",
                              "created": 1633987602,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hg4i1ai": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4i1ai/",
                  "text": "No you’re right there (especially for the CS applicants), it’s just annoying to see people with very solid stats constantly shot down or made to think they have no chance of getting into a top 50 or acting like their lives and career aspirations are over because they only got into a t100 instead",
                  "author": "myfedoraismlg",
                  "created": 1633886414,
                  "upvotes": 10,
                  "replies": {
                    "hg5st84": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5st84/",
                      "text": "I don't know why people even go on that sub. Out of that entire sub, less than 1% probably go to T20's.",
                      "author": "HeisenbergNokks",
                      "created": 1633905959,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hg4q85d": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4q85d/",
                  "text": "You’re right, and UCLA isn’t even flagship California for CS. Imagine how Berkeley would be like.",
                  "author": "Berkeley_Simp",
                  "created": 1633889759,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "hg4yarn": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4yarn/",
          "text": "I really wanna go to Vermont lol",
          "author": "gouverneurmroosevelt",
          "created": 1633893087,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hg5l3fj": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5l3fj/",
      "text": "Seriously though, search “COMMON DATA SET xxx” (xxx being the college name). Scroll through that and it will tell you exactly what’s important to them - GPA, class rank, essay, ECs, work experience, etc.  It will tell what percent got accepted with with gpa breakdown, SAT/ACT breakdown. Demographics, financial aid numbers.  All of it.  It’s actually fascinating.Theeeen, you can chanceme yourself and not have to deal with that sub clown show.",
      "author": "BuffsBourbon",
      "created": 1633902495,
      "upvotes": 12,
      "replies": {}
    },
    "hg4nuwx": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4nuwx/",
      "text": "Would I even survive if I post my SAT score of 1390 in that sub",
      "author": "srir007",
      "created": 1633888795,
      "upvotes": 33,
      "replies": {
        "hg4r8dg": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4r8dg/",
          "text": "They usually ignore people with “low scores ” (1390 isn’t low) unless they’re asking to chance for T20s",
          "author": "Pitsuh",
          "created": 1633890175,
          "upvotes": 31,
          "replies": {
            "hg4s4y6": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4s4y6/",
              "text": "Posting on chanceme is feeding insecure sharks.",
              "author": "tripletim",
              "created": 1633890540,
              "upvotes": 27,
              "replies": {}
            },
            "hg5mc95": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5mc95/",
              "text": "bro i have a 1280 and that’s like 93rd percentile that place is nuts",
              "author": "perr62",
              "created": 1633903053,
              "upvotes": 3,
              "replies": {
                "hg5swsf": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5swsf/",
                  "text": "The 90th percentile is 1350. Wdym?",
                  "author": "HeisenbergNokks",
                  "created": 1633906003,
                  "upvotes": 2,
                  "replies": {
                    "hg67lfo": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg67lfo/",
                      "text": "Thats not true, sat percentiles are constant and a 1280 is 90th percentile, 1350 would like 95th",
                      "author": "yourmomgetsthebullet",
                      "created": 1633913001,
                      "upvotes": 1,
                      "replies": {
                        "hg67uen": {
                          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg67uen/",
                          "text": "SAT percentiles are not constant. That literally makes no sense. [https://blog.prepscholar.com/sat-percentiles-and-score-rankings](https://blog.prepscholar.com/sat-percentiles-and-score-rankings)",
                          "author": "HeisenbergNokks",
                          "created": 1633913127,
                          "upvotes": 2,
                          "replies": {
                            "hg68m78": {
                              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg68m78/",
                              "text": "My bad, It used to be that the score you got was connected to percentile do if someone got a certain score it was automatically connected to that percentile. So like a 1500  would always be x percentile which was some number above 1400 that was y percentile, unlike the test now thats scored like any other test.",
                              "author": "yourmomgetsthebullet",
                              "created": 1633913503,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hg56yke": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg56yke/",
          "text": "I would be dead as soon as I posted the fact that my SAT score is under 1000",
          "author": "Messyace",
          "created": 1633896588,
          "upvotes": 8,
          "replies": {}
        },
        "hg4yizo": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4yizo/",
          "text": "I posted my 1340 score and just one guy go \"Think you got a good shot!\" \n\nLuckily I'm just applying to the Public Ivy's +safety, not any crazy T20 stuff, so no one jumped to tell me I should consider community college instead or whatever.",
          "author": "gouverneurmroosevelt",
          "created": 1633893181,
          "upvotes": 1,
          "replies": {}
        },
        "hg5rw1f": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5rw1f/",
          "text": "I mean you are screwed for T20s (assuming you are unhooked), but you still have a good shot at T50s. If you post there thinking you have a chance at HYPSM of course you'll be eviscerated, but if your list is reasonable then I think you'll get a better response.",
          "author": "CarpetsAreTasty",
          "created": 1633905542,
          "upvotes": -4,
          "replies": {}
        }
      }
    },
    "hg4ofsh": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4ofsh/",
      "text": "Either ChanceMe is full of people who seek validation by lying to internet strangers about their EC’s, or it’s full of non-profit founding, business-owning, research-publishing, prestige-obsessed robots who are superior to me in every way. Both possibilities are equally depressing.",
      "author": "Sandyman321",
      "created": 1633889034,
      "upvotes": 33,
      "replies": {}
    },
    "hg4y3wy": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4y3wy/",
      "text": "I went there to genuinely ask about my UVM chances and my friend personally sent me to hell",
      "author": "gouverneurmroosevelt",
      "created": 1633893008,
      "upvotes": 7,
      "replies": {}
    },
    "hg57h1v": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg57h1v/",
      "text": "Based. Don't want to get accidentally accepted into Dartmouth and out $40K when you could go to your great state school for $10K.",
      "author": "schizoanalyste",
      "created": 1633896788,
      "upvotes": 8,
      "replies": {
        "hg5febc": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5febc/",
          "text": "plot twist: r/chanceme is actually giving kids good financial advice by discouraging them from applying to expensive privates and getting hella merit scholarships from state schools instead",
          "author": "calabash_bro",
          "created": 1633900051,
          "upvotes": 24,
          "replies": {
            "hg5g1na": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5g1na/",
              "text": "ik this isnt really the place to ask this, but who in the world is paying more for privates than their state school? My state school is gonna cost me 30,000 a year, and OOS privates are *significantly* less...so whats the deal am i a special case or something?",
              "author": "ExcellentMention4114",
              "created": 1633900332,
              "upvotes": 5,
              "replies": {
                "hg5hpbc": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5hpbc/",
                  "text": "Same here! Wanting to know this too!",
                  "author": "AccelerDragon",
                  "created": 1633901040,
                  "upvotes": 4,
                  "replies": {
                    "hg5lj9o": {
                      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5lj9o/",
                      "text": "fr i might make a post,  i have lots to say lol",
                      "author": "ExcellentMention4114",
                      "created": 1633902691,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hg5lvux": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5lvux/",
                  "text": "depends on your parents' income bracket and which state you live in ig! middle-class applicants to top schools may not qualify for much need-based aid or merit aid, but lesser-known state schools (not the UCs, UNC, UW, etc.) are willing to pay a lot to get these students to attend even if they're oos. there are state schools that offer full tuition + subsidies for nmfs, while national merit is a dime a dozen at some top privates. i'm paying quite a bit for my private school, but my state school would've cost me nearly nothing.",
                  "author": "calabash_bro",
                  "created": 1633902849,
                  "upvotes": 5,
                  "replies": {}
                },
                "hg5om77": {
                  "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5om77/",
                  "text": "Anyone whose parents make more than \\~$200k/yr combined will most likely pay more for OOS privates (\\~$75k/yr) than in-state (\\~$28-40k/yr).  That's essentially the majority of homeowners in the SF Bay Area.",
                  "author": "the3twins",
                  "created": 1633904090,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg5ym1y": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5ym1y/",
      "text": "My favorite posts are the, “wHaT sChOOlS HaVe ThE HiGHeST Ed RaTeS?” Like no dude.",
      "author": "simpin4colby",
      "created": 1633908583,
      "upvotes": 4,
      "replies": {}
    },
    "hg4m8bm": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg4m8bm/",
      "text": "I literally get those posts on my feed even tho I’m not in the subreddit cus it says “similar to r/applyingtocollege on top😭",
      "author": "imnotokaylol_",
      "created": 1633888127,
      "upvotes": 7,
      "replies": {}
    },
    "hg636u6": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg636u6/",
      "text": "The place is just like SDN. I'm telling you right now for your sanity, stay away.",
      "author": "FatwaHitmensch",
      "created": 1633910785,
      "upvotes": 2,
      "replies": {}
    },
    "hg6v5db": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6v5db/",
      "text": "Hijacking this cause I'm newer to the sub, where do I go for actually decent chanceme feedback? What does the reverse chanceme thing on here mean?",
      "author": "wwiibuff44",
      "created": 1633924999,
      "upvotes": 2,
      "replies": {
        "hg6wfrh": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6wfrh/",
          "text": "reverse chanceme = you give info about your stats and what you're looking for in a college and we recommend schools for you to look into. as opposed to chanceme where you give stats and schools you're planning to apply to and we \"predict\" (read: completely make up) your chances at being accepted.\n\nimo chancemes are irrelevant because if you have a solid college list, you should put your all into the apps regardless of what other randos think your chances are. but if you really want the feedback ig you could do what someone else on this post recommended and listen to the college consultants on your chanceme and tune out everyone else.",
          "author": "skysoupie",
          "created": 1633925709,
          "upvotes": 4,
          "replies": {}
        },
        "hgcifqq": {
          "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hgcifqq/",
          "text": "Also, it’s just the opinions of a bunch of high school seniors…sooooo",
          "author": "BuffsBourbon",
          "created": 1634042169,
          "upvotes": 2,
          "replies": {
            "hgcisbs": {
              "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hgcisbs/",
              "text": "yeah ofc. Need to calm my nerves a bit about it. Wanna see if other people think I'm cut out for the colleges I'm chosing (taking it with a grain of salt ofc)",
              "author": "wwiibuff44",
              "created": 1634042370,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg5sq6u": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5sq6u/",
      "text": "Bruh",
      "author": "Acelord12",
      "created": 1633905921,
      "upvotes": 1,
      "replies": {}
    },
    "hg5ui3z": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5ui3z/",
      "text": "I read commoner instead of commenter for a second..",
      "author": "dezdance",
      "created": 1633906715,
      "upvotes": 1,
      "replies": {}
    },
    "hg69sh2": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg69sh2/",
      "text": "JUST WTF",
      "author": "Capable-Ad1621",
      "created": 1633914079,
      "upvotes": 1,
      "replies": {}
    },
    "hg6djue": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg6djue/",
      "text": "That’s why I left",
      "author": "TheGrayGraphite",
      "created": 1633915896,
      "upvotes": 1,
      "replies": {}
    },
    "hg718j8": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg718j8/",
      "text": "Wow, the comments posted here are making me realise the reality of chanceme as something else. Lmao I am new to this and have been relying so much on the comments I I received there. Anyway, I'll only know on decision day, no harm in applying ig.",
      "author": "anzasivial1",
      "created": 1633928532,
      "upvotes": 1,
      "replies": {}
    },
    "hg5oyof": {
      "link": "/r/ApplyingToCollege/comments/q5askr/rchanceme_is_really_something/hg5oyof/",
      "text": "I mean they probably just meant the other way round but yeah funny post i guess",
      "author": "boooogier",
      "created": 1633904249,
      "upvotes": -1,
      "replies": {}
    }
  }
}