{
  "sid": "qk8vm7",
  "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/",
  "title:": "Admissions Counseling (IvyCoach)",
  "text": "I'm new to Reddit and don't know how flairs work and I can't find the one that labels this as a rant. I'm about to write about an experience I had while looking for a college counselor. Full disclosure: yes, I was willing to pay thousands of dollars for someone to work one-on-one with me to make my college app more competitive. In retrospect, is it a smart use of money or really necessary? Maybe not for me. It was definitely a huge help, and for a lot of people it is the right decision, but I'm not so sure if it's worth the price tag in my personal case.\n\nOnto the main point of this post: IvyCoach. I'm sure at least some of you have heard of it, namely for the price tag on its \"Unlimited Package\" ($100k+, and the organization's website is unashamed of clarifying that it can be far higher). I'm sure IvyCoach has done much to earn both its reputation and its profit margin, and I have no doubt that if you do choose to pay six figures for college counseling, you will be receiving the best of the best in terms of guidance.\n\nMy family scheduled a meeting with IvyCoach - the free 20 minute introduction. To clarify, we had no intention of paying 6 figures for college counseling. My parents do very well in life, with advanced degrees and stable, well-paying jobs. But there was no chance we would pay that much. We would consider one of their less encompassing packages, but mostly, we were curious to see what the best of the best had to offer.\n\nWe met with Jayson Weingarten. He's pretty high-ranking at IvyCoach, having a place on the leadership page of the website as well as participating in a few high-profile interviews. From the very start, it was clear he had no interest in us as clients. Not surprising, given the fact it was fairly obvious to both sides that we would not be paying the big bucks. I, a junior at the time, asked what could be done to strengthen an applicant in the eyes of admissions. The response? \"You should have started earlier.\" \"Is there any benefit to taking the ACT and the SAT?\"  \"No why would you do that.\" 20 minutes of conversation with a person who clearly did not want to be there and was unafraid to show it. Arrogant and stonewalling.\n\nIt's not lost on me that college admissions is ultimately a test of wealth. I can afford to pay hundreds of dollars for the SAT and AP tests. Someone two or three income brackets up can afford to pay six figures to get into college and six figures more to finish it. Not really fair, but that's how the world works. And I realize how whiny and entitled this rant seems: \"Wahh wahh my parents have money and this random guy didn't give me the respect I deserved.\" My point in writing all this? I was mildly annoyed and decided today would be a good day to discuss it at length. But beyond that, I think this is a pretty hilarious example of just how stratified college admissions have become and the attitudes of people at the very top.",
  "author": "anonymoush144",
  "created": 1635751933,
  "updated": 1636165703,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.87,
  "comments": {
    "hivs89c": {
      "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hivs89c/",
      "text": "\"the attitudes of people at the very top.\"  \nWhile I agree that he (or anyone else) might be financially elite, I don't think money is the factor with which I would classify society with. (in the event I'm classifying at all heh)  \n\n\nCause no businessman worth their salt discriminates a client based on their appearance and his initial willingness to buy a product. A dollar is still a dollar despite where it's from ;)",
      "author": "ImaybeObama",
      "created": 1635774027,
      "upvotes": 1,
      "replies": {}
    },
    "hiwlz4x": {
      "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiwlz4x/",
      "text": "I'm sorry you had a bad experience. As someone else said, I think these firms really do pull from already-mega-prepared pools of students in order to protect their success rates. Hate that.\n\nCollege consulting is a pricey / inequitable industry, but even I kinda bought the ideology that more expensive services / firms are also **better**, somehow.\n\nBut I just had an experience where a student left one of the elite megafirms because they weren't getting quality support. I looked over their drafts and the comments were... they were terrible. So, so low quality. It was honestly a shock to me. I think they probably paid north of $40,000 for the consulting package. I mean.\n\nI guess I underestimated how much of a pure \"money game\" some elite firms are running... High prices, high volume, mediocre quality. It's pretty gross how far they coast on prestige. A lot of these businesses are more or less built to capitalize on anxiety and pain.\n\nShout out to the brilliant consultants here (ahem... u/collegewithmattie, u/admissionsmom, u/scholargrade) who aren't fucking around and give students their all.",
      "author": "McNeilAdmissions",
      "created": 1635787263,
      "upvotes": 13,
      "replies": {
        "hiwo9ht": {
          "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiwo9ht/",
          "text": "Here to bolster this shout-out :)\n\n^(maybe wrong use of the word \"bolster\". help anyone?)",
          "author": "eccentric-Orange",
          "created": 1635788201,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hiwdplw": {
      "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiwdplw/",
      "text": "This is often a way that coaches can boost their results - if you have well connected and wealthy kids coming to you for college help, you're working with a pretty advantaged group to begin with. If you never take poorer students, then you will always have a higher baseline \"success\" rate. \n\nThe high fees are not a byproduct of reputation. By design, they're there to screen out and maintain a reputation.",
      "author": "Vergilx217",
      "created": 1635783798,
      "upvotes": 8,
      "replies": {}
    },
    "hiybj4h": {
      "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiybj4h/",
      "text": "I worked with them last cycle. I can wholeheartedly tell you that they are a scam. \n\nAfter paying $100k, this was my experience: I zoom called with one of their counselors and was told to decide on three schools that they could “help” me apply to. I chose 3 T10s. The counselor asked me a couple of questions and subsequently outlined a framework for my commonapp essay. I was told to write it in a day and get back to them with my drafts. After turning in my drafts, they would “edit” the essay and completely rewrite it. After that, they would do the same with all my supplemental essays and also edit my activities list. Basically, they wrote my entire app for me. I submitted the apps for rd, and subsequently got rejected from every single T20 I applied to (16/20 I believe). Kinda screwed up since I had the stats, ECs, and etc (3.9, 1550, 10 APs, published research). I talked to scholargrade for a post mortem and he told me that “my” essays reeked of arrogance and know-it-allness. Perhaps he can back me up if he still remembers my post mortem.\n\nIt worked out alright for me in the end since I had luckily gotten an acceptance from a Berkeley, Michigan, UNC - esque state flagship. But ironically enough, the place I’m attending now was the place I applied to on my own, without any of their essays or editing. \n\nIn conclusion, don’t use ivycoach or honestly most counseling services except for ppl like Mattie, scholargrade, or William. My family is rich as shit so the $100k didn’t matter much to us, but just imagine how horrible it would be if a family had to scrounge up most of their money to afford these scammers. They are an absolute waste of money.\n\nFeel free to ask me any questions.",
      "author": "Ivycoachthrowaway",
      "created": 1635813097,
      "upvotes": 6,
      "replies": {
        "hiyht98": {
          "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiyht98/",
          "text": "I remember this.  It still kinda hurts because of how much potential you had, and I can't believe how badly they botched this for you.  I'm sorry it turned out that way, but I'm glad you've moved on and that you're still getting a world class education.",
          "author": "ScholarGrade",
          "created": 1635815931,
          "upvotes": 3,
          "replies": {}
        },
        "hj2s009": {
          "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hj2s009/",
          "text": "Wow, I’m sorry to hear this story but appreciate the share. It boggles my mind how they could have botched things that badly. Like were the essays just straight up poorly written? Or was it fine writing wise but just had the arrogant attitude you mentioned?\n\nI’m curious because I feel like I’m going through a similar situation right now where this expensive consultant company (similar but not Ivywise) is giving me “suggestions” and edits for my essay that I think are just not good.",
          "author": "itsaulgreatman",
          "created": 1635895117,
          "upvotes": 1,
          "replies": {
            "hj2zz1b": {
              "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hj2zz1b/",
              "text": "It was good writing — better prose than what I could’ve written — but it wasn’t particularly amazing content-wise. \n\nI suspect that they make you write “something” so they could cover themselves if caught.",
              "author": "Ivycoachthrowaway",
              "created": 1635898418,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiw6nrz": {
      "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiw6nrz/",
      "text": "I mean yeah - it is coming from a place of privilege, but Jayson Weingarten sounds like a massive dickhead and it seems like the majority of the ivycoach ivybrothers type groups (outside of some people on here like scholargrade, Mattie, admissionsmom etc.) are egotistical blowhards who think getting paid thousands of dollars by parents of naive and/or underachieving rich kids to carry their asses into a t10 makes them some kind of neo navigating the college admissions matrix so the more shit they get the better. They shouldn’t get a license to politely tell you to suck it just because you’re upper middle class instead of buy a building rich",
      "author": "myfedoraismlg",
      "created": 1635780716,
      "upvotes": 11,
      "replies": {}
    },
    "hiwa14r": {
      "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiwa14r/",
      "text": "No surprise. \n\nThe best predictor of your future wealth is the wealth of your parents. The correlation is almost a perfect one. The \"system\" is designed to dangle upward mobility as an incentive for hard work, but only rarely is it actually delivered. \n\nThat said, these coaches are selling their expertise. It is a hard thing to scale, so it's not surprising that they want to maximize their earning potential. They clearly have enough clients that will pay whatever it takes to buy their way into a top school.",
      "author": "redranrye",
      "created": 1635782186,
      "upvotes": 3,
      "replies": {}
    },
    "hiz874e": {
      "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiz874e/",
      "text": "This might get sound naive or too meta, but why doesn’t the Common App ask “Who helped you with your application?” \n\nThe app doesn’t really acknowledge the industry and subculture around the application process or the vastly different experiences that students bring to the application itself. I don’t know if wealthy students are all assumed to have high-$ consultants but that’s definitely not true.",
      "author": "Ok-Boysenberry3703",
      "created": 1635829919,
      "upvotes": 2,
      "replies": {}
    },
    "hiymfmz": {
      "link": "/r/ApplyingToCollege/comments/qk8vm7/admissions_counseling_ivycoach/hiymfmz/",
      "text": "Saying that the SAT and ACT doesn't matter is the sign that I and most of A2C know more than them",
      "author": "KaiwenKHB",
      "created": 1635818014,
      "upvotes": 1,
      "replies": {}
    }
  }
}