{
  "sid": "q7j46d",
  "link": "/r/ApplyingToCollege/comments/q7j46d/which_advanced_math_class_should_i_take_for/",
  "title:": "Which advanced math class should I take for college?",
  "text": "I am in 10th grade right now and have been offered to take advanced math classes. They offered me this: \n\n  \n1.) Integrated Math III(11th grade)  \n2.) Calculus(12th grade)  \n3.) and  AP Calculus AB(12th grade)  \n\n\nI am having trouble deciding which one to chose. I want to take the class that most benefits me when applying to college. I think I could tackle these classes if I do choose them, but I do not want additional work for virtually no benefit. \n\nWhat should I consider when deciding?",
  "author": "callisto1999",
  "created": 1634154529,
  "updated": 1634167058,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgivfi9": {
      "link": "/r/ApplyingToCollege/comments/q7j46d/which_advanced_math_class_should_i_take_for/hgivfi9/",
      "text": "Not sure what the other courses are but definitely AP because you can actually get college credit for this + college view it more rigorously as its rigor is somewhat standardized across the nation.",
      "author": "idkname999",
      "created": 1634154744,
      "upvotes": 2,
      "replies": {}
    },
    "hgj0fb0": {
      "link": "/r/ApplyingToCollege/comments/q7j46d/which_advanced_math_class_should_i_take_for/hgj0fb0/",
      "text": "It’s unclear what’s being asked, as you have multiple 12th grade courses listed, and no other options for 11th. You certainly shouldn’t take two calculus classes in the same year.\n\nIf the question is which to take in 12th, the AP program is widely recognized so this would be my choice, (without knowing the details of the other option).\n\nIf the question is taking this vs. another sequence, your teacher and counselor would,be advise how your skills line up against the alternatives.",
      "author": "RichInPitt",
      "created": 1634156763,
      "upvotes": 1,
      "replies": {}
    },
    "hgj5dir": {
      "link": "/r/ApplyingToCollege/comments/q7j46d/which_advanced_math_class_should_i_take_for/hgj5dir/",
      "text": "If you mean \"benefits\" as in \"looks the most impressive,\" it depends on the rest of your school. Are 1 & 2 considered difficult classes at your school? Is it hard to get good grades in those courses? If so, then take those if you think you can keep up with them. But remember that colleges would rather see good grades in average-difficulty classes than Cs and Ds in really rigorous classes. \n\nAP Calculus AB is a reliable choice IMO; you can get college credit and for a class like calc, that's very helpful in university. It's also widely regarded as a moderately difficult course.",
      "author": "raccoonbabey8",
      "created": 1634158818,
      "upvotes": 1,
      "replies": {}
    },
    "hgjj13j": {
      "link": "/r/ApplyingToCollege/comments/q7j46d/which_advanced_math_class_should_i_take_for/hgjj13j/",
      "text": "Depends on your major",
      "author": "Peaches_UK",
      "created": 1634164759,
      "upvotes": 1,
      "replies": {}
    }
  }
}