{
  "sid": "qc09lh",
  "link": "/r/ApplyingToCollege/comments/qc09lh/my_dad_refuses_to_be_open_about_finances/",
  "title:": "My dad refuses to be open about finances",
  "text": "His intention is to ease the stress on me so that I can focus on the present, i.e. school and the applications. He says that *'as long as it's education, I am willing to pay any sum.'*\n\nWhile this may sound too nice, I REALLY do not want to be too much of a financial burden on my family. Our annual income lies in the 100-149,999k bracket. I am also an Asian international if that matters. Without considering any factor, he accepted my advice of EDing to Cornell, despite it costing like a megaton of money. I feel like he is going to end up signing for more than is capable, and gets mad if I mention finances even in the slightest.\n\nMy question is that what should the EFC , on average, be for someone in the 130-150k bracket. That way I can figure out if I should apply for aid to certain colleges and for how much.\n\nI'm applying to quite a few schools by November 1 (EA) and potentially 1 for (ED)\n\nPlease help : (",
  "author": "ChampionshipOk6426",
  "created": 1634734727,
  "updated": 1636165553,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hhcv3ec": {
      "link": "/r/ApplyingToCollege/comments/qc09lh/my_dad_refuses_to_be_open_about_finances/hhcv3ec/",
      "text": ">My question is that what should the EFC , on average, be for someone in the 130-150k bracket.\n\nThere is absolutely no way to answer that question.\n\nEFC is a function of income AND assets.  Frankly, with assets probably being more important than income in the range you mention.\n\nA family that makes $150k with nothing in the bank is in a very different situation than a family with the same income and several hundred grand in savings/investment accounts.\n\nYou need to know not just what his is willing to pay… but what he is CAPABLE of paying.",
      "author": "Strict-Special3607",
      "created": 1634735260,
      "upvotes": 4,
      "replies": {}
    },
    "hhcv58i": {
      "link": "/r/ApplyingToCollege/comments/qc09lh/my_dad_refuses_to_be_open_about_finances/hhcv58i/",
      "text": "You can look at how Rice gives out aid - you would be on the edge between getting full tuition and half tuition in aid there with normal assets.\n\nhttps://financialaid.rice.edu/rice-investment\n\nThe colleges themselves determine how much aid they will give you, but your EFC could be around $30-40k with normal assets.",
      "author": "BrawnyAcolyte",
      "created": 1634735285,
      "upvotes": 2,
      "replies": {}
    },
    "hhd9eep": {
      "link": "/r/ApplyingToCollege/comments/qc09lh/my_dad_refuses_to_be_open_about_finances/hhd9eep/",
      "text": "Have you tried their net price calculator?",
      "author": "getmeoutoflatamplz22",
      "created": 1634741721,
      "upvotes": 1,
      "replies": {}
    },
    "hhecbnb": {
      "link": "/r/ApplyingToCollege/comments/qc09lh/my_dad_refuses_to_be_open_about_finances/hhecbnb/",
      "text": "Without knowing a) assets and b) cost of living in your region, there is no good way to know. Also, since you’re an international, you can’t use the NPCs to estimate at almost all schools. Your best bet if you can get some asset figures:  \n\n1) run the NPC assuming parental income and assets converted to USD. Assuming a lower cost of living, this will overstate need because your parents’ retirement and expenses are not as high for day to day living. \n\n2) run it again adjusting for cost of living. If your parents make 100,000 and have 200,000 in assets and cost of living is half as much as the US, double those figures to 200,000 and 400,000. Run the NPC again. Assuming a lower cost of living, this is an understatement of need because 80,000 per year still needs to be paid based upon what you actually have. They don’t cost of living adjust that down to 40,000 loving where you do costs half as much \n\nAverage 1 and 2 above. That’s a very rough estimate.",
      "author": "ChampionshipPerfect5",
      "created": 1634757287,
      "upvotes": 1,
      "replies": {}
    }
  }
}