{
  "sid": "q8sy2x",
  "link": "/r/ApplyingToCollege/comments/q8sy2x/lowered_my_gpa_accidentally_because_i_stuffed_my/",
  "title:": "Lowered my GPA accidentally because I stuffed my schedule so I could take some classes I like",
  "text": "So I have a 3.94 unweighted and a 4.4 weighted GPA. I took the highest courses I could for my academic courses (honors and APs), but I really wanted to take three courses being Spanish(because I was recommended to take 4 years of language), Band(I just like band), and Jazz Band(I also like jazz band). So I basically played Tetris with my schedule (taking early morning and late ending classes) to fill it with 9 classes (in a nine-period day, typically because of double period sciences and lunch it averages 5 or 6) starting sophomore year and kept doing that till senior year. Around the tail end of junior year, I realized that it caused my weighted GPA to be lower than it could be (If I didn't take those classes I could've had around 4.5 or 4.6). While I don't regret it because I really like band, there is still a bit of worry for me that it could've hurt me. Will it hurt my application, or would the colleges see that I just took more classes than usual? \n\nSorry if this is a dumb question, but I can't get the thought out of my head.",
  "author": "samko0802",
  "created": 1634318065,
  "updated": 1634571568,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgrobv7": {
      "link": "/r/ApplyingToCollege/comments/q8sy2x/lowered_my_gpa_accidentally_because_i_stuffed_my/hgrobv7/",
      "text": "It won’t hurt your application because AOs will see your individual course grades. GPA is used to measure academic ability - if you’re doing good in the hard classes, you’re fine. They know that taking unweighted classes will lower GPA",
      "author": "Pitsuh",
      "created": 1634322062,
      "upvotes": 1,
      "replies": {}
    },
    "hgsn4na": {
      "link": "/r/ApplyingToCollege/comments/q8sy2x/lowered_my_gpa_accidentally_because_i_stuffed_my/hgsn4na/",
      "text": "AO’s understand weighting differences and impacts. This won’t be a negative.",
      "author": "RichInPitt",
      "created": 1634337391,
      "upvotes": 2,
      "replies": {}
    }
  }
}