{
  "sid": "qsgpk1",
  "link": "/r/ApplyingToCollege/comments/qsgpk1/i_dont_know_how_to_search_for_a_college/",
  "title:": "I don't know how to search for a college",
  "text": "I just don't. I don't know how to apply. I don't know what I want in a college. I don't know how to do this with the limitations I have. Please help, I don't know where to start",
  "author": "Unicorns-only",
  "created": 1636739481,
  "updated": 1636745319,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkcxvp2": {
      "link": "/r/ApplyingToCollege/comments/qsgpk1/i_dont_know_how_to_search_for_a_college/hkcxvp2/",
      "text": "might wanna consider a gap year/semester to really figure out what you want/looking for (if you’re a senior already)",
      "author": "Witty-Evidence6463",
      "created": 1636739963,
      "upvotes": 1,
      "replies": {}
    },
    "hkcxz63": {
      "link": "/r/ApplyingToCollege/comments/qsgpk1/i_dont_know_how_to_search_for_a_college/hkcxz63/",
      "text": "There is a wiki at the top of the subreddit to get you started.\n\nWhat are your limitations? Unweighted GPA, test scores, budget?",
      "author": "elkrange",
      "created": 1636740003,
      "upvotes": 1,
      "replies": {}
    },
    "hkd0y8j": {
      "link": "/r/ApplyingToCollege/comments/qsgpk1/i_dont_know_how_to_search_for_a_college/hkd0y8j/",
      "text": "For starters, you may want to look into the differences between liberal arts colleges and universities, and figure out which one you like better. Then, you can consider things like location (how far away from home do you want to be, what type of weather do you enjoy) and academics (what programs seem interesting to you?). You can also figure out what you want from social life (would you be into Greek life or no? Do you want a college with a big party culture?) You can use websites like Niche, Parchment, and the college board search service to narrow down colleges based on these criteria, among others and make a list. Then, look at the websites of every college on that list and maybe watch YouTube videos from current students to see if it seems like it might be a good fit for you. You can then start narrowing down your list and attending college tours/information sessions.",
      "author": "FrauMew",
      "created": 1636741222,
      "upvotes": 1,
      "replies": {}
    }
  }
}