{
  "sid": "qojvtg",
  "link": "/r/ApplyingToCollege/comments/qojvtg/harvard_portal_selfreporting_test_scores/",
  "title:": "Harvard portal self-reporting test scores",
  "text": "Do we need to report test scores in the portal if we’ve already reported  them on the CA? It says not to report SAT IIs if we reported them on the  CA, but I’m not sure if this also applies to SAT I scores.\n\nThanks in advance!\n\nEdit: NSFW removed, not sure why it was marked as that. Also pinging [u/skieurope12](https://www.reddit.com/u/skieurope12/) because he seems to know what he's talking about most of the time",
  "author": "Puzzled-Ad5592",
  "created": 1636271444,
  "updated": 1636654631,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hjnmice": {
      "link": "/r/ApplyingToCollege/comments/qojvtg/harvard_portal_selfreporting_test_scores/hjnmice/",
      "text": "I can’t see why you would need to.\n\nDoes the portal show your SAT scores?  If it does, there would be no reason to report them.",
      "author": "RichInPitt",
      "created": 1636277597,
      "upvotes": 1,
      "replies": {
        "hjnp2o9": {
          "link": "/r/ApplyingToCollege/comments/qojvtg/harvard_portal_selfreporting_test_scores/hjnp2o9/",
          "text": "dont know about Harvard but UNC chapel hill says they suggest self reporting ur scores on ur portal cuz the self reported scores are what they will see when they review ur files.",
          "author": "Capable-Ad1621",
          "created": 1636279920,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjo1g5j": {
      "link": "/r/ApplyingToCollege/comments/qojvtg/harvard_portal_selfreporting_test_scores/hjo1g5j/",
      "text": "I'd self-report your scores. Harvard looks at all your scores, but the common app only takes superscore. Therefore, self-reporting will provide them with the information to take all your scores into account. You have nothing to lose by self-reporting",
      "author": "throwaway34151526",
      "created": 1636289317,
      "upvotes": 1,
      "replies": {}
    },
    "hjogkcs": {
      "link": "/r/ApplyingToCollege/comments/qojvtg/harvard_portal_selfreporting_test_scores/hjogkcs/",
      "text": "Most admissions portals will indicate whether or not scores for SAT/ACT were received, and often what type (official vs self-reported). Sometimes it takes a few days for that to process. If you submitted scores in the app, I would expect them to show up in the portal eventually. If you don't see an indication that scores were received by next week, I'd consider self-reporting in the portal.  (If the college purposely is not showing scores received in the portal, that kinda defeats the purpose of the portal and they deserve whatever phone calls or extra self-reporting they get...)",
      "author": "elkrange",
      "created": 1636296812,
      "upvotes": 1,
      "replies": {}
    }
  }
}