{
  "sid": "qrq0a2",
  "link": "/r/ApplyingToCollege/comments/qrq0a2/a_father_who_thinks_hes_being_supportive/",
  "title:": "A father who thinks he’s being supportive.",
  "text": "My father keeps telling me that I won’t get in anywhere. He says that i might get into T50s but not any T10s (Stanford especially since it’s my dream school). I’m an international student, he says if I don’t get into T10s he won’t send me for an undergraduate abroad. As someone who already struggles with self esteem issues, every time I hear him say it I believe it and break down. I would like to keep thinking positive and keep my spirits high until the decisions come out because I believe what kind of energy you put out is what you get. He thinks he’s motivating me by being harsh so that I work harder, but at this point in my life I just feel like giving up. Idk what to do. \n\nSo yeah if you’ve made it this far, thanks for coming to my rant. Just had to get this off somewhere.",
  "author": "Dumaadu",
  "created": 1636650916,
  "updated": 1636652730,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk86lpv": {
      "link": "/r/ApplyingToCollege/comments/qrq0a2/a_father_who_thinks_hes_being_supportive/hk86lpv/",
      "text": "Many things can be true at the same time:\n\n* Your father thinks he's being supportive.\n* He's not, in fact, being supportive.\n* He may be correct in saying your chances of being admitted to T10 are very, very small.\n\nWhat to do:\n\n* Ignore him.",
      "author": "jayphoward",
      "created": 1636652596,
      "upvotes": 1,
      "replies": {}
    },
    "hk83qb6": {
      "link": "/r/ApplyingToCollege/comments/qrq0a2/a_father_who_thinks_hes_being_supportive/hk83qb6/",
      "text": "I think you should talk with him. Tell him that getting into a t10 is very difficult and alot of people that deserve to study there dont get lucky. Tell him that getting into a t50 is amazing too! If you love your major and really interested in it, then you can succeed in the future just as a t10 graduate. I know people that got into t200 and are more successful that t10 graduates.",
      "author": "Jealous_Sorbet_6094",
      "created": 1636651474,
      "upvotes": 1,
      "replies": {}
    }
  }
}