{
  "sid": "qlx5l2",
  "link": "/r/ApplyingToCollege/comments/qlx5l2/self_studied_aps_vs_online_dual_enrollment/",
  "title:": "Self Studied APs vs Online Dual Enrollment",
  "text": "I’m an international student at a school that does not offer AP or any advanced classes. So I was wondering whether I should self study for some AP tests or do Dual Enrollment. If I do dual enrollment, it will be online as it is also not offered here. I’m currently leaning towards Dual Enrollment because most top colleges don’t really offer AP credits but I was wondering which one would look better on my application?",
  "author": "SyedAayed26",
  "created": 1635953999,
  "updated": 1636136694,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj5yijt": {
      "link": "/r/ApplyingToCollege/comments/qlx5l2/self_studied_aps_vs_online_dual_enrollment/hj5yijt/",
      "text": ">which one would look better on my application?\n\nDual enrollment. Colleges don't generally care about self-study.\n\nThat said, if your current schedule is full of rigorous courses, DE is also possibly not advisable if it will impact your grades, test prep, or ECs.",
      "author": "skieurope12",
      "created": 1635956449,
      "upvotes": 3,
      "replies": {
        "hj929o8": {
          "link": "/r/ApplyingToCollege/comments/qlx5l2/self_studied_aps_vs_online_dual_enrollment/hj929o8/",
          "text": "Thanks for answering, I don’t think my grades will suffer an impact so dual enrollment it is.",
          "author": "SyedAayed26",
          "created": 1636006079,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj74siy": {
      "link": "/r/ApplyingToCollege/comments/qlx5l2/self_studied_aps_vs_online_dual_enrollment/hj74siy/",
      "text": "Taking an actual course through an institution for an entire school semester/year is much better than just studying for a single three hour test.",
      "author": "RichInPitt",
      "created": 1635972523,
      "upvotes": 1,
      "replies": {
        "hj9283x": {
          "link": "/r/ApplyingToCollege/comments/qlx5l2/self_studied_aps_vs_online_dual_enrollment/hj9283x/",
          "text": "Thanks, I just have one more question, if I did dual enrollment through a community college which runs on a quarter schedule, how will my credits transfer to a college which runs on a semester schendule?",
          "author": "SyedAayed26",
          "created": 1636006044,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}