{
  "sid": "qk83fs",
  "link": "/r/ApplyingToCollege/comments/qk83fs/why_anything_is_possible_exhibit_a_uc_hicago/",
  "title:": "why anything is possible: exhibit A, UC Hicago",
  "text": "I JUST BIRTHED TO TWO UC HICAGO ESSAYS, REVIEWED, AND SUBMITTED MY APP IN 3 HOURS. WHAT IN THE WORLD.\n\nBackground:\n\nI've been going on and off about applying to UChicago forever. I mean like for 4 months. Now, most of the time this was me just procrastinating, but I was adamant to myself I wasn't the \"academic type\" and wasn't a good fit. Now 8:00 pm PST rolls around and I'm just checking my college list, making sure I've submitted everything when I see that TRIGGERING red timer next to UChicago on my common app. The devil on my shoulder says \"well... I have time, let's just try\". The angel is like god damn take a nap the deadline is in like 4 hours.\n\nSafe to say, the devil wins out and I've chugged three espressos and have locked myself in my room. I've scrapped like 3 Chicago essays because they just suck, so I had no material I wanted to build on. I crack my neck, chain myself to my swivel seat, and literally for non-stop 3 hours crap out 2 original essays that were qUiRkY and cOoL and iNsiGhTfuL. I'm an okay writer and I write the best under pressure, but like I transcended into a prophet or something because I was on FIRE. ABSOLUTE FIREEEEE. I've just submitted with like 50 minutes to spare. The only thing I've gotten out of this process is: The ed/ea deadline CAN NOT WIN (and I'm probs going to get rejected)",
  "author": "unstable_parsley",
  "created": 1635748225,
  "updated": 1635777322,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "hiuzy65": {
      "link": "/r/ApplyingToCollege/comments/qk83fs/why_anything_is_possible_exhibit_a_uc_hicago/hiuzy65/",
      "text": "I don’t doubt an essay can be written in a few hours.\n\nDo you beleive it’s a good as it would be if you had time to review it?",
      "author": "RichInPitt",
      "created": 1635752521,
      "upvotes": 6,
      "replies": {
        "hiv029o": {
          "link": "/r/ApplyingToCollege/comments/qk83fs/why_anything_is_possible_exhibit_a_uc_hicago/hiv029o/",
          "text": "honestly my best pieces are when I don't overthink them. If all else fails at least I'm proud of them",
          "author": "unstable_parsley",
          "created": 1635752631,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  }
}