{
  "sid": "qgxfnq",
  "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/",
  "title:": "College Essay about a near death experience",
  "text": "the prompt i chose : Share a meaningful experience and how this has helped shape you in your preparation for college. This could be related to your passions, commitments, leadership experience, family or cultural background.\n\n Hi! so i was wondering if it would be okay to write an essay with a beginning hook of how i almost died over a penny when i was young. and i almost drowned because of it. my sister managed to save me. I’m not sure how this would relate to who i am in terms of metaphorical use. But I can maybe mention how life is short and i want to make the best out of it i feel like that’s really cliche, and i can’t think of any other ways it would help so i’m open to ideas! \n\n\nplease! let me know any advice or ideas i need help \n\n\ni need this by the end of the week\n\n\nTLDR; two essay intro paragraphs, one about turgor pressure, another about a near death experience…. any advice? (due by this week)",
  "author": "makaio3o",
  "created": 1635343474,
  "updated": 1635456426,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi8yz34": {
      "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi8yz34/",
      "text": "While writing about something that happened when you were little is most definitely not recommended, I myself have experienced that sometimes there are things you don't forget and as you grow up, you slowly realise the severity of what happened and what could have happened. If maybe you can write it from this point of view and show the AOs from this point of view, it might be something good. But it's still highly risky.",
      "author": "Concerned-gay-guy",
      "created": 1635343836,
      "upvotes": 3,
      "replies": {
        "hi8z9r2": {
          "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi8z9r2/",
          "text": "thank you!",
          "author": "makaio3o",
          "created": 1635343965,
          "upvotes": 1,
          "replies": {}
        },
        "hi8ze8l": {
          "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi8ze8l/",
          "text": "what do you think about the plant metaphor?",
          "author": "makaio3o",
          "created": 1635344019,
          "upvotes": 1,
          "replies": {
            "hi8zsq9": {
              "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi8zsq9/",
              "text": "Hmm.. not really risky, but there's a high chance that AOs won't like it. If you tried to show something like \"I saw the plant push through concrete and it reminded me of how I pushed... Blaaaaah\" it definitely won't work. AOs know very well that teen minds don't work like this, and trust me, thousands of applicants make this mistake every year. In my opinion, if well done, the first one is a better choice out of the two you've listed.",
              "author": "Concerned-gay-guy",
              "created": 1635344193,
              "upvotes": 2,
              "replies": {
                "hi902bz": {
                  "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi902bz/",
                  "text": "if you don’t mind me asking how do you know so much 😩 if i finish a draft would you be able to read it and provide any criticism?",
                  "author": "makaio3o",
                  "created": 1635344308,
                  "upvotes": 1,
                  "replies": {
                    "hi90jyw": {
                      "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi90jyw/",
                      "text": ">if you don’t mind me asking how do you know so much\n\nWouldn't really say I know a lot lol... I just read a lot of stuff posted by verified admissions counselors and consultants. Those things help me write essays, so I definitely try remember them. Everything I've told you upto now is what I heard from someone qualified.\n\n\nSince I've already finished my common app essay, and I think your topic is too personal to be stolen, I can read it and give my opinions, but you should probably think about if you can trust a stranger on reddit or not.",
                      "author": "Concerned-gay-guy",
                      "created": 1635344517,
                      "upvotes": 3,
                      "replies": {
                        "hi9230u": {
                          "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi9230u/",
                          "text": "i mean i’d trust you it’s not like you’d be able to steal it i have a lot of in-depth personal stuff lool",
                          "author": "makaio3o",
                          "created": 1635345166,
                          "upvotes": 1,
                          "replies": {
                            "hi92feh": {
                              "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi92feh/",
                              "text": "Alright! I'll dm you an email id then. You can email whenever you feel comfortable.\n\nYou'll have to message me I think.",
                              "author": "Concerned-gay-guy",
                              "created": 1635345311,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hib12dg": {
                  "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hib12dg/",
                  "text": "On that note, I forgot to mention. I'm not looking to state that I want to mention how the plant was there in the middle of the road unharmed and managed to grow through a road. I could use this in a metaphorical structure by also starting off the sentence with a hook, describing the scene and etc",
                  "author": "makaio3o",
                  "created": 1635373218,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi91ac9": {
      "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi91ac9/",
      "text": "Uh general advice about life in general: if you don’t believe in the idea you are pursuing, don’t do it. You being unsure about the metaphorical use is a sign that the story may not be right fit. Additionally, while the concrete tree story is cool, I would maybe think about something that has literally changed who you are. What’s something that you think about everyday, or what event recaps your character a little more literally?",
      "author": "MirrorRude7119",
      "created": 1635344829,
      "upvotes": 3,
      "replies": {
        "hi91noo": {
          "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi91noo/",
          "text": "daily i think about how school is and it’s societal norms. I always find myself realizing everyone around me is scared or doesn’t want to chase after something . I feel like the plant idea of breaking through the concrete might represent that in a way",
          "author": "makaio3o",
          "created": 1635344985,
          "upvotes": 1,
          "replies": {
            "hi91zot": {
              "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi91zot/",
              "text": "Are you saying that because it’s conviennent to the idea or because you truly believe in it? Not trying to challenge you but just trying to push you, make you think. \n\nPlant could be a good essay yes! But besides being a good metaphor, has that really CHANGED who you are? In other words, is it more of a representation or rather something that actually had you take action?",
              "author": "MirrorRude7119",
              "created": 1635345127,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hi8ykwj": {
      "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi8ykwj/",
      "text": ">when i was little.\n\nNope, too long ago.\n\nSecond one could be good.  (You should consider deleting post so no one steals the idea… because someone will.",
      "author": "Strict-Special3607",
      "created": 1635343665,
      "upvotes": 3,
      "replies": {
        "hi8ystt": {
          "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi8ystt/",
          "text": "is there a reason why we can’t write about stuff when we we’re little?",
          "author": "makaio3o",
          "created": 1635343761,
          "upvotes": 2,
          "replies": {
            "hi959ew": {
              "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi959ew/",
              "text": "You can literally write about anything. Just make sure it focuses on your character",
              "author": "Top-Cryptographer-81",
              "created": 1635346482,
              "upvotes": 3,
              "replies": {}
            },
            "hi9nni2": {
              "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hi9nni2/",
              "text": "One of the essays that most resonated with me was about an experience the writer had a LONG time ago. They just made sure that it connected with things that they were doing now, as well as their personality (motives, values, all that good stuff). Imo, just make sure it goes deep so AOs would get who you are now. That’s it",
              "author": "beleclya",
              "created": 1635353899,
              "upvotes": 2,
              "replies": {
                "hial7jx": {
                  "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hial7jx/",
                  "text": "which one are you referring to? the plant or the near death experience",
                  "author": "makaio3o",
                  "created": 1635366879,
                  "upvotes": 1,
                  "replies": {
                    "hiar183": {
                      "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hiar183/",
                      "text": "I was just referring to the near death experience one it was smth that happened when you were young. Your choice obviously though!!",
                      "author": "beleclya",
                      "created": 1635369133,
                      "upvotes": 2,
                      "replies": {
                        "hib18ib": {
                          "link": "/r/ApplyingToCollege/comments/qgxfnq/college_essay_about_a_near_death_experience/hib18ib/",
                          "text": "do you remember what the person that wrote their experience was? like what did they learn from it.. I'm thinking of mentioning how it definitely changed my view of life being short and making it last but at the same time i feel like that's cliche and everyone else did it..",
                          "author": "makaio3o",
                          "created": 1635373290,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}