{
  "sid": "qmb1k3",
  "link": "/r/ApplyingToCollege/comments/qmb1k3/help_i_applied_to_emory_ed_a_few_days_ago_without/",
  "title:": "HELP I applied to Emory ED a few days ago. Without knowing, I submitted FAFSA thinking it is a different thing with \"Financial aid\" mentioned in the common app question",
  "text": "I applied to Emory ED a few days ago. Without knowing, I submitted FAFSA thinking it is a different thing with \"Financial aid\" mentioned in the common app question(i put \"no\" for financial aid). After getting emails from the Office of Financial Aid for more paperwork. Searching around now, I discovered that FAFSA is also included in Financial aid. I heard that even tho it's a need-blind college, look if I'm applying to Financial aid or not. Since Emory is my reach school, I didn't want to apply for Financial aid that could disadvantage my admission. What should I do? is there any way to recall it? I was only planning to apply for government aid(FAFSA), thinking that college wouldn't know and affect my admission. Can anyone give some advice?",
  "author": "Infamous_Trouble743",
  "created": 1635993986,
  "updated": 1636136316,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hj8m9p3": {
      "link": "/r/ApplyingToCollege/comments/qmb1k3/help_i_applied_to_emory_ed_a_few_days_ago_without/hj8m9p3/",
      "text": "If they say they are need blind then they are. Don’t try and game the system if you need money to attend Emory you should have said yes it doesn’t hurt your application.",
      "author": "TritonTheCat",
      "created": 1635995881,
      "upvotes": 2,
      "replies": {}
    },
    "hj8rwhg": {
      "link": "/r/ApplyingToCollege/comments/qmb1k3/help_i_applied_to_emory_ed_a_few_days_ago_without/hj8rwhg/",
      "text": "Don’t try to hide your financial situation. An acceptance letter won’t do you any good if you can’t afford to attend.",
      "author": "screamingviking13",
      "created": 1635998988,
      "upvotes": 1,
      "replies": {
        "hj8usev": {
          "link": "/r/ApplyingToCollege/comments/qmb1k3/help_i_applied_to_emory_ed_a_few_days_ago_without/hj8usev/",
          "text": "i can afford it, but there was no reason to deny free money given. i thought it won't give any difference to college admission. im asking if i cancel it by sending email to them will it still effect admission? i haven't sent any other paper work",
          "author": "Infamous_Trouble743",
          "created": 1636000744,
          "upvotes": 1,
          "replies": {
            "hj9980l": {
              "link": "/r/ApplyingToCollege/comments/qmb1k3/help_i_applied_to_emory_ed_a_few_days_ago_without/hj9980l/",
              "text": "Are you an international student? If so, I’d reach out to Emory and let them know you don’t need aid. Emory is need-aware for internationals, so it could hurt your chances if it looks like you need money. \n\nIf you’re a domestic student don’t worry about it.",
              "author": "screamingviking13",
              "created": 1636012038,
              "upvotes": 1,
              "replies": {
                "hjbj334": {
                  "link": "/r/ApplyingToCollege/comments/qmb1k3/help_i_applied_to_emory_ed_a_few_days_ago_without/hjbj334/",
                  "text": "no I'm not thanks",
                  "author": "Infamous_Trouble743",
                  "created": 1636053504,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}