{
  "sid": "qn2ivv",
  "link": "/r/ApplyingToCollege/comments/qn2ivv/junior_in_hs_looking_into_computer_science/",
  "title:": "Junior in hs looking into computer science",
  "text": "I’m taking ap computer science this year and it’s kicking my ass. I think understand it but my code always has hella errors. But I really like the class. Should I look further into it or try something else because Ik it gets sm harder.",
  "author": "kleen23",
  "created": 1636083830,
  "updated": 1636135750,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjdqshv": {
      "link": "/r/ApplyingToCollege/comments/qn2ivv/junior_in_hs_looking_into_computer_science/hjdqshv/",
      "text": "If this is your first CS or programming class, I would give it some more time because these things have a bit of a learning curve for some people... Once you're more comfortable with the subject, these things tend to get easier, so if you're taking another semester of such courses, the end of your junior year would be a good time to evaluate your choices.",
      "author": "prsehgal",
      "created": 1636089467,
      "upvotes": 1,
      "replies": {
        "hje1np4": {
          "link": "/r/ApplyingToCollege/comments/qn2ivv/junior_in_hs_looking_into_computer_science/hje1np4/",
          "text": "Thanks!!:)",
          "author": "kleen23",
          "created": 1636098318,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjdr0kx": {
      "link": "/r/ApplyingToCollege/comments/qn2ivv/junior_in_hs_looking_into_computer_science/hjdr0kx/",
      "text": "First, most people have a lot of errors when they first start coding. When you get more experienced, you'll start making fewer but more confusing errors. Even professional software engineers (like me) make plenty of mistakes.\n\nSecond, it's really hard to judge your fit with CS from a high school course. There's way too much variability in quality of instruction, resources, etc. I'd take at least one course in college just to see if it goes better.\n\nThird, ask yourself how much it matters to you that it's hard. Are you ok with struggling through something fun, or do you want your chosen major to be easy for you?\n\nIf there's something else you really enjoy, consider that too, but I wouldn't give up on CS quite yet.",
      "author": "Forgind1",
      "created": 1636089623,
      "upvotes": 1,
      "replies": {
        "hje10yk": {
          "link": "/r/ApplyingToCollege/comments/qn2ivv/junior_in_hs_looking_into_computer_science/hje10yk/",
          "text": "Thank you so much! Should I look into online courses?",
          "author": "kleen23",
          "created": 1636097748,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}