{
  "sid": "deaqv2",
  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/",
  "title:": "I'm tired of this game.",
  "text": "My whole life I've always been told to do my best, but where does it stop? You can always do more, you can always sacrifice your fucking life for a goal, but what's the price you end up paying?\n\nI threw everything valuable in life away by chasing the fucking first letter of the alphabet. I have no social skills. I have no hobbies. I am horribly neurotic. I'm irritable all the time. I have brain fog all the time. I've spent so much of my doing the shit that I \"should do\" that I've never pursued what I care about. When people ask me what I do for fun I make up some bullshit answer, because I don't do anything for fun. School is my life, and I can't slow down now or all this work would have been for nothing.\n\nMy dad is fucking 65 years old. I don't really have any meaningful interaction with him outside of the weekends, and even then I'm always pissed because of school. Was the SAT score worth it? Is the fucking number 4.0 worth it? How much time am I realistically going to have left with him?\n\nI'm probably going to apply ED to a T20 school, but part of me hopes that I just end up at my state school. I'm tired of this game, and will it ever end if I go to a T20?  I would get a whole lot more out of learning how to party and have a good time than i would to keep chasing this shit. I just want to be content in life with people I care about, but instead I sit around procrastinating all day because of how burned out and unfulfilled I am from this game, and it keeps me distracted from how far behind I've fallen in every part of my life.\n\nFuck this game. It's not worth it. I can't wait until second semester when I'll actually be able to embrace everything I've neglected in life for so long.",
  "author": "Every_Muffin",
  "created": 1570402087,
  "updated": 1634076478,
  "over_18": false,
  "upvotes": 1968,
  "upvote_ratio": 0.97,
  "comments": {
    "f2u06tb": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u06tb/",
      "text": "I feel, but don’t waste what you’ve accomplished. Go to a good school and actually have fun, talk to people, and live your life. if you don’t get the same grades it doesn’t even matter tbh, it’s more important to have fun. Your life isn’t over, it’s just 4 years, and you still have plenty of time to get into new things",
      "author": "JahmenVrother",
      "created": 1570404016,
      "upvotes": 574,
      "replies": {
        "f2uk625": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uk625/",
          "text": "[removed]",
          "author": null,
          "created": 1570418754,
          "upvotes": 127,
          "replies": {
            "f2uozzj": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uozzj/",
              "text": "How I look at it( if you get in), yes you still have to work hard, but it’s not so you can get in somewhere. You’re already there. So work hard but still do what you want. Pursue what you enjoy. The competition part is over. Yes sure, there is still job/career competition but most competent people end up somewhere decent in life even if they’re not a CEO or entrepreneur at 25",
              "author": "buckyspunisher",
              "created": 1570423186,
              "upvotes": 44,
              "replies": {}
            },
            "f2uz14w": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uz14w/",
              "text": "Hey I’m a college kid, currently in Oxford university, I work hard but I also make time for my family/friends and myself. College is not like high school. You choose your priorities. \n\nYou know what you call the person who graduated last in his class from med school? “Doctor.” \n\nDon’t worry kid. And even if you don’t get into the school you wanted it will not be for nothing. I applied ED to UPenn, got waitlisted, applied to 27 other colleges around the world as an international student, got into a small liberal arts school that wasn’t my first choice and wasn’t super competitive and I ended up loving it there. Life works out.",
              "author": "downvoticator",
              "created": 1570436661,
              "upvotes": 31,
              "replies": {
                "f34clq0": {
                  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f34clq0/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1570652541,
                  "upvotes": 2,
                  "replies": {
                    "f34l3x0": {
                      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f34l3x0/",
                      "text": "Oxford has really strong visiting student programs. I applied my Junior year and currently, I'm a senior. I wouldn't have been able to attend this program, or have gotten multiple internships, or done one-on-one fieldwork studies with really prominent professors in my field had I not gone to the small liberal arts college first.",
                      "author": "downvoticator",
                      "created": 1570656034,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f2uranh": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uranh/",
              "text": "its important to remember that a school is what you make it.  If you go to a \"good school\" but hate your life, you wont get as good and education as you would if you went to a \"bad school\" and had a healthy balance of academics and life.  In the end, its the degree that counts and the four years you spend in college won't determine the rest of your life.  There will always be new, unique opportunities wherever life takes you.  Anyone with the work ethic to make a life in a career can do so in their own way.  We don't have to follow the \"elite school\" track that society sets up for us.",
              "author": "dmarxki",
              "created": 1570425698,
              "upvotes": 21,
              "replies": {
                "f2wyz7r": {
                  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2wyz7r/",
                  "text": "THIS.\n\nIf you go to a good school but you're life sucks, is it really a good school?\n\nIf you go to a bad school and you're life is great and you love it, is it a bad school? The idea we have of what is good and what is bad is completely subjective. \n\nThank you for this",
                  "author": "kachungamachunga",
                  "created": 1570471833,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "f2umw1w": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2umw1w/",
              "text": "[deleted]",
              "author": null,
              "created": 1570421100,
              "upvotes": -5,
              "replies": {}
            }
          }
        },
        "f2yv7e4": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2yv7e4/",
          "text": "I mean to be honest, it's a little disingenuous saying a state school can't be a \"good school\". Most states' Flagship schools have pretty good employment placement rates with high starting salaries. You don't need to go to a T20 to get a good education. Sure, if you get accepted somewhere better, then go for it, but some of the most successful people in their careers  went to state schools. Right now there's an excess of qualified professors, so quality education is in higher supply than one would think. \nTL;DR- I agree with your point, but going to a state school isn't \"wasting what you've accomplished\" necessarily. (Especially because private school is expensive as balls)",
          "author": "big_f_horn",
          "created": 1570499210,
          "upvotes": 1,
          "replies": {
            "f2ywbia": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ywbia/",
              "text": "Never said state schools couldn’t be good, just meant don’t go to a bad school that you know will be incredibly easy",
              "author": "JahmenVrother",
              "created": 1570499977,
              "upvotes": 1,
              "replies": {
                "f2ywjze": {
                  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ywjze/",
                  "text": "Ah ok, sorry about the misunderstanding. Though chances are the state schools OP applied to are still probably very good if the rest of their list is T20s. I definitely agree that you shouldn't go to a BAD school though!",
                  "author": "big_f_horn",
                  "created": 1570500143,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f2u6h5g": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u6h5g/",
      "text": "I think your mentality stems from an unhealthy focus on getting into college and nothing else. \n\n\nI've done things I've enjoyed throughout high school, (although I have kept college in the back of my mind) and think I've had a fulfilling couple of years. I enjoy some hobbies, try to stay healthy, and don't really do stuff I don't enjoy. \n\n\nAs for college, I guess I've just prepared without going overboard: I've taken hard classes, maintained an OK GPA, took subject tests and standardized tests early, etc. I guess I'm lucky in that my parents are not overly obsessed about college and neither am I. I think there are a lot of things more important than college, and wouldn't be heartbroken if I didn't get in to my first choice.",
      "author": "LRFE",
      "created": 1570408597,
      "upvotes": 199,
      "replies": {
        "f629ix1": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f629ix1/",
          "text": "Just curious, what are your hobbies? I need at least one new one.",
          "author": "TrumpLyftAlles",
          "created": 1572655439,
          "upvotes": 1,
          "replies": {
            "f652yy5": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f652yy5/",
              "text": "I lift a couple hours a week (6x, 1h per day). Obviously you don't need to do so much, but I enjoy doing it and have gotten used to it\n\nI cook for my family once a week (when I have time). It's super fun, and I get to learn how to cook along the way (and eat delicious food once I'm done!).\n\nThis kinda counts, but I play bullet (1-min) chess online, and I'm ranked okay. Just do it for fun honestly, it's a fun challenge to see how fast you can play well.\n\nI do some other ECs but wouldn't really call them hobbies--rowing, work, research, etc. I used to speedcube a while ago, but dropped it. \n\nObviously I waste a lot of time on the internet too, but that's not a hobby.",
              "author": "LRFE",
              "created": 1572698499,
              "upvotes": 2,
              "replies": {
                "f660h90": {
                  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f660h90/",
                  "text": "That is an excellent list, thanks very much! :)\n\nYou're an interesting person. Kudos.",
                  "author": "TrumpLyftAlles",
                  "created": 1572706791,
                  "upvotes": 1,
                  "replies": {
                    "f660ylu": {
                      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f660ylu/",
                      "text": "Just do whatever interests you! If you like nature, you could hike, run around town, or bike around town (while staying healthy). \n\nThere are tons of activities that are low cost and very fun to do. You could even just hang out in your library and read a ton of books.",
                      "author": "LRFE",
                      "created": 1572706897,
                      "upvotes": 1,
                      "replies": {
                        "f66a7m7": {
                          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f66a7m7/",
                          "text": "> If you like nature, you could hike\n\nAnything that gets me away from the internet would be helpful, and I've read that routine exposure to nature is good for mental health.\n\nThanks for the suggestion!\n\n> You could even just hang out in your library and read a ton of books.\n\nThinking about it, this is a great idea too, esp. if I leave my phone at home so I can't answer reddit's relentless call. I have been a big time reader in the past, and have a huge number of books I'd like to read. Thank-you!",
                          "author": "TrumpLyftAlles",
                          "created": 1572709015,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "f6ot90a": {
                  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f6ot90a/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1573033703,
                  "upvotes": 1,
                  "replies": {
                    "f6p686a": {
                      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f6p686a/",
                      "text": "lichess lol",
                      "author": "LRFE",
                      "created": 1573048585,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f2uk7l1": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uk7l1/",
          "text": "[removed]",
          "author": null,
          "created": 1570418787,
          "upvotes": -68,
          "replies": {
            "f2up5mg": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2up5mg/",
              "text": "I understand that you would feel as if you have wasted three years of high school on pursuing the best college possible, no matter the costs, but I ask that you please think of all the people who are not yet seniors and who could benefit massively from this advice. It is better to feel happy for people who do not suffer the same negative experiences as you than to feel envious of them or to think that they should endure the same things that you endured.",
              "author": null,
              "created": 1570423344,
              "upvotes": 34,
              "replies": {
                "f2uq6st": {
                  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uq6st/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1570424454,
                  "upvotes": 16,
                  "replies": {
                    "f2utpqu": {
                      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2utpqu/",
                      "text": "It ain't too late to rearrange priorities mate. Time to live your life the way you want. You already have the credentials, time to cash in. Just make sure not to abandon your momentum aye?",
                      "author": "Nonchalant_Goat",
                      "created": 1570428705,
                      "upvotes": 7,
                      "replies": {}
                    },
                    "f2wb9sl": {
                      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2wb9sl/",
                      "text": "I can respect that. Remember that you have most of your life ahead of you and that you are not obligated to approach adult life the same way that you approached getting into college.",
                      "author": null,
                      "created": 1570463660,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f2yr9ay": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2yr9ay/",
              "text": "yeah cause there are no sophomore or juniors on this sub",
              "author": null,
              "created": 1570496521,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "f2u9ftw": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u9ftw/",
      "text": "Hey, not sure if you’re reading these, but I really hope you read this comment.\n\nThis post shows me something, it shows me that you’re are willing to see that you are unhappy. Surprisingly, that’s the hardest part. Hopefully you’ll be looking back on this post in a few months and realizing this was the moment you made the change in your life that mattered.\n\nRegardless, now is the time for action. Do the things YOU want to do, and now. You might not realize it, but your unhappiness from your lifestyle so far may find its way onto your college essays and hurt your chances drastically. You need to deal with your feelings if you hope to better yourself.\n\nGo out there and meet some new people! I was in a similar spot as you at one point, but this basic first step is really what helped me the best. I found taking part in new extracurriculars can help too, fencing is a great option (biased lol). Your grades aren’t going to change, but it they do a little it shouldn’t matter, you’rs having fun!\n\nIt sounds like you might have a one-sided relationship with your father. This sucks, and I really don’t know what to say to help here. At least with toxic friends you can stop talking to them, but family is family always. If your dad is reasonable, you could try to directly talk to him about your feelings. In my opinion however, I would recommend hinting over direct. Maybe you could say casually that you want to start doing new extracurriculars to him, but be specific there. See how he feels about it, and if responds poorly, brush off the idea. This will let you guage how he will react to the rest of your feelings.\n\nOkay, well this is everything I’ve got for now. Seriously though, message me if you want to talk further. I won’t mind a bit, I love a distraction from school to help others :). I promise, you won’t be a hassle or burden to me. \n\nAlright, goodluck on your endeavors, and thanks for reading!",
      "author": "eggthrowaway27",
      "created": 1570410762,
      "upvotes": 75,
      "replies": {
        "f2ub9zk": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ub9zk/",
          "text": "Thank you for the support! I will try to plan something with him.",
          "author": "Every_Muffin",
          "created": 1570412119,
          "upvotes": 22,
          "replies": {
            "f2uts44": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uts44/",
              "text": "Best of luck mate! I hope it works out fine either way!",
              "author": "Nonchalant_Goat",
              "created": 1570428793,
              "upvotes": 2,
              "replies": {}
            },
            "f2vzhzj": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2vzhzj/",
              "text": "Op I have a serious question - how did you end up with brain fog? Is brain fog related to studying too much or it's aftereffects or what ....?",
              "author": "hollowsoul_",
              "created": 1570459387,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f2ukeic": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ukeic/",
          "text": "[removed]",
          "author": null,
          "created": 1570418938,
          "upvotes": 8,
          "replies": {
            "f2ulrdt": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ulrdt/",
              "text": "[deleted]",
              "author": null,
              "created": 1570420062,
              "upvotes": 5,
              "replies": {}
            },
            "f2ulw3z": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ulw3z/",
              "text": "I think you want to drop it, but are telling yourself otherwise. It is okay to relax a little senior year! Especially after putting in a lot of work in your past years. I’m guessing you already took AP Calc BC, and that’s already a hard class to take and do well in. Colleges will be more than happy with just BC. Sure, you might think it will help you even more to go above and beyond the colleges’ expectations, but I’m telling you, it really won’t do much. You’ll get the chance to take that class with more understanding in college if you really want to take it. You gotta remember that AP classes are just college class knockoffs.\n\nI strongely recommend going to your guidance conselor to attempt dropping. If you really cannot and are stuck in the class, you may just have to accept getting a lower grade than that of what you are comfortable with unless you are willing to put in a lot more work. Honestly though, one bad grade, even a C, should only drop your gpa by at most .15 (correct me if wrong). You will still be top 1% of your class, and most colleges consider gpas of that level equal. \n\nI’m sure you are just worrying yourself a bit too much as well however, I’m sure you’ll pull by alright. But if not, it’s okay! By the sound of it, you’ve done great, and you should be proud of yourself. I hope you have someone in your life to say this to you, but just in case you don’t, I’m proud of you!\n\nAlright, my phone’s at 1%, so I’ll leave it here. Goodluck on your endeavors! PM me if you need anything else!",
              "author": "eggthrowaway27",
              "created": 1570420179,
              "upvotes": 3,
              "replies": {
                "f2ut3wo": {
                  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ut3wo/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1570427914,
                  "upvotes": 3,
                  "replies": {
                    "f2uu1io": {
                      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uu1io/",
                      "text": "If you're smart, you will adapt to the situation. Trust me on that one. While I don't exactly advise dropping, I do advise easing off a little. The worst part of trying to be the smartest kid around is that by the end of the trials, whether you're proven to be the smartest or not, you are extremely competent in your presumably unchosen field but extremely incompetent in everything else. Branch out and socialise, grow as an individual. That'll drive more in you than the A streak. You'll also probably get more creative, which is an important tool you can use, just like being smart.\n\nBeing smart doesn't define you, because heck there's plenty around. It is just a tool you use.",
                      "author": "Nonchalant_Goat",
                      "created": 1570429140,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f2u22vs": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u22vs/",
      "text": "Just 2-3 more months! Power through it and give your final push before you can't anymore; I know you can!!",
      "author": "SilverArtichoke",
      "created": 1570405362,
      "upvotes": 72,
      "replies": {}
    },
    "f2u7wau": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u7wau/",
      "text": "my dad is 73 y/o i feel you man ):",
      "author": "seniorthrowaway00003",
      "created": 1570409644,
      "upvotes": 47,
      "replies": {
        "f2ua16d": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ua16d/",
          "text": "In his 80s for me 😬",
          "author": "Mithyi",
          "created": 1570411199,
          "upvotes": 38,
          "replies": {
            "f2uamxo": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uamxo/",
              "text": "I just want to say that your comment and u/seniorthrowaway00003 's helped me put things in perspective and be grateful for what I do have. Lets all make the most of or situations. Stay strong guys.",
              "author": "Every_Muffin",
              "created": 1570411646,
              "upvotes": 36,
              "replies": {}
            },
            "f4pfo5u": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f4pfo5u/",
              "text": "My dad is 40",
              "author": null,
              "created": 1571728154,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f2ubg49": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ubg49/",
          "text": "Mines 62 but I notice every day how much worse he's getting. Him and I are never exactly on good terms but still it's hard to see a parent like that",
          "author": "falloutkittens_",
          "created": 1570412248,
          "upvotes": 15,
          "replies": {}
        },
        "f2ub278": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ub278/",
          "text": "Yeah me too. I also have a brother who most likely cannot live independently.",
          "author": "JayJC719",
          "created": 1570411959,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "f2u9owu": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u9owu/",
      "text": "Read the book \"Excellent Sheep\", about the insane hamster wheel that is called \"achievement\".  You're right, it never ever ends.  Don't waste your life. Your instincts are good.",
      "author": "rkat51",
      "created": 1570410950,
      "upvotes": 20,
      "replies": {}
    },
    "f2u8d1x": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u8d1x/",
      "text": "You’re definitely not alone in this. Something I’m really scared of is somehow making it to a good college, and still not being happy. \n\nBut like what other comments mentioned, your achievements are no small feat. I think it’s a good idea to figure out what you want to do in life when you have some free time, and know that it’s not the same or as easy to figure out, for everyone. \n\nDon’t play the game if you don’t want to, and good luck in the future!",
      "author": "Saeyrah",
      "created": 1570409987,
      "upvotes": 16,
      "replies": {}
    },
    "f2u9unb": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u9unb/",
      "text": "[deleted]",
      "author": null,
      "created": 1570411067,
      "upvotes": 13,
      "replies": {
        "f2uetiu": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uetiu/",
          "text": "Don't think of working hard and enjoying life as mutually exclusive. That's a common trap that many students fall into. It's okay to not be 100% academic 100% of the time. Life isn't just about accolades, grades, and getting some job that you aren't even sure you want yet. Being ambitious shouldn't come at the cost of your sanity.\n\nSource: I have worked hard and had a lot of fun along the way.",
          "author": "Hoosierthrowaway23",
          "created": 1570414691,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "f2u9ypx": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u9ypx/",
      "text": "Dude I felt this. And guess what? Im not someone who can get into a T20 anyways. I work my ass off and am miserable all the time and its not even gonna pay off that much. I'll probably end up going to a school just about anyone can go to. Bc yeah i may be a good student, but I'm not a top 1%. Maybe I'm a top 2%, according to my act score. but top 2% isnt good enough to go to Harvard or Yale or Duke or Rice or wherever the fuck. So whats the point? Why did i do this to myself? My weighted gpa is a 3.9 as Im starting junior year. Yeah itll be a 4.1 by then end of this year but thats not gonna erase the Bs i got from being too stupid or too depressed to do well in some of my classes. Yeah a 4.1 will look okay but its not gonna get me anywhere special.\n\nAnd to make matters worse, i dont feel smart. I dont have skills. The only skill I have is making myself look smart-ish on paper (but not smart enough). Thats not gonna get me a successful career. I am useless. My brain is empty. I do my classes and forget all of the information. I dont have the ability to learn anything. I may look smart, but I am the dumbest person I know.\n\nI have spent these last couple months being consumed by the overwhelming fear of failure, now that I actually have to start thinking seriously about college. Ive spent hours looking at what school I can or can't get into. The scores I need, the gpa I need, the ECs I need. But why? Last year I was convinced Id kill myself by 30 because I knew id be failing life by then. I have been doing better and have been more hopeful, but Im falling back into my old mindset. \n\nIm currently writing this instead of doing my homework. I sat around all day feeling like shit. I flaked on my friends birthday party because I felt too depressed to leave my house. I dont even get enjoyment out of watching YouTube or TV because I have no attention span. I'm literally rotting away.\n\nWas is worth it?\n\nedit: oh dang thanks for silver lol i really don't deserve it bc this is just me being a whiny bitch ahaha but thanks <3",
      "author": "imsadandrad",
      "created": 1570411149,
      "upvotes": 35,
      "replies": {
        "f2u9yxx": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u9yxx/",
          "text": "If you or someone you know is contemplating suicide, please do not hesitate to talk to someone.\n\n**US:**\n\nCall 1-800-273-8255 or text HOME to 741-741\n\n**Non-US:**\n\n[https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines](https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines)\n \n --- \n \n^^I ^^am ^^a ^^bot.  ^^Feedback ^^appreciated.",
          "author": null,
          "created": 1570411154,
          "upvotes": 26,
          "replies": {
            "f2unk0y": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2unk0y/",
              "text": "[deleted]",
              "author": null,
              "created": 1570421747,
              "upvotes": 1,
              "replies": {
                "f2unk4o": {
                  "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2unk4o/",
                  "text": "Thank you, Theandso, for voting on SuicideAwarenessBot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                  "author": "B0tRank",
                  "created": 1570421750,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f2ucs7k": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ucs7k/",
          "text": "If it means anything I also feel a lot less smart than I seem, but we have to remember that we don't see what's behind the scenes for anyone else and that many of them probably feel this way too (and focus too much on the negatives, scoring in the top 2% as a junior is definetly something to be proud of). We all have to keep a good perspective and remember that the vast majority of people don't end up at T20s and live perfectly good lives. I encourage you to try not to read into things so much. I did a lot of the same when I discovered this subreddit and it does a lot more harm than good. Stay strong.",
          "author": "Every_Muffin",
          "created": 1570413225,
          "upvotes": 7,
          "replies": {
            "f2vh3td": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2vh3td/",
              "text": "thanks man. same goes for you. I know things will work out and i try to remind myself of that, but sometimes its a little hard to stay grounded",
              "author": "imsadandrad",
              "created": 1570452450,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f2uje77": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uje77/",
          "text": "[removed]",
          "author": null,
          "created": 1570418151,
          "upvotes": -17,
          "replies": {}
        }
      }
    },
    "f2ua1te": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ua1te/",
      "text": "Fuck the system, I feel you.",
      "author": "Bibliophile20",
      "created": 1570411213,
      "upvotes": 12,
      "replies": {}
    },
    "f2uve4y": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uve4y/",
      "text": "I went to a top 20 undergrad and then went to a top 10 law school....believe it or not, school was the easy part.  After law school was when the hard work started....I had never worked so hard in my life as I did as a corporate lawyer.  So yeah, if you take the hard route, it doesn't get easier, but you might end up making more money.   In the end I realized that working your ass off in grueling hours for big money wasn't worth it and just ended up taking a normal, lower paying job. I don't regret going to good schools, but I do regret being so goal-oriented because it made me miss out on a lot of other things in my youth. If had a broader perspective, I might have taken more risks and done something more enjoyable in my youth.\n\nThe reality is, life is very short and then you die.  From a big picture perspective, unless you are at the extremes (a billionaire or homeless), your life will be more or less like most people's lives.  When you are a kid, you think everything is a big deal, but it's not.  Most people just end up with mediocre, middling lives and then they die. So I say you should go to a good school, but also keep perspective --- most things don't matter and unless you are at the extremes, your life will be more or less mediocre.  Accepting mediocrity is just a part of maturing as an adult.",
      "author": "nyclawyer0101",
      "created": 1570430989,
      "upvotes": 9,
      "replies": {}
    },
    "f2ucgqo": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ucgqo/",
      "text": "This. Holy shit. My dad battled colon cancer bravely and is now around 57, but I guess it’s just motivated me even more to do as well as I can. I haven’t succeeded, heck I’ve failed quite more than I’ve done well, but I know and hope that I can continue to just push myself to be the best version I can be. As soon as you shift from focusing on an end goal to just accomplishing each day at a time, it becomes so much more clearer and motivating to do well.",
      "author": "GeoGod678",
      "created": 1570412999,
      "upvotes": 7,
      "replies": {}
    },
    "f2udeyr": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2udeyr/",
      "text": "I think your issue is that your only goal is a letter grade. Instead either have other goals, working out, improving social skills, meeting more ppl, go to parties, try new sports and experiences. If all that means ur grades suffer then so be it. \n\nI’m in college now and I grinded for grades and scores all hs, now my life is way better because I’m doing this I enjoy, yes my grades aren’t great anymore. I do well in classes that matter and enjoy (CS classes) and pass the rest, and spending my free time enjoying life meeting ppl going to concerts, etc.\n\nTrust me grind out hs, u can def start fresh in college.",
      "author": "hzd07",
      "created": 1570413678,
      "upvotes": 9,
      "replies": {}
    },
    "f2uoz66": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uoz66/",
      "text": "Hey, I'm a college freshman still lurking on this sub, saw this post and wanted to offer some support. I understand your concerns, I was in a similar place last year. It can suck when everyone around you expects you to do well no matter what. Sometimes you just need to take a break. And honestly, I think a small break is what you need. What made my senior year so much better was just spacing out my time to hang out with friends and family more. Did some of my work or essays suffer? Sure. But it was nice to just strengthen those bonds.\n\nThat said, don't give up on this stuff. Those arbitrary letter grades may seem like pointless metrics you broke yourself over. But I think there's more to it than that. There's all the people you've been able to connect with over the struggles of classes, all the teachers you've gotten close to, and perhaps some subjects that you've become more interested in. Those classes and tests are unnecessarily stressful and anxiety-inducing yes, but they've also made you more worldly, able to connect with more people and perspectives. I encourage you to find those positive aspects of those moments, because that's probably the easiest start to reenergizing your support system.\n\nSo to end, I'd say, go talk to your dad and some friends. Try and set aside a time to hang out with them over the weekend and let yourself breathe. And try not to let this system discourage you from all achievement. There is still plenty you've got to offer for the world.",
      "author": "Potassium_Osmium",
      "created": 1570423162,
      "upvotes": 7,
      "replies": {}
    },
    "f2u6vfu": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u6vfu/",
      "text": "It hurts how relatable this is. We need to start a subreddit for students struggling with mental health issues",
      "author": "xdnshdjjskl",
      "created": 1570408886,
      "upvotes": 11,
      "replies": {
        "f2u8h4g": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u8h4g/",
          "text": "Completely unrelated... but how the hell do you remember your username",
          "author": "ILackAnAttentionSpan",
          "created": 1570410068,
          "upvotes": 11,
          "replies": {
            "f2u9dse": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u9dse/",
              "text": "I’m always logged in on my phone because I only use mobile also I have it written down in my notes LOL",
              "author": "xdnshdjjskl",
              "created": 1570410720,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "f2ubavu": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ubavu/",
          "text": "Done. r/A2CTherapy",
          "author": "Dimitri_I_S",
          "created": 1570412137,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "f2uikr3": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uikr3/",
      "text": "it's not a game,,,\n\nIdk abt others, but I for one, am perfectly happy with not having a 4.0 because I lost that 0.04 to pursue whatever I like- sports and clubs and organizations and hobbies and I won't regret it at all if I get rejected from my dream schools because even if I lose the brief sense of accomplishment that comes with getting into a prestigious school, I did what I liked and it developed my character and made me into who I am today. Even if it's something that changes the course of my life, I don't care, because I'd rather starve to death because I chose to do what I love than  lose my personality (not that you have op) to something as meaningless as school.",
      "author": "owlswearwatches",
      "created": 1570417501,
      "upvotes": 4,
      "replies": {
        "f2ul801": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ul801/",
          "text": "Same, even though I don’t have a perfect gpa I’m glad that I did what I wanted to in highschool.",
          "author": "youOnlyliveTw1ce",
          "created": 1570419598,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f2u6bsw": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u6bsw/",
      "text": ">Was the SAT score worth it? Is the fucking number 4.0 worth it?\n\nYes and yes. Also, talk to your dad.\n\nEDIT: Remember that for every story like this, there's someone who screwed up their life by not trying in High School. Better to be in your position than theirs.",
      "author": null,
      "created": 1570408486,
      "upvotes": 30,
      "replies": {
        "f2u7ici": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u7ici/",
          "text": "Some people figure their shit out at a different time. You can totally slack off in high school and figure stuff out in college.\n\n\nI'd honestly rather go to my state school (hell, even community college) and be satisfied with who I am (my values, personality, interests) than be regretting my high school choices. (and by no means is this an attack on OP, it's just my opinion)",
          "author": "LRFE",
          "created": 1570409352,
          "upvotes": 26,
          "replies": {}
        },
        "f2uknmv": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uknmv/",
          "text": "[removed]",
          "author": null,
          "created": 1570419141,
          "upvotes": 1,
          "replies": {
            "f2vapl8": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2vapl8/",
              "text": "Here’s the thing. You could find plenty of examples where people mess up their lives in high school and came back to be successful. But for each example like that, there’s 999 others like it that didn’t bounce back. Your examples of John and Hank Green are clear examples of survivorship bias",
              "author": null,
              "created": 1570449362,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f2uadfq": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uadfq/",
      "text": "Life is not about optimizing for one thing, in your case grades. It is about optimizing for multiple things: grades, yes, but also making friends, and having fun, and sleeping well, and eating well, and finding love and all that. Ironically, top colleges don't even want people that only optimize for grades, they want people that can optimize for all of these things and maybe also excel at one or two other things. Famously, or perhaps not that famously, there is an account of a girl getting into Harvard not because she had stellar grades or superb extracurriculars or whatever, but just because she was really really nice.",
      "author": "1millionbucks",
      "created": 1570411454,
      "upvotes": 3,
      "replies": {}
    },
    "f2ud44j": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ud44j/",
      "text": "Fuck collegeboard!",
      "author": "andy7601",
      "created": 1570413463,
      "upvotes": 3,
      "replies": {}
    },
    "f2ufkld": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ufkld/",
      "text": "I think you’re lucky to be able to get into a T20 and all that, I’m gonna end up having to go to community college because of how little I cared",
      "author": "Bully-Hunter_77",
      "created": 1570415242,
      "upvotes": 3,
      "replies": {
        "f2ug9t8": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ug9t8/",
          "text": "Thank you for helping me keep things in perspective. I wish you the best of luck wherever you end up.",
          "author": "Every_Muffin",
          "created": 1570415752,
          "upvotes": 4,
          "replies": {
            "f2ugbxc": {
              "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ugbxc/",
              "text": "Thanks man, but try not to over work yourself",
              "author": "Bully-Hunter_77",
              "created": 1570415797,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "f2ub3u1": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ub3u1/",
      "text": "don't give up now. you've already spent so much effort doing this, might as well finish it or it will all be a waste. i know it seems bleak now, but once you get into a good school and graduate, you'll have a lot of job opportunities, you'll have a good salary and you can enjoy life then. if you push through now, you'll have an easier time when you're older",
      "author": null,
      "created": 1570411993,
      "upvotes": 2,
      "replies": {}
    },
    "f2uhvjh": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uhvjh/",
      "text": "the only way to win the game is to not play",
      "author": "powerplayer75",
      "created": 1570416974,
      "upvotes": 2,
      "replies": {}
    },
    "f2uoddj": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uoddj/",
      "text": "You’ve gotten some great advice here. I don’t have a lot to add except that I want you to remember how you feel right now and try to use this feeling as you move forward in life.  It’s all about finding a balance and focusing on our mental and emotional health and our families will need to be the priority in our lives at times — if not most of the time.  Take some time now to reflect and write about your experiences with this journey.  Sit back and talk to your parents. Hang with friends. Read. Take walks. You have time to get everything done. You’ve accomplished the first and hardest step — the recognition that changes need to be made.  Take care. 😊💙",
      "author": "admissionsmom",
      "created": 1570422545,
      "upvotes": 2,
      "replies": {}
    },
    "f2uq0a8": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uq0a8/",
      "text": "It's not too late to course-correct! The key thing is you know you're unhappy. Agree w/ other commenters that that can actually bleed into your apps and hurt you. But it's not too late to adjust your app strategy so you can a) enjoy your senior year/life and b) land somewhere where you can be happy. If that's your state school option that's fine! But it's more likely going to be a matter of fit and, indeed, expanding beyond T20 schools. \n\nI was also miserable with the rat race way back when, when it wasn't even half as bad as it is now, and I have no regrets jumping off the track and going my own way senior year and with college apps. I took the APs I wanted to take b/c I wanted to take them (including AP Art and Psych). I refused to apply to any schools that would attract psycho overachievers and make my four years of college miserable. I focused on schools that had a social culture I would enjoy, in places I wanted to live, that had great journalism programs (rather than looking at name brand schools that happened to also maybe have a journalism major). I LOVED college--I felt I could be creative and driven, but have fun. I developed massively as a person and got past all the \"gifted program\" bullshit and I'm a well-adjusted, successful (post quarter life crisis) adult. You'll be ok!\n\nSo think about what you DO like, and make adjustments where you can. Drop activities that are draining you, and try something new. Pull back on academics where you can (though I wouldn't bomb senior year) so you can engage in leisure activities. Marathon TV shows. Play video games. Whatever. \n\nThen look at a broader range of schools, focusing on things beyond academics that you think might bring you some joy. Clubs/ECs you might like to try (newspaper? crew? anime club?), a social scene you think might work for you so you can make friends and have some fun, a place you'd like to live for four years. And you know: maybe it is staying close to home so you can spend more time with your dad, if you want to? A location that makes it easy to come home for long weekends/every break. \n\nDon't think of any of the work as wasted, but as the groundwork you laid (and paid a price for) that will be the foundation of a better experience going forward. I actually found college way less stressful than high school, and if you concentrate on social fit, you'll find that the grind isn't endless/quite as bad (depending on school and major of course).",
      "author": "alexatd",
      "created": 1570424257,
      "upvotes": 2,
      "replies": {}
    },
    "f2ursdk": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ursdk/",
      "text": "Hey if you want someone to chat with just hit me up, you just seem like you can use someone to talk to",
      "author": "Self_World_Future",
      "created": 1570426284,
      "upvotes": 2,
      "replies": {}
    },
    "f2v32ig": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2v32ig/",
      "text": "This is a prime example of what’s wrong with our current education system, forcing kids to study so hard with such a low “payout”",
      "author": "MrHuggiekins",
      "created": 1570443393,
      "upvotes": 2,
      "replies": {}
    },
    "f2vwtpz": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2vwtpz/",
      "text": "You don't have to go to a T20 to be happy and successful. You don't have to make yourself miserable to be happy and successful. \n\nWhat really matters to you? What is the life you want? You don't have to choose the life others want for you. You can decide who you are going to be. \n\nTake some mental health and family time now, because you can always work on getting more education, but you can never get back lost time with family. Even if it's just something fun on the weekends. \n\nAnd talk to your dad about how you want more time with him and let him know he matters to you. \n\n**Full disclosure:** It would be unethical for me not to mention that I am employed by a university.",
      "author": "Jamestown_Jimmies",
      "created": 1570458424,
      "upvotes": 2,
      "replies": {}
    },
    "f2w1uub": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2w1uub/",
      "text": "go get some therapy dude",
      "author": "shadowpreachersv",
      "created": 1570460236,
      "upvotes": 2,
      "replies": {}
    },
    "f3hpl4k": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f3hpl4k/",
      "text": "Oh fuck off you’re almost there \n\nSuck it up",
      "author": "GoodBull1748",
      "created": 1570926881,
      "upvotes": 2,
      "replies": {}
    },
    "f2u6m0n": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u6m0n/",
      "text": "i relate to this so much",
      "author": "turboify",
      "created": 1570408696,
      "upvotes": 2,
      "replies": {}
    },
    "f2uakaj": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uakaj/",
      "text": "Hell yeah I feel that. I guess I deal with it by doing what I want to do. Yeah there's this extracurricular I can join, that volunteer I can go, this contest I can participate.. but if I don't want to do it I don't do it. I set my goal at t30-50 schools and I try to just match the criteria required, not doing too much and obviously not too little. \n\nI guess in short, do the stuff u WANT to do and work toward YOUR own goal. You can always do more but you gotta know when to stop. And the majority of your motivation should be internal, not external. Hope that make sense",
      "author": "Stewie9k",
      "created": 1570411591,
      "upvotes": 1,
      "replies": {}
    },
    "f2ubhqu": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ubhqu/",
      "text": "Me too",
      "author": "Poiuqwertz",
      "created": 1570412281,
      "upvotes": 1,
      "replies": {}
    },
    "f2ubtn8": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ubtn8/",
      "text": "Lots of T20 schools have a helluva party scene.",
      "author": "Aheadboat",
      "created": 1570412530,
      "upvotes": 1,
      "replies": {}
    },
    "f2udla3": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2udla3/",
      "text": "Lot of positivity here. I'm somebody who is around where you are at. But I didnt even work hard or get into a top 20, and went to my state school. Just remember you can complain but its really on you. I went to college to get out of my comfort zone and meet new people and build my life and I barely leave the dorm room except to eat or go to class. It doesn't happen to you, you have to make it happen. But for some reason I freeze and can't. So get out there before it gts too bad. Dont give yourself an excuse to not get out there now.",
      "author": "Kobe_AYEEEEE",
      "created": 1570413805,
      "upvotes": 1,
      "replies": {}
    },
    "f2ue5z2": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ue5z2/",
      "text": "Y’all really need to party and balance your social lives more",
      "author": "fmemate",
      "created": 1570414228,
      "upvotes": 1,
      "replies": {}
    },
    "f2uezz1": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uezz1/",
      "text": "im sorry you're feeling burnt out dude :(   \ni think a lot of people on this sub including myself can relate but it definitely doesn't seem like it at times. hang in there! once we turn in our apps and the wait is over (easier said than done tho lol) senior year is gonna be a blast",
      "author": "throwa2c",
      "created": 1570414815,
      "upvotes": 1,
      "replies": {}
    },
    "f2ufcw0": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ufcw0/",
      "text": "High school never ends fair warning",
      "author": "justinint",
      "created": 1570415082,
      "upvotes": 1,
      "replies": {}
    },
    "f2uhup2": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uhup2/",
      "text": "I feel you, but for me the problem isn't really from my standards or expectations for myself; I just don't want to let down everyone else who expects and believes that I can get into a T20 school",
      "author": "count2v",
      "created": 1570416957,
      "upvotes": 1,
      "replies": {}
    },
    "f2ukvg0": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2ukvg0/",
      "text": "Hey, I think you just need to relax a bit with your effort. This doesn't mean to just stop trying and have your grades drop, but don't put so much effort in that it sacrifices your mental health. I was taking 2 AP this year, dropped 1 AP and replaced it with a daily study hall, and I just got accepted into a college yesterday. I was very concerned that could dick me over, but it didn't. If you have a 4.0 GPA, you're absolutely fine. You can get into plenty of good schools. I had a shitty 10th grade but recovered and was still ok in the end. Things will turn out fine. I felt the same, and still do actually. I question every day if my effort is worth it and if I should still be trying hard for my future, not knowing how it will turn out no matter how much effort I put in. But then I think \"well, I won't have any chance at all of success if I don't try!\" after looking at the shitty situation my parents are in, and I get the motivation to dream bigger. I struggle daily with my extremely bad attention skills and procrastination, but I just have to push through. That's life. It's shit, but one day you won't have to be in the education system anymore and will be able to live your life as you please. That's what makes the effort worth it. Work towards that day. It isnt as far away as you think. Time flies. Good luck, my friend.",
      "author": "azzeeter",
      "created": 1570419316,
      "upvotes": 1,
      "replies": {}
    },
    "f2uo5a3": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uo5a3/",
      "text": "Smoke some good weed , think about it and listen to your subconscious mind , then come back and tell me how you feel.",
      "author": "MrSittingBull",
      "created": 1570422326,
      "upvotes": 1,
      "replies": {}
    },
    "f2uqmj4": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uqmj4/",
      "text": "Itll be worth it in college trust me. As long as you dont go to a T20 with an absurd amount of work, and you can balance your life itll be much easier to enjoy life than in HS",
      "author": "Zakmza123",
      "created": 1570424939,
      "upvotes": 1,
      "replies": {}
    },
    "f2uqqa6": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uqqa6/",
      "text": "Dude I understand where you're coming from. I moved to a small town from a huge city my senior year and it's impossible to have fun because everyone else has known each other since they came out of the womb and I'm just here working away trying to write my future. I wish my senior year could be more fun, but sometimes our life circumstances get in the way. However, don't throw everything you've worked for away. Instead, find a way to reform your work habits and allow yourself to meet new people and travel to new places if you get the chance. Just learn to have fun with your life no matter what your circumstances are, even if that is hard to see right now.",
      "author": "TrojanFan2024",
      "created": 1570425056,
      "upvotes": 1,
      "replies": {}
    },
    "f2urr9s": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2urr9s/",
      "text": "Yeah, I get it honestly, I was never a glorious student by any means. I’m at my state school. Man, don’t worry about what you did in the past, it’s behind you now, but how you differ from me is that you have an accomplishment that can take you far. And now that you know how you really feel, focus on things that you enjoy, maybe even make it a priority over school, I don’t know.\n\nIs it good advice to fuck school off for a bit to expand your own personal interests? I don’t know, but sometimes we all need a break from things like that.",
      "author": "Mackss_",
      "created": 1570426247,
      "upvotes": 1,
      "replies": {}
    },
    "f2uu79c": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uu79c/",
      "text": "Your fine man and as you get older you will understand most people feel that way.\nBig world but in a way were all alone.",
      "author": "purpleloyd",
      "created": 1570429348,
      "upvotes": 1,
      "replies": {}
    },
    "f2uwmnr": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uwmnr/",
      "text": "Mood my exact feelings and thoughts! We will make it through buddy",
      "author": "1omegalul1",
      "created": 1570432806,
      "upvotes": 1,
      "replies": {}
    },
    "f2vsi8n": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2vsi8n/",
      "text": "I felt this way too at one point. However, I quickly realized that school should never be the main focus. Life is about having fun and doing what you enjoy, so I took it upon myself to place all of that other junk on the side. I’ve been able to balance both sides of the spectrum. I make time for what I enjoy as well as school stuff.",
      "author": "myles295",
      "created": 1570456839,
      "upvotes": 1,
      "replies": {}
    },
    "f2w5j42": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2w5j42/",
      "text": "Reminds me of this speach by Alan Watts. Made into a great video on YouTube:\n\nhttps://youtu.be/rBpaUICxEhk\n\nIt's not to downplay the importance of improving your life through education or advancement, but that isn't the point of life, enjoy the moment, enjoy the time you spend in life.\n\nLife isn't a journey, with the point to get to the end. Life is a song, it has ups and downs, enjoy them.",
      "author": "GreenHairyMartian",
      "created": 1570461571,
      "upvotes": 1,
      "replies": {}
    },
    "f2w6j1r": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2w6j1r/",
      "text": "Oh jeez - go to your flagship.   I have a 1% kid at a good flagship and it's been a nice balance.  And it's about 1/3 the price of fancier schools he applied to.   You can have unique opportunities as a top student at a school like this.\n\nAnd don't buy any of this \"good school\" crap.  There are hundreds of good schools out there.   Maybe a gap year would be healthy for you?   Consider talking to someone about this to help process.\n\nNo one can force you to ED to a school you don't want to attend.  And that is a binding agreement assuming the finances work so don't do it if you are not 100% sure.",
      "author": "KickIt77",
      "created": 1570461945,
      "upvotes": 1,
      "replies": {}
    },
    "f2wlcbp": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2wlcbp/",
      "text": "Then dont play. Make your own path through life.",
      "author": "smartymarty1234",
      "created": 1570467156,
      "upvotes": 1,
      "replies": {}
    },
    "f2xdopg": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2xdopg/",
      "text": "Hint of advice, but even the T20s have a good party scene and you would still get to learn those \"valuable\" lessons while also getting a quality education. Don't waste your accomplishments and work so far, its not worth it. Its better to just go into college with a better attitude and open mind (unless you're a pre-med, then you are fucked (jk)). Good luck",
      "author": null,
      "created": 1570477009,
      "upvotes": 1,
      "replies": {}
    },
    "f2xfs65": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2xfs65/",
      "text": "honestly man same. but we got this, lets persevere!",
      "author": "sugarplumfairy1234",
      "created": 1570477913,
      "upvotes": 1,
      "replies": {}
    },
    "f2y0e2r": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2y0e2r/",
      "text": "High school can get really stupid at the end, not that much content but you have to be so careful with grades.  The content and teacher quality will go up infinitely in college, either a state flagship or private research university.  So you'll be fine either way.\n\nBut having to work hard won't end.  Other people are willing to work hard for money, so you won't get money, or success, unless you also work hard.  The work will be harder but less stupid.\n\nI hope your dad isn't stressing out too much about this, and I wish him good health and a long life.",
      "author": "cover20",
      "created": 1570484666,
      "upvotes": 1,
      "replies": {}
    },
    "f32oyg4": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f32oyg4/",
      "text": "This entire thing describes how I feel about school. Yes, there are some people in school that make it somewhat easier, but at the end of the day, you’re still stressed and it’s like that everyday. I’m only in high school and I’m already tired of the game.",
      "author": "nihilisticgenz",
      "created": 1570621001,
      "upvotes": 1,
      "replies": {}
    },
    "f3cmewh": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f3cmewh/",
      "text": "God, this is my trajectory. I am so scared.",
      "author": null,
      "created": 1570825711,
      "upvotes": 1,
      "replies": {}
    },
    "f5g457p": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f5g457p/",
      "text": "I know I’m late to this. But I feel compelled to respond.\n\n1. I need you to know that you are valuable and worthwhile, not because of the numbers on your transcript, but because of who you are. You are inherently valuable and you matter. Your GPA and test scores can’t touch that. \n\n2. Your hard work will pay off. Don’t give up. \n\n3. This might not be a popular opinion, but you’re right, your metrics are not the end-game. Pursuit of knowledge, of growth, and seeking experience are what make life rich and meaningful, and make individuals successful.\n\n4. As a human, you have a birthright to make your own meaning; to find success however you define it. That doesn’t mean everyone will agree with you or support those definitions, but ultimately, at the end of the day, you have to answer to you. \n\n5. Things will get better. As you get older, you will have more control over how you spend your time, energy, and which areas of your life you want to grow. It is never too late to develop different parts of your life. The illusion of high school is that you are expected to leave it as a fully developed human with everything set in place for the rest of your life. That’s just not the truth. Life is a constant work-in-progress; a series of seasons where growth looks different at different times. \n\n6. Be kind to yourself. Take care of yourself. You are worthwhile and you are enough. That’s not just fuzzball, feel-good, new age nonsense. Self-care and self-respect actually matter. Do what you need to do to be healthy. \n\n\nAnyway, this might not be addressing your concerns entirely or even at all, but I need you to know those things. Too many students don’t hear this, and really really need to.",
      "author": "mkbeebs",
      "created": 1572189508,
      "upvotes": 1,
      "replies": {}
    },
    "f2uhzqq": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uhzqq/",
      "text": "Problem is viewing it as a game. I can somewhat relate as my parents tried to do that with me but couldn't really. I was always very clear that I didnt care abt prestige and I cared about what was possible after. For my major choice as well, a selective undergrad won't make a difference but a selective grad school will. Thus I was an average student in school. I am smart enough to probably get straight A's but I'd rather enjoy the stuff I'm learning and value time with friends. I worked hard in high school but not crazy. My parents have kinda accepted that I'm a little lazy and will let me discover myself in college.",
      "author": "ApsSuck",
      "created": 1570417061,
      "upvotes": 0,
      "replies": {}
    },
    "f2u9lxj": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2u9lxj/",
      "text": "[removed]",
      "author": null,
      "created": 1570410888,
      "upvotes": -7,
      "replies": {
        "f2uk8nc": {
          "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uk8nc/",
          "text": "lmao tough guy here",
          "author": "diogenes42069",
          "created": 1570418810,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f2uvq1w": {
      "link": "/r/ApplyingToCollege/comments/deaqv2/im_tired_of_this_game/f2uvq1w/",
      "text": "Hello, sorry for what you going through.. Strategize yourself well and things will flow. Reach out to me through paigeprowriter@gmail.com and let me handle all your assignments to make life school a bit easier....I guarantee you A in all your papers",
      "author": "Propaige",
      "created": 1570431463,
      "upvotes": -2,
      "replies": {}
    }
  }
}