{
  "sid": "qehlou",
  "link": "/r/ApplyingToCollege/comments/qehlou/my_counselor_said_i_dont_need_to_send_my_dual/",
  "title:": "My counselor said I don't need to send my Dual Enrollement transcript, but UT says otherwise online",
  "text": "I have taken the equivalent of 12 college credit hours of dual enrollment classes at my school and was wondering if I needed to send the transcript now, or if I can send it once I get accepted. My college career counselor said don't worry about it now, but on UT's website for undergraduate admissions it says to send dual enrollment official transcripts to UT. Is this referring to once accepted? Do I need to worry about this now?",
  "author": "boogerboy12345",
  "created": 1635037000,
  "updated": 1635182927,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hht2xq2": {
      "link": "/r/ApplyingToCollege/comments/qehlou/my_counselor_said_i_dont_need_to_send_my_dual/hht2xq2/",
      "text": "If UT's website says to send them, then send them. High school counselors may not know the application requirements for every college.\n\nSee also r/UTAdmissions",
      "author": "elkrange",
      "created": 1635037539,
      "upvotes": 3,
      "replies": {
        "hht5dn4": {
          "link": "/r/ApplyingToCollege/comments/qehlou/my_counselor_said_i_dont_need_to_send_my_dual/hht5dn4/",
          "text": "Thanks! I'll make sure to ask that sub as well. :)",
          "author": "boogerboy12345",
          "created": 1635038731,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hht2fii": {
      "link": "/r/ApplyingToCollege/comments/qehlou/my_counselor_said_i_dont_need_to_send_my_dual/hht2fii/",
      "text": "That's a good question to reach out to your local admissions officer and ask.\n\nFor what it's worth, I did that for a college and was told that if the classes are included on the high school transcript that the college doesn't need them for admission. \n\nThe college will need the final transcript from the dual enrollment university when you've completed all of the courses.\n\nThat said, if you're not currently taking any dual enrollment classes and you're done with all of them, you could request and send it now.",
      "author": "Calvin-Snoopy",
      "created": 1635037296,
      "upvotes": 1,
      "replies": {
        "hhtc2vi": {
          "link": "/r/ApplyingToCollege/comments/qehlou/my_counselor_said_i_dont_need_to_send_my_dual/hhtc2vi/",
          "text": "I second this. I would also advise you to err on the side of caution: if there's no reason not to send the transcript I don't see why you wouldn't go ahead even of it's ultimately not necessary",
          "author": "miles3141",
          "created": 1635041975,
          "upvotes": 2,
          "replies": {}
        },
        "hht5cfs": {
          "link": "/r/ApplyingToCollege/comments/qehlou/my_counselor_said_i_dont_need_to_send_my_dual/hht5cfs/",
          "text": "I'll probably ask my college counselor again, but I am currently taking dual enrollment classes so what you said about not sending the transcript till I've completed them makes sense. I'll double-check though. Thank you!",
          "author": "boogerboy12345",
          "created": 1635038715,
          "upvotes": 1,
          "replies": {
            "hht7403": {
              "link": "/r/ApplyingToCollege/comments/qehlou/my_counselor_said_i_dont_need_to_send_my_dual/hht7403/",
              "text": "I asked the high school counselor and was told to send them now, but the college admissions rep at one of the schools my student is applying to said to wait and just send the final one after courses are completed. Definitely check with college/university admissions people directly.",
              "author": "Calvin-Snoopy",
              "created": 1635039569,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}