{
  "sid": "qfnn24",
  "link": "/r/ApplyingToCollege/comments/qfnn24/how_can_i_find_the_best_university_for_me/",
  "title:": "How can I find the best University for me???",
  "text": "Everything is in the title.",
  "author": "Efficient_Medium_661",
  "created": 1635188102,
  "updated": 1635302201,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hi0suvt": {
      "link": "/r/ApplyingToCollege/comments/qfnn24/how_can_i_find_the_best_university_for_me/hi0suvt/",
      "text": "Think of it like romantic relationships.  There is not one single \"best\" person for you.  There are potentially many people with whom you could be happy.  But it's not always possible to be sure; sometimes people get it wrong.  Divorce happens.\n\nSome things you can do:\n\n1. Research a school's stats, including how much it will cost.  For cost, I'd try to estimate best/worst/expected case.\n2. Look at some of the student survey results on Niche, however take these with a grain of salt.\n3. Accurately estimate how likely it is you'll even be admitted.  Some schools you don't even need to consider if they're a practical impossibility.\n4. Consider things like where it's located, weather, gender ratio, political skew, racial diversity, economic diversity, political leanings, etc. if any of those are important to you.  (Nothing says they must be.)\n5. Go to virtual info sessions.  (These may not actually be that helpful, but worth a shot.)\n6. Visit the campus.  Sometimes you get a \"vibe\".  Sometimes good, sometimes bad.\n7. Realize that you don't have to optimize down to the point where you have one single \"dream\" school.  It's fine to have a set of schools where you think you'd be content at \\*any of them\\*.  This is arguably much more healthy (and less likely to result in disappointment) than having one \"dream school\".",
      "author": "jayphoward",
      "created": 1635189786,
      "upvotes": 6,
      "replies": {
        "hi11hx1": {
          "link": "/r/ApplyingToCollege/comments/qfnn24/how_can_i_find_the_best_university_for_me/hi11hx1/",
          "text": ">There is one \"best\" person for you.\n\nMissing “no” in there?\n\n😎",
          "author": "Strict-Special3607",
          "created": 1635193233,
          "upvotes": 1,
          "replies": {
            "hi12ynu": {
              "link": "/r/ApplyingToCollege/comments/qfnn24/how_can_i_find_the_best_university_for_me/hi12ynu/",
              "text": "Corollary:  Always proof-read your essays.",
              "author": "jayphoward",
              "created": 1635193814,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hi1s1ub": {
      "link": "/r/ApplyingToCollege/comments/qfnn24/how_can_i_find_the_best_university_for_me/hi1s1ub/",
      "text": "There is no “best” one for me. There are a bunch that would be great for different reasons. And that’s ok. I’ll apply to a bunch (around 15). Then, assuming I get accepted to more than one - I can make a real choice rather than a hypothetical choice.",
      "author": "WorriedTurnip6458",
      "created": 1635204663,
      "upvotes": 1,
      "replies": {}
    }
  }
}