{
  "sid": "q6cgp3",
  "link": "/r/ApplyingToCollege/comments/q6cgp3/should_i_write_the_moving_essay/",
  "title:": "Should I write the moving essay?",
  "text": "I know this topic is considered unfavorably here, but I was thinking about writing it in some form for the additional info essay. Moving messed me up frshman and sophomore year but i sort of got my shit together junior year and have decent ec's, decent grades, and my sat is good. Im hesitant to write it out of fear that colleges will see it as a sob story, or that im just making excuses for myself. Also, i know people who moved as well who did better than me, so.... Thoughts?",
  "author": "pee_sommelier",
  "created": 1634007349,
  "updated": 1634072907,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgbmszf": {
      "link": "/r/ApplyingToCollege/comments/q6cgp3/should_i_write_the_moving_essay/hgbmszf/",
      "text": "They won’t see it as a sob story. It’s totally ok to tell your story. That’s what they want to know about — your life. \n\nI’d write it it the additional info section. \n\nI made a post about supplemental essays recently  —additional info included. You might find some helpful hints here: \n\nhttps://www.reddit.com/r/ApplyingToCollege/comments/pv8w4u/making_your_peace_with_the_supplemental_essays/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
      "author": "admissionsmom",
      "created": 1634017037,
      "upvotes": 3,
      "replies": {}
    },
    "hgb9cn5": {
      "link": "/r/ApplyingToCollege/comments/q6cgp3/should_i_write_the_moving_essay/hgb9cn5/",
      "text": "Firstly, don’t write a whole essay in the additional info section. That’s not what it’s for nor is it what AOs want to read. Be succinct. If moving had a big impact on you (like a noticeable dip in grades) then you can briefly mention it as the cause of that and then focus on your improvement so that it doesn’t sound like excuses.",
      "author": "rainingsiberiancats",
      "created": 1634009184,
      "upvotes": 2,
      "replies": {}
    }
  }
}