{
  "sid": "q5kduo",
  "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/",
  "title:": "Applying to NYU",
  "text": "Hi, I'm a high school senior interested in applying to NYU Gallatin and I was a bit unsure on what this specific questions is asking for. It is asking to indicate an academic area you would be interested in exploring through the Gallatin Individualized Study concentration, so are they asking for numerous things are just one thing? I know for Gallatin, you can have numerous concentrations and it isn't a traditional one major.",
  "author": "applesandbananasbaby",
  "created": 1633912392,
  "updated": 1634575759,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hg677oy": {
      "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/hg677oy/",
      "text": "I think it is a pretty open question, so you could talk about a single area or multiple ones, depending on what appeals to you.",
      "author": "prsehgal",
      "created": 1633912811,
      "upvotes": 1,
      "replies": {}
    },
    "hgdpuow": {
      "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/hgdpuow/",
      "text": "Hey, as the other commenter said it is more open. You do not need to have a specific “concentration” already in mind, just list whatever you are academically interested in pursuing.\n\nI am a sophomore at Gallatin, so when writing my essay I spoke on my interests in psychology, policy, and education. What I do recommend is exploring how your several interests intersect, as that show you are thinking in a interdisciplinary way. \n\nIf you have any questions, I am happy to answer Best of luck applying",
      "author": "AnxiousSocialist",
      "created": 1634061224,
      "upvotes": 1,
      "replies": {
        "hgjlxtu": {
          "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/hgjlxtu/",
          "text": "Hi, as a Gallatin student can I still take biology and chemistry classes?",
          "author": "applesandbananasbaby",
          "created": 1634166093,
          "upvotes": 1,
          "replies": {
            "hgjmnlv": {
              "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/hgjmnlv/",
              "text": "Totally! There is no classes that students at Gallatin cannot take, that is the beauty of the school. Though there are certain classes that are major only, but even then an email can solve that issue at times. But for classes such as biology and chemistry , which I am pretty sure are mostly at CAS, you can easily get into those easily .",
              "author": "AnxiousSocialist",
              "created": 1634166417,
              "upvotes": 1,
              "replies": {
                "hgjnxe2": {
                  "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/hgjnxe2/",
                  "text": "Thank you for responding so fast! I want to be a PA (Physician Assistant) and I want to do the prerequisite classes without making my whole major biology or something. Another question I have is does NYU have a Anatomy & Physiology class/course (idk the difference)? I saw that they have one in Rory Meyers college of nursing but is that a school for undergraduates in NYU or for nursing students in a program or something.",
                  "author": "applesandbananasbaby",
                  "created": 1634167011,
                  "upvotes": 1,
                  "replies": {
                    "hgjodvc": {
                      "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/hgjodvc/",
                      "text": "Hey I just sent you a chat via Reddit; that may be easier for me to respond to multiple questions",
                      "author": "AnxiousSocialist",
                      "created": 1634167225,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hgjo4u0": {
                  "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/hgjo4u0/",
                  "text": "How can I know online if a Gallatin student can take a particular class or not?",
                  "author": "applesandbananasbaby",
                  "created": 1634167109,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hgsgipl": {
      "link": "/r/ApplyingToCollege/comments/q5kduo/applying_to_nyu/hgsgipl/",
      "text": "R u eding?",
      "author": "202o277e822w",
      "created": 1634334230,
      "upvotes": 1,
      "replies": {}
    }
  }
}