{
  "sid": "q5qbo5",
  "link": "/r/ApplyingToCollege/comments/q5qbo5/what_does_washu_look_for/",
  "title:": "What does WashU look for?",
  "text": " I am applying ED for WashU and have been kind of worried of my stats.. Stats-wise I am not the strongest candidate to exist. I have a pretty strong EC list, which I am proud of. My essay is getting there, but it definitely needs some tweaking. I have been searching for the answers to these questions everywhere, so here I am, reddit :)\n\nDoes WashU look more at your stats (gpa & sat) or your essays & ECs??\n\nWhat is the most difficult division to get accepted into in WashU?",
  "author": "2883929r",
  "created": 1633935895,
  "updated": 1634073424,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hg81das": {
      "link": "/r/ApplyingToCollege/comments/q5qbo5/what_does_washu_look_for/hg81das/",
      "text": "Every school will look at grades first",
      "author": "Adventurous-Oven-866",
      "created": 1633956743,
      "upvotes": 2,
      "replies": {}
    },
    "hg8efpf": {
      "link": "/r/ApplyingToCollege/comments/q5qbo5/what_does_washu_look_for/hg8efpf/",
      "text": "All I know is ECs and essays *can* make up for somewhat lower than average grades. If it's your dream school then go for it, ED can only help you since WashU wants to admit people who really want to be there. (They know many people view it as a safety T20)\n\nNo clue about the acceptance rates for different divisions, but I'd assume Engineering is the hardest and ArtSci is the \"easiest.\" Though if your interested in Beyond Boundaries, that's definitely most selective",
      "author": "ssssseabass",
      "created": 1633963188,
      "upvotes": 1,
      "replies": {
        "hg8ixfc": {
          "link": "/r/ApplyingToCollege/comments/q5qbo5/what_does_washu_look_for/hg8ixfc/",
          "text": "Ohh thank you so much for replying!\n\nAnother quick question, should I apply for the scholars program, since they have more opportunities for me to write more about myself? Or are the reviewers for the scholar program different from the admission reviewers?",
          "author": "2883929r",
          "created": 1633965144,
          "upvotes": 1,
          "replies": {
            "hg8m0hm": {
              "link": "/r/ApplyingToCollege/comments/q5qbo5/what_does_washu_look_for/hg8m0hm/",
              "text": "Totally different reviewers. Of course you should apply for the program if it's something you want to get, but it won't help or hurt your admissions odds",
              "author": "ssssseabass",
              "created": 1633966466,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}