{
  "sid": "qvqs6i",
  "link": "/r/ApplyingToCollege/comments/qvqs6i/ama_3rd_year_berkeley_cs_ba_letters_and_sciences/",
  "title:": "AMA 3rd year Berkeley CS BA (letters and sciences)",
  "text": "Declared cs during spring of freshman year. 2nd year I took a gap semester to intern at a tech company and skip some covid school. I've been enrolled in both lower and upper division cs classes. AMA, I'll keep my answers brief. Ex:\n\nDorms - Overpriced (2k/month, food included), but good social experience. Most don't return after freshman year because 1. they found cheaper/better housing 2. not many can get dorms after freshman year. \n\nFood - Cafe food is mediocre buffet quality for 7 per meal. Local food is like 7-14 a meal, but very good and diverse. Not as many fast food options.\n\nStress - Not very stressed but only because I've been purposefully taking a lighter courseload.\n\nClasses - Kinda meh. Content and homework are high quality but sometimes professors are boring to listen to. You also will be waitlisted for more niche upper division classes. Usually you'll be able to enroll but sometimes you'll have to take different classes than what you planned for.",
  "author": "eggtrie",
  "created": 1637122696,
  "updated": 1637178971,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hkyqevz": {
      "link": "/r/ApplyingToCollege/comments/qvqs6i/ama_3rd_year_berkeley_cs_ba_letters_and_sciences/hkyqevz/",
      "text": "do people usually declare cs freshman or sophomore year? (in other words, do ppl usually take 1+2 of the required courses or 1+1+1)",
      "author": "Sorgair",
      "created": 1637136252,
      "upvotes": 2,
      "replies": {}
    },
    "hkyul1b": {
      "link": "/r/ApplyingToCollege/comments/qvqs6i/ama_3rd_year_berkeley_cs_ba_letters_and_sciences/hkyul1b/",
      "text": "What are some tips to get into colleges such as Berkeley for CS/what do you think got you in? Extracirriculars, tests, etc Thanks!",
      "author": "fd430dfgjpogd3gfd2ds",
      "created": 1637139724,
      "upvotes": 1,
      "replies": {}
    },
    "hl0xnr0": {
      "link": "/r/ApplyingToCollege/comments/qvqs6i/ama_3rd_year_berkeley_cs_ba_letters_and_sciences/hl0xnr0/",
      "text": "How hard is it to declare a CS major? How hard is it to graduate in four years?",
      "author": "Stq1616",
      "created": 1637177528,
      "upvotes": 1,
      "replies": {}
    }
  }
}