{
  "sid": "qwjl5l",
  "link": "/r/ApplyingToCollege/comments/qwjl5l/spring_decision_release_dates_are_a_mess/",
  "title:": "Spring decision release dates are a mess",
  "text": "I’ve heard from UD, IU, & Clark (accepted at all so far, waiting on 6) Clark requires an admissions decision by November 30. Umass Amherst for example releases decisions “by mid-December”. There’s no real timeline for spring decision release dates either.",
  "author": "anon8403",
  "created": 1637216822,
  "updated": 1637353556,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl3d4t1": {
      "link": "/r/ApplyingToCollege/comments/qwjl5l/spring_decision_release_dates_are_a_mess/hl3d4t1/",
      "text": "I would suggest following up with the remaining schools and maybe even telling them that you need to get back to another school by the 30th - request them to see if they can render a decision earlier than that... If they don't, you can request Clark to grant you an extension, if it's your best option to now... If that doesn't work, your best bet would be to deposit the amount to secure the seat there while you wait for the other decisions.",
      "author": "prsehgal",
      "created": 1637218612,
      "upvotes": 2,
      "replies": {}
    },
    "hl4e6s1": {
      "link": "/r/ApplyingToCollege/comments/qwjl5l/spring_decision_release_dates_are_a_mess/hl4e6s1/",
      "text": "Schools have to build a calendar to fit their processes with staffing and application volume in mind. Everyone wants to work quickly, but resources differ from school to school.",
      "author": "UVaDeanj",
      "created": 1637244603,
      "upvotes": 1,
      "replies": {}
    },
    "hl6icq7": {
      "link": "/r/ApplyingToCollege/comments/qwjl5l/spring_decision_release_dates_are_a_mess/hl6icq7/",
      "text": "How did you apply and what response are they requesting?\n\nIf you applied ED, you committed to attend if accepted, so other acceptance dates are irrelvant - you agreed to withdraw applications everywhere else.\n\nIf you applied EA, they say this “allows first-year students to apply in the fall and have their decision and financial aid award by January.” and “ you will have more time and flexibility to explore all your options.“ May 1 is a near-universal decision date outside of ED. A November decision date sounds very odd.",
      "author": "RichInPitt",
      "created": 1637275289,
      "upvotes": -1,
      "replies": {
        "hl6kroz": {
          "link": "/r/ApplyingToCollege/comments/qwjl5l/spring_decision_release_dates_are_a_mess/hl6kroz/",
          "text": "There’s no ED for spring admissions",
          "author": "anon8403",
          "created": 1637276317,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}