{
  "sid": "qd0oj4",
  "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/",
  "title:": "When is a need to know University better than national University?",
  "text": "The number regional School is not equal to Princeton, so when is the number one regional university better than a national University academically",
  "author": "HahaStoleUrName",
  "created": 1634848137,
  "updated": 1636155530,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhjak14": {
      "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjak14/",
      "text": "When it’s a better fit for you than the national university.",
      "author": "Strict-Special3607",
      "created": 1634848233,
      "upvotes": 1,
      "replies": {
        "hhjarxd": {
          "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjarxd/",
          "text": "I am talking academically",
          "author": "HahaStoleUrName",
          "created": 1634848322,
          "upvotes": 1,
          "replies": {
            "hhjb8m1": {
              "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjb8m1/",
              "text": "No way to determine this without comparing two specific schools… relative to a specific major… for a specific student.\n\nAnd even then it would be highly subjective.",
              "author": "Strict-Special3607",
              "created": 1634848507,
              "upvotes": 1,
              "replies": {
                "hhjbdeb": {
                  "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjbdeb/",
                  "text": "Hmm interesting, makes you think how USNews does it",
                  "author": "HahaStoleUrName",
                  "created": 1634848560,
                  "upvotes": 1,
                  "replies": {
                    "hhjblpq": {
                      "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjblpq/",
                      "text": "Well, they DON‘T… which is why you’re asking the question.",
                      "author": "Strict-Special3607",
                      "created": 1634848650,
                      "upvotes": 1,
                      "replies": {
                        "hhjbpfd": {
                          "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjbpfd/",
                          "text": "Like for other schools",
                          "author": "HahaStoleUrName",
                          "created": 1634848690,
                          "upvotes": -2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhjcbwp": {
      "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjcbwp/",
      "text": "Please don't place this much faith into ranking lists.  \n\nDoes the specific school's position on the national ranking list indicate that it is a good school?  Yes or No?  \n\nDoes the other specific school's position on the regional ranking list indicate that it is a good school? Yes or No?  \n\nIf they are both good schools then stop using the ranking data in the decision process at this point.  \n\nFocus on other aspects of the two institutions.  \n\nYou need to decide for yourself that the threshold on a ranking list is between a good school and a not-good-enough school.  \n\nMaybe that means Top-100, or Top-66, or Top-250. You need to decide.",
      "author": "VA_Network_Nerd",
      "created": 1634848938,
      "upvotes": 2,
      "replies": {}
    },
    "hhjgckz": {
      "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjgckz/",
      "text": "If you know what you want to study the strength of the faculty in your department and even your sub field probably matters more than the ranking of the whole university on some list",
      "author": "RetiringTigerMom",
      "created": 1634850606,
      "upvotes": 2,
      "replies": {}
    },
    "hhjbpg0": {
      "link": "/r/ApplyingToCollege/comments/qd0oj4/when_is_a_need_to_know_university_better_than/hhjbpg0/",
      "text": "I think if you are to rank colleges via academics (and even that is sometimes subjective), the question should be why would this be relevant?  In the academic world, not many really care. If you’re a professor, you go where you can get support for your research. If you’re a doctor, you go where the environment is great for you and so on. I don’t think it matters that greatly other than maybe for the 1% of the population that has a specific need. When I hire someone and I don’t work for a small fish company, I find myself being just impressed with someone with a business degree from Indiana University or Miami of Ohio as someone who’s from Wharton. \n\nTaking this back to the context of college apps, if you could go anywhere and money is not an option, sure, an Ivy League and fancy private school is nice. You don’t have to fight to register for a class due to max capacity. The extra resources and smaller class sizes are nice.  However, can you a million times thrive with the right hustle and attitude at a regional, absolutely.",
      "author": "TwoSuns168",
      "created": 1634848690,
      "upvotes": 1,
      "replies": {}
    }
  }
}