{
  "sid": "qdjs72",
  "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/",
  "title:": "I envy you overachievers",
  "text": "I am the eldest daughter in my family and both of my parents are immigrants. Being in the chance me sub and seeing what people have done during their high school careers makes me feel so shitty. Not because I can’t do things like that, but because I know I can but I just was robbed of the opportunity to do so. Like I couldn’t intern at fucking NASA or something because someone needed to watch my brother. I couldn’t pay for a tutor to raise my SAT score because I already spent my last paycheck on gas and dinner for my family. I am just so, so envious. And hearing some people make bitter remarks about how being first-gen is an advantage, it really isn’t. We have no family or resources here. I just am praying for the best this application season.",
  "author": "i_run_on_spite",
  "created": 1634917758,
  "updated": 1635183315,
  "over_18": false,
  "upvotes": 351,
  "upvote_ratio": 0.94,
  "comments": {
    "hhmv0gm": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmv0gm/",
      "text": "[deleted]",
      "author": null,
      "created": 1634918509,
      "upvotes": 143,
      "replies": {
        "hhmy9wt": {
          "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmy9wt/",
          "text": "I already did! It’s just insane how I have to summarize all this in 150 characters in common app. Lol",
          "author": "i_run_on_spite",
          "created": 1634919835,
          "upvotes": 45,
          "replies": {
            "hhnjkzs": {
              "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhnjkzs/",
              "text": "you can always expand on it in the additional information section, thats what i did!",
              "author": "Karmakaziiiii",
              "created": 1634928469,
              "upvotes": 27,
              "replies": {}
            },
            "hho737f": {
              "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hho737f/",
              "text": "That's why you use the coalition app! If your universities accept it definitely apply over there",
              "author": "NarutoDragon732",
              "created": 1634938478,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hhmv9no": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmv9no/",
      "text": "I would avoid Chanceme, a massive chunk of users there seriously exaggerate their accomplishments, if not just lie/make things up whole cloth",
      "author": "freeport_aidan",
      "created": 1634918612,
      "upvotes": 120,
      "replies": {
        "hhp4g74": {
          "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhp4g74/",
          "text": "So I hate r/chanceme too, but I have a question about this: if users on that sub seriously exaggerate and/or make up their accomplishments on their posts there, then why do we believe they didn't do the same thing on their application? Even if it's not true that they did all those things listed, as long as what's on their post matches what's on their application, then how does it matter from a chancing perspective that they lied?\n\nClarification: not saying they should lie, or that it's OK, or that it doesn't matter.",
          "author": "FuriousGeorge1435",
          "created": 1634955244,
          "upvotes": 9,
          "replies": {
            "hhp63xg": {
              "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhp63xg/",
              "text": "Because lying on a official college application has consequences, let me rephrase that, DIRE consequences if you’re caught. Lying anonymously on Reddit has no consequence at all",
              "author": "Syrus3800",
              "created": 1634956104,
              "upvotes": 17,
              "replies": {}
            }
          }
        },
        "hhr8vzx": {
          "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhr8vzx/",
          "text": "That’s a popular take i really have trouble believing tbh. What’s the incentive of lying on an anonymous forum ? Also making up accomplishments would just make their chanceme responses skewed when these are insecure HS students just looking for validation. I think the percentage of liars on chanceme is actually pretty low. I also don’t see many truly UNBELIEVABLE accomplishments on there , like I’ve met at least one person for every accomplishment on chanceme that’s actually done it",
          "author": "pianoloverkid123456",
          "created": 1635007420,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhmu3vm": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmu3vm/",
      "text": "I feel you :(( sending hugs your way, I'm so proud of you.",
      "author": "obvious-throwaway456",
      "created": 1634918141,
      "upvotes": 20,
      "replies": {
        "hhmyc5k": {
          "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmyc5k/",
          "text": "Thank you!!! Hugs being sent back ❤️",
          "author": "i_run_on_spite",
          "created": 1634919860,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hhn8llc": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhn8llc/",
      "text": "This sub skews upper middle class, so a good chunk of the students here don't have the first clue how hard it is to navigate college admissions alone, or what it's like to make real sacrifices or juggle serious family obligations. It can be hard to stomach their clueless whining and condescension, and I'm sorry you've had to put up with it to access the information here.\n\nTo put your mind at ease a bit, colleges do make an effort to correct for these kinds of disadvantages. Adcoms may not know your parents' income when they're reviewing your app, but they will know your high school, address, and activities (including family responsibilities), so they'll have a good idea of where you fall economically, and what opportunities were actually available to you. They try to put achievement into context so that kids with fewer resources and more responsibilities aren't penalized.\n\nIt's not a perfect system, but just know that you aren't competing directly with those privileged overachievers; AOs understand that those kids are playing a very specific game that many can't afford. Instead, you'll be compared to students with a similar economic profile. I know that doesn't undo how shitty it feels to miss out on opportunities to prove yourself, and being surrounded by rich kids once you actually get to college isn't a cakewalk, either. But hopefully it makes the admissions process itself a smidge less scary.",
      "author": "elastricity",
      "created": 1634924041,
      "upvotes": 32,
      "replies": {}
    },
    "hhmzcew": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmzcew/",
      "text": "[deleted]",
      "author": null,
      "created": 1634920270,
      "upvotes": 6,
      "replies": {
        "hhmzj2f": {
          "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmzj2f/",
          "text": "I have a 3.7 and 1230, my stats are still considered subpar in comparison to the average QuestBridge recipient",
          "author": "i_run_on_spite",
          "created": 1634920343,
          "upvotes": 4,
          "replies": {
            "hhn0mbz": {
              "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhn0mbz/",
              "text": "[deleted]",
              "author": null,
              "created": 1634920780,
              "upvotes": 6,
              "replies": {
                "hhn1dt6": {
                  "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhn1dt6/",
                  "text": "Alright, I’ll give it a go. Thank you for your advice ❤️",
                  "author": "i_run_on_spite",
                  "created": 1634921083,
                  "upvotes": 2,
                  "replies": {
                    "hhn3oj5": {
                      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhn3oj5/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1634922016,
                      "upvotes": 2,
                      "replies": {
                        "hhn3sjz": {
                          "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhn3sjz/",
                          "text": "That’s perfectly okay, I plan on applying to a lot of scholarships anyways. Thank you so much.",
                          "author": "i_run_on_spite",
                          "created": 1634922063,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhoh03h": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhoh03h/",
      "text": "Oh my god same! I am also the eldest daughter in my family and what’s worse is that I can’t even get a job or internship because I’m on a dependent visa status. I just find it so unfair that I got robbed of the millions of opportunities that other people got and my application is so bland. All I have is Debate and even for that, I feel like it’s not enough. And the fact that I want to major in CS and I see all these people who basically have “perfect applications”, I’m so scared I won’t even get admission to my safeties. And everyone has already applied and I’m trying to make my application be perfect a d I just can’t cuz I can’t get my stupid ACT score to go up, my essays suck and overall, I feel like a complete failure. Not to mention what extra stress from senior year and my parents. I’m praying I get into my safeties but for you, I’m sure that’s ur an amazing person and you’ll get into a college! Good luck!",
      "author": "gayathrigajjela18",
      "created": 1634943219,
      "upvotes": 4,
      "replies": {
        "hhpxw38": {
          "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhpxw38/",
          "text": "Try SAT maybe? SAT got rid of the essay section recently and it doesn’t have a science section",
          "author": "forgotlaundryagain",
          "created": 1634975360,
          "upvotes": 1,
          "replies": {
            "hhq7640": {
              "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhq7640/",
              "text": "My SAt score is no that great either.. I’m retaking both of them soon and I’m praying I can get my scores up.",
              "author": "gayathrigajjela18",
              "created": 1634983801,
              "upvotes": 1,
              "replies": {
                "hhr1w38": {
                  "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhr1w38/",
                  "text": "best of luck!",
                  "author": "forgotlaundryagain",
                  "created": 1635004238,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhnmqhk": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhnmqhk/",
      "text": "It makes a lot of sense to dedicate your entire life towards developing a college resume before you attend college. But after you graduate, and realize that your college experience could have largely been replicated at any number of schools in the US, or that you missed out on a full spectrum of human experience by narrowing on one goal you decided on as a child, or that the job you ended with isn't as glamorous as it was rumored to be, or the pressure is too much; all of the time and energy you spent meeting arbitrary marks of prestige seems less and less relevant.\n\nThe bond you've formed with your family, on the other hand, is real and immutable. The appreciation for the struggle you've developed is real. You have worked for everything you have - and that is something no one can ever take away from you. \n\nIts never too late to become an  academic overachiever. Yes having the head start is useful, but while the name of a big college on your resume is flashy, it doesn't compare at all to the wisdom, sense of self and community that having fought through a struggle like your experience has been. Honestly, by just surviving and applying to college makes you an overachiever (its not easy, and very few people actually do). \n\nSorry for the rant, haha, but SAT tutors and research ops are pointless as hell if your goal is to chase prestige and not actually cultivate a fulfilling your life. I know, or know of too many people who went to tops schools and flamed out because of that. Take pride in what you've accomplished!",
      "author": "IDrankChocolateMilk",
      "created": 1634929776,
      "upvotes": 11,
      "replies": {}
    },
    "hhmzxos": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmzxos/",
      "text": "you’re going to be just fine. I’m so proud of you, go crush those applications ❤️\nYou got this💪🏻💪🏻",
      "author": "Additional_Fold7154",
      "created": 1634920506,
      "upvotes": 4,
      "replies": {}
    },
    "hhpfdo2": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhpfdo2/",
      "text": "Hi! I'm also a first gen immigrant and the eldest daughter - I wrote something about it [here](https://www.reddit.com/r/ApplyingToCollege/comments/pmlbe1/it_fucking_sucks_having_immigrant_parents/). I just want to say, I feel what you mean. \n\nThere's students at my school who started their ecs at 5, rich kids who are raising upwards to 10k dollars - all because their parents are already from a background of stability and prestige. My parents don't even know what the SAT is and for my whole life, I fended for myself. \n\nI know our experiences aren't extremely similar but please just trust in the process and ask for help. If your parents don't have enough money to get you into an opportunity, ***ask for funds + money.*** If no one can watch your brother, ***ask a friend/adult friend*** to do it. The thing I learn is that, people, for the most part are willing to help people like us who want to improve ourselves but don't have the resources/chances to do it.",
      "author": "aprilseasons",
      "created": 1634961392,
      "upvotes": 4,
      "replies": {}
    },
    "hhmzlfo": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhmzlfo/",
      "text": "Sending hugz <3 going to a good school outside the US on a scholarship is literally the same everyday I see rich kids show off their ecs which their parents LITERALLY funded/built for them",
      "author": "Frosty_Aside_9960",
      "created": 1634920368,
      "upvotes": 5,
      "replies": {}
    },
    "hholla5": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hholla5/",
      "text": "honestly same, taking care of siblings, immigrant parents, except that my parents let me keep the money I earn for myself but I usually up using it on school stuff anyway",
      "author": "cryingover",
      "created": 1634945547,
      "upvotes": 2,
      "replies": {}
    },
    "hhpwjc6": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhpwjc6/",
      "text": "i envy them too. but in my case.i am the only child and had 2 diseases since the beginning and so my parents never allowed me to play(asthma) and let alone go outside of my home cuz of my skin disease.(live in GCC so the sun) i don't mean to gather pity on me by this comment. its just that lower-income plus dire situations is understood by application reviewers but we never get past that state for intl at least as far as ik.",
      "author": "esuga",
      "created": 1634974168,
      "upvotes": 2,
      "replies": {}
    },
    "hhpavud": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhpavud/",
      "text": "I am an international student. First of all it'll be so hard for me to go to America which is miles away from where I live and adjusting there. The whole going to America process is extremely difficult for us international students- financial aid, visa. I wish all of u American citizens really understood more of how difficult it is to be an international student, our acceptance rates are less, costs for us are higher.Secondly I'm from a third world country where we have little to no resources, I didn't even have SAT centres. Later we had to make arrangements. I tried to make do with what I had, reached out online in a lot of things but seeing what others r doing making everything so redundant. My school's shit, not supportive at all, they don't even know English. I learnt English myself, I work, I had to go above and watched YouTube to study foreign subjects. Our living conditions are also very poor. I too used to look up at first gens and be like they still have it better than us but I understand that everyone has their struggles, I'm not going to invalidate anyone's feelings.But I'm still being positive, I chose to take up this big dream and I'm gonna work hard to make it become true no matter the limited resources and obstacles I have.",
      "author": "arcticmonkeysgirl505",
      "created": 1634958772,
      "upvotes": 3,
      "replies": {}
    },
    "hhpj2v3": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhpj2v3/",
      "text": "I was you, and now my children are the students you envy. It is a more challenging path but you can end the same place.  I promise!",
      "author": "Timisgr8",
      "created": 1634963716,
      "upvotes": 1,
      "replies": {}
    },
    "hhnlr87": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhnlr87/",
      "text": "Keep in mind that many of the posts on r/chanceme are exaggerated and even fake sometimes. So I wouldn't put much weight on the posts of that subreddit.",
      "author": "Nerdiant",
      "created": 1634929373,
      "upvotes": 1,
      "replies": {}
    },
    "hhpxo9g": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhpxo9g/",
      "text": "I really do share this feeling with you when I read all this post of people doing things I could only dream of doing :( and it really discourages me from even applying",
      "author": "Silver_Debate_3150",
      "created": 1634975162,
      "upvotes": 1,
      "replies": {}
    },
    "hhquhfc": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhquhfc/",
      "text": "My parents are also immigrants and it’s true we have no family or resources here! When my older sibling  was applying they had a similar issue because they were always babysitting me. Luckily as the youngest sibling I happen to have time on my hands - something my sibling didn’t have. I also got extremely lucky because I was able to get into a really good highschool  on financial aid that gave me the resources my family couldn’t. Again my sibling wasn’t so lucky…",
      "author": "Winter-Pick-6282",
      "created": 1634999813,
      "upvotes": 1,
      "replies": {}
    },
    "hhp7uxv": {
      "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhp7uxv/",
      "text": "hard cope",
      "author": "Time-Insurance6811",
      "created": 1634957033,
      "upvotes": -3,
      "replies": {
        "hhpfm67": {
          "link": "/r/ApplyingToCollege/comments/qdjs72/i_envy_you_overachievers/hhpfm67/",
          "text": "no really 😱😱😱",
          "author": "i_run_on_spite",
          "created": 1634961533,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}