{
  "sid": "q4nufx",
  "link": "/r/ApplyingToCollege/comments/q4nufx/class_rank_rant/",
  "title:": "class rank rant",
  "text": "I am top 17% in class rank. This is bs.\n\n- I have a 4.0 UW\n- I will have taken 9 APs by the end of this year, I’ve completed 5 so far\n- The only non-honors classes I’ve taken are PE (required), chorus twice, and graphic design\n- I’ve never taken a study hall or free period \n\nAt my school, you can take easy engineering classes with AP weighting. People also often take study halls and free periods, which don’t affect their GPAs. I think it’s really unfair that my class rank suffers because I take art classes instead of just going home.\n\nbut I’m rank 69 so I guess I can’t complain too much 😎 …😭",
  "author": "CrystalsOnGumdrops",
  "created": 1633794304,
  "updated": 1634074036,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hfzu57x": {
      "link": "/r/ApplyingToCollege/comments/q4nufx/class_rank_rant/hfzu57x/",
      "text": "A similar thing happened with me. There aren't quite as many overachievers at my school, so I'm still #6, but my GPA decreased by a full 0.1 because I took 4 years of choir instead of study halls. My class rank would be #2 had I taken study halls instead of choir for 4 years. \n\nProbably the best thing I can say is that admissions readers know that art and music classes drag down your GPA and will take that into consideration. In other words, despite having a worse class rank than others near the top of your class, you will most likely be regarded academically similar to them because of your art classes.",
      "author": "FuriousGeorge1435",
      "created": 1633795887,
      "upvotes": 6,
      "replies": {}
    },
    "hfzr1ny": {
      "link": "/r/ApplyingToCollege/comments/q4nufx/class_rank_rant/hfzr1ny/",
      "text": "I think this is something to ask your counselor to mention in your report",
      "author": "moonriver252",
      "created": 1633794478,
      "upvotes": 3,
      "replies": {
        "hfzrfrg": {
          "link": "/r/ApplyingToCollege/comments/q4nufx/class_rank_rant/hfzrfrg/",
          "text": "unfortunately we’re strongly discouraged from emailing our counselors, as we only have 5 counselors for a school of like 1,500 students, and they have to do college stuff, mental health stuff, and schedules. I hate my school",
          "author": "CrystalsOnGumdrops",
          "created": 1633794656,
          "upvotes": 5,
          "replies": {
            "hg00b5d": {
              "link": "/r/ApplyingToCollege/comments/q4nufx/class_rank_rant/hg00b5d/",
              "text": "You’re following the rules too much",
              "author": "Throwingaway1133",
              "created": 1633798616,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hg15g6r": {
      "link": "/r/ApplyingToCollege/comments/q4nufx/class_rank_rant/hg15g6r/",
      "text": "God I feel you. I literally have a 4.48 weighted GPA and I’m barely in the top quarter of my class because of how competitive my school is. I think colleges take note of how competitive schools are tho.",
      "author": "duke_simp",
      "created": 1633816811,
      "upvotes": 3,
      "replies": {}
    },
    "hg181e8": {
      "link": "/r/ApplyingToCollege/comments/q4nufx/class_rank_rant/hg181e8/",
      "text": "My daughter’s school is only additive for weighted GPA. An additional x points is added for each honors, AP, etc. So a GPA of 4.0 plus a set of courses and honors weighting is the same whether it includes additional unweighted courses or not.\n\nIt can be a pain to explain (she’ll graduate with a 5.56), but it avoids the former system where no one taking band/choir ever could be Val/sal.\n\nFwiw, I find the California GPA calculator to be the same - if I include fewer courses, her GPA is higher.\n\nYes, it’s not fair, but it is what it is.",
      "author": "RichInPitt",
      "created": 1633818040,
      "upvotes": 2,
      "replies": {
        "hg1u35x": {
          "link": "/r/ApplyingToCollege/comments/q4nufx/class_rank_rant/hg1u35x/",
          "text": "Luckily my school does valedictorian based on unweighted gpa, so I can still get it",
          "author": "CrystalsOnGumdrops",
          "created": 1633828872,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}