{
  "sid": "qyvk5d",
  "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/",
  "title:": "Will having a startup or a big open source project help in getting admission at MIT/Harvard/Stanford?",
  "text": "Will having a startup or an internship at FAANG or a huge open source project help in getting admission at an Ivy league? For those of you who do not know what open source is, they are the code projects whose source code is available for free and you can use them for free.\n\nI am a highschool freshman and am wondering whether polishing my programming skills even more help in getting admission at MIT/harvard/standford, CMU counts too! I have good mathematics skills(particularly due to programming) so ig i'd get a good grade at SAT math. I would be an international student, not a native US citizen if that would help.",
  "author": "hamiecod",
  "created": 1637503243,
  "updated": 1637687986,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.53,
  "comments": {
    "hlije9l": {
      "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlije9l/",
      "text": "Do what you want and like to do. Don’t do for an application. Your success in areas you enjoy will speak louder than a checklist of what you think colleges want to see. Because maybe by the time you actually apply, they don’t give a hoot about open-source projects (if they ever did).",
      "author": "pupuphlatter",
      "created": 1637506452,
      "upvotes": 16,
      "replies": {
        "hlimuop": {
          "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlimuop/",
          "text": "you are ethically and morally much more correct than me, but i disagree with you. if op wants admission then they are in the right for wanting to be strategic. a lot of us simply feel pressure to “get in”’and while that’s not really a good mindset it will likely hold a strong force",
          "author": "localramenconsumer",
          "created": 1637508015,
          "upvotes": 6,
          "replies": {
            "hlipb34": {
              "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlipb34/",
              "text": "Doesn’t mean the buyers can’t change a market. It’s already changing as we type. The downward trend of college enrollment has continued. It’s not easy to pinpoint the “why” but colleges will have to shift gears in the new world that’s forming from COVID. I will assume the admissions scandal had an effect along with the fact that a load of great students who didn’t get into T10 over the decades have helped other schools bloom thus helping to provide new and better options…\n\nBut more importantly, again, whatever strategy one pins his/her/their hopes on, by the time you enroll the (assumed) admissions focus may have changed, or worse, your target major may change. Will one have enough time to switch gears and find x number of ECs (that one assumes has to be about the major)? Why not devote your extra time to things that really say something about you because you want to do them and like to do them anyway? That’s how you stand out. Because a lot of people can achieve 4.0 or super high test scores. And everyone who reads this will now go out and do the same thing as the OP if this feed deems it appropriate…\n\n(Btw, I love ramen too. But I’ve gotten very picky.)",
              "author": "pupuphlatter",
              "created": 1637509056,
              "upvotes": 4,
              "replies": {
                "hliq1cc": {
                  "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hliq1cc/",
                  "text": "it’s not that i don’t agree with you; you are 100% correct factually. the issue is found within sociology, that we all feel the need to belong to a “circle” and if that circle starts with “H” or “S” then we will be more motivated to do whatever it takes to get there. especially on here, we are extremely competitive beings. some value strategy, some integrity. You honestly can combine them, which is what I did, but it’s important to acknowledge that (since you’re speaking in economic terms) people will buy a product at a higher price if the product is desirable enough. people will also search for coupons and ask for donations. it’s just the unfortunate truth. could i be speaking from a biased standpoint because of the ridiculous amount of work i had to put on ecs? yeah, but the truth still stands.",
                  "author": "localramenconsumer",
                  "created": 1637509361,
                  "upvotes": 2,
                  "replies": {
                    "hlisvf7": {
                      "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlisvf7/",
                      "text": "I can definitely agree that in some groups, *the* school is the ticket. And that the psychological paranoia of not having done enough will spoil all life afterwards. You can see this not only in this /sub (“I added one to many extra spaces in my essay!”) but all over the Internet. Damned if you did, damned if you didn’t. There’s no way to convince otherwise because of fear. \n\nIt’s sad to see. But hopefully, we will also continue to see testimonials describing those who did not get into *the* school and have been happier and more productive in their college careers. Or more people pulling back the curtain or washing off the gloss. Or more people confessing they didn’t get a 4.0, or high SATs/ACTs, and only filled out like 3 ECs, but still got into *the* school. \n\nI just wish every student well (especially mentally). Because the process sucks and if you give away too much of yourself to it, you’ll have nothing left to enjoy what higher education (and campus life) can provide no matter where you go.",
                      "author": "pupuphlatter",
                      "created": 1637510533,
                      "upvotes": 2,
                      "replies": {
                        "hlj29o3": {
                          "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlj29o3/",
                          "text": "i really appreciate your perspective, and that you speak of benevolence. i also hope that this process becomes much less strenuous on the applicants. as an anecdote, the application process cost me much of my personality and social life; i wouldn’t wish it upon anyone. we just need better mindsets but i doubt this mindset will find place any time soon. in the meanwhile, we can just reassure the paranoid users on this sub who ask about grammar errors :(",
                          "author": "localramenconsumer",
                          "created": 1637514392,
                          "upvotes": 3,
                          "replies": {
                            "hlj3mqu": {
                              "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlj3mqu/",
                              "text": "All the best of luck to you. I think you’ve been able to maintain a logical viewpoint amidst all this craziness — good on you.",
                              "author": "pupuphlatter",
                              "created": 1637514959,
                              "upvotes": 2,
                              "replies": {
                                "hlj6jva": {
                                  "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlj6jva/",
                                  "text": "thank you! i’m not sure if you’re applying right now as well but good luck to you in any venture you take!",
                                  "author": "localramenconsumer",
                                  "created": 1637516153,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hlitifv": {
                      "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlitifv/",
                      "text": "I agree with you both u/localramenconsumer and u/pupuphlatter. u/pupuphlatter discusses that I should do what I like and well yeah thats a pretty solid argument as I would work a lot harder happily on what I like rather than gobbling up stuff to earn grades. And maybe(just maybe) if I continue working on my passion I could maybe make it without going to school given that I have a schedule of programming for a lot of time consistently for over an year.\n\nu/localramenconsumer discusses about finding a strategy to **getting** into MIT which is also a great argument because a degree still matters a lot.\n\nI get good grades(3.85GPA for the mid-terms) at school without studying much(i dont really study for the tests because i do not have the time to because i am mostly programming). I guess that I should follow my passion for some years and maybe start preparing for the SAT(i am good at math and essays, i'd need to do the other subjects) in my junior or senior year at highschool. Do comment on my plan, like how's it.\n\nAlso, as startups and NGOs are considered at Ivy league schools, I think that open source should also be considered as they are also fulfilling a purpose similar to NGOs.",
                      "author": "hamiecod",
                      "created": 1637510792,
                      "upvotes": 2,
                      "replies": {
                        "hlke0x0": {
                          "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlke0x0/",
                          "text": "I wanna add onto this thread— there’s a quote from MIT’s former dean of admissions where she basically says “you should never be slacking off in school because ‘you didn’t have to try.’” Smart people are gonna find a way to program AND get the grades they need AND the will to take what they love to the next level (which usually impacts others in some way). That being said, you should study more if you can definitely raise your grades because ‘programming’ doesn’t really make up for them. Same with most ecs. Do what you like to do, but don’t try to manufacture some nonprofit or startup. It makes eyes roll. Seriously.",
                          "author": "Bouncyslime",
                          "created": 1637533663,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlihqyu": {
      "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlihqyu/",
      "text": "I don't have the credentials to back me up, so take this with a grain of salt, but I do think creating or heavily contributing to an open source project (especially one that's really successful and is continued to be built upon) is pretty good!\n\nSince you're a freshman, my advice would be to first focus on your academics and test scores which are often far more important than any EC. My next advice would be to work on ECs you enjoy! If you like doing open source or internship work, then great, keep at it! If not, don't force yourself to slave day after day solely for college applications. It's not worth it.",
      "author": "dominaxe",
      "created": 1637505674,
      "upvotes": 3,
      "replies": {}
    },
    "hlio904": {
      "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlio904/",
      "text": "Please read this article for a general, big-picture perspective on how to approach your high school years [mitadmissions.org/blogs/entry/applying\\_sideways](https://mitadmissions.org/blogs/entry/applying_sideways)\n\nFYI, acceptance rates for internationals at top US schools tend to be around half the overall rate. Last year, MIT accepted 1.3% of international applicants.",
      "author": "elkrange",
      "created": 1637508611,
      "upvotes": 3,
      "replies": {}
    },
    "hlimmte": {
      "link": "/r/ApplyingToCollege/comments/qyvk5d/will_having_a_startup_or_a_big_open_source/hlimmte/",
      "text": "Open source is verifiable to an extent. Startup or internship is always a doubt - did you get it thru connections, did you really do what you said you did - it is more discounted as colleges don’t want to spend time verifying.",
      "author": "svday",
      "created": 1637507920,
      "upvotes": 1,
      "replies": {}
    }
  }
}