{
  "sid": "qj3x65",
  "link": "/r/ApplyingToCollege/comments/qj3x65/how_much_debt_is_worth_it_for_prestigious_schools/",
  "title:": "How much debt is worth it for prestigious schools?",
  "text": "My dream school is upenn (likely wont get un but eding nonetheless) and the net price calculator is at about 25k per year, and my efc from fafsa is about 23000. I truly dont think my family can help support me that much and at most pay for like one year of college. How much debt is still worth it for schools like this? I want to go for phd and research so idek if I'll make money later to pay back. I will likely have to pay like 70-100k in loans for the undergrad. I just want to hear some thoughts.",
  "author": "TacoManTheFirst_",
  "created": 1635608105,
  "updated": 1635778541,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hinl54j": {
      "link": "/r/ApplyingToCollege/comments/qj3x65/how_much_debt_is_worth_it_for_prestigious_schools/hinl54j/",
      "text": ">How much debt is worth it for prestigious schools?\n\nAssuming no further debt for grad school, anything more than your first year salary is too much.",
      "author": "skieurope12",
      "created": 1635609057,
      "upvotes": 14,
      "replies": {}
    },
    "hinn35y": {
      "link": "/r/ApplyingToCollege/comments/qj3x65/how_much_debt_is_worth_it_for_prestigious_schools/hinn35y/",
      "text": "The rule of thumb is to only take on as much debt in 4 years of college as much you're expecting to earn in your first year out of college.",
      "author": "prsehgal",
      "created": 1635609870,
      "upvotes": 11,
      "replies": {}
    },
    "hinkcw6": {
      "link": "/r/ApplyingToCollege/comments/qj3x65/how_much_debt_is_worth_it_for_prestigious_schools/hinkcw6/",
      "text": "Taking on 70-100k in debt would be a lot -- too much in my opinion for most fields of study. It's also more than you can probably borrow on your own anyway - your parents would either be taking some of the loans or have to co-sign for your loans. \n\nThat's not really about it being a prestigious school though - if the problem is your family can't help pay what the federal government or schools think you can afford you could have the exact same problem at an in-state public school.",
      "author": "BrawnyAcolyte",
      "created": 1635608725,
      "upvotes": 4,
      "replies": {
        "hinuw5e": {
          "link": "/r/ApplyingToCollege/comments/qj3x65/how_much_debt_is_worth_it_for_prestigious_schools/hinuw5e/",
          "text": "Hopefully that's not the case for in state. I live in ohio so I think I have decent chance for merit aid for ohio state.",
          "author": "TacoManTheFirst_",
          "created": 1635613137,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiomwxt": {
      "link": "/r/ApplyingToCollege/comments/qj3x65/how_much_debt_is_worth_it_for_prestigious_schools/hiomwxt/",
      "text": "It isn’t worth it. In a year you won’t even remember what your dream school was; I guarantee. Last year, I was 100% set on Columbia/MIT and couldn’t imagine myself anywhere else. Didn’t get into one, couldn’t afford the other, but then got a 100% scholarship at the #1 engineering school in Russia which I hated and committed to only 10 days before classes started with the sole reason of transferring out/reapplying this cycle. Two months in, I don’t even care anymore. \n\nMoreover, last year, I couldn’t believe when a Columbia student wrote they hadn’t seen downtown NYC since their Uber ride from JFK to Columbia and stayed all the time on campus. And now, I gotta say, the last time I saw downtown Moscow was on my Uber ride from the airport to campus. The thing is, when you’re dreaming about a school, you forget that you’ll be studying 10+ (sometimes 15+) hours every day, and won’t give a shit about basically anything else. That, of course, depends on your major; mine is Automation Engineering (basically Applied Math + CS + Physics w/ focus on AI), and I plan to get a PhD after that, too, so that adds a lot of lab work.\n\nNow, I’m certainly not paying those $40k/year + loans for Columbia, even considering the easier admission through GS. If you’re going to study/work a lot (considering you want to get a PhD, I assume you are), it won’t really matter to you where you do that as long as you do that at a good research university with well-funded labs. What will matter a lot more is how much debt you’ll be left with after those 4 years - $100k or $0k. Look for scholarships at research universities. I don’t really know about Ohio, but Miami U, maybe? I think they had a full-tuition or full-ride merit scholarship.",
      "author": "Apprehensive-Math240",
      "created": 1635624991,
      "upvotes": 6,
      "replies": {}
    },
    "hinlg8y": {
      "link": "/r/ApplyingToCollege/comments/qj3x65/how_much_debt_is_worth_it_for_prestigious_schools/hinlg8y/",
      "text": "Talk to ur parents first about finances, and negotiate with upenns office after u get in",
      "author": "pieguy411292176",
      "created": 1635609185,
      "upvotes": 3,
      "replies": {}
    }
  }
}