{
  "sid": "qzn9zp",
  "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/",
  "title:": "question: is five safeties too many safeties?",
  "text": "i fell in love with about five safeties, but i was wondering if that was too many.\n\nthe safeties are texas a&m, clemson, fordham, smu, and pitt\n\ni want to add on that my efc is basically expecting me to pay full tuition, so atp, i’m just applying to colleges that will offer me a merit-based scholarship or an honors college…idk",
  "author": "EmotionalShame9654",
  "created": 1637593128,
  "updated": 1637687741,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hln9ytv": {
      "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hln9ytv/",
      "text": "**If you are depending on non-automatic merit scholarships to make them affordable,** then they are NOT safeties, and YES, you should apply to all, because you cannot be sure which ones will award enough merit. **If you do not need the scholarships to make them affordable,** but are just trying to lower costs a bit, I would still apply to all for the same reason: you don't know how much merit you will get.\n\nDo any of the above have auto merit? maybe TAMU or Pitt? As far as I'm aware, the rest offer competitive merit only, and accordingly are not safeties for you if merit is a requirement for you to attend. Add automatic merit schools that are certain to be affordable.\n\nA copy and paste:\n\nRun the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. (Sometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions.) Federal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. Larger loans require a parent signature and are usually not reasonable amounts to borrow.\n\nIf the need-based estimate does not make the college affordable for your family, then look for merit scholarships. Often, the best merit scholarships are offered by the colleges themselves. Look for colleges that offer competitive merit scholarships according to their websites, where your scores and grades are over the 75th percentile for that college. **\\[You have found these, but they are not financial safeties, because merit is uncertain.\\]**\n\nAlso look for colleges that offer big automatic merit scholarships to out-of-state students for your level of stats. Usually there will be a chart on their website with the levels of stats and scholarship amounts. Example: [https://scholarships.ua.edu/freshman/out-of-state/](https://scholarships.ua.edu/freshman/out-of-state/); see also UAH, U Maine, U Kentucky, U Mississippi, U Arizona, Arizona State, Wyoming, UTD, etc. Then compare the scholarship amount to the out-of-state cost of attendance to see whether the scholarship would make the college affordable for your family. **\\[Auto merit schools can be financial safeties.\\]**\n\nAs an aside, without looking it up, Fordham and SMU may be very likely but their acceptance rates are a smitch on the low side for true safeties. (And if you are applying for business at SMU, definitely not a safety.)",
      "author": "elkrange",
      "created": 1637594256,
      "upvotes": 7,
      "replies": {}
    },
    "hlnlbb0": {
      "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hlnlbb0/",
      "text": ">is five safeties too many safeties?\n\nIf the financial package at each school could be a deciding factor, then, no, it's not too many.  Apply to them all, see how much each one will cost, then make your choice.\n\nIf cost isn't going to be a deciding factor, then five seems like wasted effort.  Pick your favorite two or \\*maybe\\* three and apply to those.",
      "author": "jayphoward",
      "created": 1637598982,
      "upvotes": 3,
      "replies": {}
    },
    "hloyhju": {
      "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hloyhju/",
      "text": "If they are all schools you could see yourself attending, and you haven’t eliminated any from consideration, there’s no downside other than the application fee.",
      "author": "RichInPitt",
      "created": 1637618714,
      "upvotes": 2,
      "replies": {}
    },
    "hln9bhm": {
      "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hln9bhm/",
      "text": "Depends on how many schools your applying to. In general if you like those schools that much, then their probably not safeties. Safety isn’t only dependent upon chances of getting accepted, but also interest, location, cost, etc.",
      "author": "Own_Grass_6060",
      "created": 1637593971,
      "upvotes": 2,
      "replies": {
        "hln9nua": {
          "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hln9nua/",
          "text": "so you’re not allowed to like safeties..? i’m confused. correct me if i’m not understanding.\n\nall of those schools i just listed are >45% acceptance rate, but maybe im overestimating which ones are safeties.\n\ni’m also applying to 19 schools.",
          "author": "EmotionalShame9654",
          "created": 1637594123,
          "upvotes": 0,
          "replies": {
            "hlna6ch": {
              "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hlna6ch/",
              "text": "Yes you should like the safeties your applying to, but my point was there are other variables to a safety.  A school that gives you no financial aid where you won’t be able to afford it isn’t really a safety. That’s was just my main point.",
              "author": "Own_Grass_6060",
              "created": 1637594349,
              "upvotes": 2,
              "replies": {
                "hlnac37": {
                  "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hlnac37/",
                  "text": "ahh okay. got it. tysm!",
                  "author": "EmotionalShame9654",
                  "created": 1637594418,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlna5n6": {
      "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hlna5n6/",
      "text": "I’m doing the same thing! However those colleges don’t seem very cost friendly to me. I also applied to Clemson but I know I can never afford it.",
      "author": "NathanInsko",
      "created": 1637594341,
      "upvotes": 1,
      "replies": {}
    },
    "hlnaa29": {
      "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hlnaa29/",
      "text": "I’d suggest applying to University of Tennessee Knoxville and University of South Carolina at Columbia. My college counselor noted they have good scholarship opportunities.",
      "author": "NathanInsko",
      "created": 1637594394,
      "upvotes": 1,
      "replies": {}
    },
    "hlnjbc9": {
      "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hlnjbc9/",
      "text": "NOOOO, I'd argue you can never have too many safeties if you're looking for merit scholarships. This is a super great strategy you have, and I wish more people went with it.",
      "author": "cet785",
      "created": 1637598167,
      "upvotes": 1,
      "replies": {}
    },
    "hlo22nx": {
      "link": "/r/ApplyingToCollege/comments/qzn9zp/question_is_five_safeties_too_many_safeties/hlo22nx/",
      "text": "Definitely not. It's actually a very good plan.",
      "author": "Ana21112002",
      "created": 1637605628,
      "upvotes": 1,
      "replies": {}
    }
  }
}