{
  "sid": "qpr3m2",
  "link": "/r/ApplyingToCollege/comments/qpr3m2/looking_for_ec_help/",
  "title:": "Looking for EC help",
  "text": "I am a rising sophomore in a private high school in a big city. I’m really invested into the humanities and want to be a lawyer. Really don’t like stem so I like to stay away from that in regards to my ECs. However, I’m struggling to find good extracurriculars to fit my profile. Can someone with similar interests PM me with any possible advice?",
  "author": "Physical-Breakfast-4",
  "created": 1636416840,
  "updated": 1636653546,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hjvhnw6": {
      "link": "/r/ApplyingToCollege/comments/qpr3m2/looking_for_ec_help/hjvhnw6/",
      "text": "Get a job, Model UN, Debate, Start a business of some sort, DECA, FBLA, things like that.\n\n\"Law\" is not a major; that's a graduate degree, so you'd probably major in something like Public Policy, International Relations, Economics, Business, Psych, Poli Sci, English, etc.",
      "author": "toyota2003",
      "created": 1636418045,
      "upvotes": 13,
      "replies": {}
    },
    "hjvlgy5": {
      "link": "/r/ApplyingToCollege/comments/qpr3m2/looking_for_ec_help/hjvlgy5/",
      "text": "Mock trial, debate, work for political campaigns, volunteer for city council, intern at a law office, shadow a judge or lawyer, debate",
      "author": "admissionsmom",
      "created": 1636419804,
      "upvotes": 4,
      "replies": {}
    },
    "hjvv1j4": {
      "link": "/r/ApplyingToCollege/comments/qpr3m2/looking_for_ec_help/hjvv1j4/",
      "text": "Other than mock trial, it's hard to get real law experience as a high schooler. Focus on your actual major. If you like politics, next year is midterm election season. Figure out who's running in your district/near you, and start cranking out those emails asking to intern for their campaigns. If you get lucky there might be an internship section on their campaign website, otherwise emailing is the way to go. You can also look for grassroots organizations supporting causes that you care about and reach out to them. Non-profits are always looking for more people. I want to be a lawyer too, and my politics experience was useful because I realized I don't like real-life politics as much as I thought I did. On the English side, you can submit your writing to literary magazines online and try to get published. PM with any questions!",
      "author": "Fabulous_Bison_5826",
      "created": 1636424131,
      "upvotes": 3,
      "replies": {}
    },
    "hjw399a": {
      "link": "/r/ApplyingToCollege/comments/qpr3m2/looking_for_ec_help/hjw399a/",
      "text": "Are there any attorneys that you might be able to shadow? Is there a particular thing you’re passionate about that make you want to go into law?",
      "author": "the_clarkster17",
      "created": 1636427830,
      "upvotes": 2,
      "replies": {
        "hjw4hh9": {
          "link": "/r/ApplyingToCollege/comments/qpr3m2/looking_for_ec_help/hjw4hh9/",
          "text": "Shadowing attorneys is a good idea I’ve considered. A law course I took over the summer is what started my interest",
          "author": "Physical-Breakfast-4",
          "created": 1636428394,
          "upvotes": 1,
          "replies": {
            "hjwa6f4": {
              "link": "/r/ApplyingToCollege/comments/qpr3m2/looking_for_ec_help/hjwa6f4/",
              "text": "If there’s an aspect of law you’re really excited about, or an end goal you want to achieve with your law career, focus your ECs around that :)",
              "author": "the_clarkster17",
              "created": 1636431057,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjvhpi8": {
      "link": "/r/ApplyingToCollege/comments/qpr3m2/looking_for_ec_help/hjvhpi8/",
      "text": "Sure",
      "author": "stories_as_models",
      "created": 1636418065,
      "upvotes": 1,
      "replies": {}
    }
  }
}