{
  "sid": "q93k76",
  "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/",
  "title:": "As an upper-middle-class child, what exactly should my goals be in life?",
  "text": "My dad is always telling me how I need to establish a better lifestyle than our family has right now. I tell him about my dreams in journalism, in sports commentary, but he shuts it down, saying that I need to make money before I dive into passions. As an immigrant parent, he expects me to build on his sacrifices and fulfill his view of the American dream.\n\nI'm glad my dad cares, but at the same time, between him and my mom, my family makes at least $300,000+ a year. We have a three-story house with 5 bedrooms and six bathrooms. We have two other real estate properties and three decent cars at our disposal. There's never been a moment in my life when I've wished for more, and truly, I've never had to. I've never felt the need to grow up and gain even more luxury, because I've already grown up with every material belonging that I could've realistically asked for. I tried to tell my dad that it's fine if I don't reach the summits he expects for me, but again, he shut me down before I could even finish. I tried to tell him that money is not my objective in life because I've already experienced so much of it, but the words never came out.\n\nBecause of that conversation, and perhaps because the stress of college apps and my extracurriculars has my mind running in overdrive, I started wondering, what exactly is my objective for the future? I have no idea what will pull me forward for the next 50 years. I understand that the future holds endless possibilities of improvement for people who grew up in low-income families, but for me, the future feels empty. I could improve on what my family has right now, but that would require sacrifices that I don't want to make. I would have to give up time or morals, or possibly both, and that point, more money wouldn't be worth it.\n\nI could pursue my passions, but that would come at the price of stability, and I'm not sure I want to make that payment.\n\nOr, I could live the middle or upper-middle-class life that my parents have, working in some tech job that comfortably pays the bills, even if it doesn't captivate me. I would feel bored though. I don't want to stay in the same place my parents are in right now, where they just mindlessly make money while hanging out with friends and taking care of their kids. I've enjoyed that lifestyle for 17 years, but I can't imagine it will be enough to keep me engaged for the next 50.\n\nGiven that this sub of stressed-out, misguided teenagers has always been the best source of life-altering advice, I'd like to ask, A2Cers what are your goals? What will pull you forward for the next 50 years?",
  "author": "mortizmajer",
  "created": 1634353337,
  "updated": 1634575576,
  "over_18": false,
  "upvotes": 100,
  "upvote_ratio": 0.95,
  "comments": {
    "hgtl4di": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtl4di/",
      "text": "I don’t think you have to decide now and you’ll be in a better place to do so when you’re older. \n\nIt would probably help you to realize your family is actually just rich. Your family is in the top 5-6% of earners. Even if you are in one of the highest-price areas this is surely in the top 20-30% (and I’d guess with the house size & 3 cars+properties this can’t be 300K in San Francisco). I’m not quite sure you realize how constrained your life would be by comparison on even a comfortable 80K (which is far above the average sports journalist salary btw). I’m not saying just do compsci and work at FAANG - but there is a reason your parents chose the mindless job-weekend lifestyle - it comes with a lot of freedom and pleasures that aren’t even available to relatively high-earning 100K households. There’s a certain romanticism that comes with doing what you love but unless you’ve actually been poor or middle class I’m not sure you realize what that lifestyle can really entail. \n\nI grew up extremely poor (my childhood home is literally on the market for 30K right now lul), I just want a reasonably comfortable life doing what I love (academic - but that’s so hard lol), I’m not really above selling out though. If I can’t get a researcher tenure job I could deal with mind-numbing work that has a much higher salary. My point is everyone has some indifference point. I'm not gonna be an untenured lecturer on 30K just so I can do academia, I'll sell out every time. But I'd take 90K tenure position over much higher-paying finance job. This is why we can't help you really - you have to explore and decide what trade-offs you are willing to tolerate. But you are very casually dismissing the comforts that come with your parents income and I don't think that's realistic and you need to look at what kind of lifestyle and budget you can live on in your preferred career path. Also, regression to the mean usually implies it's hard for children to replicate that high-earning success so I wouldn't just assume that's available to you tbh.",
      "author": "schizoanalyste",
      "created": 1634355443,
      "upvotes": 81,
      "replies": {
        "hgtnug9": {
          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtnug9/",
          "text": "Well said. journalism is low paying. Sports journalism is even lower paying. My wife worked for ESPN. Op definitely seems to think what his parents have is like his baseline. It’s not.",
          "author": "the_journeyman3",
          "created": 1634357107,
          "upvotes": 22,
          "replies": {}
        }
      }
    },
    "hgtk35e": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtk35e/",
      "text": "I can totally relate to this. Except that I have a mom who grew up in a lower economic family and all she walked out with (from her parents home) was education and grit to lead a better quality of life. \n\nShe makes it a point to remind me that if I follow my passions I may not be able to afford an international trip every year, fine dining every weekend, imported clothes shoes etc. And now she also tells me if she had followed her passions I would have never afforded to even dream about a US degree.\n\nKnowingly or unknowingly I took the middle path. I don't want to do cs but I don't plan to do English major either. Did you consider a middle path like double major etc? That may help you decide what you want your career to be like.",
      "author": "indianmulan123",
      "created": 1634354845,
      "upvotes": 25,
      "replies": {
        "hgtyvlj": {
          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtyvlj/",
          "text": "As a fellow Indian, I can relate 1000000000%",
          "author": "Kevin_2112",
          "created": 1634364741,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hgtqnqh": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtqnqh/",
      "text": "I'm kinda in the same situation as you but I grew up poor and we've risen up a lot so i understand both sides of this well\n\n  \nIt really should come down to also how much your parents will help you if you go down some lower-paying path. Most people ik who pursue low paying jobs have trusts/etc and so are very fulfilled with their lives. However if your parents don't have a high NW(on 300k its possible) then I wouldn't rely on help from them at all. But if they're high 7/8fig and willing to help then do whatever you want. Like seriously no point being miserable in a job you hate\n\n&#x200B;\n\nOn the flip side, I know people who pursue shit like English and become teachers who are miserable bc of the pay. Flying in economy class and wearing target clothes fucking sucks when you are used to business class and Prada(This is a first world problem but its a first world thread). It's super hard to go back to normalness once you've experienced the high life (on a smaller scale, I didn't have an AC in California for 15 years, but now we have one and i cant go without it in)\n\n&#x200B;\n\nThe teacher in question ended up moving into tech bc she really wanted the comforts of her childhood. So I think you really need to think about how much you value the current lifestyle and play that into your decisions",
      "author": "hahalolxddddd",
      "created": 1634358886,
      "upvotes": 13,
      "replies": {}
    },
    "hgtql12": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtql12/",
      "text": "look, i sympathize, but you are NOT upper middle class. you are rich. straight up. and im saying this as someone whos fam makes 200k+ lol. \n\nnow... i can kind of relate. my parents are wealthy enough to have given us a really like comfortable and mildly luxurious life, but theres no way they can afford top schools or like. network my way into somewhere LOL. as morbid as it is, they dont have any big inheritance to leave behind. i need to make money bc otherwise ill be broke lol. and i am someone who is VERY privileged compared to most people. \n\nlike u, my dream is 2 b a journalist specifically. but a HIGH journo salary is like 45k. lol. so .......... yeah. idk man",
      "author": "starshinez05",
      "created": 1634358837,
      "upvotes": 48,
      "replies": {
        "hgw1dn7": {
          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgw1dn7/",
          "text": "> look, i sympathize, but you are NOT upper middle class. you are rich. straight up. and im saying this as someone whos fam makes 200k+ lol.\n\nNot really. The traditional definition of being rich in America revolves around the 1% (which they are far from being in). Historically, most would define being part of the wealthy upper class by not needing to work; their primary income comes from investments and capital gains. You might think it's a small difference, but it's actually incredibly significant. If a doctor had a car accident tmrw and was out of commission and could never work again, they would be destitute eventually. However, if someone from the landed capital class had a car accident and was out of commission, they'd make enough from their investments alone (i.e. by simply existing) that they would still be fine. And therein lies the fundamental difference between being a member of the wealthy class and simply having some wealth.",
          "author": "doneanddead",
          "created": 1634409615,
          "upvotes": 3,
          "replies": {
            "hgw3577": {
              "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgw3577/",
              "text": ">starshinez05 · 12h HS Senior  \n>  \n>there is almost always someone richer than you, but that doesn't make you NOT rich. the issue is that the top 0.000001% (made up number, just to illustrate my pt) are so much more ostentatiously wealthy than the average person, so people (esp since we naturally get kind of \"used to\" our wealth/take it for granted) inevitably think, \"me not elon musk or jeff bezos. thus am middle class.\"  \n>  \n>like yes someone w a 300k/yr salary is, financially speaking, MUCH closer to a homeless person than to elon musk. w 300k there is still like. if you lost ur job youd maybe not have to worry for a year or something, but it would catch up with you.  \n>  \n>this all does not negate that this is a \"rich\" salary, though.",
              "author": "starshinez05",
              "created": 1634410362,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hgtxjjj": {
          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtxjjj/",
          "text": "Tbh rich is very subjective. Most who are making 1M won’t call him rich at least from my experiences. But I know a lot of teachers at my school who call 100k rich. For SWEs, 100k is first year comp. I would gladly listen to your side though if you’d like to share!",
          "author": "DELTATEENx",
          "created": 1634363716,
          "upvotes": -13,
          "replies": {
            "hgu0vtt": {
              "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgu0vtt/",
              "text": "there is almost always someone richer than you, but that doesn't make you NOT rich. the issue is that the top 0.000001% (made up number, just to illustrate my pt) are so much more ostentatiously wealthy than the average person, so people (esp since we naturally get kind of \"used to\" our wealth/take it for granted) inevitably think, \"me not elon musk or jeff bezos. thus am middle class.\"\n\nlike yes someone w a 300k/yr salary is, financially speaking, MUCH closer to a homeless person than to elon musk. w 300k there is still like. if you lost ur job youd maybe not have to worry for a year or something, but it would catch up with you.\n\nthis all does not negate that this is a \"rich\" salary, though.",
              "author": "starshinez05",
              "created": 1634366314,
              "upvotes": 17,
              "replies": {
                "hgu32uf": {
                  "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgu32uf/",
                  "text": "I would say he’s definitely upper-class but being “rich” is definitely a weird term to use. It’s kind of like college essays where some people may think your essay is amazing while others thinks it’s average. There’s no benchmark for being rich but there are benchmarks for economic classes",
                  "author": "DELTATEENx",
                  "created": 1634368128,
                  "upvotes": -4,
                  "replies": {
                    "hgv5mim": {
                      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgv5mim/",
                      "text": "He's rich. I'm upper middle class and am nowhere near that. Our family of 7 lives on 150k a year. We have 5 bedrooms 3 bathrooms. The sportiest car we own is a 10 year old Honda Accord. We live in a suburb of Houston, next to an oil company COO and a retired famous orchestra conductor. 300k a year is twice what the people on my street make. I can't even imagine how much crap they'd be able to afford with 3 people and 300k a year. \n\nI'm glad I'm not rich. I want a degree from a good school and a 45 hour workweek, no matter how much I make. It's not about money, and the more I read this post, the more I don't want my kids (if I have any) to grow up in a rich household.",
                      "author": "BoomTexan",
                      "created": 1634395606,
                      "upvotes": 1,
                      "replies": {
                        "hgvabrv": {
                          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvabrv/",
                          "text": "I’m just saying rich is a very subjective term and most of the internet could probably agree on that. I don’t think he’s rich but he is in the upper class not in the middle class. Obviously being “rich” is your choice. Personally I want to be more successful than my dad because of the opportunities I had versus him. Why did this post make you not want a rich household though?",
                          "author": "DELTATEENx",
                          "created": 1634397846,
                          "upvotes": 1,
                          "replies": {
                            "hgvaw3m": {
                              "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvaw3m/",
                              "text": "Money corrupts people. Read the post above. He said that if he does what he hates, he can live his current lifestyle. If he does what he loves, he'll be miserable because he'll be living on 30-50k a year. \n\nI know a family of 14 (yes, 12 kids) in my area that is lower-middle class and doesn't put much emphasis on education. They're remarkably happy. One kid is a chemical plant operator, another works at a tire shop, some are missionaries, one is border patrol, one is a cop, and they're all really happy. They grew up in a house where money, prestige, education, and all the things that OP wants don't matter, where the only things that matter are family and religion, and they're so much happier for it.",
                              "author": "BoomTexan",
                              "created": 1634398112,
                              "upvotes": 2,
                              "replies": {
                                "hgve9sf": {
                                  "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgve9sf/",
                                  "text": "I don’t think OPs parents necessarily want him to be rich. They want him to be successful. Journalism is a very industry to get a job in. My independent study teacher at school studied journalism as well and he was unemployed for a long time. It’s also very Risky because you NEED to have a good GPA in college. If not you probably won’t get a job. Unless you have an insane network. The mindset his dad has isn’t corrupt it’s very understandable. Also don’t know about the family you’re talking about, but OPs family made a ton of sacrifices for him by immigrating to the US. If I were in his position I wouldn’t really want my son taking up a $45k job either after all the money and sacrifices that went into his well-being.",
                                  "author": "DELTATEENx",
                                  "created": 1634399617,
                                  "upvotes": 2,
                                  "replies": {
                                    "hgvjd8m": {
                                      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvjd8m/",
                                      "text": "I guess we have some fundamental differences in our ideals. I would be fine with my kids making 50k a year, so long as they're steady in their faith and have a good life. \nSome people struggle to understand this, but money isn't a good thing.",
                                      "author": "BoomTexan",
                                      "created": 1634401869,
                                      "upvotes": 1,
                                      "replies": {
                                        "hgvjzuo": {
                                          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvjzuo/",
                                          "text": "We definitely do have our differences and I understand where you’re coming from. I think maybe it’s because I come from a successful family and I’ve seen “rich” first hand it’s a little different for me. Also I’m not the type of guy to flash money as well so I could be rich but I wouldn’t make it obvious to my kids if I have any. Money is a good thing if people know how to spend it and know the limits. Yo I agree there’s many people that screw over their own family for money but there’s also many that get to a certain stage and don’t care about making more.",
                                          "author": "DELTATEENx",
                                          "created": 1634402145,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hguvvhd": {
              "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hguvvhd/",
              "text": "This is just not true. For a family of 3 373,894 and up is considered rich",
              "author": "HahaStoleUrName",
              "created": 1634390580,
              "upvotes": 3,
              "replies": {
                "hgv8nop": {
                  "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgv8nop/",
                  "text": "You have to realize that all these benchmark numbers for being rich are done by polls where regular people vote in a controlled environment. So those numbers are still opinions. And the US News article you got that from is also an opinion. If you read it through she says “its a lot more complex than just a number”. This probably means that it varies for everyone.",
                  "author": "DELTATEENx",
                  "created": 1634397053,
                  "upvotes": 2,
                  "replies": {
                    "hgv947w": {
                      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgv947w/",
                      "text": "Then Lets look at the government definition, which the highest tax bracket is 622051 for married.\n\n\nBut yeah I agree rich is a relative thing",
                      "author": "HahaStoleUrName",
                      "created": 1634397277,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hgwet96": {
          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgwet96/",
          "text": "This guy fits the definition of upper middle class perfectly. Their joint income is hovering around the top 5% of Americans, which in some places is only slightly above average. Go read an economics book or something idk.",
          "author": "d8i_",
          "created": 1634415388,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgttbo9": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgttbo9/",
      "text": "There is a stress that comes from working in a career that you are not well-suited for.\n\nHowever, I think every job has downsides that aren’t apparent until you are doing them. Journalism might sound fun until you get the very boring entry-level assignment that has nothing to do with sports commentary, you hate your boss, and your story ideas always get shot down or you have to work every Friday and Saturday night covering high school games or something. In other words, I don’t know anyone who loves ALL parts of their job.\n\nSo I think most parents assume you will have some job stress in any job and want to save you from added financial stress. It sounds like no big deal to live on a small salary when you are young and single, but parents envision you with a family. If the washing machine breaks and you can’t afford a new one or you can’t afford piano lessons for your musically-talented kid or have to pass on getting them the spendy cool shoes they really want for their birthday — well, that’s when career regret could really set in.\n\nThat doesn’t mean that pursuing your dream is the wrong choice. But parents have some wisdom gained from life experience— knowing how comforting it is to have sufficient funds for emergencies and extras for your kids and knowing how expensive life is. They worry you can’t make an informed decision without that life experience.\n\nSo try to listen with that in mind. It likely isn’t because they think you NEED to be rich, but more that they are worried you will struggle if you are poor in ways you don’t anticipate right now.",
      "author": "cmac6767",
      "created": 1634360667,
      "upvotes": 11,
      "replies": {
        "hgtysml": {
          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtysml/",
          "text": "All jobs are stressful. That’s why it’s called work instead of play. Trying to live on 45k is stressful too.",
          "author": "the_journeyman3",
          "created": 1634364677,
          "upvotes": 5,
          "replies": {
            "hh15055": {
              "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hh15055/",
              "text": "This comment right here. They don’t pay you because it’s fun. If work was fun, you’d have to pay for it. In our society, most of us will have to work to provide for ourselves or have less stuff. Find a happy medium and enjoy life.",
              "author": "Red-eleven",
              "created": 1634504813,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgvanuc": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvanuc/",
      "text": "Perhaps I can share my perspective as an adult with children nearing college age.  In case you're wondering how I ended up in this sub, I've been lurking to try and better understand the modern college application experience, to help my kids as much as I'm able to (without being overbearing).  Apologies in advance if I'm not welcome here.\n\nFor some background, I grew up working class to lower middle class, but I attended a T20 school in a STEM major, through a combination of loans, grants, and parent's savings.\n\nFirst, I will say that, unless you're one of the very few exceptions, what you desire out of life will certainly change over time.  I said I would never wear a suit, or work more than 40 hours per week, or work a corporate job.  That ended up not panning out :).\n\nI've made as little as 35k in my career and as much as $500k+.  While you'll be able to make do with either extreme, I can say that life is much easier when you make more and allows you much more ability to follow your passion if your profession is not already that, whether it's in the present or later in life.\n\nThink long term.  Do you want to have kids and be able to afford to send them to a T20 school?  Do you want to retire early before 65?  Do you want to live a nice lifestyle (expensive dinners, vacations, activities)?  If the answer is no to some or all of these, your options open up greatly as your savings needs go down significantly.\n\nI'm not here to say that you should go for a higher paying corporate job or go into a school/major that sets you up for that.  What I will say, though, is that one option is to maximize the money you make earlier in your career, live within your means, save a shit ton of money, invest it well and \"retire early\".  It doesn't mean you have to stop working, you just won't have to worry as much about how much you're making if you want to switch to your passion.\n\nBtw, journalism is a tough world.  Be prepared to not earn much money, while still potentially having to live in a HCOL area.  I think it would be good to have a backup plan (major, profession, etc)  that doesn't involve relying on your parents to subsidize your lifestyle.",
      "author": "unconditionalten",
      "created": 1634398004,
      "upvotes": 7,
      "replies": {}
    },
    "hgtl0at": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtl0at/",
      "text": "It will be tough if your parents are funding your college. You can see from their point of view why they have a logical fear of you graduating and being unemployed and then no means to support yourself. Ultimately, they probably want you to be self-sufficient when they are no longer around. I think it all comes from a position of trying to look out for you. \n\nThat said, it’s their definition and not yours. What you should think about is, what do you want out of life in the future?  If you desire the comfort that your parents have given you, does your field of study and passion area help you do that?  If not, will you be ok not having that lifestyle?  Maybe you are ok with living in an apartment, used car, taking a trip once every few years so that you can follow a career that may not be lucrative. How many make it to sports commentary and how much money is that for those who make it at a local or national level and is that a viable career in the future, etc. Maybe that’s enough. \n\nIf their requirement is you have to study a certain field for them to fund you then you may not have an option and you may have to minor in journalism. Or you could try to community college route (less expensive to free in some states) and then transfer and pay your way thru the last two years of college via loans. Then you can study and have the freedom to choose.",
      "author": "TwoSuns168",
      "created": 1634355376,
      "upvotes": 4,
      "replies": {}
    },
    "hgtjxgv": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtjxgv/",
      "text": "I empathize with your confusion. I am in a very similar predicament.",
      "author": "FutureConsultingMan",
      "created": 1634354751,
      "upvotes": 3,
      "replies": {}
    },
    "hguts94": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hguts94/",
      "text": "You can, and should, gain life experience. I have not always been able to take my ideal jobs, but when I have a choice between two or three jobs, I choose the one that sounds interesting. Through the jobs, which I have always worked hard in, I have gained a better sense of how to deal with people in a variety of situations, how to adapt to new rules/systems/programs, and I also have a ton of legitimate experience. You do not need to launch directly from college into a career. You will need to find ways to make money, but that can be anything. You won’t have a ton of expenses right away, unless you try to live beyond your means. Enjoy trying weird and interesting jobs and always try to work your hardest.",
      "author": "Vawest",
      "created": 1634389392,
      "upvotes": 3,
      "replies": {}
    },
    "hgtivds": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtivds/",
      "text": "Why are you assuming you’d even do as well as your parents. Are you ok if you don’t do as well? Maybe nowhere close to as well?",
      "author": "the_journeyman3",
      "created": 1634354132,
      "upvotes": 7,
      "replies": {
        "hgtkgni": {
          "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtkgni/",
          "text": "Obviously nothing's a given, but the support, knowledge, and background I have all give me a pretty good chance of finding success in the tech industry. I just don't have the passion, which is why I'm unsure of my future.\n\nI would be ok if I fell short of my parent's financial success, but not if I went into the tech industry. If I eventually don't reach the summit my dad wants me to, I hope it's because I chose a different path, not because I trekked the same road and never reached the end.",
          "author": "mortizmajer",
          "created": 1634355064,
          "upvotes": 2,
          "replies": {
            "hgtmdvb": {
              "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtmdvb/",
              "text": "There is no money in journalism. So if you go down that path you need to accept that you are likely not going to have financial security. A lot of upper middle class kids seem to assume they will at a minimum have the same lifestyle as their parents just because. Doesn’t always work out that way.",
              "author": "the_journeyman3",
              "created": 1634356196,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "hguv7q6": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hguv7q6/",
      "text": "I just want to make a positive charge,and make enough to worry about money",
      "author": "HahaStoleUrName",
      "created": 1634390210,
      "upvotes": 3,
      "replies": {}
    },
    "hguweok": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hguweok/",
      "text": "are you me? because that's exactly how my parents are (except im actually upper-middle class and ur more like upper class tbh). also i feel so privileged already, and the majority of the population literally have a fraction of what i do. personally, i feel like a job i don't find fulfilling will just...make my life feel pointless, and make my mental health worse. tbh, once im a legal adult and not living under their roof, i feel like my parents can't control me and i'm free to do what i want to. for now, i'm planning to double major (one in my parents' \"desired\" field, the other in my passion). once i get out of college, it's up to me, and i still have several years to decide—maybe even my entire life.",
      "author": "messerundrosen",
      "created": 1634390877,
      "upvotes": 3,
      "replies": {}
    },
    "hgvdnp8": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvdnp8/",
      "text": "I'm a parent.  My goals for my kids is that they get to a point where they can be independent (financially, etc...).  I'm fully cognizant of the fact that they may not be able to have the level of financial stability that my husband and I have due to a number of factors.  Instead of pushing them to make a certain income, I encourage them to pursue studies that align with their interests but also have employment opportunities.\n\nIn the case of my youngest child, who is an artist, I've recommended that they consider getting a minor in Art while majoring in another field that interests them with better job opportunities.",
      "author": "teresajs",
      "created": 1634399352,
      "upvotes": 3,
      "replies": {}
    },
    "hguy902": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hguy902/",
      "text": "totally relateable, even tho im not from a wealthy family, more like lower middle class compared to the rest of the world.\n\nmy parents keep saying how we sacrificed so much and now we are here and how you need to do way better than us, and in India where I live there was a huge explosion of software companies which calls for all parents telling their child to become software developers, even tho software engineer doesn't get paid all that much under 1000 USD average, only experienced developers get paid well, and when starting out like 500 USD or less per month! it's better than most others, if not the same but not good enough. so now I have to sacrifice my dreams and follow what they say.\n\nand my solution to all this is:\n\nparents wont listen anyways, just say that u will study what ur parents want abroad, but once u are there do whatever u like, anyways its your life u have the right on what u want to do",
      "author": "WelderSpirited3027",
      "created": 1634391868,
      "upvotes": 2,
      "replies": {}
    },
    "hgtl2dm": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgtl2dm/",
      "text": "I'm in a similar predicament- my parents make over 300K a year, but they're Chinese immigrants who came from very poor families, so as a second-gen immigrant I have the responsibility to outearn them significantly and improve our family's socioeconomic status from upper-middle class to rich. \n\nBut I'm fortunate in that my passion lies in STEM, which also has opportunities to make good money. So I feel like I pretty much have two career paths to succeed- either become a quant trader and eventually work my way up to partner or start my own fund, or go into tech and eventually start a company. So my goal would be to follow one of these paths successfully, and my motivation is primarily fulfilling my own dreams (since I care a lot about being rich as well) as well as my parents. However, for people like you with a passion in the humanities or low-paying fields, I can certainly see how it's much more difficult.",
      "author": "CarpetsAreTasty",
      "created": 1634355409,
      "upvotes": 1,
      "replies": {}
    },
    "hgu5wu0": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgu5wu0/",
      "text": "Not all STEM paths are money-oriented and even some of them may be, not everyone can make it to that level. I've witnessed so many CS majors/college grads who have the most mediocre jobs even in the tech industry (my dad manages a tech company so I've been exposed to that). You've still got plenty of time to figure it out. what kind of life that you'll have really depends on your learning skills and other qualities, not the major/\"path\" you choose. (I'm still a senior but I've learned this from observing my mother's career transformation over the years)",
      "author": "Capable-Ad1621",
      "created": 1634370537,
      "upvotes": 4,
      "replies": {}
    },
    "hgv1kbd": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgv1kbd/",
      "text": "https://www.rivervalleywellnesscentre.com/content/wp-content/uploads/2015/10/purpose-circles.jpg\n\nThis may not actually be ikigai but it’s an interesting diagram to look at nonetheless imo even if you disagree with it",
      "author": "radiocollector12",
      "created": 1634393590,
      "upvotes": 1,
      "replies": {}
    },
    "hgvckwm": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvckwm/",
      "text": "In a very similar situation as well. But like someone else said, you have your whole life ahead of you. When you think about the next 50 years, it probably seems static to you. More likely than not though, in 50 years so many more things can change, including your goals and what you value. \n\nMy mother also asked what motivated me once, and a couple years ago my response would be very different from what it is now. What I think is that no matter how much money your parents make now won't protect you from the world of hurt the world has to offer. This may sound cynical, but even if you don't desire money now, it doesn't mean that not having a comfortable salary to keep you afloat isn't going to impact you.",
      "author": "cynip23",
      "created": 1634398881,
      "upvotes": 1,
      "replies": {}
    },
    "hgvd8fk": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvd8fk/",
      "text": "middle???",
      "author": "Hufflepuff_Heroine",
      "created": 1634399161,
      "upvotes": 1,
      "replies": {}
    },
    "hgvgt7c": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvgt7c/",
      "text": "With posts like these, people tend to jump to extremes. As long as you can earn $80-$120K within 5-10 years of graduating, i think in most cities you be ok. Plus, if you truly are comparing a life to your parents, then that means also getting married which would add a second income to your life.",
      "author": "glutton2000",
      "created": 1634400727,
      "upvotes": 1,
      "replies": {}
    },
    "hgvk2b9": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgvk2b9/",
      "text": "Follow your heart and do what brings you joy and makes you happy.",
      "author": "Eureka_Utopia9764",
      "created": 1634402176,
      "upvotes": 1,
      "replies": {}
    },
    "hgw1nvi": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgw1nvi/",
      "text": "You're asking the wrong crowd",
      "author": "kevin3874",
      "created": 1634409736,
      "upvotes": 1,
      "replies": {}
    },
    "hgxuioa": {
      "link": "/r/ApplyingToCollege/comments/q93k76/as_an_uppermiddleclass_child_what_exactly_should/hgxuioa/",
      "text": "That’s honestly a question most people who aren’t even whatever income class high schoolers answer.\n\nRegardless of your parents expectations, pretty much anyone who has a passion in journalism or similar humanities fields have the exact same choice between stability or whatever they enjoy doing. And even if you had an interest in something that’d pay well more people jump off that path and try something different than you’d think. \n\nPoint is, it’s really hard for someone to imagine what goals their entire life would revolve around. And teenagers on a2c are a fraction of those people. But if you ask me, breath of the wild 2 comes out next year. My only “goal” is to wait to be able to play it.",
      "author": "LeatherBreath223",
      "created": 1634439565,
      "upvotes": 1,
      "replies": {}
    }
  }
}