{
  "sid": "qtf2kx",
  "link": "/r/ApplyingToCollege/comments/qtf2kx/should_i_withdraw_applications/",
  "title:": "Should I withdraw applications?",
  "text": "I'm currently applying to schools at the moment and since I want to work in the animation industry, I've been applying to a handful of art ones. However I got a bit cocky and began to just apply to schools for the ego boost I'd get after receiving an acceptance letter. There are a few schools I've applied to but have yet to submit my portfolio/essay and quite honestly? I don't want to go to those schools, being accepted just feels nice. \n\nI regret applying because I have only have 2-4 schools I truly want to go to and don't want to waste my time writing essays for schools I don't care for. Should I just say \"screw it\" and back out and focus on my main schools? Or, since I've already gotten this far, should I just submit them and get the applications finished up?",
  "author": "Starbursto",
  "created": 1636853728,
  "updated": 1637180553,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkj4zg3": {
      "link": "/r/ApplyingToCollege/comments/qtf2kx/should_i_withdraw_applications/hkj4zg3/",
      "text": "If you're sure that you won't ever attend these schools, then yes, I would just withdraw from them and focus on my \"actual\" applications.",
      "author": "prsehgal",
      "created": 1636854365,
      "upvotes": 1,
      "replies": {}
    },
    "hkknhx7": {
      "link": "/r/ApplyingToCollege/comments/qtf2kx/should_i_withdraw_applications/hkknhx7/",
      "text": "Let’s say someone else is doing the same thing as you… but the schools you want to get into are the schools they won’t go to even if they get in. So they could be sitting on an acceptance that you potentially got waitlisted or even denied for…",
      "author": "pupuphlatter",
      "created": 1636886235,
      "upvotes": 1,
      "replies": {
        "hkksq8j": {
          "link": "/r/ApplyingToCollege/comments/qtf2kx/should_i_withdraw_applications/hkksq8j/",
          "text": "That's actually a really good way of putting it. Thank you for the insight! I'll likely withdraw my applications in that case (once I figure out how to do that 😅)",
          "author": "Starbursto",
          "created": 1636890045,
          "upvotes": 2,
          "replies": {
            "hkksvmv": {
              "link": "/r/ApplyingToCollege/comments/qtf2kx/should_i_withdraw_applications/hkksvmv/",
              "text": "Good on you. And good luck on your top choices!",
              "author": "pupuphlatter",
              "created": 1636890149,
              "upvotes": 1,
              "replies": {
                "hkksx7t": {
                  "link": "/r/ApplyingToCollege/comments/qtf2kx/should_i_withdraw_applications/hkksx7t/",
                  "text": "Thank you so much for the help and support!!",
                  "author": "Starbursto",
                  "created": 1636890181,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hklrl6l": {
          "link": "/r/ApplyingToCollege/comments/qtf2kx/should_i_withdraw_applications/hklrl6l/",
          "text": "I feel like this (rampant) practice is actually screwing over a lot of kids these days.",
          "author": "BuffsBourbon",
          "created": 1636907956,
          "upvotes": 2,
          "replies": {
            "hkm8ffu": {
              "link": "/r/ApplyingToCollege/comments/qtf2kx/should_i_withdraw_applications/hkm8ffu/",
              "text": "Yeah. It’s hard to advise not to do it when there are those out there doing it to show off. I partly blame the Common App. But if we all frowned upon it, maybe it would at least (maybe) help others to think twice at what they really want before just shotgun spraying their apps out.",
              "author": "pupuphlatter",
              "created": 1636914658,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}