{
  "sid": "qvctj6",
  "link": "/r/ApplyingToCollege/comments/qvctj6/international_stanford_interview/",
  "title:": "International Stanford Interview",
  "text": "Hi guys! Do you know whether being offered a Stanford interview as an international student means anything good about my application? I was just wondering, because I saw a statistics that only approx. 13% of all applicants are offered an interview. I know that the process is kind of random and depends mainly on interviewers availability in my area but do you know anything more about the process? For example I heart that Harvard is shortlisting the application pool and offers their interviews only to those applications who have a real chances of being admitted (I’m not sure whether it’s true tho). Thanks!!",
  "author": "Foreign_Writing8291",
  "created": 1637083070,
  "updated": 1637179232,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hkvw48u": {
      "link": "/r/ApplyingToCollege/comments/qvctj6/international_stanford_interview/hkvw48u/",
      "text": ">I heart that Harvard is shortlisting the application pool and offers their interviews only to those applications who have a real chances of being admitted (I’m not sure whether it’s true tho).\n\nIt's not.",
      "author": "skieurope12",
      "created": 1637088189,
      "upvotes": 3,
      "replies": {}
    },
    "hkxd1n9": {
      "link": "/r/ApplyingToCollege/comments/qvctj6/international_stanford_interview/hkxd1n9/",
      "text": "you can find info about this right on stanford's website:\n\n>Please do not worry if you are not contacted, as your application will be considered complete without an interview. It may be that we do not have enough volunteers in your area to interview each applicant.  \nApplications are not pre-screened for interview eligibility.\n\nbeing offered an interview doesn't mean anything except that there were enough interviewers available in your area. the harvard thing is also false.",
      "author": "calabash_bro",
      "created": 1637109811,
      "upvotes": 1,
      "replies": {}
    }
  }
}