{
  "sid": "qx62g2",
  "link": "/r/ApplyingToCollege/comments/qx62g2/what_if_my_spike_doesnt_match_what_i_want_to_do/",
  "title:": "What if my spike doesn't match what I want to do in college?",
  "text": "Hey everyone, I've been thinking about the whole spike/hook thing, and I'm a little bit worried that my best selling points don't line up with my goals in college. \n\nI've settled on a solid three areas of interest that I want to use on my apps:\n\n1. My biggest talent (writing)\n2. My biggest passion (linguistics and conlanging)\n3. What I see as my \"purpose\" (combatting rare diseases through biomedical research)\n\nThe plan is to get a biochemistry degree as a precursor to a career in rare disease research. This is something I feel very, very deeply about. The problem is that I don't have anything impressive to show for it- I just feel like it wouldn't be a very noteworthy spike no matter how hard I try to make it one. This is mainly because of a lack of opportunities (I go to a public school in Oklahoma). There's a TSA chapter and a youth leadership program at a research facility that I can participate in, but I don't know of much else.\n\nSo, what if I use my writing/linguistics areas as my main spike instead? I would have a lot more opportunities to build a better one, and I'm generally better with writing and linguistics because I have more experience with them. Do you think this would be a good option for someone who is absolutely deadset on going into the biomedical research field? Do you think I would still be accepted into those kinds of programs?\n\nA tiny bit of extra context: I'm aiming for the t20 schools if possible, but I'm not focused on prestige, so I'm willing to cast a broader net. My scores, grades, etc are good. All that's left is to really figure out this whole spike situation.\n\nThank you for taking time to read this, your feedback really means a lot. I can't help but feel like I'm overlooking something very obvious, so if I am, feel free to point it out to me.",
  "author": "Nelson-Shmelson",
  "created": 1637289044,
  "updated": 1637353082,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl7eqku": {
      "link": "/r/ApplyingToCollege/comments/qx62g2/what_if_my_spike_doesnt_match_what_i_want_to_do/hl7eqku/",
      "text": "my spike was community service and passion for equity in education. i’m majoring in CS. got into every T5. I think you can relate writing to your major since i’m sure you will be doing a lot of research and writing a lot of papers. If you have good Science test scores etc, then if anything your skills in the humanities will only make you a better applicant. Colleges don’t want kids that are only good at one thing. They want kids that can take a variety of courses and take everything they learn in each of those classes and apply it to what they’re passionate about, regardless of whether or not they are in the same subject area. Colleges aren’t just here to teach you facts, they are to teach you how to learn, collaborate, think and analyze critically, etc. \n\nSome people might suggest you omit the biomed aspect and just stick to linguistics for your application since most schools don’t admit by major/ bind you to the major you chose in your application. I say combine/relate the two. Just because you don’t have a lot of ECs or experience in biomedical research doesn’t mean you can’t be interested in it, and there are other ways to express that interest with your writing.",
      "author": "sc-um-arleth",
      "created": 1637289943,
      "upvotes": 4,
      "replies": {
        "hl7g4xn": {
          "link": "/r/ApplyingToCollege/comments/qx62g2/what_if_my_spike_doesnt_match_what_i_want_to_do/hl7g4xn/",
          "text": "Thank you a ton, I think you might've solved my dilemma in the very first comment. I think you're right, as long as I focus my writing on related topics and have a common theme between my different interests I'll be a lot better off. I might just have to spend a bit of time thinking about what that common theme might be.",
          "author": "Nelson-Shmelson",
          "created": 1637290581,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl7hrtv": {
      "link": "/r/ApplyingToCollege/comments/qx62g2/what_if_my_spike_doesnt_match_what_i_want_to_do/hl7hrtv/",
      "text": "i’m all over the place too. not sure if i even have a spike but i did sociological research in high school about race, have a passion for tattooing, am a rower, but want to study history of medicine. none of my EC’s align with my intended major but somehow in my essays i was kind of able to connect them a little bit. like for my tattoo interest, i found the similarities between that community and medicine.",
      "author": "lemonlime465",
      "created": 1637291324,
      "upvotes": 2,
      "replies": {}
    },
    "hl82b6e": {
      "link": "/r/ApplyingToCollege/comments/qx62g2/what_if_my_spike_doesnt_match_what_i_want_to_do/hl82b6e/",
      "text": "FYI there's a lot of overlap between linguistics and genomics models",
      "author": "CalSimpLord",
      "created": 1637302183,
      "upvotes": 2,
      "replies": {}
    }
  }
}