{
  "sid": "qqf3dk",
  "link": "/r/ApplyingToCollege/comments/qqf3dk/help_all_of_my_extracurriculars_are_conflicting/",
  "title:": "Help? All of my extracurriculars are conflicting with each other and I don’t know what to say to the one I’m dropping out of",
  "text": "So basically today this morning one of the clubs I’m in for the medical competition HOSA told me that the second round of testing would be on Dec 11. And that’s also the day I have a rehearsal for orchestra, and just now the leadership in Mock Trial told us there will be a scrimmage on the same day. AND I just looked through my Science Olympiad Competition date, and out of all of the dates possible, it’s the same date as the regional competition for Mock Trial. I’m so angry at myself for noticing that earlier, especially since all of the clubs have been running for nearly two months. I made up my mind and I’m going to decide to quit Mock Trial, but since all of the teams are decided and we already started writing prosecutions and defense documents, I have like no idea how I’m going to tell them. I also don’t know what to tell them, because I don’t want them to think I’m valuing one thing over another, it’s just that it’s the easiest way for me to get everything done. There’s also people I know on leadership that I have to confront. I have absolutely no idea how to write an apology email telling leadership that I’m going to quit, can anyone help me brainstorm ideas? I’m so bummed and sad I don’t even know what to say.",
  "author": "EvaMeadows",
  "created": 1636496988,
  "updated": 1636653409,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjzuh72": {
      "link": "/r/ApplyingToCollege/comments/qqf3dk/help_all_of_my_extracurriculars_are_conflicting/hjzuh72/",
      "text": "Don’t think of it in terms of quitting per se. You’ve got conflicts in the schedule and you need to focus on what’s important to you. You can’t do everything… no one can. Therefore, you just have to be straight and in a business-like manner state there are too many conflicts in your schedule which are not in your control, and because of this you cannot devote the required time to every activity. You’re sorry to announce this so late. You hope they’ll respect your decision.",
      "author": "pupuphlatter",
      "created": 1636497859,
      "upvotes": 3,
      "replies": {}
    }
  }
}