{
  "sid": "qedn8q",
  "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/",
  "title:": "Fee waivers for commonapp",
  "text": "Hi so is it too late to request/ ask for fee waivers for RD and EA? What is the procedure and criteria can anyone guide me? Though my parents can afford it, it will be a burden and I cannot ask them to sacrifice so much",
  "author": "Timelymadam",
  "created": 1635023495,
  "updated": 1635183365,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhs9egs": {
      "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhs9egs/",
      "text": "https://appsupport.commonapp.org/applicantsupport/s/article/What-do-I-need-to-know-about-the-Common-App-fee-waiver",
      "author": "elkrange",
      "created": 1635023727,
      "upvotes": 2,
      "replies": {
        "hhs9pxe": {
          "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhs9pxe/",
          "text": "The counsellor fee waiver thing? Can anyone avail that? And does that mean signing statement is an automatic waiver orrrr some unis might not accept? Please guide",
          "author": "Timelymadam",
          "created": 1635023878,
          "upvotes": 1,
          "replies": {
            "hhs9xnx": {
              "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhs9xnx/",
              "text": ">Any of the following **indicators of economic need can qualify you** for a Common App fee waiver:  \n>  \n>• You have received or are eligible to receive an ACT or SAT testing fee waiver  \n>  \n>• You are enrolled in or eligible to participate in the federal free or reduced price lunch program (FRPL)  \n>  \n>• Your annual family income falls within the Income eligibility guidelines set by the USDA Food and Nutrition Service  \n>  \n>• You are enrolled in a federal, state, or local program that aids students from low-income families (e.g., TRIO programs such as Upward Bound)  \n>  \n>• Your family receives public assistance  \n>  \n>• You live in a federally subsidized public housing, a foster home or are homeless  \n>  \n>• You are a ward of the state or an orphan  \n>  \n>• You can provide a supporting statement from a school official, college access counselor, financial aid officer, or community leader  \n>  \n>Your counselor will be asked to complete a fee waiver form to affirm your request for a fee waiver.",
              "author": "elkrange",
              "created": 1635023980,
              "upvotes": 2,
              "replies": {
                "hhsa5kz": {
                  "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsa5kz/",
                  "text": "Yeah im asking regarding the last one? Can u elaborate on it? Thank u so much for the help regardless",
                  "author": "Timelymadam",
                  "created": 1635024080,
                  "upvotes": 1,
                  "replies": {
                    "hhsb6hq": {
                      "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsb6hq/",
                      "text": "Also, have you checked the Common App itself?\n\n>**You must meet at least one of the following indicators of economic need to qualify for an application fee waiver.** Select all that apply:\\*  \n>  \n>I have received or am eligible to receive an ACT or SAT testing fee waiver  \n>  \n>I am enrolled in or am eligible to participate in the Federal Free or Reduced Price Lunch program (FRPL)  \n>  \n>My annual family income falls within the Income Eligibility Guidelines set by the USDA Food and Nutrition Service  \n>  \n>I am enrolled in a federal, state, or local program that aids students from low-income families (e.g., TRIO programs such as Upward Bound)  \n>  \n>My family receives public assistance  \n>  \n>I live in federally subsidized public housing, a foster home or am homeless  \n>  \n>I am a ward of the state or an orphan  \n>  \n>I can provide a supporting statement from a school official, college access counselor, financial aid officer, or community leader  \n>  \n>I certify that I understand and meet the eligibility requirements to request an admission application fee waiver. I also understand if I am a first year student my counselor will be asked to verify my eligibility.  \n>  \n>Fee Waiver signature:\\*",
                      "author": "elkrange",
                      "created": 1635024556,
                      "upvotes": 2,
                      "replies": {
                        "hhsc4ko": {
                          "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsc4ko/",
                          "text": "It looked the same to me, where can I see the USDA guidelines?",
                          "author": "Timelymadam",
                          "created": 1635024987,
                          "upvotes": 1,
                          "replies": {
                            "hhscanh": {
                              "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhscanh/",
                              "text": "Google?",
                              "author": "elkrange",
                              "created": 1635025064,
                              "upvotes": 2,
                              "replies": {
                                "hhsckwh": {
                                  "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsckwh/",
                                  "text": "Ah did so, turns out I will qualify. Does same apply for college board to send SAT scores? And CSS profile?",
                                  "author": "Timelymadam",
                                  "created": 1635025199,
                                  "upvotes": 1,
                                  "replies": {
                                    "hhsd4e4": {
                                      "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsd4e4/",
                                      "text": "I don't know, pls google.\n\nSince you will need financial aid, assuming you are a domestic student, be sure to run the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based financial aid estimate before you apply.",
                                      "author": "elkrange",
                                      "created": 1635025445,
                                      "upvotes": 1,
                                      "replies": {
                                        "hhsdurp": {
                                          "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsdurp/",
                                          "text": "Oh im an international student",
                                          "author": "Timelymadam",
                                          "created": 1635025777,
                                          "upvotes": 1,
                                          "replies": {
                                            "hhsebmb": {
                                              "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsebmb/",
                                              "text": ">International applicants may be eligible for the Common App fee waiver. If you meet at least one of the indicators of economic need outlined in the Common App fee waiver question, please indicate so on your application. However, it is up to each individual school to determine if they will accept your fee waiver request. If a school determines you do not qualify for an application fee waiver, they may ask you to pay the application fee after submission.\n\nhttps://appsupport.commonapp.org/applicantsupport/s/article/What-do-I-need-to-know-about-the-Common-App-fee-waiver",
                                              "author": "elkrange",
                                              "created": 1635025992,
                                              "upvotes": 2,
                                              "replies": {
                                                "hhselns": {
                                                  "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhselns/",
                                                  "text": "Im sorry does that mean above guidelines will not serve ad the basis for being eligible for a waiver? I looked up the income and i am eligible as my oarents earn less than the stated, but it means i have no security at the end of the day?",
                                                  "author": "Timelymadam",
                                                  "created": 1635026118,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hhsf0pb": {
                                                      "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsf0pb/",
                                                      "text": "For an international student, the college decides on its own whether your fee waiver request will be granted. (Keep in mind that many colleges give no need-based aid to internationals, in which case they might not grant need-based fee waiver requests.)\n\nSee what you can find on each of your college websites and/or contact the admission office to ask.",
                                                      "author": "elkrange",
                                                      "created": 1635026308,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "hhsfcf6": {
                                                          "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsfcf6/",
                                                          "text": "Alright thank u so much, you have been very kind and patient",
                                                          "author": "Timelymadam",
                                                          "created": 1635026459,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hhsaewc": {
                      "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsaewc/",
                      "text": "No, I know nothing more than what Common App says.\n\nTry this CollegeVine article [https://blog.collegevine.com/how-to-receive-a-common-app-fee-waiver/](https://blog.collegevine.com/how-to-receive-a-common-app-fee-waiver/) and of course do some googling.\n\n>When your application is processed, your guidance counselor will be asked to confirm your eligibility for a fee waiver. You’ll probably want to speak with your counselor ahead of time to make sure they understand your financial situation and are prepared to support your request.  \n>  \n>What if your situation is such that you need financial help to afford to apply to college, but for reasons that don’t fit neatly into one of the above categories? For instance, perhaps your parent recently lost their job, or a member of your family recently incurred a major, unexpected medical expense. It’s also possible that your family’s financial situation looks better on paper than it really is.  \n>  \n>You may still be eligible for a Common App fee waiver under these circumstances. According to the Common App, as we mentioned above, you must be able to “provide a supporting statement from a school official, college access counselor, financial aid officer, or community leader.”  \n>  \n>If you believe you fall into this category, speak to your guidance counselor or equivalent school official. If they are asked to give a statement in support of your fee waiver request, you’ll want to make sure that the two of you are on the same page about your financial situation.",
                      "author": "elkrange",
                      "created": 1635024200,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhsb068": {
      "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsb068/",
      "text": ">Though my parents can afford it\n\nThen you probably won’t qualify without lying… or asking someone to lie for you.",
      "author": "Strict-Special3607",
      "created": 1635024474,
      "upvotes": 1,
      "replies": {
        "hhsbumw": {
          "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsbumw/",
          "text": "Idk i am an international student what is the quota for getting a waiver? I mean the bracket income? I cant find that to see if i will qualify or not.",
          "author": "Timelymadam",
          "created": 1635024861,
          "upvotes": 1,
          "replies": {}
        },
        "hhsby8e": {
          "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsby8e/",
          "text": "My parents aren’t rich at all, when i say they will afford it i mean they will be extremely burdened but will make ends meet to do so",
          "author": "Timelymadam",
          "created": 1635024907,
          "upvotes": 0,
          "replies": {
            "hhse3ki": {
              "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhse3ki/",
              "text": "You don't get free waivers just because it's a financial burden. Fee waivers are for students and families who cannot afford the fees.",
              "author": "roguezebra",
              "created": 1635025888,
              "upvotes": 1,
              "replies": {
                "hhsebde": {
                  "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsebde/",
                  "text": "Nvm found out i am eligible so :/ tho i must stress upon the fact being a financial burden is a legitimate reason",
                  "author": "Timelymadam",
                  "created": 1635025989,
                  "upvotes": 0,
                  "replies": {}
                },
                "hht22ki": {
                  "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hht22ki/",
                  "text": ">Fee waivers are for students and families who cannot afford the fees\n\nThis is the same thing as it being a significant financial burden on the family. There are very few families that quite literally don't have the money at all—as in, they couldn't afford it even if they used all of their food and rent money for the month. But more families than those get fee waivers.",
                  "author": "FuriousGeorge1435",
                  "created": 1635037123,
                  "upvotes": 0,
                  "replies": {
                    "hht4i0r": {
                      "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hht4i0r/",
                      "text": "Sure, college app fees can be a temporary strain on families. \n\nNot same financial burden like rent, utilities, disability, etc. 🙄",
                      "author": "roguezebra",
                      "created": 1635038305,
                      "upvotes": 1,
                      "replies": {
                        "hht8ovp": {
                          "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hht8ovp/",
                          "text": ">Not same financial burden like rent, utilities, disability, etc.\n\nExactly. So fee waivers are meant for students who can't afford to pay fees while still paying the above costs.",
                          "author": "FuriousGeorge1435",
                          "created": 1635040317,
                          "upvotes": 0,
                          "replies": {
                            "hhtde5f": {
                              "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhtde5f/",
                              "text": "[Fee waiver criteria ](https://collegereadiness.collegeboard.org/sat/register/fees/fee-waivers)\n\nYou're eligible for fee waivers if you say \"yes\" to any of the following:\n\nYou're enrolled in or eligible to participate in the National School Lunch Program (NSLP).\n\nYour annual family income falls within the Income Eligibility Guidelines set by the USDA Food and Nutrition Service.\n\nYou're enrolled in a federal, state, or local program that aids students from low-income families (e.g., Federal TRIO programs such as Upward Bound).\n\n\nYour family receives public assistance.\n\nYou live in federally subsidized public housing or a foster home, or are homeless.\n\nYou are a ward of the state or an orphan.",
                              "author": "roguezebra",
                              "created": 1635042646,
                              "upvotes": 0,
                              "replies": {
                                "hhteepp": {
                                  "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhteepp/",
                                  "text": "Most students whose families would be *significantly* negatively affected by the loss of the money that would go to fees fall under one of these criteria.",
                                  "author": "FuriousGeorge1435",
                                  "created": 1635043143,
                                  "upvotes": 0,
                                  "replies": {
                                    "hhtestz": {
                                      "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhtestz/",
                                      "text": "OP is not claiming that their family qualifies for a fee waiver. That is point you are missing.",
                                      "author": "roguezebra",
                                      "created": 1635043340,
                                      "upvotes": 0,
                                      "replies": {
                                        "hhthrz6": {
                                          "link": "/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhthrz6/",
                                          "text": "[Reply from OP](https://www.reddit.com/r/ApplyingToCollege/comments/qedn8q/fee_waivers_for_commonapp/hhsebde?utm_medium=android_app&utm_source=share&context=3)",
                                          "author": "FuriousGeorge1435",
                                          "created": 1635044838,
                                          "upvotes": 0,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}