{
  "sid": "qxxony",
  "link": "/r/ApplyingToCollege/comments/qxxony/having_an_inferiority_complex_and_high/",
  "title:": "Having an inferiority complex and high expectations placed on you doesn't excuse being a prick.",
  "text": "Title doesn't sound revolutionary, but so many people go against it. When it comes to conversations about applying to colleges, people act like assholes very often. Even if it's accidental. Telling people they won't get into college for not being an honors student, judging others for not doing AP classes, and etc. Even weird indirect things like \"oh I would die if I had an SAT under 1300\" said in front of people who they know got lower than a 1300. And the god awful \"Ugh I got a 95, this is the lowest score... What did you get? 60? Awwww, omg that's so good! awww.\"\n\nBut everytime someone points this out, they say \"well my parents have high expectations\" or \"I can't help it, I'm not confident.\" But not being confident doesn't go hand in hand with bringing others down. You can just... say sorry, you know? I'm not faulting the person forever for bringing others down, because they just picked up that behavior from others. But it is so annoying when they refuse to even admit that they're doing it. If you really want to help your stress, low confidence, and accidental rudeness, then just admit or explain it and don't excuse it. \"Sorry, I was being irrational there,\" \"Personally my goal was getting over 1300, and I'm really serious about goals,\" \"I didn't mean to place that onto you,\" and etc. Even just explaining why you have such intense expectations works, instead of getting mad at the person you upset for not knowing you have parents pressuring you.\n\nThe reason I say this was because I was the honors/ap course student who had irrational expectations and goals, and I knew I did. I excused my problems with \"I have low confidence\" and thought I'd never change because I was really negative. And my parents were stressing me out. All of these were my problems that are really common. Of course I had confidence issues, I was 15. But I never wanted to be the ivy league kid, and I didn't really care for that many academic achievements and involvements. So because of this I had classmates going up to me saying I won't ever get accepted into a uni, people my age looking down and concerned about me not being in multiple sports and clubs and student council, and of course the \"you'll fail in life and die on the street\" just because of my choice in schools. And sure some classmates were extreme, but people STILL bring others down. My classmates indirectly talk down on those going to community college. Someone I knew had a 1380 SAT and said that it was a failure score and no one could be worse. When I said mine was 1260, they said \"UGH wish that was me! You're so lucky... :(\" It's genuinely so annoying and I've lost patience for it as a senior. Sidenote, I'm in public school... so I can't even imagine how bad it gets in college prep ones.\n\nI know a lot of them just want to be in the position of the failing one, to purposefully place themselves lower than others. Because that's how they feel. But reality check, it's really obnoxious. Especially when it's based on grades, literal rankings and numbers to prove how you scores on something.\n\nAnd if your immediate reaction is to think \"but you don't understand, my parents are crazy and I NEED perfect grades,\" I get that. And it's true that those are the reasons for your stress and irrational/negative thoughts. But it doesn't ever excuse bringing others down even if you didn't mean to. Once you're in the position of the kid with average grades hearing how others would be disgusted getting B's and C's, you'll understand. And also an environment of everyone being so stressed and negative isn't ever healthy for anyone, especially during college application times.\n\n&#x200B;\n\nTo end this rant I'd like to say that all my classmates from when I was 15 was wrong. Remember high schoolers are just teenagers with underdeveloped brains. Be self aware of where/who you are taking your stress out on. Also mental health is important, it's not quirky to be stressed and depressed. And um happy college applying season? This was long, sorry about that. Basically 4 years worth of a rant.",
  "author": "the_custard",
  "created": 1637382265,
  "updated": 1637688424,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.91,
  "comments": {
    "hldpjqa": {
      "link": "/r/ApplyingToCollege/comments/qxxony/having_an_inferiority_complex_and_high/hldpjqa/",
      "text": "I know a an ex-friend who got so mad that their ex was in the same AP Lang class as them because, quote, \"I'm so much smarter than her, I have a 4.17 gpa.\" She also spent the two years we knew each other gunning for being the top and acting as if taking less than 5 APs sophomore year was proof of failure.",
      "author": "gouverneurmroosevelt",
      "created": 1637413011,
      "upvotes": 3,
      "replies": {}
    },
    "hldah3m": {
      "link": "/r/ApplyingToCollege/comments/qxxony/having_an_inferiority_complex_and_high/hldah3m/",
      "text": "yo stuart, that you little buddy? long time no see, how you doin",
      "author": "Few_Rooster_4497",
      "created": 1637400914,
      "upvotes": 2,
      "replies": {}
    },
    "hldcp0h": {
      "link": "/r/ApplyingToCollege/comments/qxxony/having_an_inferiority_complex_and_high/hldcp0h/",
      "text": "bro why even rant just turn this shit into one of your responses to an essay prompt💀",
      "author": "jakespecter556",
      "created": 1637402873,
      "upvotes": -1,
      "replies": {
        "hlgyez8": {
          "link": "/r/ApplyingToCollege/comments/qxxony/having_an_inferiority_complex_and_high/hlgyez8/",
          "text": "☠️☠️☠️",
          "author": "DonJunigii",
          "created": 1637467932,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}