{
  "sid": "q9u117",
  "link": "/r/ApplyingToCollege/comments/q9u117/cornell_cas_supplemental_essay_dilemma/",
  "title:": "Cornell CAS Supplemental essay dilemma",
  "text": "Im applying ED to Cornell. The prompt of the essay asks what led you to pursue your intended major(s) and why you are choosing Cornell's CAS. \n\nHere is my problem: I want to study a very different major than what my extracurriculars are showing. My EC are almost all economic and social-science related. But I really want to study physics and has done much better in my stem classes in terms of grades. Is it suitable that I write about both economics and physics in my essay? Most people that I've talked to says that it wouldn't make sense because the two fields are so unrelated.",
  "author": "xen0n-_-",
  "created": 1634455820,
  "updated": 1636152381,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgyk9wp": {
      "link": "/r/ApplyingToCollege/comments/q9u117/cornell_cas_supplemental_essay_dilemma/hgyk9wp/",
      "text": "You do what reflects you. Not others opinions of what they think or assume they see. Talk about why you’re interested. Unrelated? On the surface perhaps. So talk about why you see the relation. \n\nECs not matching isn’t as big of a deal. Colleges like to see “wide” kids. It used to be they wanted focused and narrow but they’ve realized this wasn’t good (or healthy).",
      "author": "pupuphlatter",
      "created": 1634456123,
      "upvotes": 1,
      "replies": {}
    },
    "hgyo1ig": {
      "link": "/r/ApplyingToCollege/comments/q9u117/cornell_cas_supplemental_essay_dilemma/hgyo1ig/",
      "text": "Just try applying to engineering one. Their essay is easier",
      "author": "UpbeatAd2524",
      "created": 1634459197,
      "upvotes": 1,
      "replies": {}
    },
    "hha0d1m": {
      "link": "/r/ApplyingToCollege/comments/q9u117/cornell_cas_supplemental_essay_dilemma/hha0d1m/",
      "text": "You can totally pull it off. I applied to Cornell Engineering in the regular decision pool 5 years ago with my main extracurricular being debate. I wrote my supplemental essay about how I wanted to apply CS/math to public policy and I ended up attending Cornell. You have to make a clear connection between the two, but it can totally can be successful.",
      "author": "happysted",
      "created": 1634675396,
      "upvotes": 1,
      "replies": {}
    }
  }
}