{
  "sid": "qhh9z1",
  "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/",
  "title:": "Value of Amherst College CS degree",
  "text": "Okay please hear me out. I am an international student applying to Amherst College for CS major. I chose a liberal arts college for a science major because my interests are varied. I want the flexibility of the open curriculum.\n\nBut after hearing my decision, my family is emphasizing how much of a mistake it is to take a BA degree instead of a BSc. They say my salary will be tremendously low and I might not even get a placement after graduating from Amherst in CS. So, is it true?\n\nLanding a great job and package is not my final goal, but it is a crucial intermediate stage for realizing my dreams. So, I need a job with a good initial package.\n\nSo, what should I do? I really want to attend Amherst College, but I also don't want my lack of judgment on this to scrutinize my future.\n\nThank you for your help!!",
  "author": "Clock_ss",
  "created": 1635404879,
  "updated": 1636154756,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hicri8t": {
      "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hicri8t/",
      "text": "Your family is wrong in this case... Employers don't care if you have a BS or a BA... And when it comes to CS, they usually don't care about where you go to school other - what matters is what you do once you're there.",
      "author": "prsehgal",
      "created": 1635405888,
      "upvotes": 7,
      "replies": {
        "hicrkw4": {
          "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hicrkw4/",
          "text": "So, the placement salary and opportunities are comparable?",
          "author": "Clock_ss",
          "created": 1635405953,
          "upvotes": 1,
          "replies": {
            "hicrsnt": {
              "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hicrsnt/",
              "text": "Yes",
              "author": "prsehgal",
              "created": 1635406136,
              "upvotes": 2,
              "replies": {
                "hifkwnc": {
                  "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hifkwnc/",
                  "text": "I wouldn’t  agree that salary doesn’t depend on the school you attended for CS. The data seems quite clear.",
                  "author": "RichInPitt",
                  "created": 1635455961,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hidkhje": {
              "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hidkhje/",
              "text": "I would add that \"placement opportunities\" are depend much more on the student than the school that granted his undergraduate degree.",
              "author": "jayphoward",
              "created": 1635426652,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hidk802": {
      "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hidk802/",
      "text": "Your family is wrong.  Nobody really cares about BS vs. BS.\n\nAnecdotally, the only person I know who attended Amherst for undergrad was subsequently admitted to a T10 Ph.D. program in C.S., left with a M.S., got a J.D. from George Washington, and is now chief of the Information Law division at the U.S. Dept. of Commerce.",
      "author": "jayphoward",
      "created": 1635426522,
      "upvotes": 3,
      "replies": {
        "hidola3": {
          "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hidola3/",
          "text": "Thank you!",
          "author": "Clock_ss",
          "created": 1635428582,
          "upvotes": 1,
          "replies": {}
        },
        "hifjzhn": {
          "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hifjzhn/",
          "text": "[Allyson Deitrick?](https://ogc.commerce.gov/collection/information-law)  Not what her profile says.",
          "author": "RichInPitt",
          "created": 1635455580,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiczffa": {
      "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hiczffa/",
      "text": "For CS, BA and BS don’t matter. \n\nThe difference is basically that a BA allows you to take more varied classes like higher level English classes and language classes. Where as a BS is more focused on CS. \n\nBoth will still give you the skills necessary.\n\nGo to the college page and looking at the program class requirements for both degrees and see which one suits you more.",
      "author": "Outherepoor",
      "created": 1635412767,
      "upvotes": 2,
      "replies": {
        "hidok61": {
          "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hidok61/",
          "text": "Okay Thanks.",
          "author": "Clock_ss",
          "created": 1635428567,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hirimm8": {
      "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hirimm8/",
      "text": "I am the Chief Digital Officer for one of the largest tech companies in the world. I hired over 80 data engineers / SW programmers / data scientists this year.\n\nI can safely say that:\n\n1. I do not care whether you have a BA or a BS\n2. I prefer to hire people with a masters degree (but not always)\n3. I prefer to hire people with a strong foundation in liberal arts; written & verbal communications skills, a broad range of knowledge as opposed to a narrow one\n4. I would choose a History BA + CS MA over a CS BA + CS MA, any day (all things being equal)\n5. CS is primarily a creative problem solving job, that happens to solve problems through code...there are way more coders than there are problem solvers, and a limited knowledge base + poor communications is a recipe for disaster\n6. If you are applying for a CS position, we have tests in place to see whether you are capable of coding, we have interviews that will probe whether you can solve problems...if you have mediocre coding skills but are an excellent problem solver I will pay for you to get trained; that's how valuable you are\n7. I value solid practical experience and a passion for your craft...I do look at your extracurriculars and things you've invested your time in in college...show me you are passionate and are willing to invest time and effort into it\n\nI can go on and on.\n\nThe reality is, me and a lot of my peers don't think a BA alone is enough for us to use you directly out of college. Real world coding is very different from theoretical coding. Team work, communication skills, dedication, loyalty, tenacity, the ability to make parallel connections, understanding what the business requirements are etc. are what we are ultimately looking for in a leader.\n\nOn a personal note, both my kids attend Amherst (though neither of them are CS majors). Like a lot of students there, they chose Amherst over other better known schools because of the power of the liberal arts education. BTW, LACs are not the only schools that provide a liberal arts education.\n\nThere will be a time in the very near future where AI will code better and faster than humans (this year alone, I have replaced close to 30% of my people with machines). But AI will not solve my problems...humans will. If your goal is to compete with a machine on skills, you will lose. If your goal is to use machines to solve my problems, you will succeed.",
      "author": "mmmya",
      "created": 1635688560,
      "upvotes": 2,
      "replies": {
        "his4wke": {
          "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/his4wke/",
          "text": "Thank you for the information sir. But I want to ask one thing. Have you heard about Indian IIT sir? I have heard that it doesn't matter from where I graduated. But if you had to choose between an Amherst CS and an IIT CS would you still look at other things? And that IIT tag won't be slightly higher in the pile?",
          "author": "Clock_ss",
          "created": 1635698638,
          "upvotes": 1,
          "replies": {
            "hitipxo": {
              "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hitipxo/",
              "text": "I have three IIT grads in my group. I IIT BS, 1 IIT BS + Cornell MS, 1 IIT BS + Columbia MS (and many more during my career).\n\nAll three are very smart and very skilled. The reputation of IIT is known in this field and we did notice it when we were going through their resumes. But it I were to be honest with you, they do have limitations that most narrowly educated engineers have. Good at coding, struggles with connecting technology to larger business problems.\n\nSo in the end it's not an easy thing to answer. IIT will get you noticed (as will Amherst). But IIT may not best prepare you for a leadership role (not so with Amherst).",
              "author": "mmmya",
              "created": 1635720268,
              "upvotes": 2,
              "replies": {
                "hiu9gvg": {
                  "link": "/r/ApplyingToCollege/comments/qhh9z1/value_of_amherst_college_cs_degree/hiu9gvg/",
                  "text": "Hey, thank you. I have gained a lot of clarity about where to go to study\n.",
                  "author": "Clock_ss",
                  "created": 1635734014,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}