{
  "sid": "qrwb4m",
  "link": "/r/ApplyingToCollege/comments/qrwb4m/senior_year_grades/",
  "title:": "Senior Year Grades…",
  "text": "Hello everyone. I am a senior in high school and have submitted nearly all of my college applications early action. Senioritis has struck me pretty hard and I have not worked very hard this year. I am a straight A student in my Freshman, Sophomore, and Junior years, but I just got a C in a class first term Senior year. I applied to some pretty selective schools, and I’m wondering how big of an impact this will have on my possibility of acceptance. Do they care much about senior grades? Did I just royally fuck myself in getting into a good college by getting a C?",
  "author": "TheKingOfDat001",
  "created": 1636668414,
  "updated": 1636745327,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hk9a9ss": {
      "link": "/r/ApplyingToCollege/comments/qrwb4m/senior_year_grades/hk9a9ss/",
      "text": "Probably wont completely ruin your shot, but yea it might be a little problematic, but i wouldnt worry too much about it",
      "author": "Asleep_Course_7162",
      "created": 1636668754,
      "upvotes": 9,
      "replies": {
        "hk9aaq8": {
          "link": "/r/ApplyingToCollege/comments/qrwb4m/senior_year_grades/hk9aaq8/",
          "text": "Hope u get in bro",
          "author": "Asleep_Course_7162",
          "created": 1636668764,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hk9abg4": {
      "link": "/r/ApplyingToCollege/comments/qrwb4m/senior_year_grades/hk9abg4/",
      "text": ">Do they care much about senior grades? \n\nyes\n\n&#x200B;\n\n>Did I just royally fuck myself in getting into a good college by getting a C?\n\none c? No",
      "author": "Strict-Special3607",
      "created": 1636668772,
      "upvotes": 3,
      "replies": {}
    },
    "hk9e6lu": {
      "link": "/r/ApplyingToCollege/comments/qrwb4m/senior_year_grades/hk9e6lu/",
      "text": "If the decision is made before you have to submit that report, then you’re most likely fine. If you have to submit it before the admissions process is over, then that’ll probably be pretty damaging.",
      "author": "thatcornellbitch",
      "created": 1636670453,
      "upvotes": 3,
      "replies": {}
    },
    "hk9iin0": {
      "link": "/r/ApplyingToCollege/comments/qrwb4m/senior_year_grades/hk9iin0/",
      "text": "Yes, they care about your most recent grades.\n\nIf grades are received for the admissions decision - they request first quarter for EA/ED or mid-year report for RD - yes, lower grades will negatively impact an application.\n\nThe extent depends on what the grades are. One C among all other A’s wont’ be significantly impactful. Lower grades will impact more.",
      "author": "RichInPitt",
      "created": 1636672364,
      "upvotes": 2,
      "replies": {}
    }
  }
}