{
  "sid": "qdro4e",
  "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/",
  "title:": "It'll all be over in 2 months",
  "text": "The last 2 years of my life have been pretty stressful to say the least. Now that I'm finally getting back in touch with my friends and being invited to hang out, I'm forced to say no due to college apps (pressure from myself + parents)\n\nIf anyone is in the same situation as me, it will all be over in 2 months. I repeat. It will all be over in 2 months. Just gotta grind it out until then and have fun after.",
  "author": "throwaway_a2c_1749",
  "created": 1634940978,
  "updated": 1635183343,
  "over_18": false,
  "upvotes": 94,
  "upvote_ratio": 0.99,
  "comments": {
    "hholhqw": {
      "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hholhqw/",
      "text": "I would be careful with this attitude, as I used to think this way as well. Don't say \"It'll be over in x and I will finally be at peace/whatever\". After one grind is over, another takes its place in my experience. Instead try to enjoy the grind, as it eventually gets harder (and you might find yourself wishing going back to the time where your main worries were school and college admissions). Obviously, there will be less grinding after college apps for a bit, but looking forward to those gaps doesn't work for me.",
      "author": "-limabeans-",
      "created": 1634945499,
      "upvotes": 43,
      "replies": {
        "hholn5k": {
          "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hholn5k/",
          "text": "I just typed that and realized it sounds really discouraging, not my intentions lol",
          "author": "-limabeans-",
          "created": 1634945574,
          "upvotes": 14,
          "replies": {
            "hhomex5": {
              "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hhomex5/",
              "text": "Woah, but I think that's actually good advice though. Because with thinking that something is going to be over after a certain period of time, you gradually develop a mindset where you tend to focus on the challenges you have to face.",
              "author": "Rude-Candidate-8728",
              "created": 1634945965,
              "upvotes": 14,
              "replies": {}
            }
          }
        }
      }
    },
    "hhp1kj4": {
      "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hhp1kj4/",
      "text": "How many apps are you doing?\n\nI am definitely in the do not bother me right now mindset because I am behind on essays for early action deadline and had not started my college application journey until the start of this senior year, so I was behind on everything. but after this deadline ill have a break for a little bit before doing some of the UCs essays which should take like 1 or two weekends. and then in the same grind mindset at the end of December for RD. But in between then I will do some apps in my downtime and just focus on my social life. consider cutting down if there are too many apps, but I cant tell you what to do. \n\n&#x200B;\n\nThis is your last year of HS, make some memories.",
      "author": "TacoManTheFirst_",
      "created": 1634953805,
      "upvotes": 6,
      "replies": {}
    },
    "hhoji41": {
      "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hhoji41/",
      "text": "How much time are you spending on apps?",
      "author": "skinnnyjimmmy",
      "created": 1634944491,
      "upvotes": 3,
      "replies": {}
    },
    "hhou1pm": {
      "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hhou1pm/",
      "text": "Am I the only one who immediately read that and went no please don't kill yourself",
      "author": "ArbitNM",
      "created": 1634949871,
      "upvotes": 4,
      "replies": {
        "hhpol9l": {
          "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hhpol9l/",
          "text": "same",
          "author": "anuxietys",
          "created": 1634967540,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhozvuu": {
      "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hhozvuu/",
      "text": "You can do both. It’s not that deep.",
      "author": "SnooHabits9381",
      "created": 1634952936,
      "upvotes": 6,
      "replies": {}
    },
    "hhp74nz": {
      "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hhp74nz/",
      "text": "I have like five weeks until my QB decisions and I keep fantasizing about an acceptance, but I’m so scared to get rejected oof",
      "author": "Snoo_62176",
      "created": 1634956644,
      "upvotes": 2,
      "replies": {}
    },
    "hhq8oa4": {
      "link": "/r/ApplyingToCollege/comments/qdro4e/itll_all_be_over_in_2_months/hhq8oa4/",
      "text": "As from my experience, the grind never stops, something is bound to replace this application stress. In my case, I have government exams in May so I will have to prepare for them. But hopefully, it gets less stressful by December.",
      "author": "AstronautOnF1re",
      "created": 1634985128,
      "upvotes": 1,
      "replies": {}
    }
  }
}