{
  "sid": "r3v7mo",
  "link": "/r/ApplyingToCollege/comments/r3v7mo/applying_to_the_same_schools_as_your_friends/",
  "title:": "applying to the same schools as your friends",
  "text": "I don't know if anyone else is experiencing this but I applied to the same school as my best friends, and it's really stressing me out because I don't know how to react if one of us don't get into the school.  Like, if we all get in, YAY. If we don't all get in, fine we can be sad together. But if only one person gets in, or if only one didn't make it... that's real awkward man",
  "author": "ni03112",
  "created": 1638071795,
  "updated": 1638205166,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmcyzzt": {
      "link": "/r/ApplyingToCollege/comments/r3v7mo/applying_to_the_same_schools_as_your_friends/hmcyzzt/",
      "text": "Real friends will support each other no matter what.\n\nJust make sure to be supportive if you're the one that gets rejected/waitlisted. And be empathetic if you're the one that gets accepted",
      "author": "ssssseabass",
      "created": 1638071950,
      "upvotes": 8,
      "replies": {
        "hmczffn": {
          "link": "/r/ApplyingToCollege/comments/r3v7mo/applying_to_the_same_schools_as_your_friends/hmczffn/",
          "text": "but at the moment it will be so hard for the ones that did get in to contain their happiness, and im scared that if one of us do not get in it will be really hard",
          "author": "ni03112",
          "created": 1638072171,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hme4ct4": {
      "link": "/r/ApplyingToCollege/comments/r3v7mo/applying_to_the_same_schools_as_your_friends/hme4ct4/",
      "text": "Just keep in the forefront of your minds that acceptances and rejections aren’t actions you are taking on each other. These are actions a school has determined and it has nothing to do with your friendships or even your worth. We all know the process can yield unexpected results. Think of it this way, whatever schools you get into, it’ll be fun visiting each other and sharing experiences. Ultimately, see and react to it as if none of you had the same schools…",
      "author": "pupuphlatter",
      "created": 1638100760,
      "upvotes": 3,
      "replies": {}
    },
    "hmcyxoe": {
      "link": "/r/ApplyingToCollege/comments/r3v7mo/applying_to_the_same_schools_as_your_friends/hmcyxoe/",
      "text": "trust its not you all will still be friends just keep in touch outside of school. It’s not as intimidating or awkward as it seems. You’ll definitely meet new people in college too so try not to stress.",
      "author": "jakespecter556",
      "created": 1638071917,
      "upvotes": 2,
      "replies": {}
    }
  }
}