{
  "sid": "qv6sc5",
  "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/",
  "title:": "Stanford interview",
  "text": "I just finished my interview. Went on for 45min. I had about 10min for QA. I mis-stated my GPA. I told them it was 97% while my Stanford weighted GPA minus first year is 4.39. I feel I could have done better!🤢",
  "author": "Typical-Insect-5048",
  "created": 1637065950,
  "updated": 1637179162,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.7,
  "comments": {
    "hkuhs6d": {
      "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/hkuhs6d/",
      "text": "It’s ok. I believe they are human too and understand the pressure you feel. It’s a lot to stress",
      "author": "AssumptionNo2054",
      "created": 1637066554,
      "upvotes": 7,
      "replies": {}
    },
    "hkvfbdv": {
      "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/hkvfbdv/",
      "text": "Why would your GPA come up in a college interview? It’s not about flexing your stats and ECs: it’s about giving the university an idea of who you really are as a person.",
      "author": "Harikrishna_",
      "created": 1637081670,
      "upvotes": 3,
      "replies": {
        "hkwiqv1": {
          "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/hkwiqv1/",
          "text": "IDK but 35min was all about ECs",
          "author": "Typical-Insect-5048",
          "created": 1637097099,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkwos7b": {
      "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/hkwos7b/",
      "text": "It's not evaluative, just a chit-chat. I'm sure you did fine. Good luck on your apps.",
      "author": "CLOWN_ALERTO",
      "created": 1637099492,
      "upvotes": 2,
      "replies": {
        "hkxg1jh": {
          "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/hkxg1jh/",
          "text": "Good to know. I thought the interviewer gave the feedback that went on my admission file. Is that not right? Does Stanford not take into account the interview feedback in decision? I read mixed reviews on the REA interviews. Anyone know?",
          "author": "Typical-Insect-5048",
          "created": 1637111150,
          "upvotes": 1,
          "replies": {
            "hkxtcti": {
              "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/hkxtcti/",
              "text": "The feedback is a rating on various personality traits but it essentially is just pass/fail. The only way it has any impact on your admissions file is if your interviewer thought you had such egregious personality traits (i.e. you're just racist, incredibly rude, etc.) that you should not be admitted. You also write a brief paragraph at the end of the interview submission saying what their main ECs, focuses, major, etc. are just to make sure it lines up with what they wrote on app. Probably like 4 sentences.\n\nI did student interviews last year and my brother above me also does interviews for the past few years, and you can see who got admitted and there is absolutely no correlation. Also if you think about it rationally, the interview process is completely unstandardized and there are probably thousands of interviewers interviewing a few kids. It's just for you to learn about the school, and also good experience talking in general since interviews will obviously come up in the future. But no they are not evaluative in any sense, at least not in a way that will impact admission.\n\nAlso some kids get in without interviewing so it obviously can't be that important.",
              "author": "CLOWN_ALERTO",
              "created": 1637116994,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkwfklo": {
      "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/hkwfklo/",
      "text": "Same here haha. All was going well until I fumbled and answered a question with some bizarre, in the moment tangent about “world peace” that sounded extremely dumb. I hope they take anxiety into consideration 😣",
      "author": "Apprehensive_Ad_7249",
      "created": 1637095854,
      "upvotes": 1,
      "replies": {
        "hkwik7h": {
          "link": "/r/ApplyingToCollege/comments/qv6sc5/stanford_interview/hkwik7h/",
          "text": "😂",
          "author": "Typical-Insect-5048",
          "created": 1637097026,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}