{
  "sid": "qdyz33",
  "link": "/r/ApplyingToCollege/comments/qdyz33/what_if_you_regret_your_ed_choice/",
  "title:": "what if you regret your ED choice?",
  "text": "i'm applying ED to rice university as a computer science/cog sci major, but the school was never my first choice. i didn't have a dream or favorite school in mind, so i decided to go for the university that best suited my needs! my parents and community keep on pestering me to rethink my choice because of the prestige, location, major, etc.━ i'm getting nervous.\n\nthere's a high possibility that i'll get disappointed if i get in, though; i LOVE rice, but i might be haunted with the \"what ifs?\" and constantly question if i could've gotten into a higher ranked school or been happier if i went to another university.\n\nhas anyone else had this problem before? any tips and advice (or just plain ranting) will help tons :)",
  "author": "luciiih",
  "created": 1634968530,
  "updated": 1635183518,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hhpqqj5": {
      "link": "/r/ApplyingToCollege/comments/qdyz33/what_if_you_regret_your_ed_choice/hhpqqj5/",
      "text": "[deleted]",
      "author": null,
      "created": 1634969235,
      "upvotes": -5,
      "replies": {
        "hhqc4l1": {
          "link": "/r/ApplyingToCollege/comments/qdyz33/what_if_you_regret_your_ed_choice/hhqc4l1/",
          "text": ">but most schools excuse ED if you cannot pay the tuition,\n\nNot exactly true.\n\nSchools let you out of ED commitment if their financial aid offer doesn’t cover what THE SCHOOL HAS DETERMINED your financial aid to be.\n\nIt’s not enough for the admitted student to say “sorry, that’s too much.”  If the financial aid offer is similar to what the school’s Net Price Calculator says it will be (and it *will* be) then they will not release you from the agreement.",
          "author": "Strict-Special3607",
          "created": 1634987956,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hhqskr4": {
      "link": "/r/ApplyingToCollege/comments/qdyz33/what_if_you_regret_your_ed_choice/hhqskr4/",
      "text": "The ED of any school is not binding. It’s not stated,but most allow you to decline for any financial concern. Very few instances the school does not. However there is  a possibility kids from your school will have a harder acceptance with colleges steering clear of it since guidance councilor agrees to support your ED now your backing out",
      "author": "7katzonthefarm",
      "created": 1634998689,
      "upvotes": 0,
      "replies": {}
    }
  }
}