{
  "sid": "qz7rv6",
  "link": "/r/ApplyingToCollege/comments/qz7rv6/wish_i_had_taken_more_advanced_classes/",
  "title:": "Wish I had taken more advanced classes",
  "text": "I just got deferred from my early action school and I’m looking through all of my application to see where I could have improved. I think not taking enough APs was my downfall. I’ve taken 3 APs up to my junior year and I’m taking one this year. But I’m also going to take 7 dual enrollment courses total my senior year. But I just wished I had taken more AP classes my previous years because I know I could’ve handled them and my school offered more.",
  "author": "mr_kinkiwi",
  "created": 1637538548,
  "updated": 1637687791,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hlkxgjd": {
      "link": "/r/ApplyingToCollege/comments/qz7rv6/wish_i_had_taken_more_advanced_classes/hlkxgjd/",
      "text": "Sorry you got deferred but you still have a shot! Sounds like you have a really solid transcript to me!",
      "author": "Early_Fan6157",
      "created": 1637542407,
      "upvotes": 7,
      "replies": {}
    },
    "hlntv2w": {
      "link": "/r/ApplyingToCollege/comments/qz7rv6/wish_i_had_taken_more_advanced_classes/hlntv2w/",
      "text": "I have the same dilemma. I only took 4 combined in 10th and 11th. My counselors encouraged us to NOT have rigor, they really suck at our school. I wish i had a mentor or someone who told me that rigor was important. There is so much misinformation, like i had a friends parent literally tell me not to take more APs bc the GPA was capped for most UCs. So dumb. It’s hard not to look back and regret a lot especially knowing i could have handled it, but it’s done now. I’d say look forward, and know that you will nonetheless get into college, that’s what I’ve been thinking.",
      "author": "uncle_noel",
      "created": 1637602405,
      "upvotes": 1,
      "replies": {}
    }
  }
}