{
  "sid": "r45dwa",
  "link": "/r/ApplyingToCollege/comments/r45dwa/what_is_considered_exceptional_academic/",
  "title:": "What is considered \"Exceptional academic achievements\"?",
  "text": " I'm in my senior year in a developing country, applying for colleges and scholarships. Most merit based scholarships are requiring the students to have exceptional academic achievements. My GPA is 3.81 unweighted. I had solid 3.9 - 4.0 gpa in my freshman and sophomore year but completely bombed it in my junior year with online schooling. Also i was one of the few dumb kids to not cheat in online exams.\n\nBut I have some community and volunteer works. Student council member, school newspaper member, taught at an orphanage, at a small village in the countryside and some fellow students year above me and few more works, as well as active in many national and private Olympiads and competitions like MUN's (but everything locked down before i could achieve much)\n\nWill I be eligible for most merit based scholarships?\n\nI come from an average income household, but after all my elder siblings moved away and my father got promoted with some good invested stocks, its now considered above average   \nand I'm much more privileged & luckier than my elder siblings tbh",
  "author": "new7DoA",
  "created": 1638109406,
  "updated": 1638204725,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hmeixj9": {
      "link": "/r/ApplyingToCollege/comments/r45dwa/what_is_considered_exceptional_academic/hmeixj9/",
      "text": "There are two types of merit scholarships:  automatic and competitive.  Automatic ones are typically based on grades or test scores.  So you know going in whether you qualify or not.  Competitive ones are based on \"holistic review\", which is a combination of your grades, scores, and all the other stuff you mentioned.  For those, there is often no eligibility requirement in order to apply.  You may be \"eligible\" but still not be a strong candidate.  It's not always possible to estimate how strong a candidate you are.\n\nThe bigger question for you, as an international, is whether a given merit scholarship is even open to you (or if it is limited to domestic applicants only).  Many are domestic-only.",
      "author": "jayphoward",
      "created": 1638109730,
      "upvotes": 6,
      "replies": {}
    },
    "hmeo60b": {
      "link": "/r/ApplyingToCollege/comments/r45dwa/what_is_considered_exceptional_academic/hmeo60b/",
      "text": ">bombed it in my junior year with online schooling. Also i was one of the few dumb kids to not cheat in online exams.\n\nOnline rekt gang",
      "author": "Striking_Stand_157",
      "created": 1638112358,
      "upvotes": 2,
      "replies": {}
    },
    "hmf6lgi": {
      "link": "/r/ApplyingToCollege/comments/r45dwa/what_is_considered_exceptional_academic/hmf6lgi/",
      "text": "I do not think you can cheat online if the webcam is on and the teacher is watching? Maybe you are making excuse? LOL",
      "author": "Wooden-Row7524",
      "created": 1638120371,
      "upvotes": -1,
      "replies": {
        "hmfrv56": {
          "link": "/r/ApplyingToCollege/comments/r45dwa/what_is_considered_exceptional_academic/hmfrv56/",
          "text": "Someone has to downvote this postbecause they couldn't handle the truth LOL  And what will be your explanation if the other kids did well in their online class? Did they cheat too? LOL",
          "author": "Wooden-Row7524",
          "created": 1638128843,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}