{
  "sid": "q8ilma",
  "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/",
  "title:": "Legacy to Stanford",
  "text": "I am a legacy to Stanford and I kinda feel bad.\n\nI’m from the bay area in one of the top public high schools. In the past, Stanford has basically accepted all legacies from my school who had pretty good to very good stats, good ECs but nothing crazy, possibly good awards but nothing crazy.\n\nThey are usually close to the top of students, like maybe top 15-20%. \n\nIts not to say that they’re bad, but the probably would not have gotten in without legacy.\n\nOther people who have even better stats ecs and awards usually get rejected.\n\nNow im sad that if I get in, i’ll probably get called out for only getting in because of legacy.\n\nI have very good stats, strong ecs and decent awards but we all know a school like Stanford expects more than that. What should I respond? Because theyre probably right",
  "author": "emmas441",
  "created": 1634280121,
  "updated": 1636163772,
  "over_18": false,
  "upvotes": 39,
  "upvote_ratio": 0.86,
  "comments": {
    "hgpor1h": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgpor1h/",
      "text": "> Now im sad that if I get in, i’ll probably get called out for only getting in because of legacy.\n\nWho the F*CK cares? You get in, you enjoy. However, it's nice you empathise, plenty don't.",
      "author": "mrhoneypuff",
      "created": 1634282926,
      "upvotes": 93,
      "replies": {}
    },
    "hgpsylw": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgpsylw/",
      "text": "You won't feel bad about salty high schoolers calling you out when you've made your new friends at Stanford.\n\nSome are born with inherent advantages. Use them, and don't beat yourself up over it. \n\nWhat those people will say will have no bearing on your future. People will berate and bully you with alterior motives such as trying to get off the school's waitlist or raising their chances by you not applying. Don't let them trick you. If you get in, enjoy your time at Stanford, and use all of your resources to their fullest potential.",
      "author": "Berkeley_Simp",
      "created": 1634286675,
      "upvotes": 37,
      "replies": {}
    },
    "hgpyi9k": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgpyi9k/",
      "text": "Be careful what you wish for.",
      "author": "CollegeWithMattie",
      "created": 1634291685,
      "upvotes": 36,
      "replies": {}
    },
    "hgptkzq": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgptkzq/",
      "text": "> What should I respond?\n\nNothing. If they ask stupid questions, stop talking to them. Make better friends at the amazing place you'd be going to.",
      "author": "Concerned-gay-guy",
      "created": 1634287240,
      "upvotes": 16,
      "replies": {}
    },
    "hgpur1s": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgpur1s/",
      "text": "Everyone is offered different oppurtunities in life. If you're offered a spot at stanford, this is an oppurtunity for you. Take it and get the most out of it.\n\nAll considered you actually like stanford and its people",
      "author": "EIStiletto",
      "created": 1634288322,
      "upvotes": 15,
      "replies": {}
    },
    "hgq6yvb": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgq6yvb/",
      "text": "Well they are right lol, you do have an unfair advantage. Just suck it up and own up to it, tell them “yea its true legacy helped me get in”. Don’t feel bad abt it tho, you can’t control if you have legacy or not, so just assert that. And it’s not your fault that colleges are so biased towards legacy students. Don’t hate the player, hate the game.\n\nAlso, you haven’t even gotten into Stanford yet so why are you feeling bad.",
      "author": "corona_time_baby",
      "created": 1634298111,
      "upvotes": 14,
      "replies": {}
    },
    "hgrin6l": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgrin6l/",
      "text": "Go to a different college. Easy solution.",
      "author": "Lupus76",
      "created": 1634319728,
      "upvotes": 2,
      "replies": {}
    },
    "hgptgw2": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgptgw2/",
      "text": ">Now im sad that if I get in, i’ll probably get called out for only getting in because of legacy.\n\nAre you actually being serious here...?? It's so disheartening to see where your priorities lie. You wanna go to college for yourself or to please a bunch of jealous nobodies??",
      "author": "Concerned-gay-guy",
      "created": 1634287135,
      "upvotes": 6,
      "replies": {}
    },
    "hgr3hzg": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgr3hzg/",
      "text": "girl utilize the hell out of that legacy. \nik i’m using mine (from a t20).",
      "author": "InquisitiveInFashion",
      "created": 1634313526,
      "upvotes": 0,
      "replies": {}
    },
    "hgqtbep": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgqtbep/",
      "text": "Even if your legacy status gets you in, what you do with it is *entirely* up to you. Focus on that, count your blessings that you’re legacy, and that your folks can afford it. Ignore the noise.",
      "author": "GetafixCacophonix",
      "created": 1634309306,
      "upvotes": 1,
      "replies": {}
    },
    "hgqxezf": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgqxezf/",
      "text": "Don’t worry about what they say",
      "author": "the_journeyman3",
      "created": 1634311035,
      "upvotes": 1,
      "replies": {}
    },
    "hgqxgkz": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgqxgkz/",
      "text": "Using the advantages given to you is not a bad thing. You will be a Stanford graduate after all.",
      "author": "Valthr4x_",
      "created": 1634311055,
      "upvotes": 1,
      "replies": {}
    },
    "hgr5wz0": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgr5wz0/",
      "text": "Who the F cares. The only thing that matters is what you do with the opportunity you are given. If you get in, make the most of that education. Or don’t! Your life is what you make with the opportunities you are given. \n\nThe sooner you can stop caring about what other people think and if they are judging you or not, the happier and more at peace you’ll be.",
      "author": "SpacerCat",
      "created": 1634314518,
      "upvotes": 1,
      "replies": {}
    },
    "hgra0rp": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgra0rp/",
      "text": "Here is the thing, each and every person in this sub is advantaged/privileged in some ways. Some have functional families (that many don't), some have $$$ (many can't go to school without scholarships), some have connections to get them into internships/research positions (many work their ass off but still are unable to get internships/research positions).\n\nIn the end, being more or less privileged than someone else is part of life.",
      "author": "makarov_skolsvi",
      "created": 1634316208,
      "upvotes": 1,
      "replies": {}
    },
    "hgrn5kg": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgrn5kg/",
      "text": "You have literally been in this atmosphere for 4 years...come, see and deal.",
      "author": "Radiant-Chipmunk-987",
      "created": 1634321569,
      "upvotes": 1,
      "replies": {}
    },
    "hgrqa6s": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgrqa6s/",
      "text": "i mean as long as you admit that you didn’t get in solely on merit i see no issue with this? like legacy admissions suck and should be abolished, but it’s not your fault.",
      "author": "ibapconflicted",
      "created": 1634322867,
      "upvotes": 1,
      "replies": {}
    },
    "hgrqj4w": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgrqj4w/",
      "text": "If i’m being honest with you you probably will get rejected. Stop worrying about what others say and focus on getting in first. This post screams “validate me” for no reason .\n\nYou already know you are a strong candidate. The acceptance rate for legacy students is only 15 percent compared to 5 for regular students. You still have low chances. So focus on getting in first then you can worry about your feelings (but i’m pretty sure you’ll be too happy to care anyway)",
      "author": "IwantUCDtotellme1",
      "created": 1634322964,
      "upvotes": 1,
      "replies": {
        "hgskjf8": {
          "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgskjf8/",
          "text": "well op says that from her school basically any legacy with acceptable stats to the eyes of stanford (probably most of the applicants) and ok ecs will get in",
          "author": "blueballer20",
          "created": 1634336134,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgs4nl1": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgs4nl1/",
      "text": "Sure, legacy admissions are unfair. But meritocracy is a myth anyway, universities create the class they want and desire for their own ideological and financial purposes. As someone very much not a legacy (foster kid, both parents didn't finish high school) I find it difficult to get that upset about it when the entire process isn't fair especially at particular individuals who play no role in the process.\n\nI'd recommend just getting over being called out, admit the system is often arbitrary and unfair, and instead try to push in your own small way to make the world a better and fairer place. It's not like if you turn down your Stanford spot it matters, it'll probably just end up going to some other legacy private school kid instead. You aren't robbing a spot from someone like me lol",
      "author": "schizoanalyste",
      "created": 1634328909,
      "upvotes": 1,
      "replies": {}
    },
    "hgs99fk": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgs99fk/",
      "text": "I noticed a similar trend, Bay Area but catholic school. Not a legacy myself tho.",
      "author": "MLGSwaglord1738",
      "created": 1634330914,
      "upvotes": 1,
      "replies": {}
    },
    "hgszaxj": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgszaxj/",
      "text": "I'm kind of in the same boat because I have legacy to Harvard. To be honest I don't even REALLY want to go to Harvard, so I'm thinking about not applying even though that seems like it would be \"wasting\" my legacy advantage. But at the same time I feel like if I got in I would have constant imposter syndrome knowing it was because of legacy considering that overall I'm not qualified for Harvard.",
      "author": "mirafoxes",
      "created": 1634343516,
      "upvotes": 3,
      "replies": {}
    },
    "hgtmn4e": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgtmn4e/",
      "text": "its the usaco plat white female right.... please tell me you didn't make camp",
      "author": null,
      "created": 1634356354,
      "upvotes": 1,
      "replies": {
        "hgtsveg": {
          "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hgtsveg/",
          "text": "of course not",
          "author": "emmas441",
          "created": 1634360356,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhnasvp": {
      "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hhnasvp/",
      "text": "Was this also true last year? Was not the case amongst the high schools I’m familiar with. The legacy advantage is dwindling at many top colleges.",
      "author": "Beneficial_Freedom_6",
      "created": 1634924923,
      "upvotes": 1,
      "replies": {
        "hi1rub8": {
          "link": "/r/ApplyingToCollege/comments/q8ilma/legacy_to_stanford/hi1rub8/",
          "text": "yes especially true last year. the people who got in were obviously impressive, but so is the rest of the stanford applicant pool. without legacy they would not stick out",
          "author": "emmas441",
          "created": 1635204568,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}