{
  "sid": "qtvnp7",
  "link": "/r/ApplyingToCollege/comments/qtvnp7/asu_question/",
  "title:": "ASU question",
  "text": "How is Arizona State University (ASU) have such a high acceptance rate but yet ranked so high in engineering?",
  "author": "Shoddy-Yesterday-837",
  "created": 1636913505,
  "updated": 1637180251,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkm6r7m": {
      "link": "/r/ApplyingToCollege/comments/qtvnp7/asu_question/hkm6r7m/",
      "text": "We have a very very high research output. We're 1 of 7 US universities to send instruments into space and 3rd most funded school from NASA. I'm actually working on a satellite that's due to launch in 2023!\n\nI think the high acceptance rate with the low graduation rate really holds the engineering program back in terms of ranking and perception. But the quality is definitely there",
      "author": "SanderzFor3",
      "created": 1636914038,
      "upvotes": 3,
      "replies": {}
    },
    "hkm9zj6": {
      "link": "/r/ApplyingToCollege/comments/qtvnp7/asu_question/hkm9zj6/",
      "text": "They’re an absolutely massive school so they don’t have to be selective. Acceptance rate is merely a function of class size to applicant pool; it doesn’t have to mean anything more than that. ASU has a mission of educating the public, and they choose to do so in large numbers.",
      "author": "HireLaneKiffin",
      "created": 1636915226,
      "upvotes": 3,
      "replies": {}
    },
    "hkm5xbo": {
      "link": "/r/ApplyingToCollege/comments/qtvnp7/asu_question/hkm5xbo/",
      "text": "I actually dont know. They have really good engineering programs",
      "author": "zCercii",
      "created": 1636913725,
      "upvotes": 1,
      "replies": {}
    },
    "hknae8v": {
      "link": "/r/ApplyingToCollege/comments/qtvnp7/asu_question/hknae8v/",
      "text": "It’s an area in which they have invested and made a priority.  You similarly see “elite” universities low in the engineering rankings because they don’t prioritize their engineering programs (T10-overall Chicago isn’t ranked at all).   \n\n\nUC-Boulder is similar - 85% admitted but a slightly higher USN ranking. Or Purdue - 67% admitted but T10 engineering (though engineering admission rate is much lower than overall.)",
      "author": "RichInPitt",
      "created": 1636929217,
      "upvotes": 1,
      "replies": {}
    }
  }
}