{
  "sid": "qxf6hj",
  "link": "/r/ApplyingToCollege/comments/qxf6hj/is_it_worth_taking_december_sat_help_is_it_too/",
  "title:": "Is it worth taking December SAT help? Is it too late?",
  "text": "Hello,\n\nI’m wondering if it is worth taking december SAT. I know a lot of schools are test optional or test blind but I will explain my situation.\n\nI took the SAT once before without studying at all and got 1290, so I believe I could do a lot better if I actually tried and studied. But is it too late?\n\nI heard some schools have a policy where the earlier you apply, the higher likelihood of scholarships/financial aid being awarded. And also some of my schools have RD deadlines prior to the score release of the next SAT, so I would like to hear your opinion on whether it’s worth studying this time and retaking?",
  "author": "GalacticTomatoes",
  "created": 1637324885,
  "updated": 1637352951,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hl8yujf": {
      "link": "/r/ApplyingToCollege/comments/qxf6hj/is_it_worth_taking_december_sat_help_is_it_too/hl8yujf/",
      "text": "Sure, a good score can always help you, even at test optional schools... Most of the December scores should be out by the 17th, so that is well in time for most RD deadlines.",
      "author": "prsehgal",
      "created": 1637326197,
      "upvotes": 2,
      "replies": {
        "hl9qaf3": {
          "link": "/r/ApplyingToCollege/comments/qxf6hj/is_it_worth_taking_december_sat_help_is_it_too/hl9qaf3/",
          "text": "For me to submit a test score, what score percentile should I be at (out of students who attend the school)? Should I only submit if better than 50% of students or is there any rule with this?\n\nThank you for the help by the way it is greatly appreciated",
          "author": "GalacticTomatoes",
          "created": 1637338730,
          "upvotes": 1,
          "replies": {
            "hl9r8il": {
              "link": "/r/ApplyingToCollege/comments/qxf6hj/is_it_worth_taking_december_sat_help_is_it_too/hl9r8il/",
              "text": "Some people recommend submitting above the 25th percentile, but I suggest only submitting when you're above the 50th percentile.",
              "author": "prsehgal",
              "created": 1637339108,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}