{
  "sid": "qaauk4",
  "link": "/r/ApplyingToCollege/comments/qaauk4/i_can_finally_breathe/",
  "title:": "I can finally breathe!",
  "text": "So I’ve not been having too good of a time because I’ve been stressed about my college apps and the fact that the early deadline is right around the corner… \n\nThe biggest factor of my stress has been the fact that my teachers haven’t filled in my recommendations yet. I had asked them for the letters in September which they said they had written by the end of September… I invited them on commonapp on 1st October and I sent them a couple of reminders but that yielded nothing. UNTIL TODAY!! I woke up and saw that 3 of my teachers have done it! Still have 3 to go but I feel so much lighter…\n\nLooking back I feel that I didn’t need all that stress because 17 days is not a lot, but honestly applications cause so much anxiety and these LORs were something I had asked for 2-3 months in advance, and it was something I couldn’t really control… I think I annoyed my teachers to the point where they just uploaded it to get me off their backs; still I think they’ll have good recommendations for me. Here’s hoping!\n\nDamn, these apps are super draining",
  "author": "helpmegetintocolleg",
  "created": 1634515092,
  "updated": 1634653616,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hh2ilie": {
      "link": "/r/ApplyingToCollege/comments/qaauk4/i_can_finally_breathe/hh2ilie/",
      "text": "Why do you have 6 teachers writing recommendations? You should have at most 2",
      "author": "moonriver252",
      "created": 1634529061,
      "upvotes": 1,
      "replies": {
        "hh2jooe": {
          "link": "/r/ApplyingToCollege/comments/qaauk4/i_can_finally_breathe/hh2jooe/",
          "text": "When I mean teachers, I’m including the other recommenders as well! One of my schools has 3 teacher evaluations, 2 other ones and 1 counsellor report, so that makes up 6… none of them had uploaded it",
          "author": "helpmegetintocolleg",
          "created": 1634529659,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}