{
  "sid": "q7r7un",
  "link": "/r/ApplyingToCollege/comments/q7r7un/financial_aid_admissions_questions_for_mit/",
  "title:": "Financial Aid & Admissions Questions for MIT? | Clueless Junior, wondering if it's realistic to consider",
  "text": "**Disclaimer**: HS Junior; therefore, very uninformed and prolly asking really dumb questions  -- hold ur downvotes :(  -- | throwaway obv | sry for the long read, important stuff highlighted\n\nJust interested as I was told by my counselors I look at MIT as a serious option, also fits my goals (CS Major, Software Engineering Career)\n\n***Financial Aid***\n\nGood chance I'm wrong, but my understanding is MIT doesn't do merit based scholarships for undergrads, but they do give grants based off your family's income and overall how much of the COA you can pay? My family is like dirt broke, literal poverty: **divorced parent makes \\~20k yearly**.\n\nAssuming, by a *very* big long-shot, I somehow get accepted, **would I be eligible for a 'full-ride' / like a grant that covers the entire COA**? If not, is there a **general** like **ballpark** on **how much I would expect paying out of pocket**?\n\nObviously ik this depends on very specific information and my FASPA and whatnot which I can't provide seeing I'm a junior so idk myself, but **literally just any estimate / information** of what to expect would be nice\n\n&#x200B;\n\n***Admissions***\n\nObviously I know this is also very dependent on specific information and individual cases as well, but I was always dead-set on the University of Florida since it's arguably the best in FL, and based on my overall case, there's essentially no chance of me being denied.\n\nWas selected as a possible candidate for the National Merit Scholarship which would grant a full ride to UF, and this PSAT was fucking brutal. Either way not likely, and after being told I should look into more prestigious institutions, just now started looking into MIT, essentially my dream school\n\n*Essentially, I have no idea what such a university is looking for / if it's achievable in my case. Was hoping for any advice on what to expect / whether my admittance is even realistic.*\n\n**Basic \"student profile\"** (?) to **get an idea of my standing** (again, dumbass hs junior so idek if this is helpful, but **literally any info would help):**\n\n* SAT: 1470 (Conservatively Expected: \\~1520-1540) | I've literally only taken one SAT just for the fun of it (free waiver). Taken practice tests since and averaging 1500, can easily boost to 1530 minimum by Senior year application deadlines\n* GPA: 3.97 Unweighted Cumul. | 4.62 Core | 4.96 Weighted Cumul.\n* Top 5% Class (17/302, very competitive HS)\n* APs: 7 Total As Of Junior Year | Expected 12 Total in Senior\n   * Taking 4 Currently, 3 Completed | Ngl never cared about passing them, just wanted GPA boost, prolly gonna bother studying for all 4-5s this year:\n      * AP HG: 1 | Entire 2020 test was literally 1 fucking frq idrk\n      * AP Bio: 4\n      * AP World: 5\n* Extra Curriculars / Other shit idk:\n   * Officer of Film & Tech Clubs (Photography), won competitions at state level\n   * \\~140 Service Hours of community work including stuff like environmental cleanups & non-profit work\n   * Employed Part-Time & Large Retailer | Nothing major, \\~10h weekly\n   * Guaranteed National Merit Scholarship Commended | Maybe SF but prolly not :(\n   * Duke TIP Recognition (State Level)\n\nThat's it, again, obv not my college app, just some info to see where I stand, want to know if I should seriously try for MIT (only planned on making coalition app, 99% sure MIT only accepts their own app, so would need seriously consider beforehand)",
  "author": "Ballist1cGamer",
  "created": 1634181368,
  "updated": 1634251694,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgkigum": {
      "link": "/r/ApplyingToCollege/comments/q7r7un/financial_aid_admissions_questions_for_mit/hgkigum/",
      "text": "Run the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. Sometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask.  (Many privates require info on income and assets from the noncustodial parent as well.) Students with more complex situations should consider calling the financial aid office with questions.\n\nRe admission, you can see the low acceptance rates. You will need to make a list of reaches, matches, and safeties. General advice for top schools: http://mitadmissions.org/blogs/entry/applying\\_sideways",
      "author": "elkrange",
      "created": 1634181794,
      "upvotes": 2,
      "replies": {
        "hgkjp93": {
          "link": "/r/ApplyingToCollege/comments/q7r7un/financial_aid_admissions_questions_for_mit/hgkjp93/",
          "text": "Ah okay ty! I'll check it out, if I remember last time I used one similar, my situation was definitely a bit more complicated according to the questions asked \n\nI'll probably try emailing the admissions office, but also don't wanna sound like a dumbass and ask for an estimate but like, provide no info",
          "author": "Ballist1cGamer",
          "created": 1634182457,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgkn7l8": {
      "link": "/r/ApplyingToCollege/comments/q7r7un/financial_aid_admissions_questions_for_mit/hgkn7l8/",
      "text": "> My family is like dirt broke, literal poverty: divorced parent makes ~20k yearly.\n\n99.9999% chance you won't need to pay a single cent",
      "author": "MundyyyT",
      "created": 1634184454,
      "upvotes": 1,
      "replies": {
        "hgkndrc": {
          "link": "/r/ApplyingToCollege/comments/q7r7un/financial_aid_admissions_questions_for_mit/hgkndrc/",
          "text": "Ah ty, read similar outcomes for those <60k incomes, but a full COA grant just seemed kinda wild",
          "author": "Ballist1cGamer",
          "created": 1634184558,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}