{
  "sid": "q73oox",
  "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/",
  "title:": "Rice or WashU for premed?",
  "text": "Currently deciding between Rice and WashU for premed with plans of majoring in psych. Which one offers more opportunities for undergrad and has the better premed program? I really value Rice's collaborative environment, but I also appreciate the quality of student life at WashU.\n\nAlso, I have a pretty mediocre background in the sciences. My school doesn't have any labs, and I taught myself chemistry when classes shifted to online. Which school would provide more resources to succeed in classes? Thank you in advance!\n\nEdit: I'm applying through the QuestBridge National College Match! Just trying to figure out my rankings as they're due on the 14th :'))",
  "author": "dinorawrrr04",
  "created": 1634099978,
  "updated": 1634167075,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hghcppx": {
      "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hghcppx/",
      "text": "They are both amazing.  And actually to me they even look a lot alike! Chumer was right about diversity tho. I like the area around Rice a lot more. Beautiful neighborhood, right across the street from the largest med center in the world,  lots of museums, and a large city park. You’re also walking distance to a great shopping and restaurant area. I also prefer rices weather — but I hate cold rainy weather for days on end, so that’s just me. Rice is really fricking hot in September and then the rest of the school year is practically spring except for the occasional ice storm that lasts for a couple days and then you’re back to spring. \n\nI know tons of happy kids and alums for both schools. You really can’t go wrong in terms of academics and opportunities. They both offer excellence in those areas.  I think it’s gonna have to come down to weather, location, etc. \n\nAlso consider distance and cost of travel from home.",
      "author": "admissionsmom",
      "created": 1634132449,
      "upvotes": 4,
      "replies": {}
    },
    "hgg45n7": {
      "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hgg45n7/",
      "text": "Both are great schools. The better one is the one that you get into.",
      "author": "Octocorallia",
      "created": 1634100134,
      "upvotes": 3,
      "replies": {
        "hgg497c": {
          "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hgg497c/",
          "text": "Ahh, I'm applying through questbridge, so I'm figuring out which to rank higher than the other. Sorry! I'll go edit my post right now.",
          "author": "dinorawrrr04",
          "created": 1634100192,
          "upvotes": 1,
          "replies": {
            "hgg4q45": {
              "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hgg4q45/",
              "text": "Honestly flip a coin. Both are great. Which city do you like better? If someone said you could go to either one but you had 30 seconds to decide, what does your gut say?",
              "author": "Octocorallia",
              "created": 1634100462,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgg9eg1": {
      "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hgg9eg1/",
      "text": "There’s virtually no difference in terms of quality of the pre-med program and they’re quite similar more generally as well.\n\nDo you have any more arbitrary wants/needs that could be fulfilled by either school?  Perhaps you want a larger student body?  Specific weather?  Dining?  More/fewer distribution requirements?",
      "author": "chumer_ranion",
      "created": 1634103521,
      "upvotes": 2,
      "replies": {
        "hgg9v1y": {
          "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hgg9v1y/",
          "text": "Hmm, I thrive in collaborative environments, so I definitely want a community that isn't cutthroat or competitive. I've heard great things from Rice, but not much from WashU, so if you have that info, please let me know! I also enjoy meeting new people, so a diverse campus would fit me better.",
          "author": "dinorawrrr04",
          "created": 1634103851,
          "upvotes": 1,
          "replies": {
            "hggag3n": {
              "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hggag3n/",
              "text": "What you’ve heard about Rice is true—the students live to collaborate.  The stories about WashU, from what I’ve gathered, may be a bit overblown.  We have a number of students here on the sub that have found their community to be much more collaborative than rumors would indicate. \n\nFor all things diversity though—Rice is a better bet.  WashU is making strides towards improving the wealth inequality within its student body (and its decision to go need-blind just this year will help a lot) but Rice is still ahead ethnically and socioeconomically.",
              "author": "chumer_ranion",
              "created": 1634104275,
              "upvotes": 5,
              "replies": {
                "hggko7d": {
                  "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hggko7d/",
                  "text": "Honestly the students here are friendly enough to the point where it really doesn't matter if they were somehow even more personable.\n\nIt's like any other competitive environment where people generally aren't outright malicious but the undercurrent of stress is flowing just beneath the surface and everyone has very high standards they hold themselves to.\n\nIf you're pre-med then honestly you'll run into oddballs eventually wherever you go, learn to thrive in a highly competitive environment now because that's all of medical school and residency for ya haha",
                  "author": "MundyyyT",
                  "created": 1634112887,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hghbc8k": {
      "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hghbc8k/",
      "text": "One of them has a T10 med school associated with it so",
      "author": "ssssseabass",
      "created": 1634131787,
      "upvotes": 2,
      "replies": {}
    },
    "hgg8t2q": {
      "link": "/r/ApplyingToCollege/comments/q73oox/rice_or_washu_for_premed/hgg8t2q/",
      "text": "Rice has a funny name so go with them. Tell people you went to rice and they'll be like, \"the food\" and you can say \"no, the university\". Just some *food* for thought.",
      "author": "straitdick",
      "created": 1634103104,
      "upvotes": 3,
      "replies": {}
    }
  }
}