{
  "sid": "qzrqom",
  "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/",
  "title:": "Thing about prestige",
  "text": "The irony of prestige is that the majority of people that care about prestige, specifically relative family members, didn’t go to T20s.\n\nEven if you and your employer go to Harvard. Your employer won’t fucking wet his pants bc you also went to Harvard.\n\nMost employers that employ Harvard grads probably went to idk like Northeastern Idaho State and got big. So I feel like with prestige it depends on how you wanna look at it.\n\nIf you wanna go into finance/law then it plays a part. Everything else…not really",
  "author": "anonymous062904",
  "created": 1637604750,
  "updated": 1637687228,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.74,
  "comments": {
    "hloiwd5": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hloiwd5/",
      "text": "Prestige matters in a world where you’re getting holistically judged constantly by employers, colleagues, customers, patients, whoever.\n\nYes, going to Harvard doesn’t prove you’re great at all but people are generally going to be impressed when they find out you went there. A prospective partner will probably be slightly more likely to swipe right if you’re from Cal Tech than community college. It’s life.",
      "author": "ApplyingToCollege21",
      "created": 1637612379,
      "upvotes": 23,
      "replies": {
        "hlr3d67": {
          "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlr3d67/",
          "text": ">Yes, going to Harvard doesn’t prove you’re great at all\n\nIf you're a legacy applicant then that's true. Though even they will be pretty decent, just not great.\n\n>but people are generally going to be impressed when they find out you went there.\n\nBecause Harvard is pretty elite. That's due to their insane selection. Rank 2 in THE ranking in the world.",
          "author": "Great-Gap1030",
          "created": 1637662261,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlo1cve": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlo1cve/",
      "text": "this is the 5th “prestige doesnt matter” post ive seen this week",
      "author": "Few_Rooster_4497",
      "created": 1637605344,
      "upvotes": 50,
      "replies": {}
    },
    "hlonorh": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlonorh/",
      "text": "Ironic that I went to Yale and their father went to Columbia and NEITHER of us give a shit where our kids go as long as they're happy. Older is at Bard and *very* happy, younger shooting for Columbia but absolutely not at my urging.",
      "author": "angelhippie",
      "created": 1637614316,
      "upvotes": 10,
      "replies": {}
    },
    "hloadxi": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hloadxi/",
      "text": "This post is way too generalized and frankly wrong in multiple aspects. \n\nAlso you don’t need to make a million “prestige don’t matter posts” every week. \n\nThe reality is prestige *does* matter, just not to the extent some people make it out to be. Objectively speaking prestigious (t30) colleges have higher roi in all fields and typically have better grad school placement. That’s not to say you *have* to go to a prestigious undergrad college to succeed in life, but stop lying to yourself and saying prestige is superficial. It isn’t and saying stuff like this is just an obnoxious coping mechanism on this sub.",
      "author": "IwantUCDtotellme1",
      "created": 1637608949,
      "upvotes": 39,
      "replies": {
        "hlqrl9l": {
          "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlqrl9l/",
          "text": "You're not wrong but there's some causation/correlation shenanigans going on here. T30 colleges also have edges in financial aid and retention rates, and generally attract / can select for students who are set up to succeed. It would be weird if they *didn't* have edges in ROI and grad school placement, but that doesn't mean prestige is driving that (can't hurt, sure). \n\nPrestige is just one factor among many, and while it's true that prestigious *schools* tend to offer a series of advantages, that doesn't mean prestige itself should be what drives decisions on where to go.",
          "author": "thezander8",
          "created": 1637652159,
          "upvotes": 2,
          "replies": {}
        },
        "hlob791": {
          "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlob791/",
          "text": "Spoken like a true Cornelian",
          "author": "ssssseabass",
          "created": 1637609275,
          "upvotes": -27,
          "replies": {
            "hlomv3l": {
              "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlomv3l/",
              "text": "Spoken like a true Washer",
              "author": "Few_Rooster_4497",
              "created": 1637613986,
              "upvotes": 22,
              "replies": {}
            },
            "hlp0jux": {
              "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlp0jux/",
              "text": "Still salty that you didn’t get in, huh?",
              "author": "did_i_inquire",
              "created": 1637619599,
              "upvotes": 13,
              "replies": {
                "hlp1fay": {
                  "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlp1fay/",
                  "text": "Uhh why on earth would I be?\n\nYou don't even go to Cornell",
                  "author": "ssssseabass",
                  "created": 1637619976,
                  "upvotes": -17,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlo1ssv": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlo1ssv/",
      "text": "Well, I’m glad that this has finally been settled.\n\n😜",
      "author": "Strict-Special3607",
      "created": 1637605520,
      "upvotes": 12,
      "replies": {
        "hlo30rr": {
          "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlo30rr/",
          "text": "😝",
          "author": "anonymous062904",
          "created": 1637606001,
          "upvotes": -8,
          "replies": {}
        }
      }
    },
    "hlo1dd5": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlo1dd5/",
      "text": ">The irony of prestige is that the majority of people that care about prestige, specifically relative family members, didn’t go to T20s.\n\nI have a couple friends who went to T20.  Some think it's worth it, some not.  The one who went to Harvard is in the \"not worth it\" camp.  Granted, highly anecdotal.",
      "author": "jayphoward",
      "created": 1637605349,
      "upvotes": 7,
      "replies": {}
    },
    "hlo3spy": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlo3spy/",
      "text": "I also think prestige is important for social mobility. Often if you're already rich/well positioned prestige won't help you a ton. I do know there are studies that prestige does a lot for social mobility of people without those connections already",
      "author": "CH3OH-CH2CH3OH",
      "created": 1637606306,
      "upvotes": 7,
      "replies": {
        "hlo818q": {
          "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlo818q/",
          "text": "> I do know there are studies that prestige does a lot for social mobility of people without those connections already  \n\nFor those who are willing & able to get out and shake some hands and actually develop their people-network in a meaningful way, this can work, and it can be a big deal.  \n\nBut if little Ivan the Introvert can't overcome his Social Anxiety Disorder, then attending the Ivy League school will not help enhance their people-network in a meaningful way.  \n\nAfter graduation, when Ivan reaches out to a fellow graduate for a job, the \"same school\" people-connection does exist, but it is far less powerful than having a real and healthy relationship.",
          "author": "VA_Network_Nerd",
          "created": 1637608005,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "hlo1sni": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlo1sni/",
      "text": "PayScale.com is **NOT** perfect.  \n\nBut it's a very interesting source of data that helps disprove many illusions about prestigious schools earning **dramatically** more than other schools.  \n\n\nhttps://www.payscale.com/college-salary-report/bachelors  \n\nIf going to Harvard is supposed to magically lead to guaranteed income, they should dominate the reports.  \n\nBut the data does not support the commonly shared idea that prestige == income.  \n\nBut, I'll repeat: payscale's data is imperfect since not everyone is open and honest about what they are earning and some people are under a NDA to not disclose the details of their compensation, etc.",
      "author": "VA_Network_Nerd",
      "created": 1637605519,
      "upvotes": 5,
      "replies": {
        "hlo8mto": {
          "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlo8mto/",
          "text": "fuck US news rankings, my school's a T20 for ROI 🥶",
          "author": "cet785",
          "created": 1637608248,
          "upvotes": 1,
          "replies": {
            "hloacub": {
              "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hloacub/",
              "text": "If we assume PayScale only gets responses from students with \"average or typical\" job offers, because all of the exceptional students with the extraordinary offers are locked under a NDA, then we have a more or less level playing field if we are talking about average students.  \n\nAnd a HUGE majority of students are merely average, and that's not a bad thing.  \n\nSo, if the difference, as an average student between attending MIT at Full Price ($300k total spend) and State University ($80k total spend) is that MIT graduates earn $11,000 more per year that's going to take decades to recover the difference in cost to attend MIT.  \n\nNow, if you are a top-tier performer, even by MIT standards and are likely to not only qualify for consideration, but likely to interview your way into a top-tier job opportunity with an offer of 2x, 3x or 5x what PayScale is talking about, then that's a totally different conversation. But that's a pretty damn narrow field of students in that category.",
              "author": "VA_Network_Nerd",
              "created": 1637608937,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hlqqmz0": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlqqmz0/",
      "text": "Copium",
      "author": "crappypoopoo69",
      "created": 1637651427,
      "upvotes": 2,
      "replies": {}
    },
    "hlr481l": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hlr481l/",
      "text": "Prestige matters in consulting as well! Almost in all business jobs apart from marketing imo .",
      "author": "Snoo27499",
      "created": 1637663036,
      "upvotes": 1,
      "replies": {}
    },
    "hls8n90": {
      "link": "/r/ApplyingToCollege/comments/qzrqom/thing_about_prestige/hls8n90/",
      "text": "Totally agree. I read this yesterday and found it to be really interesting:\n\n>\"To assess the effect of the Ivies, it makes more sense to compare the student who got into a top school with the student who got into that same school but chose to go to a less selective one. Three years ago, the economists Alan Krueger and Stacy Dale published just such a study. *And they found that when you compare apples and apples the income bonus from selective schools disappears.*  \n“As a hypothetical example, take the University of Pennsylvania and Penn State, which are two schools a lot of students choose between,” Krueger said. “One is Ivy, one is a state school. Penn is much more highly selective. If you compare the students who go to those two schools, the ones who go to Penn have higher incomes. But let’s look at those who got into both types of schools, some of whom chose Penn and some of whom chose Penn State. Within that set *it doesn’t seem to matter whether you go to the more selective school.* Now, you would think that the more ambitious student is the one who would choose to go to Penn, and the ones choosing to go to Penn State might be a little less confident in their abilities or have a little lower family income, and both of those factors would point to people doing worse later on. But they don’t.”\n\n**Source:** https://web.archive.org/web/20131013143513/http://www.newyorker.com/archive/2005/10/10/051010crat\\_atlarge?printable=true&currentPage=all",
      "author": "Ok_Place2147",
      "created": 1637685113,
      "upvotes": 1,
      "replies": {}
    }
  }
}