{
  "sid": "qg7hqu",
  "link": "/r/ApplyingToCollege/comments/qg7hqu/dutch_exchange_student_here_which_university_do/",
  "title:": "Dutch exchange student here, which university do you advice me to go to? (14 options)",
  "text": "Dear Americans, I am a 19 year old university student (International Business) from the Netherlands, and next year from mid-August until mid-December I have the chance to go on exchange to the USA. I have 14 options, but have a hard time making a choice, since google does not provide very clear answers and based on the fact that I just have so many choices...\n\n👉 Which university/ies would you recommend or really advise against, and why? Please also tell me about experiences you had, I’m interested in your story! (Or leave any tips, maybe regarding my method of researching)\n\nA bit extra info:\n- I do NOT need to pay any tuition, so more expensive uni’s don’t have a bigger impact on my budget (the accommodation/living costs however do)\n\n- 3 things I find important: \n1. Quality of education. Besides that, I have a preference for more practical education/courses (more focussed on developing skills), since I’m now used to courses just based on research (completely unpractical)\n2. Experiencing the ‘real’ American college/university life (sports, parties, general atmosphere etc)\n3. Interesting area. Both the near surroundings as where the place is on a national level, given that I would like to make a few bigger trips during my time in the USA.\n\nUniversities:\n* Babson College \n* Emory (Goizueta Business school)\n* Florida international university\n* Florida State university\n* Georgia state university\n* Ohio state university (Fisher college of business)\n* University of Maryland (Robert H. Smith)\n* University of Michigan (Ross)\n* University of North Carolina (Kenan-Flagler)\n* University of South Carolina (Darla Moore)\n* University of Virginia (McInitre)\n* University of Washington (Foster)\n* Texas Tech university (Rawls)\n* Tulane University (A.B. Freeman)\n\nMy research so far suggests that the following would, purely educationally speaking, be the best: Babson, Emory, Michigan, North Carolina, Washington and Virginia (Don’t know about Virginia since it always states Darden instead of McInitre). \nIs my research on this aspect right so far? Besides, do you recommend state or private schools?\n\nThanks for reading this all, it’s a lot but that hopefully makes it easier to give a recommendation, your help is very much appreciated! :)",
  "author": "Appropriate-Gift-869",
  "created": 1635258154,
  "updated": 1635301743,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi49xaf": {
      "link": "/r/ApplyingToCollege/comments/qg7hqu/dutch_exchange_student_here_which_university_do/hi49xaf/",
      "text": "Based on your three criteria, UMichigan is the clear choice.\n\n1. Academically, Michigan’s Ross school is the highest ranking business school on your list, at #3 right behind Wharton at #1 and MIT at #2. UNC and UVA aren’t far behind, tied at #8, with Emory and Ohio State tied at #14.  Your list falls off quickly after that.\n2. UMichigan is the quintessential “rah, rah, yay team” US university experience. You’ll be there for (American) football season, which is a big deal. Ann Arbor is a great college town. Large, diverse student population, etc, etc.\n3. Where “the place is on a national level” is really immaterial to your decision, since every school on your list is located somewhere that is far from the other 90% of the US.  That said, as long as you’re near a major airport you can get anywhere in a few hours.  Ann Arbor has easy access to Chicago for a “big city” thing, and plentiful direct flights from Detroit to anywhere else in US. And midwest location makes East or West flights relatively/equally easy.\n\nCan’t imagine choosing anything else on your list over Michigan/Ross.",
      "author": "Strict-Special3607",
      "created": 1635258716,
      "upvotes": 9,
      "replies": {
        "hi4qn2w": {
          "link": "/r/ApplyingToCollege/comments/qg7hqu/dutch_exchange_student_here_which_university_do/hi4qn2w/",
          "text": "Totally agree!",
          "author": "Octocorallia",
          "created": 1635265483,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi4b49u": {
      "link": "/r/ApplyingToCollege/comments/qg7hqu/dutch_exchange_student_here_which_university_do/hi4b49u/",
      "text": "UMich !!",
      "author": "anuxietys",
      "created": 1635259211,
      "upvotes": 2,
      "replies": {}
    },
    "hi4etd1": {
      "link": "/r/ApplyingToCollege/comments/qg7hqu/dutch_exchange_student_here_which_university_do/hi4etd1/",
      "text": "UVA has 2 different Business schools. Darden is the main business school that offers graduate programs only (MBA, EMBA), while McInitre is the school of Commerce and offers both undergrad and graduate degrees. In regards to education, McInitre is a top 10 business school for undergrad, and definitely on par with most of the schools you listed.\n\nFrom the ones you listed Babson is an interesting school, is it probably the #1 ranked school for entrepreneurship but the school is mostly business students. It has a small student population and a very different environment compared to other colleges on your list. IDK how good their International Business program is but the school itself is worth a look.\n\nPersonally, my rank on the schools listed would be\n\nUmich > Babson > UVA > Emory > UNC > UW",
      "author": "andersonalltimelo",
      "created": 1635260722,
      "upvotes": 1,
      "replies": {}
    },
    "hi4saqa": {
      "link": "/r/ApplyingToCollege/comments/qg7hqu/dutch_exchange_student_here_which_university_do/hi4saqa/",
      "text": "If you really want sports cross Emory off your list. We don’t even have a football team lmao. Atlanta is also pretty expensive, so you’d need a bigger budget to do fun things. \n\nFIU isn’t the best bet if you want to take trips to other areas in the US. It takes about 8 hours to drive from Miami to the Florida/Georgia border, so unless you want to travel by plane you’ll be stuck in Florida. Also, Miami is super expensive.",
      "author": "screamingviking13",
      "created": 1635266131,
      "upvotes": 1,
      "replies": {}
    },
    "hi4zh4d": {
      "link": "/r/ApplyingToCollege/comments/qg7hqu/dutch_exchange_student_here_which_university_do/hi4zh4d/",
      "text": "Do you care at all about weather? Because while Ann Arbor is a charming college town the water in your eyes can freeze walking across campus in December, and to me without downhill skiing snow just isn’t that fun. Great school though. Autumn leaves are gorgeous. The Real (midwestern) America. While living in Detroit we drove to Chicago, Niagra Falls, Cincinnati, Toronto and once, NYC. Pretty road trips through rural countryside. You can fly anywhere from Detroit fairly cheaply and easily. \n\nUW has winter too but if you have a car there are some just gorgeous mountains to ski and hike in and the ferry rides are just beautiful. Be easy to fill your weekends with different kinds of adventures. Also a big all-American state school, and the campus library looks like Hogwartz. Seattle has become a big beautiful city and pop culture/tech center over the past 30 years. It’s more fun to play in than Detroit but you don’t get the small college town feel of Ann Arbor or that fun protest culture UM has. You could easily drive to Vancouver and Portland and take a quick cheap flight to LA or SF and see California. Flying across the country to somewhere like NYC or Washington DC would take about 8 hours door-to-door with commuting to airports, security etc. But in the fall not many people travel and airline tickets are pretty cheap - you might be able to fly to the east coast for a weekend for under $200 or LA for under $150 round trip. \n\nFor traveling around the east coast by car UVA is fairly central - it’d be a long drive/road trip but you could go to NYC and continue up to Boston (and see some nice fall leaves). You could drive to the N Carolina coast on another road trip, which is so pretty. You could do day trips to Williamsburg (colonial village type theme park), Washington and Jefferson’s mansions/slave run estates, and Washington DC which has a lot of cool free museums and monuments, plus the White House/congress. The nearest major airport from which you could get cheap cross country tickets is probably going to be in DC, which is 2 hours away - the Charlottesville airport is smaller which often means more set up for shorter hops (like NY/Boston/Miami) than international or coast to coast. You could see a lot of American history sites and also some of the national parks (although the mountains in Seattle are much taller and more rugged). City itself is fairly small. \n\nI don’t know as much about the other options - but both Miami and New Orleans are very vibrant, interesting cities to hang out in with major airports to fly out of for trips. The southern schools might feel hot in August, especially compared to, say, Seattle. Which I guess famous for having a rainstorm most days, so if you hate that cross it off your list.",
      "author": "RetiringTigerMom",
      "created": 1635268941,
      "upvotes": 1,
      "replies": {}
    }
  }
}