{
  "sid": "qjzv7q",
  "link": "/r/ApplyingToCollege/comments/qjzv7q/umd_test_reporting_mistake/",
  "title:": "UMD test reporting mistake",
  "text": "Hi everyone, my brother is applying EA to UMD (in-state.) At the last minute, he decided to submit his scores for UMD. He submitted his application saying this and requested to send his scores regularly (not rush) to UMD on Thursday but they still say pending (not sent.) We didn’t realize that UMD required the official test scores to be electronically submitted by the deadline and that self-reporting was not sufficient. Now I’m worried that they won’t arrive on time, but since he submitted his application saying that he wanted them to consider his scores, it will be marked as incomplete and not reviewed. Does anyone know \n\n1. Is there any way to switch to test blind after submitting the application?\n\n2. If his scores arrive late, will they still consider him in this application deadline or will he be pushed to RD? If that’s the case, it would be better to be test blind.\n\nAny other help would be useful. Thanks!",
  "author": "flint_andsteel",
  "created": 1635717875,
  "updated": 1635777442,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hitei7m": {
      "link": "/r/ApplyingToCollege/comments/qjzv7q/umd_test_reporting_mistake/hitei7m/",
      "text": ">Now I’m worried that they won’t arrive on time,\n\nThey most likely will not.\n\n&#x200B;\n\n>If his scores arrive late, will they still consider him in this application deadline\n\nPer the UMD website: *“All materials must be submitted electronically or postmarked by the appropriate deadline for consideration.”*\n\nMaybe you’ll be lucky and they get sent tomorrow.",
      "author": "Strict-Special3607",
      "created": 1635718214,
      "upvotes": 5,
      "replies": {
        "hitf14b": {
          "link": "/r/ApplyingToCollege/comments/qjzv7q/umd_test_reporting_mistake/hitf14b/",
          "text": "Right. That’s why I’m wondering if there’s a way to edit his application to be test optional rather than marked as incomplete in case his scores are not sent.",
          "author": "flint_andsteel",
          "created": 1635718467,
          "upvotes": 2,
          "replies": {}
        },
        "hitfj8x": {
          "link": "/r/ApplyingToCollege/comments/qjzv7q/umd_test_reporting_mistake/hitfj8x/",
          "text": "They also say this, which is confusing: “Application materials received after the intended deadline will be added to your file, however, we cannot guarantee such materials will be considered during the review of your admission application.”",
          "author": "flint_andsteel",
          "created": 1635718710,
          "upvotes": 2,
          "replies": {
            "hith63g": {
              "link": "/r/ApplyingToCollege/comments/qjzv7q/umd_test_reporting_mistake/hith63g/",
              "text": " I read that as , effectively, occurring AFTER your application has been moved to RD pile.",
              "author": "Strict-Special3607",
              "created": 1635719506,
              "upvotes": 1,
              "replies": {
                "hithn5z": {
                  "link": "/r/ApplyingToCollege/comments/qjzv7q/umd_test_reporting_mistake/hithn5z/",
                  "text": "Thanks",
                  "author": "flint_andsteel",
                  "created": 1635719742,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hiuslur": {
      "link": "/r/ApplyingToCollege/comments/qjzv7q/umd_test_reporting_mistake/hiuslur/",
      "text": "maybe try contacting the AOs? i did rush on thurs and it was sent by friday",
      "author": "SnooChipmunks1902",
      "created": 1635745871,
      "upvotes": 1,
      "replies": {}
    }
  }
}