{
  "sid": "qj9p4r",
  "link": "/r/ApplyingToCollege/comments/qj9p4r/wrong_efc_if_someone_knows_please_help/",
  "title:": "Wrong EFC... If someone knows, please help.",
  "text": "So I submitted my FAFSA and it's showing that my EFC is 6200 and that I don't qualify for any aid. For context, my parents together filed tax for 40,000 last year and we don't own any property or retirement savings, and we don't have a house or a lot of money. \n\nAdditionally, I decided to use the college board EFC calculator and they stated my EFC as 1,000. Is something wrong with my FAFSA? Do I give a call to the FAFSA office and try to solve it?\n\nP. S. I also posted this on r/fafsa, but didn't get any reply yet.",
  "author": "CraftNo2253",
  "created": 1635625165,
  "updated": 1635778721,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiopjh3": {
      "link": "/r/ApplyingToCollege/comments/qj9p4r/wrong_efc_if_someone_knows_please_help/hiopjh3/",
      "text": "If your EFC is $6,200, then you qualify for lots of aid.\n\nTo clarify, colleges use the FAFSA form to help calculate need. However, FAFSA EFC, by itself, does not tell students what they can expect to pay. It is not enough info. Many colleges require additional forms such as the CSS Profile or the college's own form, considering both income and assets and often noncustodial income and assets as well, and each college has its own level of available resources and uses its own unique formula in calculating need.\n\nSee whether you are eligible for any need-based financial aid. Run the Net Price Calculator on the financial aid website of **each** college you are interested in, with the help of a parent, to see a need-based estimate before you apply.\n\nSometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions. Federal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. Larger loans require a parent signature and are usually not reasonable amounts to borrow.",
      "author": "elkrange",
      "created": 1635626181,
      "upvotes": 5,
      "replies": {}
    },
    "hiphdsa": {
      "link": "/r/ApplyingToCollege/comments/qj9p4r/wrong_efc_if_someone_knows_please_help/hiphdsa/",
      "text": "Why do you beleive this is the wrong EFC?",
      "author": "RichInPitt",
      "created": 1635639432,
      "upvotes": 1,
      "replies": {
        "hipl8j6": {
          "link": "/r/ApplyingToCollege/comments/qj9p4r/wrong_efc_if_someone_knows_please_help/hipl8j6/",
          "text": "My parents make 40K with barely any savings and assets, and the govt is telling them to spend 6k without any aid on me just getting an undergrad! I know ppl who earn 90k+ and still got Pell grant.",
          "author": "CraftNo2253",
          "created": 1635641353,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}