{
  "sid": "qte0d5",
  "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/",
  "title:": "I'm scared about applications",
  "text": "I have been really stressed about my grades recently. I was always a star student. My teachers always loved me, I always got amazing grades, and I eventually became known as the good student, even to myself. \nBut, ever since grade 11 started, I began to lose my good grades. The pandemic, online school, a new school, and a harder syllabus had its impact on me, and my grades started slipping. And so did my mental health. But I always thought that it'll be ok, I'll just try harder and do better, and I started getting average grades, plus, I still remained the teacher favourite.\nBut its been worse since grade 12 started. I started off strong, but then my grades became so bad. Its normal to drop subjects in grade 12 (I'm doing A Levels) so all the teachers who really loved me were gone, and I was left with passive teachers and terrible grades. And I still thought, it's okay, I can still do better.\n\nBut then university applications came around. I always thought that universities don't care about your high school grades and only care about your A levels and stuff so when I realised I would be giving in terrible grades to a university, I was freaked out. And then, I started getting so scared that I wouldn't even be accepted at all. And it feels so foreign? I never in a million years did I think that I would be worried about getting into university. I know it might sound like I'm bragging, but the self hatred and dissapointment I felt, and am feeling right now is just so overwhelming.\n\nIt makes me feel like I wasted everything, all these months, just to give in a crappy report card. It makes me feel like I've wasted my life. I dont have any fucking hobbies. All my life, I thought that as long as I got good grades, I wouldn't need to be anything else. While others were praised for their art, or sport skills, or whatever, I was always praised for being The good student. And it became me. I didn't try to get to actively pursue other things. When people asked me about my hobbies, I'd just go blank and then laugh and say I go on my phone alot. And that was okay because atleast I was good in school.\nBut now that I don't even have that, I feel so damn lost. Even the subjects that were the closest thing to hobbies, I dropped them, so I dont have anything I even enjoy anymore.Like what have I spent my entire school life, if I don't even have one decent hobby. The only thing is bullet journaling, and that's centred around school too. I have nothing else that identifies me as a person, and I hate and regret myself for so many things. I hate that I wasted my time, I hate that I dropped the subjects I liked even though I ended up hating them due to the stress they caused, because atleast the teachers praised me. \n\nI hate that despite the numerous amount of times I've told myslef that grades don't define, I didnt realise that it truly was the only thing that actually made me feel worthy. \nAnd so now, I'm here trying to get into UofT, a school I thought would've been easy to get into, and now im struggling, and I'm scared out of my mind. I'm literally considering not even giving in my bad grades to the university in the hopes that they'll let me in. \n\nI just, feel like maybe if I had associated my self worth to anything other than compliments about my grades and how good of a student I am, then maybe I would be a better, more healthier person. I hate that I've done this to myself.\n\nI dont even know what to do. I'm scared of getting rejected, because that'll be my worst nightmare at this point. At the same time, I'm scared of getting accepted. Because then it'll just reinforce this idea that I am still this amazing student, and I'll never try to build an identity on anything else.\n\nHonestly, I dont even think anyone will read this, but if you do, any words of advice will help. Anything.",
  "author": "Sad_Establishment872",
  "created": 1636850104,
  "updated": 1637180367,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.87,
  "comments": {
    "hkizooy": {
      "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hkizooy/",
      "text": " Colleges usually have a section in Common App that lets you discuss information that was not originally included in your application. You could talk about how COVID affected your mental health and grades  . Don’t worry. If you properly explained to them that COVID is what cause your grade to drop, they would take that into account when considering your application. Also colleges don’t care if your the teacher’s “favorite” student or something. They usually only care about your grades, extracurriculars, LORs and Essays. You should ask your previous teachers who you have had a good relations with to write your LORs. Also I’m curious why you would think high school grades wouldn’t matter for college applications? I mean it’s kinda obvious that they would want to see you be able to perform well academically before they accept you or not.",
      "author": "BigRich51604",
      "created": 1636851960,
      "upvotes": 4,
      "replies": {
        "hkjwx0q": {
          "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hkjwx0q/",
          "text": "I'd be a bit careful about this, though.\n\nYou don't want to give colleges the \"I'm dealing with mental health issues and/or COVID distress (so has everyone else) so accept me\" vibe. You could try explaining why your grades have dropped, or if any extenuating circumstances contributed to that trend, but ultimately there isn't much you can do about it, since grades are the most important thing on your app.\n\nI feel you though. First semester senior year has been my worst yet in terms of grades :( Just hang in there and grind second quarter/trimester and you'll be fine.",
          "author": "did_i_inquire",
          "created": 1636867713,
          "upvotes": 1,
          "replies": {
            "hkkakxh": {
              "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hkkakxh/",
              "text": "Yeah I probably won't go for the whole explanation route. As mentioned, I need to have official documents and stuff anyway, 'proving' that my mental health suffered.\n\nBut thank you! Hopefully my upcoming exams go well and I can pick myself up, and I hope things go well for you too!",
              "author": "Sad_Establishment872",
              "created": 1636876515,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hkkaf0u": {
          "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hkkaf0u/",
          "text": "I did think about including something about how my mental health affected my grades, but I decided against it because the university needs official documents like therapy appointments or whatever, which I don't have, so it'll probably just come off as, 'oh I got a bit anxious and depressed, but please let me in even with my bad grades'\nAlso, about the whole high school grade thing, I actually do the British patterned curriculum, so like IGCSE and A Levels and stuff. And we were always told that those grades were the only important thing and schools don't care about high school grades, which is really only true for the UK.\nSo I have really good IGCSES and AS Levels, but for grade 11, my grades are like average to borderline bad",
          "author": "Sad_Establishment872",
          "created": 1636876398,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkiza3p": {
      "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hkiza3p/",
      "text": "Hey. I am really sorry that you’re feeling this way. Know that you’re not the only one who feels chained to the “good student” identity, and that it’s not your fault. You did not do this to yourself! For a lot of us, we were told we were “good students” or “gifted” at a really young age by authority figures, and are therefore subconsciously are always trying to live up to that. You are so much more than your perceived academic abilities. You don’t need to have all of your hobbies/interests sorted out yet either. We’re all so young and have so much time to figure out what we like and what we want. Just focus on being a teenager and finding joy in the little things. Rooting for you! \n\nAlso here is a video that touches on some of what you’re discussing that I think might resonate with you. Hope this helps!: https://youtu.be/YcaD980oYJQ",
      "author": "leftpsyche",
      "created": 1636851776,
      "upvotes": 1,
      "replies": {
        "hkkasrk": {
          "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hkkasrk/",
          "text": "Thank you so much! ♡ \nI really do hope that once I become a bit better, I can grow a bit more as a person. The idea of getting bad grades and even admitting that I'm not a good student anymore is terrifying, but maybe it's a good thing in the end, because maybe I'll find something else to cherish myself about. So thank you so much for your kind words!",
          "author": "Sad_Establishment872",
          "created": 1636876673,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hklyfvk": {
      "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hklyfvk/",
      "text": "A level? Are you from the UK?",
      "author": "blankstateman",
      "created": 1636910771,
      "upvotes": 1,
      "replies": {
        "hkml0ke": {
          "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hkml0ke/",
          "text": "No I'm an international student but many schools worldwide follow the UK system",
          "author": "Sad_Establishment872",
          "created": 1636919292,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hklykh0": {
      "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hklykh0/",
      "text": "I want to add that it also easier to get into college now because of the pandemic than ever before. Don't stress yourself out too much!",
      "author": "blankstateman",
      "created": 1636910824,
      "upvotes": 1,
      "replies": {
        "hkml2yv": {
          "link": "/r/ApplyingToCollege/comments/qte0d5/im_scared_about_applications/hkml2yv/",
          "text": "I really hope so! Thank you!",
          "author": "Sad_Establishment872",
          "created": 1636919316,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}