{
  "sid": "qrophm",
  "link": "/r/ApplyingToCollege/comments/qrophm/my_upenn_interview_request_went_to_spam_and_my/",
  "title:": "My Upenn interview request went to SPAM and my interviewer just reached out a week later. Am i fucked?",
  "text": "SO umm... I've literally been searching for my interview email for the past two weeks and I just found out it was in sPaM (sent a week ago). My interviewer just sent a follow-up email and texted me about whether I still want an interview...\n\nIs this gonna permanently ruin my image? my interview is tmrw and I'm so mortified.",
  "author": "ruine-oo",
  "created": 1636647366,
  "updated": 1637369313,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hk7uanr": {
      "link": "/r/ApplyingToCollege/comments/qrophm/my_upenn_interview_request_went_to_spam_and_my/hk7uanr/",
      "text": "I think if you explain it went to spam then you’re fine.",
      "author": "Mawlil1",
      "created": 1636647737,
      "upvotes": 6,
      "replies": {}
    },
    "hk9p3o7": {
      "link": "/r/ApplyingToCollege/comments/qrophm/my_upenn_interview_request_went_to_spam_and_my/hk9p3o7/",
      "text": "Don't worry - I interview for Cornell and I typically have to e-mail / text a few times before I get kids online.",
      "author": "Applying_in_2021",
      "created": 1636675662,
      "upvotes": 6,
      "replies": {}
    },
    "hk9pfn4": {
      "link": "/r/ApplyingToCollege/comments/qrophm/my_upenn_interview_request_went_to_spam_and_my/hk9pfn4/",
      "text": "Hi, I'm an alumni interviewer. This will not make any difference. Hell, it wouldn't make a difference even if the email didn't end up in your spam folder (although explain, briefly and without overdoing your performance of emotions, that it did). \n\nBeing an adult consists entirely of missing emails and then getting (and sending) friendly follow-ups. I'm an \"Inbox Zero\" person and even I can confirm that this is literally 100% of adult experience. We do nothing else but miss emails and follow up on missed emails. Your interviewer has been there.\n\nEven if you didn't write back to the interviewer at all, they'd just check a checkbox on a webpage to say you'd been contacted. I don't believe, speaking only for my own beliefs about the interview process and the purposes it serves, that this would have an effect on your application.",
      "author": "lotsofgrading",
      "created": 1636675827,
      "upvotes": 5,
      "replies": {
        "hk9zg0d": {
          "link": "/r/ApplyingToCollege/comments/qrophm/my_upenn_interview_request_went_to_spam_and_my/hk9zg0d/",
          "text": "Thank you 😭😭😭 I’ll be sure to not overdramatize it.",
          "author": "ruine-oo",
          "created": 1636680538,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hk8b6tv": {
      "link": "/r/ApplyingToCollege/comments/qrophm/my_upenn_interview_request_went_to_spam_and_my/hk8b6tv/",
      "text": "Bet you check your spam in the future.",
      "author": "Radiant-Chipmunk-987",
      "created": 1636654385,
      "upvotes": 2,
      "replies": {}
    }
  }
}