{
  "sid": "q6p6pm",
  "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/",
  "title:": "if you think it stops once you get in, you’re dead wrong.",
  "text": "i’m currently a college freshman at a top 20. college admissions were stressful, especially being surrounded by so many people who feel more qualified than you. \n\n once you get to school, it becomes so much worse. suddenly, every one around you has had incredible internships and has done research and is currently curing cancer. the imposter syndrome is real. \n\n please keep in mind while you’re applying that it doesn’t end once you get accepted and pay your enrollment deposit. don’t sign up for something you aren’t sure if you can handle. \n\nwishing you all the best of luck <3",
  "author": "alyssa0311",
  "created": 1634053847,
  "updated": 1634072558,
  "over_18": false,
  "upvotes": 106,
  "upvote_ratio": 0.89,
  "comments": {
    "hgdj6gu": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgdj6gu/",
      "text": "I go to t30 so it might be dif but for me its gotten way better cuz theres ton of new opportunities and I essentially get to restart and not have to worry abt how I'd appear to others bc college is so big and literally nobody cares what you do. (writing this while sitting in the library nap chairs w my pjs doing hw)\n\nI've met a bunch of really cool people thats makes me want to do more and be as cool as them and honestly yes more self discipline is required than HS but nah it's not worse for me",
      "author": "imdonetakeit",
      "created": 1634058492,
      "upvotes": 43,
      "replies": {
        "hgect2u": {
          "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgect2u/",
          "text": "This was basically my experience in college as well...except for the pjs part.",
          "author": "HaroldBAZ",
          "created": 1634070589,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgd93qq": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgd93qq/",
      "text": "Reminder that this is one person's perspective and not some sort of universal rule",
      "author": "freeport_aidan",
      "created": 1634054329,
      "upvotes": 98,
      "replies": {
        "hgdayyr": {
          "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgdayyr/",
          "text": "again just something i experienced and it’s a different perspective that i feel like doesn’t get enough attention here",
          "author": "alyssa0311",
          "created": 1634055105,
          "upvotes": 20,
          "replies": {}
        },
        "hgeefcu": {
          "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgeefcu/",
          "text": "This is true of nearly all advice posts around here. Why single out this one?",
          "author": "elastricity",
          "created": 1634071247,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgdk3dd": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgdk3dd/",
      "text": "This is why I'm going to be a humanities major (History). No one is going to be solving cancer, just arguing over the interpretation of a primary source.",
      "author": "gouverneurmroosevelt",
      "created": 1634058880,
      "upvotes": 22,
      "replies": {
        "hgds5j0": {
          "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgds5j0/",
          "text": "same but with philosophy or lit! go humanities :D",
          "author": "gyukuda",
          "created": 1634062178,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hgdxnwh": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgdxnwh/",
      "text": "If you make your life into a rat race, you will always be a rat in a race. This is why \"fit' is important in terms of college admissions. Go to a school that wants you based on the authentic, regular \"you\", not the curated, super-hyped up version you put forward in your application. This is why imposter syndrome is becoming an epidemic on college campuses.",
      "author": "renebeca",
      "created": 1634064428,
      "upvotes": 20,
      "replies": {
        "hge69vw": {
          "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hge69vw/",
          "text": "Facts",
          "author": "landont20",
          "created": 1634067923,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hge0nte": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hge0nte/",
      "text": "I also have bad news for those of you planning to go to medical school afterwards. It gets much much harder.",
      "author": "skoldpadda9",
      "created": 1634065649,
      "upvotes": 4,
      "replies": {}
    },
    "hge7qod": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hge7qod/",
      "text": "I don't mean this as an invalidation of OP's experience, but as someone who also went to a T20, this is partly a mentality issue. When you go to a T20 or even T40, you will be surrounded by very high achieving people. I had a lot of friends, including my ex, who had a similar experience. They were top of their class in high school and were suddenly middle of the road students at an Ivy. Much of their self-definition had been founded on success, and once that was gone, they felt lost. No matter how hard they tried at schoolwork, they still got median and it tore them up because enjoying the material and being a decent student at a top-tier school wasn't enough. Remember that even if you're a small fish amongst big fish in a small pond, that small pond is some of the most rarified water around.\n\nWhat OP also touches on tangentially is the importance of finding things you love. I hope you're in college and in a particular major or club for the love of the game. If you look at your peers as points of comparison or people to be competed against, college will turn into another crappy rat race. And even if you're near the top of the heap, you're still going to look at the people above you and wish you were them. I was a pre-med majoring in engineering, and both fields had plenty of people who were constantly looking at medians while missing the sheer coolness of the opportunities around them. Work hard and do things that make you happy and enrich you as a person. College will be a blast",
      "author": "leadbunny",
      "created": 1634068513,
      "upvotes": 4,
      "replies": {}
    },
    "hgdyv1v": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgdyv1v/",
      "text": "remind me to come back to this post when i get rejected by all my dream schools",
      "author": "lisxso",
      "created": 1634064915,
      "upvotes": 2,
      "replies": {}
    },
    "hgdfkpi": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgdfkpi/",
      "text": "i’m not saying y’all have to like or agree w my opinion like i just wish someone had said this to me",
      "author": "alyssa0311",
      "created": 1634056986,
      "upvotes": 5,
      "replies": {}
    },
    "hgeb0bd": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgeb0bd/",
      "text": "It's ultimately your choice whether or not to let the success or experience of others stress you out. I know it can feel inevitable, especially if you have parents or other people in your life constantly making comparisons between you and the people around you. But in the end, you can choose how you feel about it. And that doesn't have to be a negative feeling. Be happy for the success of others. Learn from it when you want to. Ignore it when it doesn't impact you. You'll have an easier life.",
      "author": "MaidensOfTheSpear",
      "created": 1634069852,
      "upvotes": 1,
      "replies": {}
    },
    "hgebzp2": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgebzp2/",
      "text": "Went to state flagship, didn't have to deal with this.  Most stressful thing I had to deal with freshman year is the decision to drop out of the honors program I'd originally applied to.",
      "author": "jayphoward",
      "created": 1634070259,
      "upvotes": 1,
      "replies": {}
    },
    "hgecfle": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgecfle/",
      "text": "wow i am so sorry you’re going through this op but as a counterpoint, im a freshman at a t20 who went through HELL during the application process and now im literally happier than i’ve been in years. imposter syndrome hit hard right after i was admitted, but now that i’m on campus everyone is very chill and there’s very much a “we’re all in this together” vibe.",
      "author": "calabash_bro",
      "created": 1634070440,
      "upvotes": 1,
      "replies": {}
    },
    "hgeebeg": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgeebeg/",
      "text": "With some exceptions (med/law school hopefuls) your college GPA/accomplishments aren't a big deal in the working world. It's more about the name of the college on your diploma than what your grades were. To win at college you need a work/play balance where you get your work done...but instead of being in the library every Friday and Saturday night you experience other aspects of college life.",
      "author": "HaroldBAZ",
      "created": 1634071203,
      "upvotes": 1,
      "replies": {}
    },
    "hgeeo6p": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgeeo6p/",
      "text": "YEPPPPPPP this is true...",
      "author": "ssssseabass",
      "created": 1634071346,
      "upvotes": 1,
      "replies": {}
    },
    "hgd84vc": {
      "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgd84vc/",
      "text": "Maybe take it easy on the drinks ? Nose to the books !",
      "author": "habibihowie",
      "created": 1634053933,
      "upvotes": -11,
      "replies": {
        "hgd8v86": {
          "link": "/r/ApplyingToCollege/comments/q6p6pm/if_you_think_it_stops_once_you_get_in_youre_dead/hgd8v86/",
          "text": "hehe comical, im just sharing what i wish i knew this time last year",
          "author": "alyssa0311",
          "created": 1634054232,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}