{
  "sid": "qfujz5",
  "link": "/r/ApplyingToCollege/comments/qfujz5/what_is_a_cocurricular/",
  "title:": "What is a co-curricular?",
  "text": "how is it different from an extracurricular?",
  "author": "KaiWillson",
  "created": 1635208594,
  "updated": 1635301799,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hi217x9": {
      "link": "/r/ApplyingToCollege/comments/qfujz5/what_is_a_cocurricular/hi217x9/",
      "text": "An extracurricular is an all-encompassing term describing anything you do outside of your classes. A co-curricular is an activity that is academic-related but not required for a class (e.g. DECA, MUN, Olympiads)",
      "author": "moonriver252",
      "created": 1635208913,
      "upvotes": 5,
      "replies": {}
    },
    "hi24rdh": {
      "link": "/r/ApplyingToCollege/comments/qfujz5/what_is_a_cocurricular/hi24rdh/",
      "text": "Definitionally:\n\n>Co-curricular activities are those activities that are outside of but usually complementing the regular curriculum. Extracurricular activities are defined as those school-based activities that are not tied to the curriculum.\n\nIt’s not a commonly used term. EC is usually anything outside of a specific class.",
      "author": "RichInPitt",
      "created": 1635210542,
      "upvotes": 2,
      "replies": {}
    },
    "hi5h0gp": {
      "link": "/r/ApplyingToCollege/comments/qfujz5/what_is_a_cocurricular/hi5h0gp/",
      "text": "At my school, co-curriculars are things like choir and band. You have a class period dedicated to it, where you do most of your learning, but you also have required out-of-class elements that take place during other parts of the school day or after/before school. Things like choir/band lessons, early morning sessions, performances, select or honor groups, etc. They're different from regular classes because you have obligations outside of your class period, and they're different from extracurriculars because you have a class period and you're getting a grade.",
      "author": "Admiralsky",
      "created": 1635275837,
      "upvotes": 1,
      "replies": {}
    }
  }
}