{
  "sid": "qf8c98",
  "link": "/r/ApplyingToCollege/comments/qf8c98/i_have_one_college_left_on_my_list/",
  "title:": "I have one college left on my list",
  "text": "I took advantage of fall break last week and was able to drive around two college campuses very briefly(!) with my mom. Both schools were on my list. My mom had something bad about both schools. She legitimately crossed them off my mental list for me, I didn’t ask her to, she just did it. I’m trying to build my list, but every time I find a school, there’s something that I don’t like about it.\n\nThat now leaves me with one school: my parents alma mater. I love the school, however I don’t love the non-traditional feel of campus. But I’m pretty much guaranteed admission, even with my not so great GPA. it’s near family. it’s got my desired majors and minors, with the ability to easily double major. Plus I could easily afford tuition with a part time job, and or scholarships. Every time I look at another school I’m legitimately like “but it’s not (parents alma mater.)” at this point I think the universe is just telling me to go to my parents alma mater. But I at least need other schools for my list.",
  "author": "tables_04",
  "created": 1635133655,
  "updated": 1635182384,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hhy3hnj": {
      "link": "/r/ApplyingToCollege/comments/qf8c98/i_have_one_college_left_on_my_list/hhy3hnj/",
      "text": "I know this is a rant, but is there a question in there somewhere?\n\nCould you tell us some things you're looking for in a school, your family's income (do you need financial aid?), as well as your desired major, and we could try to suggest some schools for you to look into?",
      "author": "toyota2003",
      "created": 1635133779,
      "upvotes": 3,
      "replies": {
        "hhy423w": {
          "link": "/r/ApplyingToCollege/comments/qf8c98/i_have_one_college_left_on_my_list/hhy423w/",
          "text": "Also what do you mean by non traditional campus? I know of a couple non traditional campuses that have amazing student life as well as dozens of state/classic colleges with horrid student communities.",
          "author": "Fishifer",
          "created": 1635134116,
          "upvotes": 3,
          "replies": {}
        },
        "hhy4v9j": {
          "link": "/r/ApplyingToCollege/comments/qf8c98/i_have_one_college_left_on_my_list/hhy4v9j/",
          "text": "Campus: I want a medium sized school, ideally less than 20k students. I would prefer a more traditional campus feel, and a campus that is easy to navigate. \n\nFinancial aid: I’m going to need financial aid (parents income is almost six figures, but one parent is not employed.) my parents do not have anything saved up for my college, nor are they willing to foot the bill.\n\nMajors: neuroscience, psychology (double major if possible) a healthcare ethics or policy minor would be nice\n\nGPA/test scores: gpa was a 3.1 freshmen year, but went down with COVID sophomore year, it’s way up this year (not sure what it is exactly.) I haven’t taken the SAT or ACT yet. Thanks in advance for the help.",
          "author": "tables_04",
          "created": 1635134613,
          "upvotes": 2,
          "replies": {
            "hhy5ii2": {
              "link": "/r/ApplyingToCollege/comments/qf8c98/i_have_one_college_left_on_my_list/hhy5ii2/",
              "text": ">Campus: I want a medium sized school, ideally less than 20k students. I would prefer a more traditional campus feel, and a campus that is easy to navigate.\n\nBy traditional, I assume you mean a campus with quads, trees, and that sort of thing? Like not an urban campus like NYU? And medium sized is perfectly fine; many schools fit that criteria. :)\n\n>Financial aid: I’m going to need financial aid (parents income is almost six figures, but one parent is not employed.) my parents do not have anything saved up for my college, nor are they willing to foot the bill.\n\nThis is tricky; colleges aren't going to give you *more* financial aid with this taken into consideration, because if they did that, everyone would just say \"my parents aren't contributing to my college tuition\" \n\n>GPA/test scores: gpa was a 3.1 freshmen year, but went down with COVID sophomore year, it’s way up this year (not sure what it is exactly.)\n\nI'll be honest, this does sort of narrow down your list of schools, but you've still got a lot of great options.\n\n>Majors: neuroscience, psychology (double major if possible) a healthcare ethics or policy minor would be nice\n\nI'm going to be focusing on a neuroscience or psychology major, that's a specific minor and I don't have time to look through schools with that as a minor.\n\n\\-----\n\nGiven all that, I'd love to suggest some schools to look into, but could you please answer these two questions?\n\n1. What is your state of residence? (This is really important b/c cost is a major issue for you.)\n2. Does political vibe matter to you? (i.e. are extremely liberal or conservative schools a dealbreaker? any preferences?)",
              "author": "toyota2003",
              "created": 1635135007,
              "upvotes": 2,
              "replies": {
                "hhyuz7z": {
                  "link": "/r/ApplyingToCollege/comments/qf8c98/i_have_one_college_left_on_my_list/hhyuz7z/",
                  "text": "i just love ur responses to any post! gosh toyota2003 u are going to do great in college & in life!",
                  "author": "Capable-Ad1621",
                  "created": 1635155590,
                  "upvotes": 2,
                  "replies": {}
                },
                "hhzqzna": {
                  "link": "/r/ApplyingToCollege/comments/qf8c98/i_have_one_college_left_on_my_list/hhzqzna/",
                  "text": "I live in indiana, I’m pretty liberal, so preferably not a super conservative school.",
                  "author": "tables_04",
                  "created": 1635174285,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}