{
  "sid": "q6bn5v",
  "link": "/r/ApplyingToCollege/comments/q6bn5v/struggling_to_solidify_my_list_for_qb_match/",
  "title:": "Struggling to solidify my list for QB Match Rankings",
  "text": "Hi guys! \n\nI'm applying for Questbridge and I'm struggling to finalize the partner college I want to match with. I know that I should be practically married to any schools I choose because QB is binding but I've been working on my college list since the beginning of summer and I don't feel absolutely sold on any one college. I keep being told that college is what you make of it which is *great* \\- except then I don't know how to pick colleges based off my own criteria, especially every experience is so individualized! (Side note: I know there's a low chance of getting into these colleges, please keep in mind that none of my targets/safeties are on this list because I'm applying to Questbridge! This isn't my actual college list lol). I'd love to hear your opinions on my list! \n\nSo far I have: \n\n1. Yale \n2. Columbia\n3. Brown\n4. Pomona\n5. Princeton\n6. Claremont McKenna\n7. Barnard \n8. Uchicago\n\nWhy these colleges?\n\n**Yale Pros:** \n\n* Decent food \n* Easy to make connections \n* Near New York \n* Tons of resources\n* Secret society, or basically a classy co-ed version of a frat (Don't worry, I totally understand this is a thing that probably doesn't happen to most students!)\n* Semi-open curriculum (some required classes)\n* Teachers who are happy to help\n* More diverse interests in student body \n* Residential colleges (not really sure how this is that different from a dorm tbh) \n* Great academically (as all of these colleges are so I'm only going to mention it here)\n\n**Cons:** \n\n* Connecticut  \n* Elitism like all ivies \n* I haven't been able to find any more cons which makes me suspicious \n\n**Columbia Pros: (was my top school for a while until Yale)**\n\n* I love New York (and yeah, everyone who wants to go to Columbia loves NY but I actually live here and do adore it)\n* Tons of resources/activities \n* Connections with Barnard (it's usually the other way around but while I love the idea of Barnard, for example, how close knit the community is/professor-student relationships, I'd prefer going to a co-ed school over an all girl's college - but I wouldn't mind going to an all girl's school, hence why it's still on my list)\n   * **A question for Columbia students**: would you say you're close with any professors from Barnard/get the pros of going to Barnard like smaller class sizes?\n\n**Cons:** \n\n* Core curriculum is really intense (The core curriculum honestly doesn't sound that great but I'm probably less horrified by it then any other applicant since I'm also undecided on my major, so it would allow me to explore before I decided.)\n* Bad on campus housing (but I live in ny so i could probably live at home if I had to)\n* Elitism like all ivies \n* Cutthroat \n\n**Brown Pros:** \n\n* Interdisciplinary emphasis/flexible when it comes to majors \n* Undergraduate focused \n* Academic freedom bc of open curriculum (pro and con bc i'm undecided!)\n* Good study abroad (I don't really know if I'm going to study abroad or not yet! Indecisiveness is once again my fatal flaw but if I had the chance I'd like to!)\n* Great internship placement/career advising \n* Opposite of cutthroat \n\n**Cons:** \n\n* Subpar dorms and food\n* Impossible to graduate early because of open curriculum \n\n**Pomona Pros:**\n\n* Small classes with resources of a larger college\n* Diverse yet tight knit \n* Gorgeous campus \n* Close to LA \n* Academically rigorous \n* Part of the claremont college conservatorium  \n\n**Cons:**\n\n* I haven't been able to find any cons which makes me suspicious \n\n**Princeton Pros:**\n\n* Undergraduate focused \n* Flexible curriculum/major\n* Near NY\n* Good study abroad program \n* Undergrad thesis \n* Alumni loyalty (p-rade)\n* Residential colleges\n\n**Cons:** \n\n* No double major \n* Very competitive/toxic academic environment/elitist \n* Crazy academic rigor/grade deflation\n\n**Claremont McKenna Pros:**\n\n* Part of the claremont college conservatorium  \n* Small undergraduate body means good student:faculty ratio\n* Undergraduate research\n* Good study abroad program\n\n**Cons:** \n\n* When they say small they mean it, everyone knows everyone \n* most 'bro-y' of all the claremont colleges\n\n**Barnard College Pros:**\n\n* Really really impressed by how much everyone who goes there seems to love it and strong alumni loyalty \n* R[elationship with professors](https://www.reddit.com/r/ApplyingToCollege/comments/bc8du8/comment/ekqcz8o/?utm_source=share&utm_medium=web2x&context=3)\n* Access to columbia resources and takes many of the same classes without the pressure of the core curriculum\n* Not that hard to transfer to columbia (definitely not the main draw) \n\n**Cons:** \n\n* Bad on campus housing (but I live in ny so I could probably live at home if I had to)\n* All girl's college (the only all female college I'm considering bc it's right next to Columbia/in the middle of NYC so it's not giving convent vibes like some of the other schools!)\n\n**UChicago College Pros:**\n\n* Student described it as \"enjoying the idea of playing settlers of catan and then getting wasted as you discuss moral philosophy until 2am\" in an ama (People seem to have mixed feelings about  quirkiness. On one hand I love interesting people, on the other hand - if it's 'intellectual self masturbation' like some people are saying...)\n* Unique, fun traditions \n* Community is genuinely like family\n* Core curriculum (undecided) \n\n**Cons:** \n\n* Insanely academically rigorous - 'where fun goes to die'/grade deflation\n* Quarter system\n* Administration doesn't really care about students \n\n**Additional Notes:** \n\nI ended up taking Tufts and USC off my list because I heard that USC is bad for people who are undecided and Tufts has horrible fin aid even with Questbridge because they don't consider books and transportation in 'need'. \n\nIf you need other information like personality or stats feel free to ask! Thanks so much and good luck to everyone who's working on their college apps! I hope that even if I'm struggling maybe my notes on these colleges helped someone else :)",
  "author": "Heartsickstella",
  "created": 1634004585,
  "updated": 1634072919,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hgb1bec": {
      "link": "/r/ApplyingToCollege/comments/q6bn5v/struggling_to_solidify_my_list_for_qb_match/hgb1bec/",
      "text": "In terms of QB ranks, I think Justin Fields can definitely make the list now",
      "author": "BrownMambaOfficial",
      "created": 1634005499,
      "upvotes": 0,
      "replies": {}
    }
  }
}