{
  "sid": "qtuvgh",
  "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/",
  "title:": "Thoughts?",
  "text": "Hey guys, I’m the only senior from my hs (international) applying to colleges in the us. My school counselor and my teachers don’t know shit about common app so they all just gave me their login and told me to do everything by myself 🤡🤡🤡 (including recommendations and school transcript — our school doesn’t even provide transcript). So guess what I’m having to write my own recommendations and make my own transcript🤡😃. I’m already struggling with my own essays 😩.\n\nAlso would this be illegal?…",
  "author": "Hour-Garden2696",
  "created": 1636911388,
  "updated": 1637180175,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "hkm0rss": {
      "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkm0rss/",
      "text": "Bruh that's so horrible. The only thing I could see you benefitting from this is doing your own college recommendations (which is probably illegal). You should tell your parents or email the principal or higher ups or something. This whole situation is most likely illegal",
      "author": "yoonginoodle",
      "created": 1636911718,
      "upvotes": 8,
      "replies": {
        "hkm1trz": {
          "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkm1trz/",
          "text": "Yeah I have a feeling. They said that they would look at them before I could send them off. \n\nNo one in my school knows about the US application process which sucks:(. I will prolly email the principal next week thanks anw!!",
          "author": "Hour-Garden2696",
          "created": 1636912156,
          "upvotes": 3,
          "replies": {
            "hkm5g30": {
              "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkm5g30/",
              "text": "Oh yeah, I forgot you you said you go to an international school. Hopefully the principal can help you :(",
              "author": "yoonginoodle",
              "created": 1636913553,
              "upvotes": 1,
              "replies": {}
            },
            "hkmnh15": {
              "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkmnh15/",
              "text": "My situation right now …I’m not writing my own Rex’s but no one is helping",
              "author": "Nanahemaa_17",
              "created": 1636920220,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkm5b5t": {
      "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkm5b5t/",
      "text": "This is not illegal. Show them the recommendations you write and let them sign off on it before sending them. With the transcript take it to the highest level administrator you can and have them sign it.\n\nBy applying to American schools, you are evidently putting them in a situation they are not comfortable with--so, make their lives easy and do this for them. You want to do something different than everyone who has ever been at your school? Ok, you'll have to do a bit more then.\n\nPS For the American students thinking this is so terrible, imagine you want to apply to the University of Cambodia and all of the recommendations have to be submitted in Khmer, the transcript has to be translated in Khmer--and the GPA adjusted to a different system. Your teachers might not know how to proceed either.",
      "author": "Lupus76",
      "created": 1636913507,
      "upvotes": 12,
      "replies": {
        "hkm6fcw": {
          "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkm6fcw/",
          "text": "yes",
          "author": "Round_Cauliflower_12",
          "created": 1636913915,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hkm4alm": {
      "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkm4alm/",
      "text": "ask them to write recs in native language and ask english teacher translate maybe? explain them how recs should be, show them examples, give them some kind of a brag sheet.",
      "author": "skibidvapaaa",
      "created": 1636913147,
      "upvotes": 3,
      "replies": {
        "hkm6087": {
          "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkm6087/",
          "text": "> ask english teacher translate maybe? explain them how recs should be, show them examples\n\nDo not do this. 1. Just because someone speaks English doesn't mean they can translate. 2. You are now asking more teachers to do more work for you when the teachers already gave you a solution: write the recommendations yourself.",
          "author": "Lupus76",
          "created": 1636913756,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkyfeb2": {
      "link": "/r/ApplyingToCollege/comments/qtuvgh/thoughts/hkyfeb2/",
      "text": "I help write and edit essays! Message me for any advice or help!",
      "author": "JuicyEssays",
      "created": 1637128349,
      "upvotes": 1,
      "replies": {}
    }
  }
}