{
  "sid": "qx7rmi",
  "link": "/r/ApplyingToCollege/comments/qx7rmi/hey_there_im_a_young_16_year_old_indian_having/",
  "title:": "Hey there! I'm a young 16 year old indian having dreams of joining an international college,",
  "text": " I'm an ambitious 16 year old indian having dreams of being in an international college, especially in europe but I have had not much experience in extra-curricular activities nor any said experience in internships or positions with leadership, Can I please get some advice or any websites that can show me how can I work on those factors to maximize my chances of getting in?   \n\n\nI'm really looking for an online school-like program that assesses my qualities and gives me new tasks to achieve every week or so",
  "author": "slavie19",
  "created": 1637294581,
  "updated": 1637353064,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hl8t6fy": {
      "link": "/r/ApplyingToCollege/comments/qx7rmi/hey_there_im_a_young_16_year_old_indian_having/hl8t6fy/",
      "text": "Even I am a hopeful so I can tell you something things I am doing. Take the SATs or ACTs your Preference. Do something worthwhile according to your major. For eg. I am trying in a biz/eco so I manage my mother's stock portfolio, shadow my father at his business. Also they like if you lead shit so do  things Join the RobinHood Army it's very easy to and takes only one day in a week, plus it really gives peace of mind. Since you are Indian I am assuming you have chosen a stream (Arts, commerce, science) if you have taken commerce don't even dream of giving ACTs. Take a additional certificate course that will help. And most importantly study hard. Think you're in Tihar with your textbooks. Also hire a counsellor and ask your CA to hide your  parents income(that's a joke, but seriously do it). Then start practicing essay writing. And pray for 2 and hours everyday so that luck favours you and voila you are in a International University that will give your parents bragging rights.",
      "author": "InvictusHomo",
      "created": 1637322653,
      "upvotes": 1,
      "replies": {}
    }
  }
}