{
  "sid": "qx5beu",
  "link": "/r/ApplyingToCollege/comments/qx5beu/is_dropping_a_course_at_the_semester_for_another/",
  "title:": "Is dropping a course at the semester for another course going to look bad on college apps?",
  "text": "basically title. there’s this one class I’m starting to hate but if it’ll hurt my chances of college then I’ll stick with it",
  "author": "owidh73923sksbha2083",
  "created": 1637286684,
  "updated": 1637353089,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl78afb": {
      "link": "/r/ApplyingToCollege/comments/qx5beu/is_dropping_a_course_at_the_semester_for_another/hl78afb/",
      "text": "What is the class and what course are you considering dropping it for? Have you been accepted to any colleges yet?",
      "author": "fortuitous_rain515",
      "created": 1637287000,
      "upvotes": 3,
      "replies": {
        "hl78g66": {
          "link": "/r/ApplyingToCollege/comments/qx5beu/is_dropping_a_course_at_the_semester_for_another/hl78g66/",
          "text": "It’s on level cybersecurity, I’m considering dropping it for the half year AP Psychology class instead",
          "author": "owidh73923sksbha2083",
          "created": 1637287073,
          "upvotes": 3,
          "replies": {
            "hl78jgn": {
              "link": "/r/ApplyingToCollege/comments/qx5beu/is_dropping_a_course_at_the_semester_for_another/hl78jgn/",
              "text": "Ok, what are you planning to major in and have any colleges accepted you yet?",
              "author": "fortuitous_rain515",
              "created": 1637287114,
              "upvotes": 1,
              "replies": {
                "hl78rua": {
                  "link": "/r/ApplyingToCollege/comments/qx5beu/is_dropping_a_course_at_the_semester_for_another/hl78rua/",
                  "text": "I’m planning on going neuroscience or psychology\n\nI’m a sophomore so I haven’t gotten to the application part but I don’t want to make any mistakes right now I’ll regret later",
                  "author": "owidh73923sksbha2083",
                  "created": 1637287220,
                  "upvotes": 1,
                  "replies": {
                    "hl79jop": {
                      "link": "/r/ApplyingToCollege/comments/qx5beu/is_dropping_a_course_at_the_semester_for_another/hl79jop/",
                      "text": "Ok, so since you are in your sophomore year, you do have more flexibility. I think AP Psychology would be a good fit for you because that is in a field you are interested in. If you plan on applying in the future as a psych major to a competitive university, the majority of people you are competing against will probably have taken this class or an equivalent. \n\nIt's also important to consider if your transcript will reflect that you dropped this class. It's not the end of the world if it does, but a dropped class can sometimes convey to colleges that you couldn't handle the coursework. Again, not the end of the world and not all colleges will think this, but best to ask your counselor if the dropped class will be listed on the transcript and if there is a way to get rid of that.",
                      "author": "fortuitous_rain515",
                      "created": 1637287573,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}