{
  "sid": "qaeror",
  "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/",
  "title:": "Is doing research bad?",
  "text": "I've been a lurker in this sub, and often research gets looked down upon from what I see. I am actually interested in doing some AI/ML research and (hopefully!) getting it published, I think it will be a really cool learning experience for me. Will that be looked down upon for AO's, that I did some research for AI/ML (for a CS major ofc).",
  "author": "fd430dfgjpogd3gfd2ds",
  "created": 1634529241,
  "updated": 1634653647,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh2jhnh": {
      "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh2jhnh/",
      "text": ">and often research gets looked down upon from what I see\n\nNot sure where you're seeing these posts, but I'm certainly not seeing them",
      "author": "freeport_aidan",
      "created": 1634529555,
      "upvotes": 3,
      "replies": {
        "hh2k3xe": {
          "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh2k3xe/",
          "text": "Really? I see many jokes about research and how useless it is.   \n\n\nEx: top post of this week, [https://www.reddit.com/r/ApplyingToCollege/comments/q7b89m/you\\_know\\_its\\_true/](https://www.reddit.com/r/ApplyingToCollege/comments/q7b89m/you_know_its_true/)",
          "author": "fd430dfgjpogd3gfd2ds",
          "created": 1634529890,
          "upvotes": 2,
          "replies": {
            "hh2odo4": {
              "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh2odo4/",
              "text": "Read the top comments of that post.",
              "author": "TheSnakeFang",
              "created": 1634532566,
              "upvotes": 2,
              "replies": {}
            },
            "hh2pm5w": {
              "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh2pm5w/",
              "text": "See the top comment on the thread (as well as the rest of the top comment thread, for that matter)\n\nThis is probably just an issue caused by our failure to define terms. Most high school students who do \"research\" (just like most people with \"non-profits\") don't actually do research, at least not in the way that colleges define the word (see u/IntheSarlaccsbelly's point on the post)  \n \n\nThe reality of the situation isn't that research is useless, but that low-quality and low-impact research (what the vast majority of HS \"research\" turns out to be) is held in low regard by AOs",
              "author": "freeport_aidan",
              "created": 1634533417,
              "upvotes": 2,
              "replies": {
                "hh30mji": {
                  "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh30mji/",
                  "text": "So good quality research is good basically?",
                  "author": "fd430dfgjpogd3gfd2ds",
                  "created": 1634542005,
                  "upvotes": 1,
                  "replies": {
                    "hh38rxf": {
                      "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh38rxf/",
                      "text": "No not exactly. It still has to be good and quality. \n\nAn example of research:\n* Dr. Hadiyah-Nicole Green is an American medical physicist known for the development of a method using laser-activated nanoparticles as a potential cancer treatment. \n\nThis is new. This is high impact. She will change the way cancer is cured and diagnosed. \n\nThat’s how colleges define research.\n\nBut high schoolers are rarely doing that. Usually they are teaming up with a professor, and not doing any actual research themselves. Research isn’t just writing a paper on something, the way high schoolers research and write a paper for biology class. \n\nYou should be discovering a new and innovative way to solve a problem.",
                      "author": "Outherepoor",
                      "created": 1634549494,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hh7990p": {
                      "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh7990p/",
                      "text": "I’m not sure you’re reading the posts people are sharing.\n\nLearning things is good. Demonstrating that you have a deep enough love if the subject to spend your time learning things is good. “Research” is a poorly informed catch all term that gets tossed around in this sub without much real depth of understanding for what it means.\n\nIf you want to learn about and apply ML concepts to a problem you’re interested in, then do that. Colleges will not look down on it. \n\nWhether it gets published or not shouldn’t be the point - though, if you’re the extremely rate exception to the rule and you actually get novel research published in a halfway-respectable journal, that would certainly look good.",
                      "author": "IntheSarlaccsbelly",
                      "created": 1634621750,
                      "upvotes": 1,
                      "replies": {
                        "hh7e6um": {
                          "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh7e6um/",
                          "text": "That sounds great because you described exactly what I wanted to do!",
                          "author": "fd430dfgjpogd3gfd2ds",
                          "created": 1634625667,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hh2q8s2": {
      "link": "/r/ApplyingToCollege/comments/qaeror/is_doing_research_bad/hh2q8s2/",
      "text": "MIT, UCB, Stanford are research universities and ranked primarily for that.",
      "author": "svday",
      "created": 1634533855,
      "upvotes": 1,
      "replies": {}
    }
  }
}