{
  "sid": "q6wnj7",
  "link": "/r/ApplyingToCollege/comments/q6wnj7/harvard_vs_columbia_for_engineering/",
  "title:": "Harvard vs Columbia for Engineering",
  "text": "Hi everyone! I’ve basically been debating this for weeks and weeks (I’m a very very indecisive person and just keep bouncing back and forth). I’ve made pro-con lists, gone through the whole tour process and just can’t seem to settle down. I plan to study engineering and was wondering if anyone could give some insight if they have experience with one of/either of the schools?! Thank you!",
  "author": "ihatecalculus04",
  "created": 1634075680,
  "updated": 1634575150,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hger598": {
      "link": "/r/ApplyingToCollege/comments/q6wnj7/harvard_vs_columbia_for_engineering/hger598/",
      "text": "Curious- why have you narrowed it down to those two?",
      "author": "jayphoward",
      "created": 1634076551,
      "upvotes": 1,
      "replies": {
        "hgesb0r": {
          "link": "/r/ApplyingToCollege/comments/q6wnj7/harvard_vs_columbia_for_engineering/hgesb0r/",
          "text": "Obviously this isn’t my only two but my top two reach schools. I’ve really loved Columbia for a while. The location, great engineering program, infinite opportunities makes it seem amazing. I don’t know as much about Harvard, however I love the location, it’s ‘college-town’ vibe being surrounded by so many schools, and obviously an almost equally as good engineering program. I don’t mean to come off pretentious and act like I belong at an Ivy because I know there’s a high chance I won’t get in, but I’m just so torn right now and could use any insight I could get",
          "author": "ihatecalculus04",
          "created": 1634077050,
          "upvotes": 1,
          "replies": {
            "hgete9a": {
              "link": "/r/ApplyingToCollege/comments/q6wnj7/harvard_vs_columbia_for_engineering/hgete9a/",
              "text": "Harvard is Harvard, obv, but if I were planning to study engineering I'm not sure either of those would be in my top two.",
              "author": "jayphoward",
              "created": 1634077528,
              "upvotes": 1,
              "replies": {
                "hgeylbg": {
                  "link": "/r/ApplyingToCollege/comments/q6wnj7/harvard_vs_columbia_for_engineering/hgeylbg/",
                  "text": "Why is that? Columbia has a top tier engineering program, Harvard’s following closely behind",
                  "author": "ihatecalculus04",
                  "created": 1634079842,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}