{
  "sid": "qa1yrj",
  "link": "/r/ApplyingToCollege/comments/qa1yrj/nyu_doesnt_superscore_sat/",
  "title:": "Nyu doesn't superscore SAT?",
  "text": " I read it on this prepscholar blog! What do you guys think?\n\n[https://blog.prepscholar.com/does-nyu-require-sat-essay#:\\~:text=One%20last%20note%20about%20NYU,highest%20SAT%20scores%20you%20submit](https://blog.prepscholar.com/does-nyu-require-sat-essay#:~:text=One%20last%20note%20about%20NYU,highest%20SAT%20scores%20you%20submit)!\n\nI also had a question about standardized testing from nyu's page on standardized tests. I'm somewhat confused by the wording that nyu will use score choice and will highest sat score, but the later it says that nyu will not create a superscore for old and new sat combined. Does that mean that nyu accepts sat superscores or just the highest scores? I would greatly appreciate it if you could help. Thank you.",
  "author": "CraftNo2253",
  "created": 1634487608,
  "updated": 1634653921,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh00fd1": {
      "link": "/r/ApplyingToCollege/comments/qa1yrj/nyu_doesnt_superscore_sat/hh00fd1/",
      "text": "Prepscholar, like most third-party websites, tends to be outdated on particular colleges' admission policies. Rely only on NYU's website for this type of information.\n\nNYU says\n\n>We will not offer admission to a student unless we have official testing on file and NYU does not consider results submitted by the applicant as official.\n\nSo, you must send official score reports.\n\n>If you’ve taken the SAT more than once, you can select which results you want to send to us using Score Choice. We will review the highest SAT scores you submit. If you submit scores from the old and new versions of the SAT, however, we will not create a new “superscore” as the old SAT is a different test from the new SAT.\n\nWhile \"review the highest SAT scores you submit\" is vague on section scores vs composite, the next sentence, that they don't superscore between old and new, I interpret to imply that they do superscore new scores. (Old refers to the pre-2016 Redesign.) This is ambiguous, which I find irritating and disappointing. I would call the admission office for clarification on whether they consider your highest section scores or highest composite.",
      "author": "elkrange",
      "created": 1634487949,
      "upvotes": 4,
      "replies": {
        "hh0120y": {
          "link": "/r/ApplyingToCollege/comments/qa1yrj/nyu_doesnt_superscore_sat/hh0120y/",
          "text": "Yea, this question has come up before, and the answer is that prepscholar is useless, and that the NYU admissions office confuses people by stating the obvious in a way that only confuses high school students\n\n@ op, ignore prepscholar, NYU supersocres, you're fine",
          "author": "freeport_aidan",
          "created": 1634488223,
          "upvotes": 3,
          "replies": {
            "hh07k4r": {
              "link": "/r/ApplyingToCollege/comments/qa1yrj/nyu_doesnt_superscore_sat/hh07k4r/",
              "text": "Tysm to both of u, I was about to have a heart attack as I my sat superscored was near the 75th but regular was near 25th (I'm trying my best but cuz of covid test centers aren't reliable)",
              "author": "CraftNo2253",
              "created": 1634490994,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh1lh33": {
      "link": "/r/ApplyingToCollege/comments/qa1yrj/nyu_doesnt_superscore_sat/hh1lh33/",
      "text": "IMO, you should trust very little of what you read on Prepscholar.\n\nThey have a particularly bad habit of adding a sentence or two to an article from years ago and putting a current date on it, even though all of the data Is outdated and wrong.\n\nThis is just another example.\n\nIf you want to know a school’s admissions policies, read the schools admission site. It’s no harder to find.",
      "author": "RichInPitt",
      "created": 1634512289,
      "upvotes": 1,
      "replies": {}
    }
  }
}