{
  "sid": "qimiza",
  "link": "/r/ApplyingToCollege/comments/qimiza/not_so_old_old_guy_applying_for_the_first_time_i/",
  "title:": "Not so old, old guy applying for the first time. I am woefully confused",
  "text": "I turned 30 this year's and was finally fed up with jumping from one construction job to another. I've always loved tech. Knowing the inner and outer workings of technology have always fascinated my. So I quit my pipeline construction job and now work at a department store. I'm ambitiously applying to a tech school for a network specialist degree. I'm attempting to register for classes. I watched the video and followed the steps. It tells me to check the boxes next to the classes I need to take but instead of boxes is either a C or NR. I don't know what this means. Am I to late to register? Or am I to early? Any tips, tricks, work arounds, or guides on how to fix what I'm to ignorant to understand would be greatly appreciated.",
  "author": "Deanity",
  "created": 1635541954,
  "updated": 1635779180,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.94,
  "comments": {
    "hikjhq6": {
      "link": "/r/ApplyingToCollege/comments/qimiza/not_so_old_old_guy_applying_for_the_first_time_i/hikjhq6/",
      "text": "So first step is applying to the school and getting accepted. (Look for the admissions over on the school website for directions).\nThen once you are accepted and enrolled you register for classes. But you won’t be able to select classes before you are enrolled.",
      "author": "WorriedTurnip6458",
      "created": 1635545421,
      "upvotes": 3,
      "replies": {
        "hiklvpq": {
          "link": "/r/ApplyingToCollege/comments/qimiza/not_so_old_old_guy_applying_for_the_first_time_i/hiklvpq/",
          "text": "Okay I have been accepted. I got the email and have a school email assigned to me. I go to student services and it says I have a hold because I have to go to orientation. Which I thought I did when they gave me a tour of the campus and sign some paper work. But I'll try again Monday",
          "author": "Deanity",
          "created": 1635546470,
          "upvotes": 2,
          "replies": {
            "hikz9mk": {
              "link": "/r/ApplyingToCollege/comments/qimiza/not_so_old_old_guy_applying_for_the_first_time_i/hikz9mk/",
              "text": "Yeah sounds like you need to speak with them directly. \nAlso - it’s great that you are doing this! My sister also started college at 28 and went in a completely different direction (town planning) - she has an awesome job.",
              "author": "WorriedTurnip6458",
              "created": 1635552649,
              "upvotes": 3,
              "replies": {
                "hil19tb": {
                  "link": "/r/ApplyingToCollege/comments/qimiza/not_so_old_old_guy_applying_for_the_first_time_i/hil19tb/",
                  "text": "Oh yeah I can't wait to get the whole process started and moving",
                  "author": "Deanity",
                  "created": 1635553610,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hina5qk": {
      "link": "/r/ApplyingToCollege/comments/qimiza/not_so_old_old_guy_applying_for_the_first_time_i/hina5qk/",
      "text": "Be careful of tech schools, you may be able to get same degree at community college for much cheaper. Make sure you check options.",
      "author": "bergenplace189",
      "created": 1635604141,
      "upvotes": 2,
      "replies": {}
    }
  }
}