{
  "sid": "qjxzva",
  "link": "/r/ApplyingToCollege/comments/qjxzva/which_to_apply_to/",
  "title:": "Which to apply to?",
  "text": "Hey y’all,\n\nSo i am a high school senior applying to college and need some advice. I’m a pretty competitive student (5.31/6 gpa, 1520 sat, Compete nationally in powerlifting, have good ecs). \n\nI am applying to a good amount of colleges that are in the T-50 range, but the main concern is the cost. My parents make 250k but since I have 5 siblings split over two households and two mortgages that amount gets spread quite thin. \n\nMy coach can get me into a pretty small (6k) college for pretty much no cost at all to go there, which his son did\n\nI would study and train powerlifting on a premed track.\n\nSo what should I do, Undergrad at a prestigious, large school where I’ll come out with 50-60k in loans, or go to a super small college with no loans at all",
  "author": "WashUPREPPER",
  "created": 1635712075,
  "updated": 1635777443,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "hit3pmv": {
      "link": "/r/ApplyingToCollege/comments/qjxzva/which_to_apply_to/hit3pmv/",
      "text": "If you're going pre-med I'd advise against taking out loans for undergrad.  That said, you could probably go to a large school on the basis of your SAT score w/o paying much.  Just not T50.\n\nSide note:  you might look into the Morehead-Cain scholarship at UNC.  It has a specific athletics requirement.  Super-duper competitive, though.",
      "author": "jayphoward",
      "created": 1635713263,
      "upvotes": 12,
      "replies": {
        "hitit49": {
          "link": "/r/ApplyingToCollege/comments/qjxzva/which_to_apply_to/hitit49/",
          "text": "Do you have any suggestions for large colleges I may get a good amount of money to?",
          "author": "WashUPREPPER",
          "created": 1635720312,
          "upvotes": 2,
          "replies": {
            "hitkph5": {
              "link": "/r/ApplyingToCollege/comments/qjxzva/which_to_apply_to/hitkph5/",
              "text": "Case Western maybe",
              "author": "love-chant",
              "created": 1635721255,
              "upvotes": 3,
              "replies": {}
            },
            "hitnc6z": {
              "link": "/r/ApplyingToCollege/comments/qjxzva/which_to_apply_to/hitnc6z/",
              "text": "Alabama, Miami of Ohio, South Carolina, Arizona, Arizona State, Kentucky, Ole Miss, West Virginia, maybe Michigan State or Florida State.  Once you get outside roughly the top 80-100 by USN more places tend to be willing to pay for high scores.",
              "author": "jayphoward",
              "created": 1635722580,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}