{
  "sid": "qjcb40",
  "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/",
  "title:": "wrote an essay. sucks ass.",
  "text": "misleading title because i wrote 3/4 of an essay. i have tried so hard and for so long but consolidating the highlights of the past 17 years in a 650 word essay is near impossible. I tried to pick \\*one thing\\* but there isn't just \\*one thing\\* that defines me.  i just think the flow is terrible, some of my claims about myself violate the basic rule of show don't tell. but i can't SHOW Everything because then my essay wouldn't be an essay it would be a fully fledged novel. sometimes i have to say I'm this I'm that. I can this i can that.\n\nI just needed a forum to complain. like i started with an anecdote and tried to build from there but there's nothing overarching about me as a person other than the fact that i'm a huge bitch.",
  "author": "none_oya",
  "created": 1635633455,
  "updated": 1637375860,
  "over_18": false,
  "upvotes": 88,
  "upvote_ratio": 0.99,
  "comments": {
    "hipa6in": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hipa6in/",
      "text": "Choose one thing about yourself. Just one. Are you creative? Are you good at comforting people? Are you a natural leader? It doesn't have to be something world-shattering, just one thing you like about yourself. Then think of a way you could possibly demonstrate this. Did you spend months working on a creative project for the sheer joy of it? Do you find satisfaction in giving people a shoulder to cry on? Do you like taking the lead on group projects? Get specific, and see if you can expand on it. Maybe you demonstrate this in other parts of your life, too: at home, at school, in your ECs. You don't have to condense down your whole life, just this one thing that you want colleges to know about you.",
      "author": "inkandpapyrus27",
      "created": 1635635797,
      "upvotes": 32,
      "replies": {}
    },
    "hipfo3u": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hipfo3u/",
      "text": "It’s not supposed to include the highlights of your entire 17 years to this point. It could be just the anecdote that you mentioned.",
      "author": "jjhoster",
      "created": 1635638555,
      "upvotes": 25,
      "replies": {
        "hiq0qal": {
          "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hiq0qal/",
          "text": "This. One moment in time. Or one specific thing. What led up to it. What specifically about you does that say.",
          "author": "Perplexed-Owl",
          "created": 1635649355,
          "upvotes": 6,
          "replies": {
            "hiq93jd": {
              "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hiq93jd/",
              "text": "I think an anecdote for the personal essays is pretty weak unless they tie something rather significant and also weave a narrative with the supplemental essays.   \n\n\nAlso, the highlight of 17 years can be done in 650 words. Every narrative, essay, short story, book, saga, epic tale doesn't have all the facts just the ones that carry the story.",
              "author": "stories_as_models",
              "created": 1635654276,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hip9bu2": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hip9bu2/",
      "text": "I can relate to this, I've written like 4 different essays at this point and they're all so bad😭I don't know how to show who I am in my essay while still being palatable to an AO",
      "author": "Boardstill",
      "created": 1635635368,
      "upvotes": 12,
      "replies": {
        "hir2911": {
          "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hir2911/",
          "text": "exactlY! threading that line of being authentic and also a 'good fit' for the colleges i'm applying to is proving near impossible",
          "author": "none_oya",
          "created": 1635677802,
          "upvotes": 1,
          "replies": {
            "hir42qc": {
              "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hir42qc/",
              "text": "Don't put everything or one thing take 2-3 things with a major theme and distribute them in your essays. The major theme will help connect them all and the particular things could showcase your qualities.",
              "author": "Clashers316",
              "created": 1635679202,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiqghtn": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hiqghtn/",
      "text": "The middle of my essay is doing good. But the ending is meh, and the intro has 0 hook. I think my current hook is better, but I still doubt it a little. I'm really confused on my ending. I'll have to grind it out tomorrow i guess.",
      "author": "Maanavdv",
      "created": 1635659587,
      "upvotes": 6,
      "replies": {}
    },
    "hirzp2i": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hirzp2i/",
      "text": "This would be too late for EA but this is how my English teacher had us do it.\n\n1. Write a list of at least 30 topics you could write about (it may get pretty difficult but keep trying till you get there, my essay ended up being on something that was so niche I would not have remembered it if It wasn’t for this)\n\n2. Write one or two sentences about each topic \n\n3. Eliminate 20 topics\n\n4. Combine any topics similar enough that they could be the same essay (optional)\n\n5. Ask others from the remaining topics what they like, take it with a grain of salt. Try to go slowly and eliminate until you are left with 1-3 topics\n\n6. Make outlines for each topic and finally decide on the best one",
      "author": "Existing-Ad7318",
      "created": 1635696390,
      "upvotes": 3,
      "replies": {}
    },
    "hiq123g": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hiq123g/",
      "text": "You say that you are a bitch. Did you have to advocate for yourself? Someone else? Are you persistent? Spin it to why. Just tell one story.",
      "author": "Perplexed-Owl",
      "created": 1635649533,
      "upvotes": 2,
      "replies": {}
    },
    "hiq8loy": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hiq8loy/",
      "text": "You got plenty of time for RD to get this done.  \n\n\nI can give you pro bono advice since it sounds like you're really trying to do a good job.",
      "author": "stories_as_models",
      "created": 1635653958,
      "upvotes": 2,
      "replies": {
        "hir2ec2": {
          "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hir2ec2/",
          "text": "haha i'm applying to one of my targets EA unfortunately. i have time to fine tune the essay for every other college but",
          "author": "none_oya",
          "created": 1635677918,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiqu4yf": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hiqu4yf/",
      "text": "It’s not a summary of your life story… it’s supposed to be literally one moment of your life",
      "author": "RandomWilly",
      "created": 1635671051,
      "upvotes": 2,
      "replies": {}
    },
    "hiskpzi": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hiskpzi/",
      "text": "the \"huge bitch\" part spoke to my soul",
      "author": "lisxso",
      "created": 1635705337,
      "upvotes": 2,
      "replies": {}
    },
    "hiq6ht5": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hiq6ht5/",
      "text": "SAME",
      "author": "frozenshawtyhaha",
      "created": 1635652654,
      "upvotes": 1,
      "replies": {}
    },
    "hk4q5b2": {
      "link": "/r/ApplyingToCollege/comments/qjcb40/wrote_an_essay_sucks_ass/hk4q5b2/",
      "text": "same i really hate essays too im writing essay for osslt so no time for game i wrote a newspaper article well shitty teacher gave me 33 percent",
      "author": "Key-Transportation80",
      "created": 1636585181,
      "upvotes": 1,
      "replies": {}
    }
  }
}