{
  "sid": "q4zlga",
  "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/",
  "title:": "Reminder from a College Junior",
  "text": "I used to browse this sub pretty extensively, let’s say 3-4 years ago. Even then, people’s applications were competitive af. I didn’t realize my ambitions until the 11th grade, and by then it was too late to build an impressive CV. I didn’t break 1500 on my SAT. \n\nIt’s fine to not get into the Ivy’s or the T20s. You can begin grinding at state school, get good grades, make connections, get LORs for internships and all that. There’s no rule of thumb that says you had to go to SUNY Ithaca or UC Hicago or 🅱️ama (is that still a thing here?). The college that offered me a scholarship isn’t even nationally ranked, but I came freshman year determined to work my tail off and be the best premed I could be. Research labs, clinical exposure, high GPA, you name it and I strove for it. I’m planning on attempting to apply to medical school this Spring, so hopefully that goes well. \n\nJust a well-being reminder that life won’t end if Ivy day doesn’t go your way (bars!). In fact, the chip on your shoulder from not getting into your dream school can be channeled into positive energy to working even harder in college. As you all get ready to start getting some decisions, I just wanted to say good luck.",
  "author": "BioChem-Bro",
  "created": 1633833930,
  "updated": 1634073478,
  "over_18": false,
  "upvotes": 86,
  "upvote_ratio": 0.99,
  "comments": {
    "hg2jz73": {
      "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg2jz73/",
      "text": "Many people on this sub think undergrad is everything. Like, it’s not. You can go to a mediocre school, grind a lot, and get into a good graduate school later on.",
      "author": "Anonymmmous",
      "created": 1633842801,
      "upvotes": 23,
      "replies": {
        "hg2rtg7": {
          "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg2rtg7/",
          "text": "Not all of us are interested in graduate school ofc. Especially us in CS.",
          "author": "Berkeley_Simp",
          "created": 1633848648,
          "upvotes": 13,
          "replies": {
            "hg3n40x": {
              "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg3n40x/",
              "text": "CS is a good example of a field where you matter much more than your school. Getting interviews is based on your projects. Passing interviews is based on your technical performance. Sure it might be slightly easier for your resume to get an initial screen coming from MIT , but if you prove you’re a competent coder by doing impressive non trivial projects you can go anywhere and get interviews. Compared to say IB/Consulting where school and GPA are pretty much most important factors.",
              "author": "pianoloverkid123456",
              "created": 1633872270,
              "upvotes": 12,
              "replies": {
                "hg4pape": {
                  "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg4pape/",
                  "text": "A lot of top firms pretty much only recruit from top schools. Jane Street barely recruits from Berkeley and doesn’t recruit from UCLA for example.",
                  "author": "Berkeley_Simp",
                  "created": 1633889375,
                  "upvotes": 1,
                  "replies": {
                    "hg4qhnu": {
                      "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg4qhnu/",
                      "text": "That again just isn’t true. Correlation != Causation \n. Jane Street doesn’t even require a college degree. You can get into Jane street from an unknown state school if you have the right resume and can pass the interviews. Source my friend went 2Sig SWE —> JS quant and he doesn’t go to an elite school. Being at a place like MIT you’re not gonna get in on school name alone , and will get rejected resume round without something notable. Now of course JS likes things like IMO medalists of which there are very high concentrations at MIT . Those people are more likely to get interviews and more likely to pas them because they’re smart enough to be IMO medalists. They’d be able to achieve the same thing had they gone to their local state school.",
                      "author": "pianoloverkid123456",
                      "created": 1633889867,
                      "upvotes": 0,
                      "replies": {
                        "hg4qs5e": {
                          "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg4qs5e/",
                          "text": "Jane Street is a very elitist firm that only physically goes to specific target schools for a reason. It’s not impossible to get in from an no name state school as I have seen people that have on r/CSMajors, but it’s incredibly difficult.",
                          "author": "Berkeley_Simp",
                          "created": 1633889987,
                          "upvotes": 4,
                          "replies": {
                            "hg4rgm7": {
                              "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg4rgm7/",
                              "text": "It’s incredibly difficult because no name state schools have lower quality students. I promise you if you have the resume to get a JS interview and the ability to pass their interviews (which 99% of people do not) you can get in  from any or no college. \n\nThis is in contrast to something like banking at Goldman , you don’t really have to be smart for. It’s mostly just networking, knowing some finance technicals , and performing well in behaviorals. \n\nPlaces like JS it’s almost 100% your mathematical ability",
                              "author": "pianoloverkid123456",
                              "created": 1633890268,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hg2rsfo": {
      "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg2rsfo/",
      "text": "What's 🅱️ama? 👀\n\nAlso I assume SUNY Ithaca is Cornell lmaoo",
      "author": "Berkeley_Simp",
      "created": 1633848627,
      "upvotes": 5,
      "replies": {
        "hg41ogj": {
          "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg41ogj/",
          "text": "University of Alabama.",
          "author": "vaeporwave",
          "created": 1633879270,
          "upvotes": 5,
          "replies": {
            "hg4p3hc": {
              "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg4p3hc/",
              "text": "Ohh lmaoo",
              "author": "Berkeley_Simp",
              "created": 1633889294,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hg4vosv": {
          "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg4vosv/",
          "text": "Southwestern Alabama CC of course.  Roll tadpoles",
          "author": "JP2205",
          "created": 1633892008,
          "upvotes": 5,
          "replies": {
            "hg4x8v5": {
              "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg4x8v5/",
              "text": "💀",
              "author": "Berkeley_Simp",
              "created": 1633892654,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hg3zvr5": {
          "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg3zvr5/",
          "text": "🐘 roll tide baby",
          "author": "spacelemonadecadet",
          "created": 1633878440,
          "upvotes": 2,
          "replies": {}
        },
        "hg52bzl": {
          "link": "/r/ApplyingToCollege/comments/q4zlga/reminder_from_a_college_junior/hg52bzl/",
          "text": "roll tide",
          "author": "edgymemesalt",
          "created": 1633894752,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}