{
  "sid": "q5hbau",
  "link": "/r/ApplyingToCollege/comments/q5hbau/is_it_too_late_to_build_up_on_extracurriculars/",
  "title:": "Is it too late to build up on extracurriculars?",
  "text": "I am a junior currently, and I have no extensive extracurricular activities. The longest thing I have on my resume is half  a year serving as the founder/president of a club I made back in February. I was also an intern and officer for half a year for two bigger clubs (red cross and key club), but have quit since then. I want to build up my extracurricular profile, not just for college, but as for being exposed to different career fields too. I'm most interested in extracurriculars that pertain math and/or anything related to vehicles and aircrafts. Sadly, my school doesn't have a math team nor anyone who is willing to become part of it.\n\n Where do I start?",
  "author": "Alert-Demand3606",
  "created": 1633901686,
  "updated": 1634073502,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hg5kj7m": {
      "link": "/r/ApplyingToCollege/comments/q5hbau/is_it_too_late_to_build_up_on_extracurriculars/hg5kj7m/",
      "text": "What do you do with your time when not in class or doing homework? Do you have hobbies? A part-time job? You might be thinking of ECs too narrowly and do in fact have some.",
      "author": "renebeca",
      "created": 1633902250,
      "upvotes": 2,
      "replies": {
        "hg5lnhf": {
          "link": "/r/ApplyingToCollege/comments/q5hbau/is_it_too_late_to_build_up_on_extracurriculars/hg5lnhf/",
          "text": "I recently got really into cars and math concepts, but I haven't done anything tangible with those interests, just youtube videos and practicing on the whiteboard. I also sometimes build lego sets if there are any available, but thats a once in a couple months type of thing. Is there anything I can do with the things I listed?",
          "author": "Alert-Demand3606",
          "created": 1633902743,
          "upvotes": 1,
          "replies": {
            "hg5n6ht": {
              "link": "/r/ApplyingToCollege/comments/q5hbau/is_it_too_late_to_build_up_on_extracurriculars/hg5n6ht/",
              "text": "Sound cool! For the cars/math > see if there's a society of car engineers and join as a student member. I bet they are having some virtual events; attend a few. Write about what topics you liked more (and wish to explore in college). \n\nFor example: [https://www.sae.org/](https://www.sae.org/)\n\nFor the lego sets, that's great because it backs up your interest in \"building things.\" Check out Lego Education: [https://education.lego.com/en-us/discover#confidence](https://education.lego.com/en-us/discover#confidence)",
              "author": "renebeca",
              "created": 1633903436,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg5mukn": {
      "link": "/r/ApplyingToCollege/comments/q5hbau/is_it_too_late_to_build_up_on_extracurriculars/hg5mukn/",
      "text": "Never to late! Junior year onward is probably the most important in terms of extracurriculars in the eyes of AO’s, so devote your attention to specific things that you like. Try to start looking for opportunities during the summer as well :) math is a very diverse field that is applicable in most areas, could you give more insight on what you’re interested in doing with math so I can give you more specific suggestions?\n\nEdit: don’t forget to have fun, although it may not seem like it, for the most part EC’s, grades, etc. become irrelevant once you reach uni so make some memories that would last. Obviously it’s great that you are thinking of EC’s and academia, but just remember to balance things out. Good luck <3",
      "author": "6_62607004",
      "created": 1633903288,
      "upvotes": 2,
      "replies": {}
    },
    "hg5otsp": {
      "link": "/r/ApplyingToCollege/comments/q5hbau/is_it_too_late_to_build_up_on_extracurriculars/hg5otsp/",
      "text": "See if there is a FIRST Robotics Competition or FIRST Tech Challenge team in your area.",
      "author": "jjhoster",
      "created": 1633904186,
      "upvotes": 2,
      "replies": {}
    },
    "hg5tqfa": {
      "link": "/r/ApplyingToCollege/comments/q5hbau/is_it_too_late_to_build_up_on_extracurriculars/hg5tqfa/",
      "text": "Better late than never.",
      "author": "Tarzan1415",
      "created": 1633906369,
      "upvotes": 2,
      "replies": {}
    },
    "hg5zlua": {
      "link": "/r/ApplyingToCollege/comments/q5hbau/is_it_too_late_to_build_up_on_extracurriculars/hg5zlua/",
      "text": "no literally all of my extracurriculars were in my second semester / summer of junior year and i ended up at a t25. as long as you have genuine interest in them and can convey something about your character they will see that as good",
      "author": "orbitingyou",
      "created": 1633909045,
      "upvotes": 2,
      "replies": {}
    }
  }
}