{
  "sid": "quicve",
  "link": "/r/ApplyingToCollege/comments/quicve/i_wish_someone_had_warned_me_about_transferring/",
  "title:": "I wish someone had warned me about transferring",
  "text": "I didn’t have a great time applying to colleges when I was a senior. I really wanted to go to College B because of the location, but chose College A because i thought it was the wiser chose since it was more of a college town and I wanted the “college experience”. I honestly thought I was being smart for choosing what I thought would be more sociable rather than a location I really liked. \n\nTurns out I hate the “college experience” and I do not like it here at College A. When I was first trying to make my choice a lot of people told me “you can always just transfer!”. They didn’t tell me that I have to have 60 credits in order to transfer literally anywhere (I can only attend UCs and CSUs). Including College B \n\nI’m really bummed that I need to be in this sucky town for even a semester longer than I planned to. I wish I hadn’t been such an idiot and chose the right college when I was a freshman.",
  "author": "GrandBumblebee",
  "created": 1636988484,
  "updated": 1637179617,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.95,
  "comments": {
    "hkqfg4u": {
      "link": "/r/ApplyingToCollege/comments/quicve/i_wish_someone_had_warned_me_about_transferring/hkqfg4u/",
      "text": "Could you do the rest of your three semesters at a community college near your home or the college where you want to be?",
      "author": "admissionsmom",
      "created": 1636992845,
      "upvotes": 6,
      "replies": {}
    },
    "hkrjoff": {
      "link": "/r/ApplyingToCollege/comments/quicve/i_wish_someone_had_warned_me_about_transferring/hkrjoff/",
      "text": "https://admission.universityofcalifornia.edu/admission-requirements/transfer-requirements/preparing-to-transfer/other-types-of-transfers.html\n\n“Lower-division transfers\nSome campuses admit a limited number of transfer students before they reach junior standing. You’ll need to check the website of the UC campus you’re considering to learn if they will accept applications from lower-division transfers.”\n\nSome UCs will accept lower division transfer students, but it’s school/major specific. I haven’t looked at CSUs but perhaps they also have some options.",
      "author": "pixelatedpix",
      "created": 1637008778,
      "upvotes": 3,
      "replies": {}
    }
  }
}