{
  "sid": "qugn2f",
  "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/",
  "title:": "International student",
  "text": "I am from Kyrgyzstan, currently studying in 10th grade. I want to study in US and next year I'll start applying. So I have some questions. How many Universities should I apply to to get at least accepted in one them(currently my main goal is Caltech, but I guess I'll also apply to some lower rank schools)? I don't understand how does financial aid work, and how to get it. And what difficulties international student can have in applying to a public vs private schools. I would be grateful if someone answered to those questions.",
  "author": "thealbey",
  "created": 1636983534,
  "updated": 1637179726,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hkpxdu5": {
      "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkpxdu5/",
      "text": "public schools almost give no financial aid, but overall, it's really hard to get into any US unis with financial aid.",
      "author": "helpmewithsciencepls",
      "created": 1636984787,
      "upvotes": 6,
      "replies": {}
    },
    "hkq2x1y": {
      "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkq2x1y/",
      "text": "Check out r/IntltoUSA, a community for international students applying to colleges abroad!",
      "author": "rama2476",
      "created": 1636987449,
      "upvotes": 5,
      "replies": {}
    },
    "hkq9a3k": {
      "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkq9a3k/",
      "text": "Gonna be tough to distinguish yourself for the likes of  Caltech",
      "author": "Applying_in_2021",
      "created": 1636990281,
      "upvotes": 5,
      "replies": {
        "hkq9q0x": {
          "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkq9q0x/",
          "text": "What about MIT/Stanford? Is there a bigger chance to be accepted by these?",
          "author": "thealbey",
          "created": 1636990469,
          "upvotes": 0,
          "replies": {
            "hkqaky9": {
              "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkqaky9/",
              "text": "dude these are the **top universities in the world**. not so easy to get into them\n\nPS. getting into these schools is so tough, forget about financial aid",
              "author": "Arnavsmayan",
              "created": 1636990834,
              "upvotes": 7,
              "replies": {
                "hkqb5j6": {
                  "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkqb5j6/",
                  "text": "Yes, I realize that. I meant relatively bigger chances, I am asking because he specialized Caltech in comment.",
                  "author": "thealbey",
                  "created": 1636991074,
                  "upvotes": -1,
                  "replies": {
                    "hkqf1ka": {
                      "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkqf1ka/",
                      "text": "same ... what is this you will be selling to those schools? \n\nAcceptance rates are so low ... I don't even know what it takes to get in there ... I know so many perfect grades perfect scores kids who (US based) who don't get in ... and for an international to pique their interest you have to be SOMETHING that's why I asked about Chess and Olympiads - those are nice hooks ... my buddy was a US HighSch Chess Champion ... so he got into MIT and Harvard ... \n\nWhat are your hooks?",
                      "author": "Applying_in_2021",
                      "created": 1636992679,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hkqvvlo": {
      "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkqvvlo/",
      "text": "If you think your stats are good, you have amazing EC s that can impress the Admission Officers and stellar essays alongside well-written recommendation letters from your teachers/employers or whoever you choose, you should consider applying to the most prestigious universities, including so called Ivy League to have a chance for a substantial financial aid to cover your college expenses. The reason why I am mentioning these highly prestigious colleges is that these are the only ones that are need-blind for international students. What I mean by need-blind is that your financial status does not affect the chances of your admission, whereas applying to a need-aware college, while also in need of aid of considerable amount, can negatively affect your chances, even reducing to none in some cases. These are the only colleges that are need-blind for international students.\nMIT\nPrinceton University (IVY)\nAmherst College\nHarvard University (IVY)\nYale University (IVY)\nMinerva schools at KGI (not sure about this one, but you can check.)\nThe process of applying for financial aid is essentially the same for international students as for US students (filling the out CSS profile, sending documents to your institutions through IDOC if they request any. You can find more information on their websites) except you cannot submit FAFSA which grants federal aid to US citizens or eligible non-US citizens. That’s why it’s basically private colleges offering need blind financial aid as they tend to have a budget well-supported by many donors. Sending a financial application is a separate process usually with a different deadline. \nDon’t freak out if you think you won’t get into any of these IVY league colleges. Many students don’t. By saying many I mean nearly 94-95 % of applicants. Amherst and Minerva should be less competitive as far as I know, so you have a shot. There are also other low-ranked colleges you can look into, do your research and find those that offer merit scholarships (not financial aid, but a scholarship) to students with good academic standing or extracurricular involvement with a higher acceptance rate. There also need-based scholarships, again with separate applications. Merit scholarships are in many cases awarded based on your initial application automatically. So always be sure to check everything on the website of the college you are applying to. There will always be some options with a good amount of aid and scholarship offers. So do your research and take your time. Try to have some impressive EC s and good grades (SAT score) at this point. \nWish you good luck!",
      "author": "Professional_Net_651",
      "created": 1636999394,
      "upvotes": 2,
      "replies": {
        "hkqwp5e": {
          "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkqwp5e/",
          "text": "Thank you for the answer!",
          "author": "thealbey",
          "created": 1636999716,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkq0n8s": {
      "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkq0n8s/",
      "text": "Are you an IMO or IPHO medalist? \nChess Grandmaster?",
      "author": "Applying_in_2021",
      "created": 1636986383,
      "upvotes": 1,
      "replies": {
        "hkredlr": {
          "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkredlr/",
          "text": "The vast majority of international who get into top US schools don't have those accolades. Although most do have some kind of national level skill/award but it can be in anything.",
          "author": "OutrageousStrength15",
          "created": 1637006694,
          "upvotes": 2,
          "replies": {}
        },
        "hkq0rhc": {
          "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkq0rhc/",
          "text": "No.",
          "author": "thealbey",
          "created": 1636986439,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkrfjks": {
      "link": "/r/ApplyingToCollege/comments/qugn2f/international_student/hkrfjks/",
      "text": "Public/ state schools don’t give financial aid to international students, however, there are many top tier private colleges like the ivies that meet 100% of your needs…but u need to do well on your SATs and at school to be able to get into those schools.",
      "author": "IndividualChef9936",
      "created": 1637007158,
      "upvotes": 1,
      "replies": {}
    }
  }
}