{
  "sid": "qndmpb",
  "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/",
  "title:": "My essay was too rough",
  "text": "Sometimes I read “Essays that worked for the Ivy League” and get frustrated. They are all so complex to understand, with high-tier vocabulary and sometimes even weirdly written (from what is considered correct). \n\nMy essay was well-written but too rough. I went straight to the point and wrote about the illness that fucked up my entire High School ride. Nevertheless, kids on the Ivy League essays never do that. It’s always a random cryptic metaphore that takes you years to understand.\n\nMaybe I’m too dumb and my essay is purely shit. #help",
  "author": "javznotjavz",
  "created": 1636126272,
  "updated": 1636154945,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.94,
  "comments": {
    "hjff4nd": {
      "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjff4nd/",
      "text": "That “essays that worked” stuff is cherry picked as fuck. I can guarantee (based on how some of the students write at a certain Ivy) that most essays from people who got in are not creative masterpieces.",
      "author": "Lil-pants",
      "created": 1636127260,
      "upvotes": 11,
      "replies": {
        "hjfowcl": {
          "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjfowcl/",
          "text": "I sure hope so. I felt decently well about my personal statement till i saw some examples online.",
          "author": "brick7083",
          "created": 1636131006,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjfcvwx": {
      "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjfcvwx/",
      "text": "Are you only trying for those schools?",
      "author": "mommacat94",
      "created": 1636126390,
      "upvotes": 3,
      "replies": {
        "hjfd1dj": {
          "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjfd1dj/",
          "text": "Nope! But I’m an International needing aid, so a stellar essay worries me. :(",
          "author": "javznotjavz",
          "created": 1636126447,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hjg4kj3": {
      "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjg4kj3/",
      "text": "Half the essays from that book are hot garbage, anyways. They don’t tell anything meaningful—it’s mostly fluff, and like you said— cryptic metaphors.",
      "author": "Bouncyslime",
      "created": 1636137053,
      "upvotes": 27,
      "replies": {
        "hjg9i5u": {
          "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjg9i5u/",
          "text": "I want to add fancy writing ≠ sophisticated style. More often than not, it’s executed poorly and reads even worse. Be clear and plain, but try to convey some depth in your message.",
          "author": "Bouncyslime",
          "created": 1636138930,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hjgd5xg": {
      "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjgd5xg/",
      "text": "imo the best essays are the ones that say something about strong about you in a concise and effective manner, since you only have 650 words. Mine is very straightforward in that there are no weird metaphors and the language is fairly easy to understand (I wrote it in a way that’s similar to the way I talk), but it does tell a cohesive plot. I literally wrote my personal statement in an hour by accident in April lmao. it does not need to be (and probably shouldn’t be) super artistic, but it should say something about you and it should be authentic. If you sound like yourself you’re in great shape :)",
      "author": "madmastermoonman",
      "created": 1636140290,
      "upvotes": 8,
      "replies": {}
    },
    "hjgrvtw": {
      "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjgrvtw/",
      "text": "Common misconception. Most actual application essays are not poetic and are just like how you described yours- straight to the point, clear- not something that sounds like it could win a Pulitzer. Content matters infinitely more than style.\n\nImagine if you got into a top school and were given the opportunity to publish your essays. You don't actually know which ones got you into the school- if they were even the deciding factor. You'd beeline for your fanciest sounding one. That's exactly how these essays were selected.",
      "author": "ashtree_c",
      "created": 1636145800,
      "upvotes": 7,
      "replies": {}
    },
    "hjgcrq5": {
      "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjgcrq5/",
      "text": "**THIS.**\n\nIt takes me two reads to even comprehend what the essays in \"essays that worked\" say.",
      "author": "makarov_skolsvi",
      "created": 1636140140,
      "upvotes": 4,
      "replies": {}
    },
    "hjgc040": {
      "link": "/r/ApplyingToCollege/comments/qndmpb/my_essay_was_too_rough/hjgc040/",
      "text": "part of a “good” essay is having that (honestly a little manipulative) argumentative writing skill",
      "author": "localramenconsumer",
      "created": 1636139854,
      "upvotes": 2,
      "replies": {}
    }
  }
}