{
  "sid": "qy7cw9",
  "link": "/r/ApplyingToCollege/comments/qy7cw9/very_unorthodox_music_supplements_music_production/",
  "title:": "Very Unorthodox music supplements - Music Production.",
  "text": "Hey, dear fellow applicants.\n\nDo music supplements really boost your application, especially since mine is very unorthodox? The thing is that I am a music producer and don't play any solo real instruments, which may, or may not, catch my reviewers off-guard. Most of my work is done through a Digital Audio Workstation, and it's how most of the modern Rap/Pop/RnB songs in your playlist are made. I even put a huge disclaimer at the beginning of my music submission essay mentioning the fact that I was rather very hesitant about whether to submit my art or not. I also went right ahead and put my personal IG that showcases pretty much my entire work, in addition to the submitted material. In a nutshell, It felt like applying as a contemporary/classical artist while my whole application is about digital art, caricatures, and comic book drawing. Music production is a very intrinsic part of my identity that I completely developed on my own, so it was pretty much the main hook/spike of my application.\n\nWho over was in such a situation, do you think reviewers, considering that they're mostly coming from regular musical backgrounds such as orchestral music, will see my music application as something very interesting or will just disregard me because of the nature of my art?\n\nUp until here? Then thank you so much for your time reading this. I appreciate it!",
  "author": "The_Adam07",
  "created": 1637420592,
  "updated": 1637688434,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hle5mnb": {
      "link": "/r/ApplyingToCollege/comments/qy7cw9/very_unorthodox_music_supplements_music_production/hle5mnb/",
      "text": "It can help, depending on what you want to study.\n\nIf you are planning on majoring in music it might not meet the audition requirement -- U Miami for example has a music engineering program where they will take a portfolio of creative work (which I think this fits for sure), but they still require an audition in a primary instrument.",
      "author": "BrawnyAcolyte",
      "created": 1637421693,
      "upvotes": 1,
      "replies": {
        "hle7ni0": {
          "link": "/r/ApplyingToCollege/comments/qy7cw9/very_unorthodox_music_supplements_music_production/hle7ni0/",
          "text": "I clearly mentioned  in the musical essays my intention to pursue a minor in music and expand my skillset beynd digital music production and have proper, formal education rather than the self-teaching experience i went thru. The problem that s keeping me frustrated is the review process haha. I really hope faculty reviewers understand my art. I eded a top 10 lib arts btw.",
          "author": "The_Adam07",
          "created": 1637422610,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}