{
  "sid": "q9am4i",
  "link": "/r/ApplyingToCollege/comments/q9am4i/will_any_foreign_universities_accept_me_if_i_have/",
  "title:": "will any foreign universities accept me if I have a low GPA? but good extracurricular and good outside knowledge?",
  "text": "I'm an Indian high school student who wants to study abroad for undergraduate,\n\nmy GPA was never good, my secondary school GPA was 2.88/ 72% and high school seems even harder so I'm not expecting more than 2.88, I feel like it might drop to 2.3-2.5, no matter how hard I try to raise my GPA, it will never go up! so I just want to know will any university even consider me if I apply? I might not have a lot of book knowledge but I have done a few courses on Coursera and other platforms, my extracurricular is good, I have pretty good knowledge about computer hardware and software and good knowledge about loudspeakers too and basic electronics knowledge, I'm also a DIY enthusiast, made a lot of projects before I was 15. but I don't have anything to support most of what I know and have done! so I would like to know if universities will select me at all? also, the fact I'm quite on a budget, and English teaching universities only don't seem to help!\n\nmy preferred countries are: (as order)\n\n\\-South Korea\n\n\\-Canada\n\n\\-UK\n\n\\-US\n\n\\-Europe\n\nI'm open to most countries but I would like to stick to South Korea.",
  "author": "WelderSpirited3027",
  "created": 1634385621,
  "updated": 1634423148,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.84,
  "comments": {
    "hguzsnq": {
      "link": "/r/ApplyingToCollege/comments/q9am4i/will_any_foreign_universities_accept_me_if_i_have/hguzsnq/",
      "text": "if you don't have evidence or if it was personal then probably not. Sat is sort of meaningless since now it's test optional and it was meant to see if students met their benchmarks.",
      "author": "Nicholas_Eggs_Nip",
      "created": 1634392654,
      "upvotes": 0,
      "replies": {
        "hgv5u70": {
          "link": "/r/ApplyingToCollege/comments/q9am4i/will_any_foreign_universities_accept_me_if_i_have/hgv5u70/",
          "text": ">Sat is sort of meaningless since now it's test optional \n\nNot true",
          "author": "Unfair_Purchase7588",
          "created": 1634395708,
          "upvotes": 9,
          "replies": {}
        },
        "hgv1ppj": {
          "link": "/r/ApplyingToCollege/comments/q9am4i/will_any_foreign_universities_accept_me_if_i_have/hgv1ppj/",
          "text": "I don't have all the evidence, but I have for most of them, the major ones! like in cs and audio engineering(fundamentals)",
          "author": "WelderSpirited3027",
          "created": 1634393668,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}