{
  "sid": "qf3s2l",
  "link": "/r/ApplyingToCollege/comments/qf3s2l/princeton_scea_question/",
  "title:": "Princeton SCEA Question...",
  "text": "I read a post on this sub (or maybe it was a similar sub?) where somebody mentioned that if you apply to Harvard SCEA you can't apply to another private university for scholarship consideration if it's earlier than the RD date (i.e. USC's December 1st scholarship consideration date vs. their January 1st RD date).\n\nI was wondering if the same thing applied to Princeton, the school that I am SCEA-ing too, but could not find anything anywhere on the Princeton website or FAQs. Does anybody have any ideas about whether applying for scholarship consideration early is barred under SCEA for Princeton (assuming scholarship consideration is nonbinding).",
  "author": "l1dub",
  "created": 1635117638,
  "updated": 1635182742,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhxas5b": {
      "link": "/r/ApplyingToCollege/comments/qf3s2l/princeton_scea_question/hhxas5b/",
      "text": "You can apply to any school RD before Dec. 1, including USC. You can apply to Princeton SCEA and USC RD at the same time. In fact, you can finish all your applications before Nov. 1. In case you get into Princeton, the only thing you'll lose is the application fees to your RD schools.",
      "author": "JJKKLL10243",
      "created": 1635118817,
      "upvotes": 3,
      "replies": {}
    },
    "hhxjk7a": {
      "link": "/r/ApplyingToCollege/comments/qf3s2l/princeton_scea_question/hhxjk7a/",
      "text": "The three bullet points outlining the criteria for REA/SCEA on each school‘s website are written at about the 5th grade reading level. If you’re Princeton-material, deciphering them should not be a problem.\n\n😎",
      "author": "Strict-Special3607",
      "created": 1635123264,
      "upvotes": 0,
      "replies": {
        "hhxk5qu": {
          "link": "/r/ApplyingToCollege/comments/qf3s2l/princeton_scea_question/hhxk5qu/",
          "text": "\"\n\nIf you apply single-choice early action, also known as restrictive early action, on Nov. 1, you may not apply to an early program at any other private college or university.  However, please note the following:\r  \n\r  \n\\- You may apply early to any public institution or service academy, as long as the decision is nonbinding.\r  \n\\- You may apply early to any international institution, as long as the decision is nonbinding.\r  \n\\- You may apply early to any college or university with a nonbinding rolling admission process.\n\n\"\n\nClearly the last three don't apply, but is applying early for scholarship consideration count as an early program? That's the question I'm looking to answer.",
          "author": "l1dub",
          "created": 1635123569,
          "upvotes": 1,
          "replies": {
            "hhxmah4": {
              "link": "/r/ApplyingToCollege/comments/qf3s2l/princeton_scea_question/hhxmah4/",
              "text": ">That's the question I'm looking to answer.\n\nI guess I was wrong.\n\nOr…\n\n😎\n\nSubmitting an application early enough to qualify for scholarship consideration is not “an early program.”",
              "author": "Strict-Special3607",
              "created": 1635124641,
              "upvotes": 1,
              "replies": {
                "hhxn7f3": {
                  "link": "/r/ApplyingToCollege/comments/qf3s2l/princeton_scea_question/hhxn7f3/",
                  "text": "I hope so 😂",
                  "author": "l1dub",
                  "created": 1635125105,
                  "upvotes": 1,
                  "replies": {
                    "hhxnf0d": {
                      "link": "/r/ApplyingToCollege/comments/qf3s2l/princeton_scea_question/hhxnf0d/",
                      "text": "You’re simply submitting your RD application 45 days before the deadline.\n\n😎",
                      "author": "Strict-Special3607",
                      "created": 1635125212,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}