{
  "sid": "qyywi1",
  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/",
  "title:": "Accepted to 3 Colleges & No Support from Parents",
  "text": "Hello! I got accepted to 3 colleges (Penn State, Arizona State, & Temple Uni), and my parents are really mad at me. They are not listening to me at all. My parents are saying that I didn't ask for a scholarship on the common app essay or the supplement that I wrote when I applied to college. So because of that, I didn't get one.\n\nBut, I'm trying to tell my parents that's not how the system works. There are two different departments. The admissions officers just decide whether or not I get accepted. And the other department for the school deals with aid & scholarships.\n\nUpon my acceptance, I got an email explaining the financial aid and scholarships, and deadlines.\n\nAm I wrong? My parents think that my college journey is over. My dad is cussing at me and he's saying that I'll be in debt. (I'm from a low-income family so I cannot afford college at all.)\n\nMy dad is completely losing it. He has no clue about college admissions. And now he's trying to make me specifically say in my future college applications that \"I Need a scholarship\". It's like he's losing brain cells. Writing that in your application is not going to do anything at all. I'm tired of his outdated information. My mother is supporting my dad 100%.\n\nAlso, when I first told my parents of my acceptance they never congratulated me. They just said \"It's easy to get accepted, but did you get a sCholArShIp?\"",
  "author": "TheGoodie",
  "created": 1637513201,
  "updated": 1637687306,
  "over_18": false,
  "upvotes": 699,
  "upvote_ratio": 0.98,
  "comments": {
    "hlj4mta": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlj4mta/",
      "text": "Your parents are wrong.\n\nYou are correct: “that’s not how the system works.”\n\nShow them the page on each school‘s website where it describes the scholarship process/criteria.\n\nPS - based on your parents saying to write “I NEED a scholarship” it also sounds like they don’t understand the difference between need-based financial aid and merit-based scholarships.",
      "author": "Strict-Special3607",
      "created": 1637515366,
      "upvotes": 504,
      "replies": {
        "hljcu9h": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljcu9h/",
          "text": "They really don't and I don't know how to convince them both. My dad is a narcissist so I  think there's no point in trying to convince him. But, I'll show him the page that describes the scholarship process. My mom has no mind of her own and she just follows my dad.",
          "author": "TheGoodie",
          "created": 1637518713,
          "upvotes": 160,
          "replies": {
            "hljwl9d": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljwl9d/",
              "text": "Have them speak with your counselor",
              "author": "SerenityChoice",
              "created": 1637526472,
              "upvotes": 63,
              "replies": {}
            },
            "hljv66b": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljv66b/",
              "text": "> My dad is a narcissist \n\nr/raisedbynarcissists",
              "author": "peepjynx",
              "created": 1637525904,
              "upvotes": 39,
              "replies": {
                "hlk4u5k": {
                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk4u5k/",
                  "text": "It's a high schooler diagnosing his parents. I would take this with a grain of salt.",
                  "author": "william14537",
                  "created": 1637529774,
                  "upvotes": -19,
                  "replies": {
                    "hlk5d5b": {
                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk5d5b/",
                      "text": "I was once a high schooler with recognizably narcissistic parents. One was worse than the other, in fact. I like to give kids the benefit of the doubt, they are always easily dismissed just for being young.\n\nPeople don't realize how many individuals are self-aware at a young age, but don't really have the processing ability to articulate what they are observing.\n\nWhatever the case, this individual's parents seem like not-so-great people. It's never to early to begin the journey of healing.",
                      "author": "peepjynx",
                      "created": 1637529992,
                      "upvotes": 65,
                      "replies": {
                        "hlk8cbi": {
                          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk8cbi/",
                          "text": "Thank you so much. I don’t know why some people ignore these signs just because it’s happening to a teenager. It’s weird because they wouldn’t do it to an adult, friend, or significant other but they’ll definitely do it to a child in a HEARTBEAT.",
                          "author": "TheGoodie",
                          "created": 1637531246,
                          "upvotes": 39,
                          "replies": {
                            "hlkfw0k": {
                              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkfw0k/",
                              "text": "I'm on your side. Trust. I know what it's like to not be taken seriously at a young age and it really fucked with me into adulthood. Don't be like me, don't carry that baggage. Don't allow yourself to be gaslit. I'm glad you recognize what's happening now. I'm glad that more people are talking about the situations children face when they have shit-for-brains parents. As a kid of the 80s/90s (who is only now returning to school because of a lack of parental encouragement/support), I wholeheartedly feel for where you're coming from.\n\nThere are a lot of resources out there these days. Work with the schools, take advantage of their resources. Don't wait for shit to come to you (I did this, and it set me back so many times) BE PROACTIVE. Email, call, fill out every form under the sun, write a boatload of essays. Do this like your life depends on it because it sounds like it does.\n\nAlso, CONGRATS! If you got into 3 schools, you're probably one smart cookie. Keep it up!",
                              "author": "peepjynx",
                              "created": 1637534482,
                              "upvotes": 18,
                              "replies": {
                                "hlkk8fw": {
                                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkk8fw/",
                                  "text": "Thank you so much! I appreciate the support and advice. ❤️ I wish you the best of luck in your school journey.",
                                  "author": "TheGoodie",
                                  "created": 1637536401,
                                  "upvotes": 13,
                                  "replies": {
                                    "hlkkrrd": {
                                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkkrrd/",
                                      "text": "Thanks!",
                                      "author": "peepjynx",
                                      "created": 1637536644,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "hlqtse7": {
                              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlqtse7/",
                              "text": "i feel you completely!! you would think that we would be able to tell if our goddamn parents were fucked up or not! my dad was a narcissist too, never believed anything i said to at contradicted him. i wish you luck with your current situation",
                              "author": "egg_mugg23",
                              "created": 1637653903,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "hlk799y": {
                          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk799y/",
                          "text": "I sincerely hope they get the fin aid to get out of that house and start their life.",
                          "author": "the_journeyman3",
                          "created": 1637530794,
                          "upvotes": 9,
                          "replies": {
                            "hlk7pf1": {
                              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk7pf1/",
                              "text": "Seriously.",
                              "author": "peepjynx",
                              "created": 1637530980,
                              "upvotes": 4,
                              "replies": {
                                "hlk7tm9": {
                                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk7tm9/",
                                  "text": "I grew up in a toxic household so I really empathize. College was my escape.",
                                  "author": "the_journeyman3",
                                  "created": 1637531028,
                                  "upvotes": 8,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "hlkbp46": {
                          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkbp46/",
                          "text": ">Whatever the case, this individual's parents seem like not-so-great people. It's never to early to begin the journey of healing.\n\nThey seem like working class low income parents who didn't go to college and therefore don't understand the process. They don't understand that it's tough to get accepted because they see college students everywhere working at McDonalds. They're probably worried for their child and their financial situation. They call them a narcissist and yet expects them to pay for college.",
                          "author": "Time_Candidate_8063",
                          "created": 1637532649,
                          "upvotes": -14,
                          "replies": {
                            "hlkenzr": {
                              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkenzr/",
                              "text": "First of all, I’m a woman.\n\nMy whole issue is that my parents do not understand the whole application and scholarship process. I’ve tried explaining to them about the process for months and they refuse to listen. I’ve talked to my aunt and teacher for confirmation and my parents DO NOT BELIEVE IT. I’ve called them a narcissist because of the abuse and gaslighting that I’ve endured for years.\n\nI NEVER said that I expected them to pay for my college tuition at all?",
                              "author": "TheGoodie",
                              "created": 1637533945,
                              "upvotes": 10,
                              "replies": {
                                "hlkkqut": {
                                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkkqut/",
                                  "text": "> I NEVER said that I expected them to pay for my college tuition at all?\n\nThen why do you care what they think? Why do they care about your plans?",
                                  "author": "Time_Candidate_8063",
                                  "created": 1637536633,
                                  "upvotes": -11,
                                  "replies": {
                                    "hlkxp18": {
                                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkxp18/",
                                      "text": "> Then why do you care what they think\n\nmaybe because she’s being yelled at and made to feel stupid in an environment she’s meant to be safe and loved in..? what?",
                                      "author": "un-taken_username",
                                      "created": 1637542521,
                                      "upvotes": 14,
                                      "replies": {}
                                    },
                                    "hll855r": {
                                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hll855r/",
                                      "text": "Dude are you straight up crazy or is your mother peeking at you?",
                                      "author": "InvictusHomo",
                                      "created": 1637547435,
                                      "upvotes": 9,
                                      "replies": {}
                                    },
                                    "hllcu9t": {
                                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hllcu9t/",
                                      "text": "lmao you seem like the kind to lick a boot. fuck off asshole.",
                                      "author": "Multimagination",
                                      "created": 1637549664,
                                      "upvotes": 4,
                                      "replies": {}
                                    },
                                    "hllw52i": {
                                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hllw52i/",
                                      "text": "R u like brain damaged or something?",
                                      "author": "barnedall",
                                      "created": 1637559976,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hlk7a54": {
                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk7a54/",
                      "text": "that isn't diagnosing someone lol people can be narcissistic, you don't need to go to fucking medical school for four years on top of some other bullshit to know that someone is self - grandios",
                      "author": "ballingout2215",
                      "created": 1637530804,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "hlk7la7": {
                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk7la7/",
                      "text": "I’m a woman but what does a “high schooler” have to do with anything? I’ve suffered physical and emotional abuse from my father.",
                      "author": "TheGoodie",
                      "created": 1637530931,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlj5kl3": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlj5kl3/",
      "text": "1. You're right, your parents are wrong.\n2. Not sure how to convince them.  Maybe hearing it out of the mouth of your high school counselor, or from a book, or (last resort) from the Admissions office at one of the schools that actually accepted you, might do the trick.\n3. To a limited degree this stuff is negotiable.  If the packages those schools gave you put them out of reach, then you can tell them that and see if they're willing to make it possible for you to attend. I would first \\*wait\\* to see what other offers come in, and to see if those schools actually sweeten their offers.  (This happens.)  Sometime in March or April of next year you may want to try requesting additional aid.\n4. If money is extremely tight, then you \\*may\\* have wanted to apply to some schools much less selective than those three that would have been likely to give you significant merit aid.  It \\*may\\* still be possible to apply those schools (but maybe not; they often have priority deadlines for merit.)  If so, then you could try applying to some.",
      "author": "jayphoward",
      "created": 1637515751,
      "upvotes": 57,
      "replies": {
        "hljbfi0": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljbfi0/",
          "text": "I've talked to my aunt and teacher about this and they both confirmed that I was right. My dad is extremely ignorant and he says how he used to work at the \"admissions office.\" \n\nYeah, I've applied to a lot of colleges in my state (Florida) for this reason. I'm also applying to a few LACs.\n\nMy parents were trying to make me apply to every prestigious uni (even the Ivy's) when I'm nowhere near qualified. Plus, I don't really care for them.",
          "author": "TheGoodie",
          "created": 1637518144,
          "upvotes": 32,
          "replies": {
            "hljguwz": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljguwz/",
              "text": "Being in Florida probably makes this more manageable for you than for the average student, given Bright Futures, Benacquisto and the generally low (full price) in-state tuition of Florida public schools.\n\nIf you're even close to being Ivy material then you can probably expect a non-trivial amount of merit aid at UCF/USF.  Maybe FSU as well.",
              "author": "jayphoward",
              "created": 1637520263,
              "upvotes": 26,
              "replies": {}
            }
          }
        }
      }
    },
    "hlj4xuo": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlj4xuo/",
      "text": "Um. I mean first of all, congratulations! Getting into college is *not* easy. There’s a reason so many people don’t go to college. Don’t let their financial stress ruin this momentous achievement in your life. \n\nSecond of all, you’re not wrong I believe. Additionally, your college career isn’t over before it starts. You now have a few options in front of you. I don’t know if any of these schools offer in-state tuition for you, but that makes it significantly cheaper. If you’re low-income, then FAFSA will also be incredibly helpful, and you will probably get some grants to help (as well as some subsidized loans). \n\nThe other option, which many don’t like, is you can go to community college and transfer to a 4 year. By far the cheapest option. But I would be communicative with each University and express your concern with money. Some may offer more scholarships and help lessen the burden. Also look for external scholarships as well.",
      "author": "cheesefries45",
      "created": 1637515491,
      "upvotes": 143,
      "replies": {
        "hljce5e": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljce5e/",
          "text": "I wasn't trying to choose a community college, because that means I would have to live with my parents. I'm trying to leave my parent's house and go out of state hopefully. They are narcissists (especially my dad).",
          "author": "TheGoodie",
          "created": 1637518536,
          "upvotes": 49,
          "replies": {
            "hlk52rc": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk52rc/",
              "text": "Sometimes getting away is critical to your mental well being. That was my situation. Stay strong.",
              "author": "the_journeyman3",
              "created": 1637529871,
              "upvotes": 17,
              "replies": {
                "hlk8eas": {
                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk8eas/",
                  "text": "Thank you ❤️",
                  "author": "TheGoodie",
                  "created": 1637531268,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            },
            "hljxfav": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljxfav/",
              "text": "Fair point. Public/state universities are definitely your best option. In the best case scenario, you get a good amount of federal grants and you have to take very few student loans.",
              "author": "cheesefries45",
              "created": 1637526807,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hlj5v2c": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlj5v2c/",
      "text": "Congrats. You are not wrong. I hope you put on the app that you will need financial aid. That s a generic thing you click on with each school app. Now you must make sure you have CSS IDOC (if required by each school) and FAFSA filled out and select those schools. Did you run a net price calculator to see how much $ you could get from each school with your family’s low income?",
      "author": "TwoSuns168",
      "created": 1637515871,
      "upvotes": 26,
      "replies": {
        "hljbxhm": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljbxhm/",
          "text": "Yes, I checked off that box on the app. Yes, my FASFA, CSS, IDOC is filled out. I wanted to run the NPC and I begged my parents to help but they refused. My dad didn't want to do it because he said it's useless. He said that's for people who want to take out loans. He said if I don't get a \"full-ride\" then there's no college for me. \n\nI'm frustrated.",
          "author": "TheGoodie",
          "created": 1637518349,
          "upvotes": 23,
          "replies": {
            "hljhjoh": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljhjoh/",
              "text": "I’m frustrated for you as a parent. I’m sorry!  Lets hope FAFSA and CSS can get you some aid. Do you have a backup plan?  It’s ok to go to a community college and apply second year. Many kids do this and they are still successful and graduate from solid colleges.",
              "author": "TwoSuns168",
              "created": 1637520532,
              "upvotes": 17,
              "replies": {
                "hljpkwx": {
                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljpkwx/",
                  "text": "I wasn't trying to choose a community college, because that means I would have to live with my parents (they are toxic) but, I'll consider community college. I know my parents will be extremely mad because they look down on it.",
                  "author": "TheGoodie",
                  "created": 1637523640,
                  "upvotes": 6,
                  "replies": {
                    "hlmhy5h": {
                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlmhy5h/",
                      "text": "Honestly ask them to stfu. They can’t fucking pay for the fancy schools so why throw a tantrum. Urg. I’m so proud of you!!!! Trust me you’ll figure this out!",
                      "author": "rawnakk",
                      "created": 1637577381,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hljhr74": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljhr74/",
              "text": "Why don’t you call up those colleges financial aid office and ask them when they plan on sharing aid info and try to explain to them you want to go but can only do so with aid.",
              "author": "TwoSuns168",
              "created": 1637520611,
              "upvotes": 7,
              "replies": {
                "hljpnf0": {
                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljpnf0/",
                  "text": "I'll definitely make a phone call. Thank you so much for the advice!",
                  "author": "TheGoodie",
                  "created": 1637523668,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hljj6xj": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljj6xj/",
      "text": "Your parents are unfamiliar with the process. I’m sorry they’re not being reasonable. Have you submitted your FAFSA to the colleges that you applied to? Have you submitted your CSS Profile to any colleges which require it? If you’re from a low-income family, this is how you’re going to get the most money to help pay for college.",
      "author": "jjhoster",
      "created": 1637521161,
      "upvotes": 22,
      "replies": {
        "hljmkrx": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljmkrx/",
          "text": "OP - show this post to your parents. jjhoster is an admissions officer at a major US university.",
          "author": "Strict-Special3607",
          "created": 1637522460,
          "upvotes": 14,
          "replies": {
            "hljqmav": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljqmav/",
              "text": "Thank you!",
              "author": "TheGoodie",
              "created": 1637524058,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "hljql87": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljql87/",
          "text": "I have submitted my FASFA and CSS around October.",
          "author": "TheGoodie",
          "created": 1637524046,
          "upvotes": 6,
          "replies": {
            "hljrmnx": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljrmnx/",
              "text": "Great! Check your portal account for each college to make sure they were received and see what additional info (like parent tax returns) they need.",
              "author": "jjhoster",
              "created": 1637524458,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hljhmzu": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljhmzu/",
      "text": "I think giving them the truth from the horse's mouth is always the best. Have them call the admission office and speak with them to clarify this.",
      "author": "Disastrous-Ad-1328",
      "created": 1637520567,
      "upvotes": 11,
      "replies": {
        "hljpuli": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljpuli/",
          "text": "They refused to call the admissions office but, I'm going to email one of the admissions officers to get proof.",
          "author": "TheGoodie",
          "created": 1637523748,
          "upvotes": 7,
          "replies": {
            "hlju3gi": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlju3gi/",
              "text": "At this point i would tell them to fuck off lmao",
              "author": "Dantalian1506",
              "created": 1637525461,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hljoa4o": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljoa4o/",
      "text": "Get your FAFSA done ASAP!! If you are low income, you should get something from a needs based standpoint.",
      "author": "cjpeltz",
      "created": 1637523125,
      "upvotes": 10,
      "replies": {}
    },
    "hlj570l": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlj570l/",
      "text": "Dude your colleges are good, tell your parents to wait and within a few weeks you will get your financial aid, if you're eligible that is",
      "author": "InvictusHomo",
      "created": 1637515596,
      "upvotes": 10,
      "replies": {}
    },
    "hljl8b1": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljl8b1/",
      "text": "If you're from Florida and on limited funds I'd stick with UF and FSU as my top options.  Instate price is practically free in comparison to the PA schools.  Florida has some great schools  and FL in state tuition is one of the least expensive in the country.  We are in PA and there really are no bargains here fir in state tuition.",
      "author": "Classic-Challenge-10",
      "created": 1637521939,
      "upvotes": 9,
      "replies": {
        "hljqt5t": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljqt5t/",
          "text": "Thank you for the advice! Yeah, I kind of sensed that. I really hope I get into UF or FSU.",
          "author": "TheGoodie",
          "created": 1637524136,
          "upvotes": 3,
          "replies": {
            "hljso26": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljso26/",
              "text": "My son applied to UF, just did the self report scores. He got into ASU and WVU, his safety schools,  but hasn't heard back from PENN State yet.  He got denied by UGA yesterday, it was a reach school for him, but we're hopeful he gets accepted to at least one of his reach schools.",
              "author": "Classic-Challenge-10",
              "created": 1637524870,
              "upvotes": 3,
              "replies": {}
            },
            "hlju9ri": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlju9ri/",
              "text": "Having been to all 3 campuses I'd say that ASU weather will be closest to home if that means anything to you. My kid wants nothing to do with cold weather schools.  ASU and Temple are major metro schools, but Temple is in an unsafe crime infested ghetto.  ASU is a very walkable, safe, environment that to me feels more suburban than urban.  PENN State is a midsized town in a rural/mountainous part of the state.   Depending on your major I'd chose ASU or PENN ST. over Temple.  They will all be about the same price although you will be able to fly to Philly on the cheapest and shortest flights if you go to Temple.",
              "author": "Classic-Challenge-10",
              "created": 1637525534,
              "upvotes": 3,
              "replies": {
                "hlkkryp": {
                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkkryp/",
                  "text": "I was really worried about Temple because of the crime as well. Yay I’m really glad to hear that about ASU. Thank you so much for your advice!",
                  "author": "TheGoodie",
                  "created": 1637536647,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlky6zd": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlky6zd/",
      "text": "If.uou are truly low income you can probably do this without your parents' help anyway. Just make sure you complete everything by the deadlines, especially there are competitive merit scholarships.\n\nBest of luck and congrats.\n\nI was raised by a narcissist. 30 years ago I took on 20k in loans because I didn't qualify for merit scholarships. It was worth it for me to break the tie to my mom.",
      "author": "CaraintheCold",
      "created": 1637542760,
      "upvotes": 7,
      "replies": {}
    },
    "hljmg9b": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljmg9b/",
      "text": "My parents are the same. However, the only difference is currently I the highest scholarship I got is 34k every year off tuition but my mother said that it isn’t good enough and that I needed a higher scholarship.\n\nOf course I told her that’s not how it works because I can only get so much with my stats but they just ignore me. I want you to show them that getting into a school isn’t easy— much less getting a scholarship, they cannot blame you for that.",
      "author": "shekyy_lopie",
      "created": 1637522411,
      "upvotes": 6,
      "replies": {
        "hljr0nf": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljr0nf/",
          "text": "I explained that to them for months and they just don't get it. I'm considered a failure to them and they don't even have degrees themselves. They never graduated from college.",
          "author": "TheGoodie",
          "created": 1637524217,
          "upvotes": 7,
          "replies": {
            "hlk0gbr": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk0gbr/",
              "text": "I want to know how dad worked in an admissions office doing anything of consequence without a college degree",
              "author": "Hardlymd",
              "created": 1637528014,
              "upvotes": 6,
              "replies": {
                "hlk3d74": {
                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk3d74/",
                  "text": "He's always lying. I don't believe a single thing that he says. He's always exaggerating his stories. He claimed to work in an admissions office when he actually did work-study?",
                  "author": "TheGoodie",
                  "created": 1637529163,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "hlkcwnj": {
              "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkcwnj/",
              "text": ">they don't even have degrees themselves. They never graduated from college.\n\nThis is not something to hold against them. A college degree is a symbol of wealth, not intelligence. Your parents don't understand the process and are worried about the financial situation because they never went through it themselves and probably see kids with college degrees everyday working at restaurants and grocery stores. Are you planning on paying for college alone because otherwise it's pretty shit to call your parents narcissist's online then turn around and ask them to pay for your vacation away from them. If they aren't paying, then who cares what their opinion is?",
              "author": "Time_Candidate_8063",
              "created": 1637533173,
              "upvotes": -13,
              "replies": {
                "hlkfwf9": {
                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkfwf9/",
                  "text": "They don’t understand the process because they are not willing to listen. Do you not know what narcissist parents do? You can shove proof in their face, and they are still not going to believe it. You confront them about traumatic experiences in the past and all they do is gaslight you. \n\nIt’s not shitty to call my parents narcissists when they abuse me. Going to college is my way of getting education and leaving my toxic household.",
                  "author": "TheGoodie",
                  "created": 1637534487,
                  "upvotes": 8,
                  "replies": {
                    "hlkllli": {
                      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkllli/",
                      "text": "> Do you not know what narcissist parents do?\n\nI know what narcissism is, yes, I just don't trust an angry teenager to tell me who's a narcissist. Especially nowadays when we have a victimization culture.",
                      "author": "Time_Candidate_8063",
                      "created": 1637537015,
                      "upvotes": -14,
                      "replies": {}
                    }
                  }
                },
                "hllz4vo": {
                  "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hllz4vo/",
                  "text": "Bro what 😭",
                  "author": "aAa19285",
                  "created": 1637561987,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hljpzjw": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljpzjw/",
      "text": "I suggest getting your school counselor to have a parent meeting and explain this all to them\n\nCongratulations on acceptances and good luck",
      "author": "Hamilton3322",
      "created": 1637523804,
      "upvotes": 5,
      "replies": {}
    },
    "hljh8k0": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljh8k0/",
      "text": "You need to have a school councilor speak to your parents.",
      "author": "BelievewhatIsayo",
      "created": 1637520412,
      "upvotes": 5,
      "replies": {}
    },
    "hljroju": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljroju/",
      "text": "Tell them, admissions office doesn't decide scholarships, but it is decided by other departments, It is not my fault I didn't get scholarships regardless, I will go to college even though I am getting debt forever.",
      "author": "Hairy-Accountant-636",
      "created": 1637524479,
      "upvotes": 5,
      "replies": {}
    },
    "hljw45q": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljw45q/",
      "text": "Just tell them that if you are low income and they provide their financial information, you can basically go to many state schools for free.",
      "author": "Hardlymd",
      "created": 1637526281,
      "upvotes": 5,
      "replies": {}
    },
    "hlk4tx2": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk4tx2/",
      "text": "It's not outdated info. It's never been the way your father thinks it works. I was low income and graduated decades ago. I did not ask for scholarships in my essay. That's just plain stupid.",
      "author": "the_journeyman3",
      "created": 1637529771,
      "upvotes": 5,
      "replies": {}
    },
    "hljuupo": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljuupo/",
      "text": "Tell your parents about the FAFSA. They need to file the FAFSA to get a need-based scholarship.",
      "author": "SlimJim8511",
      "created": 1637525774,
      "upvotes": 5,
      "replies": {}
    },
    "hlkdrxd": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkdrxd/",
      "text": "Temple doesn't even tell you about scholarships or financial aid till like Jan. You can soon contact these colleges about aid and apply to more scholarships.",
      "author": "Blqcklistings",
      "created": 1637533553,
      "upvotes": 4,
      "replies": {
        "hlkkv87": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkkv87/",
          "text": "Oh wow, I didn’t even know that. I’ll do that ASAP! Thank you!",
          "author": "TheGoodie",
          "created": 1637536688,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlkuy4j": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkuy4j/",
      "text": "Congratulations! You are definitely not wrong. I’m in the same boat as you in terms of financial background. My dad passed 2 years ago and my mom’s salary is 3 times smaller than his, so i’ll have to pay by myself. I also got accepted to penn state and temple, and got the same messages as well. Acceptance but no scholarship news yet. I’m very sorry they haven’t congratulated you or offered any support. Keep your head up! You’ll definitely get scholarship and you can look forward to being in a different place away from them in a few months.",
      "author": "melaniesky318",
      "created": 1637541247,
      "upvotes": 4,
      "replies": {}
    },
    "hllnn2c": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hllnn2c/",
      "text": "Parent here. \n1. Congratulations!🎈🎉🎊 \n2. They need to shut their pie hole and fill out FAFSA. Good grief.\n3. Go to college. Don’t return home. Good luck!",
      "author": "Marie-Curie-",
      "created": 1637555019,
      "upvotes": 3,
      "replies": {}
    },
    "hljxwdb": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljxwdb/",
      "text": "You are correct your parents are wrong. Writing that you need a scholarship in your essay will not do anything to get you one and will likely hurt your admissions chances. \n\nApply to FAFSA if you have not. Based on your low income status it is very likely that you will receive need based scholarships / low interest loans. The scholarship info they sent to you was likely merit based and has nothing to do with need which often is given later. \n\nLmk if you have questions.",
      "author": "Pattywackist",
      "created": 1637526998,
      "upvotes": 3,
      "replies": {}
    },
    "hlk3rh3": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlk3rh3/",
      "text": "If you are low income then you should get financial aid. Taking out some loans isn't the end of the world provided you are going into a field that pays well.",
      "author": "the_journeyman3",
      "created": 1637529328,
      "upvotes": 3,
      "replies": {}
    },
    "hlka1cz": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlka1cz/",
      "text": "My parents were the same. It’s easy to say go to school but not easy to support someone while they attend school. Don’t give up, remember it’s for you not for them.",
      "author": "Wheredoisellmysoul",
      "created": 1637531965,
      "upvotes": 3,
      "replies": {}
    },
    "hllk9gu": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hllk9gu/",
      "text": "We didn’t put need for financial aid on any application and my son and daughter Received scholarships to many of the schools EA and regular within two weeks to a month after acceptance letter based on merit. Few schools made them submit application by certain date to be considered for merit scholarships but it is understood by the school that because application was submitted by deadline that we were interested In merit scholarships. Make sure if you are looking for need based assistance all applications and documents are submitted by deadline. That is important.",
      "author": "Iceland54321",
      "created": 1637553293,
      "upvotes": 3,
      "replies": {
        "hllq2zq": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hllq2zq/",
          "text": "Thank you so much! This has definitely calmed my nerves.",
          "author": "TheGoodie",
          "created": 1637556311,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hllqd6y": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hllqd6y/",
      "text": "Depending on your stats, you might want to seek out schools that are more generous with merit— and, depending on your parents’ income and assets (as well as your stats), you might also want seek out schools that will be generous with financial aid. ASU and Penn State aren’t particularly generous, Temple can be generous-ish— but if you’re trying to do this without financial support from your parents, those schools will be challenging/impossible to afford on your own.\n\nIf you have over a 3.5/1420 or 32, look at Bama (either/or Tuscaloosa or Huntsville), as you’ll automatically qualify for $28K/annually (tuition is roughly $30K), room and board is $12K-ish. As a student, you can borrow $5500 (plus $4K if your parents don’t qualify for loans) plus you might qualify for a Pell grant, depending on your family’s income. Additionally, look at your in state options, as they might have programs for lower income applicants to include free tuition or significant grants.",
      "author": "ellysbelly",
      "created": 1637556469,
      "upvotes": 3,
      "replies": {
        "hllqoql": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hllqoql/",
          "text": "Thank you so much. I’ll definitely look into those.",
          "author": "TheGoodie",
          "created": 1637556649,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlnaoad": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlnaoad/",
      "text": "Pick a school in Florida instead of going into debt out of state.  Florida residents have a great deal!!!! Florida is big enough to get away from your parents!  Apply for the scholarships, if you get a good one, then you can justify going, if you DON’T pick a Florida school, future you will be greatfull!!!\n\n~Smartguy",
      "author": "Opening_Soft7383",
      "created": 1637594566,
      "upvotes": 2,
      "replies": {}
    },
    "hljm5mu": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hljm5mu/",
      "text": "I suggest you get your counselor to send a strongly worded email if that's possible",
      "author": "Gray_________",
      "created": 1637522296,
      "upvotes": 3,
      "replies": {}
    },
    "hlkqn1z": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkqn1z/",
      "text": "I got accepted into the college i want to go to and my dad is helping me. So first decide when you are going and where. Then fill out the FASFA and fill out stuff for scholarships",
      "author": "KirisLeftButtcheeck",
      "created": 1637539280,
      "upvotes": 1,
      "replies": {}
    },
    "hlkspfc": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlkspfc/",
      "text": "first, congratulations!\n\nbut seeing as you are low income (so am i) you might want to look at smaller schools that will pay you to attend or maybe community college. this is absolutely not your fault at all! all of those universities are verrryyyyy expensive anyways.",
      "author": "ambrrrn",
      "created": 1637540221,
      "upvotes": 1,
      "replies": {}
    },
    "hll6i6x": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hll6i6x/",
      "text": "Secondly, you're right. The system doesn't work that way. You're doing the right thing! Just keep at it :)\n\nSecondly, you're totally right. The system doesn't work that way. You're doing the right thing! Just keep at it :)",
      "author": "Ok-Humor2006",
      "created": 1637546668,
      "upvotes": 1,
      "replies": {}
    },
    "hlm47k9": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlm47k9/",
      "text": "Bro fuck I can understand this! It’s crazy cuz we can’t even blame them for not knowing how much EFFORT it takes to just apply to uni, forget about the acceptance! \nAlso, congrats on getting accepted 💗\n\nScholarships are SO difficult to get and parents don’t understand this, they think that everyone can get a scholarship but that’s not true. This is really frustrating.",
      "author": "LoveLangIsClothes",
      "created": 1637565662,
      "upvotes": 1,
      "replies": {}
    },
    "hlmgvd9": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlmgvd9/",
      "text": "Same, got accepted from MIT, Pennsylvania university, and Caltech. They never congratulated me.",
      "author": "jackflir",
      "created": 1637576444,
      "upvotes": 1,
      "replies": {}
    },
    "hlmsfg1": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlmsfg1/",
      "text": "[I have a list over here if it helps.](https://www.reddit.com/r/ApplyingToCollege/comments/azu8o2/change_your_trajectory_full_ride_scholarship/?utm_medium=android_app&utm_source=share)",
      "author": "RedditLawEnforcer",
      "created": 1637585262,
      "upvotes": 1,
      "replies": {}
    },
    "hlmy51x": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlmy51x/",
      "text": "It sounds like you are on the right track.  You do need to understand the timelines now.  Best case is that you aid packages start to trickle in.  The worst case is that you have to hold on until around April to receive them and deal with unconstructive comments until then.  The first option that lands should take a lot of the pressure off and hopefully give you the muster to be patient for the rest to unfold.",
      "author": "One-Insect-2014",
      "created": 1637588585,
      "upvotes": 1,
      "replies": {}
    },
    "hln1hik": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hln1hik/",
      "text": "That is a truly terrifying predicament my guy/person D: good luck!",
      "author": "Wooden_Bowler_9236",
      "created": 1637590321,
      "upvotes": 1,
      "replies": {}
    },
    "hln85sh": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hln85sh/",
      "text": "Did you at least check the box where it stated , do you need financial assistance? It doesn't hurt to pick yes to make everyone happy.",
      "author": "RecoilRoyale",
      "created": 1637593458,
      "upvotes": 1,
      "replies": {}
    },
    "hlnienw": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlnienw/",
      "text": "I feel this lol",
      "author": "Honeydewbobaddict",
      "created": 1637597798,
      "upvotes": 1,
      "replies": {}
    },
    "hlof8az": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlof8az/",
      "text": "Aside from in state schools, you might also consider colleges that have full (or mostly full) need met. These are mostly private schools around the country and you can find a list online or through collegeboard. These colleges are some of the bests choices for low income students. Good luck!",
      "author": "bboywestcoast",
      "created": 1637610896,
      "upvotes": 1,
      "replies": {}
    },
    "hlouaiz": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlouaiz/",
      "text": "So sorry about your situation :( I was wondering when you applied to Temple and when you heard back (for reference)? Congrats on the acceptances!",
      "author": "Adventurous-Task937",
      "created": 1637616972,
      "upvotes": 1,
      "replies": {
        "hlp1zhi": {
          "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlp1zhi/",
          "text": "I applied at Nov 1st and then I submitted the extra materials on Nov 4th. I received the acceptance on Nov 19th.",
          "author": "TheGoodie",
          "created": 1637620221,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlql4af": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlql4af/",
      "text": "1. Apply for financial aid and you shall HOPEFULLY receive if your income is really that low\n\n2. Have them sit down with your guidance counselor- they'll explain it well and they might listen.",
      "author": "Bearlee_1",
      "created": 1637647499,
      "upvotes": 1,
      "replies": {}
    },
    "hlm6j8t": {
      "link": "/r/ApplyingToCollege/comments/qyywi1/accepted_to_3_colleges_no_support_from_parents/hlm6j8t/",
      "text": "Bro what was your SAT score",
      "author": "No_Astronaut_7002",
      "created": 1637567467,
      "upvotes": 0,
      "replies": {}
    }
  }
}