{
  "sid": "q9h2d5",
  "link": "/r/ApplyingToCollege/comments/q9h2d5/tips_on_college_for_lowincomefirst_gen/",
  "title:": "Tips on college for low-income/first gen international HS senior?",
  "text": "(Repost because my first post was deleted somehow)\nI’m a senior-equivalent studying at a non-US high school (with no US citizenship), and I’m desperate for some tips on college and applications, really appreciate if someone could help me out.\n\nOur education system doesn’t count GPA, we are given letter grades, and the place I’m from is notorious for being academically intensive. I’m studying at the top secondary school in the region, so despite my grades being fairly above average at school I hope unis will take my school’s context into account (I heard they will right?) But then I do have predicted grades for our standardised school leaving exams, they’re pretty decent and I’ll submit it in my applications. My ECs are okay too, I got clubs, sports, competition experience, MOOCs, courses, and I managed to get mentored by a professor over the summer so I helped him conduct research in a lab.\n\nAnd for some info on myself, my mum raised me as a single parent, there’s only me and her in the household. She went to high school but I don’t think she graduated. So I’m first gen. She couldn’t find a job since COVID, we don’t really have a stable income source and we’re currently living off her savings. I wish I had more details on our financial situation, but every time I ask her she’s rather reluctant to tell me how much money we actually own, so I just get the sense we’re in a somewhat poor situation. \n\nI still have to go abroad however. The place I’m from has been in a political crisis for the past 2 years, it’s getting more and more politically unstable and I don’t see another choice but to leave. My mum’s decided to sell the flat we live in- luckily she bought it many years ago, it’s government subsidised so we’d have to find a way to repay the subsidies before the flat could be sold. And if it is, the money generated could be used to pay my college fees, assuming I would have zero aid, grants or scholarships, while having an equal amount of cash to spare. Then she’ll leave with me to the US, but since there’s a huge possibility she can’t actually stay there she also considers going to another country, where she has a valid visa. In the meantime, I’ll most probably be remaining in the US after graduation, maybe immigrate, because I don’t think I’ll be going back to my hometown in the near future.\n\nRecently I just started realising how flawed the plan is, as there’s no guarantee that we can even sell the flat in 1 year’s time- said political crisis is causing many people to migrate as well, so there are a lot of way better, more expensive private houses and apartments on sale before our crappy little flat :P\n\nSo I’m targeting mainly US public unis because tuition is generally cheaper. Not too worried about my college list because I’ve checked it with my school counsellor and she says it’s around my range. Though, I’ve decided to ED johns hopkins. I’ll be filling for financial aid, but it’s making me extremely anxious because I know my chances are gonna be so much lower because of it. So happy that they gave me application fee waiver for being first gen though. \n\nMajor questions that I have:\n1. Can I not request for financial aid during the applications and only apply for it at a latter date, ie once/after I get in? Does it work that way?\n2. I know some public unis don’t give application fee waivers to international students, but would they make exceptions if I try to email them to explain my situation?\n3. Any recommended places where I can look for aid/scholarship/grants as an international student?\n4. Can I apply for a green card while on a f1 visa?\n\nI’m doing the research on unis and applications all by myself, so my knowledge on these matters is awfully limited. Greatly appreciate it if y’all folks could give me some advice, regarding my situation, application tips, tips on how to reduce my costs and expenses in college (could really foresee myself needing this lmao), whatever, really. God knows how much I need it.\n\nTo whoever reads this and/or responds to it, thank you so, so, so, so much.",
  "author": "shrimp_fri_dis_rice",
  "created": 1634407110,
  "updated": 1634569594,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgvwvn7": {
      "link": "/r/ApplyingToCollege/comments/q9h2d5/tips_on_college_for_lowincomefirst_gen/hgvwvn7/",
      "text": "Check r/IntltoUSA\n\nPublic universities offer no need-based financial aid to international students and charge them more. Selective public universities do not need to offer merit scholarships to out of state students, and accordingly are not going to be affordable.\n\nYou would need to look for (less-selective) public universities that offer large automatic merit scholarships. If your stats are high enough, that might be full tuition. Getting someone else to pay for your living expenses (room and board) is much more difficult. Unless your family can afford the 15k/year in living expenses, public universities even with large merit scholarships are not very likely to be affordable. Search for scholarships that also provide room and board - these are hard to find.\n\nPrivate universities that offer need-based aid to internationals are a better option if you can get accepted. They are extremely competitive. Acceptance rates for internationals to top US schools tend to be around half the overall rate.\n\nGoogle your visa questions extensively.",
      "author": "elkrange",
      "created": 1634407697,
      "upvotes": 1,
      "replies": {
        "hgvzm3i": {
          "link": "/r/ApplyingToCollege/comments/q9h2d5/tips_on_college_for_lowincomefirst_gen/hgvzm3i/",
          "text": "Oh okay! Thank you very much for the advice. I’m not too confident in my grades and ECs so I’ll try to look into the public universities🙏",
          "author": "shrimp_fri_dis_rice",
          "created": 1634408873,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgxs96u": {
      "link": "/r/ApplyingToCollege/comments/q9h2d5/tips_on_college_for_lowincomefirst_gen/hgxs96u/",
      "text": "1. No. You’ve to request it with admission. Check out the difference between need blind and need aware unis. \n2. Some do. Email them with a small explanation of why you need it.\n3. Check out iGrad.\n4. I don’t think so.",
      "author": "Isa_Isabella",
      "created": 1634438411,
      "upvotes": 2,
      "replies": {
        "hh1ovte": {
          "link": "/r/ApplyingToCollege/comments/q9h2d5/tips_on_college_for_lowincomefirst_gen/hh1ovte/",
          "text": "I am aware of the differences in need blind and need aware admissions, but the competitiveness of need blind unis really puts me off. I’ve decided to apply with aid to jhu now, since I still have plenty of other unis on my college list.\n\nI’ll try to check out the other things you’ve mentioned. Thank you so much for your information.",
          "author": "shrimp_fri_dis_rice",
          "created": 1634513920,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}