{
  "sid": "qldpos",
  "link": "/r/ApplyingToCollege/comments/qldpos/why_do_american_colleges_factor_extracurriculars/",
  "title:": "Why do American colleges factor extracurriculars into their decision-making process so much when colleges in the rest of the world don’t?",
  "text": "My parents are from another country, and when I was applying to colleges I talked to my cousin who lived and said country and told him I needed to do stuff like debate and swim team to get into a good college. He looked at me like I was crazy and asked what that had to do with getting into college, and explained that universities in his countries only cared about your grades. Why is there such a substantial difference between the expectations of American universities and the rest of the world?",
  "author": "yeahmohammad",
  "created": 1635885727,
  "updated": 1635889519,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hj2635l": {
      "link": "/r/ApplyingToCollege/comments/qldpos/why_do_american_colleges_factor_extracurriculars/hj2635l/",
      "text": "Grades aren’t everything. Colleges want to know that you’re well-rounded, participate in society, etc. Also GPA isn’t standardized, and imo it’s dumb to base the entirety of your admissions process in entrance exams (like is done in places like Japan and Korea).",
      "author": "PugTrafficker",
      "created": 1635886417,
      "upvotes": 1,
      "replies": {
        "hj268xs": {
          "link": "/r/ApplyingToCollege/comments/qldpos/why_do_american_colleges_factor_extracurriculars/hj268xs/",
          "text": "Yeah I understand the reason, but I’m asking why it’s only like that in the US.",
          "author": "yeahmohammad",
          "created": 1635886478,
          "upvotes": 1,
          "replies": {
            "hj2883u": {
              "link": "/r/ApplyingToCollege/comments/qldpos/why_do_american_colleges_factor_extracurriculars/hj2883u/",
              "text": "Probably cause top American schools are way more competitive than schools in other countries, so they need ways other than just grades to determine if they’re the right fit for the school.",
              "author": "PugTrafficker",
              "created": 1635887235,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}