{
  "sid": "qmdgi3",
  "link": "/r/ApplyingToCollege/comments/qmdgi3/advice_with_a_22_gpa/",
  "title:": "advice with a 2.2 gpa..",
  "text": "i need help / advice (?) i'm about to graduate high school and i don't know what to do after that, my gpa is too low … sadly it's a 2.2 so it's making me stress out since i know i wont go to a good college but community college is a option but i also have no clue what career path i want to do like at all. so that is holding me back a lot, that's why i wanted to take a gap year but is it even worth it, i really need help since it's been stressing me out a ton. should i apply to a community college with that low of a gpa while still not knowing what to do or take a gap year?",
  "author": "shouvou",
  "created": 1636002700,
  "updated": 1636136154,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hj8y9sd": {
      "link": "/r/ApplyingToCollege/comments/qmdgi3/advice_with_a_22_gpa/hj8y9sd/",
      "text": "Most community colleges will still admit you.  Once you finish there, most 4 year colleges won't care that much about your high school GPA.  Once you have a college degree, literally no one ever asks about your high school GPA.  If you can get better grades in college, you can totally come back from this.",
      "author": "ScholarGrade",
      "created": 1636003079,
      "upvotes": 21,
      "replies": {
        "hj8yzpk": {
          "link": "/r/ApplyingToCollege/comments/qmdgi3/advice_with_a_22_gpa/hj8yzpk/",
          "text": "alright!! this is nice to know, this definitely made me feel better",
          "author": "shouvou",
          "created": 1636003590,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hj8znbl": {
      "link": "/r/ApplyingToCollege/comments/qmdgi3/advice_with_a_22_gpa/hj8znbl/",
      "text": "I agree, community college would the best choice with that GPA. Do you honestly think you’d go back to school after the gap year? Or would you find a job and school would always being what you’re planning to do next year",
      "author": "dalej42",
      "created": 1636004066,
      "upvotes": 5,
      "replies": {}
    },
    "hj91sr8": {
      "link": "/r/ApplyingToCollege/comments/qmdgi3/advice_with_a_22_gpa/hj91sr8/",
      "text": "Yeah like someone else said in the comments, after you have a community college degree no one will ask your high school gpa. Id totally recommend going to a community college, if you can turn around your grades while you’re there then you’ll be fine!!",
      "author": "env_ironman_talist",
      "created": 1636005708,
      "upvotes": 3,
      "replies": {}
    }
  }
}