{
  "sid": "o4bncq",
  "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/",
  "title:": "College professors are not NPCs",
  "text": "Hi guys, I'm a college professor. I've noticed a little wave of discussion on this sub concerning the idea of cold-emailing professors to ask them to take on high schoolers as research assistants. I just wanted to talk about that for a second.\n\nI've been where many of you are: anxious about college applications, uncertain of how to put forward the best version of myself to prospective colleges. That's why I started posting here in the first place. I want to reassure you, insofar as you will allow yourself to be reassured, that most colleges are very, very similar to each other and that you have so, so much to look forward to wherever your road takes you.\n\nI saw a post here a while ago - I'm going to change some details so that the poster remains anonymous - that basically said, \"I've been emailing a set of Yale professors to ask them to take me on as a research assistant. They're not replying. What can I write to get them to reply?\" (I didn't comment on the post, so you won't find it in my comment history.) After thinking about that post for a while, I decided to write this one to remind you guys that college professors are just like you: they're fully rounded, fully realized human beings who are trying to survive in the world they find themselves in. They're not NPCs you can unlock to help you on your journey.\n\nLike everybody else, professors have a lot going on. Even if they work at teaching-oriented colleges, most of the hours they spend working are not hours in the classroom. They do research, they write up their research, they put together course content, they do service work, they do peer review, they may direct labs - the list goes on and on. They focus their mentoring on their undergraduate and (if their department has graduate students) their graduate students. That's their job, and most of them bring a ton of personal dedication and commitment to that job. And outside of work, they have families and hobbies and D&D campaigns and other things to overwhelm their time.\n\nSpeaking only personally, I don't think that doing research with a professor, as a high schooler, is much of a flex. My response to hearing about it - and again, this is only my personal knee-jerk, completely unfair, reaction - \"Okay, so that person had a professor as a family friend. They did something simple and harmless, like populating Excel spreadsheets or collecting literature on a certain topic, and even then the professor had to double-check the spreadsheets and do a literature review of her own, because the high schooler is new enough to the field that they might miss things a more experienced person would not.\"\n\nI think there are many more fulfilling ways to spend a summer. Scoop ice cream, learn how to repair clocks, volunteer in your community. For those of you who are doing research with professors, please don't take what I've said as a criticism - I'm sure it's different for you, and the person you're working with is going to explain in their letter of recommendation what's distinctive about you and your work. You're doing a great job. I mean it!\n\nI think there's a risk that some of the people here may have a villain arc while they're working to get into a specific college - that they may fall into the trap of treating human beings as a means to an end. Don't do that - stay true to your humanity and recognize the humanity of others. Be a hero!",
  "author": "lotsofgrading",
  "created": 1624213211,
  "updated": 1634075900,
  "over_18": false,
  "upvotes": 2393,
  "upvote_ratio": 0.98,
  "comments": {
    "h2gma5k": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gma5k/",
      "text": "High schoolers on this sub also have to realize that many profs don’t take on high schoolers for research bc they already have grad and undergrad students. They also have to realize during COVID especially, that hs students will not do research with profs because not even college students are doing research rn. High schoolers are the last pick when it comes to research",
      "author": null,
      "created": 1624218931,
      "upvotes": 381,
      "replies": {
        "h2gqkl4": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gqkl4/",
          "text": "And also, that there are often additional rules if you have minors in a lab. Someone under 18 may not be allowed in certain rooms. They may have to be chaperoned 100% of the time. And even if there are no obvious dangers, the law is so much stricter on safety for children and some academics will not want to take on any amount of that risk, nor will they want to potentially deal with your parents.\n\nOn top of that, we have an obligation to serve the students at our own institutions first. They are “our” students. A high schooler, even one who claims they want to attend our university, is not “our” student. And the place they take could go to a deserving undergrad instead. Even if a PhD mentors you, they could be mentoring an undergrad. The limiting factor is often how much time an academic has available for advising, so high schoolers definitely take a slot someone else could have.",
          "author": "officially_anxious",
          "created": 1624220780,
          "upvotes": 149,
          "replies": {
            "h2gykwi": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gykwi/",
              "text": "\\^\\^\\^",
              "author": "lotsofgrading",
              "created": 1624224875,
              "upvotes": 28,
              "replies": {}
            }
          }
        }
      }
    },
    "h2gdhv2": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gdhv2/",
      "text": "I've worked with a lot of students who have research experience with a professor or in a lab setting. Except in some cases when a student is truly precocious, most or all of these positions come from connections.\n\nThis sub has a disproportionate number of high-achieving students. I think the (relative) prevalence of these research experiences on this sub has led others to believe they can be obtained easily/independently (for example by sending out cold emails). \n\nBut that REALLY isn't how it works. As OP said, most professors are just as fucked/overworked as high school juniors. And those who aren't probably have a team of graduate students to fall back on. \n\nAnyone who's been to grad school or has worked extensively with even very, very bright undergraduates will assume that a \"research position\" is really just a glorified internship. (Which is still valuable, because it shows dedication and topical focus.)\n\nGood post. Thanks for taking the time.",
      "author": "McNeilAdmissions",
      "created": 1624214369,
      "upvotes": 469,
      "replies": {
        "h2ge1rx": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2ge1rx/",
          "text": "Thanks so much!",
          "author": "lotsofgrading",
          "created": 1624214651,
          "upvotes": 70,
          "replies": {}
        },
        "h2gzp15": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gzp15/",
          "text": "I don't think we should discount connections - I know the word has a bit of a dirty reputation around here, but past college we start using another word in place of \"connections\" - \"networking\".\n\nI, having been on multiple ends of the giving and receiving emails related to research opportunities issue, personally don't think it a super big deal for students who are interested in research sending out some emails. Worst that happens is that they say no, right? Within my own academic experiences, PIs not responding to your emails is often accepted as the norm simply because they have too many issues all at once. That doesn't mean you should meekly back off and accept you're being a burden, however - on the contrary, most professors I know hand out their numbers so you can text them if they forget. \n\nLook, I get that spam is unpleasant for anyone, but for people trying to break through their own socioeconomic barriers anything can go a long way. Getting somebody on your side, or some extra leverage in the farce we call admissions is incredibly valuable if you don't have many great options otherwise. I don't think that looking for research opportunities as a high schooler is at all \"dehumanizing\" a professor - if you think that's morally deficient, then you will have many, many more complaints about graduate school and job applications. It's simply how the game is, and you can't fault the determined for trying.\n\nFor the record, I personally did not perform and would not advise research with a college lab just to get brownie points on an app. Do it if you're genuinely interested. But the realpolitik of the situation is that this sort of thing is de facto a prerequisite for some programs like BS/MDs, so you can't really complain that people are aiming high.",
          "author": "Vergilx217",
          "created": 1624225457,
          "upvotes": 49,
          "replies": {
            "h2h0y8z": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2h0y8z/",
              "text": "Yeah I don't think I was really commenting on what one SHOULD do. Just explaining the reality of the situation. 🤷🏻‍♂️",
              "author": "McNeilAdmissions",
              "created": 1624226093,
              "upvotes": 13,
              "replies": {}
            },
            "h2h0olf": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2h0olf/",
              "text": "It sounds like we're in agreement that we would not advise trying to get research with a college lab just to get brownie points on an app.",
              "author": "lotsofgrading",
              "created": 1624225956,
              "upvotes": 30,
              "replies": {}
            },
            "h2i4vqq": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2i4vqq/",
              "text": "Well said. Take my international financial aid applicant's gold",
              "author": "yapoyt",
              "created": 1624248655,
              "upvotes": 6,
              "replies": {}
            },
            "h2lrf3v": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2lrf3v/",
              "text": "Who said it's now what you know but who you know?",
              "author": "official-Nick",
              "created": 1624325429,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h2gjz1p": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gjz1p/",
      "text": "Agree agree agree. \n\nShould high school students reach out if they are interested? Sure. But there is nothing they can do to get a response if the professor isn't responding. It's not that the professor is a jerk/witch. Their plates are full. \n\nThere are many ways to show potential beyond doing research at a college.",
      "author": "calmbythewater",
      "created": 1624217720,
      "upvotes": 89,
      "replies": {
        "h2gy6lo": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gy6lo/",
          "text": "Thank you for the \"w\" in \"witch.\" You are a good person.",
          "author": "lotsofgrading",
          "created": 1624224667,
          "upvotes": 17,
          "replies": {}
        },
        "h2jreao": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2jreao/",
          "text": "This 100%. Of course there is nothing wrong with reaching out and making an attempt I guess. But it's not like the professors owe you a response or some sort of research position. They have literal students at the college, no solid reason for them to take some high school kid instead of college students.",
          "author": "TheBestBrotha15",
          "created": 1624290963,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h2gkbaf": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gkbaf/",
      "text": "I have had the privilege of doing research as an undergraduate student at a renowned lab with its own graduate school and at a lab in an Ivy League school. I have not seen a single high school student in either one of those places. There are just so many undergrad students vying for the spots in these labs that a chance of a high school student being even considered is minuscule.",
      "author": "Ms-J",
      "created": 1624217897,
      "upvotes": 169,
      "replies": {}
    },
    "h2glwrw": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2glwrw/",
      "text": "Rising sophomore engineering student here.  I agree that there seems to be this huge emphasis on getting research and internships as a high school student, and I couldn't agree with you more.  To this, I would only add that it can be difficult for engineering undergraduates to even find a research position or internship position.  That's after we have taken college level classes, interacted with professors, and have begun to build a professional network.  Heck, even engineering graduates occasionally struggle to find jobs.  You guys are high schoolers; your college professional career has not even begun.  Don't worry about trying to get research or an internship right now.  If you can, that's great.  But if you can't...seriously, don't sweat it.  You can and still will be able to go on to do great things.\n\nAnd to OP, thanks for posting this; it is good to have the bubble that A2C sometimes is popped by someone who is on the other side of this.",
      "author": "Mingoogreaty",
      "created": 1624218737,
      "upvotes": 48,
      "replies": {}
    },
    "h2gwsvz": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gwsvz/",
      "text": "I’ve posted several times that when high school students assume that of course they’ll be wanted in the lab because they are possibly “free” labor, they are completely unaware of the training & background coursework needed to genuinely make a significant contribution to the lab. When I was in grad school, even having an undergrad in the lab was done as a service to science education; we expected them to be way more work for us than they contributed in return.   The only time high school students ever were at my institution was if they were part of a summer research program, and that was led by high school educators in combination with volunteer labs. \n\nYes, of course there are exceptions, and maybe one is more likely to see this on a2c, but even smart kids rarely have an adequate background for lab research. \n\nI think realistically most are better off with legitimately accessible opportunities like, as you mention, a part-time job, or some areas have summer programs.\n\nAlso, there is much ado made about getting published, and again, *most* undergrads who get to publish are considered more lucky than anything when it comes time for grad school.",
      "author": "pixelatedpix",
      "created": 1624223979,
      "upvotes": 38,
      "replies": {
        "h2gx8yp": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gx8yp/",
          "text": "Well put!",
          "author": "lotsofgrading",
          "created": 1624224203,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "h2gfm38": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gfm38/",
      "text": "This is gold.  I'd upvote 100x if I could.",
      "author": "jayphoward",
      "created": 1624215450,
      "upvotes": 109,
      "replies": {}
    },
    "h2ggyne": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2ggyne/",
      "text": "Honestly a lot of people here be entitled af expecting professors to research with them just because they took the effort of writing an email and pressing send. if students really are in it for the research and not just for the college application then they could probably do it by themselves or with their high school teacher, which might even look more impressive since it would be something the student has a passion for. not saying that students shouldn't cold email, just that they should start with the mindset that it probably wont be responded to lol",
      "author": null,
      "created": 1624216146,
      "upvotes": 117,
      "replies": {
        "h2gp33c": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gp33c/",
          "text": "[deleted]",
          "author": null,
          "created": 1624220086,
          "upvotes": 39,
          "replies": {
            "h2hcvpu": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hcvpu/",
              "text": "my condolences lol",
              "author": "joocy_kooter",
              "created": 1624232700,
              "upvotes": 7,
              "replies": {
                "h2idc0d": {
                  "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2idc0d/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1624255026,
                  "upvotes": 1,
                  "replies": {
                    "h2idvpl": {
                      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2idvpl/",
                      "text": "nahhh don’t worry about it!! everything counts an experience. whether it’s a fancy shmancy internship or research or retail jobs or even sweeping your front yard every morning, it all contributes to building up who you are and what you will become. it’s all about your mindset. \n\nbest of luck",
                      "author": "joocy_kooter",
                      "created": 1624255494,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h2h1kaj": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2h1kaj/",
      "text": "Predoc in economics here. Another crucial point here is that professors want to hire people who are motivated by curiosity and a passion for the topic they’re researching, and aren’t just doing what they see as “the thing to do” as an overachiever. And they can 100% tell.\n\nIf you are that person, and are hoping to go into an academic research career, the best thing you can do now as a HS student is learn about the subject you want to study. Familiarize yourself with research in the field, find out what skills are useful in it (e.g., math or coding), focus on building those skills and the knowledge base that will make you a strong researcher in the future. If you’re in this situation and have a mentor in your field, it’s overwhelmingly likely that they’ll tell you that this is what will help you most, not doing basic tasks for a research project before you’ve learned how research in that field works.\n\nIf you’re not that person, you will be better served by doing something related to whatever it is you *are* passionate about — or even just doing a regular job for extra cash, as OP says.",
      "author": "secondpriceauctions",
      "created": 1624226410,
      "upvotes": 15,
      "replies": {
        "h2h20i7": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2h20i7/",
          "text": "\\^\\^\\^\n\nAlso, I recently read that the employment rate in the U.S. of people with economics Ph.D.'s is 100%. Please use that statistic as a sign to enjoy your time in graduate school - I definitely didn't take enough time to enjoy my graduate program!",
          "author": "lotsofgrading",
          "created": 1624226643,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "h2gel3j": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gel3j/",
      "text": "Ahh I see. I could not agree with you more!",
      "author": "Tiko1787",
      "created": 1624214925,
      "upvotes": 13,
      "replies": {}
    },
    "h2gpger": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gpger/",
      "text": "Incredible post. Science is hard and your productivity is not just about how smart you are. Working in a lab means developing a basic knack for lab work which is as much of trade-like skill as any other profession. Asking a professor to mentor you or to join their lab means a potentially enormous time investment on their part just training you. For most this will be about 3 months if you focus and invest hours in and outside the lab learning and thinking about the technical aspects, but it could be much longer with less focused effort. \n\nI would recommend thinking very hard about how much time will have to be invested into you to generate pub-quality work, and how much time you are willing to pay them back with.",
      "author": "ikmZ62T3Vs",
      "created": 1624220223,
      "upvotes": 15,
      "replies": {}
    },
    "h2h1sk6": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2h1sk6/",
      "text": "[deleted]",
      "author": null,
      "created": 1624226528,
      "upvotes": 11,
      "replies": {
        "h2j245w": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2j245w/",
          "text": "*HS kids’ searching for the forum intensifies*",
          "author": "Red-eleven",
          "created": 1624277748,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h2gtqi3": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gtqi3/",
      "text": "*mic drop*\n\nthank u for posting this, OP.",
      "author": "minhtringuyen",
      "created": 1624222409,
      "upvotes": 10,
      "replies": {}
    },
    "h2iier3": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2iier3/",
      "text": "THIS. I've refrained from being negative on posts of people saying to cold email professors, but... it is incredibly presumptuous (and borderline rude in some cases).  At an R1 school, professors are constantly bombarded with emails seeking research opportunities from:\n\n* undergrads at other schools who want to visit... if only you'll help them justify the expense -- or even get a visa (which might require perjuring yourself; no thanks);\n* undergrads at your own school, most of whom you do not know... because you would have asked your top students if you had a bit of research suitable for an undergrad;\n* grad students in unrelated departments... who want some paying job and have spammed the entire college; and,\n* grad students at other institutions who are trying to get an in to do research or get you on their committee or get a visiting position they can put on their CV or just get here to interview at companies... and have funding so long as you can get them an office (and they might need more funding for housing).\n\nAlmost none of these help a tenure-track young professor get tenure; almost none of these are more useful than a PhD student (who tend to be advised by tenured professors) or a top undergrad who has proven successful in coursework at that university; and, almost all of these are less work than bringing a high school student up-to-speed on research methodology (never mind not running afoul of issues with minors).\n\nThe people mentioning connections are spot-on: The only times I've given advice or ideas on research to high school students were when there was a family connection or it was a family friend -- and even then it's very hands-off: I'll give some tasks and check in a bit later and if they are floundering or have done nothing then that's the end of that.  Being a research-active professor means not having time to hold hands and get people up to speed on research methodology much less check that work gets done properly.  If you really want to do research with a professor, take a college class from them, be the top student, and then approach that professor... and you still might get shot down.",
      "author": "minimuminfeasibility",
      "created": 1624259566,
      "upvotes": 9,
      "replies": {}
    },
    "h2h2s0y": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2h2s0y/",
      "text": "High school research is volunteering with extra steps more often than not.",
      "author": "Wushetam",
      "created": 1624227051,
      "upvotes": 7,
      "replies": {}
    },
    "h2h0ihb": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2h0ihb/",
      "text": "There's a lot of truth here! I interned at some Stanford labs when I was in high school, and spent a summer at a CSU (this one was paid). Honestly, a lot of the kids who were able to get a science fair entry out of it were connected to faculty to some way (i.e. they're kids of faculty, their parents are friends, whatever).\n\nI came from a rural high school, knew no one else who had done this, and all my emails were truly cold. Most of my high school teachers were... underwhelming. I also had to commute about +2 hours each way to get there. At Stanford, there seemed to be a small workforce of high school students in the summer from some very competitive nearby high schools who were used to it and viewed it as something to check off their list, which rubbed me the wrong way.\n\nI did, in particular, appreciate how the postdoc and group who took me on (especially in my post-junior year summer) taught me a lot about the scientific process, and what scientists do. I still carry on those lessons with me now in college (I do a lot of undergrad research), and want to emphasize that you should do things in high school because you enjoy them and you want to learn more. I knew that I wanted to be a scientist, so I wanted to start by learning what scientists do in labs.",
      "author": "PassaEP",
      "created": 1624225871,
      "upvotes": 20,
      "replies": {
        "h2h0zfk": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2h0zfk/",
          "text": "Amazing! You clearly have a lot of passion for science.",
          "author": "lotsofgrading",
          "created": 1624226110,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "h2higkw": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2higkw/",
      "text": "Being a student on my way to one of my top choice schools, I have to say the least helpful thing I ever did for my college app was email professors trying to get street cred through them. The most helpful thing I did was have a hobby which I sincerely loved, then happen to write my common app essay about it simply because of how outstanding of a force it had become in my life.",
      "author": "bigletterb",
      "created": 1624235921,
      "upvotes": 5,
      "replies": {}
    },
    "h2grhfi": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2grhfi/",
      "text": "hmm, I would agree with a lot of this ,however, I would like to give my story as an example on how this could work out. In my Junior year, I had the random thought to email about 20 professors at the closest university. I wanted to major in physics at the time, and I wanted to see what it's like to actually do it. I got in contact with one professor and started doing coding projects and physics projects with him. After about 5 months (august of that year) he asked me if I would be interested in joining the competitive rocketry team since they would be using his lab. I said yes and I joined the team. I am now the only high school student in the team and I am also an officer of all the engineering teams within the organization. (About 200 students). I am also the team lead of a hobby rocketry engineering team. I also found my roommate here and a lot of mentors and friends. I also decided to commit to this university this fall because of the team and the people. \n\nMy case is rare, but I am extremely grateful that I decided to email the professor. I didn't get to do the real research that I expected, but I got way more experience and connections. If I had to give one advice, it would be to do it because you are interested in the subject and want mentors or want to learn more. Don't do it because you think it'll look good on a resume. Professor will see the passion and be more willing to involve you in things they are doing. Also, before going into it, aim to have some experience and skills such as coding.",
      "author": "unmel03",
      "created": 1624221248,
      "upvotes": 27,
      "replies": {
        "h2gs818": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gs818/",
          "text": "I have no doubt that you are very talented! All the congratulations in the world for your success.",
          "author": "lotsofgrading",
          "created": 1624221626,
          "upvotes": 16,
          "replies": {
            "h2hgo90": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hgo90/",
              "text": "Thank you, appreciate it!",
              "author": "unmel03",
              "created": 1624234904,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "h2hpa04": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hpa04/",
      "text": "i bet high school students can be a pain to have in a lab cuz we don't know what we're doing lol",
      "author": "sushint",
      "created": 1624239813,
      "upvotes": 5,
      "replies": {}
    },
    "h2i2180": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2i2180/",
      "text": "really cause they always say the same thing, no",
      "author": "TheRealCornPop",
      "created": 1624246843,
      "upvotes": 2,
      "replies": {
        "h2j2et6": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2j2et6/",
          "text": "You actually get responses back?",
          "author": "Red-eleven",
          "created": 1624277956,
          "upvotes": 2,
          "replies": {
            "h2jfzaq": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2jfzaq/",
              "text": "yeah im just joking",
              "author": "TheRealCornPop",
              "created": 1624285579,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h2ialvi": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2ialvi/",
      "text": "My good professor sir, do you watch anime?",
      "author": "thsstudent",
      "created": 1624252771,
      "upvotes": 2,
      "replies": {
        "h2ivrhb": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2ivrhb/",
          "text": "I can neither confirm nor deny",
          "author": "lotsofgrading",
          "created": 1624272767,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h2i5f46": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2i5f46/",
      "text": "I've also questioned the preponderance of students recommending to others to cold email professors. Thanks for sharing your perspective that it seems unrealistic at best and bothersome and absurd at worst. I almost always deter prospective applicants from emailing professors. Admitted students who are deciding whether to enroll is a slightly different situation that might warrant reaching out.\n\nUltimately though at the end of the day students cold-email professors to get \"research\" or \"internship\" experience because the admissions review process rewards these efforts. They have to compete with the students who have family connections, so for that reason I don't necessarily blame students for this practice. They're responding to rules that they didn't write.\n\n>I think there are many more fulfilling ways to spend a summer. Scoop ice cream, learn how to repair clocks, volunteer in your community.\n\nThese things, though noble and normal, are less or not incentivized in holistic review at elite universities. The teenager summer job in elite/affluent communities is becoming a relic of previous generations. It's replaced by bullshit internships, inflated research credentials, and suspect non-profits.",
      "author": "ADMISSIONSMADNESS",
      "created": 1624249007,
      "upvotes": 4,
      "replies": {}
    },
    "h2k7lox": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2k7lox/",
      "text": "Thank you for posting this! I have begun wondering, with the influx of students cold emailing 50+ professors, what must be going through ya'lls minds. I think strangely enough research has become an EC which, when thought about, makes 0 sense. Since research isn't really just a tick-mark opportunity for a student, it supposed to be motivated by a will to study/improve something for a meaningful impact. So if a student is actually interested in doing research it should likely be motivated by a particular project that is of some significance for them and would help advance science in some way (no matter how seemingly small it may be). But I feel like some students have been tricked into thinking it is like a class, and that a professor will just step-by-step walk them through a process that they can use for a college application even if it means nothing to them. It is truly disheartening! This post should really clear many students burning questions surrounding the topic :D so thank you!",
      "author": "Substantial_Eyes",
      "created": 1624298112,
      "upvotes": 2,
      "replies": {}
    },
    "h2gd6ga": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gd6ga/",
      "text": "Interesting viewpoint. Definitely agree with the fact that some “research” isn’t really research. However, we’re high school students and have to start somewhere, even if that’s at the bottom.",
      "author": "Tiko1787",
      "created": 1624214205,
      "upvotes": 5,
      "replies": {
        "h2gdhdg": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gdhdg/",
          "text": "I hear what you're saying, but I'm trying to emphasize that we are not the bottom rung of your ladders.",
          "author": "lotsofgrading",
          "created": 1624214362,
          "upvotes": 68,
          "replies": {
            "h2geuzp": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2geuzp/",
              "text": "Ahh I see. I could not agree with you more!",
              "author": "Tiko1787",
              "created": 1624215066,
              "upvotes": 11,
              "replies": {
                "h2gip96": {
                  "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gip96/",
                  "text": "You're super kind. Have a great day!",
                  "author": "lotsofgrading",
                  "created": 1624217055,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            },
            "h2gizdd": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gizdd/",
              "text": "Eloquent :D",
              "author": "HereForA2C",
              "created": 1624217201,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h2gdnna": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gdnna/",
          "text": "The point, though is that you don't. You could do something else more reasonable for a high school student to do than to insert yourself into a research team where you aren't really doing research.",
          "author": "Lupus76",
          "created": 1624214451,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "h2hjzxu": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hjzxu/",
      "text": "What is an NPC and what is meant by \"professors are not NPCs\"?",
      "author": "ADifferentDimension",
      "created": 1624236784,
      "upvotes": 2,
      "replies": {
        "h2hzqup": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hzqup/",
          "text": "Non player characters like in a video game. OP is saying that professors aren’t npcs that you use to get ahead in the college admissions game; they are real people with their own lives who are really busy and whose first priority is mentoring their own students",
          "author": null,
          "created": 1624245453,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "h2gc3az": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gc3az/",
      "text": "I’m a rising senior. I’ve been working on a research paper for one year, being edited and revised by a publication that has Harvard research grads as editors. I had no family connection,live rural,and was fortunate to be mentored after the paper was nominated in a Data Analytics program I participated in via merit based acceptance. \n\nI’d disagree with the overall viewpoint here,but I’ll also admit there’s many affluent and connected kids that have this opportunity, if you are in an underrepresented area and these opportunities are not from a paid enrichment program,and the work is published,it’ll absolutely separate you from most applicants.",
      "author": "7katzonthefarm",
      "created": 1624213647,
      "upvotes": -16,
      "replies": {
        "h2gcjp8": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gcjp8/",
          "text": "I'm super impressed by your work and mean this post in no way as a criticism of you. The people who write your letters of rec are going to be able to emphasize what's distinctive about you and your work, and it's also going to be obvious in a plain description.",
          "author": "lotsofgrading",
          "created": 1624213880,
          "upvotes": 37,
          "replies": {
            "h2gdws3": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gdws3/",
              "text": "No offense taken, just wanted to let students know the differentiation of some research and why at times it’s beneficial . Also I agree with your emphasis on doing what you love so to speak: the research has easily been the most in-depth of anything I’ve done academically and shown me the complexity of statistics which although is amazing,I don’t plan on majoring in it!",
              "author": "7katzonthefarm",
              "created": 1624214581,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "h2gubpu": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gubpu/",
          "text": "Why r ppl downvoting u lol u were so polite",
          "author": "bloatedchimpanzee",
          "created": 1624222712,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "h2hdmbr": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hdmbr/",
      "text": "The problem is competition is making these kids pretend to have interest in things they have no interest in. If only we could just truly be ourselves and let the best man win but our education system is so backwards and favors the dumbest things.",
      "author": "dpsweeper",
      "created": 1624233127,
      "upvotes": 0,
      "replies": {
        "h2hf1qj": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hf1qj/",
          "text": "I get what you're saying, but no one is \"making\" anyone do anything.\n\nEdit: I've thought a little more and I want to try to be more understanding. I think the reason young people can be a self-absorbed sometimes is precisely because they're young. And because they're human. I understand why kids may feel they have to do this; I also think that feeling is misguided in both practical and ethical terms.",
          "author": "lotsofgrading",
          "created": 1624233963,
          "upvotes": 4,
          "replies": {
            "h2hiizj": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hiizj/",
              "text": "I think u misunderstood my point. I'm not saying it's right just saying why it happens. Me personally I hated how we were encouraged to do this \"for college apps\".",
              "author": "dpsweeper",
              "created": 1624235957,
              "upvotes": 0,
              "replies": {
                "h2iz02j": {
                  "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2iz02j/",
                  "text": ">Me personally I hated how we were encouraged to do this \"for college apps\".\n\nI'm guessing it was encouraged by people who aren't familiar with professors or with academia in general. And getting an undergrad degree, or even a Masters in many cases, does not make you particularly familiar with academia. So that probably covers all the adults in your life and certainly covers 100% of your peers. Even adcoms, if they have a Bachelors degree and then went straight to admissions, don't know what the academy is like *personally*.",
                  "author": "officially_anxious",
                  "created": 1624275471,
                  "upvotes": 1,
                  "replies": {}
                },
                "h2lqbg1": {
                  "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2lqbg1/",
                  "text": "Trying to be vague but my HS required/*strongly* encouraged us to do research with a mentor (usually a uni prof) so that we could get special recognition in the school district. There was a misconception that you couldn't graduate without doing research that nobody at the school bothered to correct. (One of my friends couldn't find a research position last year and panicked because she thought she wasn't going to graduate). I think one of the teachers explicitly said the justification for that was to help us \"stand out\" in the college process. Ultimately, even though I didn't care much for the idea of research at first, I'm really thankful for my experience and I found it very fulfilling. However, that doesn't mean I'm not irritated at the idea of forcing high schoolers to do things they don't care about just for college app points.",
                  "author": "orbital-velocity",
                  "created": 1624324815,
                  "upvotes": 1,
                  "replies": {
                    "h2lrml0": {
                      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2lrml0/",
                      "text": "Exactly this is the kind of stuff I'm talking about. The ppl who replied to me don't get it.",
                      "author": "dpsweeper",
                      "created": 1624325543,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h2hsdme": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hsdme/",
      "text": "completely agree - after finishing the college process ive realized just how sad it is for kids to do things solely for college apps. do things you like, even if they might not look impressive or cool to admissions officers/colleges!! don't just conform to what everyone else says seems good to colleges",
      "author": "photosynthesis8",
      "created": 1624241498,
      "upvotes": 1,
      "replies": {}
    },
    "h2j9mep": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2j9mep/",
      "text": "ok sorry this is irrelevant but when I saw this I was like “shigaraki???”",
      "author": "lion655",
      "created": 1624282441,
      "upvotes": 1,
      "replies": {}
    },
    "h2jfj5f": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2jfj5f/",
      "text": "I don't personally think that cold emailing is rude, but running on the expectation that professors are obligated to respond is completely stupid.",
      "author": "edgymemesalt",
      "created": 1624285355,
      "upvotes": 1,
      "replies": {}
    },
    "h2jn50a": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2jn50a/",
      "text": "I don’t have any free awards I can give but here if what I can give 🎖",
      "author": "Chillidawg64",
      "created": 1624289018,
      "upvotes": 1,
      "replies": {}
    },
    "h2gjd50": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gjd50/",
      "text": "what? i understand this is intended for the general population, but i personally have cold emailed uni professors in the past and landed positions, not because i \"had a professor as a family friend\" - besides the position, i was able to gain recognition on a certain level in the field (won't specify to prevent doxxing). \n\nthese posts are so useless and a waste of time on both parties to read and write",
      "author": null,
      "created": 1624217403,
      "upvotes": -27,
      "replies": {
        "h2glre2": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2glre2/",
          "text": "If you understand this is for the general public and not for people that actually made something out of their research position then your comment is a waste of time. If it doesn’t apply to you then move on. That’s it",
          "author": "agusttinaa",
          "created": 1624218659,
          "upvotes": 16,
          "replies": {}
        },
        "h2gt8px": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gt8px/",
          "text": "I am skeptical.",
          "author": "lotsofgrading",
          "created": 1624222156,
          "upvotes": 16,
          "replies": {
            "h2gym3b": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gym3b/",
              "text": "lol i'm literally first gen, i have no connections",
              "author": null,
              "created": 1624224892,
              "upvotes": -14,
              "replies": {}
            }
          }
        }
      }
    },
    "h2gqno0": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gqno0/",
      "text": " how do you separate the people who do significant work and the ones who fill spreadsheets?\n\nEdit: one more question, do think it's better to participate in summer research program than doing research with a professor?",
      "author": "HahaStoleUrName",
      "created": 1624220824,
      "upvotes": -2,
      "replies": {
        "h2grc75": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2grc75/",
          "text": "I don't separate anyone, since (thank goodness, I'm sure I wouldn't be good at it) I'm not an admissions officer! But presumably that information comes from letters of rec and also from plainly communicated facts in the application.\n\nI don't know what a summer research program is.",
          "author": "lotsofgrading",
          "created": 1624221173,
          "upvotes": 10,
          "replies": {}
        },
        "h2grgpi": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2grgpi/",
          "text": "This will typically come out when you are writing your resume and when you are actually put to work in future jobs.  If you can clearly explain what your research was about, how you conducted it, and what the impact was (and have the practical skills to show for all this), you clearly did the work.  If you don't have much to show for your time under the professor...well, you probably didn't hold a significant role or learn much from your role.\n\nIn terms of summer research program vs summer research under a professor, what you do with the opportunity matters more than the opportunity itself.  If you learned something that you can now use in future jobs, you have officially taken advantage of the opportunity and have new skills to make your resume more attractive to employers.  So the answer is actually a question.  Do you think you will do better in a summer research program or under a professor?",
          "author": "Mingoogreaty",
          "created": 1624221238,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h2gl6ii": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gl6ii/",
      "text": "Proof?\n\nWithout proof I'd think you're a student trying to get other students to have less impressive summers",
      "author": null,
      "created": 1624218353,
      "upvotes": -39,
      "replies": {
        "h2gocy2": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gocy2/",
          "text": "If that is the only possible explanation you can think of for this post, you must not understand how the professional world works.",
          "author": "Mingoogreaty",
          "created": 1624219812,
          "upvotes": 23,
          "replies": {}
        },
        "h2gqd6m": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gqd6m/",
          "text": "Lol, goodness. Absolutely nobody in the real world gives an F about how impressively high schoolers spent their summers.",
          "author": "Lassinportland",
          "created": 1624220675,
          "upvotes": 19,
          "replies": {}
        },
        "h2gn4us": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gn4us/",
          "text": "The mods can write to me to verify if it's important. If you look at my post history, it should be reasonably easy to tell that I know what I'm talking about.\n\nEdit: I wish I had thought to say in the original reply that it's weird that I said, \"Please remember that professors are human beings,\" and your response is, \"You're trying to get people to have less impressive summers.\"",
          "author": "lotsofgrading",
          "created": 1624219343,
          "upvotes": 31,
          "replies": {}
        }
      }
    },
    "h2gt3sr": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gt3sr/",
      "text": "I would caution against dismissing people who do research so quickly and with such a blanket statement as I believe it’s unfair to those of us who put the work in.Not everyone got research through connections. Many people on here including me just got lucky through cold email. Also, many people actually help in the research process and don’t just clean test tubes.",
      "author": "ejkensjskwnsnsks",
      "created": 1624222084,
      "upvotes": -21,
      "replies": {
        "h2gv9k4": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gv9k4/",
          "text": "This isn't a post \"about\" you, in the sense that you think it is. It's an effort to humanize college professors in an online space that often treats people who are not high school students as a means to an end. It's not a blanket statement dismissing you. If recognizing the humanity of others makes you feel diminished, there might be an opportunity here.",
          "author": "lotsofgrading",
          "created": 1624223198,
          "upvotes": 21,
          "replies": {
            "h2gyleg": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gyleg/",
              "text": "Absolutely agree. Great point.",
              "author": "Cooly09",
              "created": 1624224882,
              "upvotes": 5,
              "replies": {}
            },
            "h2gytfw": {
              "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gytfw/",
              "text": "I I agree with the general premise of your posts and definitely think some people look at research the wrong way and basically try to exploit the professors. I just wanted to object to that one thing you mentioned about connections.",
              "author": "ejkensjskwnsnsks",
              "created": 1624224997,
              "upvotes": -13,
              "replies": {
                "h2gzhud": {
                  "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2gzhud/",
                  "text": "Fair enough! Please don't take what I've said as a criticism of your research - I'm sure your case is different, as I mentioned in the original post, and your talent will be clear in both your letters of recommendation and the plain facts you use to communicate your work.",
                  "author": "lotsofgrading",
                  "created": 1624225354,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h2hrgda": {
      "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2hrgda/",
      "text": "[deleted]",
      "author": null,
      "created": 1624240991,
      "upvotes": 0,
      "replies": {
        "h2idghm": {
          "link": "/r/ApplyingToCollege/comments/o4bncq/college_professors_are_not_npcs/h2idghm/",
          "text": "While this is somewhat true, it would be more useful for college students than HS students. HS students using their school email would just end up in a professors spam folder or in their inbox with a lot of other important emails on top. \n\n“I am always asked what class I’m in” isn’t for everyone. I am currently a research assistant in a lab that is completely unrelated with my major, however, very tailored to my interests (this, I was asked about in the interview). \n\nI think your comment may need some clarification and it has no correlation with OPs overall post. Maybe you can create another post on A2C about this for anyone that is interested in conducting research in HS.",
          "author": "leeeelihkvgbv",
          "created": 1624255134,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}