{
  "sid": "qvuj1i",
  "link": "/r/ApplyingToCollege/comments/qvuj1i/admissions_for_those_who_have_dropped_out_and/",
  "title:": "Admissions for those who have dropped out and taken HS equivalency exam",
  "text": "Hey guys, I'm a Korean 16-year-old who has taken the 검정고시(South Korean GED). I plan on going to a 4-year college directly with the 검정고시 and getting high SAT scores, and plan to do  Volunteer work as well on getting certifications(possibly Computer Language, but I plan on a different major). However, I'm kinda worried on getting recommendations since I dropped out of HS immediately. Can I possibly get my recommendations from my middle school teachers or any tips otherwise?\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nP.S. My parents suppose I go into a 4 year and tell me to apply to CC as a last resort. Also I'm a US citizen, so I'm also curious about TOEFL, as my first language is Korean. Does college require TOEFL scores for US citizens that their first language is not English?",
  "author": "MultipleLanguages",
  "created": 1637136878,
  "updated": 1637178991,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hkyw3b5": {
      "link": "/r/ApplyingToCollege/comments/qvuj1i/admissions_for_those_who_have_dropped_out_and/hkyw3b5/",
      "text": "Some schools like Princeton will make you take it if, “English is not your native language and you are attending a school where English is not the language of instruction”. Other schools like Arizona State University will let you pass by being a US citizen",
      "author": "carlyc999",
      "created": 1637140981,
      "upvotes": 2,
      "replies": {}
    },
    "hkyysjg": {
      "link": "/r/ApplyingToCollege/comments/qvuj1i/admissions_for_those_who_have_dropped_out_and/hkyysjg/",
      "text": "Yes they require TOEFL but some are okay with high SAT scores too",
      "author": "InvictusHomo",
      "created": 1637143305,
      "upvotes": 1,
      "replies": {}
    }
  }
}