{
  "sid": "qasf74",
  "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/",
  "title:": "GPA vs SAT",
  "text": "All else equal, would a college take a student with a higher SAT score and a lower GPA over a student with a lower SAT score and a higher GPA? Talking t20s.\n\nJust curious as to what y'all think :D",
  "author": "KidNo711",
  "created": 1634580748,
  "updated": 1634653098,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hh4xzzf": {
      "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh4xzzf/",
      "text": "Lower SAT. Especially if they go test-optional.",
      "author": "Stq1616",
      "created": 1634580989,
      "upvotes": 5,
      "replies": {
        "hh50qdt": {
          "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh50qdt/",
          "text": "I dont mean test optional, just sat vs gpa. 😅",
          "author": "KidNo711",
          "created": 1634582111,
          "upvotes": 1,
          "replies": {
            "hh51pvf": {
              "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh51pvf/",
              "text": "Even if they submit a test, high GPA/low SAT is generally considered better by colleges than low GPA/high SAT (even though IMO it should be the other way around)",
              "author": "Stq1616",
              "created": 1634582510,
              "upvotes": 1,
              "replies": {
                "hh5lmf6": {
                  "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh5lmf6/",
                  "text": "3+ years of school versus one test score?? GPA sounds like a better indicator",
                  "author": "Any-Fox-9615",
                  "created": 1634591056,
                  "upvotes": 6,
                  "replies": {
                    "hh5m5z0": {
                      "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh5m5z0/",
                      "text": "Yeah — if GPA were standardized I'd be in full agreement without you; however, it's not, and IMO the advantages of test scores being standardized are greater than the advantages of GPA reflecting your entire HS career.",
                      "author": "Stq1616",
                      "created": 1634591393,
                      "upvotes": 2,
                      "replies": {
                        "hh5mc4z": {
                          "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh5mc4z/",
                          "text": "Yeah, except for the fact that standardized tests heavily favor the affluent who can afford to spend lots of money and free time on preparation. Both are flawed in their own way but regardless I think long term academic record should be prioritize above, as I stated before, one single test",
                          "author": "Any-Fox-9615",
                          "created": 1634591500,
                          "upvotes": 4,
                          "replies": {
                            "hh5sb9j": {
                              "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh5sb9j/",
                              "text": "Ehhhh, I personally feel like the effect of money on SAT scores is over-stated (IMO the main thing causing the correlation between family income and SAT scores is that richer families' kids have more academic knowledge due to quite simply having better schools, and the US system is mildly hypocritical for calling the SAT elitist and then weighting EC/essays which actually do have a strong correlation with family income a ton), but I can somewhat see your point (even if I still disagree).",
                              "author": "Stq1616",
                              "created": 1634594224,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "hh6c69f": {
                              "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh6c69f/",
                              "text": "Paid tutoring has been shown to only confer a 10-20pt. boost. GPA is statistically more correlated with income.",
                              "author": "KingKonchu",
                              "created": 1634603680,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hh51uv2": {
                  "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh51uv2/",
                  "text": "I think you are right... I think it should be the other way around too 🤣. Standardized tests are the most even playing field at the end of the day.",
                  "author": "KidNo711",
                  "created": 1634582567,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh4y2i0": {
      "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh4y2i0/",
      "text": "Depends on course load like if it’s lower gpa in harder classes then likely that would be picked over higher gpa in equally hard classes without sat. Though I would like to add that as long as SAT is greater than 1500 it does not matter. Though the numbers for t20s don’t really matter as the main deciding factor would be activities and essays.",
      "author": "TritonTheCat",
      "created": 1634581017,
      "upvotes": 3,
      "replies": {}
    },
    "hh5de44": {
      "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh5de44/",
      "text": "Only real caveat is how rank and HS specific grade inflation/deflation enter into this. Based on matriculated students:\n\n25th percentile SAT + 75th percentile grades is almost always better than the other way around. But that’s where rank and Hs placement history can come in. Because a 3.8 UW at one HS could be a 3.95 UW taking the exact same courses at another.",
      "author": "ChampionshipPerfect5",
      "created": 1634587274,
      "upvotes": 3,
      "replies": {}
    },
    "hh5syc4": {
      "link": "/r/ApplyingToCollege/comments/qasf74/gpa_vs_sat/hh5syc4/",
      "text": "GPA is more important to college admissions than standardized test scores.\n\nDepends on the relative scores, of course.  I’d take a 3.99/1600 over a 4.00/1200.",
      "author": "RichInPitt",
      "created": 1634594511,
      "upvotes": 2,
      "replies": {}
    }
  }
}