{
  "sid": "r2nsqm",
  "link": "/r/ApplyingToCollege/comments/r2nsqm/would_i_qualify_as_instate_for_rutgers/",
  "title:": "Would I qualify as in-state for Rutgers?",
  "text": "I am a US citizen currently living outside of the US, but I have one parent (also a US citizen) currently living in New Jersey, and I lived there for 13 years before moving. My family pays NJ resident taxes. I thought that I would still qualify as in-state because of these reasons, even though I currently go to school and live in another country, so I didn't think about it. But I recently decided to read the Rutgers website on this, and the first line is \n\n>The Rutgers University [**policy**](http://nbregistrar.rutgers.edu/forms/ResidencyPolicy.pdf) is governed by New Jersey Administrative Code 9A:5 which requires that individuals be domiciled within the state of New Jersey for at least one year immediately prior to enrollment. \n\nwhich worried me since I myself haven't been in New Jersey for so long, even though my family still has a house there and I still consider myself to be living there (just somewhere else due to school right now, unable to go back because of the pandemic). I am not a citizen of the country I am currently in, but I do have permanent residence for the time being. I'm not too sure of my parents' tax situation, and I'm not too sure my parents are either since they normally ask their employers for help while filing, but I do know that we pay resident taxes for NJ since I am a dependent of my parents who have their permanent residence there. \n\nI'm reviewing the residency form right now, and it looks like I have boxes that I am able to check (eg. \"\n\n>I CLAIM NEW JERSEY RESIDENCY FOR TUITION PURPOSES AS a DEPENDENT of NEW JERSEY RESIDENT PARENT(S) or U.S. COURT APPOINTED LEGAL GUARDIAN(S)\n\nor Part IIA being filled out by\n\n>Your PARENT(S) or LEGAL GUARDIAN(S) (Legal Guardian is defined as a principal appointed by a U.S. Court to act \"in loco parentis\"  for a minor {a person under 18 years of age}) if you are claiming residency as a \" DEPENDENT STUDENT \"\n\nwhich makes me think that I am still eligible, but I'm still not sure. Would I still be considered in-state?",
  "author": "92coups17",
  "created": 1637934221,
  "updated": 1638205787,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.8,
  "comments": {
    "hm5jhy4": {
      "link": "/r/ApplyingToCollege/comments/r2nsqm/would_i_qualify_as_instate_for_rutgers/hm5jhy4/",
      "text": "If I were you, I'd want an answer directly from Rutgers instead of some rando on A2C.",
      "author": "jayphoward",
      "created": 1637934328,
      "upvotes": 9,
      "replies": {
        "hm8hqtt": {
          "link": "/r/ApplyingToCollege/comments/r2nsqm/would_i_qualify_as_instate_for_rutgers/hm8hqtt/",
          "text": "you have a point. thanks!",
          "author": "92coups17",
          "created": 1637985564,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm65drk": {
      "link": "/r/ApplyingToCollege/comments/r2nsqm/would_i_qualify_as_instate_for_rutgers/hm65drk/",
      "text": "I'm in almost the exact same situation, but with Illinois, and from what I can see it's more or less the same policy. Basically owning property/paying taxes doesn't matter. You need to have at least one parent that has been living in NJ as their fixed and permanent residence for at least a year, even if you are in a foreign country at the time, assuming you're a dependent student.",
      "author": "papisalamander",
      "created": 1637945080,
      "upvotes": 3,
      "replies": {}
    },
    "hm5kldg": {
      "link": "/r/ApplyingToCollege/comments/r2nsqm/would_i_qualify_as_instate_for_rutgers/hm5kldg/",
      "text": "Email the admissions office",
      "author": "TritonTheCat",
      "created": 1637934957,
      "upvotes": 2,
      "replies": {}
    },
    "hm5s7mn": {
      "link": "/r/ApplyingToCollege/comments/r2nsqm/would_i_qualify_as_instate_for_rutgers/hm5s7mn/",
      "text": "Doubtful. You don’t live there and it doesn’t matter that you used to. If just having a residence counted people could just buy a cheap trailer in a state that they wanted to go to college in and say they are residents. I would still call and ask though.",
      "author": "T123369",
      "created": 1637939012,
      "upvotes": 2,
      "replies": {}
    }
  }
}