{
  "sid": "qoi41m",
  "link": "/r/ApplyingToCollege/comments/qoi41m/common_app_essay_idea/",
  "title:": "Common app essay idea",
  "text": "I'm thinking of writing my essay about how I was embarrassed to speak my native language in the public with my family when I moved to the US, and then overcome that fear and become proud of my culture, identity, etc. Do you think this is a good idea? And which aspects of this story should I focus the most on my essay?",
  "author": "alys_saa",
  "created": 1636263374,
  "updated": 1636654494,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hjnc82u": {
      "link": "/r/ApplyingToCollege/comments/qoi41m/common_app_essay_idea/hjnc82u/",
      "text": "Seems fine to me! Just remember that a lot of other kids will be writing about similar experiences and in general will have similar messages as you (having pride in unique culture, etc). The way you spin your essay and your unique voice should come through in your writing!",
      "author": "Affectionate_Street2",
      "created": 1636267824,
      "upvotes": 11,
      "replies": {}
    },
    "hjpin75": {
      "link": "/r/ApplyingToCollege/comments/qoi41m/common_app_essay_idea/hjpin75/",
      "text": "Hello there!\n\nYour idea is great! The Common App essay gives colleges the opportunity to learn more about you as a person and what is important to you. You should use this space to tell your story and reveal different facets of your personality.\n\nYou have the chance to delve deeper into your interests, experiences, passions, and strengths. You can discuss almost anything you want, provided your topic addresses the prompt you have chosen. There are also no rules on style or how to tell your story.\n\nYou can find the Common App essay prompts and instructions by navigating to the \"Common App\" tab on your Common App account and clicking on \"Writing\". You will get to choose one of seven prompts to respond to, and your essay must be between 250 and 650 words long.\n\nBest wishes in your academic pursuits!",
      "author": "StudyCrumb",
      "created": 1636311982,
      "upvotes": 1,
      "replies": {}
    }
  }
}