{
  "sid": "qhkxvb",
  "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/",
  "title:": "EC advice for PoliSci",
  "text": "I'm a junior but my school (it's international but a US school and I'm a US citizen). I'm interested in political science and want to know if there are any good extracurricular for applying to top colleges. there are virtually no work opportunities for teenagers here and because my school is so small, there are no clubs that are like organizations (MUN, stuff like that). any advice? My stats are pretty good (gpa and test scores) so I just want to round out my application.\n\nedit: forgot to mention that my school has a hybrid schedule for COVID stuff. only on campus twice a week and no options for clubs. it really sucks and I don't think it will change anytime soon",
  "author": "pauliticks",
  "created": 1635420682,
  "updated": 1635455746,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.74,
  "comments": {
    "hidb3p4": {
      "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hidb3p4/",
      "text": "I'm not sure, and I know this comment won't be as helpful as the others. However, I am interested in psychology. May I know your reason for showing interest in polsci?",
      "author": "SnooSuggestions5585",
      "created": 1635421519,
      "upvotes": 1,
      "replies": {
        "hidbokm": {
          "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hidbokm/",
          "text": "well these days politics really does everything. I strongly dislike a lot about the current political system in the US and think that it's important to understand the world around us. I would focus more about world politics than only US. and random YouTube videos about political theory really interest me. i think studying politics can also help with understanding of history (which I absolutely love but don't see myself majoring in it) and economics. but psychology is really interesting too I just don't think I would personally want to pursue that / have an occupation in that field",
          "author": "pauliticks",
          "created": 1635421879,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hidwmds": {
      "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hidwmds/",
      "text": "Oh you could get involved in politics. I worked on some federal campaigns in last year’s cycles or like any big activism org is great to get involved in too as well dem campaigns during election seasons",
      "author": "loserlake420",
      "created": 1635432050,
      "upvotes": 1,
      "replies": {
        "hidx02e": {
          "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hidx02e/",
          "text": "well the thing is I live in Egypt and teenage involvement in politics is kinda nonexistent.. and also even if I had connections, free speech in journalism and in general isn't a very big thing here. most of the laws are heavily influenced by sharia (Islamic)",
          "author": "pauliticks",
          "created": 1635432206,
          "upvotes": 1,
          "replies": {
            "hidy8gz": {
              "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hidy8gz/",
              "text": "Ah I’m so sorry - I missed the international part and that was pretty tone deaf of me to assume anyone has access to political work",
              "author": "loserlake420",
              "created": 1635432709,
              "upvotes": 1,
              "replies": {
                "hie4ebe": {
                  "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hie4ebe/",
                  "text": "no worries :)",
                  "author": "pauliticks",
                  "created": 1635435224,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hieaths": {
      "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hieaths/",
      "text": "Good question. Have you talked to your counselors at school? They might have some ideas. If you are able to travel to the US/out of Egypt for the summer, you might be able to do something substantive like a summer program related to political science. You might also try googling around for remote or online political science opportunities, similar to citizen science volunteering. For example: https://www.speakeasypolitical.com/10-impactful-and-important-virtual-volunteer-opportunities/.",
      "author": "msbzmsbz",
      "created": 1635437761,
      "upvotes": 1,
      "replies": {
        "hiedmyu": {
          "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hiedmyu/",
          "text": "well my mom is actually my secondary principal and does everything related to college apps. my us family is from south Carolina and live in a very small conservative town and I'm very not conservative so I don't think I could do anything but I have a possibility to intern at the Hague (Netherlands). one party leader is friends with my parents so hopefully that could happen. but I also don't want colleges to just think I made it through connections",
          "author": "pauliticks",
          "created": 1635438859,
          "upvotes": 1,
          "replies": {
            "hief0kz": {
              "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hief0kz/",
              "text": "So does your mom have any ideas? I would try for the internship and also look into possibilities in SC - they also have a Democratic Party there that must need volunteers. Or, are you concerned about your family criticizing you doing that? I would think that they also have some nonpartisan options there as well.",
              "author": "msbzmsbz",
              "created": 1635439397,
              "upvotes": 1,
              "replies": {
                "hieh5ob": {
                  "link": "/r/ApplyingToCollege/comments/qhkxvb/ec_advice_for_polisci/hieh5ob/",
                  "text": "yeah well I don't think my family would love volunteering for the Democratic party because we stay with my grandmother who is very anti-abortion, -lgbt rights, etc. but I could look into some nonpartisan options I guess. i would probably look for some environmental campaign. although would just one month or so mean much? the hague internship (if it happened) would be in late June then i'd be in SC until August. thanks so much for your help!",
                  "author": "pauliticks",
                  "created": 1635440219,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}