{
  "sid": "kl48bz",
  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/",
  "title:": "Why do colleges expect so much?",
  "text": "Why do colleges expect 17 year olds to have done research, interned at a well known Fortune 500, played an instrument in Carnegie Hall, and received a medal from the president all while still getting a 4.0 GPA and a 1600 SAT? Not everyone has access to all these opportunities and students will be left feeling inadequate. Yeah some people have done these but it’s unfair to use this as a benchmark. When even one student does it, it becomes sort of a standard you have to fulfill. Although colleges don’t say it, they expect you to do it as there are so many students out here seeing it as a requirement for admission. It’s just too much. We’re children. When did the process get so high stakes? EDIT: ok yeah guys colleges don’t expect that, but pressure is rising. Also I’m not talking about me, I’m talking about others on this sub under pressure.",
  "author": null,
  "created": 1609078081,
  "updated": 1634076329,
  "over_18": false,
  "upvotes": 2157,
  "upvote_ratio": 0.96,
  "comments": {
    "gh78tvf": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh78tvf/",
      "text": "[deleted]",
      "author": null,
      "created": 1609090239,
      "upvotes": 395,
      "replies": {
        "gh84bq6": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh84bq6/",
          "text": "This is a good assessment! Colleges will get 20-30% of students that they would like to admit automatically given their ECs but then there are many other things at play. Having a well written app is important as also trying to come across genuine.",
          "author": "wertu1221",
          "created": 1609106263,
          "upvotes": 20,
          "replies": {}
        },
        "gh88b5p": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh88b5p/",
          "text": "I agree with this a lot. Its really not about doing a ton of things but writing an application that makes it SEEM like you did a lot. Of course, having actually done those things helps to write about them, but you have to focus on presenting things in the best light possible. Also the essay. You could have shit extracurriculars but write a banger essay and get in. To me, putting in 10+ hours on a single essay is worth it to possibly change the rest of my life trajectory.",
          "author": "Ultimatun",
          "created": 1609108336,
          "upvotes": 11,
          "replies": {}
        },
        "gh7975r": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7975r/",
          "text": "True but you see all these applicants now scrambling for research positions, which will definitely raise admission standards so colleges will look for people like that. It’s a never- ending cycle.",
          "author": null,
          "created": 1609090436,
          "upvotes": 66,
          "replies": {
            "gh7bv45": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bv45/",
              "text": "[deleted]",
              "author": null,
              "created": 1609091856,
              "upvotes": 160,
              "replies": {
                "gh7kkxb": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7kkxb/",
                  "text": "Hell, there's even plenty of undergrads who get admitted to grad school without research. Less significantly than high school students to colleges, but still",
                  "author": "Violyre",
                  "created": 1609096310,
                  "upvotes": 43,
                  "replies": {}
                },
                "gh7f38y": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7f38y/",
                  "text": "Well said.  I wish there were about 100 more of you on this sub.",
                  "author": "jupiter_josh",
                  "created": 1609093530,
                  "upvotes": 54,
                  "replies": {}
                },
                "gh86jql": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh86jql/",
                  "text": "The shit that some people on this sub and others like it sometimes makes me really anxious for decisions. Thanks for this, it reminded me that we really aren't expected to have done the crazy ECs that feel normal after spending a lot of time online.",
                  "author": "NeedRedditForSchool",
                  "created": 1609107422,
                  "upvotes": 17,
                  "replies": {}
                },
                "gh7doen": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7doen/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1609092806,
                  "upvotes": -3,
                  "replies": {
                    "gh7gdqi": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gdqi/",
                      "text": "I don't think so. HS students (and many undergraduates) have no idea where they need to be academically to do any real research. In short: they don't know what they don't know.\n\nWhen you're doing research, you're standing on the shoulders of all the giants who came before you.\n\nPeople at a high-school level are walking around the feet of the bottom-most giants and have yet to even start climbing.\n\nTake something hyper-meritocratic like mathematics as an example.\n\nEven high-schoolers who are international Math Olympiads have yet to scratch the surface of the breadth and depth of modern mathematics.\n\nDo they have potential? Of course! Do they know enough to publish original results on topics that haven't already been beat to death by mathematicians for thousands of years? Hell no.\n\nSrinivasa Ramanujan is perhaps one of the greatest (if not \\*the greatest\\*) largely self-taught mathematicians and even he didn't have much to say until his 20's and a decent amount of it was not original. It wasn't until he tutored under Littlewood & Hardy at Cambridge that he turned into a mathematical giant in his own right.",
                      "author": "jupiter_josh",
                      "created": 1609094191,
                      "upvotes": 32,
                      "replies": {
                        "gh90m6b": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh90m6b/",
                          "text": "Couldn’t emphasize this enough. The original post really gave an entitled, bitter vibe but I think this response exactly sums up how invalid it was. As a freshman at Swarthmore College where most people don’t even know what they want to do for sure, to say college admissions use kids with a perfect resume doing research is the standard is almost disrespectful to people actually doing research 😭 just finishing up my fall semester I can’t emphasize how much I learned about what I don’t know, coming my from my HS position of not even knowing what I don’t know. Seeing the mountains the giants have climbed that I must now do myself is EXTREMELY intimidating, especially at a school like Swat. These T20 schools truly just want to see evidence that you’d be capable and passionate enough to do what the giants of history have done already",
                          "author": "deven_ayambem",
                          "created": 1609123240,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "gh7glq3": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7glq3/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1609094304,
                          "upvotes": 0,
                          "replies": {
                            "gh7h0rr": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7h0rr/",
                              "text": "I think you're missing my point of where you think you're at in your ability to assist.\n\nThere's a saying at one of the research laboratories in the US, that \"you need to have a Master's degree just to be qualified to wash the chalkboard.\"\n\nWith all respect, high school students aren't even qualified to wash the chalkboard in most cases.\n\nEDIT: I firmly believe that most of the talk about \"research\" is largely the result of the fact that online communities like A2C are largely echo-chambers.",
                              "author": "jupiter_josh",
                              "created": 1609094512,
                              "upvotes": 15,
                              "replies": {
                                "gh8sm9l": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8sm9l/",
                                  "text": "This seems overboard and just discouraging to younger people interested in research. Sure there's labs where a high schooler doesn't have the basics to start helping, but there are plenty of labs where they can learn enough to assist at a technician level. Especially in life science or social science labs.\n\nIn a social science lab I collaborated with while in college, a high schooler planned and executed an entire experiment by herself and presented a couple posters. I helped her with the data analysis and of course she got a lot of support from the profs, but she did work comparable to an undergraduate thesis.",
                                  "author": "dobbysreward",
                                  "created": 1609119039,
                                  "upvotes": 4,
                                  "replies": {
                                    "gh8u7mf": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8u7mf/",
                                      "text": "The posts had nothing to do with deterring students from climbing the mountain, it was merely indicating how high the mountain was that they needed to climb, and the observation that they are at the foot of it.\n\nThe social/behavioral sciences (my SO is a Psych PhD) is one of the few places where you can do experiments with little training (and a lot of emotional intelligence btw (e.g., the ability to be straight-faced)) but I left this information out for the sake of brevity. \n\nThe reality is that in most cases to say that someone at a high school level (or even at an undergraduate level) can participate in a way that is something other than hired labor is pandering.",
                                      "author": "jupiter_josh",
                                      "created": 1609119903,
                                      "upvotes": 3,
                                      "replies": {
                                        "gh8w2qu": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8w2qu/",
                                          "text": "> I think you're missing my point of where you think you're at in your ability to assist.\n\nThen maybe you're misunderstanding what students mean when they say \"research\" or \"assist\". Obviously no high schooler or undergrad thinks they're qualified to lead their own labs, but in many fields they are qualified and able to assist (beyond washing glassware).\n\nIt's also unclear why you're calling social/behavioral sciences \"one of the few\" when it encompasses a lot of fields and labs. I think there's fewer fields where a high schooler can't help.",
                                          "author": "dobbysreward",
                                          "created": 1609120882,
                                          "upvotes": 0,
                                          "replies": {
                                            "gh8xvix": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8xvix/",
                                              "text": "I'm going to let you strum your kumbaya-guitar. \n\nThe real world keeps on spinning regardless.",
                                              "author": "jupiter_josh",
                                              "created": 1609121828,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                },
                                "gh7hfa8": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hfa8/",
                                  "text": "Oh absolutely. I don’t meant assist as in actually helping in research. For HS seniors, maybe like bringing them coffee? College seniors can do much more.",
                                  "author": null,
                                  "created": 1609094717,
                                  "upvotes": 1,
                                  "replies": {
                                    "gh7i93e": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7i93e/",
                                      "text": "No, the thread was about high-school seniors. Stop trying to spin your comments and turn your listening-ears on for a change :-p\n\nBut to answer your question. Undergrads aren't much better. Undergrads can can in some cases participate in research as gophers, but a professor is looking for folks that he/she knows will be there for the long-haul and won't flake-out on  them.\n\nUsually the only people who fit that criteria are Graduate Assistants (the capitalization is on purpose as they are employed by the university) who are themselves in pursuit of a PhD.",
                                      "author": "jupiter_josh",
                                      "created": 1609095128,
                                      "upvotes": 11,
                                      "replies": {
                                        "gh7ikdf": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ikdf/",
                                          "text": "Oops. I meant assist as in the coffee stuff then haha.  Oh yeah. It’s kind of weird how restricted research is but people are supposed to have some related experience in them? (talking about for med schools) I’ve seen a lot of these sites say med school AOs expect it?",
                                          "author": null,
                                          "created": 1609095287,
                                          "upvotes": 6,
                                          "replies": {
                                            "gh7rih1": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7rih1/",
                                              "text": ">*I’ve seen a lot of these sites*\n\nThese are also echo-chambers. Reality is much different from what's discussed online.\n\nSince you mentioned med school, I'll give you a free tip and then I'm done with this thread:\n\nOne of the traps that many ambitious high-schoolers fall into (especially those who want to go into Medicine) is that they focus so much on the long-term that they make planning mistakes in the short-term.\n\nThe biggest planning mistake they make is that they just \\*\\*assume\\*\\* that they will succeed in undergrad and that they will \"get in\" to med school (or law school or whatever) when in reality the odds of this happening is much much lower. STEM is hard. Full stop. You will have a hard time just keeping up with your coursework that you'll forget that you ever wanted to spend your minuscule amount of free time helping a professor with research.\n\nI would put the estimate at somewhere around 2 out of every 10 randomly selected high school students who want to become medical doctors actually become medical doctors.\n\nThe smart play is to focus on being employable with your undergraduate degree rather than just assuming that your undergrad degree will just be a stepping-stone to something better. \n\nMajoring in biology, for instance, is a bad move for most people because the major is notoriously difficult to get a job with at the Bachelor's level. Chemical engineering, for instance, will better prepare you in terms of academic rigor that more closely approximates the med school experience and has the benefit of being highly employable if you choose not to be a medical doctor.",
                                              "author": "jupiter_josh",
                                              "created": 1609099871,
                                              "upvotes": 5,
                                              "replies": {
                                                "gh9if17": {
                                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9if17/",
                                                  "text": "Oh yeah absolutely. As a prospective med school student myself,  I know that: \n\n1. Chances of me, an international student, getting into a US med school is 0.01% \n2. Pre-med is hard for EVERYONE \n\nI don’t know why people go into college, taking up a biology major, pre-med and expect to get into medical school. It’s just that biology major is very vague now and not many job prospects now. I, personally, plan to take up petroleum engineering or the like. Complete all pre reqs, maybe I get into med school, maybe I don’t, I still have a career to fall back on. This is all just way into the future though. \n\nEDT: also, I’m not trying to ‘spin my comments.’ At all. Just literally forgot what I was talking about.",
                                                  "author": null,
                                                  "created": 1609133891,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gh7eouj": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7eouj/",
                      "text": "Not gradually either. I dont see it in this sub at all. Theres a lot of colleges and not even the prestigious ones ask for any research projects.",
                      "author": "thejimmycan",
                      "created": 1609093332,
                      "upvotes": 17,
                      "replies": {
                        "gh7f20z": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7f20z/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1609093513,
                          "upvotes": -2,
                          "replies": {
                            "gh7fhuj": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fhuj/",
                              "text": "There will always be people better than you, and there will be people jealous of you. That's just the game when you apply. Colleges understand that people come from different places and have access to different resources. Yeah there's metrics like grades and tests, but even that will be gone soon. Colleges in california are test optional. I work as a college counselor at a nonprofit in Los Angeles. Some of the students have gone to USC and UCLA, I can assure you that no one has done any research project.",
                              "author": "thejimmycan",
                              "created": 1609093738,
                              "upvotes": 15,
                              "replies": {
                                "gh7jm31": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7jm31/",
                                  "text": "Thank you for this!! I don't love the focus on doing research for applications. to me, it feels like a product of where you're from/who you know, and if you don't have connections, then you're outta luck. :)",
                                  "author": "spineappletwist",
                                  "created": 1609095815,
                                  "upvotes": 5,
                                  "replies": {}
                                },
                                "gh7fr13": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fr13/",
                                  "text": "Yeah you’re right. I’m just stressed and seemed to think standards are way above than what they are. Whatever a person can do in their capability is enough tbh.",
                                  "author": null,
                                  "created": 1609093870,
                                  "upvotes": 2,
                                  "replies": {
                                    "gh7fv1d": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fv1d/",
                                      "text": "I understand your frustration. Are you a junior or a senior?",
                                      "author": "thejimmycan",
                                      "created": 1609093926,
                                      "upvotes": 2,
                                      "replies": {
                                        "gh7fyrp": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fyrp/",
                                          "text": "I’m a senior haha.",
                                          "author": null,
                                          "created": 1609093979,
                                          "upvotes": 1,
                                          "replies": {
                                            "gh7gevl": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gevl/",
                                              "text": "Applications are mostly done for colleges, you shouldn't worry so much after you've applied. Focus on scholarships and school. I remember finding typos in my essay after I already submitted it, I still got into UCSD.",
                                              "author": "thejimmycan",
                                              "created": 1609094207,
                                              "upvotes": 2,
                                              "replies": {
                                                "gh7h1sh": {
                                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7h1sh/",
                                                  "text": "Thank you!!",
                                                  "author": null,
                                                  "created": 1609094526,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "gh7s80b": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7s80b/",
                              "text": "Yes...the same way people who do Model UN might have some edge over those who don't, etc. Colleges just want to see you're involved in something with your time, whether that's research or starting a small business or robotics or whatever.",
                              "author": "blazingminotaur",
                              "created": 1609100236,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gh7ro1s": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ro1s/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1609099952,
                      "upvotes": 4,
                      "replies": {
                        "gh9hx59": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hx59/",
                          "text": "True.",
                          "author": null,
                          "created": 1609133535,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gh84iha": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh84iha/",
              "text": "research is overrated. lots of people don't even know what it is like to do proper research and claim to have done research. it is a trend that you see these days just like having your own nonprofit which doesn't necessarily give you an edge.",
              "author": "wertu1221",
              "created": 1609106360,
              "upvotes": 9,
              "replies": {
                "gh9h215": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9h215/",
                  "text": "Right.",
                  "author": null,
                  "created": 1609132923,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gh8ww7x": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8ww7x/",
          "text": "It’s kind of late to ask but my writing I feel is soooo bad and I find it difficult to sit down and actually write. What’s the best advice for a procrastinator with a tendency for wordiness and not even in the sense of imagery just big ass words are my automatic cop out for writing?",
          "author": "DatBoroJunichi",
          "created": 1609121317,
          "upvotes": 4,
          "replies": {}
        },
        "gh8a47a": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8a47a/",
          "text": "this. jesus christ they just want to see that you’re not a two dimensional person and that you’re genuinely passionate about your major.",
          "author": "Empty_Tree",
          "created": 1609109271,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "gh72wjx": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh72wjx/",
      "text": "The whole reaserch thing is what *really* upsets me. Why are we allowing 17 year olds to publish reaserch that is supposed to be used by experts? Reaserch is the job of PHDs and experts in the field. Not kids. This shouldn't be allowed to happen just for the sake of college admissions.",
      "author": "Jmh1881",
      "created": 1609086980,
      "upvotes": 995,
      "replies": {
        "gh732zo": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh732zo/",
          "text": "Agreed 100%. Professors and scientists with multiple years of experience are qualified to publish research NOT 17 year olds who are doing it just to get into a prestigious college.",
          "author": null,
          "created": 1609087080,
          "upvotes": 424,
          "replies": {
            "gh7ew86": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ew86/",
              "text": "I literally just helped Ph.D. students pipette chemicals and collect data in their lab and they put my name on their paper. The qualified people conduct the research and design the experiments and the 17 yr olds just assist I think. If there are high schoolers published in peer-reviewed journals as the first author then yeah that’s messed up, but helping out a P.I. and grad students doesn’t take that much experience imo.",
              "author": "Less_Grapefruit_6503",
              "created": 1609093432,
              "upvotes": 248,
              "replies": {
                "gh7f8z9": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7f8z9/",
                  "text": "Oh yeah I’m all for that. Just not students publishing independent research meant to be taken as fact. Nothing against students shadowing, learning and assisting.",
                  "author": null,
                  "created": 1609093610,
                  "upvotes": 94,
                  "replies": {
                    "gh7iqn8": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7iqn8/",
                      "text": "I don’t understand this lol, of course there shouldn’t be an EXPECTATION for students to do independent research but if someone has the ability and resources to do that then...why not? If the info is flawed then that’s what peer review is for? There’s a decent amount of students who do independent research purely out of interest (especially in fields like math/astro which either don’t require numerical data or have a ton of readily available data already). If their research passes peer review, why is it any less valid than research done by an expert in the field?",
                      "author": "tidalove",
                      "created": 1609095375,
                      "upvotes": 58,
                      "replies": {
                        "gh7jldm": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7jldm/",
                          "text": "Thank you for this!! CEUR-WS (publisher) also mentions what you say. Conferences built only around high school students do not qualify to be on their platform at all. However, if it is published to a regular conference (i.e. where undergraduates and MSc's are considered young researchers), it's as valid as any other researcher provided it's peer reviewed and held to the same standards as the every other paper!",
                          "author": "JinenSetpal",
                          "created": 1609095805,
                          "upvotes": 19,
                          "replies": {}
                        },
                        "gh7j2bo": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7j2bo/",
                          "text": "I meant as in it should be conducted under a more experienced professor or scientists. Independent research from HS seniors should not be taken as fact. There’s an extent to which peers can review as well.",
                          "author": null,
                          "created": 1609095540,
                          "upvotes": 7,
                          "replies": {
                            "gh7l3br": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7l3br/",
                              "text": "I’m not sure you really understand the research process tbh. In science, almost nothing is just taken as fact. Almost every notable study is peer-reviewed by other experts. If a high schooler is skilled enough to do the research, there’s no problem with it. An expert will then try to duplicate the experiment or whatever and make sure the results are valid.",
                              "author": "blazingminotaur",
                              "created": 1609096574,
                              "upvotes": 41,
                              "replies": {
                                "gh9hmrc": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hmrc/",
                                  "text": "Yeah.",
                                  "author": null,
                                  "created": 1609133329,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gh8qi8a": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8qi8a/",
                      "text": "I don't think this ever ever happens",
                      "author": "Bulbasaur2000",
                      "created": 1609117889,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gh7ivzs": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ivzs/",
                  "text": "I would just like to point out that if a HS student is first author on a research paper, they likely contributed the majority of the ideation/innovation in the project since generally, publications that are a result of nepotism or connections usually have the student as 2nd/3rd author. If a HS student who is first author on a publication was able to publish their work in a peer-reviewed journal, I think it is fair to say that their research has some merit to it as the peer-review process is generally very thorough and critical. I don't think we should be demeaning students for having motivations to publish in HS and actually contribute to their fields of interest.",
                  "author": "RamachandranPlot",
                  "created": 1609095450,
                  "upvotes": 52,
                  "replies": {
                    "gh7ld0q": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ld0q/",
                      "text": "Yeah they’re probably geniuses if they’re the first author on a peer-reviewed paper.",
                      "author": "Less_Grapefruit_6503",
                      "created": 1609096712,
                      "upvotes": 15,
                      "replies": {}
                    }
                  }
                },
                "gh7rkz1": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7rkz1/",
                  "text": "It's all about the environment you're in. I for example live really close to a major research university and am able to have consistent access to high quality lab that publishes a ton of papers every year. I spent my first two years of hs just going to lab meetings every week and reading literature. Eventually, you start getting ideas of how to do research on your own. Its really not that hard to first author you just need to come up with the initial idea which sometimes can be as simple as a precalculus level matrix decomposition. You then can collab with the pHD students to implement your idea where they will help you code and stuff. This is how I first authored in a high impact factor peer reviewed journal.\n\nYou don't have to be a genius. I guarantee if anyone in this sub spends as much time as I did interning in a high output lab at a major research university they would be able to first author too.",
                  "author": "snowiestnormal3",
                  "created": 1609099907,
                  "upvotes": 14,
                  "replies": {}
                }
              }
            },
            "gh7oqea": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7oqea/",
              "text": "I don't see the problem. Non peer reviewed journals have no standards anyway and peer reviewed journal peer review the papers in the same way as anybody else. There are plenty of kids that do great things in research. Just look at ISEF. Just because you aren't qualified enough to do it, doesn't mean kids aren't. You also can't assume that kids only do research for college apps. Sure, many do. But many also love research.",
              "author": "Akshay537",
              "created": 1609098459,
              "upvotes": 8,
              "replies": {
                "gh9hrdh": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hrdh/",
                  "text": "Yeah sure they can do it if they want to. Just not meant to be taken as fact.",
                  "author": null,
                  "created": 1609133423,
                  "upvotes": 1,
                  "replies": {
                    "gh9otja": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9otja/",
                      "text": "Most of the research papers are also written with guidance and supervision from actual professors before being peer reviewed. You can't easily win ISEF or get published in a peer reviewed journal with blatant nonsense. If you could, then it wouldn't matter who's allowed to publish because the problem would extend beyond highschoolers, anyway. The requirement and standards are the same if not higher for high schoolers to get published.\n\nNot to mention that many kids are unbelievably ahead than even their college peers in their subject. I mean people who international olympiads in their subjects or ISEF winners are undoubtably smarter than a lot of people doing bachelor's degrees with a research focus and many people doing even master's degrees. Yet, apparently people in random universities publishing their bachelor's thesis is fine, but these genius kids publishing research that have the potential to improve so many fields of the fields should just not publish.",
                      "author": "Akshay537",
                      "created": 1609139091,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gh7bnk0": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bnk0/",
              "text": "yeah surely [these kids](https://math.mit.edu/research/highschool/rsi/past-projects.php) aren't qualified to publish research. lol",
              "author": null,
              "created": 1609091743,
              "upvotes": -8,
              "replies": {
                "gh7diz8": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7diz8/",
                  "text": "I mean they’re obviously less qualified than scientists and professors with what 30+ years of experience? No matter how smart they are, experience is a thing as well.",
                  "author": null,
                  "created": 1609092731,
                  "upvotes": 18,
                  "replies": {
                    "gh7ry9q": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ry9q/",
                      "text": "(speaking as a past RSI participant who has zero stake in college applications)\n\nPeer review is what determines if you're qualified enough to publish (i.e., your work is airtight and influential enough to be a valid contribution to your field). If high schoolers are able to get their research past a blind peer review, their age shouldn't matter whatsoever.\n\nYes, the playing field is tilted such that people who come from privilege and live near universities are more likely to have these opportunities, but that shouldn't count against people who do end up taking advantage.",
                      "author": "trashcan86",
                      "created": 1609100098,
                      "upvotes": 5,
                      "replies": {
                        "gh9hy3c": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hy3c/",
                          "text": "Oh yeah my bad.",
                          "author": null,
                          "created": 1609133553,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gh8qybb": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8qybb/",
                      "text": "I'm sorry but how is this getting upvoted?  A comment saying experience is more important than quality of work in science is getting *upvoted*?\n\nWhat is going on?",
                      "author": "Bulbasaur2000",
                      "created": 1609118131,
                      "upvotes": 2,
                      "replies": {
                        "gh9ft2y": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9ft2y/",
                          "text": "What? That’s not what I’m saying at all. How would college students have better quality of work than scientists with 30+ years of experience?",
                          "author": null,
                          "created": 1609132050,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gh7snzy": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7snzy/",
                      "text": "Professors can do research on many problems. They can do research on some problems too.\n\nIf you have any doubt about their results, please proof read their papers and see for yourself. Don't come in with the assumption that their results must be bullshit. They might be small strides to less significant problems. They might not be glamorous. They aren't, however, crap.",
                      "author": "ObviouslyAnExpert",
                      "created": 1609100464,
                      "upvotes": 1,
                      "replies": {
                        "gh9gmy8": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9gmy8/",
                          "text": "?? I’m not doubting the professors.. like at all?  I’m saying HS seniors might make mistakes and they shouldn’t post independently research meant to be taken as fact, maybe have professors or scientists look over them first. When did I say their results are bullshit? Lmao.",
                          "author": null,
                          "created": 1609132630,
                          "upvotes": 1,
                          "replies": {
                            "ghakf2d": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghakf2d/",
                              "text": "And that's where you are wrong... You don't understand how research works. If their results have mistakes in them they will not be published, and sure they can publish it to vixra or something but you will be hard pressed to find anyone who takes vixra papers as facts. \n\nYou also seem to believe that their results will be cited and used. First, the absolute majority of these high school results will never be cited, or read by anyone else. Second, if any researcher comes along and actually need to use their results, the researcher is supposed to read through the literature and work out the logic behind it (if it has been peer reviewed the logic holds). Researchers aren't supposed to go straight to the conclusion and copy whatever there is in that paragraph down. If their results are going to be used by a company the company's technical staffs are going to think very hard about it before trying to implement said results. Again, all of the above are all considering a very very rare case of a high schooler producing nontrivial results.\n\nResearch isn't like someone adding new pages to a \"Book of Facts\" by coming up and doing something on their own. Research is getting a result, finding \"professors and scientists\" to look over these results and then when people agree on the validity of these results they add that to the \"Book of Facts\". You are worrying about a nonexistent problem.",
                              "author": "ObviouslyAnExpert",
                              "created": 1609168317,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gh7dx1s": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7dx1s/",
                      "text": "obviously they're less qualified but if the best research institutions and scientists in the world are hosting \"17 year olds\" to do research, then obviously there's merit to it. experience is a thing but tell me how those kids aren't qualified to publish research, i'm curious. do you even understand their abstracts? LMFAO.",
                      "author": null,
                      "created": 1609092930,
                      "upvotes": -2,
                      "replies": {
                        "gh7ew1y": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ew1y/",
                          "text": "you're arguing over whether teenagers are qualified to publish research..no need to try and degrade someone's intellect by asking if they even understand their abstracts..damn that's low",
                          "author": "onlygoingupmyfriend",
                          "created": 1609093429,
                          "upvotes": 12,
                          "replies": {
                            "gh7gcyi": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gcyi/",
                              "text": " 10% of his are valid points and  80% are passive-aggressive cheap shots at people who don't know math",
                              "author": null,
                              "created": 1609094179,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        },
                        "gh7eoog": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7eoog/",
                          "text": "I meant published research as in they’re not meant to overshadow work of scientists with experience (obviously) but also they can make mistakes. In important things like research for medicine use, research by college students should be taken with a grain of salt. Yes even scientists can make mistakes but students are more prone. It should be more of a collaborative effort. Also no need for that low blow about asking if I understood their abstracts. I never said they’re not smart. You seem to be under the impression that I’m bringing these ambitious students down, I’m not, just saying they might not be the best at offering public service.",
                          "author": null,
                          "created": 1609093330,
                          "upvotes": 4,
                          "replies": {
                            "gh7t9p8": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7t9p8/",
                              "text": "None of them overshadow works of actual scientists? I mean surely in very rare cases one might produce significant result (I vaguely remember a 15 year old making a nontrivial advancement in the study of some kind of cancer), but in most cases these papers are like most of the papers written, never heard of again until someone else researching something similar come along searching for literature.\n\nAlso you clearly have no idea what the scene is like. None of their research results in medicine will be significant enough to even be considered by cutting-edge researchers. If their results are significant enough (in a very very very rare case), their results will be pondered over by peer review committees to be published in a more reputable journal, and by other researchers who wish to make use of their results.",
                              "author": "ObviouslyAnExpert",
                              "created": 1609100771,
                              "upvotes": 4,
                              "replies": {
                                "gh9gq2v": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9gq2v/",
                                  "text": "Yeah I said it doesn’t. Yeah it doesn’t matter either.",
                                  "author": null,
                                  "created": 1609132690,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "gh7fynd": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fynd/",
                              "text": "man i dont understand their abstracts either which is why im absolutely not questioning the merits of their work. how is highschool research overshadowing the work of scientists with experience? u guys are making shit up in your head i swear to god lol",
                              "author": null,
                              "created": 1609093977,
                              "upvotes": 2,
                              "replies": {
                                "gh7gbcj": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gbcj/",
                                  "text": "Yeah I just said that it doesn’t overshadow their work. Their work is valuable but I think students should mostly just assist seniors in the field initially, but not publish independent research meant to be taken as fact especially if they’re not sure about the accuracy of the abstract.",
                                  "author": null,
                                  "created": 1609094157,
                                  "upvotes": 2,
                                  "replies": {
                                    "gh7gk0a": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gk0a/",
                                      "text": "what highschool student publishes independent research? like, obv u can get into one of those weird hs journals but i can assure u no \"expert\" reads those. you guys are concerned over a non-issue.",
                                      "author": null,
                                      "created": 1609094281,
                                      "upvotes": 0,
                                      "replies": {
                                        "gh7gyz5": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gyz5/",
                                          "text": "Yeah no expert uses those that’s just what I’m saying they’re not meant to be taken as fact.",
                                          "author": null,
                                          "created": 1609094487,
                                          "upvotes": 2,
                                          "replies": {
                                            "gh7hdxa": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hdxa/",
                                              "text": "if no expert uses the only journals that high school students doing independent research get into, then why are u trying to argue that it overshadows the work of experts? it really doesnt matter lmfao let kids publish shitty research papers, it really doesn't help that much",
                                              "author": null,
                                              "created": 1609094698,
                                              "upvotes": 1,
                                              "replies": {
                                                "gh7hrl6": {
                                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hrl6/",
                                                  "text": "I said it doesn’t overshadow their work lmao just sometimes it might get lost in translation. Or maybe not. Anyways. Yeah it doesn’t matter.",
                                                  "author": null,
                                                  "created": 1609094891,
                                                  "upvotes": 2,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "gh7jk34": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7jk34/",
                          "text": "I’m familiar with RSI. It’s basically Science Fair. These kids did “research” the same way you read a paper on how potato acid is strong and made a potato clock.",
                          "author": "goflyint0",
                          "created": 1609095787,
                          "upvotes": 3,
                          "replies": {
                            "gh7rtbr": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7rtbr/",
                              "text": "lmaooo, people at RSI are doing ground-breaking work, they're actually geniuses. I guess its similar to a potato clock, but like 100x more complicated and many of their projects can have a serious impact on the world.\n\n\\-Someone who got rejected from RSI",
                              "author": "blazingminotaur",
                              "created": 1609100028,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "gh7jzf0": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7jzf0/",
                              "text": "man whatever u say. people shit on literally anything just to sound smart i swear LMAO",
                              "author": null,
                              "created": 1609096003,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "gh7n42k": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7n42k/",
                              "text": "Keep hating from outside the club bud",
                              "author": "Remarkable-Unit-3882",
                              "created": 1609097614,
                              "upvotes": -1,
                              "replies": {
                                "gh7noh0": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7noh0/",
                                  "text": "I went to Intel International you goon. You absolute peasant.",
                                  "author": "goflyint0",
                                  "created": 1609097913,
                                  "upvotes": 1,
                                  "replies": {
                                    "gh7rwvc": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7rwvc/",
                                      "text": "If you did, you would know how cool RSI was. I didn't find out about it until ISEF but so many people there talked about it",
                                      "author": "blazingminotaur",
                                      "created": 1609100078,
                                      "upvotes": 4,
                                      "replies": {
                                        "gh7uy0b": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7uy0b/",
                                          "text": "EXACTLY lmfao this dude got that crab in a bucket syndrome",
                                          "author": "Remarkable-Unit-3882",
                                          "created": 1609101616,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "gh7ujab": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ujab/",
                                      "text": "Damn bro I want to be in your state or district if I can make it to ISEF and be 4th in your category lol\n\ntalking to a two time ISEF participant, once a 4th place grand winner and the other time cancelled by a pandemic expecting to compete for boc\n\nI don't care about you calling me names, just don't shit on achievements 10 times higher than yourself for the sole purpose of shitting on them. If you truly went to ISEF, you at least know how smart the people there are",
                                      "author": "Remarkable-Unit-3882",
                                      "created": 1609101411,
                                      "upvotes": 3,
                                      "replies": {
                                        "gh8pzw1": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8pzw1/",
                                          "text": "this research dick measuring contest is so cringe lmao. \n\nalso half the isef people i know are morons. cant even talk abt their research because they barely did any of it",
                                          "author": "whenthe1",
                                          "created": 1609117612,
                                          "upvotes": 3,
                                          "replies": {
                                            "gh8vdg3": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8vdg3/",
                                              "text": "Sure, a lot of ISEF people are morons (the one I originally replied to is prime example #1). About half are only there because of connections, and/or jumping on a random grad project. \n\n1) doesn't mean they aren't smart or didn't give valuable contribution and \n\n2) they don't win shit at ISEF. My dad was also a judge in another category (he did it for the free shit lol) and a major point of emphasis is how much work you actually think the participant did on their project. Unless you fall through the cracks (or you are international or a board point of emphasis, which I think is BS) you don't win grand awards.\n\nEven then, I don't want to come off as flexy. I'm applying to RSI this year and it is 5 times harder than anything I have ever accomplished. All the people there are insanely smart and talented at research and outside (I know 3 or 4 people who went from a group chat and they are the smartest people I have met in my life), and for this dude to shit on them and compare their projects to potato batteries is disrespectful and pathetic.",
                                              "author": "Remarkable-Unit-3882",
                                              "created": 1609120513,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "gh7q4ja": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7q4ja/",
                                      "text": "Alright bud, how many best of categories or grand awards do you have?",
                                      "author": null,
                                      "created": 1609099161,
                                      "upvotes": 1,
                                      "replies": {
                                        "gh7rlt2": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7rlt2/",
                                          "text": "None apparently -- he's only made it to states where he won 4th in his category.",
                                          "author": "SnooPredictions9269",
                                          "created": 1609099919,
                                          "upvotes": 1,
                                          "replies": {
                                            "gh838qs": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh838qs/",
                                              "text": "Only state... \n\nMy father killed himself and I withdrew. Also my category had over 50 people in it (engineering)",
                                              "author": "goflyint0",
                                              "created": 1609105717,
                                              "upvotes": 3,
                                              "replies": {}
                                            },
                                            "gh7ukpm": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ukpm/",
                                              "text": "LMFAO rough",
                                              "author": "Remarkable-Unit-3882",
                                              "created": 1609101429,
                                              "upvotes": 0,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh7e4lf": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7e4lf/",
                  "text": "i don't think it's a problem with qualification as much as it is nepotism and geographical advantages. none of those kids would have gotten into that program if they didn't have extensive research experience in the past, but so many kids who have past research experience or huge science fair projects are just kids who were set up by their parents or parents' friends.  it's really unfair that some top STEM schools basically reject unhooked, intellectually qualified applicants because they don't have any local opportunities for STEM research. i go to a huge suburban public school in a flyover state and the only kid i know who got into ISEF is not even close to the most intellectually qualified candidate for MIT at my school, but his chances are prob 10x better than anyone else...",
                  "author": "AAAAAAAAABWC",
                  "created": 1609093040,
                  "upvotes": 9,
                  "replies": {
                    "gh7eyno": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7eyno/",
                      "text": "certainly there is an aspect of privilege to it, and I know that, but idk if we should be trying to argue down their qualifications. ofc none of the kids would have gotten in without extensive research experience, that's how top research programs work. how do you think people get into phd programs? an extensive research background. also yeah it's unfair, i didnt purport otherwise, but as long as you take advantage of all opportunities presented to you, you'll do fine in college admissions. u really don't need to publish research to get into T20s lol barely anyone does. being a legacy tho...",
                      "author": null,
                      "created": 1609093465,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gh794fy": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh794fy/",
          "text": "My lab once had a high school student do a basic data analysis and write-up task. We ended up having to redo everything they did because their deliverable was near unreadable and inaccurate. When I first saw the submission, I actually thought someone was pulling a prank on us. Needless to say, I advocated to have their name removed from everything, and I don’t think my lab takes high schoolers anymore.\n\nSo yeah, whenever I see high schoolers’ names on research, I’m very skeptical about who actually did the work.",
          "author": "Glittering_Airline",
          "created": 1609090396,
          "upvotes": 57,
          "replies": {
            "gh7dfbw": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7dfbw/",
              "text": "Oh man even if u ignite how inept we are a simple error in a lab happens to much more than high schoolers and banning everyone for ones actions is not justifiable IMO (I’m trying to find a lab lol)",
              "author": "Madaleemaj2004",
              "created": 1609092680,
              "upvotes": -9,
              "replies": {
                "gh7qexx": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7qexx/",
                  "text": "As someone who did research in high school, I sympathize with the lab's decision. Research is hard, cutthroat, and stressful. Redoing the high school student's work took valuable time that probably could've been spent on writing grants or doing research. That said, they shouldn't have given the high school student such important work. My mentor was careful to properly teach me lab techniques before letting me do them on my own, although I still messed up a polyacrylamide gel once (wasn't too big of a deal, thank goodness).\n\nI highly respect my mentor (postdoc when I left) and all the researchers in the lab I interned at. They can spend months on a single experiment that ends up not working out or have weeks of work wiped out because they lost a PCR tube. Even with all that stress, my mentor and the other researchers are some of the nicest people I've met.\n\nBTW, good luck on finding a lab! If you're cold emailing, be super polite and emphasize your passion (sounds clichéd, but it's really the only thing you have since I'm guessing you haven't learned lab techniques). It's gonna take some work, since high school students can be more of a liability than an asset haha.",
                  "author": "polyzzy",
                  "created": 1609099307,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "gh7a6ty": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7a6ty/",
          "text": "have you heard of AP Research? pretty good stuff and i love it. granted my research won’t be done or published until like april but still. i agree it shouldn’t be a benchmark or expected but it isn’t hard to do good research especially if it’s taught right. that said, not every school has AP Research so it still should not be expected.",
          "author": "CloutDaddyLloyd",
          "created": 1609090972,
          "upvotes": 23,
          "replies": {
            "gh7aqxm": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7aqxm/",
              "text": "I took the course, which has been a godsend on my applications because I have an abstract to upload.",
              "author": "Inner-Construction36",
              "created": 1609091267,
              "upvotes": 7,
              "replies": {
                "gh7auwl": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7auwl/",
                  "text": "i haven’t uploaded anything from it but now i feel like i should. also how do you have an abstract? are you guys already done? we only have our lit reviews and method done. we’re starting the actual research part in jan/ feb.",
                  "author": "CloutDaddyLloyd",
                  "created": 1609091324,
                  "upvotes": 5,
                  "replies": {
                    "gh7azd7": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7azd7/",
                      "text": "I took it last year.",
                      "author": "Inner-Construction36",
                      "created": 1609091388,
                      "upvotes": 2,
                      "replies": {
                        "gh7b4c7": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7b4c7/",
                          "text": "oh ok. i didn’t actually realize you could take it as a junior. our school lets only seniors take research but you had to take seminar as a junior. it’s the only 2 classes (besides lang and lit) that have grade level requirements.",
                          "author": "CloutDaddyLloyd",
                          "created": 1609091461,
                          "upvotes": 4,
                          "replies": {
                            "gh7b8x9": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7b8x9/",
                              "text": "I was able to take Seminar sophomore year.",
                              "author": "Inner-Construction36",
                              "created": 1609091528,
                              "upvotes": 3,
                              "replies": {
                                "gh7bptt": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bptt/",
                                  "text": "i loved my seminar teacher so much and she’s actually inspired me to do more/ work harder. i wish i had her sophomore year.",
                                  "author": "CloutDaddyLloyd",
                                  "created": 1609091777,
                                  "upvotes": 3,
                                  "replies": {
                                    "gh7bx1w": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bx1w/",
                                      "text": "I loved mine as well, and I got to take AP World with her the same year. I guess I'm pretty lucky. Good luck with Research! I only got a 5 on the exam because they cancelled the oral component.",
                                      "author": "Inner-Construction36",
                                      "created": 1609091884,
                                      "upvotes": 2,
                                      "replies": {
                                        "gh7fd8f": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fd8f/",
                                          "text": "on seminar i dropped from a 5 because of that i think. my TMP was a perfect 5 so sad.",
                                          "author": "CloutDaddyLloyd",
                                          "created": 1609093671,
                                          "upvotes": 2,
                                          "replies": {
                                            "gh7j4u0": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7j4u0/",
                                              "text": "Yeah, I got a 4 on Seminar, probably because of the oral component.",
                                              "author": "Inner-Construction36",
                                              "created": 1609095577,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh7bnt2": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bnt2/",
                  "text": "Wait what did you upload? IRR? IWA? Or your final paper from AP Research?",
                  "author": "Oliver_Anchovies",
                  "created": 1609091747,
                  "upvotes": 2,
                  "replies": {
                    "gh7byei": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7byei/",
                      "text": "I kinda merged the conclusion and intro of the final paper to form an abstract.",
                      "author": "Inner-Construction36",
                      "created": 1609091905,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gh7b8rm": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7b8rm/",
              "text": "Yeah I've heard of it- i think thats fine. What I have an issue with is kids publishing reaserch in reaserch journals used by experts in the field",
              "author": "Jmh1881",
              "created": 1609091525,
              "upvotes": 4,
              "replies": {
                "gh7bnry": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bnry/",
                  "text": "the quality of AP Research papers is expected to be good enough that your paper can be/ is used by experts in the field. the way they make sure that’s manageable is by making sure we have a manageable scale. for example, i worked on a congressional campaign and noticed that youth voter turnout is actually decreasing in my district, rather than following the national trend and increasing. i LOVE politics with a passion and couldn’t understand why, especially since most of my friends like politics. so my question is about college students political awareness and engagement in my congressional district. that way i only have 3 colleges to get data from and the 3 colleges here are ones that no one really travels to beyond like 100 miles which is 99% my congressional district. because it’s specialized it’s seen as valid. maybe this isn’t the best example but everyone in my class is doing similar things.",
                  "author": "CloutDaddyLloyd",
                  "created": 1609091747,
                  "upvotes": 2,
                  "replies": {
                    "gh88x3k": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh88x3k/",
                      "text": "I honestly would rather be in competitions such as NHD where is there are competition divisions than taking a class, etc because these papers will be published no matter what. However, the competions is very!!! difficult",
                      "author": "Omar-Dreaming",
                      "created": 1609108653,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "gh7c2xy": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7c2xy/",
                      "text": "\"Good enough to be published\" is fine, actually publishing seems unethical to me. I jjst think its wrong for colleges to be putting pressure on kids to publish reaserch when many if them are probably not qualified to do that. Especially when it comes to qualitative data",
                      "author": "Jmh1881",
                      "created": 1609091973,
                      "upvotes": -1,
                      "replies": {
                        "gh7f0xo": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7f0xo/",
                          "text": "if it’s good enough to publish then why should my age override the quality? also i’m fairly certain college board publishes all passing papers, but that could be wrong and my school does that.",
                          "author": "CloutDaddyLloyd",
                          "created": 1609093497,
                          "upvotes": 3,
                          "replies": {
                            "gh7frdn": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7frdn/",
                              "text": "Theres a large gap between the knowlage and expertise of a PHD and that of a high school student. I would venture to say that most reaserch conducted by high school students, even if it is done very well and is of a high quality, probably discusses a concept that is already known within the field. Teenagers, with a few exeptions, dont have the expertise to conduct reaserch that is revolutionary to the field. And in the publishing world, you study is not going to be published unless it does that.",
                              "author": "Jmh1881",
                              "created": 1609093875,
                              "upvotes": -2,
                              "replies": {
                                "gh7g7f8": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7g7f8/",
                                  "text": "but no one is saying it’s revolutionary. or that it should have to be. it’s still valid research that can add to the academic scene. stuff gets published all the time that isn’t revolutionary or makes small or even insignificant strides. often times you publish research of the exact research that has already been done. if my research is good quality, nothing else should matter for it to be published.",
                                  "author": "CloutDaddyLloyd",
                                  "created": 1609094101,
                                  "upvotes": 3,
                                  "replies": {
                                    "gh7grdz": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7grdz/",
                                      "text": "I guess I should reword. I mean \"revolutionary\" in the sense that it proposes a new idea. If the findings of your reaserch already exist, it probably won't be published unless it was specifically supposed to be a replication study. My point is that the reaserch of most highschool students probably has findings that are already known within the field, simply because teenagers don't have the depth of knowlage or expertise to make significant strides. To do this, you would have to be familier with all of the known reaserch in the field and understand how to expand on it.",
                                      "author": "Jmh1881",
                                      "created": 1609094380,
                                      "upvotes": 1,
                                      "replies": {
                                        "gh7ha4h": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ha4h/",
                                          "text": "if you’re doing research well you will have a depth of knowledge and you will be VERY familiar with the research that already exists. at the end of the day, you can publish your own research and there aren’t many things that can stop you. i believe if your research is of good enough quality to be published, it should be published. research gets published that isn’t unique all the time. and in the case of college admission, if it a published paper then an AO can find your paper and judge the quality themselves. i personally believe that my research paper will be good enough to publish, so i’m going to try and get it published.",
                                          "author": "CloutDaddyLloyd",
                                          "created": 1609094643,
                                          "upvotes": 4,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "gh7dys9": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7dys9/",
                          "text": "If they can do research good enough to be published then clearly they are qualified to publish research and preventing them from doing so would be a disservice to the academic community.",
                          "author": "Knownotunknown123",
                          "created": 1609092956,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gh7cbjr": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7cbjr/",
                  "text": "my guy, who do you think is overseeing the research? \"experts in the field.\" if they think your paper is publishable, then it is. random redditor's opinion doesn't matter on the subject  \n\n\nedit: I just checked your profile and you're a hs senior??? man idk why you're speaking for \"experts\". ur not one LMAO",
                  "author": null,
                  "created": 1609092099,
                  "upvotes": 0,
                  "replies": {
                    "gh7eapc": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7eapc/",
                      "text": "Yeah no shit I'm a senior that's why I'm on this sub.\n\nI don't pretend to be an expert, but as I jjst mentioned both of my parents work as reaserchers. I know what it takes to get where they are, I know the process of publishing, and the fact of the matter is that there is a lot of fake science in their field that is perpetrated by corporations. Said corporations are probably more than willing to publish a highschooler's work if it promotes their agenda. \n\nThis doesn't apply to every field, but even still. There are tons of scammers out there claiming they want to \"publish your work\", and a lot on non credible publishing  journals.\n\n\nI'm also curious on how you, someone only a year older than me, know more than I do? You're not an expert, either",
                      "author": "Jmh1881",
                      "created": 1609093129,
                      "upvotes": 5,
                      "replies": {
                        "gh7ekbd": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ekbd/",
                          "text": "That plus idk like highschool research and PhD research no matter how talented the student is bound to have a massive gap. How can we ignore years of experience. Just an opinion lmfao",
                          "author": null,
                          "created": 1609093266,
                          "upvotes": 4,
                          "replies": {
                            "gh7euop": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7euop/",
                              "text": "Exactly. You cannot seriously believe that a child has the ability to produce reaserch at the same level as a PHD. Most reaserch done by high school students has probably already been discussed and reaserched in the field.",
                              "author": "Jmh1881",
                              "created": 1609093411,
                              "upvotes": 3,
                              "replies": {
                                "gh7f5us": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7f5us/",
                                  "text": "The simple truth is no one believes that. Although let's not discount the few 1-2 einsteins out there but the rest definitely need scientific training. You don't need to be a fucking expert to deduce this lmfaoo",
                                  "author": null,
                                  "created": 1609093566,
                                  "upvotes": 2,
                                  "replies": {
                                    "gh7fd5m": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fd5m/",
                                      "text": "Yeah there's definitely exeptions the rule. I'm just not keen on putting pressure on students to lead the charge and publish reaserch when they probably aren't qualified",
                                      "author": "Jmh1881",
                                      "created": 1609093671,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "gh7frpx": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7frpx/",
                              "text": "there's a massive gap, but that doesn't make any of their work unpublishable. we're not ignoring years of experience lmfao, it's just better to let kids get into research as early as possible because it makes them better researchers. like i think literally every research university i applied to had a program that got people into research as soon as possible. why do you think they ignore the \"years of experience\"? curious what u know about research that institutions whose top priorities include publishing research, don't.",
                              "author": null,
                              "created": 1609093879,
                              "upvotes": 2,
                              "replies": {
                                "gh7gqca": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gqca/",
                                  "text": "I have 0 problems with highschool students engaging in student research but we are talking about publishing it in scientific journals?? Brudda I'm part of a \"selective research thingy\" (lmfao I sound braggy but bear with me) and its absolute shit quality research compared to PhD level research",
                                  "author": null,
                                  "created": 1609094366,
                                  "upvotes": 1,
                                  "replies": {
                                    "gh7h718": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7h718/",
                                      "text": "bro no shit it's going to be worse but the point is that there's merit to doing research as a highschool student, and having basically 7+ years of experience by the time you're done with college will make u a better researcher lol wtf. regardless, do u think if u want to get something published u simply just send it in? like if ur in a selective research program u should know that it's not that simple lmfao. if a hs student gets published in a reputable journal independently, then imo they deserve to get into top schools lmfao",
                                      "author": null,
                                      "created": 1609094599,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "gh7fh6u": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fh6u/",
                          "text": "if you've actually been reading what I've been saying, you'll note that all I'm saying is that \"PIs take hs students so there must be merit to it\". of course a researcher knows more than a highschool student, so if they want to take a highschooler, then let them be lmfao dk why you're so against it.",
                          "author": null,
                          "created": 1609093729,
                          "upvotes": 1,
                          "replies": {
                            "gh7fxs0": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fxs0/",
                              "text": "Taking on highschool students to assist reaserch is not the same as a highschool student publishing their own reaserch, which is what I've been talking abiut this whole time",
                              "author": "Jmh1881",
                              "created": 1609093965,
                              "upvotes": 3,
                              "replies": {
                                "gh7grif": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7grif/",
                                  "text": "\\^",
                                  "author": null,
                                  "created": 1609094382,
                                  "upvotes": 2,
                                  "replies": {}
                                },
                                "gh7gcgu": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gcgu/",
                                  "text": "1. most hs student pubs are really just them doing lab work/data cleanup and getting their names slapped on it. lowk thats the same with college students so no shame\n2. what highschool student is publishing their own research outside of ISEF? im under the impression that ISEF projects are also usually continued projects from research programs so idk what ur talking about. give me a link and ill believe u",
                                  "author": null,
                                  "created": 1609094172,
                                  "upvotes": 1,
                                  "replies": {
                                    "gh7heor": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7heor/",
                                      "text": "This whole time you've been arguing against a thing I was never even talking about. Assistantships are not what I'm discussing here. \n\nI'm sure not many high school students succeed in publishing their own work. But there been a lot of pressure on students to do that. Its gotten to the point where assistantships are the bare minimum for t10s, and theres so much pressure on kids to do the absolute most. I mean, look on chanceme. And the fact is that if you look at the numbers self directed reasedch significantly improves your chances of admission to top schools. College admissions become more cutthroat every year, and my point is that pressure to do reaserch seems to be entering dangerous, possibly unethical teratory",
                                      "author": "Jmh1881",
                                      "created": 1609094708,
                                      "upvotes": 1,
                                      "replies": {
                                        "gh7htne": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7htne/",
                                          "text": "you are seriously living in another world if u think assistantship is bare minimum t10. get off A2C bro  \n\n\nalso a lot of students don't succeed in publishing their work, and they certainly aren't publishing their work in high impact journals so your original premise didn't even make sense which is what's confusing me. how is it overshadowing experts if barely any students get published, and those who do get publish do it in shitty journals? crying lmfao",
                                          "author": null,
                                          "created": 1609094919,
                                          "upvotes": 3,
                                          "replies": {
                                            "gh7idhv": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7idhv/",
                                              "text": "You just keep missing my point over and over again. Im not going to repeat myself for the third time on what my point was. I never talked about kids overshadowing PHDs and I think you're getting multiple people mixed up. Have a nice day.",
                                              "author": "Jmh1881",
                                              "created": 1609095189,
                                              "upvotes": 1,
                                              "replies": {
                                                "gh7itw6": {
                                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7itw6/",
                                                  "text": "im not missing ur points bro its just you're arguing something that doesn't happen. know a ton of people at T20s/T10s and if they're doing research, it's at an assistantship. ur arguing a non-issue. nobody gets published independently, and there's certainly not a push to do so. work published by highschool students absolutely doesn't hurt experts. have a nice day man hope u get into a T10 so you realize you don't need what A2C tells u",
                                                  "author": null,
                                                  "created": 1609095421,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "gh7kir4": {
                                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7kir4/",
                                                      "text": "This is a complicated thread and I think the issue here is that several people have made several different points and you're mixing them up. I am going to clarify what my point was, and then I am going to end this conversation. \n\nIn my original comment, I said that reaserch is the job of the PHD, not the job of a child. Expecting children to do reaserch is unethical because it puts them in the position where they can easily be scammed, and because it gives them a job that they are simply unqualified to do. While students are not frequently self publishing, there becomes more and more of a push every year. My point is that **the increasing pressure for students to be extraordinary and perform academiclly at a level way above of what is possible is beginning to dive into dangerous and unethical territory**\n\nStudents and their parents will do anything to get them into a top school, and if you look at details about t10 admissions you will see that self lead reaserch does in fact help you. A lot. Most top schools have a ranking system, where 1 is the highest. To achieve a 1 in academics, you need to be extraordinary. Applicants ranked 1 are accepted at a significantly higher rate than students ranked 2 or lower. Reaserch assistantships are no longer extraordinary, so students need to push to the next level. This is what I meant when I said that assistantships are the \"bare minimum\". They are one of many activities that are no longer viewed as extraordinary. Just as club leadership were once outstanding and faded into oblivion. \n\nWhat is probably inevitable at this point is unethical. That is all I am saying.",
                                                      "author": "Jmh1881",
                                                      "created": 1609096278,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gh7dden": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7dden/",
                      "text": "bruh what are you smoking? no shit he's a senior he's just giving his opinions. fuck off with that shit\n\n&#x200B;\n\n(edit) Lost my cool lol sorry",
                      "author": null,
                      "created": 1609092652,
                      "upvotes": 1,
                      "replies": {
                        "gh7doop": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7doop/",
                          "text": "yeah and i'm just genuinely curious why a hs senior somehow knows something about \"experts of the field\" that PIs don't. you can certainly have an opinion on something, but it's a little sus to speak from a position where you're not lmfao",
                          "author": null,
                          "created": 1609092810,
                          "upvotes": -1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gh7sdlc": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7sdlc/",
          "text": "I don't think you understand how high school research works. Please don't complain about everything you see on a more competitive applicant (particularly because research is actually something that is harder to \"fake\"), those people worked hard for it and you are tearing them down because... well I don't know why.\n\nMost \"research experience\" for high schoolers really means \"worked for a professor\". This is usually the case when you see their name as the 5000th author or something on a paper. Professors are willing to take in free labor to help them automate parts of their studies. That is a mutually beneficial relationship, and the high schoolers do real work with their skills in those environments.\n\nFor papers people research a wide variety of topics. There are actually a lot of low hanging fruits in pretty much every subject (although not across all fields. It will be much easier to produce original results in graph theory than say set theory), and those high schoolers get a mentor, do the work, put together a paper then send it to a publisher/competition. The paper is then reviewed for quality and legitimacy before being published/awarded any honors. \n\nI know high schoolers who produce original enough results in physics, mathematics, biology, computer science and more. You can read their papers at [http://www.yau-awards.science/?page\\_id=51&lang=en](http://www.yau-awards.science/?page_id=51&lang=en) if you are interested. The papers are reviewed rigorously by a team of experts. Please respect their results.",
          "author": "ObviouslyAnExpert",
          "created": 1609100314,
          "upvotes": 11,
          "replies": {
            "gh800m8": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh800m8/",
              "text": "You cant be insulted that I say highschool students are not qualified to do the jobs of PHDs. Its objectively true, and disagreeing is, frankly, an insult to PHDs",
              "author": "Jmh1881",
              "created": 1609104111,
              "upvotes": 7,
              "replies": {
                "gh8ur60": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8ur60/",
                  "text": "I am not insulted that you think high school students aren't qualified to do the jobs of PhDs. I am insulted by the fact that you think research is absolutely *exclusive* to PhDs, and by your genuine lack of understanding of exactly what research is. You think high school students are too young with too little experience to do research. I am telling you that research isn't like surgery, research is about producing original enough results, or improving/generalizing upon results of other researchers. If a high school student can produce good enough result to be published by a journal with some form of a review policy (you can't expect them to make good results to compete for pages on Science or Nature, but that doesn't mean their results are meaningless), or get accepted by prestigious competitions, then their results are good enough. Their work isn't proven by their degree or years of experience, at the end of the day their work should *prove* themselves.   \n\n\nBy the way read up on MIT-primes, Yau-awards etc. They are all high quality high school research opportunity/competition.",
                  "author": "ObviouslyAnExpert",
                  "created": 1609120187,
                  "upvotes": 3,
                  "replies": {
                    "gh8vp1a": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8vp1a/",
                      "text": "There are the exeptions, but the majority of high school \"reaserchers\" are getting scammed big time by pay to publish journals. Im sure some high school kids are seriously smart, but the pressure is on and more and more kids that simply don't kmhave the depth of knowage are attempting reaserch. Too many things have been destroyed by turing into a way to \"game the admissions system\", and academia should never, ever, be one of those things.",
                      "author": "Jmh1881",
                      "created": 1609120681,
                      "upvotes": 1,
                      "replies": {
                        "gh8x2lb": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8x2lb/",
                          "text": "I don't believe I follow your logic.\n\nPublishing shitty results in pay-to-publish journals (without even bothering to check their reputation) doesn't seem like a way to \"game the admissions system\". Colleges aren't mentally deficient. Colleges know what are scams and what aren't. Publishing in pay-to-publish scam journals might be a good way to game your own wallet, but it won't game any reputable universities (seriously they are on the frontline of research, you think they won't know?). Also, just because there are scams doesn't mean high school students should be barred from this activity. College consultants have scammers among them too, doesn't mean that we should get rid of all college consultants.\n\nAlso personally I think the worry that academia will be used to \"game the undergrad admission system\" should be quite minor. Between the nepotism, professor rivalry, slaving non-tenure researchers and creative ways it is used to pad credentials for grad school admissions, some high school students dipping their toes in with their results (no matter the quality) is a very very very insignificant problem.",
                          "author": "ObviouslyAnExpert",
                          "created": 1609121409,
                          "upvotes": 2,
                          "replies": {
                            "gh8xfus": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8xfus/",
                              "text": "I never said high school students should be banned from doing reaserch so I really have no idea what you're talking about. \n\nRich parents will do *anything* to get their kids into college. And if that means paying their way so their kid can do some fancy reaserch program then that's what it means. Reaserch is become the \"new fad\" on how to appear as an outstanding student",
                              "author": "Jmh1881",
                              "created": 1609121604,
                              "upvotes": 2,
                              "replies": {
                                "gh8yzzf": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8yzzf/",
                                  "text": "\\>Suggests high school students are not qualified for doing the work of PhDs (which presumably is research, as narrow as your perspective is) under an OP who is upset by high school students doing research.  \n\"I never said high school students should be banned from research\". I don't know. Maybe you haven't said it but the underlying message is there. \n\nAlso of course rich parents will pay for fancy research programs. Guess where else are they able to pay their way out? Literally everything except olympiads. Research is a place where they will still have to do some work, and learn some things. If they pay a middleman to get hooked up with a better mentor then sure, doesn't make high school research bad.\n\nIn art they can literally pay for professionals to do touch-ups on their children's works. In photography... Well you can guess the background of a kid who does underwater scuba diving photography of coral reefs in Hawaii. History? Where do you think the majority of those who attend oversea programs in Spain and archaeology programs in Rome stand on the social status pyramid? English? Easy, hire a tutor. \n\nSee? One can make the \"rich people pay for better services\" argument for almost everything. Welcome to human civilization, that's how it has been for about the entire duration of recorded history. Are history, english and art ECs inferior? Are they supposed to be thrown away? *Have we thrown them away?* No. Because rich people can pay for better opportunities across all of the playing fields, but that doesn't make the field any less valid of a field to play on. For every one percenter of the society playing on a field, there are 99 other non-one percenters playing as well.",
                                  "author": "ObviouslyAnExpert",
                                  "created": 1609122402,
                                  "upvotes": 3,
                                  "replies": {
                                    "gh8zpg0": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8zpg0/",
                                      "text": "Lmao, im done with this. I've had this conversation at least 3 times already. I get it, you're offended because you did reaserch. My parents are both PHDs, I know what the job entails. So you don't need to talk down to me. If you honestly believe you are qualified to do the job of professionals with 8 years of higher education you need some humbling. Goodbye.",
                                      "author": "Jmh1881",
                                      "created": 1609122767,
                                      "upvotes": 3,
                                      "replies": {
                                        "gh90aj4": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh90aj4/",
                                          "text": "Actually I am a math competition kid. Between research and competition I picked the latter route, but that doesn't stop me from being able to respect the research  kids for what they do, and the results they produce. \n\nYour parents might have PhDs, but you clearly have no idea what research means. You constantly stress *experience*. I am going to tell you a horror story. Undergrad research is a lot a lot more common than high school research, and at good schools there are plenty of independent projects each year. How much research experience do you reckon a college sophomore have? Hm? A year? Half a year? Attending a freshman \"what is research\" seminar? \n\nI think you need some humbling and face reality. Not everyone who did more than you are cheating. Respect the work other people did, improve yourself. Good day.",
                                          "author": "ObviouslyAnExpert",
                                          "created": 1609123073,
                                          "upvotes": 3,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh8gxps": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8gxps/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1609112832,
                  "upvotes": 5,
                  "replies": {
                    "gh8mbic": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8mbic/",
                      "text": "Yep. Youre not as qualified as a PHD. Sorry, don't know what to tell you",
                      "author": "Jmh1881",
                      "created": 1609115613,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gh8lgu1": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8lgu1/",
                      "text": "I agree with this completely as someone in same exact position (Elsevier as well lmao). Comment OP doesn’t get that doing original research doesn’t require some out of the world skill that only PhDs have. PhDs tend to product work that is more useful than highschool students, and they get cited a lot more, which is why they have a PhD and are not HS students.",
                      "author": "Dangerous_Apple9826",
                      "created": 1609115171,
                      "upvotes": 1,
                      "replies": {
                        "gh8mg0z": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8mg0z/",
                          "text": "PHDs go to school to become reaserchers and leading experts in their field. Thats literally the whole reason people get PHDs",
                          "author": "Jmh1881",
                          "created": 1609115679,
                          "upvotes": 1,
                          "replies": {
                            "gh8nc2r": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8nc2r/",
                              "text": "Yes, so PhDs are better at research than highschoolers. They get cited a lot more, whereas most high school students won’t get cited once. So this idea that only PhDs should publish research is weird because the point of science is that anyone can and if the experts in the field agree with them, then it’s shared.",
                              "author": "Dangerous_Apple9826",
                              "created": 1609116156,
                              "upvotes": 2,
                              "replies": {
                                "gh8oiom": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8oiom/",
                                  "text": "I guess. I just don't think acamedia should turn into another way for kids to \"game the system\"",
                                  "author": "Jmh1881",
                                  "created": 1609116798,
                                  "upvotes": 2,
                                  "replies": {
                                    "gh8oq4t": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8oq4t/",
                                      "text": "Unfortunely that’s largely what’s it’s become recently. But on the positive side, most of the “game the system” publications are in semi-bad journals or pay-to-publish, so they’ll never get seen much less used as fact.",
                                      "author": "Dangerous_Apple9826",
                                      "created": 1609116911,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "gh8mclb": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8mclb/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1609115628,
                          "upvotes": 0,
                          "replies": {
                            "gh8nhqe": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8nhqe/",
                              "text": "Lol pretty much the same field too that’s crazy.",
                              "author": "Dangerous_Apple9826",
                              "created": 1609116239,
                              "upvotes": 2,
                              "replies": {
                                "gh8nn7g": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8nn7g/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1609116320,
                                  "upvotes": 1,
                                  "replies": {
                                    "gh8ny07": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8ny07/",
                                      "text": "U work w a uni or solo author?",
                                      "author": "Dangerous_Apple9826",
                                      "created": 1609116484,
                                      "upvotes": 1,
                                      "replies": {
                                        "gh8o1bl": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8o1bl/",
                                          "text": "[deleted]",
                                          "author": null,
                                          "created": 1609116534,
                                          "upvotes": 1,
                                          "replies": {
                                            "gh8o5rj": {
                                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8o5rj/",
                                              "text": "Yeah mine was also an extension of a sci fair thing but it was independent research that took my to isef so I published it",
                                              "author": "Dangerous_Apple9826",
                                              "created": 1609116601,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh87fqz": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh87fqz/",
                  "text": "It isnr necessarily true that high school students are always unqualified. To publish any sort of research at a peer reviewed journal, the student needs to submit their work for \"peer review\" by reviewers (aka the people you and i would consider \"qualified\"). If the student's work passes the reviewers' standards, then who are we to say that the student's work is unqualified?",
                  "author": "Infusedmikk",
                  "created": 1609107884,
                  "upvotes": 2,
                  "replies": {
                    "gh8d4ri": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8d4ri/",
                      "text": "My parents are reaserchers so I know the process. I can gaurentee you that 99% of high school students doing self lead reaserch are not going to pass peer review and publish in a legitimate journal. I mentioned this in another comment but unfortunately there's a lot of scammers that will pray on highschool students trying to publish by saying \"we'll publish your article if you pay us x amount of money\"",
                      "author": "Jmh1881",
                      "created": 1609110848,
                      "upvotes": 5,
                      "replies": {
                        "gh8h3le": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8h3le/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1609112917,
                          "upvotes": 5,
                          "replies": {
                            "gh8lhej": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8lhej/",
                              "text": "The question then becomes who actually did the work.",
                              "author": null,
                              "created": 1609115178,
                              "upvotes": 1,
                              "replies": {
                                "gh8m7nv": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8m7nv/",
                                  "text": "Yep, exactly.",
                                  "author": "Jmh1881",
                                  "created": 1609115556,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gh8j8ik": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8j8ik/",
          "text": "FR I remember a few years back, this girl at my school discovered something ground breaking about Parkinson's disease (something about how protein interacted with another protein) She wrote whole research paper on it. I believe she got into Standford. \n\nand I'm here just trying to slug through DE Biology. \n\nHer little brother is in my class he has the highest GPA in our grade but he acts out a lot. Kinda feel bad for him, his parents must put him through a lot.",
          "author": "spaghettiregrehetti",
          "created": 1609114014,
          "upvotes": 5,
          "replies": {}
        },
        "gh7qrbx": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7qrbx/",
          "text": "A lot of research isn't necessarily hard to conduct, per se. If you are able to talk with a PI/grad student about simple biology gene-silencing study to evaluate the effects of a said gene on X process (an example) it's very easy to actually conduct the experimental techniques post-experimental design. On top of that, if you're lucky enough to have the chance to publish/write a manuscript, you will have many people working on it and the hardest point is explaining results which a 17-year-old won't be doing alone. \n\nIn summary, a 17 year old can't just fuck around and do whatever they want and there are many checks done along the way by higher-ups to ensure that shit makes sense and is actually worth doing.\n\nOn top of that, the process of actually publishing will weed out any pointless results or papers. You'll only get published if the work is useful to experts in the field, which is determined by experts in the field.\n\nLong story short, what you said makes literally no sense and is based on a fundamental misunderstanding of how research works.",
          "author": null,
          "created": 1609099483,
          "upvotes": 5,
          "replies": {}
        },
        "gh7ci0m": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ci0m/",
          "text": "i've done research but haven't had my work published. imo, research is a great way to get students exposed to the field, especially if they're interested in the sciences. i don't think colleges are expecting every student to do research. all it shows is that the student is passionate about their work.",
          "author": "astrobutterfly246",
          "created": 1609092194,
          "upvotes": 2,
          "replies": {}
        },
        "gh86tgj": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh86tgj/",
          "text": "I wonder if colleges know this though. Surely they do right? No high schooler has anywhere near enough experience to be considered a researcher.",
          "author": "NeedRedditForSchool",
          "created": 1609107564,
          "upvotes": 1,
          "replies": {}
        },
        "gh8qgg6": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8qgg6/",
          "text": "Well what there should be is more quality control, not just outright barring it (if there is a consistent output of useless or bad research done by 17 yo). I know 17 yo who are truly brilliant and have done research where they contribute quite a bit and it's shit that's not trivial and easy for any 17 yo.",
          "author": "Bulbasaur2000",
          "created": 1609117863,
          "upvotes": 1,
          "replies": {}
        },
        "gh8rgcc": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8rgcc/",
          "text": "\\*14 year olds",
          "author": "No_Map_6288",
          "created": 1609118403,
          "upvotes": 1,
          "replies": {}
        },
        "gh9k3me": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9k3me/",
          "text": "I don’t think you’re giving some 17 year olds enough credit. There definitely are high schoolers capable of doing decent research and getting it published. I go to one of those STEM magnet school things, and the seniors there do a senior research project, some of which get published. A lot of them are really passionate about what they do and are able to learn and accomplish lot, and while their work probably isn’t close to PhD level, I still think there is value to it. There are also other STEM schools in my area that have seniors do research. I completely agree that most 17 year olds aren’t able to do that type of stuff, but with how much stuff you can learn from online courses and books, I don’t see why there can’t be a 17 year old that with enough time and dedication is able to publish or at least try to publish a research paper.\n\ntl;dr, I agree MOST 17 year olds shouldn’t be doing research, but that doesn’t mean ALL 17 year olds shouldn’t be able to do research.\nSorry if I’ve done a bad job at communicating my point, I’m doing this on my phone and I’m really tired right now lol.",
          "author": "namey-name-name",
          "created": 1609135147,
          "upvotes": 1,
          "replies": {}
        },
        "gh7kw13": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7kw13/",
          "text": "I haven’t published research, but I see absolutely no problem with it. Most high schoolers are working with phd’s and experts, and they help research go faster. There really are no negative aspects to it.",
          "author": "blazingminotaur",
          "created": 1609096470,
          "upvotes": 1,
          "replies": {}
        },
        "gh7ys61": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ys61/",
          "text": "My mom is a professor. She legit got called by a company that finds and pays academics to do research with high school kids. She said no, but the fact that this service exists — yet another way to further increase wealth gaps, barriers to opportunity— is kind of gross.",
          "author": "piedrafundamental",
          "created": 1609103529,
          "upvotes": 1,
          "replies": {}
        },
        "gh77ap5": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh77ap5/",
          "text": "[removed]",
          "author": null,
          "created": 1609089413,
          "upvotes": -10,
          "replies": {
            "gh78pys": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh78pys/",
              "text": "That kind of research forms a minority of what kids who put research on their app actually do. A lot of it is a matter of connections. There are certainly kids who do this, but it absolutely isn’t representative of the majority.",
              "author": "LitDaddy101",
              "created": 1609090179,
              "upvotes": 20,
              "replies": {
                "gh797xf": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh797xf/",
                  "text": "then it doesn't help your application. genuinely wondering what u could be talking about because if you're not published, or the program isn't recognizeable, it's not helping your application lmfao. regardless, why wouldn't colleges admit people who are more likely to do research, which is a large part of why colleges get government funding? like that statement is so absurd to me. that's literally like saying undergrads only do research to get into PHd programs lmfao",
                  "author": null,
                  "created": 1609090448,
                  "upvotes": -7,
                  "replies": {
                    "gh79du5": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh79du5/",
                      "text": "You can be published as a (not first) author solely via connections and this happens at a fairly notable rate. That will help your application.",
                      "author": "LitDaddy101",
                      "created": 1609090537,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gh7bo3u": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bo3u/",
              "text": "I dont think that. But I strongly believe that 17 year olds are not qualified to be doing this work. My parents are reaserchers and went to school for 8 years for it. You're telling me I would be just as qualified to do that reaserch simply because im interested in it?\n\nI'm not \"salty\", or jealous. But I think it is diving into dangerous territory to allow children, some of which who are not even old enough to drive, to be leading the charge on this stuff. There is a reason people study for so long to do reaserch, and even they make errors sometimes.",
              "author": "Jmh1881",
              "created": 1609091752,
              "upvotes": 7,
              "replies": {
                "gh7gzus": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gzus/",
                  "text": "You are nailing the issue. Finally, someone acknowledging that the competitive nature of admissions is forcing the \"publishing\" of research. The amount of sidey journals and things like that are wild",
                  "author": null,
                  "created": 1609094499,
                  "upvotes": 5,
                  "replies": {}
                },
                "gh7c4qr": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7c4qr/",
                  "text": "i mean if someone has enough domain knowledge to justify to a PI that they'd be a valuable asset to their lab, and the PI accepts, then yeah, I'm okay with it.\n\nbtw I got into a lab a couple months ago by literally just emailing my chem professor (before I even took his class) that I was interested in the subject. so he, someone who has been in science for half his life, thinks so, so I'm alright with it lmfao. that's literally how getting research works at most LACs btw it's so insanely easy. dk why you're trying to gatekeep research like that. it's literally all up to PIs. if you don't want to take anything less than a phd student, then don't. that simple. if they feel like doing it, then they do. that simple.  \n\n\nlike the \"my parents are researchers so i know exactly what it entails\" argument lmfao. the audacity man",
                  "author": null,
                  "created": 1609091999,
                  "upvotes": 0,
                  "replies": {
                    "gh7eo1s": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7eo1s/",
                      "text": "Reaserch assintanships are a different story. Plenty of undergrad students do that. Leading and publishing reaserch as a child is not the same",
                      "author": "Jmh1881",
                      "created": 1609093320,
                      "upvotes": 4,
                      "replies": {
                        "gh7gtkn": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gtkn/",
                          "text": "give me one paper from ACM/Nature/Annals that was independently published by a high schooler lol",
                          "author": null,
                          "created": 1609094411,
                          "upvotes": 1,
                          "replies": {
                            "gh7hrf8": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hrf8/",
                              "text": "See thats the thing. High school students aren't publishing in big name journals. They're being scammed into publishing in no name journals that often times have unsavory motives. My parents get it all the time. \"Publish your article now! Just pay us $100 dollars!\" Obviously they don't fall for that, but im sure many highschool students do.",
                              "author": "Jmh1881",
                              "created": 1609094889,
                              "upvotes": 2,
                              "replies": {
                                "gh7hyyh": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hyyh/",
                                  "text": "if it's a shitty journal then AOs don't care man it's that simple. i assure u that kids at T20s aren't publishing in those journals lmfao",
                                  "author": null,
                                  "created": 1609094990,
                                  "upvotes": 1,
                                  "replies": {
                                    "gh7i9jx": {
                                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7i9jx/",
                                      "text": "I know they wouldn't care, but im saying students are so desperate a lot of them will fall for it",
                                      "author": "Jmh1881",
                                      "created": 1609095135,
                                      "upvotes": 1,
                                      "replies": {
                                        "gh7j024": {
                                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7j024/",
                                          "text": "man if you know most highschool students (who do their work independently) get published in shitty journals, and you know that AOs don't care about that research, why are you so concerned? journals like u described are absolutely predatory, but don't pretend that was what u were arguing before LMAO. anyways man hope you get into the school you want",
                                          "author": null,
                                          "created": 1609095508,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gh7emkh": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7emkh/",
              "text": "See here’s the problem: it’s mainly not them fully conducting and knowledgeable on the research project. They are more than aided by professionals and then their name justs gets slapped on",
              "author": "Mark_2020_",
              "created": 1609093299,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gh8b07a": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8b07a/",
          "text": "I absolutely agree, no high school students (or even vast majority of undergrads) should ever be published. However, it’s not absurd to want to do research. I currently have a position at a local UC doing some very advanced research for my education, and I love it. I highly doubt I’ll ever do anything of any significance whatsoever, but It’s giving me a taste of what I could expect if I continued in this field. I’ve learned insane amounts of stuff in a very small amount of time, more than high school has ever taught me, and I’d do it all over again even if it meant no college credit. I’m not going to lie and say this wasn’t for my college app, but i genuinely enjoy the experience and it will help me way beyond just being a line on a college app.",
          "author": "snafu____",
          "created": 1609109730,
          "upvotes": -1,
          "replies": {
            "gh9518r": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9518r/",
              "text": "Lol this really open my mind",
              "author": "TrafficSoft6353",
              "created": 1609125611,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh7a523": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7a523/",
      "text": "Just because applicants are doing these things doesn’t mean the colleges actually care or that they will be accepted. I’ve never heard an AO say they were looking for applicants who did research. Nor do you need a 1600 or perfect grades. Because we don’t really know what works (aside from major donations or being a recruited athlete) people are just throwing darts and hoping for the best.",
      "author": "ridinggirldreaming",
      "created": 1609090945,
      "upvotes": 35,
      "replies": {
        "gh7a95g": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7a95g/",
          "text": "Yeah that’s why I said AOs don’t say it but with so many students now scrambling for research positions, won’t it set standards for current and future applicants?",
          "author": null,
          "created": 1609091006,
          "upvotes": 7,
          "replies": {
            "gh7agd8": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7agd8/",
              "text": "I think it’s a fad like mission trips, massive volunteering, or paid summer programs. Eventually people will realize it doesn’t work.",
              "author": "ridinggirldreaming",
              "created": 1609091112,
              "upvotes": 21,
              "replies": {
                "gh7jsli": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7jsli/",
                  "text": "and nonprofits 🤪",
                  "author": "spineappletwist",
                  "created": 1609095907,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            },
            "gh91tze": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh91tze/",
              "text": "why does it matter what other people do? If the students love doing research, that is good on them!",
              "author": "idkname999",
              "created": 1609123902,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh79kfd": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh79kfd/",
      "text": "My question is when they find time to do this crap. In Junior/Sophmore year I barely had enough time to study for classes and SAT/ACT.",
      "author": "strangedell123",
      "created": 1609090636,
      "upvotes": 100,
      "replies": {
        "gh7s2lf": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7s2lf/",
          "text": "A lot have to sacrifice their normal teenage life to do these activities. The ones that can manage both those insane ecs and a social life though...",
          "author": "SlashingKarma",
          "created": 1609100161,
          "upvotes": 41,
          "replies": {}
        },
        "gh79ns2": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh79ns2/",
          "text": "Right? There are only 24 hours in a day and most of them are dedicated to schoolwork, not ECs.",
          "author": null,
          "created": 1609090686,
          "upvotes": 37,
          "replies": {
            "gh7du6z": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7du6z/",
              "text": ":( Feel the same. Super worried for RD maannn rejections suck",
              "author": null,
              "created": 1609092889,
              "upvotes": 11,
              "replies": {}
            },
            "gh87n2k": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh87n2k/",
              "text": "Yeah. When I actually had to commute to school I'd have my sport most days after, then go home to do hw and study for any tests. I never had free time except the weekends and I wasn't gonna spend my few days off doing something just to impress colleges. I would hang out with my friends, family, or just relax. And I didn't even know high schoolers could do research before seeing people here say it. There's a research program in my school but most of the studies that they made us participate in were like health questionnaires and other crap.",
              "author": "NeedRedditForSchool",
              "created": 1609107991,
              "upvotes": 6,
              "replies": {}
            },
            "gh91ivq": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh91ivq/",
              "text": "thing is, if you dedicate 24 hours a day for high school, you have to dedicate more than 24 hours a day for college lul (depending on college, but I am assuming we are talking about top ones)",
              "author": "idkname999",
              "created": 1609123731,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "gh87094": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh87094/",
          "text": "[deleted]",
          "author": null,
          "created": 1609107664,
          "upvotes": 3,
          "replies": {
            "gh8gl0q": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8gl0q/",
              "text": "I prioritize sleep so that is probably why I am the least depressed person in my grade.",
              "author": "strangedell123",
              "created": 1609112646,
              "upvotes": 9,
              "replies": {
                "gh8ku97": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8ku97/",
                  "text": "Same here. I know people who take caffeine pills and sleep roughly 2hrs a night. Teenagers shouldnt be under so much pressure :(",
                  "author": "keyofcsharpminor",
                  "created": 1609114850,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "gh8xzu7": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8xzu7/",
          "text": "I also wonder this",
          "author": "SadWolverine24",
          "created": 1609121891,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh7bv83": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bv83/",
      "text": "you want top college, college want top student.",
      "author": "HamachiObo",
      "created": 1609091858,
      "upvotes": 91,
      "replies": {
        "gh7euqf": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7euqf/",
          "text": "thjs made my day lmfao",
          "author": "Mark_2020_",
          "created": 1609093412,
          "upvotes": 7,
          "replies": {}
        },
        "gh7hev8": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hev8/",
          "text": "you want top student, college want top college.",
          "author": "presidentof25clubs",
          "created": 1609094711,
          "upvotes": 16,
          "replies": {}
        },
        "gh9hgkn": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hgkn/",
          "text": "Why do 17 year olds expect so much of colleges?",
          "author": "blazingminotaur",
          "created": 1609133205,
          "upvotes": 1,
          "replies": {
            "ghd94wf": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghd94wf/",
              "text": "[deleted]",
              "author": null,
              "created": 1609220882,
              "upvotes": 0,
              "replies": {
                "ghdntxb": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghdntxb/",
                  "text": "Only the T20s expect so much, and there are thousands of colleges in the US. That means that you're expecting one of the top colleges in the country, and you have a lot of expectations for them.",
                  "author": "blazingminotaur",
                  "created": 1609234456,
                  "upvotes": 3,
                  "replies": {
                    "ghdokdb": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghdokdb/",
                      "text": "Tbh I’m not. Not applying to any T20s or the like. Just concerned about others.",
                      "author": null,
                      "created": 1609235251,
                      "upvotes": 2,
                      "replies": {
                        "ghfq2s1": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghfq2s1/",
                          "text": "I suppose, but I don't think schools in general expect anything you talked about in the post. Its a nice bonus if someone has it, but there's plenty of people I know who got into T20s with relatively \"normal\" ECs.",
                          "author": "blazingminotaur",
                          "created": 1609280172,
                          "upvotes": -1,
                          "replies": {
                            "ghh1qgp": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghh1qgp/",
                              "text": "Oh yeah. Those were just exaggerations.",
                              "author": null,
                              "created": 1609306555,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh7k5l8": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7k5l8/",
      "text": "The thing is, this is only mildly the case if you are gunning for top schools. No one would like to admit it, but top schools are not for average people with average achievements. As the bar for academic and extracurricular excellence raises each year, students have to maintain competitiveness, and they do so by performing the activities you listed above. Colleges don't expect you to do those things, it's just that your high-achieving peers do so in order to impress admissions officers, and you follow suit. If you think that these activities are too much for a 17-year old, try talking to the millions of kids who are ferociously competing for limited spots at top schools and convince them to step down their game.\n\nYou can't just expect to get in to a *prestigious* T20 if you don't have the work ethic and talent of your competitors. Yeah I realize that the bar has been set extremely high for a bunch of kids, but as admissions data has shown, kids can be extremely competitive and fixated on those top schools.",
      "author": "not_haXor42",
      "created": 1609096090,
      "upvotes": 22,
      "replies": {
        "gh7qhht": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7qhht/",
          "text": "Perfectly sums it up.\n\nYou want to write average essays, get average scores, do average EC's? You're going to get admitted into an average college.\n\nYou have the skills to craft phenomenal essays, have commendable EC's and achieve high scores? You're on the path to a top college. \n\nFrankly, this is something I don't think OP and countless others on this sub understand.",
          "author": "ApprehensiveGrass4",
          "created": 1609099343,
          "upvotes": 13,
          "replies": {
            "gh9duxr": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9duxr/",
              "text": "yes please make this a post of its own. obviously those who are better raise the standards and deserve to get in over those who are average. if you aren't exceptional, you aren't exceptional. just accept it cuz there are thousands who will be better than you and deserve the spots at the top college",
              "author": null,
              "created": 1609130752,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gh786lv": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh786lv/",
      "text": "As a teacher, it's a frustrating process to witness because students--well, mainly their parents--can and do game the system. And the wealthier / better connected you are, the easier it is to do this. I've had students, whom  I wouldn't trust to feed the class fish, have their names included on cutting edge scientific articles. I'm guessing the fact that their mom ran the lab at the local university might have had something to do with it...\n\nWith SAT scores, being able to afford private tutors helps quite a bit. Not to mention all the programs that seem to send American high school kids off to ostensibly help orphans so they can write about it on their application essays.\n\nThe good news is that the admissions officers must develop a decent nose for sniffing out such padded applications. I would bet that many of them would be as impressed with the kid who works at Burger King after school as they would be with the one who mapped the genome at his dad's laboratory.\n\nAlso, if you're an international student, your story is probably going to be more interesting for admissions officers because it is different than what they normally see. I would really figure out what is different about your experience than the typical American applicant's, and sell that. Think about how much you'll enrich the university you attend with your different perspective.",
      "author": "baugh76",
      "created": 1609089888,
      "upvotes": 265,
      "replies": {
        "gh790zh": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh790zh/",
          "text": "Thank you so much for this!! This is so good to hear!! One more thing about international students is that we’re already at a disadvantage and especially if we need financial aid, we’re pretty much goners so the 1% who do get into these amazing colleges with financial aid need to be the ones who have done research and stuff or be super rich and don’t need any financial aid. I think the only reason I got rejected was because of financial aid.",
          "author": null,
          "created": 1609090344,
          "upvotes": 58,
          "replies": {
            "gh7u3we": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7u3we/",
              "text": "With international students, your school might also not understand the nuances of applying to American colleges.   \n\n\nFor example, when the college asks for your class rank--your school might actually give it to them. The top American high schools will inevitably tell the universities that they \"do not rank students,\" which is absolute BS--how do you think they choose their valedictorian, calculate honor roll, etc.? The issue is that if you're not the top student, the best American universities seem to lose a lot of interest--there aren't enough spots at Harvard for every valedictorian in the US. By not ranking students, a school has a much better chance of getting their good students into top colleges.  \n\n\nAlso, American recommendations tend to be glowing in general. The stereotype that we Americans are overly positive isn't completely without merit. A lot of my colleagues abroad would probably include shortcomings of students, seeing the recommendation as honest evaluations. (I wouldn't write a rec/evaluation for a student I couldn't recommend enthusiastically.)",
              "author": "baugh76",
              "created": 1609101194,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "gh7idnt": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7idnt/",
          "text": "From what I can tell is a lot of admissions officers at mid tier schools are starting to ignore normal flags of good students and looking more at their character, morals, and other aspects that can’t be gauged by GPA/SAT.\n\nI’m so happy colleges are starting to care more about non academic qualifications. Key word is starting to. T40 schools are never going to drop the insane requirements simply because of maintaining the prestige of their name.",
          "author": null,
          "created": 1609095191,
          "upvotes": 25,
          "replies": {
            "gh7otcn": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7otcn/",
              "text": "I actually think \"elite\" schools would also be relieved to see signs of some grit and normalcy--e.g. working a part-time job instead of interning at a prestigious law firm.  The admissions officers have to know what's going on better than most.",
              "author": "baugh76",
              "created": 1609098501,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "gh7pbdf": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7pbdf/",
          "text": "[deleted]",
          "author": null,
          "created": 1609098756,
          "upvotes": 7,
          "replies": {
            "gh7ugav": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ugav/",
              "text": "I hope so, and I'm crossing my fingers for you. (Be sure to mention your job in your application--it could make for an excellent essay.)",
              "author": "baugh76",
              "created": 1609101369,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gh9cyid": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9cyid/",
          "text": ">I would bet that many of them would be as impressed with the kid who works at Burger King after school as they would be with the one who mapped the genome at his dad's laboratory.\n\nAs much as nice and fluffy this sounds, are you really beleiving this? Regardless of whether the student was genuinely capable or not or worked to get the position, doing true academic research **at face value** takes a lot more intelligence and skill and proficiency in a field than working at fast food. you can argue all you want but we all know its true. This holds true in the cases where most kids dont reveal that they got the position through nepotism. However, like you said, if the AOs can draw a familial connection between research location/mentor and student, the student's research efforts will most likely be devalued. Colleges are research institutions so naturally they want researchers (either proven or with potential). Again keep in mind, I write this if we consider academic research done by a high schooler purely at face value.\n\nAlso keep in mind that the amount of students who independently reach out to colleges and do research is definetly far more than the amount that get the research position through nepotism.",
          "author": null,
          "created": 1609130166,
          "upvotes": 3,
          "replies": {
            "gh9sfy5": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9sfy5/",
              "text": "Keep in mind that at American colleges and universities, the admissions team is not made up of academics and researchers. They are not out to admit purely the students with the most academic potential.",
              "author": "baugh76",
              "created": 1609142616,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh78qvg": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh78qvg/",
      "text": "No offense meant, but I think you're talking about the most prestigious Ivy league schools. There are plenty of good schools out there where you can still get in without all this stuff, and plus the Ivy league isn't for your average joe: it's supposed to be where the best of the best go. So obviously, it's going to be hard.",
      "author": "tucson18",
      "created": 1609090192,
      "upvotes": 101,
      "replies": {
        "gh7bd69": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bd69/",
          "text": "nah even then it doesn't even matter. my friend got into cornell (got a likely too!) and he certainly didnt have a 1600/4.0 and he didn't have insane ECs lmfao.",
          "author": null,
          "created": 1609091590,
          "upvotes": 45,
          "replies": {
            "gh8h0fb": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8h0fb/",
              "text": "Cornell is the least stringent of the ivies from what I’ve heard, I know more people who’ve successfully gotten in there than any other Ivy",
              "author": "plainbread11",
              "created": 1609112871,
              "upvotes": 1,
              "replies": {
                "gh91ppy": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh91ppy/",
                  "text": "Cornell is still a big accomplishment lol. The worst ivy is still an ivy. It is like being the stupidest nobel laureate. Well, you still a nobel laureate.",
                  "author": "idkname999",
                  "created": 1609123837,
                  "upvotes": 8,
                  "replies": {
                    "gh9hedh": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hedh/",
                      "text": "There’s no such thing as the “worst” ivy lol, it depends on what kind of atmosphere you want",
                      "author": "blazingminotaur",
                      "created": 1609133163,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gh805kn": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh805kn/",
          "text": "Oh yes, that's very true. My brother had a 2 point something GPA (or it was in the very low 3s, I don't remember), 1 AP class (he took it because he knew he'd pass) a mediocre SAT score, and like two ECs, and he got into a fantastic school for business. It's not an Ivy league or a T50, but for business, it's amazing. He's graduating this spring, and several recruiters have reached out to him to offer him a job. You don't have to have extraordinary stats, or even go to a T50 to get a good job and be successful. Don't let this discourage you.",
          "author": "StuckInDreams",
          "created": 1609104174,
          "upvotes": 12,
          "replies": {
            "gh8h1oz": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8h1oz/",
              "text": "Babson?",
              "author": "plainbread11",
              "created": 1609112889,
              "upvotes": 2,
              "replies": {
                "gh8lf6i": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8lf6i/",
                  "text": "Nope.",
                  "author": "StuckInDreams",
                  "created": 1609115148,
                  "upvotes": 1,
                  "replies": {
                    "gh9qv71": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9qv71/",
                      "text": "Probably Kelley at IU.",
                      "author": "Rock540",
                      "created": 1609141036,
                      "upvotes": 3,
                      "replies": {
                        "gh9r0r0": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9r0r0/",
                          "text": "Nope.",
                          "author": "StuckInDreams",
                          "created": 1609141188,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gh8lhlu": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8lhlu/",
                      "text": "Where at if you don’t mind saying? Recent business school grad here",
                      "author": "plainbread11",
                      "created": 1609115181,
                      "upvotes": 2,
                      "replies": {
                        "gh8m2r7": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8m2r7/",
                          "text": "I'd rather not say. Sorry.",
                          "author": "StuckInDreams",
                          "created": 1609115486,
                          "upvotes": 1,
                          "replies": {
                            "gh8ns85": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8ns85/",
                              "text": "Fucking lame, it’s literally not a big deal. SAD!",
                              "author": "plainbread11",
                              "created": 1609116395,
                              "upvotes": -9,
                              "replies": {
                                "gh8swgo": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8swgo/",
                                  "text": "uh wtf? If you're not getting offers like his brother is, care more about your own resume than his brother's.",
                                  "author": "dobbysreward",
                                  "created": 1609119192,
                                  "upvotes": 8,
                                  "replies": {}
                                },
                                "gh8oc8e": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8oc8e/",
                                  "text": "I just don't feel comfortable saying it. Simple. If you can't respect my decision, then that's on you.",
                                  "author": "StuckInDreams",
                                  "created": 1609116702,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gh7cp57": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7cp57/",
          "text": "Best of the best and the very well connected. Don't forget the last part, because you'll want to focus on forming your own connections in college wherever you are. These will be with your peers, professors, employers, and many others. This is how you'll have greater success in getting great employment or further academic opportunity in the future.",
          "author": "aeroespacio",
          "created": 1609092301,
          "upvotes": 11,
          "replies": {}
        },
        "gh79km2": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh79km2/",
          "text": "[deleted]",
          "author": null,
          "created": 1609090639,
          "upvotes": -9,
          "replies": {
            "gh7f08h": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7f08h/",
              "text": "I think you’re probably too stressed and blowing everything out of proportion. People here have provided so much evidence that it’s not really about the ec’s or doing research or whatever, and it’s more about telling your story and writing a strong application. No one expects research, getting a medal from the president, or making a cancer treating foundation, they expect strong grades and test scores and a good app.",
              "author": "-RobertW-",
              "created": 1609093487,
              "upvotes": 26,
              "replies": {
                "gh7f5hk": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7f5hk/",
                  "text": "Yeah you’re right. I just think standards are so high (must just be me though cause I’m international and in need of fin aid).",
                  "author": null,
                  "created": 1609093561,
                  "upvotes": 4,
                  "replies": {
                    "gh7ghhn": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ghhn/",
                      "text": "Sure standards are high, but most of us here are high achievers and we meet and exceed these standards—including you. You’ll find a university you like, that offers you aid, and satisfies your needs, I assure you. It’ll work out, because if you always work hard, it always works out—that’s just the way it is. Good luck in your endeavors",
                      "author": "-RobertW-",
                      "created": 1609094245,
                      "upvotes": 6,
                      "replies": {
                        "gh7h6na": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7h6na/",
                          "text": "Thank you so much!! Good luck to you with everything as well!",
                          "author": null,
                          "created": 1609094594,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh7dqni": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7dqni/",
      "text": "What's worse is that getting these positions is a game of cold emailing and stuff. Respect to those who do that but bro I never even considered just spamming professors. Pretty sure I'm gonna get fucked in the corporate world.",
      "author": null,
      "created": 1609092839,
      "upvotes": 67,
      "replies": {
        "gh7duya": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7duya/",
          "text": "True. I’d be so embarassed for no reason like?? College and beyond is gonna be hard lmao.",
          "author": null,
          "created": 1609092900,
          "upvotes": 27,
          "replies": {
            "gh7fnhe": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fnhe/",
              "text": "[deleted]",
              "author": null,
              "created": 1609093819,
              "upvotes": 33,
              "replies": {
                "gh7ha28": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ha28/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1609094642,
                  "upvotes": 16,
                  "replies": {
                    "gh8npe7": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8npe7/",
                      "text": "What happened. How and what opportunities did you miss?",
                      "author": "EboyEman",
                      "created": 1609116353,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gh7fufn": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fufn/",
                  "text": "Oh yeah. You have to try. If you don’t, the answer is already no.",
                  "author": null,
                  "created": 1609093918,
                  "upvotes": 5,
                  "replies": {
                    "gh7ggr9": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ggr9/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1609094235,
                      "upvotes": 7,
                      "replies": {
                        "gh7h46f": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7h46f/",
                          "text": "Agreed! Passion matters much more than prestige.",
                          "author": null,
                          "created": 1609094558,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gh7e9hb": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7e9hb/",
              "text": "[deleted]",
              "author": null,
              "created": 1609093112,
              "upvotes": 9,
              "replies": {
                "gh7ez8h": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ez8h/",
                  "text": "Woah. I actually emailed a college asking for a fee waiver and basically got denied unless my counsellor could provide the letter cause they programs like free reduced lunch aren’t available in a country, thoroughly embarassed myself by telling a college I missed my interview when I didn’t (I just read the clock wrong) and asked a college if they received a doc from my counsellor yet (to find out my counsellor forgot to send it) and told myself I’m never emailing a collee again.",
                  "author": null,
                  "created": 1609093473,
                  "upvotes": 1,
                  "replies": {
                    "gh7fg5z": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fg5z/",
                      "text": "Oh shit bro nahh its good. Like in my case I emailed this one dude about a project I did and immediately got a response. Then I never emailed anyone again haha first time got me really anxious",
                      "author": null,
                      "created": 1609093713,
                      "upvotes": 4,
                      "replies": {
                        "gh7fmzd": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fmzd/",
                          "text": "Ahhh. Damn you social anxiety.",
                          "author": null,
                          "created": 1609093812,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh75iis": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh75iis/",
      "text": "I want everyone in this sub know that this is only for the best of the best colleges. You don't need to go to MIT to be successful. You'll be okay:)",
      "author": "galaxypig",
      "created": 1609088439,
      "upvotes": 54,
      "replies": {
        "gh7wfvm": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7wfvm/",
          "text": "and even then, this post is still quite the exaggeration. a lot of people get into t20s, t5s, etc without research, perfect scores/gpa, or god-tier ECs",
          "author": "callmekhakis",
          "created": 1609102368,
          "upvotes": 9,
          "replies": {
            "gha920o": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gha920o/",
              "text": "Of course it’s an exaggeration. That’s the whole point. I thought people would be smart enough to understand that. Oh well.",
              "author": null,
              "created": 1609160010,
              "upvotes": 1,
              "replies": {
                "ghabeqc": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghabeqc/",
                  "text": "god i forgot what this sub does to seniors where everything becomes an intelligence competition. \n\nyou literally said in your post that colleges want everyone to have research and that it’s becoming a standard. no, it’s not. MOST students don’t have these things, y’all just stress yourself out for absolutely no reason",
                  "author": "callmekhakis",
                  "created": 1609162024,
                  "upvotes": 1,
                  "replies": {
                    "ghadczl": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghadczl/",
                      "text": "That’s the truth as well. This sub does give me a skewed idea of the competition. Also I said it MIGHT set standards.",
                      "author": null,
                      "created": 1609163542,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ghazbfj": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghazbfj/",
          "text": "I know people who’ve gotten into MIT without these insane ECs. You don’t need them. You need to come across as interesting and motivated, not someone who is checking off boxes",
          "author": "llama548",
          "created": 1609176452,
          "upvotes": 1,
          "replies": {}
        },
        "gh75txm": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh75txm/",
          "text": "[deleted]",
          "author": null,
          "created": 1609088612,
          "upvotes": -8,
          "replies": {
            "gh7c01g": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7c01g/",
              "text": "To be fair, top tier institutes grant you access to resources, connections, prestige and opportunities you wouldn't be privy to at any run-of-the-mill college.",
              "author": "ApprehensiveGrass4",
              "created": 1609091930,
              "upvotes": 30,
              "replies": {
                "gh81hfx": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh81hfx/",
                  "text": "For this sub, a “bad” college is anything outside the top-25. Don’t tell me that Boston University is a “bad” school.",
                  "author": "Thomaswiththecru",
                  "created": 1609104824,
                  "upvotes": 5,
                  "replies": {}
                },
                "gh7fxv1": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fxv1/",
                  "text": "That's mostly for grad students. Undergraduates are lucky if the professor knows your name.",
                  "author": "cheapdad",
                  "created": 1609093966,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "gh91xtw": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh91xtw/",
              "text": "It does matter. It matters A LOT. However, not as much as people on this sub thinks.",
              "author": "idkname999",
              "created": 1609123960,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gh7d4ob": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7d4ob/",
      "text": "They don't expect this much. Most colleges expect decent grades, GPA, and a fairly decent essay. The expectations for the colleges you are talking about are all top colleges where people are expected to excel much further than their peers.",
      "author": "pl9870",
      "created": 1609092530,
      "upvotes": 13,
      "replies": {}
    },
    "gh7gcy0": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7gcy0/",
      "text": "I mean colleges don't expect it, it's just the competition. I don't really owe the majority of college applicants to stop what i'm doing. I'm doing it to further my career and potentially execute one of my entrepreneurial ideas.",
      "author": "Careless_Witness_732",
      "created": 1609094179,
      "upvotes": 8,
      "replies": {
        "gh9hzsz": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hzsz/",
          "text": "Right.",
          "author": null,
          "created": 1609133587,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh7iwvc": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7iwvc/",
      "text": "i totally feel your stress, but i also feel like this issue only applies to T10 schools which are super selective so... naturally these kids are picked. but for the vast majority of applicants and colleges, they don't expect this much. A2C and online college forums give a totally skewed impression of what the average kid is doing, at this point i bet you've put your best foot forward & gl with everything!",
      "author": "alavaa0",
      "created": 1609095463,
      "upvotes": 8,
      "replies": {
        "gh7j4rt": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7j4rt/",
          "text": "You’re right! Thank you so much!! Good luck with everything to you as well!",
          "author": null,
          "created": 1609095576,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh7htep": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7htep/",
      "text": "On top of that, you’re expected to write engaging, witty, breathtaking, and ✨unique✨ essays.",
      "author": "SnooOwls5156",
      "created": 1609094915,
      "upvotes": 17,
      "replies": {
        "gh7hz9i": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hz9i/",
          "text": "✨extraordinary✨ essays.",
          "author": null,
          "created": 1609094994,
          "upvotes": 10,
          "replies": {
            "gh7rhfb": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7rhfb/",
              "text": "✨with thy personality shining through✨",
              "author": "SnooOwls5156",
              "created": 1609099855,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "ghazfd7": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghazfd7/",
          "text": "Tbh I think the essay are more important than the ECs. Most people have decent ECs. It’s the essays that make you stand out",
          "author": "llama548",
          "created": 1609176509,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh7mgi0": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7mgi0/",
      "text": "Hey all. Take everything I say with a grain of salt, but my experience would indicate that this isn't completely true. I got into a top 10 university last year without this overly padded resume. I'm not a first gen/low income/immigrant student; I'm just a regular middle class teenager who worked hard in school and did things I was passionate about.",
      "author": "miker3107",
      "created": 1609097271,
      "upvotes": 6,
      "replies": {
        "gh92wa7": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh92wa7/",
          "text": "Yeah, I feel like people in this sub have the misconception that everyone in top schools are like little Einsteins.",
          "author": "idkname999",
          "created": 1609124479,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh7q9aw": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7q9aw/",
      "text": "Whenever I search up things like “Examples of activities for college apps”, it’s a whole bunch of insane things like starting a nonprofit, having many internships, and doing professional research💀",
      "author": "pink85091",
      "created": 1609099226,
      "upvotes": 7,
      "replies": {}
    },
    "gh7x8da": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7x8da/",
      "text": "Hot take: it’s not that universities are unfairly expecting these things from prospective students, but rather that an unrealistic number of students expect to attend one of these top caliber universities. If you’ve taken any Econ class you’ll see this is a classic case of an increase in demand juxtaposed with a static supply of spots, resulting in a higher “price”, or in this case academic credentials. Let’s not misplace blame here.",
      "author": "upstandingelf",
      "created": 1609102755,
      "upvotes": 8,
      "replies": {
        "gh93cem": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh93cem/",
          "text": "currently applying for graduate school and I see the same shit tbh.",
          "author": "idkname999",
          "created": 1609124716,
          "upvotes": 1,
          "replies": {}
        },
        "gh9gxd5": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9gxd5/",
          "text": "Right. It’s not the college’s fault.",
          "author": null,
          "created": 1609132832,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh6qof3": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh6qof3/",
      "text": "Ikr, it's become a bloody battle. US is the only country which has such high standards. Other countries your academics into account. And quite frankly that is a better way to judge students. The rich can easily get an internship or research position because of connections and they can afford SAT and ACT tutors while the low income students cannot. They can even donate a building and get their kid into the college of his choice or better pay  a coach.\n\nWhen I read posts here asking where to put their three research papers and whether to talk about the app they developed when they were 10, I'm feel really dejected and just want to give up everything.",
      "author": "-apieceofshit-",
      "created": 1609079133,
      "upvotes": 72,
      "replies": {
        "gh72ls6": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh72ls6/",
          "text": "Holistic review in the US is a MUCH better for low-income and first generation students compared to the rest of the world. They actually take your environment and situation into account when they judge. \n\nIn the rest of the world, rich people just pay for private expensive tutors and lavish boarding schools so their children to best on the big exam. It completely abandons poor people. At least in America, there are lots of online resources for the SAT for the poor and if one becomes a leader in their community through service and leadership, they could get to a top school. Plus the SAT isn’t really a knowledge intensive test, in other countries, calculus and hard sciences are a required part of these tests, further widening the disparity for poor people. \n\nThe high standards of US admissions isn’t because colleges necessarily require it, it’s just what the fierce competition breeds. All they want are people who seem like they will be successful and one can show that in MANY past a test score which is ALL that matters abroad.\n\nI don’t think Americans understand how privileged and overall better the system really is lol.",
          "author": "stansaxo123",
          "created": 1609086809,
          "upvotes": 45,
          "replies": {
            "gh7ewmr": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ewmr/",
              "text": "THIS",
              "author": "jupiter_josh",
              "created": 1609093437,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "gh72jdj": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh72jdj/",
          "text": "Dude... the US has the LEAST high standards. Its been repeated by so many AO's that you should tell your story. The US system values your interests and gives u incentive to pursue them. And the academics(in many Asian countries) is insanely hard. The competition in other countries has been a bloodbath for centuries( I literally mean centuries; courtesy of many government exams spanning back to the 15th century). The knowledge ur supposed to have in a wide variety of subjects requires lot of hard work and dedication.\n\nAlso, by \" least high standards\", I dont mean u have to work less hard to get into a top uni in the US. I mean that no college requires u to be the best at everything. MIT rejected a person who made a goddamn nuclear reactor.",
          "author": "Flashy-Height",
          "created": 1609086770,
          "upvotes": 51,
          "replies": {}
        },
        "gh72son": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh72son/",
          "text": "The US is by far not the worst or even close. Certain countries sum up everything by 1 single test. The US you get so many chances to prove yourself and even then you still get a shot",
          "author": "Typical-Dependent259",
          "created": 1609086919,
          "upvotes": 50,
          "replies": {
            "gh753w2": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh753w2/",
              "text": "[deleted]",
              "author": null,
              "created": 1609088218,
              "upvotes": 23,
              "replies": {
                "gh7hgbt": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hgbt/",
                  "text": "not to be rude, but how can you say for certain that \"the best universities in the world are in the US\" ??? Rankings mean shit.",
                  "author": "tomatoesaredeadtome",
                  "created": 1609094732,
                  "upvotes": -7,
                  "replies": {
                    "gh7mkdg": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7mkdg/",
                      "text": "I mean you have to remember that America is the father of modern formal college education. Young America created a bunch of schools for iterant preachers centuries ago and now they have the biggest endowments, most research output, and best faculty by a landslide compared to universities elsewhere, save a very few.\n\nYou can just look at Tsinghua or TokyoU or SKY and compare these three metrics for them to top US colleges. Now, if you dearly value something that those colleges offer that top US colleges do not, then of course top US colleges are of less value for you. But this isn't the case the majority of the time.",
                      "author": "PedaleFrancisca",
                      "created": 1609097329,
                      "upvotes": 5,
                      "replies": {
                        "gh7nv24": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7nv24/",
                          "text": "Well, I though America's college system was based on Scotland's... and that's a product of medieval learning or smth. Also, at least theoretically, a bigger endowment should directly correspond to more research. And what about Oxford? Cambridge? I dunno, I think the schools that produced Locke, Tolkien, and Steven Hawking deserve a little more credit.\n\nCompletely agree with your second paragraph tho.",
                          "author": "tomatoesaredeadtome",
                          "created": 1609098007,
                          "upvotes": -2,
                          "replies": {
                            "gh7o7pc": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7o7pc/",
                              "text": "Yeah I agree, OxBridge is what I was thinking about when I said \"save a few.\"\n\n&#x200B;\n\nAnd yeah, America didn't invent education. But most of modern formal education bears the most resemblance with the original American preacher schools (Harvard, William and Mary, etc.). I think Horace Mann is often called the \"father of modern education\" in fact.",
                              "author": "PedaleFrancisca",
                              "created": 1609098189,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gh7f95x": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7f95x/",
          "text": "This is just straight up wrong.... the standards in the US are SO much more holistic than places in Asia and eastern Europe. Yea there's an opportunity differential but not nearly as large compared to other countries.",
          "author": "bradms1127",
          "created": 1609093613,
          "upvotes": 13,
          "replies": {}
        },
        "gh7shv2": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7shv2/",
          "text": "To keep going with your point, it's not that American universities really have such high standards--in many ways their academic standards are lower, because in the US you're not applying to specific programs and departments. You're applying to the university/college in general, so your application must impress generalists--admissions officers are not academics. At many universities abroad, you actually have to show promise in your specific field. So Professor X from the Cognitive Science department would be asking about your experience with neuroscience; it wouldn't be Robbie the former Theta Chi bro saying, \"Let's choose this one, his name is on an article that sounds impressive--even though I cannot evaluate his role in it or whether the article holds up.\"   \n\n\nThe one field within American universities where a specialist is gauging a student's abilities is athletics. (Of course, at most top universities outside the US, being great at tennis isn't going to help you get in.)  \n\n\nAlso, most foreign colleges probably don't take things like race into account in admissions. Looking at my students in the US, it seems clear that it was harder for ethnic-Asian students to get into the same top schools as their peers.",
          "author": "baugh76",
          "created": 1609100375,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gh7jxxa": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7jxxa/",
      "text": "Isn't the whole Carnegie hall bullshit a product of geographic residence as well? Like obviously a kid from New England is more likely to perform there than a kid from the Midwest lol",
      "author": "spineappletwist",
      "created": 1609095982,
      "upvotes": 6,
      "replies": {
        "gh9hi2m": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hi2m/",
          "text": "Lol yeah.",
          "author": null,
          "created": 1609133236,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh7j7o1": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7j7o1/",
      "text": "nah i think the kids drive this competition up but after so much competition it unfortunately becomes the norm for colleges and they have to abide by those competitive applicants to make a decision so if a bunch does all this research and interning then sadly others may need to to compete. oh well tho this is just HYSP not your state schools",
      "author": "icewallowcome49",
      "created": 1609095616,
      "upvotes": 4,
      "replies": {
        "gh9hhda": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hhda/",
          "text": "Right! That’s what I meant!",
          "author": null,
          "created": 1609133221,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh7jq0p": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7jq0p/",
      "text": "In conclusion, if you want to get ahead in life, live in the Bay Area or Long Island (the rich part ofc)",
      "author": "goflyint0",
      "created": 1609095871,
      "upvotes": 4,
      "replies": {}
    },
    "gh7ls0t": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7ls0t/",
      "text": "I see where you’re coming from, but I know so many people who have gotten into T20s without anything out of the ordinary, just general clubs, good grades, and decent essays. These over the top things aren’t the benchmark, but if someone has them then colleges will rightfully consider that in the process. Colleges also factor in the context of the student and compare you to others of the same socioeconomic status, so I think it’s more than fair.\n\nAlso, I think when you describe colleges, you’re only thinking about T20s. Here’s the thing: T20s want students who are overachievers because their campus is a good fit for overachievers. Once you go to a T20, there’s still gonna be pressure to do research, etc. \n\nBut you don’t have to go to a T20. There are other colleges which are just as good, just not highly ranked. Yes, T20s expect a lot, but you’re also expecting a lot out of colleges because you want to be accepted to the top 0.1% of colleges in the country.",
      "author": "blazingminotaur",
      "created": 1609096921,
      "upvotes": 3,
      "replies": {}
    },
    "gh8bplj": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8bplj/",
      "text": "Fr i’m a junior and i’m scared. I feel like i’m not doing enough for colleges. Not to mention I also have no ECs since school is closed. I feel like no college will accept me.",
      "author": "peppathesheep",
      "created": 1609110096,
      "upvotes": 5,
      "replies": {
        "gh93hjk": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh93hjk/",
          "text": "get off this sub tbh. This sub is a very skewed dataset. \n\nAlso, as an advice, you probably want to seek EC outside of your school (google high school opportunities for HS). This way, you will be different from your peers.",
          "author": "idkname999",
          "created": 1609124793,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh7hfo2": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hfo2/",
      "text": "They don’t expect anything. Sure maybe the top colleges do, but that’s to differentiate students. It is your fault for placing undue emphasis on prestige.",
      "author": "Percivale3",
      "created": 1609094722,
      "upvotes": 6,
      "replies": {
        "gh7hn6x": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hn6x/",
          "text": "I don’t. I don’t care if I have to pick a community college over Yale, I’ll pick whatever is cheapest. Just concerned abour others on this sub under pressure.",
          "author": null,
          "created": 1609094830,
          "upvotes": 1,
          "replies": {
            "gh877s9": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh877s9/",
              "text": "It’s cutthroat if your not good enough (application wise) you won’t get in to the top colleges, there’s many other schools you can go to",
              "author": "Neved2000",
              "created": 1609107772,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh7dj7q": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7dj7q/",
      "text": "[https://mitadmissions.org/blogs/entry/many\\_ways\\_to\\_define\\_the\\_best/](https://mitadmissions.org/blogs/entry/many_ways_to_define_the_best/)\n\n\"So when a parent says to me, “Why does HYPSM (Harvard, Yale, Princeton,  Stanford, MIT, etc.) put so much emphasis on AP’s?” I reply “Why do you  put so much emphasis on HYPSM?” When a parent says “My kid’s value as a  person/student shouldn’t be measured by how many AP’s he/she has taken” I  say “…and your kid’s value as a person/student shouldn’t be measured by  whether or not he/she goes to HYPSM.” I could go on and on.\"",
      "author": "YoYoChadBoBo",
      "created": 1609092734,
      "upvotes": 8,
      "replies": {
        "gh7e51g": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7e51g/",
          "text": "Everyone has this on the back of their mind though. You tell someone you went to Yale, they’d be like “OMG THAT’S SO COOL WOW you’re pretty AND smart blah blah”, you tell a person you went to New Jersey Community College they’d be like “oh, that’s nice.” Truth is, they’re hyped because people hype them of course. You see 73 questions with a Upenn student, you never see 73 questions with a Penn State student.",
          "author": null,
          "created": 1609093047,
          "upvotes": 1,
          "replies": {
            "gh7fxcw": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fxcw/",
              "text": "Hopefully we can change that. Honestly, I'm not even sure if it's the colleges' fault anymore. What can they do to stop parents and kids and third party companies from trying their hardest to game the system? Why do we put so much emphasis on 5 colleges in the whole entire country?\n\nThough of course the Yale student deserves props for getting in. And the course rigor is (presumably) harder. But there's more to people than the school they go to. I don't think that initial buzz about someone being from a top university lasts in the long-run.\n\nBut also, screw applying to college to appease others. Buzz or no buzz, I'll do what I want with my education and my life. I don't need the popularity or perceived intelligence that a top school will give me.",
              "author": "YoYoChadBoBo",
              "created": 1609093959,
              "upvotes": 6,
              "replies": {}
            },
            "gh9e9bb": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9e9bb/",
              "text": "because it takes a lot more dedication, effort, hard work and intelligence to get into Yale than a Community College or a state school? obviously the Yale people had to beat **96%** of all applicants to reach there so society giving them that mad respect, and hype is well deserved for their achievement. an achievement less than 0.1% of all high school seniors could achieve",
              "author": null,
              "created": 1609131011,
              "upvotes": 1,
              "replies": {
                "gh9g6zz": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9g6zz/",
                  "text": "Yeah but most of the time it also doesn’t mean the community college people couldn’t have gotten into Yale or the like. Maybe they wanted to be closer to home? Save money? Who knows. Just saying intelligence shouldn’t be measured on the basis of where you went to college.",
                  "author": null,
                  "created": 1609132321,
                  "upvotes": 1,
                  "replies": {
                    "gh9hcnl": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hcnl/",
                      "text": "b r u h. do you know what uni you are talking about? This is **Yale.** Yes it does. 99.99% of all community college attendees could not have gotten in the Yale.\n\nIf they wanted to save money (and could have gotten into Yale), they would have gotten easily a full ride scholarship from a decently reputed 4 year university.  If they wanted to stay close (and could have gotten into Yale), they would have gotten into their state school.  Seriously consider what Yale is",
                      "author": null,
                      "created": 1609133130,
                      "upvotes": 0,
                      "replies": {
                        "gh9hg9h": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hg9h/",
                          "text": "Ok yeah you’re right. Not Yale necessarily, talking about need aware schools. That 0.1% a girl had to go to a state school because she couldn’t afford Brown, got into it though.",
                          "author": null,
                          "created": 1609133200,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh7k6jo": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7k6jo/",
      "text": "Some colleges are very generous about certain circumstances. Although I have a good GPA and decent test scores, I’m far from doing such accomplishments as the ones you listed (because, as you said, lack of access to said opportunities) yet I still got accepted to my dream school. It’s not about meeting a certain benchmark, it’s about making do with what you have. AOs will see that.",
      "author": "ItsPayo",
      "created": 1609096103,
      "upvotes": 3,
      "replies": {}
    },
    "gh7rbfk": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7rbfk/",
      "text": "I mean you don't need that. Apply to decent schools that aren't T20 (e.g. state schools, Colleges That Change Lives, other LACs) and you'll have a much easier time. This strategy worked well for me and I got into every school I applied to so far with a good GPA and essays, mediocre SAT score, and mediocre ECs, with plenty of large merit scholarships. Still waiting on the full-ride applications, but to me this makes much more sense than burning out in high school aiming for a T20 that won't magically make you successful anyways. This is especially the case if you're interested in fields that aren't obsessed with undergrad prestige. For me, that's medicine.",
      "author": "careerthrowaway10",
      "created": 1609099770,
      "upvotes": 3,
      "replies": {
        "gh9hti9": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hti9/",
          "text": "Same for me.",
          "author": null,
          "created": 1609133465,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh7se4y": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7se4y/",
      "text": "Because there's too many people going to college now.  They have to have a weeding out process of people who don't wanna be there. \n\nThey couldn't possibly increase classrooms and hire more professors. \n\nHow would they be able to pay the:\nDean\n\nDean's assistant\n\nDean's assistant assistant \n\nManager of his office\n\nAssistant manager to the manager\n\nSupplies manager \n\nHow could a college function without half of the money going to \"Management\" ??",
      "author": "Llanos31",
      "created": 1609100322,
      "upvotes": 3,
      "replies": {
        "gh86n05": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh86n05/",
          "text": "Actually Harvard could easily increase the size of their classrooms with their endowments but they choose not to to increase their prestige and selectivity",
          "author": "bluetaquitos",
          "created": 1609107469,
          "upvotes": 3,
          "replies": {
            "gh8cmcl": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8cmcl/",
              "text": "I think the comment was satire",
              "author": "MekaMuffin",
              "created": 1609110574,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gh7sys5": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7sys5/",
      "text": "... most state schools don't?\n\nIf you want to try to get into ivy league schools, either a) be rich or b) be an absurdly exceptional person who literally commits every minute to growing as a person or giving back to the community and do so in such a way as to have it all build an immaculate resume while acing your courses. That's the job. You don't make it in for showing up. \n\nIf you want to live a normal life, go to a normal school. It's fine, and you can do great with a BA from a state school. Choosing the insanely high pressure route is, well... a choice.",
      "author": "positiveonly938",
      "created": 1609100618,
      "upvotes": 3,
      "replies": {}
    },
    "gh878v0": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh878v0/",
      "text": "I agree. They're people in the comments saying that it's supposed to be this way to filter out other students and be universities for the \"best of the best\" which is true to a certain extent but these expectations also creates this high stakes process where students pursue extracurriculars and classes that they don't care about because they want to get in. The competition has increased because more people are applying because the population is rising  and applications like the common app let you apply to numerous colleges easily.",
      "author": "bluetaquitos",
      "created": 1609107787,
      "upvotes": 3,
      "replies": {
        "gh9h9bc": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9h9bc/",
          "text": "Right?! THANK YOU.",
          "author": null,
          "created": 1609133065,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh8fl3e": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8fl3e/",
      "text": "They dont, but thats what the gold standard has become.",
      "author": "vtribal",
      "created": 1609112130,
      "upvotes": 3,
      "replies": {}
    },
    "gh7tlav": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7tlav/",
      "text": "I wish it was back when all teenagers did was have fun and have hobbies/sports rather than creating full blown nonprofits and publishing research making it a norm to get into Ivy's.",
      "author": "EpicGamesLauncher",
      "created": 1609100933,
      "upvotes": 4,
      "replies": {
        "gh92qjs": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh92qjs/",
          "text": "such a myth tbh. I know people from ivies and MIT. Non of them created nonprofits or published research. Those things helps but definitely not required.",
          "author": "idkname999",
          "created": 1609124392,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh7erzl": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7erzl/",
      "text": "When you've performed 52 times at Carnegie Hall and STILL got rejected from Yale 😭",
      "author": "zzjenni",
      "created": 1609093374,
      "upvotes": 7,
      "replies": {
        "gh7hlie": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7hlie/",
          "text": "weird flex but ok",
          "author": "presidentof25clubs",
          "created": 1609094807,
          "upvotes": 8,
          "replies": {
            "gh7tc92": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7tc92/",
              "text": "ok president of 25 clubs",
              "author": "zzjenni",
              "created": 1609100806,
              "upvotes": 4,
              "replies": {
                "gh86ajf": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh86ajf/",
                  "text": "It’s a satire name.",
                  "author": "presidentof25clubs",
                  "created": 1609107288,
                  "upvotes": 1,
                  "replies": {
                    "gh8pms7": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8pms7/",
                      "text": "omg really?? 😰😰 no wayyy",
                      "author": "zzjenni",
                      "created": 1609117414,
                      "upvotes": 1,
                      "replies": {
                        "gh9f6v3": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9f6v3/",
                          "text": "ikr😱",
                          "author": "presidentof25clubs",
                          "created": 1609131628,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh7mydo": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7mydo/",
      "text": "I really think selection size is skewing our results here though. We have A2C, reversechanceme, chanceme (dumpster fire), collegeresults, ACT/SAT making up the main body of our Reddit college bubble. Even if we ignore overlap (which you definitely shouldn’t in a practical sense), the amount of subscribers works out to be ~590,000. [This PEW study](https://www.google.com/amp/s/www.pewresearch.org/fact-tank/2019/04/09/a-majority-of-u-s-colleges-admit-most-students-who-apply/%3famp=1) suggests that this is ~6% of the pool. Again, *this ignores people subscribed to multiple subs and only reaffirms how minor the amount of truly god-tier applicants there are.* \n\nWe see people who post about their cancer research, their 1600/4.0, and their Google internships, but these are the people who feel compelled to do so. These subs are full of high-achieving individuals, and mixed with the subtle (and not so subtle) competitiveness of college applications, some feel inclined to share with people. Sometimes it’s just sharing to share, other times it might not be. My point is, I think the worries that we need XYZ to be truly competitive is overblown. The amount of people who really are doing mind-boggling things is small, and isn’t a true benchmark.",
      "author": "GreenTNT",
      "created": 1609097531,
      "upvotes": 2,
      "replies": {}
    },
    "gh7r3ao": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7r3ao/",
      "text": "They don't expect that. Plenty of people make it into plenty of colleges without those things.\n\nThose things just make you a more competitive applicant. You are weighted against other applicants by a variety of factors, and EC is one of those.",
      "author": "ObviouslyAnExpert",
      "created": 1609099655,
      "upvotes": 2,
      "replies": {}
    },
    "gh7y4mm": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7y4mm/",
      "text": "Well, those elite colleges aren't for everyone. They're meant to be exclusive. They're meant to have the best of the best. If you were MIT for example, who would you choose, that person you described or someone objectively less impressive?\n\nThe vast majority colleges don't have those standards, and many of them are excellent. \n\nElite colleges are for elite students who do elite things. \n\n(I am not an elite student, at least compared to what you described 😂)",
      "author": "Lemon1212111",
      "created": 1609103197,
      "upvotes": 2,
      "replies": {}
    },
    "gh7yw7e": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7yw7e/",
      "text": "[deleted]",
      "author": null,
      "created": 1609103583,
      "upvotes": 2,
      "replies": {
        "gh9gzho": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9gzho/",
          "text": "Yeah true.",
          "author": null,
          "created": 1609132873,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh8fiyy": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8fiyy/",
      "text": "They don’t. At least like 99.9% of them",
      "author": "xxxLilJune",
      "created": 1609112099,
      "upvotes": 2,
      "replies": {}
    },
    "gh8ihrh": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8ihrh/",
      "text": "Friendly reminder that Upenn acceptance rate was 55% in 1990. And that Boston University acceptance rate went from 75% to 25% over about 30 years. I believe it's just supply and demand where demand increases but supply doesn't (when I think it should)",
      "author": "ooooale",
      "created": 1609113630,
      "upvotes": 2,
      "replies": {
        "gh9fmw1": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9fmw1/",
          "text": "Yeah true!",
          "author": null,
          "created": 1609131932,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh8o6fd": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8o6fd/",
      "text": "ITS THE FACT THAT YOU WERENT EXXAGERATING THAT LIST AT ALL FOR ME",
      "author": "Aquaberry19",
      "created": 1609116611,
      "upvotes": 2,
      "replies": {
        "gh8o7z1": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8o7z1/",
          "text": "no joke my mom and i were literally ranting about this today",
          "author": "Aquaberry19",
          "created": 1609116636,
          "upvotes": 2,
          "replies": {}
        },
        "gh9fykb": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9fykb/",
          "text": "HAHAHAHAHA",
          "author": null,
          "created": 1609132156,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh8yp1y": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8yp1y/",
      "text": "Why are you guys getting caught up with the examples? There might be exaggerated for emphasis; don't dismiss the entire post because of it.\n\nWe're on an \"Applying to College\" subreddit, I'm certain everyone here has adequate analytical reading skills to derive the main idea of this post.",
      "author": "SadWolverine24",
      "created": 1609122252,
      "upvotes": 2,
      "replies": {
        "gh9ge4a": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9ge4a/",
          "text": "Right?! I just meant the gist and people right out here psychoanalysing me, and taking the most vague parts out of context doing so. 😭",
          "author": null,
          "created": 1609132460,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ghr03kf": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghr03kf/",
      "text": "You're spitting straight facts. Its almost impossible to get into any high level college with grades alone, you need to do be some exceptional person or some shit. Except if you're rich though. Then the rules don't apply.",
      "author": "SheikhYusufStalin",
      "created": 1609529178,
      "upvotes": 2,
      "replies": {}
    },
    "gh7cnwc": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7cnwc/",
      "text": "Didn’t a group of teenagers write the Declaration of Independence? That would’ve been so good on a college app",
      "author": "bloatedchimpanzee",
      "created": 1609092283,
      "upvotes": 2,
      "replies": {
        "gh7fkk0": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fkk0/",
          "text": "Not sure if I'm missing the sarcasm but the youngest founding father was 29...",
          "author": "Thomaswiththecru",
          "created": 1609093777,
          "upvotes": 9,
          "replies": {
            "gh7j7gb": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7j7gb/",
              "text": "What’s a founding father? Is it like the queen of England",
              "author": "bloatedchimpanzee",
              "created": 1609095613,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh7q6u3": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7q6u3/",
      "text": "This is mainly due to the availability and representative heuristics imposed on users on this sub. People who post here/chanceme/collegeresults are not the norm and are usually also exaggerating or even lying about their profiles and results, leading to unrealistic views about what a typical HYPSM student should look like.\n\nIn reality, there are hundreds of very 'normal' people with nothing extraordinary who get into T20s all the time. It's just that you don't hear about them because they aren't the type of people to obsess over admissions or spam these subs.",
      "author": null,
      "created": 1609099193,
      "upvotes": 1,
      "replies": {}
    },
    "gh7tgtm": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7tgtm/",
      "text": "The reason colleges expect so much is because kids set the high standards themselves so colleges just take kids who are extraordinary.",
      "author": "IiiiiiiIiiIIIillllI",
      "created": 1609100870,
      "upvotes": 1,
      "replies": {
        "gh9gqq7": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9gqq7/",
          "text": "Right. That’s what I meant.",
          "author": null,
          "created": 1609132704,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh7z1l4": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7z1l4/",
      "text": "These are ivy league schools. No one 'expects'' you to do these things nor are they the standard. If you haven't  done research or received those awards, it might be that you're simply not fit for those schools. These schools are for the best students in the world. That's all there is to it.",
      "author": "marsh3476",
      "created": 1609103654,
      "upvotes": 1,
      "replies": {
        "gh9ocej": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9ocej/",
          "text": "it's just crazy because all of this internationally impactful extracurricular/research/award stuff wasn't a requirement 20+ yrs ago. And those schools were still elite.",
          "author": "spineappletwist",
          "created": 1609138663,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh85ik0": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh85ik0/",
      "text": "The bar is set by the high achieving students you’re competing with, NOT the school. YOU are putting this pressure on yourself because YOU want to go to a prestigious college. If you were comfortable going to a state school your worries would disappear. But you want that prestige, just like everyone else here. It’s legitimate. You’re human and humans desire material things. But don’t complain. It’s self-induced.",
      "author": "Goodman9473",
      "created": 1609106881,
      "upvotes": 1,
      "replies": {
        "gh9h4dl": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9h4dl/",
          "text": "I am. I’m just talking about others.",
          "author": null,
          "created": 1609132968,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh866gr": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh866gr/",
      "text": "(Take my words with a lot of salt)\nThey don’t. I’m assuming you’re talking about top tier colleges when you say this. Most colleges in general you can probably get into with good grades, decent ecs, good sat, and good essays (and many of those colleges are quite good, vtech is the first one that comes to my mind). Even for top tier schools, what they want to see most of all is that you’re passionate about what you do, and it just so happens that people with crazy insane ecs are very passionate about what they do and are able to show that off with their insane ecs.",
      "author": "namey-name-name",
      "created": 1609107229,
      "upvotes": 1,
      "replies": {
        "gh9h6ni": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9h6ni/",
          "text": "Agreed.",
          "author": null,
          "created": 1609133012,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh8dtgv": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8dtgv/",
      "text": "Yeah...no. Your ecs are compared to what you have available to you. Well at least Stanford does because the class of 2024 has a good percentage of low income students who haven't done any of what you listed.",
      "author": "balck_mist",
      "created": 1609111205,
      "upvotes": 1,
      "replies": {
        "gh9fozp": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9fozp/",
          "text": "Right. Good to know.",
          "author": null,
          "created": 1609131972,
          "upvotes": 1,
          "replies": {
            "gh9ib5u": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9ib5u/",
              "text": "?",
              "author": "balck_mist",
              "created": 1609133812,
              "upvotes": 1,
              "replies": {
                "gh9ih40": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9ih40/",
                  "text": "Good to know that still don’t have to do all this to get into top colleges.",
                  "author": null,
                  "created": 1609133932,
                  "upvotes": 1,
                  "replies": {
                    "gh9ilh7": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9ilh7/",
                      "text": "Oh. Good luck with you decisions.",
                      "author": "balck_mist",
                      "created": 1609134022,
                      "upvotes": 1,
                      "replies": {
                        "gh9iv8c": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9iv8c/",
                          "text": "Thank you so much!! Good luck to you with all your endeavours!",
                          "author": null,
                          "created": 1609134217,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh8fvov": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8fvov/",
      "text": "What gets me the most is my school has never allowed us to take AP classes. I totally would if I could, but I feel massively disadvantaged because I was never given a chance.",
      "author": "Benign_Banjo",
      "created": 1609112279,
      "upvotes": 1,
      "replies": {
        "gh9fx4g": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9fx4g/",
          "text": "Oh yeah you don’t have to worry about that. Your school profile will tell colleges you didn’t have the chance to take AP classes and your application will be evaluated in that sense.",
          "author": null,
          "created": 1609132128,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gh8g9fr": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8g9fr/",
      "text": "Tired of these posts bro stop putting all this pressure on yourself and just do your best",
      "author": "swampvermn",
      "created": 1609112476,
      "upvotes": 1,
      "replies": {
        "gh9fnjp": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9fnjp/",
          "text": "I will",
          "author": null,
          "created": 1609131944,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh8gvpg": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8gvpg/",
      "text": "They dont",
      "author": "evantap",
      "created": 1609112802,
      "upvotes": 1,
      "replies": {}
    },
    "gh8miow": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8miow/",
      "text": "I don’t understand posts like this",
      "author": "NearbyProfessional0",
      "created": 1609115719,
      "upvotes": 1,
      "replies": {}
    },
    "gh8sgjt": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8sgjt/",
      "text": "It’s an arms race. I could tell you who started it but you am know!",
      "author": "digby99",
      "created": 1609118954,
      "upvotes": 1,
      "replies": {}
    },
    "gh8t3ay": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8t3ay/",
      "text": "Cause they want the best",
      "author": "8albert34",
      "created": 1609119297,
      "upvotes": 1,
      "replies": {}
    },
    "gh8vhws": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8vhws/",
      "text": "Lol I had literally every single thing u listed + head of a huge NPO and I got deferred from Harvard :p",
      "author": "Asian-Squat",
      "created": 1609120577,
      "upvotes": 1,
      "replies": {
        "gh9g1hh": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9g1hh/",
          "text": "This time, I’m pretty sure they didn’t even read the majority of the applications, just deferred them. Hope RD round works out for you.",
          "author": null,
          "created": 1609132213,
          "upvotes": 2,
          "replies": {
            "gh9gxl4": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9gxl4/",
              "text": "hopefully, got my fingers crossed for stanford lol",
              "author": "Asian-Squat",
              "created": 1609132836,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gh8vydp": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8vydp/",
      "text": "I'm reposting at the parent level because it deserves to be said...\n\n&#x200B;\n\n>*I’ve seen a lot of these sites*\n\nThese are also echo-chambers. Reality is much different from what's discussed online.\n\nSince you mentioned med school, I'll give you a free tip and then I'm done with this thread:\n\nOne  of the traps that many ambitious high-schoolers fall into (especially  those who want to go into Medicine) is that they focus so much on the  long-term that they make planning mistakes in the short-term.\n\nThe  biggest planning mistake they make is that they just \\*\\*assume\\*\\* that  they will succeed in undergrad and that they will \"get in\" to med school  (or law school or whatever) when in reality the odds of this happening  is much much lower. STEM is hard. Full stop. You will have a hard time  just keeping up with your coursework that you'll forget that you ever  wanted to spend your minuscule amount of free time helping a professor  with research.\n\nI would put the  estimate at somewhere around 2 out of every 10 randomly selected high  school students who want to become medical doctors actually become  medical doctors.\n\nThe smart play is  to focus on being employable with your undergraduate degree rather than  just assuming that your undergrad degree will just be a stepping-stone  to something better.\n\nMajoring in  biology, for instance, is a bad move for most people because the major  is notoriously difficult to get a job with at the Bachelor's level.  Chemical engineering, for instance, will better prepare you in terms of  academic rigor that more closely approximates the med school experience  and has the benefit of being highly employable if you choose not to be a  medical doctor.",
      "author": "jupiter_josh",
      "created": 1609120820,
      "upvotes": 1,
      "replies": {}
    },
    "gh8xq9a": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8xq9a/",
      "text": "To be fair, i dont think the average kids who get in try to flex their stats",
      "author": "yeahitsjoyce",
      "created": 1609121752,
      "upvotes": 1,
      "replies": {}
    },
    "gh92en0": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh92en0/",
      "text": "It's quite ironic—they admit students who've accomplished so much they'd be well off without the college.",
      "author": "mynameisjeff0704",
      "created": 1609124214,
      "upvotes": 1,
      "replies": {}
    },
    "gh93lfw": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh93lfw/",
      "text": "They don’t.",
      "author": "Portizzle00",
      "created": 1609124851,
      "upvotes": 1,
      "replies": {}
    },
    "gh98h3c": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh98h3c/",
      "text": "First of all, colleges definitely do not expect it. It’s just become more and more prominent as an idea among college applicants’ minds. \n\nHowever, I’d think a major reason for this because as there were never official benchmarks or “checklist style” requirements for applying to college, other than the bare minimum GPA, the only way most parents (that don’t have direct access to college admission officers and such directly reliable sources) of younger students could get information would be from parents of students who are graduating/have graduated/have been admitted to college. \n\nAs a result of this, the parents of one such kid that had been admitted to college *partially by means of* having something like “research with _____ professor at ____ university” under their belt, may carry this message over to eager parents of younger students, leading these parents to then tell their child to “do research” or something as prestigious as that, which *they* expect to be a good thing to do for college. \n\nAs it goes, this message can be (and is indeed) further conveyed as *increasingly crucial or essential* for colleges, altering the mindset of a large portion of college applicants and/or their parents, all the while colleges never pushing this themselves. Sure they’re aware of this mindset becoming more common among the applicants, but they ultimately just want the best of the best that apply there, and that’s determined literally only by the application, resume, and essay (and maybe a Zoom interview to finalize decisions) that each person submits to them. \n\nSo regardless of how stacked those of a graduating class of batch of applicants are with these insane statistics like test scores and grades, along with insane extracurriculars, the college just wants the top people in that batch. If it’s a relatively dumb or  weak batch of applicants, the people with the highest among this batch are the ones that are accepted at _____ university. If it’s a relatively high scoring, high ranking, and high achieving batch of applicants, the people with the highest among this batch are the ones that are accepted at _____ university. \n\nBottom line: colleges themselves most certainly *do not* expect this of applicants. It’s completely 100% the applicants’ choice what they do with their four years of high school, and while yes, it’s unfair because all students don’t have the same opportunities, it’s just how it works. That’s why the holistic admission process is becoming increasingly popular and ideal among highly selective colleges, allowing each applicant to be completely examined (and their background, access to opportunities, income, etc. can be considered as well as the typical grades, ECs, scores, etc.).",
      "author": "ck614",
      "created": 1609127459,
      "upvotes": 1,
      "replies": {
        "gh9g8f7": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9g8f7/",
          "text": "Yeah that’s what I meant. It’s becoming more prominent.",
          "author": null,
          "created": 1609132349,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh9f1lj": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9f1lj/",
      "text": "They don’t it’s more the standards the kids set, so logically thinking they will take the kids who can handle the pressure and who are extraordinary. But I do understand what ur saying, so if you want to resolve this you need to kill half the people who are applying 😂👍",
      "author": "IiiiiiiIiiIIIillllI",
      "created": 1609131531,
      "upvotes": 1,
      "replies": {}
    },
    "gh9isvm": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9isvm/",
      "text": "Research is only relevant for t5 as a stem applicant, and even then it’s not that important",
      "author": "pokemongofanboy",
      "created": 1609134169,
      "upvotes": 1,
      "replies": {}
    },
    "gh9pmif": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9pmif/",
      "text": "Bruh, had it not been for the pandemic, I actually would have performed at Carnegie Hall last June. Fuck this pandemic.",
      "author": "rljf311",
      "created": 1609139842,
      "upvotes": 1,
      "replies": {
        "gh9ppon": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9ppon/",
          "text": "Ouch. Pandemic made us all miss out. But wait. Last June? Do you mean this year or the last?",
          "author": null,
          "created": 1609139926,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghabqh6": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghabqh6/",
      "text": "Just play your part.\nYou don't need all these to get admitted for graduate school.",
      "author": "Onase",
      "created": 1609162289,
      "upvotes": 1,
      "replies": {
        "ghaddpc": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghaddpc/",
          "text": "I will, thanks!",
          "author": null,
          "created": 1609163558,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghac76c": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghac76c/",
      "text": "Keep in mind that only about 1% of colleges in the US expect that. There are 4,000+ non-profit colleges and universities in the US. That’s why I hate the phrase “getting into college,” as if “college” is some monolith.",
      "author": null,
      "created": 1609162659,
      "upvotes": 1,
      "replies": {
        "ghadhrr": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghadhrr/",
          "text": "Right.",
          "author": null,
          "created": 1609163640,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghasmx6": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghasmx6/",
      "text": "Good question ! Being an international student who's not accustomed to such \"holistic\" approach , the whole prep is pretty intimidating , I can feel time tightening in on me(with such pressure I  had felt never before ) as my SAT dates are lurking around the corner , Anyways ,Have you herd that story where MIT in reality straightly rejected a guy who made a fully functional NUCLEAR REACTOR in his backyard? \n\nYou don't need  all this shit under your belt to show the impeccable and relentless college preparedness, yes I know that surviving college itself is a pretty dauting task with juggling 12 hr homework, internships ,ECs, and ton of other stuff and this may show college preparedness but if you are able to piece together all your ECs n form a coherent genuine application that shows the wit , ingeunity , and  mere sense of how to fit with the college ( which in this case nuclear rector guy doesn't had , who wants a room mate with nuclear reactor ?, Infact MIT gives  a blunt C even to a human jump plain project  if that has even  a 1% chance of risking safety). \n\nyeah, A future best selling writer do have an upper hand in the application but this is not necessarily true , see this [Role of personality and what they look for](https://news.mit.edu/2016/stu-schmill-endorses-consideration-of-character-in-college-admissions-0120)  .\n\nJust strive for the best possible with all your resources and have a most infectious thinking process, maturity , personality, wit to learn , anything that makes you awesome.",
      "author": "Nikhil_979",
      "created": 1609173000,
      "upvotes": 1,
      "replies": {}
    },
    "ghbmb6k": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghbmb6k/",
      "text": "\"Colleges\" don't. Most expect you to pass your high school classes.\n\nA few private schools that educate a tiny percentage of the population requires these things because they can and they refuse to expand to meet demand. They have no obligation to make their requirements more reasonable.\n\nEven the two public T20s don't *really* require these things, and if you're a CA resident you can get guaranteed admission to some of their sister campuses that are themselves T40s. So the pressure's totally off IMO.",
      "author": "thezander8",
      "created": 1609188029,
      "upvotes": 1,
      "replies": {}
    },
    "ghkjboe": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghkjboe/",
      "text": "Damn I felt super called out reading this post. I literally have a 4.0 gpa, 1520 SAT, but it get's weirder like what the heck is the Carnegie hall example?? I've literally played the trumpet on stage at Carnegie hall on two occasions. Just what...",
      "author": "Toxmudkip",
      "created": 1609384661,
      "upvotes": 1,
      "replies": {
        "ghl0lca": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/ghl0lca/",
          "text": "?? I never said it was bad thing. And this is all clearly an exaggeration. Carnegie hall is pretty prestigious I never said you should feel bad or called out.",
          "author": null,
          "created": 1609395659,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gh7bef2": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7bef2/",
      "text": "I think holistic admissions account for this because colleges get information on what opportunities you're given and if you did take advantage of everything you were given (holistic admissions are still subjective and flawed but allow a better equal playing field than just using standardized test scores) \n\nThey know that a 17-year-old probably hasn't accomplished a lot in their life yet and they don't expect someone to do research, intern, or perform at Carnegie Hall. In my opinion, if you are achieving a lot given the opportunities you're given then colleges will see that you put as much hard word in as the kids that are given more opportunities and funding.",
      "author": "lki03",
      "created": 1609091608,
      "upvotes": 1,
      "replies": {}
    },
    "gh8b4gi": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8b4gi/",
      "text": "I think you mean a ivy league school wants this but you can go to a smaller collage with like a 3.2 gpa and just playing like one sport",
      "author": "spadezed",
      "created": 1609109791,
      "upvotes": 1,
      "replies": {
        "gh9hc0g": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh9hc0g/",
          "text": "Yeah.",
          "author": null,
          "created": 1609133118,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gh71z4m": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh71z4m/",
      "text": "1. College is a business\n2. The USA is the best country in the world (I am international not from the usa)\n\nWhen you take those into account, you would realize why this process is like that.",
      "author": "TobiasAndelman",
      "created": 1609086448,
      "upvotes": -3,
      "replies": {
        "gh721gn": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh721gn/",
          "text": "Even Americans would argue the second point.",
          "author": null,
          "created": 1609086485,
          "upvotes": 13,
          "replies": {
            "gh72ebs": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh72ebs/",
              "text": "Probably. It is really difficult to realize that your country is the best if you have actually lived your whole life there. You do have really big issues but in my opinion it is the best country. When we talk about college it is more about the economical side that I am talking about, which is obviously one of the strong sides of the USA.",
              "author": "TobiasAndelman",
              "created": 1609086689,
              "upvotes": -2,
              "replies": {
                "gh7348h": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7348h/",
                  "text": "Well, its also easy for you to say its the best country when you've never lived here. You haven't seen any of the problems our country experiences on a day to day basis. All you see is the glorified version. \"The best\" is subjective and really just depends on what you value.",
                  "author": "Jmh1881",
                  "created": 1609087100,
                  "upvotes": 7,
                  "replies": {
                    "gh73tdg": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh73tdg/",
                      "text": "You have a good point. There are probably many of the “bad” things about the USA that I will understand only when I live there. I do think it is the best country I could study and further live, but obviously the absolute number 1 spot is subjective.",
                      "author": "TobiasAndelman",
                      "created": 1609087490,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gh7fe16": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fe16/",
                      "text": "America is great for the \"haves.\" \n\nA fair number of countries are better for the \"have nots.\" \n\nThe United States government has engaged in unethical, inhumane, and otherwise unsavory conduct at home and abroad. Our government is not the best in the world, and if it was, \"best\" is a recklessly subjective qualifier and finds the \"least bad.\"",
                      "author": "Thomaswiththecru",
                      "created": 1609093683,
                      "upvotes": -2,
                      "replies": {
                        "gh7slys": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7slys/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1609100434,
                          "upvotes": 1,
                          "replies": {
                            "gh7vy93": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7vy93/",
                              "text": "I’m not here to argue about where the US ranks globally. I’m merely disputing whether it is the “best.”",
                              "author": "Thomaswiththecru",
                              "created": 1609102119,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gh72v56": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh72v56/",
                  "text": "Oh I’m not American haha and yeah it’s the first that comes to my mind while thinking of education. You don’t necessarily think Oxford or Cambridge first while thinking of good and prestigious colleges, you think of Stanford and Harvard. Financially and educationally, America is on the top.",
                  "author": null,
                  "created": 1609086958,
                  "upvotes": 3,
                  "replies": {
                    "gh73a3w": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh73a3w/",
                      "text": "Oxford and Cambridge are “Harvard level” colleges, but yeah, Top US universities get much more propaganda.",
                      "author": "TobiasAndelman",
                      "created": 1609087192,
                      "upvotes": 4,
                      "replies": {
                        "gh73de3": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh73de3/",
                          "text": "Oh yeah they absolutely are. I just meant Stanford and Harvard usually stick out to people more. Maybe they have heard of them more. Depends though.",
                          "author": null,
                          "created": 1609087243,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gh72l6g": {
          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh72l6g/",
          "text": "That second point is subjective, just cause ur an international saying US is the best country doesn't mean that all internationals agree (I'm international too). Sure US is among the best country but I wouldn't iust give it the absolute number 1 spot, its flawed in 100s of ways just like is many other countries....",
          "author": "ShadowSH_2306",
          "created": 1609086799,
          "upvotes": 1,
          "replies": {
            "gh72u10": {
              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh72u10/",
              "text": "Yeah, I should have said AMONG the best countries. My point lies in the fact that as such, it is one of the most competitive. And not only for college, employment will also be extremely competitive.",
              "author": "TobiasAndelman",
              "created": 1609086941,
              "upvotes": 5,
              "replies": {
                "gh76ze8": {
                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh76ze8/",
                  "text": "I guess it is pretty factual that we have the best economy/capitalism, which trickles down to various competitive aspects of society. \n\nWhether that is a good thing is subjective",
                  "author": "Healthy-Nebula364",
                  "created": 1609089240,
                  "upvotes": -2,
                  "replies": {
                    "gh77cr2": {
                      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh77cr2/",
                      "text": "How can having the best economy not be a good thing? The only negative aspect of this that I can think of is the society becoming very materialistic, but having a good and “stable” economy is always good.",
                      "author": "TobiasAndelman",
                      "created": 1609089443,
                      "upvotes": 3,
                      "replies": {
                        "gh7fpzi": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7fpzi/",
                          "text": "If you end up studying in the states, visiting places like the Appalachia Region, the \"Skid Row\" in Los Angeles, and Native American reservations will be eyeopening. The economy is horribly unfair to many people.",
                          "author": "Thomaswiththecru",
                          "created": 1609093855,
                          "upvotes": 1,
                          "replies": {
                            "gh7i9q3": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7i9q3/",
                              "text": "While wealth is obviously unevenly distributed in the US, I do not think uneven=unfair (it is not completely fair though, obviously). When I went to San Francisco, there were many homeless, same in some areas of LA and NYC. I am not saying this problems do not exist, I say that compared to the rest of the world, the financial aspect is clearly superior in the US. Pre-pandemic, the US had an unemployment rate of 3%. That is insane. \n\nI have family living in the US. They are considered low-income, literally LOW-INCOME, because they work as Uber drivers and waiters so they earn minimum wage. They have a beautiful apartment in San Diego, 2 cars, television, food, and they go on vacations every year. Here in Argentina, you can become a Doctor (minimum 7 years of college) and earn 4000 dollars a year and barely subsist. \n\nIn my opinion, although income inequality is a big issue in first world countries, the main difference with us is that most of the considered “poor” have a decent quality of life. Standards in America are obviously higher, but when thought worldwide, it is incredible. And that is why many people want to live there despite the many other social issues you have.",
                              "author": "TobiasAndelman",
                              "created": 1609095137,
                              "upvotes": 3,
                              "replies": {
                                "gh7jxsj": {
                                  "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7jxsj/",
                                  "text": "You will see far worse slums in the US than in Canada...\n\nGtg but a lot of the points you make are very good.",
                                  "author": "Thomaswiththecru",
                                  "created": 1609095980,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "gh782j5": {
                          "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh782j5/",
                          "text": "I’m not gonna put my viewpoints in this convo but\n\n-US economy is not “stable”. Definitely not as much as you think (although they try to present it as such)\n\n-you just triggered a bunch of people on the left\n\n-You fail to consider the price paid for this ultra capitalism\n\nAll three things are factual, but their interpretation can be subjective. Believe it or not, the US is no where near perfect",
                          "author": "Healthy-Nebula364",
                          "created": 1609089828,
                          "upvotes": 0,
                          "replies": {
                            "gh7c4pj": {
                              "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh7c4pj/",
                              "text": "I mean, the US has one of the most stable currencies in the world. Our recent economic crises with the housing market in 2008 and the coronavirus were either felt by the world (making them nonunique to the US) or pale in comparison to hyper inflation in places like Venezuela or certain African countries.",
                              "author": "pr_ch05",
                              "created": 1609091999,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gh8cvpt": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh8cvpt/",
      "text": "i don't even mind the fact that it is somewhat of a benchmark; it just results in all of these kids almost killing themselves to do things just for college. no one applies for an internship or writes a research paper simply because they want to, and simply because they gain from the experience itself; it's all for the long track result of getting into a top tier college. and honestly that's so sad to me; instead of encouraging kids to do excellent things so that we can learn and grow, we are fed that everything, at the end of the day, is nothing but another tick on our resume.",
      "author": "sskedat",
      "created": 1609110713,
      "upvotes": 0,
      "replies": {}
    },
    "gh80e2h": {
      "link": "/r/ApplyingToCollege/comments/kl48bz/why_do_colleges_expect_so_much/gh80e2h/",
      "text": "capitalism: like yea it would be more ethical to expect less and be more charitible to poorer kids/ kids with less opportunity, but it would be less profitable.\n\nsure havard *could* choose to do the ethical thing, but then stanford and yale wont, and use their higher profit margins to out compete havard and cut harvards profits even more",
      "author": "XVItea",
      "created": 1609104288,
      "upvotes": -1,
      "replies": {}
    }
  }
}