{
  "sid": "r3i1gc",
  "link": "/r/ApplyingToCollege/comments/r3i1gc/how_are_u_guys_narrowing_down_ed2_if_applicable/",
  "title:": "how are u guys narrowing down ED2? (if applicable)",
  "text": "so i am trying to figure out where i would like to do ED2 if, god forbid, my ED1 doesn't work out :(\n\ndepressing thought\n\nbut anyways-- i was wondering how those of you that may apply ED2 somewhere, are narrowing down your decisions? \n\ni am stuck between Emory and Wash U and tbh am having such a difficult time deciding between which one i would wanna throw my, slightly more accurate, dart at.",
  "author": "darkeefrostee",
  "created": 1638033406,
  "updated": 1638205589,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmaulno": {
      "link": "/r/ApplyingToCollege/comments/r3i1gc/how_are_u_guys_narrowing_down_ed2_if_applicable/hmaulno/",
      "text": "Personally, my advice is if you're stuck between the two, either they're both good choices you'll be happy with, or none of them are so don't ED. \n\nIf you're EDing for the sake of EDing, don't, you'll get in somewhere.\n\nIf you genuinely love both schools, flip a coin. Both are equally good if you're having such a tough time choosing, and if you find yourself reflipping the coin, well you know what you want now don't you?",
      "author": "Inevitable-Dog-9579",
      "created": 1638037562,
      "upvotes": 6,
      "replies": {
        "hmay68o": {
          "link": "/r/ApplyingToCollege/comments/r3i1gc/how_are_u_guys_narrowing_down_ed2_if_applicable/hmay68o/",
          "text": "i am definitely gonna be happy at both -- i think everyone who knows me well, including myself,  thinks that i would really thrive at either of these schools. thank u for the advice :) and good luck to urself with apps and decisions!",
          "author": "darkeefrostee",
          "created": 1638039069,
          "upvotes": 2,
          "replies": {
            "hmay9if": {
              "link": "/r/ApplyingToCollege/comments/r3i1gc/how_are_u_guys_narrowing_down_ed2_if_applicable/hmay9if/",
              "text": "No problem! Thanks and you too.",
              "author": "Inevitable-Dog-9579",
              "created": 1638039107,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}