{
  "sid": "qxtz9u",
  "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/",
  "title:": "Just had my Princeton interview",
  "text": "My interviewer was so nice and we got along super well. But at the end of the interview he said “you’ll do great wherever you end up going”…. I am now in a spiral and have convinced myself this means he thinks I’m a terrible fit for Princeton. I just need someone to give an opinion of if this is true or if it really doesn’t mean anything.\n\nEDIT: thank you for all the kind words, I got super nervous after the interview and hearing from everyone helped so much. Definitely a reminder to not give into the pressure and stress from app season! Stay strong y’all",
  "author": "bonniiieeeeeeee",
  "created": 1637369747,
  "updated": 1637688369,
  "over_18": false,
  "upvotes": 201,
  "upvote_ratio": 0.96,
  "comments": {
    "hlbz3ml": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlbz3ml/",
      "text": "I think you’re over analyzing the situation. It was most likely well intentioned",
      "author": "anonymous121356",
      "created": 1637371086,
      "upvotes": 154,
      "replies": {}
    },
    "hlc5qa9": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlc5qa9/",
      "text": "May be he said because his decision alone can't make or break it and he's not sure of the outcome?",
      "author": "indianmulan123",
      "created": 1637374191,
      "upvotes": 114,
      "replies": {
        "hlcc4w0": {
          "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcc4w0/",
          "text": "This. The interviewer has very little influence in the decision.",
          "author": "Calvin-Snoopy",
          "created": 1637377371,
          "upvotes": 58,
          "replies": {}
        },
        "hlcimmb": {
          "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcimmb/",
          "text": "This is true, thank you for the reality check lmao",
          "author": "bonniiieeeeeeee",
          "created": 1637380829,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "hlbwu7m": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlbwu7m/",
      "text": "Kinda scared because I’ve heard that during interviews too.",
      "author": "Rickyyfits",
      "created": 1637370060,
      "upvotes": 41,
      "replies": {
        "hlbx2a7": {
          "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlbx2a7/",
          "text": "AAHHH, it’s even more stressful because it’s an actual nice comment from someone clearly smart and well respected, but then is it also a backhanded compliment or not",
          "author": "bonniiieeeeeeee",
          "created": 1637370161,
          "upvotes": 21,
          "replies": {
            "hlbxbbw": {
              "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlbxbbw/",
              "text": "I’ve done 3 interviews so far: Georgetown, MIT, and UPenn(Wharton ED). All of them had some variation of that “you’ll do greater wherever”, but I feel as if I connected with all of them and had a good interview. Guess we have to wait until decisions come out",
              "author": "Rickyyfits",
              "created": 1637370274,
              "upvotes": 10,
              "replies": {
                "hlbxkye": {
                  "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlbxkye/",
                  "text": "That’s so exciting!!! The waiting is the worst part but I hope your decisions come back as acceptances!!",
                  "author": "bonniiieeeeeeee",
                  "created": 1637370396,
                  "upvotes": 5,
                  "replies": {
                    "hlbxo6d": {
                      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlbxo6d/",
                      "text": "Same for you!",
                      "author": "Rickyyfits",
                      "created": 1637370436,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlcfrc5": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcfrc5/",
      "text": "I have a friend who interviews at Stanford. He said some interviews he thinks “wow this kid is a shoe in” and then finds out they were rejected. Interview is only part of the decision.  Good luck and remember interviewers can’t make it seem like they are promising you anything/",
      "author": "shera11",
      "created": 1637379278,
      "upvotes": 30,
      "replies": {
        "hlcy7hp": {
          "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcy7hp/",
          "text": "I’m gutted when I see people I liked and thought had a decent chance but don’t gain acceptance. It’s an emotional letdown for interviewers, too.",
          "author": "skoldpadda9",
          "created": 1637390643,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hlchnze": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlchnze/",
      "text": "I'm an alumni interviewer for Penn and I say this to applicants I like. I want to acknowledge that they're an outstanding and qualified student that I genuinely think will thrive in any college, no matter if they go to Penn or elsewhere -- but I'm also aware that the acceptance rates are low and I don't want to get their hopes up by saying something misleading about their chances at Penn. \n\nThough maybe I'll stop saying it since it's a pretty nuanced statement and if said the wrong way  might cause people more stress...",
      "author": "shiinzou",
      "created": 1637380301,
      "upvotes": 27,
      "replies": {
        "hlcj480": {
          "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcj480/",
          "text": "I think this is definitely a kind thing to say and the only thing that makes it feel as though it isn’t, is when I or any other applicant, just get too stressed out in general! Thank you so much for the response :) I think I just need to trust myself and know that I feel as though the interview went well, and that’s probably because it actually did go well.",
          "author": "bonniiieeeeeeee",
          "created": 1637381103,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hlcy04y": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcy04y/",
      "text": "Stanford interviewer here. I say that to most people I interview. Generally just means the interviewer thinks well of you. We know acceptance rates are extremely low and I believe most people I interview will in fact do great no matter where they matriculate.",
      "author": "skoldpadda9",
      "created": 1637390490,
      "upvotes": 10,
      "replies": {}
    },
    "hlcx9xw": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcx9xw/",
      "text": "You could be the best interviewee he’s ever met, and he would still say that.  First of all, he can’t control whether you get in.  Some stellar candidates don’t get in—There just aren’t enough freshman spots to admit every great applicant.  If he is  not making a comment on chances, he’s not necessarily focused specifically on YOUR chances—he’s making a comment on all applicants’ chances.\n\nThe other reality is that if you’re a strong candidate for Princeton, then you’re a strong candidate at a lot of places. You could get accepted to Princeton and still end up enrolling somewhere else.  Even if you applied ED.  Things happen.  \n\nSo don’t read too much into it!",
      "author": "FeatofClay",
      "created": 1637389962,
      "upvotes": 7,
      "replies": {}
    },
    "hldaeq5": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hldaeq5/",
      "text": "True story …. My Princeton interview was by far my best.  He was a political correspondent and commentator for our local news channel.  It was right in the middle of a Presidential primary, and I was really into the whole process.  I was actually volunteering locally for a candidate.  My interviewer and I talked politics for what seemed like hours!  \n\nAfter the interview we walked out to into the parking garage together, and proceeded to our cars which were parked near each other.  His car was the biggest piece of shit I had ever seen.  I politely took my time getting ready to leave thinking I would let him exit the parking garage ahead of me. And as he tried to drive away …. his car wouldn’t start!  I pulled up next to him and asked if I could help, and he asked me for a ride home!  \n\nAfter I dropped him off, I proudly and confidently drove home extremely pleased that my interviewer’s misfortune was definitely my fortune.  Well …. I didn’t get in. \n\nMoral of the story, don’t read too much into how well or how badly you feel your interview went …. it probably won’t change the course of your fate either way.",
      "author": "ChancellorGH",
      "created": 1637400855,
      "upvotes": 5,
      "replies": {}
    },
    "hlbx4gl": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlbx4gl/",
      "text": "i doubt it was intentional",
      "author": "localramenconsumer",
      "created": 1637370189,
      "upvotes": 4,
      "replies": {}
    },
    "hlco990": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlco990/",
      "text": "For the most part, interviewers have zero control if you are accepted or not. It’s often more of a courtesy for the applicant and a way to keep alumni connected to the school. \n\nSo unless you show signs of violence or instability, or are just an asshole, assume that all is good and the interviewer will say all is good.",
      "author": "SpacerCat",
      "created": 1637384032,
      "upvotes": 4,
      "replies": {}
    },
    "hlcn9ry": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcn9ry/",
      "text": "they say that to everyone an interview has literally no impact on ur admission decision. they r j being nice",
      "author": "trackxdreams",
      "created": 1637383450,
      "upvotes": 3,
      "replies": {}
    },
    "hlc3ebb": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlc3ebb/",
      "text": "Dawg ngl same thing happened to me. We were vibing though and it seemed like it went pretty well — it honestly feels more like a compliment than anything else",
      "author": "WawnDixie",
      "created": 1637373076,
      "upvotes": 2,
      "replies": {}
    },
    "hlcpehk": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcpehk/",
      "text": "He probably is not the one to make the final decision so he doesn’t know one way or the other.",
      "author": "Thewholeboiledturkey",
      "created": 1637384725,
      "upvotes": 2,
      "replies": {}
    },
    "hlcqs9k": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcqs9k/",
      "text": "Whether you make it or not, it definitely isn't up to them. I think he really meant what he said, nothing more. But I can't exactly blame you for over analyzing it.",
      "author": "NarutoDragon732",
      "created": 1637385578,
      "upvotes": 2,
      "replies": {}
    },
    "hlctin1": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlctin1/",
      "text": "I had my princeton interview four days ago and it went amazing too <3  I think he just means it with good intention lol.  interview  have only slight effect on getting selected in college anyways",
      "author": "starish69",
      "created": 1637387325,
      "upvotes": 2,
      "replies": {}
    },
    "hlcyyfu": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlcyyfu/",
      "text": "What questions did he or she ask? I have mine In a couple of hours",
      "author": "Fun-Guitar-9112",
      "created": 1637391211,
      "upvotes": 2,
      "replies": {
        "hld7znt": {
          "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hld7znt/",
          "text": "They mainly focused on personal questions, and a few about Princeton too. It was much more casual than I was expecting and felt like a regular conversation! My tip would be to have strong and specific questions about the school and your potential time there, questions are at the end of your interview. Good luck and have fun with it! Clearly there’s no need to stress yourself so badly like I did lol",
          "author": "bonniiieeeeeeee",
          "created": 1637398697,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hldrg0x": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hldrg0x/",
      "text": "are you domestic or international?",
      "author": "dairydog1",
      "created": 1637414217,
      "upvotes": 2,
      "replies": {}
    },
    "hlfc5ab": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlfc5ab/",
      "text": "Interviewer for a T20 here - I’m sure it was meant to be a compliment!",
      "author": "MoniCoff1",
      "created": 1637439989,
      "upvotes": 2,
      "replies": {}
    },
    "hlg6i3r": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlg6i3r/",
      "text": "My rea interviewer told me to remember most people get deferred... we never really clicked😪 should I give up hoping now? 😁😁",
      "author": "Zealousideal_Crew255",
      "created": 1637453826,
      "upvotes": 2,
      "replies": {}
    },
    "hlgd0ss": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hlgd0ss/",
      "text": "I think that alumnus knows how bullshit ivies can be in rejecting people who fully deserve to go there, so he just wanted to complement you since you deserve it (but yk, anything can happen)",
      "author": "Klipxgate",
      "created": 1637456919,
      "upvotes": 2,
      "replies": {}
    },
    "hldll1m": {
      "link": "/r/ApplyingToCollege/comments/qxtz9u/just_had_my_princeton_interview/hldll1m/",
      "text": "I got the comment in a scholarship interview. Then I got in.",
      "author": "Classic_Strain8312",
      "created": 1637410218,
      "upvotes": 1,
      "replies": {}
    }
  }
}