{
  "sid": "q4tx9a",
  "link": "/r/ApplyingToCollege/comments/q4tx9a/in_what_order_should_i_list_my_ecs_and_should_i/",
  "title:": "In what order should I list my EC's? And should I even list those?",
  "text": "Hey, let me start off by saying that I am an international applicant and that EC's are a lot less \"supported\" here, in here high school is almost entirely academic. We do not have clubs, we do not have competitions, its pretty much just academics and exams.\n\nAnother point before I list my EC's is that I had to do a 32 months long mandatory military service post graduation.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nMy activities are as follows:\n\n* **Entrepreneurship teaching sort of organization (that also does charity work year round)**\n\ngrades 9 , 10 , 11.  3 Hours per week,  40 weeks per year.\n\n&#x200B;\n\n* **Volunteering with autistic children, teaching them about computers, computer programs and technology.**\n\ngrades 11, 12. 2 hours per week, 40 years per year.\n\n&#x200B;\n\n* **Math instructor / Tutor to 8th-9th graders, managed to improve their skills over summer break.**\n\ngrades 11 (during school break), 12 hours per week, 8 weeks per year.\n\n&#x200B;\n\n* **(considering not even adding this one idk) Work (Paid) as a salesman in footlocker.**\n\n6 months long (so far) post graduation.\n\n48 hours per week, 52 weeks per year.\n\n&#x200B;\n\n* **(not sure if it belongs here but here goes) My military service of 32 months, including my end-rank and the unit I was in.**\n\nPost graduate, all week long, all year long.\n\n&#x200B;\n\n* **Member of my city's Tennis club, played tennis as a hobby, no competitions or anything.**\n\ngrades 9-10, 3 hours per week, 52 weeks per year.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&#x200B;\n\nThat's it guys, would love to know what you guys think about the order I should list them as, and whether or not I should delete some of them. Thanks in advance!",
  "author": "snaiii",
  "created": 1633813174,
  "updated": 1634074080,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hg0ylvw": {
      "link": "/r/ApplyingToCollege/comments/q4tx9a/in_what_order_should_i_list_my_ecs_and_should_i/hg0ylvw/",
      "text": "I think these are all great. You should rank them in order of importance to you. What mattered the most? Which you enjoyed and engaged more in? Start from there.",
      "author": "Isa_Isabella",
      "created": 1633813741,
      "upvotes": 1,
      "replies": {
        "hg1dmfx": {
          "link": "/r/ApplyingToCollege/comments/q4tx9a/in_what_order_should_i_list_my_ecs_and_should_i/hg1dmfx/",
          "text": "Thank you so much ! I always felt so disadvantaged in this field, I saw the crazy lists of a lot of American applicants and was intimidated.\nWe never had any clubs to lead, or competitions to win, none of this was ever encouraged (it wasn’t disencouraged either but still). \nDo you really think these are enough (both in number and “prestige”) to compete for top schools?",
          "author": "snaiii",
          "created": 1633820719,
          "upvotes": 2,
          "replies": {
            "hg1e0p7": {
              "link": "/r/ApplyingToCollege/comments/q4tx9a/in_what_order_should_i_list_my_ecs_and_should_i/hg1e0p7/",
              "text": "I feel you. It’s more than okay. In my case, I did have a few ECs, but not as crazy as some people’s, since the curriculum is HARD. Like, we work in something called tech education, that’s basically a normal curriculum + 5 courses on a specific area. This 5 courses represent what you specialize on, for example, mine is marketing and commerce, this year I’m doing consumer taxes, information systems, interviews and polls & entrepreneurship. It’s not easy to maintain good grades and EC’s, but we got this!!! Just don’t compare yourself to ppl and all will be well",
              "author": "Isa_Isabella",
              "created": 1633820914,
              "upvotes": 1,
              "replies": {
                "hg1fjwu": {
                  "link": "/r/ApplyingToCollege/comments/q4tx9a/in_what_order_should_i_list_my_ecs_and_should_i/hg1fjwu/",
                  "text": "Damn you seem so impressive, I am sure you will ace those applications! I just hope my activities won’t hold me back and that they are enough for top schools",
                  "author": "snaiii",
                  "created": 1633821664,
                  "upvotes": 2,
                  "replies": {
                    "hg1ftvz": {
                      "link": "/r/ApplyingToCollege/comments/q4tx9a/in_what_order_should_i_list_my_ecs_and_should_i/hg1ftvz/",
                      "text": "Ty ty! I’m sure they won’t. Colleges look for good profiles, not “a” profile. I’m confident you’ve got this!!’ Good luck! Pm for any further questions or just good juju (good vibes hahahah) hugs to u friend",
                      "author": "Isa_Isabella",
                      "created": 1633821800,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "hg1g6n7": {
                      "link": "/r/ApplyingToCollege/comments/q4tx9a/in_what_order_should_i_list_my_ecs_and_should_i/hg1g6n7/",
                      "text": "I’m cleaning my room and looked up at my affirmation board and just thought “I gotta share this w u”, says: I am so much more than what I _see_ and _believe_. Golden light surrounds me and assured me: A greater purpose awaits me. ❤️❤️",
                      "author": "Isa_Isabella",
                      "created": 1633821970,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}