{
  "sid": "q6dhbz",
  "link": "/r/ApplyingToCollege/comments/q6dhbz/how_important_is_volunteering_hours_in_college/",
  "title:": "How important is volunteering hours in college apps?",
  "text": "Title",
  "author": "Right_Chemical_775",
  "created": 1634010851,
  "updated": 1634572792,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgbenb3": {
      "link": "/r/ApplyingToCollege/comments/q6dhbz/how_important_is_volunteering_hours_in_college/hgbenb3/",
      "text": "It’s about volunteering hours directed to a certain theme/cause, such as if you were going into medicine and was volunteering at a hospital or was going into animal science and volunteering at a dog shelter. Volunteering hours are more the after effect of having shown interest and passion towards a certain cause. Colleges also do like to see community service and leadership in general, but that can be done through various ways.",
      "author": "leaf1598",
      "created": 1634011867,
      "upvotes": 4,
      "replies": {}
    },
    "hgblmjn": {
      "link": "/r/ApplyingToCollege/comments/q6dhbz/how_important_is_volunteering_hours_in_college/hgblmjn/",
      "text": "It’s only important if it’s something you do that’s important to you.  If you just do it for college apps and you don’t really care about what you’re doing, then it’s not important at all. \n\nIf you’re committed to your community and making a change and helping others and it’s a way you enjoy spending your time and it’s meaningful to you, then it’s important",
      "author": "admissionsmom",
      "created": 1634016220,
      "upvotes": 3,
      "replies": {}
    },
    "hgbn18g": {
      "link": "/r/ApplyingToCollege/comments/q6dhbz/how_important_is_volunteering_hours_in_college/hgbn18g/",
      "text": "In general, not important. The hours themselves aren't important, but it's more about what you did exactly and how you accomplished it.",
      "author": "ivybrothers",
      "created": 1634017202,
      "upvotes": 2,
      "replies": {}
    },
    "hgezhd6": {
      "link": "/r/ApplyingToCollege/comments/q6dhbz/how_important_is_volunteering_hours_in_college/hgezhd6/",
      "text": "The Common Data Set includes a list of how a school considers volunteer/community service work. You might google \"common data set\" along with the name of the school and see how much weight they give that.",
      "author": "Calvin-Snoopy",
      "created": 1634080251,
      "upvotes": 1,
      "replies": {}
    }
  }
}