{
  "sid": "qngkxf",
  "link": "/r/ApplyingToCollege/comments/qngkxf/im_starting_to_research_for_college_help_me_lmao/",
  "title:": "Im starting to research for college hELP me lmao 🥱",
  "text": "Alright so, I'm a Junior in Highschool from New York City, and I'm starting to research colleges more now but I'm still not completely sure about everything.\n\nSo first up, I have a 3.6 GPA (I think?? My school uses %'s and I have an 89.4 or somewhere around that) My SAT score is admittedly kind of shit (980, but im not trying to stress out too much bc I haven't learned most of the math material yet so im confident I can be around the 1050 - 1100 with a retake) \n\nI'm aiming to either be a Computer Science Major, or Video Editing, and I'm mostly looking for schools in the New York City area, New Jersey, Pennsylvania, the Chicago Area, and Florida\n\nTemple, FIU, and UIC are some universities I'm considering, are these out of reach, are there any others I should consider?\n\nPlease don't suggest any schools that are extremely prestigious/expensive (plus ones that give better opportunities to hispanics would be nice but not necessary)",
  "author": "Emergency-Double-875",
  "created": 1636134607,
  "updated": 1636160749,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjg1zux": {
      "link": "/r/ApplyingToCollege/comments/qngkxf/im_starting_to_research_for_college_help_me_lmao/hjg1zux/",
      "text": "Okay, not sure any of these are exactly what you are looking for, but they might be good to look into: University of Illinois at Chicago, DePaul University (more expensive), University at Albany SUNY (more selective), Penn State York, Rutgers University - Newark, Rollins College, Penn State Schuylkill, St. Joseph's College - New York\n\nNot sure if these are any help, but good luck!",
      "author": "Blue_Jay89",
      "created": 1636136063,
      "upvotes": 3,
      "replies": {}
    },
    "hjh4ls5": {
      "link": "/r/ApplyingToCollege/comments/qngkxf/im_starting_to_research_for_college_help_me_lmao/hjh4ls5/",
      "text": "Can you just look at CUNY/SUNY schools that fit your scores and gpa? They’re pretty good, and I don’t think paying out of state tuition makes sends unless you are going to like Berkeley and are rich.",
      "author": "ProteinEngineer",
      "created": 1636150761,
      "upvotes": 1,
      "replies": {
        "hjh6gk5": {
          "link": "/r/ApplyingToCollege/comments/qngkxf/im_starting_to_research_for_college_help_me_lmao/hjh6gk5/",
          "text": "Yeah admittedly I kind of forgot about those schools, good thing you reminded me!\n\nI'm a bit hesitant though mainly because of personal life situations that might just have my family moving to a whole new state, so this is mostly just keeping myself safe incase a move does happen",
          "author": "Emergency-Double-875",
          "created": 1636151507,
          "upvotes": 1,
          "replies": {
            "hjh6ol5": {
              "link": "/r/ApplyingToCollege/comments/qngkxf/im_starting_to_research_for_college_help_me_lmao/hjh6ol5/",
              "text": "If you move to a new state, just apply to the in state schools in your new state. Out of state tuition is a terrible idea based on where you will apply, and many state schools are seriously underrated.",
              "author": "ProteinEngineer",
              "created": 1636151599,
              "upvotes": 1,
              "replies": {
                "hjh7o63": {
                  "link": "/r/ApplyingToCollege/comments/qngkxf/im_starting_to_research_for_college_help_me_lmao/hjh7o63/",
                  "text": "shit it's really that bad? alright good thing I know about it before I really started looking into colleges",
                  "author": "Emergency-Double-875",
                  "created": 1636151994,
                  "upvotes": 1,
                  "replies": {
                    "hjh80dr": {
                      "link": "/r/ApplyingToCollege/comments/qngkxf/im_starting_to_research_for_college_help_me_lmao/hjh80dr/",
                      "text": "Yeah out of state costs are awful. Check out the college board website.",
                      "author": "ProteinEngineer",
                      "created": 1636152130,
                      "upvotes": 1,
                      "replies": {
                        "hjh8ztr": {
                          "link": "/r/ApplyingToCollege/comments/qngkxf/im_starting_to_research_for_college_help_me_lmao/hjh8ztr/",
                          "text": "Yeahh the prices for some of these universities look crazy \n\nPart of me still feels drawn to going to another state  but I'm not spending 30 grand on that",
                          "author": "Emergency-Double-875",
                          "created": 1636152526,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}