{
  "sid": "qrqdiu",
  "link": "/r/ApplyingToCollege/comments/qrqdiu/why_do_people_keep_applying_to_and_attending/",
  "title:": "Why do people keep applying to and attending ultra-conservative Christian schools that actively discriminates against lgbtq+ people?",
  "text": "Today I was surfing the internet when I saw mention of Hope College, which is in Michigan, somewhere. Since I had never heard of them, I thought of checking their website out. Now, one of my foremost priority for applying to any school after the quality of academics and fin aid is the school's use of Title IX. Turns out Hope College, which is a Christian LAC, actively discriminates against the queer community, so much so that a few of them were punished severely for violating the school's policies or something. Baylor University, Pepperdine University, Brigham Young University, Liberty University, has consistently appeared in the list of worst colleges for lgbtq+ youth. (Fun fact, Hope College doesn't even make the 'Shame List' of Campus Pride). Aside from Liberty, I have seen many people from here applying to the other schools. I genuinely don't understand why, in spite of the regressive stances of these universities, people keep applying to these places?\n\nIs a quality education justification enough to enroll in schools which perpetuate queerphobia? Is God reason enough? If people can stop applying to Rice because of Texas's anti-abortion laws, why don't they keep the same energy to boycott queerphobic schools?\n\nI am not talking of schools like Georgetown or Notre Dame, which even though are religious, don't go on to exclude the lgbtq+ community. I am talking specifically of those ultra-conservative Christian schools, be they of any denomination, who make Christianity a part of their whole campus and curriculum. \n\nI have nothing against religion. I genuinely don't understand why they want to go these places. Maybe there's more to it than meets the eye? Although I have a hard time seeing the other side when it comes to basic human rights of anyone else.",
  "author": "Resident_Ad8455",
  "created": 1636651938,
  "updated": 1636654597,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk88s12": {
      "link": "/r/ApplyingToCollege/comments/qrqdiu/why_do_people_keep_applying_to_and_attending/hk88s12/",
      "text": "Many just don’t care about how colleges view lgbtq people, it doesn’t apply to them. I care most about the outcomes and cost. So if a school has amazing outcome numbers and a low cost of attendance I can overlook them not having the minority services because I don’t care about it as it is not something that I would use.",
      "author": "TritonTheCat",
      "created": 1636653432,
      "upvotes": 1,
      "replies": {
        "hk89jw0": {
          "link": "/r/ApplyingToCollege/comments/qrqdiu/why_do_people_keep_applying_to_and_attending/hk89jw0/",
          "text": "So you are not going to be bothered by something unless it affects you directly? Sorry but that's an incredibly selfish take.",
          "author": "Resident_Ad8455",
          "created": 1636653735,
          "upvotes": 1,
          "replies": {
            "hk89wiz": {
              "link": "/r/ApplyingToCollege/comments/qrqdiu/why_do_people_keep_applying_to_and_attending/hk89wiz/",
              "text": ">Sorry but that's an incredibly selfish take\n\nAnd that's surprising to you?",
              "author": "freeport_aidan",
              "created": 1636653872,
              "upvotes": 1,
              "replies": {
                "hk8a349": {
                  "link": "/r/ApplyingToCollege/comments/qrqdiu/why_do_people_keep_applying_to_and_attending/hk8a349/",
                  "text": "Actually, no.",
                  "author": "Resident_Ad8455",
                  "created": 1636653944,
                  "upvotes": 1,
                  "replies": {
                    "hk8ai0f": {
                      "link": "/r/ApplyingToCollege/comments/qrqdiu/why_do_people_keep_applying_to_and_attending/hk8ai0f/",
                      "text": ">Why do people keep applying to and attending ultra-conservative Christian schools that actively discriminates against lgbtq+ people?\n\nAnd as for a more direct response to your question, it's probably some combination of not knowing how bad things are (which astounds me, given how easy it is to do a google search, but definitly still happens), not caring (see above), not being able to afford anything else/it just being convenient, and because students (or their parents) are ultra-conservative Christians who are ok with discriminating against LGBTQ people",
                      "author": "freeport_aidan",
                      "created": 1636654108,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk89jkq": {
      "link": "/r/ApplyingToCollege/comments/qrqdiu/why_do_people_keep_applying_to_and_attending/hk89jkq/",
      "text": "Yeah. Like sometimes with colleges it could be the cheapest choice that could set them up for their future. Like if I was engineering I would rlly consider going to a conservative school like Texas A&M because its cheaper and has good opportunities",
      "author": "DotInformal7489",
      "created": 1636653731,
      "upvotes": 1,
      "replies": {
        "hk8a70i": {
          "link": "/r/ApplyingToCollege/comments/qrqdiu/why_do_people_keep_applying_to_and_attending/hk8a70i/",
          "text": "But if you attend schools like that, aren't you endorsing what the school's policies are in respect to minority issues?",
          "author": "Resident_Ad8455",
          "created": 1636653986,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}