{
  "sid": "qpkna0",
  "link": "/r/ApplyingToCollege/comments/qpkna0/nyu_abu_dhabi_yay_or_nay/",
  "title:": "NYU Abu Dhabi - yay or nay???",
  "text": "I just attended an NYU Abu Dhabi info session and umm, I'm in love??? I was applying to NYU with NYC as my first choice but I just changed that after the info session. What do you guys think about the school? I'm sold, but if there's any current student or alumni or fellow applicant that has something to say about the school, I'm interested in any and all information - Positive and Negative - especially regarding financial aid (cuz we broke af over here :) !!!",
  "author": "radar005",
  "created": 1636398388,
  "updated": 1636653596,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hjub9yb": {
      "link": "/r/ApplyingToCollege/comments/qpkna0/nyu_abu_dhabi_yay_or_nay/hjub9yb/",
      "text": "Yes nyuad is beautiful! It's worth it: D",
      "author": "roshil_kevin_j",
      "created": 1636400367,
      "upvotes": 7,
      "replies": {}
    },
    "hjuctxt": {
      "link": "/r/ApplyingToCollege/comments/qpkna0/nyu_abu_dhabi_yay_or_nay/hjuctxt/",
      "text": "Supposedly NYU AD gives generous fin aid (and has full scholarships) but I don’t know any hard facts about that so it may be for you to research that on your own. I would assume it is credible to believe so since the UAE is in collaboration with NYU and insane amounts of money is being poured into the school. I’m in a class with an NYU AD student who is on a semester abroad in NYC and he said he really loves NYU AD and has found plenty of solid research opportunities despite being an underclassmen and there being few graduate students in AD. NYU AD is a fairly small school (almost like a LAC class size) so you would have all that NYU can offer with a more sensibly sized community.",
      "author": "randonnnns",
      "created": 1636400994,
      "upvotes": 3,
      "replies": {}
    },
    "hjv5w4y": {
      "link": "/r/ApplyingToCollege/comments/qpkna0/nyu_abu_dhabi_yay_or_nay/hjv5w4y/",
      "text": "2 things, one good and one bad. NYU Abu Dhabi has one of the lowest acceptance rates in the world, lower than the ivies. BUT they also have really good fin. aid packages as they are need blind.",
      "author": "South_Extension69",
      "created": 1636412790,
      "upvotes": 3,
      "replies": {}
    }
  }
}