{
  "sid": "qjb558",
  "link": "/r/ApplyingToCollege/comments/qjb558/apply_as_international_vs_not/",
  "title:": "Apply as International vs Not",
  "text": "I'm a high school senior currently applying for college. I'm not a US citizen nor a permanent resident, however, I have been in Texas since 8th grade and have been in a public high school since the second semester of my freshman year. I'm expecting a green card, next year, because of the USCIS issues, I couldn't get it sooner. Does applying as an international have any detriment to my acceptance chance? Hypothetically speaking, if I do not apply as international, and I don't get the permanent resident status by next year what will happen?",
  "author": "DamienLin0228",
  "created": 1635629643,
  "updated": 1635778605,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hip0bic": {
      "link": "/r/ApplyingToCollege/comments/qjb558/apply_as_international_vs_not/hip0bic/",
      "text": "If you're not a PR and you start your college classes without an updates I-20 and F-1 visa, it could affect your status in the US and prevent you from obtaining your residency here. It's better to apply as an international student and change it later when you're PR gets approved.",
      "author": "templeufrank",
      "created": 1635631050,
      "upvotes": 1,
      "replies": {
        "hipb03q": {
          "link": "/r/ApplyingToCollege/comments/qjb558/apply_as_international_vs_not/hipb03q/",
          "text": "Thank you, I did apply as int’ so far to the five colleges",
          "author": "DamienLin0228",
          "created": 1635636203,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hip0g09": {
      "link": "/r/ApplyingToCollege/comments/qjb558/apply_as_international_vs_not/hip0g09/",
      "text": "You don't have a choice to apply as an international or not. There is no box that says, \"Check here if international.\"\n\nYou will be considered an international Alicante, and yes, that puts you at a disadvantage. If you get your green card before decisions are made, update the college.",
      "author": "skieurope12",
      "created": 1635631109,
      "upvotes": 1,
      "replies": {
        "hipavf0": {
          "link": "/r/ApplyingToCollege/comments/qjb558/apply_as_international_vs_not/hipavf0/",
          "text": "It’s unlikely that I will receive my green card before my decisions",
          "author": "DamienLin0228",
          "created": 1635636140,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}