{
  "sid": "qord4j",
  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/",
  "title:": "Glorification of CS",
  "text": "I’m a current junior at a well-known university, studying a non-CS STEM field. I’ve noticed at my institution (and on A2C) that there’s a glorification of CS that goes something like this:\n\n• CS provides the best career opportunities because of its exits into FAANG and quantitative finance, or even its ability to make students look “more intelligent” than other job applicants regardless of their intended field\n\n• CS is the most challenging major, barring a few niche exceptions centered around math and physics \n\n• Hence, everyone is who majors in CS is exceptionally brilliant and ambitious, and the only valid reason to *not* major in CS is an inability to succeed in such a demanding field \n\nI’ve also noticed a bizarre stereotype of CS majors being the “genius nerd” type, though IRL it’s probably among the most fratty non-business majors. It is a very self-congratulatory culture as well.\n\nThe (intuitive) truth is that students in finance, consulting, and law experience just as much economic success as engineers at FAANG, there are plenty of brilliant students who pour into academia, medicine, engineering, and the public sector, and elite students have a greater diversity of interests than these forums would suggest. \n\nSure, for those who enjoy coding and find the theory of computer science genuinely engaging, CS is an excellent choice that will open many doors. But if it is not your true passion, there are *many* other ways to earn just as much in (IMO) more multifaceted roles. \n\nIf you’re one of the many pre-CS applicants here, think about why CS is your goal. If you love it, you’re in it for the right reasons. If you see it primarily as a lucrative IQ flex, do some research on law, finance, engineering, consulting, or medicine before being misled by this glorification.",
  "author": "Ekejejj",
  "created": 1636300701,
  "updated": 1636653970,
  "over_18": false,
  "upvotes": 251,
  "upvote_ratio": 0.95,
  "comments": {
    "hjp2mlp": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp2mlp/",
      "text": "It is not the hardest major for everyone. I took history classes and it was much harder for me than CS or Maths. It depends on the person.",
      "author": "tynecogyrec",
      "created": 1636305701,
      "upvotes": 91,
      "replies": {
        "hjqm0zb": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqm0zb/",
          "text": "Meanwhile, History is as easy for me as breathing, but I was on the struggle bus all the way through intro computer science and Calc BC kicked my butt.",
          "author": "exhausted-caprid",
          "created": 1636327986,
          "upvotes": 22,
          "replies": {}
        }
      }
    },
    "hjpp3yt": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpp3yt/",
      "text": "There is a glorification, but it’s mainly about the money. \n\nSure you can make a lot of money in medicine, law, and other fields. But typically you have to work for years. \n\nA dude at my old college heard I was *interested* in Data Science and offered me an 80K internship. I don’t know anything about Data Science and told him as much, so he said when I graduate, I’m welcome to come name drop him for a 140K entry salary (or more if I have desirable skills). \n\nFew jobs give you the chance* to make that kind of money so soon during school or after graduating. \n\nA lot make anywhere from 70K-120K entry salary. \n\n*this is if you’re a competitive applicant in your desired field. For example, look up Data Science skills. That’s Python, R, SAS, SQL, Pandas, Jupyter Notebook, data manipulation, data cleaning, etc.\n\nETA: a lot of people like money. A lot of people need money. I chose CS because I like it and I find it fun. But I also chose it because my family is in debt (20K) and my parents have no retirement fund. If I live with them, I’ll be able to help them financially. I’ll be able to get them a retirement fund, kill their debt, and get them out of this house that’s falling apart.",
      "author": "Outherepoor",
      "created": 1636314509,
      "upvotes": 55,
      "replies": {
        "hjqd4sx": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqd4sx/",
          "text": "Good luck good luck. I wish that you will get into to the college you want. I’ll be rooting for you that’s for sure even if I don’t know you",
          "author": "RAtararatara",
          "created": 1636324130,
          "upvotes": 13,
          "replies": {
            "hjqdfqf": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqdfqf/",
              "text": "I’m rooting for you too! Thank you for the good wishes!",
              "author": "Outherepoor",
              "created": 1636324258,
              "upvotes": 3,
              "replies": {
                "hjqdkcn": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqdkcn/",
                  "text": "Np np \nYour motivation seems sincere to me so yeah it’s pretty valuable I guess \nOne more time good luck",
                  "author": "RAtararatara",
                  "created": 1636324313,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjoxkta": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjoxkta/",
      "text": "There is a weird glorification of CS. Lots of people do it for the money (including myself). It doesn't make you smart and most people end up doing a basic office job.\n\nOn the other hand, none of the careers you mentioned come close to the # of opportunities available and financial reward as the software industry... at least for now.\n\n* Law: Direct and indirect costs of grad school & bar prep. Bimodal pay structure upon graduation. Inconsistent demand. Opportunities often locked by the school you graduated from.\n\n* Finance & Consulting: At the entry to mid level, high finance requires very long hours so you're really making minimum wage. May require extensive travel. Companies are built like a pyramid with *less* demand for people at higher levels. It works out because a lot of entry to mid levels burn out and switch to other fields or companies. Opportunities often locked by the school you graduated from. Lower level finance like financial analysis does not have the demand or compensation available in software.\n\n* Engineering: varies by field, but most engineering fields do not come close to software. The companies they work for are low margin and often grant or project based. Software is high margin so software can afford to spend more on salaries.\n\nEdit: also you're not a junior in college.",
      "author": "dobbysreward",
      "created": 1636303712,
      "upvotes": 59,
      "replies": {
        "hjqf84l": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqf84l/",
          "text": "If your parents pay for med school, and you live in a LCOL area, it is probably a better financial choice than most other careers. However, you also can't really do medicine for the money.",
          "author": "CaterpillarTrue",
          "created": 1636325025,
          "upvotes": 3,
          "replies": {
            "hjqzfin": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqzfin/",
              "text": "It usually isn't. Even with 0 loans, it's a minimum of 7 years opportunity cost (4 years school + 3 years of not making enough money to save any). The best way to make money is to have money already and invest it.\n\nThis past year as a software engineer, living in a HCOL area, I've saved 40k. Say I save the same amount for the next 3 years, even though I'll get promotions and paid more. YTD the S&P 500 is up 27%, but say I only get an 8% return.\n\nThat's about 200k in 3 years, and 375k in 6 years by the time the doctor graduates residency.\n\nSay the doctor now makes 180k. At this point my salary as a software engineer will probably be over 250k. But say they manage to save 80k/year and I'm still saving 40k.\n\n4 years after the doctor graduates, I have about 690k saved and the doctor has 360k. 8 years after, I have about 1.2 mil and the doctor has 850k. \n\nAgain all of this assumes that I never save more than I while working my entry level job & the doctor is saving 2x as much.",
              "author": "dobbysreward",
              "created": 1636334100,
              "upvotes": 5,
              "replies": {
                "hjrbu9l": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrbu9l/",
                  "text": "I mean 180k is a ridiculously low salary for a doctor, especially if you live in a LCOL, as doctors make quite a bit more in LCOL areas. Although, 250k is also pretty little for a CS person.",
                  "author": "CaterpillarTrue",
                  "created": 1636339973,
                  "upvotes": 3,
                  "replies": {
                    "hjrcr85": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrcr85/",
                      "text": "[It's about what Mint](https://mint.intuit.com/salary/physician) estimates based on TurboTax returns, but the point is that even if they're saving twice as much it's hard to catch up to someone who started saving out of college.",
                      "author": "dobbysreward",
                      "created": 1636340433,
                      "upvotes": 4,
                      "replies": {
                        "hjre2q6": {
                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjre2q6/",
                          "text": "Yeah, but at some point (around mid 50's), the physician would likely catch up due to the fact that they can work for longer. Additionally, I am unsure about this, but the actual \"QOL\" (bigger house, richer compared to people living near you), would be easier for a physician living in a LCOL area correct?",
                          "author": "CaterpillarTrue",
                          "created": 1636341083,
                          "upvotes": 1,
                          "replies": {
                            "hjrkm0s": {
                              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrkm0s/",
                              "text": "They might be able to catch up if by that you mean work overtime to pull in more money to add to savings. But it would require a lot of work. It's hard to beat compound interest. \n\n> Additionally, I am unsure about this, but the actual \"QOL\" (bigger house, richer compared to people living near you), would be easier for a physician living in a LCOL area correct?\n\nHard to say. Atlanta, Memphis or Baltimore for example are considered LCOL but has a lot of demand for tech and pays a lot. \n\nFor really rural areas, still hard to say since a lot of office jobs including software engineering can be done full remote. But there's way more demand for physicians in rural areas. However, most people consider these areas inherently bad QOL since they're far away from everything including good schools for your kids, which is why they have to pay a lot to get professionals to move there and work there.",
                              "author": "dobbysreward",
                              "created": 1636344430,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hjpgmcg": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpgmcg/",
          "text": "Me who doesn't only care about money ✌️",
          "author": "HahaStoleUrName",
          "created": 1636311212,
          "upvotes": -3,
          "replies": {
            "hjpijce": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpijce/",
              "text": "I don't care about money exactly. I care about money giving me the freedom to do whatever I want like take spontaneous trips, pay for my friends and family, support important nonprofits, or the financial stability to quit working for a couple years to volunteer or parent my kids or whatever else I want.",
              "author": "dobbysreward",
              "created": 1636311943,
              "upvotes": 11,
              "replies": {
                "hjpsvyu": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpsvyu/",
                  "text": "Same! I have a list of things I wanna do! \n\nIt’s ugly that money is freedom, but I don’t see things changing in the near future, so I’ll do what I can to give myself and my family freedom.",
                  "author": "Outherepoor",
                  "created": 1636315972,
                  "upvotes": 5,
                  "replies": {}
                },
                "hjqc0ow": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqc0ow/",
                  "text": "Same, that's why I said \"only\"\n\nReread it",
                  "author": "HahaStoleUrName",
                  "created": 1636323651,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            },
            "hjqbcsp": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqbcsp/",
              "text": "you don't care about money until you run out; in other words it's better to have enough than not at all",
              "author": "edgymemesalt",
              "created": 1636323367,
              "upvotes": 1,
              "replies": {
                "hjqbw50": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqbw50/",
                  "text": "Thats why I said \"only\"",
                  "author": "HahaStoleUrName",
                  "created": 1636323597,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            }
          }
        },
        "hjq8ecq": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjq8ecq/",
          "text": "Low margin doesn't mean low profits.\n\nHow many people need microwave plates? I can make .30 for this object. At 400 million objects (a conservative estimate considering that there are far more microwaves on the planet), you make 120M. You need to hire industrial engineers, materials engineers, chemical engineers, and mechanical engineers.\n\nHow many people/businesses need complex pumpjack monitoring software (I know someone who does this)? I can make 2k per pump for this service, at 10k services, you make 20M.\n\nYou're dead wrong if you think that engineers don't make enough money. There's been a supply crunch of mechanical engineers for a while now, with an estimated need of \\~30-70k jobs constantly. I can afford to shop around for a while and let the prices go up. It's the same across all engineering fields. Many CS fields aren't in a supply crunch. Just how many video game coders or website designers do you need? There is no bad field of engineering (except for civil lol but even they make 60k a year), whereas there are several for CS.",
          "author": "BoomTexan",
          "created": 1636322132,
          "upvotes": 1,
          "replies": {
            "hjq92g8": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjq92g8/",
              "text": "> You're dead wrong if you think that engineers don't make enough money.\n\nI didn't say they don't make enough money or that they aren't necessary. They don't make as *much* money as software engineers, with some exceptions by field or employer.\n\nMost careers make \"enough\" money and are necessary, or else they wouldn't exist as careers.\n\n> Many CS fields aren't in a supply crunch. Just how many video game coders or website designers do you need?\n\nCS fields are far more interchangeable. If you know how to code for video games you can just as easily code for Google Maps. And I know it was a rhetorical question, but you need a lot when you're thinking about virtual reality/metaverses.",
              "author": "dobbysreward",
              "created": 1636322412,
              "upvotes": 5,
              "replies": {
                "hjqwpt0": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqwpt0/",
                  "text": "I'm talking out my butt when it's about computer science. I took 2 C++ classes, hated every second of them, and really don't see any use for much of the work that computer programmers do, especially with regards to big data and social media.",
                  "author": "BoomTexan",
                  "created": 1636332802,
                  "upvotes": -1,
                  "replies": {
                    "hjqxcay": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqxcay/",
                      "text": "Yeah engineers should get paid more because they often are more important. It's an unfortunate economic outcome that people at Facebook get paid more than people designing bridges. Same with biologists. Biologists should be getting way more money.",
                      "author": "dobbysreward",
                      "created": 1636333102,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hjrbnrf": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrbnrf/",
              "text": "What's wrong with civil lol",
              "author": "galavantingcarrot6",
              "created": 1636339884,
              "upvotes": 2,
              "replies": {
                "hjta7hb": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjta7hb/",
                  "text": "It's just a joke lol. \n\nMost engineers take more classes and need a broader scope of knowledge compared to civil. \n\nCivil engineers only (really) need Physics I, Statics, Thermodynamics, and Materials Science, along with the prerequisites. They also make significantly less.",
                  "author": "BoomTexan",
                  "created": 1636385455,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hjp38im": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp38im/",
          "text": "exactly, no other major even compares to the money you can make in CS. in what field other than quant finance can you start at 400K/year straight out of undergrad, with relatively normal working hours (e.g. 50-60 hour weeks)?",
          "author": "MasterYiMain1",
          "created": 1636305941,
          "upvotes": -14,
          "replies": {
            "hjpixem": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpixem/",
              "text": "Lol, I wish...\n\nWhile there are a ton of CS jobs out there, most don't pay very well, especially at the entry level. \n\nIf you are being told that there is *any* field you can start out at $400k in, you are simply being lied to, blatantly.\n\nI know a lot of people with CS degrees from a variety of universities who have now been in the field for several years (some for nearly a decade now), none makes more than $100k/year (the one who makes that much has 9 years of experience as a project manager for software development at the largest healthcare firm in the world).\n\nWith a MS in CS you *might* be able to expect $90k/yr entering.\n\nI know one person in quant finance (trust me, they are rare af jobs to come across), and while they do make that much, they had to get an MS in a related field prior to even being considered for the job. That and they work in NYC, so that $400k doesn't go as far as you may think. This is the same at most large companies, as they are located in some of the most expensive places to live in the world.",
              "author": "the_Q_spice",
              "created": 1636312091,
              "upvotes": 13,
              "replies": {
                "hjptpmv": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjptpmv/",
                  "text": "??? CS pays extremely well. one quick google search shows that the starting salary for graduates with a masters degree in cs or information sciences is 99k. and thats just average, plenty make way more. and the average mid career salary for cs undergraduates is 114k, and going to a decent school will increase that by a ton",
                  "author": "cxsmiq",
                  "created": 1636316300,
                  "upvotes": -3,
                  "replies": {
                    "hjpwfaf": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpwfaf/",
                      "text": "CS is a little bimodal. The well known companies like Google, Adobe, etc will all pay very well. The majority of companies though, like Macy's, VSP insurance, other random companies that you probably aren't thinking about, pay well but not amazing at least in comparison to cost of living.\n\nSo you end up with a lot of very high earners with flashy salaries and lower earners who are topping out at lower salaries. That skews the average.\n\nEventually the industry will probably be more standardized as remote work becomes more popular and you'll see more stabilization around 70-90k for entry level.",
                      "author": "dobbysreward",
                      "created": 1636317357,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                },
                "hjpnglt": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpnglt/",
                  "text": "If your friends aren't making more than 100k with over 5 years experience, they need to be looking right now. I assume you're in a low cost area without a lot of competitively paying companies, but a lot of companies are now hiring permanent remote from anywhere in the US.\n\n> project manager for software development at the largest healthcare firm in the world\n\nTPM usually pays less than software development, but healthcare is also a low-margin industry. He should switch to software.",
                  "author": "dobbysreward",
                  "created": 1636313851,
                  "upvotes": -2,
                  "replies": {
                    "hjpoyi5": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpoyi5/",
                      "text": "You didn't read a word I said...\n\nMy friends who just entered the field, some of whom have been working for *up to* 9 years (only one). As for that friend, you literally ignored the fact that he *is* in software... *in the same sentence you quoted*. As for for the company having low margins; obviously you have somehow never heard of Epic Healthcare, despite claiming to be in the field...\n\nThe bottom 25% of wages for quant finance in the US (which is what you can expect as an entry wage for around the first 5-7 years of your career (with marginal bonuses, and yearly raises)) is $75k/year. It is nowhere remotely near $400k. Again, I will reiterate; anyone telling you such is telling you a fairytale that simply does not exist.\n\nSeriously, don't say stuff you have no experience with. Unless you actually know people who can corroborate these claims, or have the experience yourself, you don't actually know.",
                      "author": "the_Q_spice",
                      "created": 1636314447,
                      "upvotes": 3,
                      "replies": {
                        "hjpso9u": {
                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpso9u/",
                          "text": "> Unless you actually know people who can corroborate these claims, or have the experience yourself, you don't actually know.\n\nI have the experience myself. I'm currently working as a SWE at a Big N, interned in finance but chose not to pursue, but as a Berkeley CS grad I know a lot of people who did pursue it.\n \nMost people would describe Epic Healthcare as a SaaS company, not a healthcare company (ie Kaiser Permanente). \n\nEpic in fact pays their entry level software engineers [100-110k base](https://www.levels.fyi/company/Epic-Systems/salaries/Software-Engineer/Software-Developer/), even in Wisconsin with total comp approaching 120-130k. Senior developers are obviously much higher.\n\n> My friends who just entered the field, some of whom have been working for up to 9 years (only one).\n\nI was confused by your wording. \n\nYou have a bunch of entry level friends who are not making 100k, which is reasonable in a low cost area. However, if they tried for remote companies, they could be making that if they have some internship experience and are good programmers.\n\nAnd then you have 1 friend who works as a Project Manager, which is a lower paying career. However, even he's getting underpaid. He makes less than entry level software engineers at Epic.",
                          "author": "dobbysreward",
                          "created": 1636315885,
                          "upvotes": -1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hjp7hez": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp7hez/",
              "text": "if you think you are working normal hours at CS right out of school making $400k, I am sorry to say that you are terribly mis-informed.  Try 996.  9am to 9pm 6 days a week and getting $80-90k which is still high for any undergraduate right out of school.",
              "author": "jojothebigcat",
              "created": 1636307652,
              "upvotes": 26,
              "replies": {
                "hjpc1mi": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpc1mi/",
                  "text": "lmao no, you are deluded if you think people in CS make that little while working such long hours. 200K/year with 40-50 hour work weeks is pretty standard for big tech/unicorns",
                  "author": "MasterYiMain1",
                  "created": 1636309436,
                  "upvotes": -22,
                  "replies": {
                    "hjpeiks": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpeiks/",
                      "text": "Argues the HS Junior",
                      "author": "emanresuuuuuuuuuuuuu",
                      "created": 1636310391,
                      "upvotes": 26,
                      "replies": {
                        "hjph7gu": {
                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjph7gu/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1636311434,
                          "upvotes": -4,
                          "replies": {
                            "hjpi22e": {
                              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpi22e/",
                              "text": "It is simply ignorant to purport that one without experience may speak for the experience itself—birds do not whistle like whales.",
                              "author": "emanresuuuuuuuuuuuuu",
                              "created": 1636311762,
                              "upvotes": 1,
                              "replies": {
                                "hjpiedr": {
                                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpiedr/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1636311892,
                                  "upvotes": -3,
                                  "replies": {
                                    "hjpr0nu": {
                                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpr0nu/",
                                      "text": "Anyone can learn anything in the future, yes; but having no experience is not a good appeal to ethos, no?",
                                      "author": "emanresuuuuuuuuuuuuu",
                                      "created": 1636315246,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                },
                                "hjpjegd": {
                                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpjegd/",
                                  "text": "lmao you're a senior yourself stfu. you do realize that I know multiple people who work in big tech/quant and I'm going off of what they say? And that you can do research about these careers online?",
                                  "author": "MasterYiMain1",
                                  "created": 1636312271,
                                  "upvotes": -2,
                                  "replies": {
                                    "hjppui5": {
                                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjppui5/",
                                      "text": "Sonny, I never argued anything. I simply stated that you did not have experience, which is the truth.",
                                      "author": "emanresuuuuuuuuuuuuu",
                                      "created": 1636314796,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hjpfil1": {
                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpfil1/",
                          "text": "To another person in high school. I'm pretty sure 996 is mainly a  thing in Asia?",
                          "author": "remembertherats",
                          "created": 1636310784,
                          "upvotes": -5,
                          "replies": {
                            "hjpj3sp": {
                              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpj3sp/",
                              "text": "yes. in America only lawyers and investment bankers work that much",
                              "author": "MasterYiMain1",
                              "created": 1636312159,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "hjpq7dl": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpq7dl/",
                      "text": "Where is the average person making 200k out of undergrad? The average is literally around 70-80k out of undergrad and 107k mid-career. 200+k is for outliers. Like yes, some engineers are paid a million dollars annually but that does not change that the average is around 107k.",
                      "author": "DemonicBarbequee",
                      "created": 1636314939,
                      "upvotes": 3,
                      "replies": {
                        "hjps3fm": {
                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjps3fm/",
                          "text": "I never claimed the average person is making 200k out of undergrad, you're putting words into my mouth. By \"standard pay\" I mean if you go to a top school and do well, you should reasonably expect to make that much. In no way is that anywhere close to average.",
                          "author": "MasterYiMain1",
                          "created": 1636315655,
                          "upvotes": -1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hjp4u9m": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp4u9m/",
              "text": "What job pays 400k annually right after undergrad??",
              "author": "AnApexPlayer",
              "created": 1636306581,
              "upvotes": 12,
              "replies": {
                "hjp661z": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp661z/",
                  "text": "Quant finance but that's really really unlikely. Most of those positions go to PhDs not undergrads. \n\nUndergrads can see 300k... but that's still the top 1%.\n\n100k-200k is more normal and still beats most other fields.",
                  "author": "dobbysreward",
                  "created": 1636307115,
                  "upvotes": 7,
                  "replies": {
                    "hjpc8l0": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpc8l0/",
                      "text": "Bruh no one at a top tier firm (e.g. citadel, jane street, two sigma, etc) makes 100-200K/year as a quant trader, even FAANG pays more than that. And PhDs tend to be quant researchers not traders, there are a lot of traders who only have an undergrad. and 300K is pretty standard pay for undergrads lol",
                      "author": "MasterYiMain1",
                      "created": 1636309511,
                      "upvotes": -1,
                      "replies": {
                        "hjpfheg": {
                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpfheg/",
                          "text": "Yeah I'm talking about expected salary out of undergrad for high performers.\n\nVery few undergrads get hired to quant firms as traders/researchers. Talking about them is like pursuing football assuming you're becoming an NFL quarterback. They exist, but the number of opportunities is so small that it's negligible. \n\nThere's a lot of overlap between quant research and quant trading. At some institutions there's only one role. At most, traders are more focused on real-time application but also do a significant amount of research. The role can even vary team to team depending on asset and how systemically-driven it is.\n\nBut both trading and research, even when separate, is dominated by graduate students. Most undergrads get hired to those kinds of firms as developers, not traders or researchers. Quant still pays every hire well, but 400k out of undergrad is an extreme extreme outlier.",
                          "author": "dobbysreward",
                          "created": 1636310771,
                          "upvotes": 5,
                          "replies": {
                            "hjrleah": {
                              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrleah/",
                              "text": "Are you sure that its *that* difficult to break into quant trading straight out of undergrad? I think you are overexaggerating a bit. personally I've talked to multiple people who were decent but not exceptional in high school (e.g. near-perfect GPA and SAT, made USAMO a few times but not MOP, had some cookie-cutter ECs), went to a decent but not top-tier school (think CMU, UIUC or Yale), and still become a trader at a semi-prestigious firm straight out of undergrad.",
                              "author": "MasterYiMain1",
                              "created": 1636344856,
                              "upvotes": 1,
                              "replies": {
                                "hjsv1dn": {
                                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjsv1dn/",
                                  "text": "Yeah it's that difficult. You're underestimating how strong the credentials you mentioned are. \n\nUIUC & CMU are some of the most-recruited schools for hedge funds since 98% of them have their primary or secondary HQ in Chicago and have strong ties to CMU & UIUC. For HFs/Props these schools are equal to MIT & Harvard.\n\nI believe someone with those qualifications could become a trader out of UG. However, even then they might have gotten hired as a developer instead of a real trader, even if their title is quant analyst or quant trader or something along those lines. The actual job responsibilities of a \"trader\" vary from firm to firm.",
                                  "author": "dobbysreward",
                                  "created": 1636378415,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "hjpfr91": {
                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpfr91/",
                          "text": "Glassdoor says 112k a year is the total average for all years and all companies. Top tier salaries obviously require years of experience, so 300k a year out of undergrad seems like cap. I’m sure it’s possible if your dad runs the company, but that’s possible in any field. Even at top firms like Citadel, average is 150k total for quants, which is lower than the average Citadel salary of 191k([glassdoor](https://www.glassdoor.com/Salary/Citadel-Quantitative-Trader-Salaries-E14937_D_KO8,27.htm)).",
                          "author": "MLGSwaglord1738",
                          "created": 1636310876,
                          "upvotes": 3,
                          "replies": {
                            "hjpjotz": {
                              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpjotz/",
                              "text": "Glassdoor isn't good at reporting total compensation so it's bad for the tech/finance industry where a lot of money is in signing, expected bonuses, performance bonuses and stock options which can add up to more than 2x the base salary. \n\nThe numbers you see on glassdoor are usually just base salary. 150k is a reasonable base salary for Citadel. \n\nLevels.fyi is better for tech companies. If you look up Citadel the average is about 250k for new grad software engineers. I don't see traders/researchers listed on the first page but they're paid more when they're hired (which is really rare).",
                              "author": "dobbysreward",
                              "created": 1636312383,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "hjpiqdh": {
                              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpiqdh/",
                              "text": "glassdoor is stupid, I don't care for what it has to say. I personally know multiple people who went into quant trading straight out of undergrad and make that much",
                              "author": "MasterYiMain1",
                              "created": 1636312016,
                              "upvotes": 2,
                              "replies": {
                                "hjpkxeg": {
                                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpkxeg/",
                                  "text": "Cool, got a better source than glassdoor or a personal anecdote?\n\nZiprecruiter says 175k, and average is 200k ish in the Bay Area. Of course, these are total averages.\n\nInvestopedia mainly talks about the strings attached. You can earn 500k with bonuses etc, but that takes a bit of experience and skill.",
                                  "author": "MLGSwaglord1738",
                                  "created": 1636312863,
                                  "upvotes": 1,
                                  "replies": {
                                    "hjqud5s": {
                                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqud5s/",
                                      "text": "levels.fyi",
                                      "author": "sheikheddy",
                                      "created": 1636331705,
                                      "upvotes": 1,
                                      "replies": {
                                        "hjqwzrt": {
                                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqwzrt/",
                                          "text": "Damn that’s good shit. Never knew a career in HR paid so well lmao.",
                                          "author": "MLGSwaglord1738",
                                          "created": 1636332933,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hjp6pfx": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp6pfx/",
                  "text": "quant trading",
                  "author": "MasterYiMain1",
                  "created": 1636307338,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjp4mod": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp4mod/",
      "text": "to be fair CS is way more accessible than finance. someone with a degree from uci can grind and get into FAANG but its literally impossible to break into IB from it",
      "author": "hahalolxddddd",
      "created": 1636306499,
      "upvotes": 31,
      "replies": {}
    },
    "hjphyf9": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjphyf9/",
      "text": "Agree with all of this.  These two are especially dumb:\n\n* CS is the most challenging major, barring a few niche exceptions centered around math and physics,\n* Hence, everyone is who majors in CS is exceptionally brilliant and ambitious\n\nMy stereotype of the average CS major is an unimaginative risk-averse grinder whose highest aspiration is to go be a drone at FAANG.\n\nWhen I think of which majors tend to attract \"brilliant\" students it's Math and Physics.\n\nWhen I think of \"most challenging\" it's engineering or the med school track.  Or, for that matter, architecture; my architecture friends in undergrad seemed to spend an inordinate amount of time in the studio.  Way more than I spent on programming assignments.",
      "author": "jayphoward",
      "created": 1636311724,
      "upvotes": 23,
      "replies": {}
    },
    "hjovfx2": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjovfx2/",
      "text": "i agree with this post !",
      "author": "electric_deer200",
      "created": 1636302876,
      "upvotes": 21,
      "replies": {}
    },
    "hjp9vic": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp9vic/",
      "text": "This post made me feel better about being set on pre-law and hating STEM loll",
      "author": "duke_simp",
      "created": 1636308603,
      "upvotes": 20,
      "replies": {}
    },
    "hjp5vus": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjp5vus/",
      "text": "\\>Hence, everyone is who majors in CS is exceptionally brilliant and ambitious, and the only valid reason to not major in CS is an inability to succeed in such a demanding field\n\nThis makes no sense. All STEM majors are for ambitious and brilliant people. If these people think that mathematics, electrical engineering or biochemistry majors somehow waste their intelligence, they should look at the problems solved by these disciplines",
      "author": "peegmay",
      "created": 1636306997,
      "upvotes": 18,
      "replies": {
        "hjqa5n6": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqa5n6/",
          "text": "It’s kind of ironic that you specified STEM in your comment; all majors, not just stem and not just cs, are for brilliant people.",
          "author": "AnAltPerhaps",
          "created": 1636322867,
          "upvotes": 15,
          "replies": {
            "hjqpcwh": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqpcwh/",
              "text": "I disagree. Sole Majoring in something like English Lit or the usual memes of gender/ethnic/whatever studies, or sole majoring in a particular language (eg Danish major) without an exceptionally strong reason for why it makes sense are indicative IMO of the exact opposite of brilliance.",
              "author": "InertiaOfGravity",
              "created": 1636329448,
              "upvotes": -8,
              "replies": {
                "hjr1b1a": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjr1b1a/",
                  "text": "Lmao what, I’m interested in physics and engineering, but trying to write off entire majors as the opposite of brilliance is just dumb. Also what defines “brilliance,” it’s a very subjective term.",
                  "author": "EffectiveCustard",
                  "created": 1636334985,
                  "upvotes": 15,
                  "replies": {
                    "hjr5ww3": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjr5ww3/",
                      "text": "I agree, but in my opinion without some incredibly strong extenuating circumstance, choosing to major in gender studies or ethnic studies is exemplary of a lack of critical thinking ability",
                      "author": "InertiaOfGravity",
                      "created": 1636337153,
                      "upvotes": -9,
                      "replies": {
                        "hjrbalr": {
                          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrbalr/",
                          "text": "So you think people shouldn't major in these fields at all? If students didn't study these topics, how would advancements be made in them? Majoring in fields like the ones you listed demonstrates a knack for critical thinking because you'd have to come up with novel ideas while considering the history your subject...as with any major....",
                          "author": "galavantingcarrot6",
                          "created": 1636339704,
                          "upvotes": 4,
                          "replies": {
                            "hjrfgcr": {
                              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrfgcr/",
                              "text": "I didn't say that... I specified there \"incredibly strong extenuating circumstance\". It is pretty clear that, regardless of how much you like the subject, choosing to major in something like history will 9 times out of 10 be a horrible idea from a monetary perspective. If you have a strong extenuating circumstance (say, youre a chess grandmaster who is going to major in history at Stanford a la Santa naroditsky) then it's fine, but otherwise, it is exemplary of a lack of serious consideration given to a major, life defining choice",
                              "author": "InertiaOfGravity",
                              "created": 1636341769,
                              "upvotes": -1,
                              "replies": {
                                "hjsq94p": {
                                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjsq94p/",
                                  "text": "Choosing a riskier career path does not make you stupid, it just means your willing to take the risk that others aren't. Yes, entry level jobs in CS are on average a little better than history. No, it is not evidence of a lack of consideration if someone chooses to major in history or another one of the \"usual memes.\" Someone may be willing to major in a field where job prospects are significantly worse than CS if they satisfy one of these requirements:\n\n\\- Already have money and can afford to spend time checking off requirements for high paying jobs in their field before they start making money off their degree\n\n\\- Have a significant interest in their field and think that doing something that makes them happy will, in the long run, be the best option as they will be more motivated to work hard and do the necessary ground work for a well payed job (This is a very good reason! Studies show we succeed when we enjoy our work/ find it meaningful!)\n\n\\- Loath CS and/or STEM and would do terribly in those fields\n\n\\- Want to go into academic work, where a degree in gender studies can actually be very useful once your field starts getting more narrowed down to a specific research topic\n\n\\-They realize that your major is not the only subject you take classes in, nor the only education you get while at college. Even if you major \\*gasp\\* gender studies. \n\nThese are not incredibly rare extenuating circumstances. Nearly all students fulfill one of these requirements. It is not stupid to do a subject with worse entry level job prospects. It is stupid to assume someone lacks critical thinking skills because of their chosen major.",
                                  "author": "collegestuff1235",
                                  "created": 1636375758,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjpkcng": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpkcng/",
      "text": "bruh every CS major knows math, physics and other engineering stuff is exceptionally harder than monkey typing on a keyboard",
      "author": "RetardLover69",
      "created": 1636312643,
      "upvotes": 8,
      "replies": {}
    },
    "hjq4f9i": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjq4f9i/",
      "text": "good post!",
      "author": "wertu1221",
      "created": 1636320509,
      "upvotes": 2,
      "replies": {}
    },
    "hjqcqsr": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqcqsr/",
      "text": "You are right. For a long time I wanted to major in CS because MONEY, but they I realized that I can use my skills to do sth that I enjoy much more -Astronomy. That’s why I changed my decision and I’m pretty happy about it. I can use my programming skills in this field as well(I’m planning to get a PhD in computational astrophysics). So yeah I good luck to everyone. I hope that your major will make you happy 💛",
      "author": "RAtararatara",
      "created": 1636323961,
      "upvotes": 2,
      "replies": {}
    },
    "hjqtaac": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqtaac/",
      "text": "I don't know if this is just me but like I want to be able to do everything. Not in a self-centered way but I wish I had time in my life to do everything ya know. There's so much out there to explore and get good at.",
      "author": "jackiechan_4",
      "created": 1636331216,
      "upvotes": 2,
      "replies": {}
    },
    "hjqyv74": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqyv74/",
      "text": "What’s FAANG?",
      "author": "Zealousideal-Ad-1572",
      "created": 1636333831,
      "upvotes": 2,
      "replies": {
        "hjrbtwp": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrbtwp/",
          "text": "Facebook, Apple, Amazon, Netflix, Google / Biggest tech corporations",
          "author": "galavantingcarrot6",
          "created": 1636339968,
          "upvotes": 1,
          "replies": {
            "hjtvhuz": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjtvhuz/",
              "text": "[deleted]",
              "author": null,
              "created": 1636393987,
              "upvotes": 1,
              "replies": {
                "hjuyq0n": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjuyq0n/",
                  "text": "a pretty good amount of the top actually do",
                  "author": "basspath",
                  "created": 1636409773,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjrjinp": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrjinp/",
      "text": "What you described is what I call a \"STEMlord.\" They're just as bad, if not worse, than Econ bros",
      "author": "copydex1",
      "created": 1636343853,
      "upvotes": 2,
      "replies": {}
    },
    "hjro9py": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjro9py/",
      "text": "Lmao medicine requires way more years of school it is in no way a better bet than CS if you don't have a passion for either. What I mean is, if you are disinterested in general and don't have a passion, taking up medicine is silly.",
      "author": "Feels_Bad_Man19",
      "created": 1636346484,
      "upvotes": 2,
      "replies": {}
    },
    "hjrvks6": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrvks6/",
      "text": "Well welcome to my world. Yes I am a CS applicant, but that is because I genuinely like coding and everything CS stands for, but to everyone else around me I am that kid whose in it for the money and is the most uninspired assholic idiot out there cuz \"You're a CS wannabe\".   \n\n\nGenuinely hate it sometimes that every uninspired idiot out there that doesn't even know how to type or operate a computer wants a CS major cuz their parents want their kids money. Wish I could punch their sucker faces sometimes",
      "author": "pranavyadlapati",
      "created": 1636351263,
      "upvotes": 2,
      "replies": {}
    },
    "hjtsds9": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjtsds9/",
      "text": "> The (intuitive) truth is that students in finance, consulting, and law experience just as much economic success as engineers at FAANG, \n\nWhile true, a huge issue is that finance/consulting are both very prestige focused careers so the number of schools where you can get a bonafide finance/consulting job (or have a large enough population of kids getting them to sustain that culture) is pretty small. Whereas most flagships send a bunch of kids to FAANG. Law is graduate school so not relevant in this case. \n\nCS is honestly the most accessible, high paying career path for people who don't go to a prestige school and who don't want to go past a bachelors. FAANG probably hires more software engineers than there are new Investment Banking analysts each year in general lol",
      "author": "doneanddead",
      "created": 1636392753,
      "upvotes": 2,
      "replies": {}
    },
    "hjpfrci": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpfrci/",
      "text": "cs is not the most challenging major",
      "author": "SATthrowawayo",
      "created": 1636310877,
      "upvotes": 4,
      "replies": {}
    },
    "hjqrfou": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjqrfou/",
      "text": "I literally just like coding and now I got all these FAANG tryhards to compete against to get into my state flagship school.",
      "author": "Kidfromwakanda",
      "created": 1636330376,
      "upvotes": 2,
      "replies": {
        "hjr0368": {
          "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjr0368/",
          "text": "Ut Austin?",
          "author": "thejaegermeister2",
          "created": 1636334409,
          "upvotes": 1,
          "replies": {
            "hjr74l2": {
              "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjr74l2/",
              "text": "Nope. Think smaller, more STEM oriented, and further north.",
              "author": "Kidfromwakanda",
              "created": 1636337716,
              "upvotes": 1,
              "replies": {
                "hjrbkdc": {
                  "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrbkdc/",
                  "text": "Purdue?",
                  "author": "shinyf0rehead",
                  "created": 1636339837,
                  "upvotes": 1,
                  "replies": {
                    "hjrx289": {
                      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjrx289/",
                      "text": "Nope. It’s a really good dental school (grad) tho if that’s any help.",
                      "author": "Kidfromwakanda",
                      "created": 1636352328,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjr0jod": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjr0jod/",
      "text": "bro cs is ez af compared to physics or math",
      "author": "allahuakbarbomb",
      "created": 1636334625,
      "upvotes": 1,
      "replies": {}
    },
    "hjpm12e": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpm12e/",
      "text": "I disagree depends on the person. I think humanity classes are much harder than STEM classes regardless of their “prestigiousness”",
      "author": "GroundbreakingCan655",
      "created": 1636313291,
      "upvotes": 0,
      "replies": {}
    },
    "hjpi94s": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjpi94s/",
      "text": "So true; a lot of people just do it for the money.",
      "author": "CompetitiveTable1",
      "created": 1636311837,
      "upvotes": 1,
      "replies": {}
    },
    "hjs8qtw": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjs8qtw/",
      "text": "I scored 100/100 in advanced cs but I am not going to major in Cs cus I dont want to stare at my screen 10 hours a day working for someone else.",
      "author": "starish69",
      "created": 1636361999,
      "upvotes": 1,
      "replies": {}
    },
    "hjsqd1m": {
      "link": "/r/ApplyingToCollege/comments/qord4j/glorification_of_cs/hjsqd1m/",
      "text": "There is nothing wrong to chase to profit; be warned, if so many people are chasing the same thing, it is possible it will be saturated or flattened",
      "author": "happyn6s1",
      "created": 1636375822,
      "upvotes": 1,
      "replies": {}
    }
  }
}