{
  "sid": "qzwtpv",
  "link": "/r/ApplyingToCollege/comments/qzwtpv/is_being_deferred_necessarily_a_bad_thing/",
  "title:": "is being deferred necessarily a bad thing?",
  "text": "i know obviously no one wants to get deferred from their early decision school. i’m talking about if a school defers u, what other things are they gonna look at when reading ur application a second time? is it just to compare ur application to all the ones in the rd pool?",
  "author": "bummybitxh",
  "created": 1637617706,
  "updated": 1637687370,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlowdts": {
      "link": "/r/ApplyingToCollege/comments/qzwtpv/is_being_deferred_necessarily_a_bad_thing/hlowdts/",
      "text": ">is it just to compare ur application to all the ones in the rd pool\n\nBasically\n\n>what other things are they gonna look at when reading ur application a second time\n\nYour LOCI and anything else you send in",
      "author": "freeport_aidan",
      "created": 1637617828,
      "upvotes": 4,
      "replies": {}
    },
    "hlp95ps": {
      "link": "/r/ApplyingToCollege/comments/qzwtpv/is_being_deferred_necessarily_a_bad_thing/hlp95ps/",
      "text": "Worse than being accepted, better than being rejected.\n\nThey’ll look at your application and any new information provided, and compare it with the rest of the deferred students plus the RD applicants.",
      "author": "RichInPitt",
      "created": 1637623379,
      "upvotes": 5,
      "replies": {
        "hlp9got": {
          "link": "/r/ApplyingToCollege/comments/qzwtpv/is_being_deferred_necessarily_a_bad_thing/hlp9got/",
          "text": "And you’re no longer obligated to attend if accepted",
          "author": "Pitsuh",
          "created": 1637623512,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hlpqfqy": {
      "link": "/r/ApplyingToCollege/comments/qzwtpv/is_being_deferred_necessarily_a_bad_thing/hlpqfqy/",
      "text": "depends on the school imo. like for Stanford they defer few people in the rea round so if ur deferred, ur rd acceptance chance is pretty high because they don't defer random ppl. but for ivies, they defer most ppl in the early round so",
      "author": "InitialIdea923",
      "created": 1637631479,
      "upvotes": 2,
      "replies": {}
    },
    "hlqer1s": {
      "link": "/r/ApplyingToCollege/comments/qzwtpv/is_being_deferred_necessarily_a_bad_thing/hlqer1s/",
      "text": "hot take: i was so glad i got deferred. mit was my dream school but after getting deferred, i concluded that i was not getting in and so i fell in love with other schools and really wanted to go to them. then, when i got accepted to mit in rd, i didn’t immediately commit (in fact, for a couple weeks after i very much did not think i’d go there). i reviewed mit much more thoroughly and objectively because i was no longer seeing it through rose tinted glasses and i made a better informed decision. i know that wasn’t what you were asking about, but it was a thought i had on being deferred.",
      "author": "jankysat",
      "created": 1637643534,
      "upvotes": 1,
      "replies": {}
    }
  }
}