{
  "sid": "qese3u",
  "link": "/r/ApplyingToCollege/comments/qese3u/weighted_vs_unweighted/",
  "title:": "weighted vs unweighted",
  "text": "Which one do schools care more about? My unweighted gpa is definitely a bit low (at least for this thread) but I would say my weighted gpa is pretty solid. I am in a program where I took all college classes for the last two years of high school so I got a significant boost. Would this help me a lot, like enough to get into my reaches? Or do colleges mainly care about weighted? \n\nFor reference: UW3.29 W4.06 and test optional\n\nSchools i'm applying for if it gives you guys any insight(everywhere EA if they offer it):\n*Tulane ED(big reach I know but dream school)\nUMD college park\n*UMiami\n*Ohio State\n*Syracuse\nPenn State\nPitt\nMiami in Ohio\nPace\nUMass Boston\n*Virginia Tech\nUVM\nBinghamton\n\n* next to my favorite I really hope I get a yes from",
  "author": "Successful_Ad_8218",
  "created": 1635082871,
  "updated": 1635182724,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hhvc2el": {
      "link": "/r/ApplyingToCollege/comments/qese3u/weighted_vs_unweighted/hhvc2el/",
      "text": "Every college will evaluate your gpa differently. All you can do is put your best application forward! And they’ll look at your transcript in the context of what your school offers. Good luck!",
      "author": "admissionsmom",
      "created": 1635088927,
      "upvotes": 3,
      "replies": {
        "hhvdfa3": {
          "link": "/r/ApplyingToCollege/comments/qese3u/weighted_vs_unweighted/hhvdfa3/",
          "text": "OP, if you check the profile of /u/admissionsmom you’ll see a recent AMA she did, where there’s a slightly more thorough discussion of GPA recalculation.\n\nThe major takeaway, if you don’t want to look for it: what exactly the colleges are doing to recalculate or not your GPA matters way less than you think.",
          "author": "IntheSarlaccsbelly",
          "created": 1635089540,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhv7nbl": {
      "link": "/r/ApplyingToCollege/comments/qese3u/weighted_vs_unweighted/hhv7nbl/",
      "text": "Colleges will recalculate your GPA. Also, colleges know that community college classes are typically easier than APs, despite being weighed the same. I think your starred schools might be hard to get into. UMass Boston, Miami in Ohio, UVM, and Pace you should definitely get into though. Did you take the SAT? A solid SAT could definitely boost your application, same with good extracurriculars.",
      "author": "No-Reception2878",
      "created": 1635086908,
      "upvotes": 1,
      "replies": {
        "hhv8453": {
          "link": "/r/ApplyingToCollege/comments/qese3u/weighted_vs_unweighted/hhv8453/",
          "text": "I don't have time sadly :( The program I'm in is extremely time consuming and I don't have time to study for the SAT. I wasn't aware community college classes were that much easier than APs I thought it would give me some type of edge lol. I did the early college health sciences program so it was a lot of biology and anatomy stuff which I thought was pretty difficult if it means anything. What do u think abt Virginia Tech? I thought with their acceptance rate I might be able to get myself in.",
          "author": "Successful_Ad_8218",
          "created": 1635087118,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}