{
  "sid": "qehk1i",
  "link": "/r/ApplyingToCollege/comments/qehk1i/indecisive_on_ranking_northwestern_for/",
  "title:": "Indecisive on ranking Northwestern for Questbridge match",
  "text": "Hi all,\n\nI’m a really indecisive person, and I’ve been genuinely struggling on finalizing my rankings list for the questbridge match since it’s binding. From the research I’ve done, NU seems like a school which has a better balance between social life and academics compared to other schools in its caliber, but I can definitely see myself becoming really depressed with the quarter system and long winters. I also wanted to take Vietnamese in college, but they don’t offer that either. One of the main reasons I want to rank it besides the social/academic balance + campus, is that it’s one of the only questbridge schools I’m interested in that actually has a notable marching band. I’d love to attend the college, but a few points like these concern me about whether I should be willing to commit and rank it for the match. Advice?",
  "author": "Oduo",
  "created": 1635036826,
  "updated": 1635182906,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hhtd149": {
      "link": "/r/ApplyingToCollege/comments/qehk1i/indecisive_on_ranking_northwestern_for/hhtd149/",
      "text": "this is why questbridge puzzles me so much. Because at the end of the day you're essentially applying ED to every school on your list, and as someone who is also very indecisive and doesn't even have 1 ED school, I can't fathom having 10 schools that I would be comfortable submitting binding applications to. \n\nsorry that's not all that helpful. ig the only advise I have is to do as much research and introspection as you can before the deadline, and if you are still concerned that you may be unhappy after that, I personally would not submit a binding application to that school. \n\nI'm also curious: is this the only school with this degree of concern, do you have 9 schools your already satisfied with? if both are true that might push you more towards not ranking it.",
      "author": "miles3141",
      "created": 1635042466,
      "upvotes": 7,
      "replies": {
        "hhtqu4q": {
          "link": "/r/ApplyingToCollege/comments/qehk1i/indecisive_on_ranking_northwestern_for/hhtqu4q/",
          "text": "yea i agree with u. i only have 2 schools on my list bc i couldn’t justify basically applying ed to all these schools (i like some of them, but not so much that id be willing to ed to all of them), but the fact that i only have 2/12 makes me feel like i’m not fully utilizing the match if that makes sense. ik it’s not a good mindset to have, but i’m trying to realize more that it’s ok and i shouldn’t be forcing myself to apply to more just because. northwestern is basically the only school left that i could reason myself through, but i probably won’t be applying through the match with them considering how much i’m on the edge abt it",
          "author": "Oduo",
          "created": 1635049936,
          "upvotes": 1,
          "replies": {
            "hhu0coh": {
              "link": "/r/ApplyingToCollege/comments/qehk1i/indecisive_on_ranking_northwestern_for/hhu0coh/",
              "text": "I totally get it. what are the two if you don't mind me asking?",
              "author": "miles3141",
              "created": 1635056527,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhtsu5e": {
      "link": "/r/ApplyingToCollege/comments/qehk1i/indecisive_on_ranking_northwestern_for/hhtsu5e/",
      "text": "QB is a binding decision, only rank schools you would be 100% happy at.",
      "author": "IglooWater",
      "created": 1635051169,
      "upvotes": 1,
      "replies": {}
    }
  }
}