{
  "sid": "qfv8kv",
  "link": "/r/ApplyingToCollege/comments/qfv8kv/taking_less_classes_in_high_school/",
  "title:": "Taking less classes in High School",
  "text": "So my high school has this thing where you have a \"zero\" hour and \"eighth hour\". They're basically two extra periods other than the standard six periods they offer (I know the math doesn't match up there's a weird thing with lunches don't ask). So I have a zero hour, problem is it's orchestra and probably going to take up all four years of my highschool. My school's minimum period requirement is six, so now my parents are pushing me to only take six periods, including orchestra. I've done this for sophomore year already, and they're pushing me to do it junior year too.\n\nMy question is, would this make me look worse to colleges? I'm aiming kinda high, and I'm super worried about hurting my chances. Since most of my firends (who are also in orchestra) are taking seven periods (or more) a day.\n\nAs it is, I have less Advanced Placement classes than them already. I took two tests last year, and am taking three (kinda four? one of them is weird) this year, but most of the aforementioned friends are taking 4-5 this year too. If it sounds like I'm being weirdly competitive, I might be, since we all fit mostly the same demographic and it'll be tough if we apply to the same places.\n\nI'm just worried that taking only six periods will hurt my chances, since it means I'll be taking less advanced classes than them, and that it'll make it look like I'm afraid to challenge myself to colleges.",
  "author": "ebonychair",
  "created": 1635210880,
  "updated": 1635302196,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi2czb4": {
      "link": "/r/ApplyingToCollege/comments/qfv8kv/taking_less_classes_in_high_school/hi2czb4/",
      "text": "I would make sure you still have the prerequisites most top colleges seem to require - 4 years English, 4 years math, 3 years foreign language, 3 years science , 2-3 years social studies/history plus arts ( which orchestra will cover). Have a look at the websites for the colleges you might be interested in. If you won’t meet the requirements talk to your parents about taking another period so you meet the requirements.",
      "author": "WorriedTurnip6458",
      "created": 1635214347,
      "upvotes": 1,
      "replies": {
        "hi2e8ul": {
          "link": "/r/ApplyingToCollege/comments/qfv8kv/taking_less_classes_in_high_school/hi2e8ul/",
          "text": "I think I definitely meet the prerequisites. I have all of those covered, but I'm just worried about seeming competitive in comparison to my friends.",
          "author": "ebonychair",
          "created": 1635214964,
          "upvotes": 1,
          "replies": {
            "hi2ealy": {
              "link": "/r/ApplyingToCollege/comments/qfv8kv/taking_less_classes_in_high_school/hi2ealy/",
              "text": "I know that sounds kinda bad, like I support them and all but there's this part of me that's kinda insecure about my future.",
              "author": "ebonychair",
              "created": 1635214988,
              "upvotes": 1,
              "replies": {}
            },
            "hi2ewfh": {
              "link": "/r/ApplyingToCollege/comments/qfv8kv/taking_less_classes_in_high_school/hi2ewfh/",
              "text": "I think you are doing better in the courses you have than stretching to another course so you can report one more AP. The only exception might be an additional high level science or math if you want to go into STEM - because I’ve heard those fields can be super competitive in top\nColleges",
              "author": "WorriedTurnip6458",
              "created": 1635215285,
              "upvotes": 1,
              "replies": {
                "hi2fyby": {
                  "link": "/r/ApplyingToCollege/comments/qfv8kv/taking_less_classes_in_high_school/hi2fyby/",
                  "text": "I think I'm fairly good with math and science, I'll be finishing up AP Calc BC this year and AP Physics C as well. I'll try some STEM competitions as well then, thanks!",
                  "author": "ebonychair",
                  "created": 1635215792,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}