{
  "sid": "q6zb0n",
  "link": "/r/ApplyingToCollege/comments/q6zb0n/which_physics_programs_are_the_most_versatile/",
  "title:": "Which Physics programs are the most versatile?",
  "text": "I've been doing some searching for good physics programs to apply to, and it seems they're all highly specialized. For example, UofA easily competes with Harvard in optical physics, but barely at all in other physics programs...\n\nI don't know which field I want to explore yet, and I'm not sure I'll have an idea by the time I decide where exactly to apply to (I'm a senior in HS).\n\nThe problem is that I'm not competitive for the *top top* physics schools like Harvard, UChicago, Princeton... etc. So I have to pick between the UCSB, UMaryland, WashU, UCSD.. etc. lists at best for applications.\n\nany tips for someone who can't specialize yet? Thanks, love you guys.",
  "author": "tripletim",
  "created": 1634084344,
  "updated": 1634167129,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgf9ztz": {
      "link": "/r/ApplyingToCollege/comments/q6zb0n/which_physics_programs_are_the_most_versatile/hgf9ztz/",
      "text": "I'm doing Physics at Denison, and our degree requirements include courses in arts, CS and advanced mathematical modeling. If you are intersted, def go check for more accurate details.",
      "author": "DiarrheaASMR28",
      "created": 1634085148,
      "upvotes": 2,
      "replies": {}
    },
    "hgfhjd3": {
      "link": "/r/ApplyingToCollege/comments/q6zb0n/which_physics_programs_are_the_most_versatile/hgfhjd3/",
      "text": "WashU is stupidly versatile (no restrictions on course enrollment by major 99% of the time) and has a ton of top grad school admits every year, which is incredible given there's only like 10-15 physics majors graduating annually. \n\nI'd say WashU's strengths are solidly in the Biophysics department since much of the work has to do with mechanobiology and other topics of interest to the medical school",
      "author": "MundyyyT",
      "created": 1634088626,
      "upvotes": 2,
      "replies": {}
    }
  }
}