{
  "sid": "qdcrlj",
  "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/",
  "title:": "Is there any way to get into a Top 20 University if you aren't ultra special?",
  "text": "Can you get into the top Universities if you didn't start a business or start an NGO or work at the UN or any of the other insane stuff that you see people putting on their extracurriculars?\n\nEdit: From the perspective of an international student from Asia",
  "author": "ashloss__",
  "created": 1634892975,
  "updated": 1635183672,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hhlm5vf": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhlm5vf/",
      "text": "Yes, but it often comes down to luck (yeah, obviously it’s not random, but to the outside observer it looks almost like it is). The insane people who do the things you listed have much better chances - if they’re that good, the Ivies may even be fit schools, although it’s still not guaranteed at all (example: friend who speaks 8 languages, went to ISEF, perfect SAT/GPA, and tours internationally as concert pianist got into all the Ivies except Penn and Dartmouth).\n\nFor the rest (people with high GPAs and testing and good extracurriculars, but not world-class), they’re still reaches, and very very unpredictable. You hear things like Harvard takes all the super genius/talented/special kids that apply, but that only fills 25% of their class, so the rest they take from the thousands and thousands of highly-qualified but not genius applicants. That’s why some people “shotgun” and apply to every T20 - they think if they apply to all 20, they’ll get lucky and get into at least one.",
      "author": "DarthKnah",
      "created": 1634895184,
      "upvotes": 9,
      "replies": {}
    },
    "hhlnscf": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhlnscf/",
      "text": "If you have a 1600 SAT , and 4.0 UW GPA, you're in the running for most T20s even if you have terrible ECs. Every student shines in different ways. \n\nMost of those students with really great ECs come from privileged backgrounds where the parents have more resources to make their child's EC happen\n\nColleges will weigh them and you differently assuming you're less privileged and have less resources.",
      "author": "ivybrothers",
      "created": 1634896521,
      "upvotes": 12,
      "replies": {
        "hhmd0zi": {
          "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhmd0zi/",
          "text": "Definitely for the bottom T20s yeah but not for HYPSM Caltech tier",
          "author": "pianoloverkid123456",
          "created": 1634911197,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhlxkyi": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhlxkyi/",
      "text": "the dumbest of my friends got into Cornell. His essay’s were goated tho",
      "author": "Additional_Fold7154",
      "created": 1634903577,
      "upvotes": 3,
      "replies": {
        "hhmpxvk": {
          "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhmpxvk/",
          "text": "What was his gpa/test scores",
          "author": "the_card_dealer",
          "created": 1634916466,
          "upvotes": 2,
          "replies": {
            "hhms3zo": {
              "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhms3zo/",
              "text": "We don't follow the GPA system in India, he got 85% tho. Went in SAT optional. He was more of an extra-curricular's guy, stayed out of the class most of the time. The school suggested his name for every comp to every teacher. Also, there was a phase in his life because of which his grades went down. He was very true in his application and mentioned every reason behind his low grade or anything.",
              "author": "Additional_Fold7154",
              "created": 1634917340,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhm56ro": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhm56ro/",
      "text": "I'm copy-pasting from a recent thread on this same topic:  \n\n\n-----  \n\nFirst and foremost: Your transcript & GPA & Test Scores need to indicate that you are capable of handling the academic course-load at a top-tier institution.  \n\nIf you are a C- student, taking all standard-level (not honors, AP, IB or dual-enrollment) courses, then it's a hard-pass, not-gonna-happen.  \n\nIt's not negotiable. If they admit you and you flunk-out, it's bad for everyone. Your academic track-record needs to indicate that you can handle the work-load.  \n\nThe Ivy and their peer-level schools almost all use the same language in their admissions documents:  \n\n*\"We assemble a freshman class from the applicant pool.\"*  \n\nThey want to kinda-sorta pick and choose applicants who are entirely qualified, accumulate into a desired level of diversity, and will represent the institution well as graduates.  \n\nI simplify/summarize this as: *\"Are you interesting?\"*  \n\nIt's possible I am reading too much into it, but I find this blog article really supportive of this concept:  \n\nhttps://mitadmissions.org/blogs/entry/its_more_than_a_job/  \n\nFurther support comes from this:  \n\nhttps://mitadmissions.org/blogs/entry/applying_sideways/  \n\nHow does one go about achieving a level of \"being interesting\"?  \n\nWriting a highly persuasive or emotionally-connecting essay might work.  \n\nInventing your own extra-curriculars and all tie into a good story of \"Why this university?\" might work.  \n\nWriting a New York Times Best Seller might work.  \n\nPerforming poetry before the Super Bowl might work.  \n\nBeing the daughter of the first black President of the US might work (or frankly any child of a global leader).  \n\n-----  \n\nElite-level universities have more exceptionally high-qualified applicants than they have room in the freshman class for.  \n\nOn paper, many of those exceptionally high-qualified applicants really look a lot alike.  \nLooking the same as a large array of other applicants is boring. It's easy to lose visibility of 185 applicants who all look the same (on paper).  \n\nBut if only one of them wrote an essay that reaches into the very soul of anyone who reads it, THAT stands out as interesting.  \n\nIf only one of them tells a story of how they became a world champion ping-pong player, and started a campaign to start a tri-state annual ping-pong tournament with 13,000 total participants in the first year, that's really interesting too.  \n\nIf only one of them tells the story of making a YouTube channel dedicated to documenting and preserving the artisanal blanket making techniques of their local Native American tribe-members, that's interesting.  \n\nThese applicants are easy to see in an ocean of private school attending, piano-playing, olympiad-competing, my-life-is-a-hardship applicants.  \n\n-----  \n\nBut, that's all just my opinion, I could be wrong...",
      "author": "VA_Network_Nerd",
      "created": 1634907729,
      "upvotes": 3,
      "replies": {
        "hhme61z": {
          "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhme61z/",
          "text": "can you please share the thread?",
          "author": "mintyquaintchair2",
          "created": 1634911678,
          "upvotes": 1,
          "replies": {
            "hhmnlhd": {
              "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhmnlhd/",
              "text": "https://old.reddit.com/r/ApplyingToCollege/comments/q39w6d/wonder_how_often_do_nonexcellent_students_get/",
              "author": "VA_Network_Nerd",
              "created": 1634915528,
              "upvotes": 2,
              "replies": {
                "hhpa9bm": {
                  "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhpa9bm/",
                  "text": "Thanks!",
                  "author": "mintyquaintchair2",
                  "created": 1634958418,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhm4i3l": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhm4i3l/",
      "text": "International from asia...\n\nSo no",
      "author": "Sea_Individual1999",
      "created": 1634907400,
      "upvotes": 3,
      "replies": {
        "hhmplzo": {
          "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhmplzo/",
          "text": "Ouch",
          "author": "whoisapotato",
          "created": 1634916336,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhlktjg": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhlktjg/",
      "text": "My opinion: High SAT/ACT Score + High GPA + Excellent Essay(s) + Whatever extracurricular activities you have (if activities are related to your desired major, here's a ✔️.) \n\nSome would say APs too.\n\nI would say you don't have to be ultra-special in so many things (like these people you referred to) but just be in one, one thing you are passionate about, that's your major. For example, I'm passionate about pursuing CS, and most of my ECs are coding-oriented.",
      "author": "EinsStark",
      "created": 1634893994,
      "upvotes": 2,
      "replies": {}
    },
    "hhljz68": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhljz68/",
      "text": "[removed]",
      "author": null,
      "created": 1634893227,
      "upvotes": 1,
      "replies": {
        "hhljzv0": {
          "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhljzv0/",
          "text": "[removed]",
          "author": null,
          "created": 1634893245,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhme8c9": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhme8c9/",
      "text": "If you need aid, probably not.",
      "author": "Public_Watch1905",
      "created": 1634911706,
      "upvotes": 1,
      "replies": {}
    },
    "hhlk3on": {
      "link": "/r/ApplyingToCollege/comments/qdcrlj/is_there_any_way_to_get_into_a_top_20_university/hhlk3on/",
      "text": "Test",
      "author": "FarStar846",
      "created": 1634893344,
      "upvotes": 0,
      "replies": {}
    }
  }
}