{
  "sid": "qgpdxl",
  "link": "/r/ApplyingToCollege/comments/qgpdxl/nyu_transfer_worth_it/",
  "title:": "NYU transfer worth it?",
  "text": "Im a sophomore at Stony Brook university which is a pretty good state school. Im in the CS honors program which is ranked top 25 and am possibly double majoring in economics. I’ve always wanted to go to a good private school like NYU for the name and experience but the price tag is whats holding me back. For two years at NYU, it would be 160k. I have parents that would help me pay it back but I would have to bear most of the load. I plan on attending a MBA program after undergrad possibly at NYU and that would be even more money. Is it worth transferring for the experience.",
  "author": "jeremiahson123",
  "created": 1635312420,
  "updated": 1635456527,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi7s40n": {
      "link": "/r/ApplyingToCollege/comments/qgpdxl/nyu_transfer_worth_it/hi7s40n/",
      "text": "Personally I doubt it. A CS degree from any school will open similar doors. I’d graduate from your school and work for a bit and then see how NYU alums are regarded before applying for an MBA there.\n\nBut I made both my kids turn down NYU because you could buy a house for the price of a degree there",
      "author": "RetiringTigerMom",
      "created": 1635314486,
      "upvotes": 3,
      "replies": {}
    },
    "hi7schh": {
      "link": "/r/ApplyingToCollege/comments/qgpdxl/nyu_transfer_worth_it/hi7schh/",
      "text": "I'd say that Stony Brook's CS program is actually very comparable to NYU's. So there's no point in spending a fortune on it. An MBA is a different story, and you can always apply to Stern for that later on.",
      "author": "prsehgal",
      "created": 1635314659,
      "upvotes": 4,
      "replies": {
        "hi7u5g3": {
          "link": "/r/ApplyingToCollege/comments/qgpdxl/nyu_transfer_worth_it/hi7u5g3/",
          "text": "Thank you",
          "author": "jeremiahson123",
          "created": 1635316049,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hi7qvs6": {
      "link": "/r/ApplyingToCollege/comments/qgpdxl/nyu_transfer_worth_it/hi7qvs6/",
      "text": "Taking out that much money in loans is insane (I assume you and your family cannot afford it out of pocket since you said you’ll have to pay it back). Even more so if you plan on doing an MBA program later. The “experience” is not worth 160K in loans imo.",
      "author": "rainingsiberiancats",
      "created": 1635313597,
      "upvotes": 2,
      "replies": {}
    }
  }
}