{
  "sid": "quw6qe",
  "link": "/r/ApplyingToCollege/comments/quw6qe/help_needed_here/",
  "title:": "Help needed here",
  "text": "How you guys tell your favorite university like bro I need you to give me at least a full tuition scholarship so I can attend to your school? (If already accepted)",
  "author": "Marivii",
  "created": 1637026922,
  "updated": 1637179615,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkst01n": {
      "link": "/r/ApplyingToCollege/comments/quw6qe/help_needed_here/hkst01n/",
      "text": "If you applied to schools you know will not give you need-based aid, and you cannot afford to attend without a merit scholarship, go to their scholarship website to see whether there are any additional steps beyond the admission application for applying for their big scholarships.",
      "author": "elkrange",
      "created": 1637027922,
      "upvotes": 3,
      "replies": {}
    },
    "hkt2tf1": {
      "link": "/r/ApplyingToCollege/comments/quw6qe/help_needed_here/hkt2tf1/",
      "text": "another thing people do is if they are accepted to multiple universities who offer aid packages, you can leverage them by basically saying \"i would love to go here, but this other school is offering me $x and affordability is a priorty to me\" it helps if the two colleges are very similar in ranking/prestige. don't be afraid to call up the financial aid office to be like \"what can i do to make an education at ----- more affordable?\"",
      "author": "fortuitous_rain515",
      "created": 1637032273,
      "upvotes": 3,
      "replies": {
        "hktekl0": {
          "link": "/r/ApplyingToCollege/comments/quw6qe/help_needed_here/hktekl0/",
          "text": "Do you mean contacting the financial aid office of the same university?",
          "author": "Marivii",
          "created": 1637038065,
          "upvotes": 1,
          "replies": {
            "hkthtsd": {
              "link": "/r/ApplyingToCollege/comments/quw6qe/help_needed_here/hkthtsd/",
              "text": "yea i would just contact this university directly and be straight up about the situation; i mean what do you really have to lose as you won't be able to go if you don't get enough financial aid anyway? ask them about more ways you can bring down the cost and provide evidence of why this might not be affordable for you or how another university is giving you a better offer",
              "author": "fortuitous_rain515",
              "created": 1637039917,
              "upvotes": 1,
              "replies": {
                "hkuuq4i": {
                  "link": "/r/ApplyingToCollege/comments/quw6qe/help_needed_here/hkuuq4i/",
                  "text": "Yeah thanks a lot!",
                  "author": "Marivii",
                  "created": 1637073156,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkuaj2h": {
      "link": "/r/ApplyingToCollege/comments/quw6qe/help_needed_here/hkuaj2h/",
      "text": ">How you guys tell your favorite university like bro I need you to give me at least a full tuition scholarship so I can attend to your school?\n\nShow them you’re academically competitive enough and you might just land enough merit aid scholarships to cover tuition. Of course, academically competitive is a subjective term because GPA varies by college.",
      "author": "thenewredditguy99",
      "created": 1637061699,
      "upvotes": 1,
      "replies": {}
    }
  }
}