{
  "sid": "qup6o2",
  "link": "/r/ApplyingToCollege/comments/qup6o2/seeking_ec_advice_csmathgeneral/",
  "title:": "Seeking EC Advice (CS/Math/General)",
  "text": "I'm a junior in High School and I have recently started exploring this and a few other college related subreddits. I have a really good grades and test scores, but I've noticed that a lot of people here have ridiculously impressive ECs. Mine however, are quite lacking in comparison, consisting of pretty much just volunteer hours, school clubs, and sports. I'm seeking advice on how to go about improving this. \n\nI have solid experience and knowledge about computers and programming, I've been doing it for years now. I've developed a variety of code projects, but I'm not sure how I could turn this into something I could mention. I've been thinking about looking for a local tech company to see about an internship, but haven't completely figured out how to go about that yet. \n\nI also excel in and thoroughly enjoy doing mathematics. I know there are competitions and such but am not sure how, if I even could, get involved in those.\n\nAny recommendations/advice would be greatly appreciated.",
  "author": "Professional_Rule_70",
  "created": 1637006976,
  "updated": 1637179691,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkrrtw1": {
      "link": "/r/ApplyingToCollege/comments/qup6o2/seeking_ec_advice_csmathgeneral/hkrrtw1/",
      "text": "It’s great that you’ve already got solid programming knowledge! Internships are always good but you could also be more creative and try to be impactful in your own way - what problems could you solve with your cs skills?",
      "author": "loserlake420",
      "created": 1637011955,
      "upvotes": 2,
      "replies": {
        "hkunb83": {
          "link": "/r/ApplyingToCollege/comments/qup6o2/seeking_ec_advice_csmathgeneral/hkunb83/",
          "text": "See that's where I struggle. I lack the creativity required to identify problems that need solved. However, I still have a decent amount of time to attempt to come up with some things. Thank you!",
          "author": "Professional_Rule_70",
          "created": 1637069590,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}