{
  "sid": "qlb9vr",
  "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/",
  "title:": "I messed up and forgot to waive FERPA rights :((",
  "text": "Basically I mistakenly didn't waive FERPA and invited my counselor. As I am an international applicant, my counselor already submitted the LOR without noticing that FERPA was not waived..Now I can't waive my FERPA. I haven't applied to any colleges yet..now is it possible if I request my counselor to unsubmit the form and he does that , then will I be able to waive my FERPA? Please provide me some help..I am basically having a panic attack rn :\"((",
  "author": "HeadConversation4236",
  "created": 1635879131,
  "updated": 1636151246,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj1qogj": {
      "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj1qogj/",
      "text": "Don’t think this is a big deal at all. It won’t impact your app.",
      "author": "GrantTheFixer",
      "created": 1635880515,
      "upvotes": -6,
      "replies": {
        "hj2b0sd": {
          "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj2b0sd/",
          "text": "I mean a lot of schools look at FERPA Status to see if your recommender’s thoughts about you are genuine and not swayed by you",
          "author": "Additional-Ad5553",
          "created": 1635888313,
          "upvotes": 1,
          "replies": {
            "hj2f3ay": {
              "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj2f3ay/",
              "text": "If you're going to be rejected it won't be because you didn't waive FERPA.  And that interpretation that schools look to the FERPA waiver specifically to determine whether the LoRs are genuine or swayed involves a LOT of assumptions that have to hold in order to then presume it's been biased.  Don't overthink it. Just make sure the next few applications are waived.",
              "author": "GrantTheFixer",
              "created": 1635889883,
              "upvotes": 1,
              "replies": {
                "hj2mlmo": {
                  "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj2mlmo/",
                  "text": "Hard disagree. At my school our counselors require us to waive FERPA because of an incident they had a while back where a kid got rejected from ALL the schools he applied to despite a stellar application. The head of counseling at our school reached out to all the schools he had applied to trying to figure out why this kid has gotten dunked on so that he could at least explain why the kid would have to spend the next year reapplying. The schools all had the same response \"so-and-so looked great at first and was in our likely admit pile. The issue was he hadn't waived ferpa rights and all his recommendations didn't mention a single negative thing about him. We  assumed he was trying to hide something or had pressured his teachers into holding something back when saw he hadn't waived ferpa rights so we were forced to reject him.\"",
                  "author": "collegestuff1235",
                  "created": 1635892881,
                  "upvotes": 1,
                  "replies": {
                    "hj2pwbd": {
                      "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj2pwbd/",
                      "text": "That's interesting. Thx for sharing. There's also the other perspective that HS teachers and counselors don't want their students to read their recs because it invariably could involve some less-than-stellar remarks and they could be 'blamed'.  It matters because HS's want to keep their alum, parents, donors, etc. happy and to avoid reasons to be blamed (sued, lose donations, etc.)\n\nRemember, FERPA gives you the right to view the rec letters AFTER you've gotten in, not before. That's the specifics of the regulation.\n\nAlso, if so many colleges are going to just outright assume the LoRs are tainted if FERPAs are not waived, then they should just simply require that letters be completely confidential or not be accepted. Your counselor could very well be using a scare tactic. I agree it's certainly safer to waive FERPA, but not waiving it is hardly the death knell.",
                      "author": "GrantTheFixer",
                      "created": 1635894240,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hj4r81v": {
      "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj4r81v/",
      "text": "Unfortunately, you can’t waive FERPA even if you ask your counselor to unsubmit the form now. Once something has ever been submitted, FERPA cannot be waived again. It happened to one of my friends so I know. \n\nHonestly, not waiving FERPA is a pretty big deal, especially for international students. It definitely will factor negatively into your admission decisions. \n\nMy best advice at this point is to create a totally new account altogether. Fill up all info on the new account and remember to waive the FERPA. Hopefully you haven’t submitted any applications yet.\n\nAnother less preferable option is to ask all your teachers and counselor to email each school’s admissions office, telling them that not waiving FERPA was an honest mistake on your part and everything they have submitted is truthful and uninfluenced. \n\nGood luck!",
      "author": "Ok_Cut4131",
      "created": 1635936038,
      "upvotes": 1,
      "replies": {
        "hj6s3k7": {
          "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj6s3k7/",
          "text": "thank you very much !! And yes I haven't submitted any application with my account..so it wouldn't be a problem if I create a new and remove all the information from the old one , right ?",
          "author": "HeadConversation4236",
          "created": 1635967665,
          "upvotes": 2,
          "replies": {
            "hj6x8qs": {
              "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj6x8qs/",
              "text": "Yup, not a problem. You can’t delete a common app account or delete info from it though, but that doesn’t matter, just make a new account.",
              "author": "Ok_Cut4131",
              "created": 1635969650,
              "upvotes": 1,
              "replies": {
                "hj72cjv": {
                  "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj72cjv/",
                  "text": ">delete info from it th\n\nbut I think it is possible to change the information or remove the existing info I put there(I mean all the sections of the dashboard) as I haven't submitted any application (I can still edit all the information of all the sections of my common app) So should I make them blank removing all of that infos ?",
                  "author": "HeadConversation4236",
                  "created": 1635971610,
                  "upvotes": 1,
                  "replies": {
                    "hj8r7l3": {
                      "link": "/r/ApplyingToCollege/comments/qlb9vr/i_messed_up_and_forgot_to_waive_ferpa_rights/hj8r7l3/",
                      "text": "You don have to do that. Since no one will see that application on that account anyway, it doesn’t matter if you delete the info or not",
                      "author": "Ok_Cut4131",
                      "created": 1635998584,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}