{
  "sid": "qd052k",
  "link": "/r/ApplyingToCollege/comments/qd052k/nyu_help/",
  "title:": "NYU Help",
  "text": "Does NYU consider demonstrates interest ?",
  "author": "SatvikK22",
  "created": 1634846562,
  "updated": 1634848688,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhj7876": {
      "link": "/r/ApplyingToCollege/comments/qd052k/nyu_help/hhj7876/",
      "text": "See bottom line of Section C7 of their CDS…\n\nhttps://www.nyu.edu/content/dam/nyu/institutionalResearch/documents/NYU\\_Common\\_Data\\_Set\\_2020-21.6.18.pdf",
      "author": "Strict-Special3607",
      "created": 1634846918,
      "upvotes": 1,
      "replies": {}
    },
    "hhj9fj8": {
      "link": "/r/ApplyingToCollege/comments/qd052k/nyu_help/hhj9fj8/",
      "text": "In the spring they invite people to join their waitlist and then ask you again in a couple of weeks if you want to stay on it and again 10 days later if you’d still want to come…. And they go through and offer the spots where you have 3 days to accept and then they move on to the next person…. It’s a process very much designed to increase the enrollment rate of people admitted and reduce the number of acceptances.\n\nI’m pretty sure they take people they think will likely come. And although their aid in general is not great they do offer full rides to the ones they really want, often those with near perfect test scores that raise the average and maybe boost them in the rankings.\n\nGuess I’m kind of cynical about that school. Both my kids got in and the programs were excellent- but when we crunched the numbers it just made no sense compared to our (admittedly great) state schools. And there are so very many student loan horror stories about NYU which I believe is among the worst for that. So if you get in, be sure you are one of the lucky folks for whom the school makes great financial sense.",
      "author": "RetiringTigerMom",
      "created": 1634847787,
      "upvotes": 1,
      "replies": {}
    }
  }
}