{
  "sid": "qqqrex",
  "link": "/r/ApplyingToCollege/comments/qqqrex/what_is_the_difference_between_cosmology_and/",
  "title:": "What Is The Difference Between Cosmology And Theoretical Physics?",
  "text": "I narrowed my major interests into what is related to physics and astronomy\nSpecifically speaking, theoretical aspects of them. \n\nAccording to my searches, Physical Cosmology has a lot to do with theoretical physics, and both of them are appealing to my passions. \nTo be a physicist, I need to major in Physics or Mathematics. Cosmology needs either these or an engineering field related to the topic like Aerospace engineering. \nAerospace of course has more job opportunities than Applied Physics. \nBut what if I misunderstood physical  cosmology and it isn't what I like? \n\n\nSo \nWhat is the difference, in details, between Physical Cosmology and Theoretical Physics?\n\nThank you",
  "author": "Gullible-Hunt4037",
  "created": 1636537374,
  "updated": 1636653052,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk2li1l": {
      "link": "/r/ApplyingToCollege/comments/qqqrex/what_is_the_difference_between_cosmology_and/hk2li1l/",
      "text": "Cosmology focuses on conditions in the early universe and how the universe has evolved. It doesn't usually include quantum mechanics. \n\n\nTheoretical physics focuses on calculations in modern fields like string theory, quantum gravity, quantum mechanics, and condensed matter (mostly involving subatomic physics).\nTheoretical physics will likely have less astronomy concepts than cosmology.",
      "author": "roguezebra",
      "created": 1636554923,
      "upvotes": 5,
      "replies": {
        "hk2yh7b": {
          "link": "/r/ApplyingToCollege/comments/qqqrex/what_is_the_difference_between_cosmology_and/hk2yh7b/",
          "text": "You don't know how this guides me in picking a college. Thank you",
          "author": "Gullible-Hunt4037",
          "created": 1636560261,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hk1wazl": {
      "link": "/r/ApplyingToCollege/comments/qqqrex/what_is_the_difference_between_cosmology_and/hk1wazl/",
      "text": "I think both are similar in some aspect but completely different in another. \n\nI haven't researched much into it but I am also interested in doing physics/ astrophysics in my undergrad. \n\nThat cosmology is more of a masters/ post grad thing.",
      "author": "starish69",
      "created": 1636540003,
      "upvotes": 2,
      "replies": {}
    }
  }
}