{
  "sid": "r46oxo",
  "link": "/r/ApplyingToCollege/comments/r46oxo/how_much_does_efc_impact_your_application/",
  "title:": "how much does efc impact your application?",
  "text": "for context i am a domestic student but i've applied to GT out of state. while i did file the fafsa and am applying for financial aid, my efc is in the 30k range. at gt my family will basically have to cover the cost but at other schools that are more pricey i should get fin aid. IDk i'm terribly confused about this part of the process.",
  "author": "none_oya",
  "created": 1638113100,
  "updated": 1638204704,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hmeq5fm": {
      "link": "/r/ApplyingToCollege/comments/r46oxo/how_much_does_efc_impact_your_application/hmeq5fm/",
      "text": "Depends on whether the school is need aware.\n\nIt doesn't make much sense for a school to accept someone who can’t afford to attend and who they can’t/won’t offer enough aid to make up the difference.\n\nAlso… don’t compare how much aid you get from schools; compare net cost after aid.  Some private school may offer you $25k off a $75k starting cost, but you can’t really compare that to what a state school may/may not offer you off a $50k starting cost.",
      "author": "Strict-Special3607",
      "created": 1638113298,
      "upvotes": 8,
      "replies": {}
    },
    "hmesfhf": {
      "link": "/r/ApplyingToCollege/comments/r46oxo/how_much_does_efc_impact_your_application/hmesfhf/",
      "text": "Out of state students pay 50k per year to attend Georgia Tech, no need-based aid. Check Georgia Tech's website to see whether they might have merit scholarship opportunities for out of state students, though I would also guess that they'd be very competitive, as GT is a highly selective school.\n\nSome general thoughts on paying for college:\r  \n*Public* universities tend to offer little to no *need-based* financial aid to out-of-state students and charge them more.\r  \nSome public universities offer large *merit scholarships* to out-of-state students.\r  \nSome *private* universities offer generous need-based financial aid; privates do not differentiate between in-state and out-of-state.\r  \nFirst see whether you are eligible for any *need-based* financial aid. Run the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. (Sometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions.) Federal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. Larger loans require a parent signature and are usually not reasonable amounts to borrow.\r  \nIf the *need-based* estimate does not make the college affordable for your family, then look for *merit scholarships*. ***Often, the best merit scholarships are offered by the colleges themselves***. Look for colleges that offer competitive merit scholarships according to their websites, where your scores and grades are over the 75th percentile for that college.\r  \nAlso look for colleges that offer big automatic merit scholarships to out-of-state students for your level of stats. Usually there will be a chart on their website with the levels of stats and scholarship amounts. Example: https://scholarships.ua.edu/freshman/out-of-state/; see also UAH, U Maine, U Kentucky, U Mississippi, U Arizona, Arizona State, Wyoming, UTD, etc. Then compare the scholarship amount to the out-of-state cost of attendance to see whether the scholarship would make the college affordable for your family.",
      "author": "elkrange",
      "created": 1638114331,
      "upvotes": 7,
      "replies": {}
    },
    "hmesg7j": {
      "link": "/r/ApplyingToCollege/comments/r46oxo/how_much_does_efc_impact_your_application/hmesg7j/",
      "text": "If they don't think you can easily afford to attend w/o them giving you a bunch of financial aid, *and* they're not willing to give you a bunch of financial aid since you're not in-state (which is the case for most state schools) then they may be less likely to admit you, since they conclude you won't be able to attend even if admitted.\n\nJust a hunch, but this might be *especially* true if you live in a state with a public option that's roughly comparable to Georgia Tech, or if your application is so strong that you have a credible chance of being admitted to a private school (on par with or more well-regarded than Georgia Tech) that awards generous financial aid.",
      "author": "jayphoward",
      "created": 1638114340,
      "upvotes": 2,
      "replies": {
        "hmf20b0": {
          "link": "/r/ApplyingToCollege/comments/r46oxo/how_much_does_efc_impact_your_application/hmf20b0/",
          "text": "oof terrified at this. there aren't any comparable schools where i live & i'd like to think i have a p competitive app for all t10s but i EAd to GT because I might have a shot of being considered for their merit scholarship.",
          "author": "none_oya",
          "created": 1638118460,
          "upvotes": 1,
          "replies": {
            "hmf5drq": {
              "link": "/r/ApplyingToCollege/comments/r46oxo/how_much_does_efc_impact_your_application/hmf5drq/",
              "text": "If your application is so strong that you're a strong candidate for their full-COA scholarship then what I wrote probably doesn't apply.",
              "author": "jayphoward",
              "created": 1638119875,
              "upvotes": 2,
              "replies": {
                "hmfl9lr": {
                  "link": "/r/ApplyingToCollege/comments/r46oxo/how_much_does_efc_impact_your_application/hmfl9lr/",
                  "text": "at this point idk if i'm a strong applicant or not anymore but i really appreciate your help",
                  "author": "none_oya",
                  "created": 1638126212,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmg32uk": {
      "link": "/r/ApplyingToCollege/comments/r46oxo/how_much_does_efc_impact_your_application/hmg32uk/",
      "text": "Look at Section H (Financial Aid) of the Common Data Set for the school to get an idea of the amount of aid typically offered for need based and non-need based students.\n\nAnother good resource is the College Navigator from the National Center for Education Statistics. \n\nhttps://nces.ed.gov/collegenavigator/\n\nI'm not sure how each of those differentiate between in-state and out-of-state students.",
      "author": "Calvin-Snoopy",
      "created": 1638133304,
      "upvotes": 1,
      "replies": {}
    }
  }
}