{
  "sid": "qyoj9j",
  "link": "/r/ApplyingToCollege/comments/qyoj9j/financial_discussions/",
  "title:": "Financial Discussions",
  "text": "I'm going to US for the spring 2022 session. But I'm still confused about the part time job criterias. I know as a F1 visa holder we can't do off campus jobs for the first academic year. I wanted to know if there is a way if I can do off campus jobs that are NOT RELATED TO MY MAJOR starting from my Sophomore year for my living expenses. Can I ask my DSO for it?! Please help!!!",
  "author": "Ok_Teacher_3106",
  "created": 1637474479,
  "updated": 1637688072,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlh9wex": {
      "link": "/r/ApplyingToCollege/comments/qyoj9j/financial_discussions/hlh9wex/",
      "text": "As an international student, you can only work up to 20 hours a week on campus while the school is in session. During the summer, you can work up to 40 hours a week off campus, but the OPT should be approved by your university.",
      "author": "prsehgal",
      "created": 1637475030,
      "upvotes": 3,
      "replies": {
        "hlha28q": {
          "link": "/r/ApplyingToCollege/comments/qyoj9j/financial_discussions/hlha28q/",
          "text": "What about off campus jobs in the 2nd academic year? Can I request ny uni's international office for permit of off campus jobs that are NOT according to my Major subject?",
          "author": "Ok_Teacher_3106",
          "created": 1637475141,
          "upvotes": 1,
          "replies": {
            "hlha7uj": {
              "link": "/r/ApplyingToCollege/comments/qyoj9j/financial_discussions/hlha7uj/",
              "text": "As I said earlier, you can't work off campus while the school is in session. During the breaks, they might allow you to work in fields related to other majors, but that depends on them.",
              "author": "prsehgal",
              "created": 1637475250,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlhagut": {
      "link": "/r/ApplyingToCollege/comments/qyoj9j/financial_discussions/hlhagut/",
      "text": "For an off-campus job that isn’t related to your major (ie not OPT/CPT eligible), you would most likely need to find an employer willing to sponsor a work visa for you….which is incredibly difficult, especially if you’re just thinking of something like working at Target to make pocket money. Your best bet for finding employment as an intl will be 1) find on-campus jobs 2) find internships that don’t require US work authorization that your college will give a grant/stipend for 3) find internships that you can use your CPT for",
      "author": "rainingsiberiancats",
      "created": 1637475430,
      "upvotes": 1,
      "replies": {}
    }
  }
}