{
  "sid": "qbnhkq",
  "link": "/r/ApplyingToCollege/comments/qbnhkq/major_on_why_us_essay/",
  "title:": "Major on why us essay?",
  "text": "Hey Guys. So I had a quick question. I am writing my why us essay for Columbia. I am engineering major so I already had to write an essay kind of explaining the origins of my interest in engineering and kind of a prospect into what I want to do in the future. In this engineering essay, I mention Columbia at the end (saying that it will provide the way for me to fulfill my goals something like that.) But nothing specific like a class or a research project or professor or anything of the sort. I am drafting my why us essay and I kind of want to apply it to my interest in music. Meaning talking about music and how Columbia will help me develop this interest. I was wondering if you guys think that this would be a good approach to take. I normally speak about my major in any of the other why us essays, but I don’t want to be redundant as to why I would want to take some engineering opportunities in Columbia. Should I mention my major or do you guys think that doesn’t matter",
  "author": "gabrielacosenza04",
  "created": 1634685174,
  "updated": 1634749620,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "hhaos0n": {
      "link": "/r/ApplyingToCollege/comments/qbnhkq/major_on_why_us_essay/hhaos0n/",
      "text": "Unless Columbia has a Why Major essay, it might not be a bad idea to add a few lines about your intended major and how the university fits into the plan in the Why Us essay.",
      "author": "prsehgal",
      "created": 1634686037,
      "upvotes": 4,
      "replies": {
        "hhaoyah": {
          "link": "/r/ApplyingToCollege/comments/qbnhkq/major_on_why_us_essay/hhaoyah/",
          "text": "Oh, yeah that’s what I tried to say. Columbia has a why  are you interested in engineering. Not at Columbia specifically, but I did add that small part I said at the end.",
          "author": "gabrielacosenza04",
          "created": 1634686118,
          "upvotes": 5,
          "replies": {
            "hhapbtq": {
              "link": "/r/ApplyingToCollege/comments/qbnhkq/major_on_why_us_essay/hhapbtq/",
              "text": "You should be fine then.",
              "author": "prsehgal",
              "created": 1634686288,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    }
  }
}