{
  "sid": "q5w1qy",
  "link": "/r/ApplyingToCollege/comments/q5w1qy/pick_one_emory_or_gatech/",
  "title:": "Pick one: Emory or GATech",
  "text": "I'm narrowing down my 5 financial safety schools to put on my FAFSA (If I get accepted I would get a full-ride scholarship through GA's ZellMiller program). I can't quite decide between the 2. I would be going there to study International Affairs, culture, linguistics, stuff along that line.",
  "author": "morbidfanatic",
  "created": 1633959500,
  "updated": 1637360228,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hg87vq5": {
      "link": "/r/ApplyingToCollege/comments/q5w1qy/pick_one_emory_or_gatech/hg87vq5/",
      "text": "Isn't Emory need-blind and meets 100% of demonstrated need anyway?",
      "author": "Apprehensive-Math240",
      "created": 1633960146,
      "upvotes": 4,
      "replies": {}
    },
    "hg8y7vq": {
      "link": "/r/ApplyingToCollege/comments/q5w1qy/pick_one_emory_or_gatech/hg8y7vq/",
      "text": "Be warned, full-ride scholarship through Zell Miller doesn't mean that exactly. I don't know your family's financial situation, but let's just say you don't receive need-based financial aid:\n\n* Zell Miller will cover tuition costs at Georgia Tech. That means you still pay for housing, meal plans, miscellaneous costs, etc. Final cost at tech with no other merit scholarships and no need-based aid factored in (and tech is public so need-based is always iffy) is about 26,000 per year. \n* Zell miller actually does apply to Emory/private GA schools, just not fully. You'd get about 10,000 a year from Zell and another 1000 from a Georgia grant for private schools. Final costs without other merit scholars and need-based aid is about 65,000 a year. Need based aid is either amazing or it sucks, depending on your family's financial situation. They're very generous with low-income aid (maybe consider QB too), but if you're middle-class/upper-middle class, expect little (or more likely no) need-based aid. \n\nI'm going to be honest, if you're thinking about International affairs/culture/linguistics, I'm not sure why you would pick GT since it really is very STEM heavy. GT excels in STEM, esp. engineering, and their bschool has good entrepreneurship/tech related fields. Emory is good at traditional STEM and business (bio/premed/nursing, consulting, finance) and has a very strong humanities/liberal arts focus. Emory fits better with what you said you wanted to go into, but if you're looking for a *financial safety* school, I would look into UGA honestly. Good at the fields you're looking at, way cheaper (probably 16,000 a year with Zell), and in general a great school.",
      "author": "Own_Bookkeeper574",
      "created": 1633971517,
      "upvotes": 6,
      "replies": {}
    },
    "hg8v69v": {
      "link": "/r/ApplyingToCollege/comments/q5w1qy/pick_one_emory_or_gatech/hg8v69v/",
      "text": "You would need to get into Emory first and foremost. And Emory is private so Zell miller does not apply there. So you should go with Tech since it's easier to get into and you get the zell/instate tuition. However it seems like both schools arent near your top choices so you don't have to push and apply to either one of you don't want to.",
      "author": "91210toATL",
      "created": 1633970272,
      "upvotes": -1,
      "replies": {
        "hkh0ng3": {
          "link": "/r/ApplyingToCollege/comments/q5w1qy/pick_one_emory_or_gatech/hkh0ng3/",
          "text": "You get about 5k a semester from Zell, so it does apply!",
          "author": "trinityclub246",
          "created": 1636821449,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}