{
  "sid": "qf1vzz",
  "link": "/r/ApplyingToCollege/comments/qf1vzz/i_have_zero_academic_or_athletic_achievements_and/",
  "title:": "I have zero academic or athletic achievements and a 3.4 GPA. I’m undecided as to whether I should apply for the spring semester or just hold off until the fall. Can I get some advice?",
  "text": "The deadline for the college I’m hoping to get into (Texas State) is November 15 and once admissions are closed for the semester, they won’t be open again until late summer for the Fall 2022 semester.\n\nI have yet to take my SAT or ACT and while I would prefer to the take the ACT, the next testing date isn’t until November 30. There are, however, upcoming testing dates for the SAT, but I’m reluctant to take it given that— for whatever reason—I got a significantly better score on the ACT practice test than I did on the SAT practice test. I know it can’t hurt to try and that I can always retake it but I’d like more than just a satisfactory score as I’m really hoping to win a scholarship. Furthermore, I feel like no matter how much I study, I just can’t seem to grasp the concepts / formulas in regards to the math section. \n\nI have zero academic or athletic achievements and a 3.4 GPA so even with a poor SAT score, I’d imagine my chances of being accepted are rather slim. \n\nWhat should I do? Should I just take the SAT and submit it so long as I get a satisfactory score or would it be best if I just held off on all of this until the Fall?\n\nI’d like to add that applying to other colleges would be my last choice as I’m reluctant to relocate and Texas State is the only college within driving distance (all others are at least 30 minutes away, and even that’s on a good day). I’m unsure if this makes any difference but their acceptance rate is 81% and their ‘typical’ SAT scores are 510-600 for reading & writing and 500-580 for math.",
  "author": "daisykeeks",
  "created": 1635111605,
  "updated": 1635182386,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "hhx85ty": {
      "link": "/r/ApplyingToCollege/comments/qf1vzz/i_have_zero_academic_or_athletic_achievements_and/hhx85ty/",
      "text": "They are test-optional and their average gpa is 3.34. You should be able to get in",
      "author": "moonriver252",
      "created": 1635117522,
      "upvotes": 3,
      "replies": {}
    },
    "hhyb3pp": {
      "link": "/r/ApplyingToCollege/comments/qf1vzz/i_have_zero_academic_or_athletic_achievements_and/hhyb3pp/",
      "text": "You can get in man i believe in u and take the SAT submit if u get a good score",
      "author": "Asleep_Course_7162",
      "created": 1635138773,
      "upvotes": 3,
      "replies": {}
    },
    "hhywt4f": {
      "link": "/r/ApplyingToCollege/comments/qf1vzz/i_have_zero_academic_or_athletic_achievements_and/hhywt4f/",
      "text": "Are you in San Marcos ? What's ur class rank rn? If u can get a certain sat score u would have assured admission. Also if u were to hold off until fall that would give you a LOT of time to get ur sat scores up. Like 5 months time. You are above average for the average GPA admissions.",
      "author": "Dirsi",
      "created": 1635157175,
      "upvotes": 1,
      "replies": {}
    }
  }
}