{
  "sid": "qwx1cg",
  "link": "/r/ApplyingToCollege/comments/qwx1cg/i_need_your_help/",
  "title:": "I need your help!",
  "text": "Hey there\n\nLong story short, I've encountered some difficulties while helping my counselor with her CommonApp, and I would appreciate it if you share with me some wisdom.\n\n1. *\"Please indicate number of official transcripts you can provide for the applicant?\"* (Applicant is me). The options are 1-4. What is the best choice? Cause my counselor can provide a transcript for each quarter of each year...\n2. *\"Do you complete applicants' academic ratings on the Common App school report?\"* I can't comprehend this one at all. What does it mean? That the school report will contain comparison of students with each other? Is the way of answering this question change anything? If you need more info about my school to understand how I should answer this question, I'll gladly answer anything!\n3. *\"Graduation Date\"* It's located in the profile of my counselor. So it asks the graduation date of my counselor, right? Or whose?\n4. *\"Graduating class size\"* The thing is, I'm not a US student, so the classes format works differently. We have the same people in our classroom from the very first grade. The number of people is 50(yeah, it's a lot). Does it mean that the answer for the abovementioned question is 50?\n5. *\"COVID essay for counselor\"* The point of this essay is to explain changes in an educational process. But I don't think that our school during COVID-19 experienced something worth explaining. Should I ask my counselor to write anything here?\n\nThe first question is located in the \"Students\" section of the counselor profile. All others are in the main(\"Profile\") section of it.\n\nHere's a link to make it easier for you to visualize and respond - [Images on Imgur](https://imgur.com/a/t1y9nuf)\n\n**Important note:** I, by no means, control the school side of the application process. The situation is that nor my counselor, nor any other administration staff knows English or even the algorithm of the application process, so I have to help my counselor with the process. Translating and explaining only.\n\nI appreciate every attempt of helping me, thank you!",
  "author": "Chiller-bro",
  "created": 1637262438,
  "updated": 1637353068,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hl64muk": {
      "link": "/r/ApplyingToCollege/comments/qwx1cg/i_need_your_help/hl64muk/",
      "text": "1. some schools don’t allow students to request multiple official transcripts, but it seems like you are able to provide up to 4.\n\n2. Yes. There will be questions about you that your counselor has to fill out in the section where they submit the school report.\n\n3. Your (the student’s) graduation date. The date on which the graduating class graduates.\n\n4. It is the number of people in your school that will be graduating the same year as you. The total number of what are called “seniors” in the US. 50 is not a lot, class sizes in the use can be in the high hundreds.\n\n5. If there are no changes that fall under the listed bullet points then leaving it blank is fine. If covid affected you personally you should write that in your personal application. This section is just for policies changed for your entire graduating class.",
      "author": "sc-um-arleth",
      "created": 1637269688,
      "upvotes": 3,
      "replies": {
        "hl64nv9": {
          "link": "/r/ApplyingToCollege/comments/qwx1cg/i_need_your_help/hl64nv9/",
          "text": "All the numbers in your comment added up to 69. Congrats!\n\n    1 +\n    4 +\n    2 +\n    3 +\n    4 +\n    50 +\n    5 +\n    = 69.0",
          "author": "LuckyNumber-Bot",
          "created": 1637269700,
          "upvotes": 7,
          "replies": {}
        },
        "hl7scun": {
          "link": "/r/ApplyingToCollege/comments/qwx1cg/i_need_your_help/hl7scun/",
          "text": "Thank you so much!",
          "author": "Chiller-bro",
          "created": 1637296407,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}