{
  "sid": "q52e8g",
  "link": "/r/ApplyingToCollege/comments/q52e8g/thats_how_we_prepare_for_college_in_india/",
  "title:": "That's how we prepare for College in India",
  "text": "2-3 years, just studies, NOTHING ELSE\nhttps://www.reddit.com/r/IndiaSpeaks/comments/q4j283/no_hate_to_the_guy_in_the_video_but_this/?utm_medium=android_app&utm_source=share",
  "author": "aakshatn2103",
  "created": 1633846271,
  "updated": 1634074038,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hg4endc": {
      "link": "/r/ApplyingToCollege/comments/q52e8g/thats_how_we_prepare_for_college_in_india/hg4endc/",
      "text": "Ah gotta love the daily dose of \"wE InDiAnS HaVe iT So hArD!!!\" posts on r/a2c",
      "author": "seventyfivezebras",
      "created": 1633884982,
      "upvotes": 3,
      "replies": {}
    },
    "hg2utp4": {
      "link": "/r/ApplyingToCollege/comments/q52e8g/thats_how_we_prepare_for_college_in_india/hg2utp4/",
      "text": "This is clearly a top student, or the top student as everyone is coming around to give him applause, He worked much harder than the rest of them and definitely deserves what he gets.\n\nIf the 2-3 years thing was true for all Indians or even the top 25% Indian teens wouldn't have such a big presence on Reddit.\n\nI apologize if this comes of as condescending but we have a major rat race problem here in the US too.",
      "author": "Berkeley_Simp",
      "created": 1633851030,
      "upvotes": 0,
      "replies": {
        "hg2zlyp": {
          "link": "/r/ApplyingToCollege/comments/q52e8g/thats_how_we_prepare_for_college_in_india/hg2zlyp/",
          "text": "I'm sorry, but you're completely wrong here. Everyone, LITERALLY everyone around me is this guy. My freshman and sophomore year, I was this guy. Spending 6 hours in school and straight to a coaching centre for the next 5 hours, and then again self study for like 3-4 hours. Took me too long to realise how fucked up this is. The teens who have a big presence on reddit are not considered top 25% in India. The teens who leave their homes at 13-14 years of age, live in hostels for their whole high school life, under EXTREMELY shitty living conditions, studying and cramming 24/7, they're India's top 25%.\n\n\nNow this might sound condescending, but US kids have no idea, I repeat, NO IDEA, of the pressure or work load that Indian kids go through. Like bruh... For more than the half of you, your state safeties give better education than our top colleges which we're wasting away our high school years for.\n\n\nP.S. You mentioned that this guy must be a top student cuz he is getting an applause from everyone. That's because, my friend, in the end, even studying 14 hours per day for 4 years is not enough. When literally everyone is doing it, the advantage once again goes to those with a greater mental ability and a greater affinity to advanced STEM topics. This is why our education system is fucked up and extremely unfair.",
          "author": "Concerned-gay-guy",
          "created": 1633854970,
          "upvotes": 5,
          "replies": {
            "hg3vaye": {
              "link": "/r/ApplyingToCollege/comments/q52e8g/thats_how_we_prepare_for_college_in_india/hg3vaye/",
              "text": "Exactly.I mean, just look the population of children and the number of colleges",
              "author": "the_card_dealer",
              "created": 1633876334,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hg2uxtt": {
          "link": "/r/ApplyingToCollege/comments/q52e8g/thats_how_we_prepare_for_college_in_india/hg2uxtt/",
          "text": "No dude, this is how many people give the Joint entrance exam in india.\nAnd yes I do understand the rat race of US too",
          "author": "aakshatn2103",
          "created": 1633851123,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}