{
  "sid": "qm6f31",
  "link": "/r/ApplyingToCollege/comments/qm6f31/30_yo_trying_to_apply_to_ucf_after_dropping_out/",
  "title:": "30 yo trying to apply to UCF after dropping out of college when I was 18. Will there be any issues?",
  "text": "When I was 18 I attended Northern Illinois University, however, due to family and financial issues I ended up dropping out during the first semester. \n\nFast forward to now, I am a 30 year old Analyst for a fairly large company making good wages, but since I lack a degree there is a limit to how high I can go. I now live in Florida and would like to apply to UF Online to work toward a Business Administration degree to assist with my career. But on their admissions site it says previous college GPAs of less than 2.0 will make it impossible to join, as well as that their average admittance requires at least a 3.7 gpa. \n\nWill it be a problem that I dropped out over a decade ago? Or will they not look into that if I don't send those transcripts?\n\nAlso, when I was in high school I scored a 28 Average on the ACT and my scores are way above their minimums for that test, but my GPA was something like 3.2.\n\nI just want to make sure I am not wasting my time and money by applying. Any advice from anyone who has gone through something similar would be appreciated.",
  "author": "Hoosteen_juju003",
  "created": 1635979630,
  "updated": 1636136267,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "hj7pou5": {
      "link": "/r/ApplyingToCollege/comments/qm6f31/30_yo_trying_to_apply_to_ucf_after_dropping_out/hj7pou5/",
      "text": "You mention both UCF and UF in your post, those are 2 different schools. UF has much higher standards for transferring, and admission in general. Also you may not even be a transfer if you never even completed one semester.\n\nI believe you’d have an easier chance with UCF but you never know, I would definitely call admissions and speak with a counselor at both schools and explain your situation since it’s unique. They will have much better advice. Good luck and good for you for going back after all this time!",
      "author": "Zippygirl123",
      "created": 1635981064,
      "upvotes": 3,
      "replies": {
        "hj7rlmg": {
          "link": "/r/ApplyingToCollege/comments/qm6f31/30_yo_trying_to_apply_to_ucf_after_dropping_out/hj7rlmg/",
          "text": "I meant UF. I put the C in the title on accident. Thank you for the advice!",
          "author": "Hoosteen_juju003",
          "created": 1635981896,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj7uw7c": {
      "link": "/r/ApplyingToCollege/comments/qm6f31/30_yo_trying_to_apply_to_ucf_after_dropping_out/hj7uw7c/",
      "text": "You will have to submit transcripts from all higher education institutions, no matter how long ago you attended.  It is really all about your story, so it is worth talking with Admissions to see what they need from you.  Then, make sure you have a compelling application. Transfer applications are more competitive than Freshman applications, in most cases. Good luck.",
      "author": "compassacademics",
      "created": 1635983345,
      "upvotes": 2,
      "replies": {}
    },
    "hj7otma": {
      "link": "/r/ApplyingToCollege/comments/qm6f31/30_yo_trying_to_apply_to_ucf_after_dropping_out/hj7otma/",
      "text": "Try also r/Transfers r/Transferstudents",
      "author": "roguezebra",
      "created": 1635980677,
      "upvotes": 1,
      "replies": {}
    }
  }
}