{
  "sid": "qivn47",
  "link": "/r/ApplyingToCollege/comments/qivn47/the_colleges_i_plan_on_applying_to_do_not_offer/",
  "title:": "The college(s) I plan on applying to do not offer online degrees, but I’m not able to attend campus. The college offers online classes—should I try applying anyway?",
  "text": "I am planning on transferring to a university next fall after I get my associate degree from community college. I currently live too far away from any university to commute, let alone to any of the ones I’m considering. \n\nDue to my disability I am not able to live alone or in a dorm and my circumstances have recently changed so that I’m no longer able to move closer to a campus. No problem, I prefer online classes anyway; however, the schools I’m looking to apply to do not award online bachelor’s degrees. They do offer online courses for credit, though.\n\nMy question is this: is it at all worth it to apply anyway and see if an accommodation can be made later on, once accepted? I say this because I’ve heard universities are flexible with their policies despite presenting themselves as otherwise. The schools on the top of my list have acceptance rates between 12 and 16% but I have outstanding academic performance and plenty of unique extracurricular experience. If I were able to move to a campus I’d be fairly confident in my ability to get in. I’m hesitant to apply because I don’t want to spend time and money on an application only to be told I have to be on campus in order to attend, regardless of their online courses. Is there any chance I could at least start in an undergraduate program at one of these schools, since they offer fully online courses for credit? Or would it be best to explore another option that guarantees an online degree? I have one in mind, I’d simply prefer something with an even better program.",
  "author": "ruintheworld",
  "created": 1635575486,
  "updated": 1635779234,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "himcdj9": {
      "link": "/r/ApplyingToCollege/comments/qivn47/the_colleges_i_plan_on_applying_to_do_not_offer/himcdj9/",
      "text": "You should contact the schools and ask them that now and not when you get accepted, because if that's not an option, you might not be able to find a good fit otherwise (most top schools release decisions in March or April but you can apply only until early to mid January)",
      "author": "Apprehensive-Math240",
      "created": 1635581800,
      "upvotes": 2,
      "replies": {
        "hinmq7h": {
          "link": "/r/ApplyingToCollege/comments/qivn47/the_colleges_i_plan_on_applying_to_do_not_offer/hinmq7h/",
          "text": "I’m going to apply to at least one college that guarantees a fully-online program by then. Their deadline is in July. I’m worried about asking my preferred schools first without providing an application they’ll consider—won’t they just say no and move on?",
          "author": "ruintheworld",
          "created": 1635609720,
          "upvotes": 1,
          "replies": {
            "hinp49c": {
              "link": "/r/ApplyingToCollege/comments/qivn47/the_colleges_i_plan_on_applying_to_do_not_offer/hinp49c/",
              "text": "You don’t have to ask with your main email. Just create a fake one if you’re worried",
              "author": "Apprehensive-Math240",
              "created": 1635610741,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}