{
  "sid": "cikoiv",
  "link": "/r/CollegeMajors/comments/cikoiv/conflicted_with_major/",
  "title:": "Conflicted with major",
  "text": "Hey reddit so currently I’m a upcoming freshman with  biology as my major on a pre-dentistry track. What I really want to be is a medical examiner/coroner. I was thinking of changing my major to forensic science with a concentration in biology and on a pre-med track. Hopefully with this and a good gpa and mcat\nscore I can get into med school.\n\nWhat I’m conflicted about is if I should get a biology degree instead of a forensic science degree. I spent the last two hours researching the web and many recommend getting a biology degree because there will be more options in jobs than a forensic science degree. I just need some more advice and opinions in what I should pursure.",
  "author": "AznZeus672",
  "created": 1564250381,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "ev6xkoq": {
      "link": "/r/CollegeMajors/comments/cikoiv/conflicted_with_major/ev6xkoq/",
      "text": "I'd recommend going for the more general approach. Grad school is a better time for looking into specializations. It would especially be useful to you since Coroner is an elected position in many places. It is always good to hedge your bets. You can always stay on the pre-med track and continue into medicine even if the coroner/medical examiner position doesn't become immediately available.",
      "author": "jupchurch97",
      "created": 1564252601,
      "upvotes": 3,
      "replies": {
        "ev795xj": {
          "link": "/r/CollegeMajors/comments/cikoiv/conflicted_with_major/ev795xj/",
          "text": "So if I were to change to forensic science and get my bachelors, if I don’t get into med school, going to grad school to get my masters and maybe doctorate would be the best option?",
          "author": "AznZeus672",
          "created": 1564256809,
          "upvotes": 1,
          "replies": {
            "ev79hdj": {
              "link": "/r/CollegeMajors/comments/cikoiv/conflicted_with_major/ev79hdj/",
              "text": "That all depends on your goals. I've known people to leave with their bachelors and find work in fields they never knew possible with their degree. Does your university have a career development office you could visit?",
              "author": "jupchurch97",
              "created": 1564256927,
              "upvotes": 1,
              "replies": {
                "ev7efe9": {
                  "link": "/r/CollegeMajors/comments/cikoiv/conflicted_with_major/ev7efe9/",
                  "text": "Yes I’m pretty sure, I’m planning on visiting with my advisors as soon as classes starts so I can talk about this.",
                  "author": "AznZeus672",
                  "created": 1564258692,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634059191
}