{
  "sid": "r3199t",
  "link": "/r/CollegeMajors/comments/r3199t/undecided_and_stressed/",
  "title:": "Undecided and stressed",
  "text": "Hello, all.\n\nI’m currently a sophomore in college and I’m trying to decide on what to do with my life. I was in engineering last year but the combination of Calc and chem killed my mental health, plus I realized I kinda hated my classes, so hard STEM is out. \n\nNow I’m trying to figure out what to do next. I’ve been interested in social sciences, especially psychology for some time now. But truthfully I don’t want to be in school forever, and the salary prospects of social science degrees aren’t exactly the most appealing… I guess I’m also somewhat interested in business, but I don’t have enough experience to really say.\n\nI considered going into foreign relations because I think I could be good at it and I’m already fluent in Mandarin. I heard it’s really hard to get a job but I guess the job itself seems cool enough. I’ve also been considering project management and product management/UX on the more business-y side of things, but I’m note sure what degrees would be best.\n\nShould I do economics or is that too broad? \n\nAny help would be appreciated. Thanks!",
  "author": "lilacsorcerer",
  "created": 1637974404,
  "updated": 1639867375,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmrk554": {
      "link": "/r/CollegeMajors/comments/r3199t/undecided_and_stressed/hmrk554/",
      "text": "With Economics you can work anywhere you want, including international relations. I suggest double majoring though (Political Science or something like that). The good thing about Econ is that if you don’t like one area, you’ll always have a backup plan because it really can be useful in any industry. \n\nHowever, I totally recommend taking as much quantitative classes as you can in your undergrad. Data/coding is the future of any career prospect that will pay well.",
      "author": "MMSK_",
      "created": 1638338564,
      "upvotes": 1,
      "replies": {}
    }
  }
}