{
  "sid": "i9o66q",
  "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/",
  "title:": "Don’t Know What to Major In?",
  "text": "I don’t know what to Major in. I already know I want to be in the law, politics, crime, government, and possibly education field. I really want to become a lawyer, but I’m also interested in becoming a superintendent, working in a gov department, becoming some kind of detective/agent, forensic psychologist, legislator, and possibly some kind of manager (ex: Human Resources manager)\n\nI just have no idea what to Major in. I love debating, politics and history as well. I was considering majoring in history, but I’m not sure if there would be a better choice. I’m so stuck that I’m even considering double majoring. Any suggestions? I’m not really into STEM degrees. The only kind of STEM I like I science, but only certain kinds",
  "author": "OkFondant0",
  "created": 1597419413,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "g1hxa7x": {
      "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1hxa7x/",
      "text": "Criminal Defense Lawyer. Quite a challenge considering you are going up against prosecutors and cops that just want to put another person in prison whether innocent or guilty.",
      "author": "Cheran_Or_Bust",
      "created": 1597447112,
      "upvotes": 1,
      "replies": {
        "g1i5qqj": {
          "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1i5qqj/",
          "text": "That’s not a major. And no way!! Lmao. That’s one of the most fatal types of law to go into!",
          "author": "OkFondant0",
          "created": 1597451718,
          "upvotes": 1,
          "replies": {
            "g1m9di6": {
              "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1m9di6/",
              "text": "I was talking about what you should be as far is a job, which would require pre-law or something related. Some lawyers major in history even as undergrads.",
              "author": "Cheran_Or_Bust",
              "created": 1597511176,
              "upvotes": 1,
              "replies": {
                "g1mta4i": {
                  "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1mta4i/",
                  "text": "I know, but I’m not so worried about the kind of lawyer right now. More of the undergrad. I was choosing history, but I’m just so torn",
                  "author": "OkFondant0",
                  "created": 1597517344,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g1haenv": {
      "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1haenv/",
      "text": "I would say maybe a double major in Poli. Sci. and History. This gives you a good foundation in both subjects, and can help you get into law school or get a master's. If you go for a program which offers teaching certification, that can help if you decide to pursue education administration. If you are really interested in Mental Health, then add a Psych major on, but doing a triple major requires more work depending on the school, so be advised if you do a triple major in Poli. Sci., History, and Psych, it will probably be harder than just doing Poli. Sci. and History.\n\nPoli. Sci. and History are your best bets due to the foundation for law school, for education, and a lot of the jobs such as detective, legislator, and such you're looking for. Something like a manager in HR or something else is really built on experience, but having a Bachelor's can really help you there.\n\nOverall I'd say look into double BA/BS in Poli. Sci. and History, maybe add on Psych if you're really interested in pursuing mental health. Getting into law, or higher up education or government, that's where the master's degrees come in, so you don't have to worry about that for now.\n\nAlso wanted to add on, that criminal justice is something to look into due to your crime and law interests, but that might be better as a minor, as Poli. Sci. opens up a lot of opportunities that criminal justice does.",
      "author": "kaimamaster1315",
      "created": 1597435873,
      "upvotes": 2,
      "replies": {
        "g1i5dol": {
          "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1i5dol/",
          "text": "Can I message you with more questions?\n\nWhat does it take to get the teaching certification? I know you can get it with a history degree, but I’m just not sure how much time it takes, or what it takes. \n\nCan you seriously triple major? I was considering psychology because of the forensic psychologist, and possibly working in mental health, but I wasn’t sure how good a psychology degree would be? I also plan on working during college because I’ll most likely be living in my own and paying my own bills, so I’m not sure if a triple major would be too much?\n\nRight after I get my bachelor’s degree, I plan on pursuing my JD. So, the only way I’m honestly getting the masters is if I somehow don’t get accepted into law school. Which is a possibility.\n\nI was considering CJ, but I wasn’t sure if it was that good of a choice.",
          "author": "OkFondant0",
          "created": 1597451512,
          "upvotes": 1,
          "replies": {
            "g1ie9u3": {
              "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1ie9u3/",
              "text": "Of course you can message me with more questions. I should be able to answer some. Be advised I'm only in HS, but I've done my research and know people in these industries, so I should be able to help out a bit.\n\nTeaching certification varies from state to state, but most of the time you get an undergraduate in a subject major plus a Teacher Prep program, which takes 4 years. Some schools offer a master's degree in just 5 years with a bachelor's but most of the time you get an undergrad, and you're good. What grades you can teach varies state to state, but you'll only be doing middle school and up, unless you get an elementary ed degree.\n\nTriple majors are possible depending on the school. Most schools offer them but some have max amounts of credits, so look into academic policies. Triple majors can be hard depending on curriculum and school, as more programs equals more work, and that can be much more intensive depending on each program and each school. It generally requires more dedication and effort, but if you are devoted, it can open up more opportunities. I would say Poli. Sci./History with Teacher Cert. would be best, but if you are really passionate about Psychology go for it. Psych is very research-oriented and you need a master's degree to get anywhere in the field, so be advised.\n\nCJ is good if you're going into more law enforcement or criminal justice based things. If you're looking more political than go for Poli. Sci. I would say CJ is going to limit your options more, but it is viable if you are really set on law enforcement or criminal fields.\n\nAlso, remember minors are an option, and are good if you're interested in something a little bit. Like going for Poli. Sci. major with CJ minor would be good down the road. But, minors aren't going to get you any jobs alone, like if you do a Poli. Sci. major with Psych minor, you're not going to get into Master's in Psych programs. Minors are good for hobbies or for adding additional stuff to strengthen alongside a major.",
              "author": "kaimamaster1315",
              "created": 1597456583,
              "upvotes": 2,
              "replies": {
                "g1ievv8": {
                  "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1ievv8/",
                  "text": "Okay, I’m going to message you now!",
                  "author": "OkFondant0",
                  "created": 1597456938,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g1ghbuv": {
      "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1ghbuv/",
      "text": "Like med school getting into a good law program isn't guaranteed so I would always encourage people to major in something that you can \"fall back on\" if your plans don't come to fruition. History is a fun degree, but is it worth four years of your life and possible debt if being a lawyer doesn't pan out? If you had to walk away from education after your four years would you be satisfied with just a BA in History?\n\nPersonally I'd recommend dong a major in Accounting, get CPA certified, and then minor in something fun like History. And as long as you can do basic trig and algebra you have already surpassed the highest math needed for accounting.",
      "author": "Reav101",
      "created": 1597423051,
      "upvotes": 1,
      "replies": {
        "g1gi0in": {
          "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1gi0in/",
          "text": "Ya, I know it’s possible to not get into law school. I am being realistic about that, that’s why I’m trying to find a degree that can fit in with some of my other career interests. \n\nAccounting. Bleh. I would DIE. Boring. I’m sorry, but I’m not gonna go for a job I hate just for the money. I also hate math. I know accounting technically isn’t considered stem, but no. I want a job I like that makes a decent amount of money. Which I KNOW I can get.",
          "author": "OkFondant0",
          "created": 1597423349,
          "upvotes": 5,
          "replies": {
            "g1gw4th": {
              "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1gw4th/",
              "text": "How about History with a teaching certification? Teaching pays a living wage, you can work over the summers if you need extra money, and you can always go to law school later if you want.",
              "author": "las921",
              "created": 1597429553,
              "upvotes": 3,
              "replies": {
                "g1gyxyb": {
                  "link": "/r/CollegeMajors/comments/i9o66q/dont_know_what_to_major_in/g1gyxyb/",
                  "text": "No. Teaching would be a fallback. Like a last resort kind of thing. I want something high achieving because I know I can get that. How do you get the teaching certification, exactly? I’d like to know more about that\n\nI think I want to Major in history, but I’m trying to figure out another double major option since I like mental health, crime, and law. I definitely want to be a lawyer, it’s my number 1 choice, but I’m kinda getting pulled in different directions, and definitely want a backup plan",
                  "author": "OkFondant0",
                  "created": 1597430734,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634060399
}