{
  "sid": "n71qvt",
  "link": "/r/CollegeMajors/comments/n71qvt/need_advice_on_major_route/",
  "title:": "Need advice on major route",
  "text": "I’m having a dilemma and need some advice. I know I want to work with kids, but I do not want to become a doctor or a social worker. I have been leaning towards elementary education but I am not 100% sure. Since I am unsure, I’m worried about majoring in elementary education because if I realize down the road that it isn’t what I want to do, my job choices will be limited. I was thinking of switching my major to psychology since it is a broad major and I believe I can still become a teacher if I decide to do so. Any advice would be greatly appreciated!",
  "author": "Altruistic_Copy_8643",
  "created": 1620402885,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "gyjdap7": {
      "link": "/r/CollegeMajors/comments/n71qvt/need_advice_on_major_route/gyjdap7/",
      "text": "My best advice would be to try to get a job/internship in the education field and find out if it's really what you want to do long term. Psychology majors are so common nowadays that you'll need a Master's degree minimum to get any headway in the job market.",
      "author": "OtherwiseNoteWorthy",
      "created": 1621316631,
      "upvotes": 2,
      "replies": {}
    },
    "gxw6033": {
      "link": "/r/CollegeMajors/comments/n71qvt/need_advice_on_major_route/gxw6033/",
      "text": "You should look into speech-language pathology! It kind of merges education, medicine, psychology, and more into one super varied field. The vast majority of speech-language pathologists work in schools, and lots of graduate programs also get you a teaching license so it would be a very easy career change to become a teacher if you wanted. There's also tons of flexibility to switch to different settings, like a hospital or private practice, and the job prospects are pretty good, at least in my state. It is an entry-level masters degree though, so definitely not for everyone.",
      "author": "NewGamma",
      "created": 1620848959,
      "upvotes": 3,
      "replies": {}
    },
    "gxgjyr2": {
      "link": "/r/CollegeMajors/comments/n71qvt/need_advice_on_major_route/gxgjyr2/",
      "text": "i know this is so random but you can be a dentist and work at kids offices",
      "author": null,
      "created": 1620530555,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634061379
}