{
  "sid": "rdsyba",
  "link": "/r/CollegeMajors/comments/rdsyba/what_is_this_field_called/",
  "title:": "What is this field called?",
  "text": "For a long time I’ve been very confused about my interests and talents and what I’d like to study because nothing seems appealing to me. Recently though, I’ve realised that I’m really into economic growth within countries and what determines whether a country is rich or poor. I also really like how different cultures play a part in shaping these countries and their economic wealth. I realised this after discovering the book “why nations fail”, if anyone’s heard of it. I’m not sure if it’s something I’d like to look further into but I’m shocked to discover something even slightly resembling an interest. Note that I’ve always been quite invested in writing as well, it is something I find myself to be pretty good at, too. \n\nNow my question is, what kind field is this exactly? Say, if I’d like to study something where these issues are going to be discussed. The answer might be obvious but I can’t imagine that it’s just simple economics. \n\nThanks in advance",
  "author": "Runningranian",
  "created": 1639201847,
  "updated": 1639517786,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho37plw": {
      "link": "/r/CollegeMajors/comments/rdsyba/what_is_this_field_called/ho37plw/",
      "text": "International Economics\n\nHow have you been \"infested in writing\"? Perhaps that is a more interesting question.",
      "author": "HermanMunsterCheese",
      "created": 1639202029,
      "upvotes": 4,
      "replies": {
        "ho381p3": {
          "link": "/r/CollegeMajors/comments/rdsyba/what_is_this_field_called/ho381p3/",
          "text": "Haha. Correcting that now - thanks🙏😊",
          "author": "Runningranian",
          "created": 1639202233,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}