{
  "sid": "qm94rq",
  "link": "/r/CollegeMajors/comments/qm94rq/should_i_major_in_math/",
  "title:": "Should I major in math?",
  "text": "I am currently a high school senior applying to colleges. While it takes me longer to understand concepts in math than it takes my peers (in high school thus far), I've always gotten past this obstacle by frequently seeing teachers, studying for upwards of six hours straight, and exploring all possible outcomes. One summer between my sophomore year and junior year of high school, I self-studied an Algebra II course and took a placement exam at the end of the summer to exempt out of Algebra II and place into pre-calculus. For these reasons and my love for the subject, I've heavily considered an undergraduate major in mathematics.\n\nAs stated before, I am the type of person who doesn't understand a concept off the bat, however, with hard work and frequent use of office hours/ the math center, I'm able to excel at my very competitive high school. From what I've read, an undergraduate major in general mathematics (or of any kind) is challenging and time-consuming. With this synopsis of me, is an undergraduate major in mathematics a feasible path for me? Either way, what other majors should I consider given my dedication to mathematics?\n\nAny input on this would be greatly appreciated on my end!",
  "author": "New-Look3564",
  "created": 1635987857,
  "updated": 1637404799,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj87qrh": {
      "link": "/r/CollegeMajors/comments/qm94rq/should_i_major_in_math/hj87qrh/",
      "text": "For sure! You sound like a great fit for a math major. Just consider what kind of work you want to be doing afterwards and make sure those align. You could consider a double major or minor in something else (stats, data science, CS, aerospace engineering, etc.) with a math major if you want to veer towards a specific direction.",
      "author": "slouchingbethlehem",
      "created": 1635988996,
      "upvotes": 2,
      "replies": {
        "hj9k7t4": {
          "link": "/r/CollegeMajors/comments/qm94rq/should_i_major_in_math/hj9k7t4/",
          "text": "Can confirm, you wanna pair a math major with something else to guide it a bit. It's a very \"Jack of all trades\" major, so having some career-specific skills (Especially some programming skills, so CS/DS work nicely) pairs well.\n\nFor the problem of \"Concepts take longer to click\", I'll just say: Mathematics in university is vastly different from HS math. It focuses more on those concepts as opposed to calculations and rote learning (Although the math classes that serve the entire science department might be more rote-y) so your issues with picking up these concepts might be aided along by the extra attention, or it might be hindered by the extra weight on them. It really depends on you and probably not something you can gauge before you get your feet wet\n\nI will say, Math major is fun though. Everyone is a massive nerd and all the lecturers just wanna induct people into the field as opposed to the \"Too big to fail\" departments. In conclusion, *join us*",
          "author": "StarvinPig",
          "created": 1636021735,
          "upvotes": 1,
          "replies": {
            "hjvxxjx": {
              "link": "/r/CollegeMajors/comments/qm94rq/should_i_major_in_math/hjvxxjx/",
              "text": "Thank you for your response. In exploring the different sorts of math studies In college, I've come to what seems like a common question: should I have a BS or a BA in mathematics? What's the most valuable? How did/ are you deciding?",
              "author": "New-Look3564",
              "created": 1636425415,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hjvxzfi": {
          "link": "/r/CollegeMajors/comments/qm94rq/should_i_major_in_math/hjvxzfi/",
          "text": "Thank you for your input!",
          "author": "New-Look3564",
          "created": 1636425438,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjxx1o0": {
      "link": "/r/CollegeMajors/comments/qm94rq/should_i_major_in_math/hjxx1o0/",
      "text": "I'm a math major. High school algebra and pre-calculus classes are not at all representative of what a mathematics degree is like. In high school, you are just told facts and you are given algorithms to solve specific problems. In a math degree, you are proving things, not just running computations. You are also working with concepts in a much more abstract way.\n\nI think it is fine to start off as a math major, but I highly encourage you to take a proof-based course as soon as possible. That will give you a better idea about what the math degree is like. You can also get an introductory proof-writing book and see if it interests you (I've heard good things about \"How to Prove It\" by Vellerman).\n\nBetween a BS or BA, a BS might have more upper-level math classes whereas a BA might have other classes (e.g. history of mathematics). I would suggest going for a BS. A BA might be better if you want to be a teacher, though. Not sure.",
      "author": "Connor1736",
      "created": 1636469976,
      "upvotes": 1,
      "replies": {}
    }
  }
}