{
  "sid": "okd1s4",
  "link": "/r/CollegeMajors/comments/okd1s4/what_should_i_major_in/",
  "title:": "What should I major in?",
  "text": "I finished my prerequisites for nursing school and I had very bad experiences with the nursing school I went to, so I'm feeling very lost on what I want to major in at this point in my early 20's.\n\nI'm just gonna throw some bullet points about me and my situation so hopefully it gives you guys can idea on what would suit me.\n\n1. I gotta take out a loan for whatever education I pursue now, so I'm worried about being able to pay that off as soon as possible.\n2. I've always been interested in how things work, I enjoy fixing my car, I enjoy learning how to code, and I enjoyed/did well in classes like microbiology and chemistry. \n3. Scared of nursing at the moment because I feel that I'm awful when it comes to precise, hands-on work. Don't like the idea of being disrespected by patients, professors, and my colleagues either which I hear is prevalent.\n4. I'm the kind of person that likes to always be doing something and being busy.\n5. I love playing drums and would like time to play in my free time, I work out often, I like competing at videogame tournaments, so work-life balance is important to me.\n\nAs of right now I'm looking at Programming bootcamp / Nursing / IT \n\nI feel that IT fits my goals the best, however, I'm worried about being able to pay for student loans soon after college.\n\nProgramming bootcamp seems very exciting and less expensive than a degree but I'm also worried about being able to pay off my loans.\n\nNursing I know I don't have to worry about finances and I can have time for my hobbies but I am mostly pursuing it for money and being interested in how the body works, and much less for what the work actually is like.",
  "author": "Shadowgales",
  "created": 1626294918,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "h57wqyk": {
      "link": "/r/CollegeMajors/comments/okd1s4/what_should_i_major_in/h57wqyk/",
      "text": "Based off the things you listed about yourself:\n\n1. For #1 would be to not go to school locally and not somewhere you feel as though you wouldn’t be able to pay off in a reasonable amount of time (personally don’t think spending your entire life from late teens/early 20s to elderly age or even middle age to be a reasonable amount of time). If you wanna go to a community college and transfer to make things cheaper then do that and there are cheaper alternatives outside of college. Maybe also try to collect scholarships/grants to pay off while you.\n2.  For #2 I would look into a STEM-related career path for sure. \n3. For #3 maybe try looking at a job where you can work alone or in a smaller group setting and see what degrees are required for that. \n4. For #4-5 I’m not sure if this apply to every industry, but I was going into entertainment and normally larger studios give you less roles and work in comparison to smaller studios; so maybe when you start working find a smaller company to work at or choose an industry/degree/program where you can be a generalist as long as it’s something you're able to manage along with your hobbies.\n\nFor the last 3 you're looking into these are just my opinion so take it with a grain of salt:\n\n* IT: You seem to really like this one; however, it seems a bit too risky so I wouldn’t take it. I’ve almost gone to an art school for 4 years, but the annual tuition was $60K, but I got away with only having to pay $44K, but also now have $44K student loans for one year so yeah no not again.\n* Programming bootcamp: You seem to like this as well and would probably be a better option outside of all the other options. Like I said if you can while you are not taking it and taking it try collecting grants and maybe even joining competitions that give prize money. As long as you can pay off in a reasonable amount of time, one that you think is reasonable, then I think you’ll be fine.\n* Nursing: I don’t think you should do nursing if you're not 1000% sure you really want to pursue it for the rest of your life. Yeh you won’t work at a “dead end job” or something, but you’ll feel like you're working at one. It’s better to at least like what you are doing and to be able to live at least comfortably than to be on one extreme. One extreme is where you're rich but you hate your job and the other extreme is where you’re achieving your dreams but can’t financially support yourself and if you're dependent on others financially you usually don’t have much freedom. If you like living in one of those extremes I can’t stop you.\n\nHope this helped you :)",
      "author": "donuthoop",
      "created": 1626309740,
      "upvotes": 1,
      "replies": {
        "h57yvfc": {
          "link": "/r/CollegeMajors/comments/okd1s4/what_should_i_major_in/h57yvfc/",
          "text": "this helped alot! thank you for your response man. I completely forgot about grants and competitions, will look into them and some bootcamps, weigh some stuff out",
          "author": "Shadowgales",
          "created": 1626310839,
          "upvotes": 1,
          "replies": {
            "h59k6zo": {
              "link": "/r/CollegeMajors/comments/okd1s4/what_should_i_major_in/h59k6zo/",
              "text": "No probs :3",
              "author": "donuthoop",
              "created": 1626350195,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634060703
}