{
  "sid": "m0sepu",
  "link": "/r/CollegeMajors/comments/m0sepu/my_indecisivness_is_causing_me_stress/",
  "title:": "My indecisivness is causing me stress",
  "text": "I am currently in my final weeks of high school and I am having serious trouble deciding what to do next. I have tried to decide based on intrests but the things I am intrested in either require extreme luck to get a job, the job outlook is tiny, or the only viable jobs are things I would hate. I have a really hard time identifying my strengths and weaknessess. Some of my intrests are video games, film, and history. I know that I am generally fulfilled by being creative, I also love storytelling and analysing stories. Currently I am planning on going to community college to complete my general education (and to buy myself time to decide what I want to do without spending tens of thousands of dollars). How am I supposed to decide my major? I would really apprecieate some advice. Thank you.",
  "author": "persona_enjoyer",
  "created": 1615243845,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "gq9ycdh": {
      "link": "/r/CollegeMajors/comments/m0sepu/my_indecisivness_is_causing_me_stress/gq9ycdh/",
      "text": "Hi!!! How about the subjects you were good at, like science or math. I don’t suggest any of your hobbies as majors if you can’t see yourself doing it for the long run.",
      "author": "Inalei_12",
      "created": 1615250957,
      "upvotes": 4,
      "replies": {
        "gqadz1s": {
          "link": "/r/CollegeMajors/comments/m0sepu/my_indecisivness_is_causing_me_stress/gqadz1s/",
          "text": "Math and science classes so far have made me miserable so I don't think I could ever major in one of those. The subjects I excelled in/enjoyed are history and english although I have heard its next to impossible to find a job with those degrees that aren't teaching which I have no intrest in.",
          "author": "persona_enjoyer",
          "created": 1615259548,
          "upvotes": 3,
          "replies": {
            "gqagofe": {
              "link": "/r/CollegeMajors/comments/m0sepu/my_indecisivness_is_causing_me_stress/gqagofe/",
              "text": "How about American Studies, which is basically history and literature mixed together. Although you may want to pair it with something medical (like nursing), foreign language (like Korean) or a hospitality degree, if any of that interests you.",
              "author": "Inalei_12",
              "created": 1615261067,
              "upvotes": 4,
              "replies": {
                "gqal9iz": {
                  "link": "/r/CollegeMajors/comments/m0sepu/my_indecisivness_is_causing_me_stress/gqal9iz/",
                  "text": "I looked up american studies and it seems really interesting and I would really love to study another language. My only concern is what kind of career it will lead to, do you happen to know what kind of job I can get with a degree in americsn studies?",
                  "author": "persona_enjoyer",
                  "created": 1615263783,
                  "upvotes": 6,
                  "replies": {
                    "gqc34rp": {
                      "link": "/r/CollegeMajors/comments/m0sepu/my_indecisivness_is_causing_me_stress/gqc34rp/",
                      "text": "Diplomat, lawyer, teacher, research assistant, investment banking analyst, editors, or information managers, if any of those interest you.",
                      "author": "Inalei_12",
                      "created": 1615303096,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "gqb5mjp": {
                  "link": "/r/CollegeMajors/comments/m0sepu/my_indecisivness_is_causing_me_stress/gqb5mjp/",
                  "text": "Might you be able to give advice to me? I enjoy math when I understand it and the higher I go, the less I understand so that is out of the question. I like science, it's interesting, but memorizing the information never lasts as long as I need it to. I did okay in early high school sciences but my circumstances cut my time in high school short. Honestly, my strength is in English; I can write, enjoy writing, and am interesting in different cultures/languages.",
                  "author": "chobibi",
                  "created": 1615280250,
                  "upvotes": 2,
                  "replies": {
                    "gqbz7i0": {
                      "link": "/r/CollegeMajors/comments/m0sepu/my_indecisivness_is_causing_me_stress/gqbz7i0/",
                      "text": "Yeah so no med school or health science for you then, though I’m the same. I would focus on your interest in different languages, as that’s going to get you further than an English major will. Try stuff like a foreign language (if you are good with that), or International Studies or Affairs/Relations, there is also majors where  you study different cultures (ex: Germanic Language & Culture.)",
                      "author": "Inalei_12",
                      "created": 1615301456,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634059561
}