{
  "sid": "r7i0wn",
  "link": "/r/CollegeMajors/comments/r7i0wn/psychology_vs_biology_major/",
  "title:": "Psychology vs. Biology Major?",
  "text": "Hey everyone, \n\nI'm at a total crossroads here. I was originally a Biology major in Pre-Medicine. I worked really hard in high school to get a full ride to college and it's been great. But I recently changed to Pre-PA instead of Pre-Medicine because the 10 year task of medical school seemed really far out and I wanted a family in my middle to late 20's. Anyways- I'm currently a biology major and my advisors are a little concerned for me. My science GPA (which is pulled out separate from my overall, for PA schools) is awful. Like...2.0GPA. But I did really well in psychology, sociology, government, etc. I've taken upper division sociology and psychology (medical sociology, sociology of inequalities, abnormal psychology, etc) and really loved it, passing with an A. My advisors told me to look into maybe a psychology degree. I honestly thought this was a great idea because at my college, I also have to take random upper division electives which I would just take my PA pre-reqs. It would get me out of physics, botany, and ecology. Those classes are fine but I had the thought of \"What if I didn't get into PA school, would I be happy with biology?\" and honestly... I don't know. But I do well in psychology and find it interesting, something worth studying. And I could still pursue my dream of PA school, or get a masters in Public Health. But the thing is...everywhere online says a Bachelors in Psychology is pointless. So if I didn't get into PA school, or didn't go to Public Health masters...would I be screwed job wise? \n\nThanks, this is my first ever post :)",
  "author": "th3lf",
  "created": 1638481125,
  "updated": 1639517807,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hn41303": {
      "link": "/r/CollegeMajors/comments/r7i0wn/psychology_vs_biology_major/hn41303/",
      "text": "I mean, as people say, you wouldn’t have a bachelors that would get you a lot of jobs on its own. That doesn’t necessarily mean you would be screwed per se, but imo the best use of a psych undergrad degree is as a stepping stone to some kind of grad program.\n\nThat said, there are certainly jobs a person can get with any bachelor’s, or no bachelor’s, that are still worth having. My psych degree didn’t get me into a job initially, but I’m still glad I got it, and now it’ll help me get into grad school.",
      "author": "the_umbrellaest_red",
      "created": 1638563436,
      "upvotes": 3,
      "replies": {}
    },
    "hnonkgm": {
      "link": "/r/CollegeMajors/comments/r7i0wn/psychology_vs_biology_major/hnonkgm/",
      "text": "I would still stick with biology mainly because a stem degree is considered more valuable and universal. You have a lot more job opportunities and graduate school opportunities with it.",
      "author": "notinlove7",
      "created": 1638940268,
      "upvotes": 1,
      "replies": {}
    }
  }
}