{
  "sid": "itwd1b",
  "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/",
  "title:": "Should I double major in Biotech and English?",
  "text": "So I've always waned to pursue a bio degree, but I'm aware that everyone and their mother has that degree so it's not in that much demand. I'm okay with the idea of double majoring, but I have no idea what the other major should be. I considered CS because it's a really good in demand degree, but I just don't think I'm really into programming. I considered engineering, but the amount of math classes scared me (and I'm relatively good at math). I'm enjoying the idea of doing English as my second major, but, from what I've heard, that's also a useless degree to have. \n\nI'm really panicked since I thought I had this whole college thing figured out only for me to start second-guessing everything in the last minute. I could really use some advice.",
  "author": "EroniousAlligator",
  "created": 1600265762,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "g5j4eu7": {
      "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5j4eu7/",
      "text": "Yea u heard right, English is useless asf",
      "author": "TiNyUzi",
      "created": 1600301922,
      "upvotes": -1,
      "replies": {
        "g5j4us8": {
          "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5j4us8/",
          "text": "No.",
          "author": "DetectiveTacoX",
          "created": 1600302163,
          "upvotes": 0,
          "replies": {
            "g5j63h2": {
              "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5j63h2/",
              "text": "Yes. Stop being in denial bro lol it’s a horrendous degree.",
              "author": "TiNyUzi",
              "created": 1600302853,
              "upvotes": 0,
              "replies": {
                "g5j7ojr": {
                  "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5j7ojr/",
                  "text": "I'm not. It's not even my field of study. The statistics are just against you. English majors/master students have better employment numbers than other majors. That is just a fact. It's even better than some STEM like Information Systems and Pre-Med. Here is one article to look at for related literature. \n\nhttps://www.cbsnews.com/news/english-majors-rejoice-employers-want-you-more-than-business-majors/\n\nhttps://www.studentsreview.com/unemployment_by_major.php3\n\nAlso you can find statistical evidence on the NCES website. You are in college, back your claims. Cheers.",
                  "author": "DetectiveTacoX",
                  "created": 1600303742,
                  "upvotes": 0,
                  "replies": {
                    "g5jb7nw": {
                      "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5jb7nw/",
                      "text": "Both of those don't prove shit, sorry. And ur 2nd link doesn't even work. Regardless, English is as useful as gender studies. You are making shit money when graduating and it requires a masters+ degree to do anything with it (which is probably just teaching). \n\nThat is a ***shit*** degree. You are delusional if u think it's superior than STEM fields and I.S. You are a graduate student yet claiming stupid shit, how embarrassing.",
                      "author": "TiNyUzi",
                      "created": 1600305734,
                      "upvotes": -1,
                      "replies": {
                        "g5jhl8p": {
                          "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5jhl8p/",
                          "text": "You sound like the average smart-ass teenager who spent too long listening to other people and not enough time at an actual university. \nThe good news is, if you actually make it into a university, you will realize in a semester or two that you were not bring smart when you wrote this",
                          "author": null,
                          "created": 1600308693,
                          "upvotes": 1,
                          "replies": {
                            "g5k4u7j": {
                              "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5k4u7j/",
                              "text": "Yea stfu I’m actually in a good university and I’m also not delusional like y’all English majors but it’s ok. Enjoy that useless degree",
                              "author": "TiNyUzi",
                              "created": 1600321785,
                              "upvotes": -1,
                              "replies": {
                                "g5lbw04": {
                                  "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5lbw04/",
                                  "text": "Don't know what going to a good university has to do with anything. You are very delusional if you think that has to do with anything. Trump attended Penn but I digress. Anyway, not an English Major. Majored in Math and Econ.",
                                  "author": "DetectiveTacoX",
                                  "created": 1600355655,
                                  "upvotes": 0,
                                  "replies": {
                                    "g5lc5s7": {
                                      "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5lc5s7/",
                                      "text": "If I was talking to u I woulda tagged u bro. Which I did in another comment",
                                      "author": "TiNyUzi",
                                      "created": 1600355785,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "g5jbuv9": {
                          "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5jbuv9/",
                          "text": "The second link does work. Also you did not search up the NSEC Statistics, didn't you? I made my point and backed up my claim. If you want statistical data, please pm me. You make yourself look bad by not backing your claims, you have fell victim to false information/rumors.\n\nHere is one quick data website for unemployment. \nhttps://www.statista.com/statistics/642043/unemployment-rate-of-us-college-graduates-by-major/\n\nIf blocked by paywall here is two majors\n\nPhysics - 7.5%\nEnglish - 4.5%\n\nFrom the ED.gov website, English Majors make a median of 44,600$, greater than other humanities. Along side good employment numbers.",
                          "author": "DetectiveTacoX",
                          "created": 1600306075,
                          "upvotes": 0,
                          "replies": {
                            "g5jdzr5": {
                              "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5jdzr5/",
                              "text": "Imagine thinking making 44,600 MEDIAN(not starting, but MEDIAN) is acceptable lmfaoooo. I can make that without wasting my money for a degree like English. Job security doesn’t mean much without having a wage that’s worth it.",
                              "author": "TiNyUzi",
                              "created": 1600307041,
                              "upvotes": -1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g5hbc6f": {
      "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5hbc6f/",
      "text": "Does everyone have a bio degree? Never heard someone said that.\n\nAnyway, you have fallen victim to a lot of false information, telling you that as a graduate student that has worked in an employment office non-profit. \n\nWhile CS is in high demand, it's also very saturated, meaning you will likely need a Masters to get a good-paying job. This of course depends on where you live. \n\nEnglish is not a useless degree, depending on how you use it. Ironically, it is more desirable for employers than other degrees. It's not the best in but it has a use in management, marketing, and journalism. Really depends on what you want to do. I know a lot of English Majors that have found desirable employment. \n\nYou said you are relativity good in math, that's a good sign. Maybe you should take Calculus 1-3, one extra proof-based math class like Linear Algebra and Statistics/Probability. It will benefit your bio degree as well. If you like 3/5 of those math classes, do a double major in Math if possible, or Engineering. \n\nRight now, college graduates are suffering due to increasing education requirements, so most likely to get a good-paying job, you gonna most likely need a Masters, so the major kinda matters less.\n\nPS: Maybe after taking your gen eds, there is another subject that caught your interest, got a good grade in and you can major in that. that's how I found my major. It wasn't Math, it was something else. Math is just Masters's.",
      "author": "DetectiveTacoX",
      "created": 1600271085,
      "upvotes": 6,
      "replies": {
        "g5hfscc": {
          "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5hfscc/",
          "text": "I'm currently doing dual enrollment and have actually done most of my Gen Ed courses. I'm currently taking Calculus 1 and took Statistics over the summer. I just find math extremely draining even if I can do it pretty well. Still, I do plan on doing Calc 2 so maybe something can change... I originally wanted to do bioengineering, but the math was just something that didn't make it worth it. I've enjoyed a lot of my English classes and do like writing in my free time which is why I considered the English major.",
          "author": "EroniousAlligator",
          "created": 1600273262,
          "upvotes": 2,
          "replies": {
            "g5kce75": {
              "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5kce75/",
              "text": "Maybe you can do philosophy and get into bioethics which combines writing and biotech.",
              "author": "Thebestchallenge",
              "created": 1600328840,
              "upvotes": 1,
              "replies": {
                "g5kxehm": {
                  "link": "/r/CollegeMajors/comments/itwd1b/should_i_double_major_in_biotech_and_english/g5kxehm/",
                  "text": "How is the job market for those types of jobs?",
                  "author": "EroniousAlligator",
                  "created": 1600348089,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634059774
}