{
  "sid": "d5orf5",
  "link": "/r/CollegeMajors/comments/d5orf5/trying_to_find_if_this_is_the_correct_majorjob/",
  "title:": "Trying to find if this is the correct major/job",
  "text": " So I'm going into college in 2020 and I want to become a programmer but I'm not sure if computer science is the major for me. I looked into computer science and realized math is a huge thing and I'm not the best math student (horrible actually). I want to just be a programmer but I'm not sure what job I want to do but I know I want to work with code language. If anyone can help me narrow down my job title and major I would greatly appreciate it. ( If this isn't the right subreddit for this I apologize.)",
  "author": "blizz1221",
  "created": 1568761280,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "f30pv72": {
      "link": "/r/CollegeMajors/comments/d5orf5/trying_to_find_if_this_is_the_correct_majorjob/f30pv72/",
      "text": "I’m currently a CS student and I’ll give it to you straight. If the math makes you nervous at all don’t go for it. I, too, am terrible at math and I thought I could get by good enough without it but you will have to pick up extra math classes that aren’t part of your basics.",
      "author": "THawkins88",
      "created": 1570559779,
      "upvotes": 1,
      "replies": {}
    },
    "f0nkx2r": {
      "link": "/r/CollegeMajors/comments/d5orf5/trying_to_find_if_this_is_the_correct_majorjob/f0nkx2r/",
      "text": "Hey op look into Info systems and then consider a coding boot camp in addition! Info systems majors have been known to become both programmers and developers and if that doesn’t work out you’ll still be in a major that’s both business and tech and you’ll be educating/ helping those who aren’t as well versed with tech! Which in my book is a huge win as tech grows and not everyone is going to be knowledgeable the way you are. Also maybe a minor in computer science?\n\nEdit- adding maybe consider IT as well!",
      "author": "shayskates33",
      "created": 1568772813,
      "upvotes": 3,
      "replies": {
        "f0nqv8m": {
          "link": "/r/CollegeMajors/comments/d5orf5/trying_to_find_if_this_is_the_correct_majorjob/f0nqv8m/",
          "text": "Info systems major here - came here to say this!",
          "author": "infjetson",
          "created": 1568777745,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f0nf5j5": {
      "link": "/r/CollegeMajors/comments/d5orf5/trying_to_find_if_this_is_the_correct_majorjob/f0nf5j5/",
      "text": "I’ll let an actual CS major give you their input on how math intensive CS is, since I’ve heard varying responses though I think it’s definitely one of the more math intensive majors. \n\nIt might help if you determine what draws you to programming and what you want to actually do with programming, since that covers everything from the arts and entertainment to medicine.",
      "author": "puffy-jacket",
      "created": 1568768448,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634059529
}