{
  "sid": "qn6kmk",
  "link": "/r/CollegeMajors/comments/qn6kmk/no_ecs_related_to_major/",
  "title:": "No EC'S related to Major",
  "text": "Hey everyone!\n\nSo, just to give a little background:\nI was initially planning to major in physics for my undergraduate studies until I started researching about its job prospects. I found that physics, besides being one of the most difficult majors, doesn't equip you with the necessary professional skills required for you to work at a company. Also, physicists or researchers don't get paid well enough and struggle to earn a decent amount for most of their professional life.\nMoreover, I did a few summer courses and internships over the summer related to physics and engineering and tbh I didn't really enjoy them. However, I liked the coding part of it... it interested me a lot and for the past few weeks I've been contemplating whether to switch my majors to CS or not. But the problem I'm facing is I have very little experience in programming and also almost no EC's related to it. Everything I've done is related to either Math or physics/engineering and not to programming or CS in particular.\n\nSo do you think it would be a wise decision to apply for CS for my UG or apply for physics first to increase my chances of acceptance and then later switch to CS at uni? \nPlease advise.",
  "author": "T800-",
  "created": 1636101097,
  "updated": 1636190145,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hje78ke": {
      "link": "/r/CollegeMajors/comments/qn6kmk/no_ecs_related_to_major/hje78ke/",
      "text": "Physics bachelors are relatively well paid, but usually work outside of physics. Physicists usually hold PhDs and only struggle in pay while they are in school, unless you go into academia which has its own problems even outside of physics(hard to land a job that lasts). \n\nAre you a high school student or already in college? I'm confused about the internships, I've never heard of an internship for high school students, especially in physical sciences or engineering.\n\nIf you are a high school student: Your EC's won't really matter besides for scholarships and honors college, unless you are going for Ivy League colleges. Ivy League colleges just want impressive positions with impressive experience, not something super specific to the major you want to go into. College classes will teach you CS, you don't need to have a background in it. You aren't applying to grad school. That being said, Physics, Math and CS students all go into Software Engineer roles. CS and Math is just very applied math. CS is easier to land Software Engineer roles, of course. You can switch your major as you go, so don't feel locked into one major. Lastly, unless the University you are applying to counts CS as an engineering discipline(some do, some don't) then the requirements for entry into the program is usually similar or the same. If it is engineering, then you just need a higher GPA and SAT/ACT(if they still require that). Physics, Math, CS are all good degrees, but very difficult and with different classes. If you like programming - CS, if you like applying the math to real life situations - Engineering, if you like programming and running experiments or writing proofs(experimental vs theoretical) - Physics, if you like understanding equations and making new ones - Math. \n\nIf you are a college student: Freshman, Sophomore - Take the first CS class your Uni offers and then apply for a major switch if you like the class. Junior, Senior - Take the first CS class your Uni offers and then fit as many CS classes that you are interested in around your required Physics classes, graduate with a Physics degree and then apply to a masters program for CS or Robotics or AI or whatever your interest is in CS, there are a lot of different fields within CS and a lot of overlap into other fields, like Physics, Engineering, Chemistry, Biology, Geology, etc.",
      "author": "Eteranl96",
      "created": 1636103440,
      "upvotes": 1,
      "replies": {}
    },
    "hjgzb8w": {
      "link": "/r/CollegeMajors/comments/qn6kmk/no_ecs_related_to_major/hjgzb8w/",
      "text": "Above is very good advice. OP, look into computational physics.  People with physics degrees can get programming jobs, provided they have the necessary background for the role they are applying for.",
      "author": "Mathguy656",
      "created": 1636148660,
      "upvotes": 1,
      "replies": {}
    }
  }
}