{
  "sid": "bxc8sv",
  "link": "/r/CollegeMajors/comments/bxc8sv/im_into_physical_therapy_but_engineering_seems/",
  "title:": "I'm into physical therapy but engineering seems more practical",
  "text": "I'm a rising senior in high school and few careers really interest me. Up to this point I've been your typical \"defaults to engineering\" kid, which actually goes back a few generations in my family. And goddamn does it work. But I've come to realize that, unlike my electro-mechanical-engineering-college-professor-of-27-years grandpa, math isn't my strongsuit. I'm also mostly interested in niche engineering studies such as architecture. You know, the one that doesn't make much money and everyone wants to be. Everything else is kinda \"meh\" to me, not bad but i just don't sense any drive within me. Mechanical is something I can get behind because I like to see how things work but my math skills really truly aren't there IMO. And while I like computers too I can't imagine a life of being tied to one...coding for multiple hours a day would kill me inside.\n\nI REALLY like two things outside of engineering. history and physical therapy. I don't consider a history degree to be a reliable source of income (i see it more as a niche hobby) and I certainly can't major in it on my parents' dime so that's out. Being into PT was a surprise to me considering I dislike most health fields and hate being in hospitals. But after struggling with shoulder issues for six months and I've come to really appreciate the study. The scapular strengthening exercises I was given work like magic. I love learning about my body and how having a functional physique is one of the most direct contributors to my mental state at any given time. I'd also like to give that feeling to others.\n\nThe degree's mobility (haha) scares me though. It's one where if I go down that route I really need to go all in. I'd much rather graduate in 4 years. Engineering is very versatile, I could do engineering and become lots of things (even something potentially PT related) and there's more default money in it too. If there was a way to do both I'd love to hear it...",
  "author": null,
  "created": 1559793997,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "eq5a9kg": {
      "link": "/r/CollegeMajors/comments/bxc8sv/im_into_physical_therapy_but_engineering_seems/eq5a9kg/",
      "text": "Do you want to be an engineer because that is what you want, or because you’ve been constantly pointed/pushes/guided into that direction? Did you grow up being told all the time you’d be a good engineer? \n\nThat is what it sounds like to me, and that’s coming from the son of a mechanical engineer. Engineering is attractive with its high earning and really interesting fields, however I found that many are bored in their field and feel stuck. They lost the passion and interest they had when they were younger. I’m not saying engineering is bad, but it’s something you really need to have a big pull and commitment to rather than a push and commitment. \n\nIf engineering was prefect for you there wouldn’t be a pull towards other things if that makes sense. \n\nI may not be the most help but I understand living a life where everyone says to go to engineering. I’ve had that beat into me for 20 years, but got an associates in psychology and am not working on a wildlife degree to work for the National or state parks. But still having an interest in mechanical and electrical engineering fields I do hobbies that let you pursue the interests if that makes sense. When I was 10ish I wanted to be a watchmaker and still do repairs, and am the local “watch and clock” guy. That’s one of many things that fills the mechanical interest. For electrical I have been repairing vintage stereo equipment, radios, computers, etc for many years, thus filling the electrical side. \n\nWould it be good for you to peruse physical therapy and help people (also think about your people skills), and have hobbies that feed your interests elsewhere? \n\nSorry if this wasn’t much help.",
      "author": "Angros-offical",
      "created": 1559796144,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634060759
}