{
  "sid": "ofej2f",
  "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/",
  "title:": "What are some college majors that help you \"think outside the box\"?",
  "text": "I'd like to get some college career suggestions to help me think better, critically. My dream is to become a hedge fund manager or run a venture capital firm, but I don't want to pursue a major in finance or economics, as they have no real-life applications, as many top investors like Buffett, Munger and Steven Cohen have commented. I know that no university or major will automatically make me a great investor, but I would like to study something that would give me at least a solid intellectual framework.\n\nI've been doing research and I saw that some of the best investors in the world like Carl Icahn, George Soros, Peter Thiel, Peter Lynch, Guo Guangchang, and Leon Black studied philosophy,  , and they even point out that having done it was important for the success they have had.\n\nSo I would like to hear your opinions and suggestions. Thanks.",
  "author": "Saborizado",
  "created": 1625645093,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hcz592m": {
      "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/hcz592m/",
      "text": "If you want to learn to think critically and think outside the box, examine different ideas throughout history and learn what ideas you only believe because of the historical moment you’re situated in, study philosophy. If you want some secret knowledge to help you run a hedge fund, philosophy’s not for you. Try Econ. But it seems like philosophy would benefit and interest you, not to make you a billionaire, but to make you a better thinker",
      "author": "calebsand12",
      "created": 1631727886,
      "upvotes": 1,
      "replies": {}
    },
    "h4ik08e": {
      "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/h4ik08e/",
      "text": "Putting in a smol plug for engineering/design.  Alternatively, see if your school of choice has options to modify majors. My college let people modify majors with other topics (e.g. engineering modified with economics) so that you could complete the requirements for the primary field of interest while also tossing in some other fun/interesting coursework",
      "author": "leadbunny",
      "created": 1625776567,
      "upvotes": 1,
      "replies": {}
    },
    "h4ewjvs": {
      "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/h4ewjvs/",
      "text": "Do you realize that billionaires became billionaires because they sold out to the government and they probably already had generational wealth and they've never had to actually work a single day in their lives? We need to stop glorifying billionaires because sweetie, none of us will ever become one. They are chosen, not self-made.\n\nYou don't need a college degree to do any of the things you just listed like being a hedge fund manager or anything. What you need is capital. If you want to learn how to think critically all you need to do is just read lots and lots of books.",
      "author": "AnotherSpotOfTea",
      "created": 1625700719,
      "upvotes": 0,
      "replies": {
        "h4f0quw": {
          "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/h4f0quw/",
          "text": "Most of the people I mentioned were poor or middle class at best. George Soros was a poor exile from Nazism; Icahn grew up in a poor neighborhood in Queens; Guangchang grew up in communist China; Steven Cohen in a normal New York family. Statistically speaking the vast majority of billionaires are self-made.",
          "author": "Saborizado",
          "created": 1625702843,
          "upvotes": 1,
          "replies": {
            "h4ffmlm": {
              "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/h4ffmlm/",
              "text": "And they all sell out to government or have high amount of lobbying and stock buyback going on.",
              "author": "AnotherSpotOfTea",
              "created": 1625710518,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h4c14ih": {
      "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/h4c14ih/",
      "text": "Philosophy would be great, but applied mathematics, computer science, statistics, or engineering would also be helpful. Problem solving is a much-desired skill and employers can much more easily reach someone business basics than teach someone with a BBA problem solving. \n\nThere’s no secret major that will make you a great investor. I’d suggest picking one that you enjoy, can get decent enough grades in, and specialize in something.",
      "author": "slouchingbethlehem",
      "created": 1625646517,
      "upvotes": 4,
      "replies": {
        "h4dqj6u": {
          "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/h4dqj6u/",
          "text": "I do agree with you. However, it also depends on the major. For some majors, more higher education is required. (Master's, etc)",
          "author": "Superb-Disk-8202",
          "created": 1625681974,
          "upvotes": 1,
          "replies": {
            "h4dvib2": {
              "link": "/r/CollegeMajors/comments/ofej2f/what_are_some_college_majors_that_help_you_think/h4dvib2/",
              "text": "I don’t think a master’s would be required in any of these fields if he/she is looking to get into finance.  It’s not directly applicable anyway.",
              "author": "slouchingbethlehem",
              "created": 1625684162,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634060841
}