{
  "sid": "k1u0zk",
  "link": "/r/CollegeMajors/comments/k1u0zk/need_help_picking_degree_track_agriculture/",
  "title:": "Need help picking degree track - Agriculture",
  "text": "I really want to go into the science side of agriculture and maybe work in plant breeding, or something in research. I'm currently going to an ag college and I'm not really sure which one is right for me. These are all of the agriculture tracks: General Track, Crop and Soil science, Crop production , and Technology and System Management. Any suggestions on which one I should go with?",
  "author": "throwawayof-a-nobody",
  "created": 1606450069,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "gefz3u3": {
      "link": "/r/CollegeMajors/comments/k1u0zk/need_help_picking_degree_track_agriculture/gefz3u3/",
      "text": "Go talk to one of your professors.  If he/she doesn’t really know (it might not be his/her specialty) ask them if they can tell you who on the faculty you should talk to (then you can drop the first one’s name when you talk to the second one).  If you are in COVID lockdown, you might have to use email for this.  It may be that you would be better to be taking biology or botany to do that kind of work.  If you want to get into the genetically modified end of the business it may be something else.\n\nUsually research is an advanced degree sort of thing.  You could certainly work on a research team with a bachelors, but it will likely be Dr. So-and-so’s project.  (That is how it works in my field at least.)",
      "author": "dmstew",
      "created": 1606960847,
      "upvotes": 1,
      "replies": {}
    },
    "gdy4zua": {
      "link": "/r/CollegeMajors/comments/k1u0zk/need_help_picking_degree_track_agriculture/gdy4zua/",
      "text": "If you want to work in plant breeding do Crop and Soil Science, it will focus on more of the science, like genetics.",
      "author": "Doglover2006",
      "created": 1606608056,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634060212
}