{
  "sid": "ge9n3w",
  "link": "/r/CollegeMajors/comments/ge9n3w/i_literally_have_no_idea_what_i_want_to_college/",
  "title:": "I literally have no idea what I want to college for",
  "text": "I've been out of high school for 2 years now and I'm just completely blocked on what I should go to college for I thought about going for computer science but I'm not so sure about it the more I looked into it then I thought about going to film school buts thats not practical I know I prefer something in the tech field since I love technology but I'm not exactly sure what that is. Can anyone help me out? Any good college majors for an introvert?",
  "author": "loner980",
  "created": 1588724684,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "fpoypok": {
      "link": "/r/CollegeMajors/comments/ge9n3w/i_literally_have_no_idea_what_i_want_to_college/fpoypok/",
      "text": "I wouldn't ever really recommend pursuing film or theater as a major as it is a HIGHLY competitive field and you will be pressed in an extremely over saturated job market that only really has advancement for people that are extremely outgoing and good at networking. \n\nComputer science is a good field to go into that looks good on any job application and is much in demand. Most programs require you go through at least Calculus 3, so if your math skills are good you shouldn't have a problem. \n\nIf you are unsure I would HIGHLY recommend doing community college over going to a state school and doing all of your generals. For example, it would suck if you are paying full price for each semester and are halfway into a science degree when you find out Economics is your passion.",
      "author": "Reav101",
      "created": 1588792949,
      "upvotes": 1,
      "replies": {}
    },
    "fpmyyw5": {
      "link": "/r/CollegeMajors/comments/ge9n3w/i_literally_have_no_idea_what_i_want_to_college/fpmyyw5/",
      "text": "How are your math skills? And are you interested in programming or the technology/hardware?\n\nIf you are interested in programming and is good at math, try computer science.\n\nIf you like the IT side of tech (or less math), try an IT/IS major.",
      "author": "ShotMeeting8",
      "created": 1588745424,
      "upvotes": 1,
      "replies": {}
    },
    "fpmyqlz": {
      "link": "/r/CollegeMajors/comments/ge9n3w/i_literally_have_no_idea_what_i_want_to_college/fpmyqlz/",
      "text": "Why weren't you sure about CS? If you wanna go into tech that's a great field to study. You could also do informatics or some IT program.",
      "author": "OGMagicConch",
      "created": 1588745241,
      "upvotes": 2,
      "replies": {
        "fpn9zwr": {
          "link": "/r/CollegeMajors/comments/ge9n3w/i_literally_have_no_idea_what_i_want_to_college/fpn9zwr/",
          "text": "I wasnt sure about the programming side of things I can be pretty good at math if taught correctly...and every time I look into CS I see a lot of software engineering jobs and I hear that they will have a high turn over rate at time.",
          "author": "loner980",
          "created": 1588755457,
          "upvotes": 1,
          "replies": {
            "fposw52": {
              "link": "/r/CollegeMajors/comments/ge9n3w/i_literally_have_no_idea_what_i_want_to_college/fposw52/",
              "text": "If you're good at math and have interest you should at least give it a shot. Also idk what you're hearing about software engineering but it's really one of the best jobs if not the best job you can get out of college. You can pretty much guarantee yourself 6 figures out of college if you take the right steps.",
              "author": "OGMagicConch",
              "created": 1588790092,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634059777
}