{
  "sid": "de6omd",
  "link": "/r/CollegeMajors/comments/de6omd/pt_or_nursing_or_engineering/",
  "title:": "PT or Nursing? Or Engineering?",
  "text": "Hi! I’m currently debating between going into physical therapy (pediatrics, in specific) or nursing. I’ve always been interested in going into a health related field but I’m not sure which one. Pediatric PT sounds like something I would enjoy and would be very rewarding, however, there is not a bachelors degree that you could receive. I would have to go to PT school and I’m not sure if I’m up for that. In comparison, I can receive a BSN (Bachelor of Science in Nursing) and be working after I graduate. But the issue I see with nursing is having night shifts and I believe I would have to learn to draw blood? I normally feel faint when around blood drawings. I also heard I would have to volunteer at various places like senior living homes and possibly give baths which I don’t really want to do. But nursing does interest me like PT. If those two fall through, I’m considering Bioproducts & Biosystems engineering (I know you can do biomedical engineering but I’m not interested in that). BBE sounds interesting but you need to go up until Multivariable Calc (Calc 4). Although I’m alright at math, I wouldn’t want to go up that far. I need some guidance! Any ,(current or former) nursing majors/PT/BBE that could give me some advice and/or share their experience?",
  "author": null,
  "created": 1570384481,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "f2tkygh": {
      "link": "/r/CollegeMajors/comments/de6omd/pt_or_nursing_or_engineering/f2tkygh/",
      "text": "Would you maybe be able to get a BSN and then go to PT school?\n\nOtherwise I would pick the major that best prepares you for pt school - I just looked it up and it seems like the popular ones are biology, psychology and kinesiology (psych/sociology might be interesting for you if you want to specialize in pediatrics)",
      "author": "puffy-jacket",
      "created": 1570396821,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634061061
}