{
  "sid": "bblwby",
  "link": "/r/CollegeMajors/comments/bblwby/did_i_choose_the_right_major/",
  "title:": "Did I choose the right major?",
  "text": "I had such a hard time deciding on which degree I wanted in University, I switched my degree probably a dozen times until I stuck with a Bachelor of Science in Integrative Studies. It allowed me to customize my degree and take courses that interested me; I divided my degree between psychology and leadership studies. However, I have been worried that I chose the wrong degree; should I have stayed within my psychology degree? I want to go onto graduate school and become an MSW, my INTS degree can make me more versatile and gave me extra skills that I thought would come in handy in the job market before grad school. However, is a more specialized degree better? I graduate in the summer and I have so much anxiety....",
  "author": "Pixiechic7486",
  "created": 1554902224,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "ekla4w4": {
      "link": "/r/CollegeMajors/comments/bblwby/did_i_choose_the_right_major/ekla4w4/",
      "text": "I feel like people put so much focus into choosing the right major like it determines everything, when in reality if you can prove you have the skills they want you to have for a job, it doesn't really matter what your major was. My advice would be to focus on getting experience in the field such as an internship, that will matter more than what your major was :) It sounds like what you did is fine, they might like that you have a unique profile from all the others with the same degree.",
      "author": "Ivegotthatboomboom",
      "created": 1554940630,
      "upvotes": 3,
      "replies": {
        "ekla8b3": {
          "link": "/r/CollegeMajors/comments/bblwby/did_i_choose_the_right_major/ekla8b3/",
          "text": "If I change my major now I’ll graduate later than planned, I’d like to get an MSW and then go on to become licensed and practice",
          "author": "Pixiechic7486",
          "created": 1554940701,
          "upvotes": 1,
          "replies": {
            "eklb094": {
              "link": "/r/CollegeMajors/comments/bblwby/did_i_choose_the_right_major/eklb094/",
              "text": "Then I wouldn't change your major if it pushes back your graduation date! You shouldn't have any problem meeting requirements with your current major. Maybe contact the advisors for a few programs and see? I think they look more at what classes you took than your major",
              "author": "Ivegotthatboomboom",
              "created": 1554941278,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634060877
}