{
  "sid": "ptl6u2",
  "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/",
  "title:": "Help me, please god help me.",
  "text": "I managed to get my way through high school with a 3.0 GPA. The issue is that I am intelligent, but have a hard time focusing on material, due to me being on the Autism spectrum. I’ve always been mediocre with math, but love science. I’ve spent most of my life researching various things I find interesting through obsessive information absorption, however I worry that due to my disability I will be unable to function successfully in college. More specifically, in math/science majors that are required for me to pursue my interests. Recently I’ve been settling for less and opting for least schooling with maximum pay, things like Dental Hygienists. This question is likely asked frequently, but is there a major that is high reward with an average understanding of math, preferably with a bachelors or bellow? Perhaps advice? Are the sciences really that difficult?",
  "author": "sewser",
  "created": 1632362590,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "he0hbh8": {
      "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/he0hbh8/",
      "text": "electrical engineering",
      "author": "ghostmode342",
      "created": 1632432142,
      "upvotes": 1,
      "replies": {
        "he0sa7j": {
          "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/he0sa7j/",
          "text": "How so?",
          "author": "sewser",
          "created": 1632437047,
          "upvotes": 1,
          "replies": {
            "he0xnrj": {
              "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/he0xnrj/",
              "text": "its high reward and you never need anything above bachelors degree",
              "author": "ghostmode342",
              "created": 1632439507,
              "upvotes": 1,
              "replies": {
                "he17zj2": {
                  "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/he17zj2/",
                  "text": "Have you taken this major? If so, how was the course material?",
                  "author": "sewser",
                  "created": 1632444427,
                  "upvotes": 1,
                  "replies": {
                    "hh5m2qa": {
                      "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/hh5m2qa/",
                      "text": "EE is a lot of math. Have you talked with your doctor about how you're struggling? They might suggest medication or help you come up with an IEP to help you deal with your autism's impact on your studies.\nYou might want to check out accounting. The math isn't super difficult and it might be good for you if you can apply your passion for facts and details into learning all the intricacies of accounting rules. It's like the world's most complicated game.\n\nYou could also study technical writing and put your information gathering to good use. Many business majors end up working as \"analysts\" which is a general title for anyone who gathers information for a company. If you go into finance you might be very skilled at researching a business by looking at their financial reports and figuring out what's going on.",
                      "author": "42gauge",
                      "created": 1634591334,
                      "upvotes": 1,
                      "replies": {
                        "hh5z9hw": {
                          "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/hh5z9hw/",
                          "text": "Thank you for your detailed response. However, since posting this, I’ve decided I’m going to go to pilot school, after completing a bachelors in Business Administration.",
                          "author": "sewser",
                          "created": 1634597442,
                          "upvotes": 1,
                          "replies": {
                            "hh5zkxx": {
                              "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/hh5zkxx/",
                              "text": "Awesome! It seems like a good career, as long as you're eilling to deal with the long hours. Alsi, spend your time in school getting different kinds of internships if you can to see what business stuff you like or don't like in case pilot school doesn't work out. Also, take advantage of your university's career resource center and definitely try to work with your universities disabilities office to get an IEP",
                              "author": "42gauge",
                              "created": 1634597596,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hdxv2sw": {
      "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/hdxv2sw/",
      "text": "Following this as I have autism (and am trying to function in college) as well, and not all of us are math/science geniuses lol. I also struggle in certain areas and excel in others (for example I love math (and particularly math history) but have struggled with it in the past due to trying to do calculations in my head and rushing through problems, I have also struggled with paying attention to certain instructions given to me by professors). I would say in terms of the sciences it really depends. I'm currently pursuing Psychology/Cog Sci (at my community college, I'm intending to transfer) but may change my major or double major depending on where my interests take me. From my experience, physics and chemistry are the most math-heavy of the sciences, biology requires a little math knowledge but not a ton. (Biology is very difficult in its own right, though, I'm taking Intro to Bio and barely keeping my head above water as it were.) As for how hard the sciences are, it really depends on what you want to specialize in and how much school you want to go through. I love school and want to get a Ph.D. someday, but that seems like it's not really up your alley. The social sciences are often lambasted as being \"easy\" (which they're not, they just require a different set of skills) but if you want to become a researcher in psychology or sociology you usually have to know a fair amount of statistics (plus you usually have to go to grad school, there's really unfortunately not a lot of job options with a bachelor's degree). Some social sciences, like anthropology and the aforementioned cognitive science, are a mix of social science theory and scientific research. (Anthropology and cognitive science are personally really fascinating, so I may be a little biased.) In terms of the math piece, if you're average at math that's ok, you don't need to be a math genius to get by in certain disciplines, you need to know \"just enough\" math to get by. Biology in particular is less math-heavy, but you need to know basic mathematical principles to understand some of the concepts. (E.g. metric system, numbers of subatomic particles, as there is a lot of chemistry involved, numbers of macromolecules, etc.) I will warn you as aforementioned that biology is very hard in its own way. If you love science though and manage to take a good Intro to Bio class (and btw if you've already taken AP Bio I do recommend taking Intro to Bio anyway, because AP Bio is not **nearly** as hard as college biology), you might be able to get through it. Cog Sci is a newly developing and also really fascinating field that combines psychology, neurology, philosophy, and computer science among other disciplines, but you do have to take Calc for it so you do have to have some math skills.  Sorry if I'm repeating myself and not helping, just my 1 o clock in the morning ramble",
      "author": "itsmematthewc",
      "created": 1632383837,
      "upvotes": 4,
      "replies": {
        "hdz51j4": {
          "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/hdz51j4/",
          "text": "Thank you for your contribution! I will take your words into consideration before settling on a choice.",
          "author": "sewser",
          "created": 1632411687,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hdxnobj": {
      "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/hdxnobj/",
      "text": "Have you gone through applied mathematics?",
      "author": "pretentiousviv",
      "created": 1632377616,
      "upvotes": 1,
      "replies": {
        "hdz1gir": {
          "link": "/r/CollegeMajors/comments/ptl6u2/help_me_please_god_help_me/hdz1gir/",
          "text": "Yes",
          "author": "sewser",
          "created": 1632410179,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1636189602
}