{
  "sid": "en3qqx",
  "link": "/r/CollegeMajors/comments/en3qqx/how_difficult_is_it_to_double_major/",
  "title:": "How difficult is it to double major?",
  "text": "I'm thinking about double majoring in two degrees that fit my interest. My first-choice college requires that the two majors are from different departments. One of my major options is from the College of Liberal Arts and another is from the College of Education. How difficult would it be to get a double major if I already have general education credits completed and the two majors sort of relate to each other?",
  "author": "AnonymousPinkDolphin",
  "created": 1578722612,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "fdy43n2": {
      "link": "/r/CollegeMajors/comments/en3qqx/how_difficult_is_it_to_double_major/fdy43n2/",
      "text": "I double majored in math and computer science. Sounds fancy, but it wasn't. They were in the same department so there was a shit ton of overlap. A guy I studied with got a double degree in digital arts and math, he was constantly taking more than the maximum amount of credits in order to graduate on time. \n\nUltimately, look at when the courses are offered and see if you can plan out your schedule for the 4 years that you'll be in college. Some times departments will do this for you. You can definitely do it.\n\nYou also have to be a little be crafty, I took a class called Social Issues in Computing that counted as a computer science elective and a GE requirement. I also took History of Math which was a math elective and a GE requirement. Stuff like that.",
      "author": "travishummel",
      "created": 1578775901,
      "upvotes": 2,
      "replies": {}
    },
    "fdwoisd": {
      "link": "/r/CollegeMajors/comments/en3qqx/how_difficult_is_it_to_double_major/fdwoisd/",
      "text": "I “doubled majored” (in my university it was called getting a “dual degree” if the majors were not in the same college). So I got a Bachelors of Science in Mathematics from the College of Liberal Arts and Science and a Bachelors of Science of Business Administration with a major in finance from our namesaked School of Business.\n\nIt is harder, there were 2-3 classes that fulfilled the same general education credit that I had to take two different iterations of because they were both prerequisites for further classes in that major’s curriculum. Also, if you want to graduate in four years, you’re looking at least 15 credits in the fall/winter every semester plus probably some in the summer. I remember the first two years at my university during fall/winter, I would take 15-16 credits at university and a class online from a local community college (usually 3-4 credits of whatever gen ed my majors didn’t care much about). I also took online classes in the summer, 3 each my first two summers and one in my final summer. But the reason I went so hard knocking classes out of the way my first two years is because I knew my classes would be way harder my last two years, so my last two years it was more like 12 credits/semester, 15 if I had two easier classes, and I’m really glad I did that because honestly, despite the big drop in number of classes, the amount of work didn’t go down. But remember this is the scope of a math and finance curriculum, and it sounds like you’re looking at some majors that might be less intense the last couple years (but maybe not!)\n\nThe other thing you’ll definitely need to stay on top of is your schedule. Every semester you need to go (early! Maybe two weeks before registration for the next semester opens) to BOTH advisors and work out what classes you can take the following semester. These advisors will NOT communicate on your behalf, it’s up to you to figure out how to balance the needs of the two degrees and make sure you’re on track to graduate. Personally, my schools website had a lot of course lists out there, so I made my own 4 year plan that incorporated both degrees and then ran it by each advisor each semester. Obviously it changed along the way as I learned what professors to avoid, sacrificed some interesting classes for more useful or easier classes, and learned what alternative classes I could take for various requirements, but the point was I kept track of it in my excel workbook and took responsibility for it. \n\nI’ve already typed a lot so far so I’ll stop now lol. But I don’t regret anything at all. Feel free to ask me any questions. I graduated in December 2018, so it’s not too far behind me yet!",
      "author": "numbersaremygameyall",
      "created": 1578760869,
      "upvotes": 4,
      "replies": {
        "fdxp3bh": {
          "link": "/r/CollegeMajors/comments/en3qqx/how_difficult_is_it_to_double_major/fdxp3bh/",
          "text": "Thanks for the advice and sharing your personal experience. It was very helpful.",
          "author": "AnonymousPinkDolphin",
          "created": 1578771404,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fdw8d3u": {
      "link": "/r/CollegeMajors/comments/en3qqx/how_difficult_is_it_to_double_major/fdw8d3u/",
      "text": "I honestly think It would depend heavily on the two majors but I’d like to know as well",
      "author": "MemeySteamy",
      "created": 1578756117,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634060354
}