{
  "sid": "kw11fs",
  "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/",
  "title:": "Major related to design",
  "text": "So I’m a junior in hs right now and although it may seem like there’s loads of time until college apps, there really isn’t. I’ve always been obsessed with everything design related. I discovered stop motion animations for myself when I was 5 and made more and more complex short films as I grew up. I always drew, I’m currently in an arts school. I thought of app ideas and made sketches of the web pages, created the layouts of the app and all lol. I was always into rescuing homeless animals, and as I saw poor areas often, they were booming with sick, homeless animals. I devised a system of a self sufficient animal shelter, made blue prints of the building, made tons of web pages to solidify the ideas and make it easy to use. I did all of this shiz in elementary. And I loved creating little towns out of cardboard and materials around the house. I also designed t-shirts. \n\nI’ve been doing alot of thinking and realized that I am going to major in design. I’m thinking of doing product design. I am not sure exactly what to major in. Art? Design? If anyone in these majors has advice it would be duly appreciated!!",
  "author": "MademoiselleMimieu",
  "created": 1610486510,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "gjavfw5": {
      "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gjavfw5/",
      "text": "Jesus, you kinda fit yourself into a allot of creative fields there. Which actually is a good thing. Now you just gotta find the one you enjoy the most. \n\nAnyways, my personal advice to you is to make sure you properly read the syllabus/course descriptions for each major you may think of applying to. I'm a Graphic Designer but I ended up pursuing a degree in advertising (since it has many similar elements in it and was in the general direction of what I wanted to do career wise). \n\n**TLDR; Product Design, UX/UI Design or Architecture is probably your best bet based on the activities your described.**",
      "author": "whar_zone69",
      "created": 1610677993,
      "upvotes": 2,
      "replies": {
        "gjb29yp": {
          "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gjb29yp/",
          "text": "Thank you for the advice!! Makes alot of sense. I considered doing advertising but was told that it’s alot of public speaking and presenting in front of people, which completely turned me off. Maybe thats a load of baloney though. May I ask why you did not decide to pursue graphic design? (I know it’s not a super great major, I was just wondering about your individual experiences)",
          "author": "MademoiselleMimieu",
          "created": 1610681706,
          "upvotes": 1,
          "replies": {
            "gjb4o4x": {
              "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gjb4o4x/",
              "text": "\"Public Speaking\" - Advertising (depending on where you study it) has 3 main paths; Art Direction, Copywriting and Accounts/Strategy. These path names are just advertising specific. The reality is, you can get this degree and become a Graphic Designer or go into pretty much any other creative field (once you have a suitable portfolio). **One thing to note is that a degree helps but as a creative your portfolio will always be as equally important.** As for the speaking part, 70% of my schoolwork are group assignments (ad campaigns) that end in group presentations. So yeah, allot of public speaking but from what the profs told me, if you are in the Art Stream (in a real job), this doesn't really apply to you since the account guy is the one doing the whole \"client-agency-relationship\" thingy.\n\n**Edit:** Judging from an earlier post I just saw, if you have high levels of anxiety, then the presentations in advertising might be a problem. I'm not sure how other colleges do it, but I have allot of group assignments. To the point whereby we only have exams in maybe 2 of our 5 classes each semester. I'm introverted but the presentations don't bother me because it's goal oriented and doesn't require me to think on the spot apart from answering comments or questions. Just something to be aware of.\n\n\"Why I didn't pursue G.D.\" - To be short, it's a combination of cost, location and other small factors. (I'm an international student). It's not really a problem with the degree although it could be depending on where you live. I ended up in B.A. in Creative Advertising because the college that offers it was the cheapest in Toronto. I actually wanted to do a degree in Digital Media because it combines Design, Photography, Video, Web Dev etc. but as I said, small factors. In my opinion I think rn, UX/UI is a booming field salary wise. Been seeing allot of entry level jobs with higher starting salaries than G.D. or Art Direction but as expected, this varies heavily from place to place.",
              "author": "whar_zone69",
              "created": 1610683036,
              "upvotes": 2,
              "replies": {
                "gjbi5y9": {
                  "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gjbi5y9/",
                  "text": "Yes, I’ve often heard that graphic designers aren’t asked to show their degree, no one even asks where they graduated from, they just want to know what their work looks like. Also, I’m kind of spinning off rn and have a few careers bouncing in my head. Do you think a major in digital media with a minor in ba is a good idea? Maybe a double major. Just to have back up. I would like to go into the art direction of advertising but landing a job in that position is just so difficult.",
                  "author": "MademoiselleMimieu",
                  "created": 1610691838,
                  "upvotes": 1,
                  "replies": {
                    "gjcehge": {
                      "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gjcehge/",
                      "text": ">\"a major in digital media with a minor in ba\"\n\nI'm a bit confused by this statement (assuming ba means bachelor of arts)\n\nI want to say \"do this or do that degree\", but in general, you really have to look at your circumstances, passion etc and decide. How successful you are after graduating is really gonna vary location to location. It might help to talk to people in these fields within your city if you know any.",
                      "author": "whar_zone69",
                      "created": 1610719827,
                      "upvotes": 1,
                      "replies": {
                        "gjcpspp": {
                          "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gjcpspp/",
                          "text": "Sorry I meant MBA, since design and business intertwine",
                          "author": "MademoiselleMimieu",
                          "created": 1610725629,
                          "upvotes": 1,
                          "replies": {
                            "gjd9o8i": {
                              "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gjd9o8i/",
                              "text": "I (and most of my professors) do not see an MBA as important for a creative unless they plan to teach or want to start a business.\n\nIf business knowledge matters to you, it might be more cost effective to do business electives or a minor within your course. But yeah, even when I check Quora and other sources, most designers do not get MBAs.",
                              "author": "whar_zone69",
                              "created": 1610734769,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gj1mkqw": {
      "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gj1mkqw/",
      "text": "Architecture! I’m majoring in arch so if you want more info, feel free to reach out.",
      "author": "petitesoldat",
      "created": 1610487701,
      "upvotes": 2,
      "replies": {
        "gj1oluv": {
          "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gj1oluv/",
          "text": "yes please! Can I dm you?",
          "author": "MademoiselleMimieu",
          "created": 1610488623,
          "upvotes": 2,
          "replies": {
            "gj1pbc5": {
              "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gj1pbc5/",
              "text": "Yeah totally",
              "author": "petitesoldat",
              "created": 1610488953,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gj1kbcq": {
      "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gj1kbcq/",
      "text": "I also forgot to add onto the first point I made, I already entered a few art competitions, but I want to take college classes in the summer specific to my major and enter a couple competitions in the fall of my senior year to add onto my resume.",
      "author": "MademoiselleMimieu",
      "created": 1610486661,
      "upvotes": 1,
      "replies": {}
    },
    "gj1k5d6": {
      "link": "/r/CollegeMajors/comments/kw11fs/major_related_to_design/gj1k5d6/",
      "text": "and I wrote alot of books lol, kids books for my cousins. I created a character named Piggy the Pig. 😂",
      "author": "MademoiselleMimieu",
      "created": 1610486583,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634060950
}