{
  "sid": "hih2oh",
  "link": "/r/CollegeMajors/comments/hih2oh/confused_between_accounting_and_strategic/",
  "title:": "Confused between accounting and strategic marketing...",
  "text": "I've chosen a business and commerce course in my chosen uni. I haven't finalize my decision on the major I'll be taking, cause I still can't decide between the two.\n\nShould I take accounting or strategic marketing?\n\nAccounting excites me more although my math is decent but not great. My mom wants me to go for accounting, but my friends warn me that accounting might not be very desirable in the long-term due to technology advancements. However, I think this is still far away and is not a very significant factor to consider.\n\nStrategic marketing seems like a safe option, since it sounds like something you can branch out easily unlike accounting. But I know strategic marketing involves customer-oriented concerns, and the idea kinda bores me. Plus I don't really know much about SM, so any insight would be great.\n\nHonestly I would've taken business administration, but the uni my mom chose for me does not offer this major. I could change uni, but that would mean giving up the fees I already paid for (registration fees, etc.). Any advice would be appreciated.",
  "author": null,
  "created": 1593494900,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "fwjh0be": {
      "link": "/r/CollegeMajors/comments/hih2oh/confused_between_accounting_and_strategic/fwjh0be/",
      "text": "If you're interested in accounting, go for it. I've heard opposite things about the job prospects, that it might be the lower level accounting jobs that get automated, but it's very stable and lucrative overall if you become a CPA. Marketing is cool also, and in fact I was actually interested in marketing for a while, but it's definitely a lot more about your experience in it than taking courses which makes you good at marketing. I know people who majored in English, psych, and some people who didn't go to college who make good money marketing, but it's because they have the hustle and skills for it. So even if you major in accounting, you can still do marketing, but it would be harder the other way around. I would recommend accounting for career stability, but it's honestly up to you.",
      "author": "BetUrProcrastinating",
      "created": 1593568115,
      "upvotes": 1,
      "replies": {
        "fwoqymt": {
          "link": "/r/CollegeMajors/comments/hih2oh/confused_between_accounting_and_strategic/fwoqymt/",
          "text": "Thanks. I'm going with accounting due to its career stability and more interesting concept.",
          "author": null,
          "created": 1593691795,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060899
}