{
  "sid": "ec9lei",
  "link": "/r/CollegeMajors/comments/ec9lei/how_useful_is_an_applied_mathematics_bachelors/",
  "title:": "How useful is an Applied Mathematics Bachelor’s Degree?",
  "text": "How does it differ from a straight-up mathematics degree in terms of classes?\n\nWhat are the pros and cons of this degree?\n\nWhat job opportunities does it open up? If, say, I were to pursue a masters in economics would this bachelors degree serve me well?\n\nThanks for any input! I’m just looking for some general discussion here so it’s all on the table :)",
  "author": "T7_Jax",
  "created": 1576655362,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "fba6iko": {
      "link": "/r/CollegeMajors/comments/ec9lei/how_useful_is_an_applied_mathematics_bachelors/fba6iko/",
      "text": "Usually it will require courses outside mathematics. Economics is a frequent option although some are more narrowly focused on the physical sciences. Some go as far as requiring a minor in a cognate discipline. It is also very common for it to require more programming and stats than a pure math degree. \n\nWhat's omitted? Some of the advanced pure mathematics courses need to be left out of the default program to make room for this.\n\nRe: Your comment about economics -- there are a few places that have an undergraduate degree in mathematical economics as well.",
      "author": "jessamina",
      "created": 1576667125,
      "upvotes": 3,
      "replies": {
        "fbc3dsb": {
          "link": "/r/CollegeMajors/comments/ec9lei/how_useful_is_an_applied_mathematics_bachelors/fbc3dsb/",
          "text": "Thanks for so much information! :) It seems like the college I’m thinking about focuses a lot on CS, economics, and statistic in their applied math program which is great to hear as I’m interested in all three!",
          "author": "T7_Jax",
          "created": 1576714679,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059694
}