{
  "sid": "hz18jb",
  "link": "/r/CollegeMajors/comments/hz18jb/high_school_student_interested_in_life_sciences/",
  "title:": "High school student interested in life sciences, looking for major",
  "text": "I am particularly interested in applying cellular and molecular biology for the medical field (Synthetic biology fascinates me). I also have some experience in computer science.\n\nPost-college, I want to pursue graduate school and either continue university research or go into the private sector.\n\nI am currently deciding between BME, biological engineering, and biochemistry (I've heard molecular biology and biotech don't really pay well - ideally looking for a six-figure salary) \n\nWhat do you think?",
  "author": "flaminfiddler",
  "created": 1595885093,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "fzhhci5": {
      "link": "/r/CollegeMajors/comments/hz18jb/high_school_student_interested_in_life_sciences/fzhhci5/",
      "text": "Biomedical engineering is a weird engineering field as it has a lot of overlap with other fields that could cause friction for job hunting.\n\nFor example, if you are trying to apply for a company that makes prosthetic limbs you would have to explain to your interviewer how you skills in anatomy/knowledge in biology will translate to being more beneficial as opposed to an Electrical Engineer whose knowledge of wiring may prove more optimal for the job at hand.\n\nIf you go this route make sure to specialize your classes. I would look heavily into the field of \"Bioinformatics\" which combines computer science, biology, and mathematics to analyze and interpret biological data.\n\nAlso biochemistry is a trap, don't go for it.",
      "author": "Reav101",
      "created": 1595914180,
      "upvotes": 3,
      "replies": {
        "fztwkq2": {
          "link": "/r/CollegeMajors/comments/hz18jb/high_school_student_interested_in_life_sciences/fztwkq2/",
          "text": "Heh, at \"hand.\"\n\nWhy do you say biochem is a trap though?",
          "author": "hlwaileyx",
          "created": 1596169607,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzg4b7l": {
      "link": "/r/CollegeMajors/comments/hz18jb/high_school_student_interested_in_life_sciences/fzg4b7l/",
      "text": "I think the safest option (salary wise) is biomedical engineering and concentrate in tissue engineering since it has to do most with cellular bio",
      "author": "kashewss",
      "created": 1595885491,
      "upvotes": 4,
      "replies": {}
    }
  },
  "updated": 1634059484
}