{
  "sid": "oxfpm5",
  "link": "/r/CollegeMajors/comments/oxfpm5/what_major_should_i_take_interest_in_based_on_my/",
  "title:": "what major should i take interest in based on my likes",
  "text": "hi. i'm struggling to know what i want to major in/follow in the future. i know i like interacting with people and getting to know how their minds work and the way they interact with others so i was thinking psychology but i want to dive deeper into the science behind that (neurology). i don't want to be a psychiatrist though!! i'd like to focus on the brain and the science behind certain things like adhd, alzheimer's, dementia, etc. and apply that to working with people. i feel like neurology would have something to do with that but i don't want to become a surgeon or anything.. i just like getting to know more about the brain and how it affects the way humans act. psychology was an option but i just really want to know the science behind all these things and end up applying it to people. \n\nthank you so much!!!",
  "author": "rinnie-rin",
  "created": 1628033245,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "h7n9q23": {
      "link": "/r/CollegeMajors/comments/oxfpm5/what_major_should_i_take_interest_in_based_on_my/h7n9q23/",
      "text": "You could go into psychiatric medication development and research, you'd ideally need a PhD or at minimum a masters though. A biochemistry/bioengineering/psych double major would probably be a good place to start (though I'm sure your advisor could help you pin it down better depending on which majors your school has).\n\nYou could also go to medical school and just go into research/development after you graduate instead of into private practice. I'm not entirely sure which one I'm going to do yet because I don't necessarily want to interact with the general public even though I think people are interesting but I know I have to do something in psych.",
      "author": null,
      "created": 1628055486,
      "upvotes": 1,
      "replies": {}
    },
    "h7m5yha": {
      "link": "/r/CollegeMajors/comments/oxfpm5/what_major_should_i_take_interest_in_based_on_my/h7m5yha/",
      "text": "Cognitive science? Neuroscience?",
      "author": "MasterLink123K",
      "created": 1628034082,
      "upvotes": 1,
      "replies": {
        "h7m670w": {
          "link": "/r/CollegeMajors/comments/oxfpm5/what_major_should_i_take_interest_in_based_on_my/h7m670w/",
          "text": "if i do end up majoring in either do i have to go to medical school to pursue being a neurologist? thanks!!",
          "author": "rinnie-rin",
          "created": 1628034195,
          "upvotes": 1,
          "replies": {
            "h7mp2vt": {
              "link": "/r/CollegeMajors/comments/oxfpm5/what_major_should_i_take_interest_in_based_on_my/h7mp2vt/",
              "text": "Oo that im not sure about bc im more familiar with these two disciplines in terms of research (so grad school)~ others feel free to chime in!",
              "author": "MasterLink123K",
              "created": 1628043462,
              "upvotes": 1,
              "replies": {
                "h7mtwmo": {
                  "link": "/r/CollegeMajors/comments/oxfpm5/what_major_should_i_take_interest_in_based_on_my/h7mtwmo/",
                  "text": "oh okay!! what’s it like being in grad school for those majors? :,D",
                  "author": "rinnie-rin",
                  "created": 1628045934,
                  "upvotes": 1,
                  "replies": {
                    "h7mvzm1": {
                      "link": "/r/CollegeMajors/comments/oxfpm5/what_major_should_i_take_interest_in_based_on_my/h7mvzm1/",
                      "text": "Perhaps I should clarify, I have a lot of friends who are studying cognitive science and neuroscience and would conduct research about the science behind mental diseases and conditions like ADHD, Alzheimer's, etc. There's also a lot of labs who apply computation to model the brain and conduct analytics work to health (sometimes stress/mental wellbeing related) datasets. I am a CS major but I just have alot of cognitive science / neurosci friends who end up doing research in those areas you mentioned. Since you are more interested in studying the science, graduate school sounds like a better fit than medical school (which to my knowledge is more about clinical practices)",
                      "author": "MasterLink123K",
                      "created": 1628047057,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634059771
}