{
  "sid": "akl3w9",
  "link": "/r/CollegeMajors/comments/akl3w9/what_is_the_good_minor_with_major_in_probability/",
  "title:": "What is the good minor with major in Probability and Statistics?",
  "text": "Should I minor in data science, computer science or econ? ",
  "author": "Jaydenw001",
  "created": 1548659942,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "efl4t8h": {
      "link": "/r/CollegeMajors/comments/akl3w9/what_is_the_good_minor_with_major_in_probability/efl4t8h/",
      "text": "Among those, I think computer science may be the most useful and best for finding jobs after graduation. Go for it if you think you need to spruce up your programming abilities.\n\n&#x200B;\n\nI do very much agree with  [u/Firebat12](https://www.reddit.com/u/Firebat12)'s comment though.\n\n&#x200B;\n\nWhen I did my undergrad in engineering I was playing around with the idea of a physics, math, or philosophy minor. I ended up taking extra classes in all those subjects but didn't get a minor mostly because I'm stupid. But I will say that when I went to career fairs, recruiters were much more interested in the philosophy minor. Why? Because they know as an engineer that I was already great with physics and math. Philosophy was something that set me apart.",
      "author": "Goksun",
      "created": 1549108779,
      "upvotes": 1,
      "replies": {}
    },
    "efahk11": {
      "link": "/r/CollegeMajors/comments/akl3w9/what_is_the_good_minor_with_major_in_probability/efahk11/",
      "text": "I was scrolling reddit and this came up for some reason. Data science seems redundant given you're studying Statistics and Econ is inferior to CS in terms of the skills you could potentially gain if you take those classes. I would go with CS. It will help solidify your computing skill-set which will make a significant difference when you graduate.",
      "author": null,
      "created": 1548792013,
      "upvotes": 1,
      "replies": {}
    },
    "ef728ir": {
      "link": "/r/CollegeMajors/comments/akl3w9/what_is_the_good_minor_with_major_in_probability/ef728ir/",
      "text": "All of your choices are good choices - it just depends what you want to learn more about.",
      "author": "numbersaremygameyall",
      "created": 1548703040,
      "upvotes": 2,
      "replies": {}
    },
    "ef6suuf": {
      "link": "/r/CollegeMajors/comments/akl3w9/what_is_the_good_minor_with_major_in_probability/ef6suuf/",
      "text": "I agree with u/Firebat12, but I'll also add that a computer science minor is extremely valuable. ",
      "author": "bitchassshortie",
      "created": 1548697355,
      "upvotes": 3,
      "replies": {}
    },
    "ef6cau8": {
      "link": "/r/CollegeMajors/comments/akl3w9/what_is_the_good_minor_with_major_in_probability/ef6cau8/",
      "text": "Gonna post what one of my professors told me:\n\n“Employers will be looking at your major to tell what you know and are qualified for. If you decided to minor in something similar it will likely just be extra classes of the same thing you’re doing and will just tell them you know a bit more than average. Whereas a minor in something else shows that you know more than your discipline and might have some varied skills.”\n\nSo follow your heart man. I’m an engineer taking a history minor. Don’t take a minor hoping to learn more about the same shit but to learn something you want to.",
      "author": "Firebat12",
      "created": 1548686597,
      "upvotes": 5,
      "replies": {}
    }
  },
  "updated": 1634059424
}