{
  "sid": "oy9i0c",
  "link": "/r/CollegeMajors/comments/oy9i0c/does_anyone_have_any_experience_with_global/",
  "title:": "Does anyone have any experience with GLOBAL SECURITY major/minor?",
  "text": "I’m in the midst of taking my general education classes and have declared my major as global security. From what I’ve read on my school’s website, we learn about peacemaking efforts and as a humanitarian this seemed like the way I wanted to go. I felt like this degree would give me the tools necessary to actually have a voice. Maybe I could work for the government or a non profit. Ultimately, I want to help people. The more I research the more I see about the military and the last thing I want is more bloodshed. So I’m asking.... what are your experiences with this major? I know the military is necessary but I’m not looking forward to pursuing a degree that has me working closely with the military or forces me to provide the tools they use to kill more people. I might sound ignorant and that’s because I am when it comes to this major... I’m still in the beginning stages. What would I be able to do with this major?",
  "author": "callmeNEPHEW",
  "created": 1628135292,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "h7ska0k": {
      "link": "/r/CollegeMajors/comments/oy9i0c/does_anyone_have_any_experience_with_global/h7ska0k/",
      "text": "“Global Security” is not a common major, which implies that your university has designed this specifically. Because of this, a global security major is not well-defined. Could you share which university or a list of classes are a part of this major so we have a better idea about what you’d be studying?\n\nEdit: this is what American U says about global security studies career paths: “[student learn skills] research, communication, assessment/evaluation, and quantitative analysis—[and can apply these skills] in think tanks, nonprofits, consulting firms, international organizations, and government agencies. Potential career paths include positions as consultants, analysts, administrators, teachers, program/project managers, and others.\n\nStudents may work within the field of global security in areas such as:\n\nConflict resolution\n\nForeign policy\n\nSecurity and intelligence\n\nEnergy and environmental sustainability\n\nEducation and research”\n\nBut, as I said, it’s not well-defined, so another degree program may be focused on other issues/topics.",
      "author": "slouchingbethlehem",
      "created": 1628162940,
      "upvotes": 3,
      "replies": {
        "h7yj1jr": {
          "link": "/r/CollegeMajors/comments/oy9i0c/does_anyone_have_any_experience_with_global/h7yj1jr/",
          "text": "Thank you so much",
          "author": "callmeNEPHEW",
          "created": 1628271064,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060280
}