{
  "sid": "rfwmyo",
  "link": "/r/CollegeMajors/comments/rfwmyo/graduate_a_semester_early_or_double_major/",
  "title:": "Graduate a semester early or double major?",
  "text": "Hi, I am a junior biochemistry student at a small, STEM-focused university. With my schedule as  \nit is, I could graduate a semester early (Fall 2022) (I would actually have to because I would be done with my biochemistry graduation requirements and I could only stay at the university if I am working towards my major), or I could do a double major with chemistry and stay my whole senior year. It's only 5 extra classes, and they would neatly fit into my schedule so there's no conflict there. I have enough financial aid and no loans, so money is not a concern.  \nI plan to go to grad school, for a PhD in chemistry, and my advisor has told me that in this case the double major would not be useful, but he is also the traditional type and has openly expressed his dislike of students double majoring so I take his advice cautiously.  \nI might not go to grad school immediately though, because I have an internship this summer and  \nthey are already saying they would like me to come back full time once I graduate. Due to the nature of the workplace, I could work there and get a PhD simultaneously (i.e. the research I do there in my job I would be using for my PhD as well. So I don't know if it would be more beneficial to be  \nable to go to work a semester early, or to have the extra credential of a chem B.S.  \nThe other thing is, I am involved in undergraduate research and I have to write a thesis, and I  \nthink it would benefit me to have the extra semester to work on that. I'm also unhealthily obsessed with my GPA, and since some of the high level chem classes  are pretty hard, I'm worried that my GPA could potentially dip. Everyone says that having a 4.0 does not matter that much, like a 3.8 or 3.9 will not stop me from succeeding, but I have that nagging doubt that it will. I know it's lame  \nand lazy to avoid more work just because I might not be perfect at it, but I can't stop feeling that way.  \nFinally, I'm just kind of getting sick of school. It is damaging my mental health, I don't feel  \nlike I really \"belong\" in the university community, I don't have a lot of friends, etc., so I kind of want to just get out. I know going somewhere else won't automatically fix everything, but I believe I could benefit from a change of scenery. I'm just tired.  \nIf you've read this far, thanks, and I'd appreciate any advice. I keep going back and forth so I  \nthought some outside perspective could help.",
  "author": "option_infinitearms",
  "created": 1639448273,
  "updated": 1639517781,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hogpshi": {
      "link": "/r/CollegeMajors/comments/rfwmyo/graduate_a_semester_early_or_double_major/hogpshi/",
      "text": "1. Hit the enter key once or twice, your post is hard to read.\n\n2. You're sick of school and a dual major in Chem + Biochem won't do too much for you (with very few exceptions), graduate early and work for a bit before heading back to do a PhD. Also, you might not be able to work and do a PhD simultaneously. When you apply to a PhD program, check to see if they have any bans on secondary employment (your PhD is your primary employment). I have no clue about working in research outside your university for your PhD, so no comment.\n\n3. Why do you want to do a PhD in Chemistry and what area? This is more curiosity than anything else, you'll be fine getting into a PhD program in either Chemistry or Biochemistry as long as your GPA and research experience is there as well.\n\n4. For your thesis, take the time you need, not the time you want. Your funds may not be lacking, but why use money you could put elsewhere?\n\n5. For your GPA, work hard and you'll be fine. Chemistry is a hard degree, you don't need a 3.7, you just need a 3.3+(I'm expecting to graduate around there, but I'll have 4 years of research experience and a few publications). Obviously that is the low end and higher is better, but only as long as you aren't suffering as a consequence. That includes your mental health. Your research experience and work experience will help make-up for a lower GPA.\n\nFeel free to message me to talk, good luck.",
      "author": "Eteranl96",
      "created": 1639451004,
      "upvotes": 5,
      "replies": {}
    }
  }
}