{
  "sid": "qdwswl",
  "link": "/r/CollegeMajors/comments/qdwswl/struggling_to_choose_a_major/",
  "title:": "Struggling to choose a major?",
  "text": "Hi everyone, I recently finished my psych degree and wanted to share some advice for new students who are trying to decide on a major!\n\n\\-First of all, choosing a major is HARD. Somehow society expects us to have it all figured out when we're done high school but a lot of us have no idea what we want to do as a career.\n\n\\-Take courses to explore your options and interests early on (like in first or second year). You can also get work or volunteer experience to see what you like and don't like in a job.\n\n\\-Many, if not, most people end up changing their major at some point. It's completely NORMAL. Of course, you don't want to feel like you wasted your time and money, but if you realize that your major or field of work is just not right for you, you may want to switch. Keep in mind you may also be able to finish the degree you're working on now, then get a different type of education or get work experience to work in a specific field, depending on the career you want. Talk to an advisor if you are farther along in your degree and want to switch majors because this is a big decision!\n\n\\-Finally, don't let you major define you or put you in a box. Your degree is only one thing that employers are looking for, but they also want to see what skills and experience you have. You can always learn more or get experience to get into a different field than what you originally studied.\n\nI also created a video for anyone who is trying to decide what major to choose: [https://youtu.be/\\_6cchu7HHLo](https://youtu.be/_6cchu7HHLo)\n\nGood luck! (:",
  "author": "lindaedith",
  "created": 1634959424,
  "updated": 1635185155,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hhsiytr": {
      "link": "/r/CollegeMajors/comments/qdwswl/struggling_to_choose_a_major/hhsiytr/",
      "text": "Wow. This is great! Thanks a lot for sharing that. I am a freshman and I am in the second term at a community college. So For me I have two major field in my mind one being a healthcare field and the one being cosmetology field but I am not sure which one should I choose to do and leave as well. I am stuck what advise can you offer me as an individual? Please reply. \n\nThank you. :)",
      "author": "UnhappyIndividual794",
      "created": 1635028151,
      "upvotes": 2,
      "replies": {
        "hhu304i": {
          "link": "/r/CollegeMajors/comments/qdwswl/struggling_to_choose_a_major/hhu304i/",
          "text": "That sounds like a tough choice because those fields are pretty different! One similarity I see in both of them is that you are interacting a lot with people and helping them, but in different ways. \n\nI think if I was in your situation, I would try to get more information about what each job / field would look like and whether you would actually enjoy the work. You can do this by volunteering or working in a similar position, or you can do what's known as information interviews. This is when you contact people who work in those jobs and ask them some questions so you can get a sense of what they do, what are the pros/cons of their jobs, and decide whether you want to pursue that type of career. \n\nMost schools also have advisors for their programs and you can ask them about job prospects and other information that would help you make the decision about these two programs! \n\nIt's not an easy decision, but you got this! (:",
          "author": "lindaedith",
          "created": 1635058597,
          "upvotes": 1,
          "replies": {
            "hhy2r6h": {
              "link": "/r/CollegeMajors/comments/qdwswl/struggling_to_choose_a_major/hhy2r6h/",
              "text": "Thanks  a lot! hopefully I will be able to get some information. Also both of the field is what I liked for a while and I can't seem to choose one thing to do. :/",
              "author": "UnhappyIndividual794",
              "created": 1635133350,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}