{
  "sid": "fsi2ac",
  "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/",
  "title:": "I have no idea what I want to do",
  "text": "Hi! A hs junior here. I genuinely have no idea what I want to major in. I’m not sure what I’m even interested in. I wanted to be a teacher, or major in criminology or business, but also i want to make bank. I like nature and binge watching shows. I’ve gotten into science type things and I’m in AP chem and took psych as a sophomore when it was only for upperclassmen. I also have no clue where I want to go to school if I’m even good enough to get in. Nursing is kinda off the table for me as it’s too late to get into it and also it’s such a rigorous major. Also architecture would be really cool however it’s extremely hard (as a major) and I cannot draw for my life. This is all over the place I’m sorry. Please help guide me or anything you can do to help is appreciated!!",
  "author": "fishsoap69",
  "created": 1585678575,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "fnfpkf5": {
      "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fnfpkf5/",
      "text": "It's okay that you dont know what you want to do in high school. I didn't even realize that what I decided to major in was the wrong choice until my freshman year of college. I originally had decided to pursue a degree in Zoology to work with animals, but then realized I wouldn't enjoy it. I don't like science classes and doing experiments. So, I researched for months. I asked every question I could think of. Took numerous career quizzes. My final conclusion was that I would be a great teacher. I would love to teach students. I also love English and am very good at it, so I have now decided to become a high school English teacher. I also am planning on attending a two year nail tech cosmetology program because I live doing nail art. It's sort of my back up plan if teaching doesn't work out. \n\nI know that you want to make \"bank\", as you said, but that isnt really a reliable career goal to have. You may end up disappointed. I would suggest you focus more on your interests rather than what will make the most money. You'd rather love your job right? \n\nI would suggest you make a list of your favorite things to do. Then, make a list of the subjects you like and are good at. Research and make a list of the potential careers that each degree that interests you can lead to. If a career sounds interesting to you, research what the daily job is like. If you are still interested, then consider pursuing that degree. It's mostly process of elimination. Get rid of the jobs that would bore you and keep the ones that you think  would be perfect for you. \n\nAlso, talk with a career counselor, if you're high school has one. Otherwise, I'm sure there's resources at your school to help students with career decisions. Just seek help from anyone. Friends, family, teachers, etc.\n\nI will also tell you that starting in a community college will give you at least two more years to decide. Also, it saves you a lot of money and you can get your general classes done which will help you realize what classes you love. I am currently in my second semester of community college. I'll be transferring in one year to continue my bachelors degree. My community college has lots of career and major resources. They are very good at helping students discover themselves.\n\nI think college is where you're really going to come to your final decision. Don't worry and rush to figure things out. I'm sure everything will turn out fine. You can always change majors as well, if you decide you aren't liking your major program. I know lots of people who switched majors and it worked out better for them. \n\nJust take your time and dont stress about it. You've still got time to decide.",
      "author": "AnonymousPinkDolphin",
      "created": 1586912797,
      "upvotes": 1,
      "replies": {
        "fngo473": {
          "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fngo473/",
          "text": "What if I dont know that I like to do? I feel like nothing interests me?! I dont have a hobby Nd that also makes me mad!! \n\nBut thank you for all this insight! I’ll keep it in mind",
          "author": "fishsoap69",
          "created": 1586938735,
          "upvotes": 2,
          "replies": {
            "fnhbt9u": {
              "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fnhbt9u/",
              "text": "Like I said, in college, you'll probably discover your interests based on classes that you take. I didn't even realize I wanted to be an English teacher until I took a college-level English class. It sort of just came to me. I'm sure the same will happen to you eventually.",
              "author": "AnonymousPinkDolphin",
              "created": 1586959358,
              "upvotes": 1,
              "replies": {
                "fnhtvyp": {
                  "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fnhtvyp/",
                  "text": "Also does changing majors lead to you being in school longer or how does that work",
                  "author": "fishsoap69",
                  "created": 1586968763,
                  "upvotes": 1,
                  "replies": {
                    "fni9yva": {
                      "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fni9yva/",
                      "text": "It depends on how far into your schooling you are. If you switch majors in freshman year, probably won't affect much. If you do it junior or senior year, then you have the possibility of being in school longer. \n\nIt also depends on what majors you're switching. Some of the classes you have already taken might count toward the new major, but others may not. So, it also depends on how many requirements you have already filled. \n\nAll I can say, the sooner the better. It wouldn't be the worst though if you have to stay an extra year. I know a few people who were in a bachelors program for 5 years.",
                      "author": "AnonymousPinkDolphin",
                      "created": 1586976472,
                      "upvotes": 1,
                      "replies": {
                        "fnieb48": {
                          "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fnieb48/",
                          "text": "Ohh okay thank you so much!!!",
                          "author": "fishsoap69",
                          "created": 1586978541,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fn51ie6": {
      "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fn51ie6/",
      "text": "Hey there, I was honestly on the same boat as u when I started college (Its uncanny, really), i know it can be pretty overwhelming and the indecisiveness only adds more fuel. But I suppose my one advice for u would be, talk to people? I consulted a lot with my friends and my siblings about my worries and my doubts and even if just by a little bit, they eased my worry. Also try to research all the careers u could have with each of those interests. Tbh, when I was deciding what to choose as my major, I went crazy with those \"what should I major in?\" or \"what career should I pursue?\" which of course, only left me more confused. The point is, you wont know if you truly like it if you havent tried it. I actually also considered becoming a teacher, going into law and/or criminal justice AND I also switched my major to chemistry after taking AP chem in hs too! ((U and I are freakishly too similar op)). I tried education but my fear of public speaking really did it for me. Chemistry? oof, after taking one class I realized I dont seen myself working in lab so that was it for me. But now im a whole mathematics major??? I dont think I'll ever know what I'm truly passionate about but i love math, i like solving problems and I'm relatively good at it, so why not? I decided to stop scaring myself and chose to go with the flow. Maybe in the future I'll end up switching but whatever, the whole point is to figure myself out (: \n\nBut as someone else had mentioned, go in undecided and try a bunch of classes out! You'll learn what you like, what u dont and what to avoid. I hope for the best for u, OP! c: \n\nps. Seriously, even the architect and drawing part of ur post gave me goosebumps... OP r u me??",
      "author": "Park_Account",
      "created": 1586653711,
      "upvotes": 1,
      "replies": {
        "fn5iui3": {
          "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fn5iui3/",
          "text": "Wow this was really helpful and also scared me how similar we are!!!! That’s so crazy! I also like math but not enough to go into it. I’m trying to use my free time to SAT prep and research more instead of watching tv or baking. I’ve been leaning towards accounting also but still not sure. \n\nIf I go undecided does it hurt my chances to get into the school? \nOr if I apply with a major and switch is that better? \n\nThank you for all your help!",
          "author": "fishsoap69",
          "created": 1586666042,
          "upvotes": 1,
          "replies": {
            "fn7e84h": {
              "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fn7e84h/",
              "text": "hi there! I doubt going in undecided will affect you when u actually apply to ur college. Usually, ur first and second year of uni is to do ur basics; in which in these 4 semesters u can take some electives! (Or at least that's how they do it at my univ) I suggest also take notice of any clubs on campus and email the representatives for most often than not, they can give u information about their club and career prospects AND u can meet people! Accounting is pretty challenging but rewarding. I took two years of it during my HS years and I liked it, it just wasnt for me ahaha. To answer the second part of ur question, I did that actually. I went in with a major then switched towards the end of the semester. However, I should say that I did do some dual credits in HS so i was practically done with my core curriculum therefore, i had to start with my degree plan (aka full on existential crisis TT). But I am pretty much on track again after taking some summer classes(: Anyhow, whatever choice u make, I dont see it affecting u in the long run. Also goodluck with ur SATs!! I hope you achieve ur goal! (:",
              "author": "Park_Account",
              "created": 1586718580,
              "upvotes": 1,
              "replies": {
                "fn7evax": {
                  "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fn7evax/",
                  "text": "Thanks so much for all this information. I’ll keep it in mind and do more research. It was really helpful!! Good luck to you too though!",
                  "author": "fishsoap69",
                  "created": 1586718943,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fmmoqlw": {
      "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fmmoqlw/",
      "text": "Bro just go in undecided and see what you like.  you’re all over the place",
      "author": "andrewmichaudd",
      "created": 1586209194,
      "upvotes": 1,
      "replies": {
        "fmmrzq5": {
          "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fmmrzq5/",
          "text": "Do I have a good chance of getting in if I go undecided?",
          "author": "fishsoap69",
          "created": 1586210950,
          "upvotes": 1,
          "replies": {
            "fmn0sao": {
              "link": "/r/CollegeMajors/comments/fsi2ac/i_have_no_idea_what_i_want_to_do/fmn0sao/",
              "text": "I don’t think it would change the chances you had prior",
              "author": "andrewmichaudd",
              "created": 1586215825,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634060823
}