{
  "sid": "js0ux3",
  "link": "/r/CollegeMajors/comments/js0ux3/major_help_pleasee/",
  "title:": "Major Help Pleasee!",
  "text": "I’m currently a highschool senior and although I have always done quite well in school and tried to challenge myself in taking as many classes in different areas there hasnt been one that stood out to me over the others. I just don’t know where to go from here and although i have finished submitting my college applications I still feel so lost on where i’m going to go in life. I have kind of narrowed down my list of potential majors to the following but I am in no way subject to only these. If anyone has any opinions on any of these majors or minors I have listed please let me know, all information is helpful!\n\nBiomedical Engineering\nBiotechnology \nEnvironmental Engineering\nPhilosophy \nLiterature\nPolitical Science\nScreen Writing \nCinematography \nEconomics\nCriminal Justice\nBusiness \nCriminal Psychology \nMarine Biology\nJournalism",
  "author": null,
  "created": 1605066996,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "gdi1qgo": {
      "link": "/r/CollegeMajors/comments/js0ux3/major_help_pleasee/gdi1qgo/",
      "text": "My advice to you is to keep your options open and learn more about the the disciplines by using some of your early free electives.  You have very diverse interests and have interests in a range of disciplines that require very different aptitudes, and have very different risk/reward profiles.  You need to better understand your relative aptitudes for these areas, and your career risk tolerance.  \n\nAs you explore the pre-requisite courses you will get a sense of how your abilities aligns with the rigors of each discipline.  Engineering requires very strong math, applied science and problem solving skills, and often very little in communications, psychological or interpersonal skills.  Journalism requires excellent writing, interpersonal and communications skills, but little in the way of mathematics or technical skills.\n\nRegarding the risk reward, consider that business majors usually can find a job somewhere because they are generalist in wide demand.  Screen writing or cinematography are high risk high reward majors in that most graduates can't even get their screenplays looked at by producers, but a very small few get rich.  Many artistic endeavors follow this pattern.  I am not encouraging one or the other path, just that you be aware of the difference.\n\nAn undeclared major, or a more general major that has some flexibility and decent job prospects may be a good choice for you at this time.  Just be sure to explore your interests by taking electives in some different areas, and keep your options open by taking pre-requisite courses that would apply to multiple majors.  Remember you can always change majors later, and many students do.",
      "author": "dmstew",
      "created": 1606263053,
      "upvotes": 1,
      "replies": {}
    },
    "gc5n4mo": {
      "link": "/r/CollegeMajors/comments/js0ux3/major_help_pleasee/gc5n4mo/",
      "text": "I’m a biomedical engineering major right now and I love it. The curriculum (at my school at least) is very focused on the R&D side of things and project based classes where we either design new medical devices or design improvements for medical devices that already exist. If that sounds like something that interests you then I’d say BME is a great way to go. Also even if you don’t go into engineering as a career, the engineering problem solving process can be extremely useful in many areas of life and in other career fields as well.",
      "author": "lechebanda",
      "created": 1605279411,
      "upvotes": 1,
      "replies": {}
    },
    "gbzoxvj": {
      "link": "/r/CollegeMajors/comments/js0ux3/major_help_pleasee/gbzoxvj/",
      "text": "I am personally a Crim J major, though I know it is not for everyone. I didn't decide my major until the middle of freshman year (I'm a sophomore now). You don't need to rush picking your major, odds are it will change anyway once you get to college. I cannot tell you how many people I have met who said they want to be a \"Forensic pathologist\" or \"Criminal Behavioralist\" without actually knowing even in the slightest what those things mean. \n\nTake a wide variety of classes your freshman year, Psychology, History, Crim J 101, Engineering, etc. Whatever you feel like you *could* enjoy. Then once you figure out which you enjoy the most, narrow it down further. Psychology for example, let's say you like it. Find out what you can do with the degree, police officer, social worker, counselor, etc., are all viable options. \n\nDon't stress about it too much, if you're a good student it will come around eventually. The people who have the most trouble are typically the ones not doing well in school. You got this.",
      "author": "Frozenblade11",
      "created": 1605142407,
      "upvotes": 2,
      "replies": {}
    },
    "gbysb5o": {
      "link": "/r/CollegeMajors/comments/js0ux3/major_help_pleasee/gbysb5o/",
      "text": "I had the same problem honestly, and I still am having the same problem as a sophomore in college. I was good at most of the advanced subjects I took, but I chose chemical engineering because STEM and because it’s a professional degree. I’m now rethinking my life choices and am ragingly unhappy so definitely don’t do what I did.\n\nI think it’s important to consider what you would miss if you didn’t have the other. A comprehensive and inclusive college education is a myth, especially when you come in with a lot of credit which it seems like you will. You’ll be able to get into your major specific classes early on, which can be a blessing and a curse, more so the latter if you aren’t really sure about what you want to do.\n\nAsk yourself: “Would I miss having to do endless problem sets and math and logical computing if I majored in the humanities? Or would I miss writing essays and critical thinking and analyzing readings if I majored in STEM?” If yes to both, think about which you’d miss more. Or look into dual degree programs/interdisciplinary degrees that might dovetail your interests. Or choose one as a major as one as a minor. Remember your major doesn’t dictate your profession or career, and sometimes it’s better to think about what you want to do at your job and what kind of lifestyle you want, and go from there, rather than worry about what you want to study. Best of luck! :)",
      "author": "beepboopidontknow",
      "created": 1605123891,
      "upvotes": 1,
      "replies": {}
    },
    "gbxpt7f": {
      "link": "/r/CollegeMajors/comments/js0ux3/major_help_pleasee/gbxpt7f/",
      "text": "for me anything to do with criminology, you will find it interesting and enjoyable",
      "author": "joslynlar",
      "created": 1605104283,
      "upvotes": 1,
      "replies": {}
    },
    "gbwm865": {
      "link": "/r/CollegeMajors/comments/js0ux3/major_help_pleasee/gbwm865/",
      "text": "Which of these classes do you enjoy the most?\nI will recommend avoiding Criminal Justice and Political Science.\n\nThe first three you listed requires more than 5  advanced math courses.",
      "author": "DetectiveTacoX",
      "created": 1605069227,
      "upvotes": -1,
      "replies": {
        "gbxmen6": {
          "link": "/r/CollegeMajors/comments/js0ux3/major_help_pleasee/gbxmen6/",
          "text": "I’m currently taking AP Calculus, AP Literature, AP Physics, and AP Government. My favorites of these classes would definitely be Calculus and Literature but I just don’t really know which way to lean because their both so opposite.",
          "author": null,
          "created": 1605102149,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060451
}