{
  "sid": "f4rzpz",
  "link": "/r/CollegeMajors/comments/f4rzpz/choosing_my_major/",
  "title:": "Choosing my major",
  "text": "Hello Reddit!\n\n&#x200B;\n\nThe time of deciding my major to start university has arrived finally, I have chosen 8 majors that I want to narrow down to a single one to start my education in it. I want your opinions on each major (pros/cons), which one has more income? which one is more needed in the near and far future? Those are the 8, they are all related to computers and data\n\n1. Informatics\n\n2. Information Science and Technology\n\n3. Information Systems\n\n4. Data Sciences\n\n5. CyberSecurity\n\n6. Computer Science\n\n7. Computer Engineering\n\n8. Computer Information Systems\n\nAll opinions are needed!\n\n&#x200B;\n\nThanks a bunch!!",
  "author": "sal133q8",
  "created": 1581866439,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "fhzl56b": {
      "link": "/r/CollegeMajors/comments/f4rzpz/choosing_my_major/fhzl56b/",
      "text": "All of these degrees are very similar and will have very similar career paths / allow you to work similar jobs. The ones that need more math will make more money, as a generalization but they're so connected, most jobs will qualify you for more things. Computer science and engineering will probably qualify you for most jobs you will want with the degrees. \n\nconsider reading /r/itcareerquestions and /r/cscareerquestions - they will tell you about different jobs you can get. they can also link you to related subreddits.\n\nI'd avoid more specific degrees - such as cyber security and data sciences - because they pigeonhole you. At the moment, you probably don't want that since you haven't decided yet.",
      "author": "Worrosp",
      "created": 1582002613,
      "upvotes": 1,
      "replies": {
        "fi3w1rr": {
          "link": "/r/CollegeMajors/comments/f4rzpz/choosing_my_major/fi3w1rr/",
          "text": "Whats the difference between computer science and engineering? do you think i should take one of them as a major and cybersecuirty as a minor?",
          "author": "sal133q8",
          "created": 1582128853,
          "upvotes": 1,
          "replies": {
            "fi3wvai": {
              "link": "/r/CollegeMajors/comments/f4rzpz/choosing_my_major/fi3wvai/",
              "text": "To the best of my knowledge, computer engineering deals with the hardware and computer software deals with software, as a gross simplification, to the best of my knowledge. \n\nIf you're looking into cyber security, it pairs better with computer science. Comp engineering and cyber security are very different - the things a comp engineer does are very different from what someone in cybersecurity does  Computer science and cyber security are more intertwined. IT would also work for cybersecurity.",
              "author": "Worrosp",
              "created": 1582129345,
              "upvotes": 1,
              "replies": {
                "fi3x5n9": {
                  "link": "/r/CollegeMajors/comments/f4rzpz/choosing_my_major/fi3x5n9/",
                  "text": "Thank you! ill do cs with cs :P",
                  "author": "sal133q8",
                  "created": 1582129517,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634061433
}