{
  "sid": "k1otrx",
  "link": "/r/CollegeMajors/comments/k1otrx/help_engineering_major/",
  "title:": "Help - Engineering Major?",
  "text": "Thanks for taking the time to read.\n\nI'm a high school senior who is filling out their college apps. Some of these apps require you to put down a major or \"undecided\". Now, I know I'm going to major in some type of Engineering, but which I'm just not sure. I originally wanted to major in Mechanical Engineering because I like the physical aspect of the subject, however now I'm thinking I should go more into Electrical Engineering because I heard it's more math heavy (math is my passion, and if I didn't have to worry about money and paying off college debt I would probably do a Pure Math degree and work in academia). I also really like working with Python and CAD software, and would want my major to complement that. I also don't want to put down \"undecided\" because I also heard that doing so might hurt your chances of getting accepted. What should I do?",
  "author": "QuantumKumquat0",
  "created": 1606429663,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "gfb2vci": {
      "link": "/r/CollegeMajors/comments/k1otrx/help_engineering_major/gfb2vci/",
      "text": "The first year or two of most engineering programs is the same. Just put Electrical on the application if that's what you are thinking. You can always change your mind with little to no penalty for quite some time. The first semester you will probably take Engineering 101 where they help you decide what to focus on.",
      "author": null,
      "created": 1607624676,
      "upvotes": 2,
      "replies": {}
    },
    "gewogss": {
      "link": "/r/CollegeMajors/comments/k1otrx/help_engineering_major/gewogss/",
      "text": "Computer engineering is vast so many be that is why Google is being vague.\nYou can choose pure programming.\nYou can do project management \nYou can choose electronic programming \nYou can choose cloud computing.\n\nYou have many more options that I can't think of right now. It doesn't use pure math but u will need the logic of math.",
      "author": "scrmu",
      "created": 1607311813,
      "upvotes": 1,
      "replies": {}
    },
    "gdpo6qc": {
      "link": "/r/CollegeMajors/comments/k1otrx/help_engineering_major/gdpo6qc/",
      "text": "Have you considered computer engineering? It’s a mix of computer science and electrical engineering",
      "author": "yellochoco44",
      "created": 1606432308,
      "upvotes": 3,
      "replies": {
        "gdpyov1": {
          "link": "/r/CollegeMajors/comments/k1otrx/help_engineering_major/gdpyov1/",
          "text": "I haven’t actually. Could you describe what computer engineers do, what the job market is like, etc.? I’m getting a vague idea from Google but would like something more concrete.",
          "author": "QuantumKumquat0",
          "created": 1606438856,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059725
}