{
  "sid": "jt7ifz",
  "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/",
  "title:": "I would like to work with sharks and reptiles. What college major would be best for me? Preferably someone that rehabs and similar things.",
  "text": "Also, if you have any experience in these fields, any advise for what I can do now? I’m in 8th grade.",
  "author": "Foot-thief",
  "created": 1605229630,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "gc4esac": {
      "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc4esac/",
      "text": "Biology. Or if the school has a specific animal science/marine biology type program, that would work.",
      "author": "depressed_jewel",
      "created": 1605240768,
      "upvotes": 3,
      "replies": {}
    },
    "gc44gbm": {
      "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc44gbm/",
      "text": "Probably marine biology.",
      "author": "las921",
      "created": 1605234775,
      "upvotes": 1,
      "replies": {}
    },
    "gc42seh": {
      "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc42seh/",
      "text": "I also have interests in working with reptiles and you might wanna check out Christopher Gillette. He is a wildlife biologist/zoologist for Everglades National Park and he has a lot of great content and he has definitely inspired me to take interest in that kind of career. Here is his video about his experiences and advice for following a career path similar to what he does https://youtu.be/OikHRvO2Q8I",
      "author": "jvst_joshin",
      "created": 1605233835,
      "upvotes": 2,
      "replies": {
        "gc44tje": {
          "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc44tje/",
          "text": "Never heard of him, thank you for giving me this info! I’ve been searching a long time for someone in the career to explain from experience",
          "author": "Foot-thief",
          "created": 1605234979,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gc40d0z": {
      "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc40d0z/",
      "text": "Probably bio or animal science. \nThen you will probably need your Doctor of Veterinary Medicine\n\nNow, volunteer at the animal shelter or humane society.",
      "author": null,
      "created": 1605232470,
      "upvotes": 4,
      "replies": {
        "gc40vnc": {
          "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc40vnc/",
          "text": "Ok thank you! I foster cats but it’s not on record or anything, I just find them in dumpsters and such. I can definitely volunteer.",
          "author": "Foot-thief",
          "created": 1605232762,
          "upvotes": 3,
          "replies": {
            "gc6rrjs": {
              "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc6rrjs/",
              "text": "Biology. A lot of schools also offer dual majors in Microbiology, and taking on a related minor (Molecular Biology, for example, would be easy due to the chemistry already required, or bioinformatics due to the very few additional programming courses required) and a speciality minor (ex. marine biology) could def be useful to consider.\n\nThat's all way on down the line, though. For now, focus on doing well in your sciences and maths. Once in highschool, if you can get permission, I highly recommend taking maths and sciences from CCP programs (college credit plus), as surprisingly, the Professors are generally nicer than highschool teachers and you can earn college credit early on that will transfer into your university (and thus give you more time to specialize or do research/internship). \n\nIf you fail a CCP course, it won't reflect in your later university, and if you ever want to go on post-grad, it can easily be explained with \"highschooler.\"",
              "author": null,
              "created": 1605299761,
              "upvotes": 2,
              "replies": {
                "gc6rvmo": {
                  "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc6rvmo/",
                  "text": "Thanks! This is very useful:)",
                  "author": "Foot-thief",
                  "created": 1605299817,
                  "upvotes": 2,
                  "replies": {
                    "gc6sdrr": {
                      "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc6sdrr/",
                      "text": "Sure thing! The most important thing to remember is that even if these more specified complex subjects and \"college CCP oooo\" sound daunting, they're really not once you get into them, you just need to have a good understanding of the information that comes first before. If anyone ever tells you to fear Organic Chemistry, the only people who really have to fear it are pre-meds, and they've got a lot more than organic chem to worry about.",
                      "author": null,
                      "created": 1605300066,
                      "upvotes": 2,
                      "replies": {
                        "gc6t8tp": {
                          "link": "/r/CollegeMajors/comments/jt7ifz/i_would_like_to_work_with_sharks_and_reptiles/gc6t8tp/",
                          "text": " Yeah, I’m in high school credit classes now and taking high school classes like algebra, and am in a college program. Im just trying to figure out how to get everything set!",
                          "author": "Foot-thief",
                          "created": 1605300493,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634061439
}