{
  "sid": "qsjv14",
  "link": "/r/CollegeMajors/comments/qsjv14/is_business_administration_that_bad_of_a_major/",
  "title:": "Is Business Administration that bad of a major?",
  "text": "I've recently been admitted as a Business Administration major, but I've been hearing that its literally a \"blow off\" major and that its useless. So I'm wondering, is it really that bad of a major?",
  "author": "kashmiri-chai",
  "created": 1636748295,
  "updated": 1637182129,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkf6nhm": {
      "link": "/r/CollegeMajors/comments/qsjv14/is_business_administration_that_bad_of_a_major/hkf6nhm/",
      "text": "Yes because it doesn't teach you any real skills to attribute to a company. It gives you a great overview of different aspect of business. It would be good if you already knew what small business you wanted to start. But company's don't hire recent graduates just because they were given a general overview of finance market and ops that mostly has nothing to do with their specific industry. They want to hire accountants, sales people, marketing, HR, lawyers, computer science majors, analysts, or other tools for their business.",
      "author": "Spread_N_Spit",
      "created": 1636777337,
      "upvotes": 2,
      "replies": {}
    },
    "hke21gv": {
      "link": "/r/CollegeMajors/comments/qsjv14/is_business_administration_that_bad_of_a_major/hke21gv/",
      "text": "Kind of. People who don’t know what they want to major in but know they want business choose business admin. It has that reputation because it’s not specialized and there is no specific career that you might choose. It’s also probably easier than other business majors so less work.",
      "author": "thekidboy",
      "created": 1636757250,
      "upvotes": 1,
      "replies": {
        "hkfhfgs": {
          "link": "/r/CollegeMajors/comments/qsjv14/is_business_administration_that_bad_of_a_major/hkfhfgs/",
          "text": "What about accounting ? What do you think of it?",
          "author": "Ok-Mouse3042",
          "created": 1636784117,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}