{
  "sid": "rbi4s8",
  "link": "/r/CollegeMajors/comments/rbi4s8/does_psyc_major_pay_well/",
  "title:": "Does psyc major pay well?",
  "text": "I’ve heard they could make anywhere between 20k- 100k but also some people say it’s useless, is that true??",
  "author": "kashmiri-chai",
  "created": 1638936080,
  "updated": 1639517795,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hnoh56k": {
      "link": "/r/CollegeMajors/comments/rbi4s8/does_psyc_major_pay_well/hnoh56k/",
      "text": "Depends on wether you're willing to get a masters or phd. If you're just planning on getting a bachelor's then you'd be getting paid pretty low, anything above that is prob hit or miss, don't quote me though :P",
      "author": "Need_a_job_bob",
      "created": 1638936438,
      "upvotes": 5,
      "replies": {
        "hnojl8c": {
          "link": "/r/CollegeMajors/comments/rbi4s8/does_psyc_major_pay_well/hnojl8c/",
          "text": "Nah that's true. Although a lot of people graduate with a psychology degree every year, they didn't take in account that only a bachelor's isn't going to get you really far. And your best bet is getting a PhD, because even a Master's will get you far, but not too far as well.",
          "author": "Kiwi_1127",
          "created": 1638937837,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnp11na": {
      "link": "/r/CollegeMajors/comments/rbi4s8/does_psyc_major_pay_well/hnp11na/",
      "text": "It depends on whether you have a career plan that you’re working on alongside your psychology degree. \n\nIf you do a marketing internship or two, join a career-related student organization, and maybe take some extra coursework in web coding/design/marketing, you can launch yourself into a marketing career with solid long-term salary prospects. (Same deal for other careers like HR if you do a directly relevant internship.)\n\nIf you go on to get a graduate degree after you finish your bachelor’s, you could ultimately make six figures, depending on the specialization you choose.\n\nIf you just get your bachelor’s degree, don’t do any internships, and/or don’t do much else to build your resume while you’re in school, you will probably struggle to find a decent job after you graduate. This is true for the more “practical” degrees too, BTW.\n\nMost of the people telling you psychology is useless are either struggling psychology graduates who didn’t do any career-related internships, people who know someone like that, or people who don’t actually know anything about the psychology major job market but like to spout the false conventional wisdom that there are no good jobs for anyone who didn’t study computer science, engineering, or accounting. (These jobs are a small percentage of the total job market, and most employers outside those fields care about internships far more than your major.) A lot of people seem to think your major is supposed to directly lead to a career all on its own — this is not how it works for most people in real life.",
      "author": "Lily9879",
      "created": 1638950410,
      "upvotes": 2,
      "replies": {}
    }
  }
}