{
  "sid": "pngpls",
  "link": "/r/CollegeMajors/comments/pngpls/majors_career_opportunities_with_broad_interest/",
  "title:": "Majors & Career Opportunities with broad interest in Research & Analysis",
  "text": "Hey! I'd like some advice on possible majors alongside its career opportunities involving either research or analysis.\n\nBackground details about myself:\nI do not know how to code, do not have any known interests in any form of science, and am average in math, but better in English and enjoy reading.\nI've always liked researching a wide range of things throughout life. I would always be proficient at least in researching topics. This could range from simply me experimenting with different food recipes, trying to get it to a lower k/cal and same taste or even going down rabbit holes to find information for my friends. \n\nI don't know what type of analysis I would enjoy doing or try to learn especially if it involves technology as I am a bit scared to learn coding and go into advanced math topics.\n\nPossibilities: I was thinking of majoring in finance or business; with a minor in something that stands out, but is easy in the tech field. I am not totally passionate in any of these, but I am thinking that my interests will probably fall around these.",
  "author": "Comprehensive_Bid108",
  "created": 1631543758,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hcqq34q": {
      "link": "/r/CollegeMajors/comments/pngpls/majors_career_opportunities_with_broad_interest/hcqq34q/",
      "text": "Are you me??? I thought I’d be a good librarian since they help with research. Good luck. I’d love to hear what you do.",
      "author": "Not_High_Maintenance",
      "created": 1631568705,
      "upvotes": 2,
      "replies": {
        "hcszrlk": {
          "link": "/r/CollegeMajors/comments/pngpls/majors_career_opportunities_with_broad_interest/hcszrlk/",
          "text": "Lol I didn't expect someone to relate to me, but it makes sense. I am only a junior in HS, so I do have a bit of time to figure out, but I will probably try to find a science that isn't overly boring or complicated.",
          "author": "Comprehensive_Bid108",
          "created": 1631616708,
          "upvotes": 2,
          "replies": {
            "hcthwf1": {
              "link": "/r/CollegeMajors/comments/pngpls/majors_career_opportunities_with_broad_interest/hcthwf1/",
              "text": "There are many of us out there including my young-adult son. I’m middle-aged now. Career jumped for awhile. Ended up in nursing and loved it especially hospice nursing and Alzheimer’s nursing. Looking back I might have more satisfied overall in something else.",
              "author": "Not_High_Maintenance",
              "created": 1631627096,
              "upvotes": 3,
              "replies": {}
            },
            "hcy1f98": {
              "link": "/r/CollegeMajors/comments/pngpls/majors_career_opportunities_with_broad_interest/hcy1f98/",
              "text": "Paralegal maybe?",
              "author": "Not_High_Maintenance",
              "created": 1631710824,
              "upvotes": 1,
              "replies": {
                "hcyf8vi": {
                  "link": "/r/CollegeMajors/comments/pngpls/majors_career_opportunities_with_broad_interest/hcyf8vi/",
                  "text": "It might sound a bit immature or stupid, but I just don't feel like going to legal/law stuff as my older brother recently graduated w/ a deg in cj & poli sci then landed a job as a paralegal intern or something.",
                  "author": "Comprehensive_Bid108",
                  "created": 1631717175,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634060309
}