{
  "sid": "lkh9am",
  "link": "/r/CollegeMajors/comments/lkh9am/stay_in_chemical_engineering_or_switch_to/",
  "title:": "Stay in chemical engineering or switch to chemistry?",
  "text": "I'm currently in my second year of chemical engineering, but recently I've been seeing myself as increasingly likely to pursue a career in research, and have little desire to go into industry. Though I find both fields really interesting, I've been enjoying my chemistry classes a bit more than my chemE classes. \n\nWhile I could easily switch to the chemistry department, now that I've completed two years of chemE requirements, I'm no longer sure if that's in my best interest. ChemE is a BS degree while chemistry is a BA at my school, so if I switch to chemistry, I have to take four semesters of a language and a few extra humanities classes. I don't mind taking a language/humanities, but since I only have 5 core chemE departmentals left, these more or less cancel each other out. A lot of my remaining chemE requirements are electives, so based on my current plan as a chemE, I would be leaving college with 2 semesters gen chem, 2 semesters organic chem, 2 semesters physical chem, a semester of inorganic chem, and courses in materials science and environmental chemistry. Aside from the language, I will actually have met all the requirements of a chem major upon graduation even as a chemE (double majoring is not allowed and there is no chemistry minor, but I will have minors in materials science and environmental studies). \n\nWhat attracted me to chemE in the first place was the versatility it offers upon graduation. My interests have historically changed very frequently and I can't say with absolute certainty if I'll still want to get a PHD two years from now. All labs at my school have been closed due to the pandemic, so it's been very hard to decide what's right for me. However, now that I'm interested in chemistry research, I want to make sure that option is available after I graduate. If I stick it out in chemE but take all those chemistry courses I've described, would I be in a good place to pursue graduate-level chemistry research? I've been doing (virtual) research over my summers/breaks and can start doing research during the school year junior fall in either major. Some of the other considerations are that in chemistry I would probably end up with a slightly higher GPA and more time on my hands to dedicate to research due to a less rigorous course schedule, which I know is very important for grad school. Another more subjective factor is that I feel I have good connections with other students in chemE and have enjoyed the community, whereas I don't currently have connections in the chem department and the high presence of premeds in the major gives rise to a bit more of a competitive atmosphere. \n\nI've been struggling with this decision for a while and would really appreciate some advice.",
  "author": "dfimare",
  "created": 1613406960,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "gnjyq1m": {
      "link": "/r/CollegeMajors/comments/lkh9am/stay_in_chemical_engineering_or_switch_to/gnjyq1m/",
      "text": "You can finish your chem eng degree and apply for a PhD in chemistry.",
      "author": "biggerarmsthanyou",
      "created": 1613411012,
      "upvotes": 1,
      "replies": {
        "gnjzfg9": {
          "link": "/r/CollegeMajors/comments/lkh9am/stay_in_chemical_engineering_or_switch_to/gnjzfg9/",
          "text": "Do you think that would put me at a disadvantage when it comes to applying for a chemistry PhD?",
          "author": "dfimare",
          "created": 1613411349,
          "upvotes": 1,
          "replies": {
            "gnlidkl": {
              "link": "/r/CollegeMajors/comments/lkh9am/stay_in_chemical_engineering_or_switch_to/gnlidkl/",
              "text": "I don’t think so. I mean Linus Pauling, the famous chemist, did that. Chem eng degree to a physical chemistry and mathematical physics PhD. Take lots of chem electives and courses and I think you can definitely do this.",
              "author": "biggerarmsthanyou",
              "created": 1613438548,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634060209
}