{
  "sid": "it97kg",
  "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/",
  "title:": "(F) 17 Senior in high school and just realized the major i wanted to go for isn’t good for me anymore.",
  "text": "I have a lot of life goals and plans for after high school and/or college. depending how things work out. some of those plans could make me money! but they’re not a career. i do eventually want to open up my own cafe since i plan on living in a busy popular area for a long period of my life. but now i am not sure what career i’m going to have. i originally wanted to go for interior design by the average salary isn’t that great. i’m not money oriented but i want to have enough money to support myself, hopefully a family someday, and still be comfortable. i’d say around 60-70k at least to begin with since i know i can always work my way up. i love love love love animals but i don’t want to be a vet. i love the environment and nature so much too. i wasn’t the BEST at math but i’ve been pretty good at science (other than chemistry) i do like art as well but i know a lot of times that doesn’t pay well and i’d be better off doing it as a hobby while i have a real job first. please help! i also love to cook but my dad works in restaurants and is miserable so if there’s anything outside of that maybe those ideas could be great. i’m currently looking at being an environmental scientist but it doesn’t get me too excited.",
  "author": "k0rrin3",
  "created": 1600178034,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "g803v4p": {
      "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g803v4p/",
      "text": "If your big dream is the cafe, maybe try a tech school that offers a good culinary program--and make sure there are many management classes in there too-possibly an accounting one since you'd do some payroll and marketing/advertising maybe?\n\nFor your animal fix, you could foster a dog/cat for a local rescue.  If you can't do that, maybe you can volunteer in their shelter once a week to help out?\n\nAnother thing for your animal fix is that there are vacations you can take that you get to work with animals.  You go there and stay at their housing and depending on what you sign up for, you could help with shelter animals, help with lionfish and there was one where you help with baby turtles when they're hatching!  I think those were around Costa Rica or Honduras? Somewhere in that area.  They also had ones in Africa and Asia that help with those  animals.  The trips weren't horrendously priced and looked like fun. I had a friend that went on one and said it was the best vacation ever and absolutely life changing.  One more low-key animal vacation would be being a volunteer at Best Friends Animal Sanctuary.  You can also stay on property and have a dog stay with you at night if you want!",
      "author": "peachpitafterdark",
      "created": 1602079025,
      "upvotes": 2,
      "replies": {}
    },
    "g5ehya9": {
      "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5ehya9/",
      "text": "Have you ever looked at a major in business? Perhaps marketing?",
      "author": "barrett261",
      "created": 1600203777,
      "upvotes": 2,
      "replies": {
        "g5f0nc2": {
          "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5f0nc2/",
          "text": "yeah i think i might look at more specific types of business degrees since just a business degree is a little too general but that’s a good idea",
          "author": "k0rrin3",
          "created": 1600212943,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g5egu2c": {
      "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5egu2c/",
      "text": "Marine biologist sounds like it could be a good path for the animals.\n\nIf you're thinking about owning a business such as a Cafe, then why not business? Its a solid major that will give you connections and is generap enough to where you could easily pivot post graduation if you wanted.\n\nUltimately I see any degree as a half business degree. From the business majors that I knew in school, its mostly about learning the lingo and then they test you on memorization (I'm making wild generalizations, I know).\n\nSo my recommendation is to go into school as a marine biology major with a business minor. Minors are jokes as they won't add any value to your resume, but you will learn the lingo and make some connections. Front load the business minor so that in your sophomore year you can decide \"do I want to pursue a business degree or continue with my marine bio degree?\".\n\nMy advisor gave me advise like this. I was a math major that wanted to go for computer science. I wanted to switch and he said \"declare a double major, then decide which you want to pursue. Drop one if you feel the need\". I graduated with both, but ultimately pursued cs",
      "author": "travishummel",
      "created": 1600203325,
      "upvotes": 2,
      "replies": {
        "g5f0hvl": {
          "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5f0hvl/",
          "text": "this was actually really helpful. i always decides i was going to minor in business but for some reason i never considered it as a major",
          "author": "k0rrin3",
          "created": 1600212859,
          "upvotes": 1,
          "replies": {
            "g5f72cp": {
              "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5f72cp/",
              "text": "I'm glad.\n\nWhen you get into college people will act like a minor is worth half a degree. So they walk around like they are better than people thinking they are graduating with 1.5 degrees. \n\nSame thing for double majors. They walk around like they are gettin 2 degrees. The problem is that people who have minors and double majors know how much effort it was and they are the ones who hire you. So in reality a minor is like 1.1 degrees and a double major is like 1.25 degrees. Like its more, but not by much.\n\nIMO you should minor if its something you are interested in or the actual subject matter will help you. Essentially pretend that you can't put it on your resume, then would you still do it? If so, then its totally worth it. As I said, I think you are a good candidate for a minor\n\n(Also on this note of college fallacies... pre-med means nothing, pre-law means nothing, pre- fucking anything means nothing. I took physics with 60 'pre-med' students. Exactly one is a doctor right now. Pre-med, to me, means \"i want you to treat me like a doctor, but I won't be a doctor\")",
              "author": "travishummel",
              "created": 1600216506,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g5czw4c": {
      "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5czw4c/",
      "text": "Environmental Science is a niche field that doesn't pay. The degree is both too broad and too specific. It's too broad in the sense that it doesn't narrow down your skills and you essentially learn a wide variety of fun facts without learning any useful skills, for example soil identification or wetland delineation. And it's too specific in the sense that it pigeon holes you into only working environment related jobs. The bread and butter job for this path is Environmental Consulting (which is its own crap shoot and a lot of people don't like it) but a consulting firm will always hire an Environmental/Civil Engineer or a Geologist over an Environmental Science major so you are already at a disadvantage. Starting pays aren't great (in the range of 25-40K) and the field is very competitive because every starry eyed late teen/early 20s person has it in their head that they are passionate and want to save the environment and to make a change in the world one day. Which leads to the field being so overly saturated that graduate students with Master's degrees are hoping they get accepted into an entry level position.\n\nCulinary arts isn't a viable major as it has an extremely poor return on investment in terms of time used and money spent. A far better alternative would be to just work as a linecook at your local Applebees/Chilis and just work your way up.",
      "author": "Reav101",
      "created": 1600181493,
      "upvotes": 5,
      "replies": {
        "g5d1iw2": {
          "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5d1iw2/",
          "text": "my dad did that, starting as a cook. and he’s always let me come sit in with home sometimes or just visit him at work and go to the kitchen and it doesn’t seem that great. i understand why he hates it",
          "author": "k0rrin3",
          "created": 1600182258,
          "upvotes": 5,
          "replies": {
            "g5d30q1": {
              "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5d30q1/",
              "text": "I'm not saying don't do college. I'm just implying you should consider different majors with a more positive outlook.",
              "author": "Reav101",
              "created": 1600182925,
              "upvotes": 3,
              "replies": {
                "g5d39yp": {
                  "link": "/r/CollegeMajors/comments/it97kg/f_17_senior_in_high_school_and_just_realized_the/g5d39yp/",
                  "text": "of course i’m trying to do that but it’s hard to come across a major that i find moderately interesting",
                  "author": "k0rrin3",
                  "created": 1600183053,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634060793
}