{
  "sid": "i80z09",
  "link": "/r/CollegeMajors/comments/i80z09/confused_hs_junior/",
  "title:": "Confused hs junior",
  "text": "Hi everyone! I’m a junior in hs looking to go into either pre med, pre pa, pre dent, or nursing. I don’t know what I want to do, but I’m thinking nutrition, public health, health science, psych, or nursing as majors. Which are the most employable, high salary, and good back ups for if I don’t get into med or grad school? Thanks! Any other major suggestions would be appreciated:$",
  "author": "rad-jazz-21",
  "created": 1597182702,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "g17hojs": {
      "link": "/r/CollegeMajors/comments/i80z09/confused_hs_junior/g17hojs/",
      "text": "Have you thought about occupational, physical, or speech therapy?\n\nLook up the Occupational Outlook Handbook. So much information there. There are job and personality tests online that can give you an idea if your chosen field is a good fit. Your high school guidance counselor should have those and other links. Check them out. All great resources.\n\nThere is a lot to consider before choosing a major. Can't do too much research. Lifestyle is a pretty big deal. You would be surprised how much. Talk to a few people doing the job you are interested in. Ask them what they like about the career, what they don't like. Would they choose that career again if given the choice? Why or why not? Shadow a few people to see what the job is like day in, day out. See for yourself, before you commit. Choosing a major is a huge investment of time and money. Understatement of the year.\n\nYou've got time. Good luck!",
      "author": "bluejazzblue",
      "created": 1597235469,
      "upvotes": 1,
      "replies": {
        "g17l2h9": {
          "link": "/r/CollegeMajors/comments/i80z09/confused_hs_junior/g17l2h9/",
          "text": "Thank you!",
          "author": "rad-jazz-21",
          "created": 1597237734,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g16xz7n": {
      "link": "/r/CollegeMajors/comments/i80z09/confused_hs_junior/g16xz7n/",
      "text": "Pre-anything isn't a major. Nursing is always a viable, high demand, good paying choice and I would make that my backup plan. Getting a master's in nursing is also huge. Don't listen to the others who blindly say to follow your passion. Career outlook and opportunities are something major to consider if you are going to thousands into debt for a degree.",
      "author": "Reav101",
      "created": 1597217021,
      "upvotes": 2,
      "replies": {}
    },
    "g16e6h5": {
      "link": "/r/CollegeMajors/comments/i80z09/confused_hs_junior/g16e6h5/",
      "text": " \"Which are the most employable, high salary, and good back ups\"\n\nWrong motives to have. Go with your passion.",
      "author": "Cheran_Or_Bust",
      "created": 1597202210,
      "upvotes": 3,
      "replies": {}
    },
    "g15m1ni": {
      "link": "/r/CollegeMajors/comments/i80z09/confused_hs_junior/g15m1ni/",
      "text": "Search up BLS Career Outlook Statistics.",
      "author": "DetectiveTacoX",
      "created": 1597187481,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634060341
}