{
  "sid": "mdh1lp",
  "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/",
  "title:": "Which Science Major is the best for an undergrad degree?",
  "text": "\nSo basically, I’m in love with science but I DO NOT fancy going to grad school. Eventually at some point when I have more money in my pockets (and hopefully a decent paying job) I’ll return to get a Masters or Doctorate. \n\nSchool is easy for me if it’s over subjects I enjoy as I’m a pretty fast learner. With that being said, I also want to consider bachelor’s degrees that will lead me into a decent paying job. Below are a selection of my favorite science subjects:\n\nPhysics\n\nGeology\n\nAstronomy\n\nBiochemistry \n\nExercise Science/Kinesiology\n\nWhich of these degrees are the best in terms of job opportunities for bachelor’s degrees? Or is there a different bachelor’s degree that I didn’t mention that will give me the chance to focus on one of these studies? Thank you in advance!",
  "author": "Sleepyheartss",
  "created": 1616734369,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "gscha0t": {
      "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gscha0t/",
      "text": "If you want a job within the field, none of these will work with only a Bachelors. Almost all of the Science related jobs requires at least a masters.\n\nIf you just want a relatively well-paying job in general, physics will be your best bet. Physics grads develop good problem solving skills that are very applicable to many fields. I’ve seen physics majors be hired into lucrative fields like finance or software engineering solely because they are great problem solvers.",
      "author": "yellochoco44",
      "created": 1616796871,
      "upvotes": 1,
      "replies": {}
    },
    "gsch6d9": {
      "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gsch6d9/",
      "text": "Honestly, probably geology. I would have a different answer if you were anticipating on getting a master's or some other post-graduate certification afterwards. However, a BS in geology could probably land you a position in environmental consulting or water resources, making around $40-50k. Check out [this page](https://www.bls.gov/ooh/life-physical-and-social-science/environmental-scientists-and-specialists.htm#) for more information, and feel free to check out r/geologycareers as well.",
      "author": "Acrocane",
      "created": 1616796829,
      "upvotes": 2,
      "replies": {
        "gscwl0p": {
          "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gscwl0p/",
          "text": "I do plan on it. I just can’t afford it right now so I wasn’t going to immediately",
          "author": "Sleepyheartss",
          "created": 1616803383,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gs9j2b2": {
      "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gs9j2b2/",
      "text": "None of these will lead to a high paying job with only a Bachelor's. Try Statistics or Computer Science",
      "author": "user4684784124",
      "created": 1616739844,
      "upvotes": 1,
      "replies": {
        "gs9j4p0": {
          "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gs9j4p0/",
          "text": "Well I said decent paying lol and I’m not really interested in technology at all tbh. And though I don’t hate math I love science more 😅\n\nI 100% plan to get a Doctorate in my future, but not right now. So settling for a decent paying job ($70k) until I have enough money saved to return is my plan.",
          "author": "Sleepyheartss",
          "created": 1616739902,
          "upvotes": 2,
          "replies": {
            "gs9jfmn": {
              "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gs9jfmn/",
              "text": "Understood. Keep in mind there's a lot of math in physics and astronomy. And I hate to say it, but probably none of these majors (at the Bachelor's level) will get you even a $70k starting salary these days. Unless you parlay your math chops you pick up from a physics degree into some technical job position",
              "author": "user4684784124",
              "created": 1616740176,
              "upvotes": 2,
              "replies": {
                "gs9k5vh": {
                  "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gs9k5vh/",
                  "text": "Sorry. I meant average salary’s. A starting salad at of $70k would be insane 😂",
                  "author": "Sleepyheartss",
                  "created": 1616740841,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gsiddbk": {
              "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gsiddbk/",
              "text": "If you want a doctorate, you should consider what that means for you. In all honesty, these fields are so far apart. You need to consider not just which ones you like to learn about but which ones you want to literally create new knowledge about. But to address your question, biochem and physics will generally give you the most earning potential because they’re needed for developing new tech",
              "author": "Zam8859",
              "created": 1616879784,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gscgje9": {
          "link": "/r/CollegeMajors/comments/mdh1lp/which_science_major_is_the_best_for_an_undergrad/gscgje9/",
          "text": "Physics can, but not within the field itself",
          "author": "yellochoco44",
          "created": 1616796572,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634060183
}