{
  "sid": "nbwwb9",
  "link": "/r/CollegeMajors/comments/nbwwb9/following_your_passion_is_bs_advice/",
  "title:": "\"Following your passion\" is BS Advice",
  "text": "This is something I have realized lately and feel free to debate with me on this.\n\nYour passions in life can change over time throughout your life and this does not have to be specifically linked with a career. You can be passionate about ***MANY*** things in your life. Swimming, hiking, cooking, crafting, art, socializing, taking walks, riding a bike, playing sports, volunteering, etc.\n\n*Hell, you can even be passionate about kissing someone.*\n\nPeople have different priorities in life:\n\nA. One person may want to make a lot of money and be able to afford a lot of the nice and fancy things and invest for their future children, etc and just can simply be tolerate of/satisfied with their career as a high-paying career may be their motivation.\n\nB. On the other hand, someone may want to pursue a career that they love/like and build their way up and gain extra skills/advance their way to a different higher position throughout their career in the future.\n\nC. Some people may be fine with working an average paying career that they like to do and living a simple life!\n\nD. Some people are able to handle high-stress jobs and the flipside is, they get paid well for it even though it may take a toll on their health. This is not always the case though because there are some careers that are considered high-stress, but unfortunately, the pay is quite low. For example, teaching.\n\nWith that being said, every career has its pros and cons and has its stressors!\n\n*Not to mention that the college degree you graduate with kinda matters in today's world and unfortunately, some majors are useless and/or require a Master's in order to start your career. While there are exceptions, there are some articles about this.* [*https://www.careeraddict.com/useless-degrees*](https://www.careeraddict.com/useless-degrees)\n\nIf anything, regardless of what your career/degree is, it is never too late to change your mind. You also need to choose a career that is in high demand and this predicts the amount of job postings there will be.\n\n**NEVER STOP LEARNING! LEARN NEW SKILLS AS THEY WILL BENEFIT YOU! THE WORLD WILL ALWAYS BE CHANGING!**\n\n**CHOOSE SOMETHING THAT WILL GAIN YOU SKILLS AND/OR POSSIBLY WILL LIKE/TOLERATE.**\n\n*Many people also don't work in a field that is related to their degree.*\n\nAdditionally, I personally don't think it's worth it to stay in a career that is high-stress and especially if it's one that you can't like at all, regardless if it is high-paying or not but hey, that's just me.\n\nThere is a/are reason(s) that people go back to school after all.\n\nIt's also not just the degree. Employers don't care about GPA these days; They care about your skills and internships/experience!\n\nBut I won't pretend that money is not essential. We need money to survive and pay the bills and afford some possibly nice things once in awhile ;p",
  "author": "Superb-Disk-8202",
  "created": 1620955213,
  "over_18": false,
  "upvotes": 34,
  "upvote_ratio": 0.92,
  "comments": {
    "h0uakyd": {
      "link": "/r/CollegeMajors/comments/nbwwb9/following_your_passion_is_bs_advice/h0uakyd/",
      "text": "After reading your post twice or thrice, I realized something. You say following your passion is BS advice, but then you list how people have different priorities. I think you meant to say that following your passion to pick a degree or major is BS. I just had to clarify, as if you meant follow your passion in general, I think you’d be supporting the affirmative side.",
      "author": "jpkuroneko-chan",
      "created": 1623016543,
      "upvotes": 1,
      "replies": {}
    },
    "gyw7dgq": {
      "link": "/r/CollegeMajors/comments/nbwwb9/following_your_passion_is_bs_advice/gyw7dgq/",
      "text": "When choosing a major, you must pick something that does two things. Make money, and make happiness. After a lifetime in a career, any job will become a mundane job. If you are indecisive, I would recommend you try something in a business field.\n\nFor example, I'm doing a double major (two majors) of accounting and finance. I wanted to pick something that seemed hard, but not as hard as engineering. Usually business majors are told they are the easier majors to get, and so I wanted to get a major in that field that was revered as difficult. \n\nOverall, I'm happy with my majors. If I didn't care about money or flexibility, I would choose something like history, communications, or psychology (all very respectable majors). \n\nJust make sure you don't sacrifice happiness or money in pursuit of the latter option. It needs to be 50/50 whenever possible. I've learned that people who stick to either just money or just happiness tend to be unsatisfied with their education and carrer in life.\n\nPs... over 80% of Americans get a job in a field completely unrelated to their study. What matters is that you get the degree and get out (and get a lot of work experiance).",
      "author": "JakeFromSF2011",
      "created": 1621560569,
      "upvotes": 2,
      "replies": {
        "gywa8o9": {
          "link": "/r/CollegeMajors/comments/nbwwb9/following_your_passion_is_bs_advice/gywa8o9/",
          "text": "Very good advice. I am not indecisive entirely per say. I also tried business before. COVID-19 made me decide to change it. I am thinking of majoring in Computer Science possibly and minoring in Communication Disorders.",
          "author": "Superb-Disk-8202",
          "created": 1621562095,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gyicwig": {
      "link": "/r/CollegeMajors/comments/nbwwb9/following_your_passion_is_bs_advice/gyicwig/",
      "text": "Hello, \n\nI can relate to your post and it is true that although one has passions we have to be relaisitic and choose something like you mentioned that will gain you skills. That being said I wanted your input for bachelors im in between Business Administration with a concnetration in marketing or my second option is pyschology and my third being public health. There is also a concnetration in HR that im also looking into. Would you be able to give me input on these as Ive heard many mixed feelings on each one like some requiring masters while others say they do not. Any input is greatly appreciated.",
      "author": "Future344",
      "created": 1621296258,
      "upvotes": 2,
      "replies": {
        "gyipenu": {
          "link": "/r/CollegeMajors/comments/nbwwb9/following_your_passion_is_bs_advice/gyipenu/",
          "text": "Hi,\n\nThis is what I know.\n\nFor Psychology, you absolutely **need** a Master's *at least*. Because without it, it is useless as it is too general. The reason that a Master's is required is also because many people have a Bachelor's in Psychology, making that type of Bachelor's oversaturated. If you want to go into social work or be a type of psychologist (this varies because some psychologist careers also need a doctorate so keep that in mind and research careers), then go ahead and get your Master's!\n\nI don't know much about Bachelor's Administration. However, I heard that this degree is technically kind of useless as it is too general.\n\nIf you want to go into Business for example (As that is kinda related with Business Administration) I recommend that you major in something else such as Finance, Economics, or Accounting (With Accounting, you need an CPA) In my opinion, with Economics or Finance, I strongly recommend a Master's. However, I heard that with Economics is \"useless\" without a Master's and Accounting also kind of varies (They pay well, but not as much as people think like over 100k, but this depends)\n\n*Keep in mind: Usually degrees that are too general are deemed \"useless\", but this varies upon the degree. It's the same thing when some degrees are too specific.*\n\nWe are in the 21st century; College today is nothing like it was back then 20-30 years ago when you can just major in ***anything*** and obtain a job following when you graduate college. The important thing to is to do your research.\n\nPublic Health and HR I don't know anything about (But I don't see it being a problem if you minor in HR)\n\nUltimately, I would say instead of thinking of your college majors, **try to think of what career you want and/or what type of lifestyle you want.**\n\nRegarding careers, it is also important to look up the [BLS.gov](https://BLS.gov) as this website will help you see what jobs have a good outlook. Generally, a career with a good outlook, will have LOTS of job postings on the career websites, etc.\n\nYou also may want to think of majors/careers that are \"recession proof\" and what can you see yourself doing in the long run. Money is important but so is liking your career. (Nothing is exactly 100% recession proof because you can get laid off at anytime, etc) I mean, ngl here, look what happened with COVID-19. This pandemic made me rethink my major and career plans (I'm currently a Business major, but I am intending to change it.) I am thinking of either doing CS (I am curious about this field as it is so vast and technology is expanding after all) or do speech language pathology or possibly both haha (But with speech pathology, I am aware that I need a Masters for it if I want to pursue that field and bonus points if I get my pre requisites)\n\nExtra note: Regardless, make sure you limit your tuition in college as this will limit your student loans after (I strongly recommend community college 1st as it is far more cheaper and transfer to an in-state public university.) I mean, not to sound pessimistic, but there are many reasons why we have a student loan debt crisis here in the U.S.\n\nI hope this helped! Feel free to message me if you want! I also recommend watching Shane Hummus on Youtube! He provides advice about college, personal finance, and college degrees!",
          "author": "Superb-Disk-8202",
          "created": 1621302513,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "gy3ab27": {
      "link": "/r/CollegeMajors/comments/nbwwb9/following_your_passion_is_bs_advice/gy3ab27/",
      "text": "[deleted]",
      "author": null,
      "created": 1620994539,
      "upvotes": 8,
      "replies": {
        "gy3pg9x": {
          "link": "/r/CollegeMajors/comments/nbwwb9/following_your_passion_is_bs_advice/gy3pg9x/",
          "text": "I am not. \n\nAs I stated in my comments, you can be passionate about ANYTHING/MANY things in your life. This does not have to be limited to hobbies. \n\nAs I stated before, unfortunately, being passionate about a certain career does not always pay the bills. For example, graphic designers and I know many people who want to go into this. The pay is pretty low and it is not in high demand. Heck, even law is not a good idea to pursue nowadays. \n\nSometimes, it's a good idea building skills first and THEN pursue something that you're passionate about later on.\n\nMany people these days in college pursue degrees that they are passionate about it when in fact that there is a chance that the degree may be \"worthless.\" (There are rare exceptions) You have to be smart about the degree/career you're going for now, unless you are 100% sure you're going to grad school. (But this varies) \n\nLook what happened in the pandamic for example. Many graduated, possibly got laid off from their offers and can't find a job now to pay their bills/debt. And now, they are stuck. At times, you need to be practical. We have a student loan debt crisis for many reasons after all. It's also best if you have passive income/your own business eventually (But this depends)\n\nThe fields that are in demand right now are careers in health care, psychology and in IT/CS. I am not saying that you are solid, but these careers \"increase\" your chances. Of course, not everyone wants to go into these careers and that's normal. \n \nI'm not saying that you don't need to stay at a job/career you don't like. In the long run, it's not worth it. I am just saying once you built up enough skills/money and/or just chose \"enough is enough\", then leave. You only have one life after all. \n\nBut you're right about the fact that many people don't know what their \"passion\" is. Hence why, it's important to try new things from time to time.",
          "author": "Superb-Disk-8202",
          "created": 1621002108,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059550
}