{
  "sid": "qb3r7g",
  "link": "/r/CollegeMajors/comments/qb3r7g/my_plan_for_my_ba/",
  "title:": "My plan for my BA",
  "text": "I was hoping you guys could listen to the plan I have and give me some advice on where I might have made a mistake, hopefully this is allowed in this sub, if not I'll delete the post. \n\nI've just graduated HS, and right after I got my diploma in US my dad got diagnosed with cancer so past few months I've not been able to apply to any colleges, instead I worked online on a TEFL so that I can try to teach ESL for a few years, \n\nI'll make this as short as possible: I'm getting an TEFL certificate. Because of my dad's situation I can not attend college in US, but wanting to get my degree from there, I'm planning to go to an online college for a Philosophy BA, why philosophy you may ask? Let me elaborate, \n\nMy main passion is writing in humanities and also fiction. I want to eventually one day become a published author. So I thought philosophy BA would be the perfect major to get my mind ready for critical thinking, on the side I'll take online fiction writing classes (If I can afford the tuition, why not take two BAs?), meanwhile as I'm doing those things as my passion, I need to make some money as well, \n\nIn the country I'm currently in, making money through in person jobs would end up giving me a salary of like 20 dollars a month, max. This is due to the high conversion rate. So since I need money for my tuition, I have to find some work that is online and that would pay me in dollars. Looking at the skills I have, online ESL seems the best, thus why I'm working towards my teaching certificate. \n\nAll this said, I need advice from you dear redditors. \n\n1. Is this plan realistic? I mean working on one or two BA's completely online while teaching ESL online as well, timewise I mean\n2. Should I go for an english BA as well as philosophy, or should I just take philosophy and instead of going to a full college for english, I can take classes on fiction writing that are more specific on what I'm trying to achieve; in other words, is an english BA that much more useful than just normal online classes for someone who wants to write fiction? \n3. This has been a really stressful year for me and I really need to know if I've gone crazy with my plans or it will actually work. I love you all, and thank you for reading this far",
  "author": "Mani0770",
  "created": 1634617111,
  "updated": 1636189678,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhi6a7q": {
      "link": "/r/CollegeMajors/comments/qb3r7g/my_plan_for_my_ba/hhi6a7q/",
      "text": "To be perfectly honest, most university english and philosophy classes aren't focused on teaching you the specifics of being an author (things like appropriate word count for different genres, how to get published, etc). In fact, you don't need a degree at all for your career plan. If you're interested in learning for its own sake, you can check out openyale courses, or UC Berkeley's philosophy courses on the internet archive.",
      "author": "42gauge",
      "created": 1634832069,
      "upvotes": 2,
      "replies": {
        "hhia8lo": {
          "link": "/r/CollegeMajors/comments/qb3r7g/my_plan_for_my_ba/hhia8lo/",
          "text": "for actual writing lessons I’m planning to take online courses and self study, philosophy degree is more for both studying and also having a BA for when I apply for jobs and etc. I’m under the impression that a BA in whatever (and philosophy is something i passionately love) is useful if not required for most basic paying jobs, that’s why i’m thinking about getting one, it’d be too risky to only rely on publication money, specially for someone my age just starting out",
          "author": "Mani0770",
          "created": 1634833659,
          "upvotes": 1,
          "replies": {
            "hhibqk0": {
              "link": "/r/CollegeMajors/comments/qb3r7g/my_plan_for_my_ba/hhibqk0/",
              "text": "How do you plan on financing your degree?",
              "author": "42gauge",
              "created": 1634834248,
              "upvotes": 1,
              "replies": {
                "hhidafo": {
                  "link": "/r/CollegeMajors/comments/qb3r7g/my_plan_for_my_ba/hhidafo/",
                  "text": "fortunately my family is willing to pay for the online tuition, with aids and such I can end up paying anywhere between 10-20k for a full BA. My living situation is a little bit on air right now, what I mean by that is my family is split up and each is living in a different country and I’m kinda being passed around (thus why I’m not attending college in person),\n\nso i’ll be supported until my BA comes atleast, both housing and college and etc, not sure if it’ll continue (not that they won’t want to help me, idek if they can afford it at that point) so I fortunately was lucky enough to have give or take 4-5 years to construct a substructure for my life, and the above plan is what I have in mind atm \n\nI’m hoping to eventually live in the US as I grew up in Cali, but prolly not gonna be there anytime soon (I’m currently in middle east, then prolly somewhere in eastern europe for these years, both for financial reasons and family) and from what I’ve seen a BA is like the very minimum to start a career over there, pretty much in any field\n\naside from all these, I just wanna ask, bc it’s so overwhelming to be 18 and be given full freedom on your life, do you think this plan makes sense? My dad is willing to help me no matter what I study but he keeps telling me to study something like engineering or law where I’ll be in a more stable position, but I honestly feel like working a job I don’t like for a lifetime will not be my thing, even if financially it’s more sensical, but maybe I’m just a dumb teen?",
                  "author": "Mani0770",
                  "created": 1634834855,
                  "upvotes": 1,
                  "replies": {
                    "hhjybxc": {
                      "link": "/r/CollegeMajors/comments/qb3r7g/my_plan_for_my_ba/hhjybxc/",
                      "text": "First of all, philosophy is a very popular prelaw major. So other than writing, what other careers would you be interested in? Marketing? Technical writing? Business stuff?",
                      "author": "42gauge",
                      "created": 1634858728,
                      "upvotes": 2,
                      "replies": {
                        "hhjzwar": {
                          "link": "/r/CollegeMajors/comments/qb3r7g/my_plan_for_my_ba/hhjzwar/",
                          "text": "law, government, teaching in public schools (as like a normal english teacher say), business is fine because I admire the art of persuasion, anything really that’d allow me enough time to work on my personal craft, and would not fully consume my life,  think a 9-5 job where i’ll make enough to survive as a single dude in cali, and where i can be done with the work both mentally and physically after the work hours, \n\nunless my plans change, which is always an option in life, who knows maybe i’ll like law and peruse a career as a lawyer, but as of now, a philosophy BA is just so I can get a 9-5 job that pays enough to survive and to learn the course material (i actually love philosophy for its own sake, and also i think ethnics and metaphysics will help my fiction writing greatly, though it is not technically a BA in fiction, a great part of the type of fiction that I want to write is having something to say, and making philosophical arguements through fictions and novels, think titles such as Stranger, or Nausea as examples",
                          "author": "Mani0770",
                          "created": 1634859471,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}