{
  "sid": "lwh749",
  "link": "/r/CollegeMajors/comments/lwh749/my_previous_job_was_a_mix_of_a_clerk_and_an/",
  "title:": "My previous job was a mix of a clerk and an analyst - what degree would use the skills I developed there?",
  "text": "Hello! I'm at a crossroads regarding my schooling and career and would appreciate some unbiased thoughts. If this question does not belong here, I will delete this post.\n\nBackground:\n\nI (26F) have finished high school and attended some college, but dropped out. I now have the opportunity to return to school. Most, if not all, of my electives and general requirements should be covered by my previous schooling.\n\nAfter dropping out, I took a job as a Specialist, which was created when a clerk and analyst both left and the responsibilities were combined into the new position.\n\nCommon tasks included:\n\n* Basic maintenance in customer accounts,\n* Data entry,\n* Writing macros to automate processes and build tools I or the department needed,\n* Analyzing data,\n* Problem solving,\n* Testing updates in QA before going into production,\n* Developing new processes and updating old ones,\n* Updating the verbiage on the website as needed,\n* Troubleshooting software/network issues and communicating with IT,\n* etc.\n\nI was considered the subject matter expert of my department, mostly because I understood how our software worked together. I liked my job, for the most part. I'm told I was good at it, but the company had been doing poorly for some time and I had to teach myself nearly everything, so I'm not sure how true that is.\n\nMy question:\n\nWhat jobs/degrees would use the skills I learned in the Specialist job?\n\nMy first thoughts were things like an analyst of some sort or something in IT. However, I am completely self-taught (my predecessor had very little time to train me) and I have no experience in programming aside from teaching myself VBA. Because of this, I feel I might be too far behind to catch up in knowledge before even beginning the job or degree.\n\nAny advice/comments/thoughts would be welcome. Thank you in advance!",
  "author": "Fictional_Ferret",
  "created": 1614732826,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "gq3ma0s": {
      "link": "/r/CollegeMajors/comments/lwh749/my_previous_job_was_a_mix_of_a_clerk_and_an/gq3ma0s/",
      "text": "I would recommend going into Accounting? IT is also good, and for me, much fitting for you.",
      "author": "pengwingsyay",
      "created": 1615128158,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634060305
}