{
  "sid": "qbm2kl",
  "link": "/r/CollegeMajors/comments/qbm2kl/choosing_a_major/",
  "title:": "Choosing A Major",
  "text": "Hello guys, I am planning on going to college next semester but have yet to decide on a major. A lot of the things I enjoy doing don't result in the most lucrative careers. However, I would like to start a family and supply for them when I get older. I am not the best at math. Do any of you have ideas of a degree I could major in that is pretty lucrative without high levels of math?",
  "author": "asianwizardry",
  "created": 1634680733,
  "updated": 1634750383,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhal253": {
      "link": "/r/CollegeMajors/comments/qbm2kl/choosing_a_major/hhal253/",
      "text": "How about UX/UI design? The pay is supposed to be pretty high, although not at the level of software engineering. You would mostly take courses in design, UX research methods, and some coding with a bit of ethics thrown in. Note: not all colleges will call the major UX/UI design — it might be a concentration under the design or informatics major or something similar.\n\nIf you like writing and are patient with technology, you could look into a technical writing career. You’ll probably want a bit of technology experience/coursework in your background for that too, but you shouldn’t need math. A lot of English and communications majors go into tech writing (although employers will often expect internship experience on top of the degree).\n\nLots of medical careers don’t require much math. If you’re OK loading up on biology and chemistry, you could work toward becoming a dental hygienist or a nurse. You probably won’t need much more than statistics and many one other math course.\n\nYou could also try marketing — it pays decently after you get some experience and can be quite lucrative if you get to management level.",
      "author": "Lily9879",
      "created": 1634684284,
      "upvotes": 1,
      "replies": {}
    }
  }
}