{
  "sid": "kmvwgz",
  "link": "/r/CollegeMajors/comments/kmvwgz/homeland_security_or_international_relations_as_a/",
  "title:": "Homeland Security or International Relations as a major",
  "text": "Which major would be a better option to work in a federal government agency in a counter terrorism or counter intelligence department?",
  "author": "Murky_Loquat_9666",
  "created": 1609306014,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "gic5tzf": {
      "link": "/r/CollegeMajors/comments/kmvwgz/homeland_security_or_international_relations_as_a/gic5tzf/",
      "text": "I was in a similar situation as you. I ended up going with political science at a school in the D.C. metro area. Agencies that work domestically will prefer homeland security oriented degrees over IR.. vice versa. Biggest factors to land a job in these areas of the gov. mean having military experience and/or inside connections. Snagging an internship can get your foot in the door too. I also recommend you learn a mission critical language. These are sure fire ways to land that type of job in the IC. The choice between these majors makes little difference. I would pick the one you are more interested in because it will probably relate to a higher GPA.",
      "author": null,
      "created": 1609962436,
      "upvotes": 1,
      "replies": {}
    },
    "ghiwo6t": {
      "link": "/r/CollegeMajors/comments/kmvwgz/homeland_security_or_international_relations_as_a/ghiwo6t/",
      "text": "Homeland Security would be more fitting, most likely. Does it have a cybersecurity component?",
      "author": "slouchingbethlehem",
      "created": 1609354671,
      "upvotes": 1,
      "replies": {
        "ghksg5n": {
          "link": "/r/CollegeMajors/comments/kmvwgz/homeland_security_or_international_relations_as_a/ghksg5n/",
          "text": "Not a cyber security component but more of a foreign and domestic knowledge on threats and adversaries.",
          "author": "Murky_Loquat_9666",
          "created": 1609389905,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059762
}