{
  "sid": "kogigt",
  "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/",
  "title:": "CS or MIS?",
  "text": "I know this question has been asked way too much but I'm confused about this. For now, I'm thinking of going to business/systems/data analytics or project management, so I figured that MIS would be suitable, but generally speaking, a CS grad have access to those as well while MIS degree can't do some of the jobs for CS degree. I'm not that good at math, especially calculus, so it's one of the reason I'm thinking of taking an MIS degree. Still a complete beginner at coding so I can't say whether I hate it or enjoy it",
  "author": "complexinferiority",
  "created": 1609526798,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "ghydo2e": {
      "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghydo2e/",
      "text": "Some schools will let you double major. There should a lot of classes that overlap. Programming is a good skill to pick up. Learn desktop programming, web programming and databases. I have a degree in Computer Engineering. If you end up not liking programming too much then you can just stick with the MIS major.",
      "author": "jdigitaltutoring",
      "created": 1609684272,
      "upvotes": 1,
      "replies": {}
    },
    "ghw80rf": {
      "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghw80rf/",
      "text": "/u/ayham_abusalem  has summoned me, so here I am.  \n\n-----  \n\nFocus on the career & job roles, and align the major to the career.  \n\nRead the sentence out-loud, please. It's important.  \n\nFigure out what you *think* you want to do for a living. Need some help visualizing or understanding these careers? come to /r/ITCareerQuestions  and ask for guidance or resources to develop better clarity of understanding.  \nYour career lasts roughly 40 years from 20-something to 60-something.  \nYou *can* change your career path later, but if you can avoid that by investing soul-searching into the career now, that would be best.  \n\nIf you want to create software  Computer Science is king, with Software Engineering close behind, and Computer Engineering not far behind.  \n\nThe recruiting pipeline for `Computer Science` graduates is stronger than any other degree with the possible exception of nursing.  \n\nLots of other degrees can kind of get caught up in the gravitational pull of CS recruiting which means SE, CE, IS and MIS are all viable and generally well recruited.  \n\nBut make no mistake: everything is second-fiddle to Computer Science for recruiting purposes.  \n\nMIS is generally wonderfully broad-spectrum. Each university has a different mix or balance, but it's usually something like:  \n\n20% General Education  \n20% Information Technology  \n30% Business Administration  \n30% Computer Science/Software Engineering  \n\nWith such a broad set of academic knowledge & skills, you should make yourself a presentable candidate for all kinds of employment options.  \n\nNow, some practical wisdom and a slap in the face of reality:  \n\n> I'm not that good at math, especially calculus, so it's one of the reason I'm thinking of taking an MIS degree  \n\nYou think MIS is going to be **easy** because you're scared of calculus?  \n\nIt's just math. Your university has a fuckload of resources specifically focused on helping students find success in math.  \nAll you have to do is use the damned resources. Engage the tutoring center. Use Office Hours. Hire a student tutor for $10 a session through the Tutoring Center.  \nThere are so many resources at your disposal to help you get through Calculus.  \n\nBut Calculus is cake compared to a good, quality Data Structures & Algorithms course (which not all MIS degrees require, or they have a special, watered-down, light-weight DS&A course for IS/MIS).  \n\nHere is the reality:  \n\nWe, the employers of the world, pay big money to those who can solve big, stinky, scary, nasty problems.  \nYou do not learn how to solve nasty, stinky problems in powder-puff, easy-A classes.  \n\nSo stop feeding your fears and letting yourself be intimidated by Calculus.  \n\nHere is another reality:  \n\nThe early-career phase of your entrance into the technology-jobs sector is going to a deluge of hard work. The harder you work, and the higher-quality the products you produce, the faster you can break through to the calm, soothing realm of senior IT staff roles.  \n\nTo accomplish this as fast as possible, you've got to be working outside the classroom often, and meaningfully.  \n\nYou CANNOT just focus on good grades, playing Red Dead Redemption and smoking dope, and letting everything else wait for graduation.  \n\n/r/ITCareerQuestions  is full of recent graduates who didn't do a damned thing while attending college, have nothing but a diploma and a smile and a stack of 200 rejection letters.  \n\nInternships. Co-Op work. GitHub code samples. A HomeLab of technology projects.  \n\nYou need to **PARTICIPATE** in professionally-oriented club activities to talk about the career and the industries that use technology.  \n\nThat is pretty much guaranteed to be a topic of discussion during your job interviews as a recent graduate. What were your internships, what did you do, what did you learn...  \n\nWhat you do during your nights & weekends while attending the same university and earning the same degree can mean the difference between a $40k job and a $75k job at graduation.  \n\nI really want you, and everybody else to be earning those $75k paychecks. It's really not hard to accomplish. But it requires a level of investment of time into the studies that too many people are unwilling to commit to. I encourage you to do more, and earn more.  \n\nI'm passionate about this, because if I knew then what I know now I'd be earning double what I make today and I'm already doing nicely.  \n\nI'm 47 years old and I've been working in IT for a little over 25 years. I've worked with, and mentored well over 100 interns and dozens of members of a Fortune-500-level Career Development Program.",
      "author": "VA_Network_Nerd",
      "created": 1609644025,
      "upvotes": 1,
      "replies": {
        "ghw906l": {
          "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghw906l/",
          "text": "And this, this is why I summon you, you never withhold information or cheap out on knowledge , just straightforward quality & juicy replies. Kudos",
          "author": "Ayham_abusalem",
          "created": 1609644620,
          "upvotes": 1,
          "replies": {}
        },
        "ghwlxsw": {
          "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghwlxsw/",
          "text": "thanks, reading that made me change my approach towards this matter",
          "author": "complexinferiority",
          "created": 1609652523,
          "upvotes": 1,
          "replies": {
            "ghwmfkw": {
              "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghwmfkw/",
              "text": "Always happy to help.  \n\nYou might take the time to read these too:  \n\n | \n---|\n[/r/ITCareerQuestions Wiki](/r/ITCareerQuestions/wiki/index) |\n[/r/CSCareerQuestions Wiki](/r/cscareerquestions/wiki/index) |\n[/r/Sysadmin Wiki](/r/sysadmin/wiki/index  ) | \n[/r/Networking Wiki](/r/networking/wiki/index) | \n[/r/NetSec Wiki](/r/netsec/wiki/index) | \n[/r/NetSecStudents Wiki](/r/netsecstudents/wiki/index) | \n[/r/SecurityCareerAdvice/](/r/SecurityCareerAdvice/) |  \n[/r/CompTIA Wiki](/r/CompTIA/wiki/index) | \n[/r/Linux4Noobs Wiki](/r/linux4noobs/wiki/index) | \n | \n**Essential Blogs for Early-Career Technology Workers** | \n[Krebs on Security: Thinking of a Cybersecurity Career? Read This](https://krebsonsecurity.com/2020/07/thinking-of-a-cybersecurity-career-read-this/) | \n[CBT Nuggets: How to Prepare for a Capture the Flag Hacking Competition](https://www.cbtnuggets.com/blog/training/exam-prep/how-to-prepare-for-a-capture-the-flag-hacking-competition) | \n[Ivan Pepelnjak: SDN, Career Choices and Magic Graphs](https://test.ipspace.net/2012/09/sdn-career-choices-and-magic-graphs.html) | \n[Packet Pushers: Does SDN Mean IT Will Be Able To Get Rid of Network People?](https://packetpushers.net/does-sdn-mean-it-will-be-able-to-get-rid-of-network-people/) | \n |",
              "author": "VA_Network_Nerd",
              "created": 1609652743,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ghyosxv": {
          "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghyosxv/",
          "text": "I'd say that Computer Science and Computer Engineering are almost interchangeable as majors while majoring in Software Engineering is generally viewed as a more of a trade school type major. Think Mechanical Engineering vs Welding.",
          "author": "csbsms",
          "created": 1609689884,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghw54te": {
      "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghw54te/",
      "text": "u/VA_NETWORK_NERD",
      "author": "Ayham_abusalem",
      "created": 1609642327,
      "upvotes": 1,
      "replies": {}
    },
    "ghrzdw1": {
      "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghrzdw1/",
      "text": "I would say do CS if you think you could major in it without failing/doing poorly, otherwise do MIS.",
      "author": "BetUrProcrastinating",
      "created": 1609547192,
      "upvotes": 1,
      "replies": {
        "ghtoklz": {
          "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghtoklz/",
          "text": "Since I will need a scholarship, I think I can mantain a higher gpa in MIS. can MIS students go to software development, if I would change my mind later on?",
          "author": "complexinferiority",
          "created": 1609593379,
          "upvotes": 1,
          "replies": {
            "ghw3ler": {
              "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghw3ler/",
              "text": "MIS students could definitely go into software development later, hell, there are people who majored in things like biology and history who work as software developers. But it would probably be a bit of a disadvantage, mainly because you would be taking fewer actual programming classes and probably wouldn't get as much experience/internships in software development. Also, interviews for programming jobs will quiz you on things you've learned in data structures/algorithms courses, not sure if those are mandatory for MIS degrees. If you are relying on a scholarship though, that seems like an important consideration, so IDK in this case.",
              "author": "BetUrProcrastinating",
              "created": 1609641435,
              "upvotes": 1,
              "replies": {
                "ghw5400": {
                  "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghw5400/",
                  "text": "While I agree, but this is highly subjective, MIS isn't the straightforward degree like accounting or pharmaceutical sciences, where one may go there may be one single C++ or OOP class, the next door school may require 10. So, OP, if you're planning to go into software engineering and choose to do MIS, pick a school that has a technical study plan.",
                  "author": "Ayham_abusalem",
                  "created": 1609642313,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ghrjszx": {
      "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghrjszx/",
      "text": "MIS seems like a better bet for you, you can throw in a CS minor if you want",
      "author": "yellochoco44",
      "created": 1609538653,
      "upvotes": 1,
      "replies": {}
    },
    "ghrbymu": {
      "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghrbymu/",
      "text": "A combination of both in the form of Major/Minor is worth looking into.",
      "author": "Ayham_abusalem",
      "created": 1609534485,
      "upvotes": 2,
      "replies": {
        "ghstf96": {
          "link": "/r/CollegeMajors/comments/kogigt/cs_or_mis/ghstf96/",
          "text": "would you recommend MIS with a minor in CS?",
          "author": "complexinferiority",
          "created": 1609564157,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059691
}