{
  "sid": "gggsec",
  "link": "/r/CollegeMajors/comments/gggsec/help_me/",
  "title:": "Help me !",
  "text": "I am in my 3rd year of high school. Lately, I've been thinking a lot about what I want to do in the future. I want to go to college, get a degree, but I don't know which field suits me the best. I have an aptitude for  language learning, I love to communicate with people, learn about other people's cultures. I am good at History, but not passionate enough to choose it as my major. I want a stable job that can be interesting to pursue and pay a little more than enough. Which majors would you recommend?",
  "author": "Sophiemtivlishvili",
  "created": 1589036181,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "fqs11oj": {
      "link": "/r/CollegeMajors/comments/gggsec/help_me/fqs11oj/",
      "text": "Linguistics?",
      "author": "kwuhoo239",
      "created": 1589596187,
      "upvotes": 1,
      "replies": {}
    },
    "fq32byg": {
      "link": "/r/CollegeMajors/comments/gggsec/help_me/fq32byg/",
      "text": "Politics??? It's a pretty broad field, draws from philosophy, humanities, history, etc. Your communication abilities will serve you well.",
      "author": "vishthefish05",
      "created": 1589062354,
      "upvotes": 2,
      "replies": {
        "fq32kei": {
          "link": "/r/CollegeMajors/comments/gggsec/help_me/fq32kei/",
          "text": "As the other person said, anthropology (and maybe archaeology if you like science) would be a good fit. It's all about learning about the cultures of ancient humans, so it seems perfect for you.",
          "author": "vishthefish05",
          "created": 1589062419,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fq1hjv3": {
      "link": "/r/CollegeMajors/comments/gggsec/help_me/fq1hjv3/",
      "text": "Look at anthropology! And if you want, you can get another major like journalism or education to try to increase your job chances. At the end of the day, it's more about the experiences and internships you get that make you competitive in the job field right after college",
      "author": "AceOfRhombus",
      "created": 1589045715,
      "upvotes": 4,
      "replies": {
        "fq7a4kp": {
          "link": "/r/CollegeMajors/comments/gggsec/help_me/fq7a4kp/",
          "text": "Employability speaking, what’s better anthropology or sociology?",
          "author": "johnwithcheese",
          "created": 1589143744,
          "upvotes": 1,
          "replies": {
            "fq7g1ba": {
              "link": "/r/CollegeMajors/comments/gggsec/help_me/fq7g1ba/",
              "text": "Honestly I don't know as I am a biochem major, but I would have to say both. It depends more on your specific interests and experiences. Example: let's say that Person A is applying to a social worker position and has a sociology degree with a concentration in social work, but they haven't done any volunteering. Person B is applying to the same job and has an anthropology degree, but they've been volunteering at a social work place for the last four years and took a few sociology classes. Both would probably be competitive for the role, and the anthropology might be more competitive because they have more experience. Ultimately your degree doesn't matter that much, it's the experiences you have. At least that's my opinion. I'm not saying that majors don't matter, but there are other aspects you can focus on",
              "author": "AceOfRhombus",
              "created": 1589145915,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634059635
}