{
  "sid": "r7jizl",
  "link": "/r/CollegeMajors/comments/r7jizl/advice_for_someone_whos_confused_on_what_to_go/",
  "title:": "Advice for someone who’s confused on what to go with",
  "text": "Hey everyone. I’m currently in community college majoring in Business Admin. Two semesters in and i’m one and half semester away from graduating in it. I am planning on transferring into a four year but I find that my heart doesn’t really sit with business. My whole life i’ve been more into tech so although math is not my strong suit, I am heavily considering going into Computer Science. Any advice for me or from anyone who faced the same sort of issue? I was told that i’m better off finishing up with business and changing majors once i’m in a four year.",
  "author": "Conquer512",
  "created": 1638485328,
  "updated": 1639517808,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hn0opzs": {
      "link": "/r/CollegeMajors/comments/r7jizl/advice_for_someone_whos_confused_on_what_to_go/hn0opzs/",
      "text": "I’d go for computer science for sure! I didn’t switch from business to computer science, but I did switch majors to something I was more interested in, and I’m so glad I did. It’s worth it to end up in a field you enjoy.\n\nWith computer science, you can make more money than you usually can with business, so you can definitely pay the extra student loans if you have to take them on.",
      "author": "Lily9879",
      "created": 1638499710,
      "upvotes": 3,
      "replies": {
        "hn11g8m": {
          "link": "/r/CollegeMajors/comments/r7jizl/advice_for_someone_whos_confused_on_what_to_go/hn11g8m/",
          "text": "Thank you for the reply! What do you think of finishing up at cc and changing once I transfer, good idea?",
          "author": "Conquer512",
          "created": 1638505549,
          "upvotes": 1,
          "replies": {
            "hn19yc8": {
              "link": "/r/CollegeMajors/comments/r7jizl/advice_for_someone_whos_confused_on_what_to_go/hn19yc8/",
              "text": "It sounds like a decent plan as long as you don’t hate your business classes. An associate’s degree in business and a bachelor’s degree in computer science gives you more breadth than just computer science. \n\nThat being said, you might need to take some computer science and/or math courses before you transfer. At the my four-year college, they usually expected transfer students to have taken a few prerequisite courses at community college to be considered for admission to a major. Definitely check the policies for transfer students and computer science majors at the colleges you’re interested in transferring to.",
              "author": "Lily9879",
              "created": 1638510199,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hn40dwj": {
      "link": "/r/CollegeMajors/comments/r7jizl/advice_for_someone_whos_confused_on_what_to_go/hn40dwj/",
      "text": "I think it depends how close you are to finishing the business admin degree. Like, yes, definitely switch to something you actually want to do, but if it’s easy enough to finish that semester and a half rather than spending more credits on a computer science one now, I think that’d be prudent. \n\nCoding is also something that’s more skill-based than credential-based, so I wouldn’t worry as much about what your degree says.",
      "author": "the_umbrellaest_red",
      "created": 1638563151,
      "upvotes": 2,
      "replies": {}
    },
    "hn25bou": {
      "link": "/r/CollegeMajors/comments/r7jizl/advice_for_someone_whos_confused_on_what_to_go/hn25bou/",
      "text": "go for comp sci and collect that 100k+ job",
      "author": "ghostmode342",
      "created": 1638534077,
      "upvotes": 1,
      "replies": {}
    }
  }
}