{
  "sid": "l1aw5j",
  "link": "/r/CollegeMajors/comments/l1aw5j/history_double_major_with_art_history_geography/",
  "title:": "History double major with ___? (Art history, geography, anthropology)",
  "text": "Hi,\nI am going to be attending SUNY Geneseo as a transfer student, and I know I'm going to major in history, and have been debating what to double major or minor in. Originally I was thinking about art history, as I am interested in that but the program here is not super great from the looks of it. I am now considering:\n\nAnthropology: have an interest in archeology, biological and linguistic, not so much in cultural. Had a really bad intro to cultural anthropology prof at my current college, who kind of made me dislike cultural anthropology mostly just because he was stupid and painful at lecturing. \n\nOr\n\nGeography\nI wasn't ever considering this until I was looking thru the college's catalog, I do enjoy geography although never been full on geography nerd, thought it might be a nice fit with history. Apparently the program at Geneseo is really good.\n\nSo for clarity, I am planning on going on to grad leval for history want to become a history instructor at the college leval, it's definitely my passion, so I'm wondering which out of these options might be most beneficial and/or complementary with history.\n\nThanks,",
  "author": "KafkaFranzisaBug",
  "created": 1611155049,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "gjyckwc": {
      "link": "/r/CollegeMajors/comments/l1aw5j/history_double_major_with_art_history_geography/gjyckwc/",
      "text": "I truly think it’s tradition to have a terrible Cultural Anthropology professor. Really left a poor impression for me on the subfield, but I do recognize it’s significance, purpose, and benefit towards my focus of Archaeology.\n\nI personally think you’ll be fine going with either major/minor, as they both compliment History quite well. Archaeology and History really go hand in hand, as the former covers the prehistoric aspects of our species in order to reconstruct past human landscapes. Archaeology can also help fact check historical myths and documents, such as how Battle of Little Bighorn really occurred, so it isn’t all prehistory. Overall, it can give you a broader perspective of the past and what to focus on in any time period. I minored in History and found my major of Anthropology to be extremely beneficial to it. \n\nGeography can be equally beneficial, especially if you’re interested in historic demography. Art history is decent too, but many of those courses are also usually cross listed with Anthropology, so you can still take plenty of that at the same time.\n\nI think the best way to decide is to pick the one most relevant to your main major’s focus. What is it you’re trying to study more of with your history major? Do you have any plans for your thesis?",
      "author": "The_Max_Rebo",
      "created": 1611157564,
      "upvotes": 3,
      "replies": {
        "gk0vx7n": {
          "link": "/r/CollegeMajors/comments/l1aw5j/history_double_major_with_art_history_geography/gk0vx7n/",
          "text": "This is a really good point to make as Geography tends to study different spatial aspects of Anthropology. But honestly, they are pretty similar and many schools and professionals use the fields interchangeably.\n\nI totally second that you can't really go wrong with either, but should mention that Geography tends to be a bit more critical both to events and itself so if critical studies are something you are interested in, Geography may be a bit more desirable.",
          "author": "the_Q_spice",
          "created": 1611200198,
          "upvotes": 2,
          "replies": {
            "gk8c3ou": {
              "link": "/r/CollegeMajors/comments/l1aw5j/history_double_major_with_art_history_geography/gk8c3ou/",
              "text": "Yeah I am interested in critical aspects, have read a good deal on critical theory. I'm starting to gravitate more towards geography. Thanks for your insight.",
              "author": "KafkaFranzisaBug",
              "created": 1611345775,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gk8cuos": {
          "link": "/r/CollegeMajors/comments/l1aw5j/history_double_major_with_art_history_geography/gk8cuos/",
          "text": "Although I'm still somewhat undecided when it comes to history specialization, I'm leaning more towards environmental history, although less interested in US environmental history which has been fairly dominate in the discipline. Also I am interested in intellectual history.",
          "author": "KafkaFranzisaBug",
          "created": 1611346004,
          "upvotes": 2,
          "replies": {
            "gk8j1wt": {
              "link": "/r/CollegeMajors/comments/l1aw5j/history_double_major_with_art_history_geography/gk8j1wt/",
              "text": "In that case, I still stand with my initial statement. Either will beneficial. Really, geography and anthropology cross over so much that the same research questions and methodologies can applied and justified in both, especially in regards to paleo-environments. If you have no interest in ever actually doing archaeological work, I’d just pick the one that has more interesting courses listed. Even then, you’ll probably have a fair amount of those courses cross-listed between anthropology and geography.",
              "author": "The_Max_Rebo",
              "created": 1611348110,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634059515
}