{
  "sid": "c6y8ql",
  "link": "/r/CollegeMajors/comments/c6y8ql/dont_know_what_to_major_in/",
  "title:": "Don't know what to major in..",
  "text": "I'm approaching my freshman year of college and my head is spinning on what I should major in. Although I do not have to choose my major until my Sophomore year, I want to at least have an idea of what I want.\n\nI originally enrolled to be an art major but now I am more interested in chemistry or any science really. I like the thought of making a discovery or making a difference in the world. I'm also concerned that I couldn't keep up in chem classes. I'm feeling a bit overwhelmed since we just received our schedules for the fall semester.  If I make the switch, I feel as though I may miss out on a class I might end up being interested in. I like applying formulas, math, labs, experiments, and organizing digitally (graphic design). But I also like learning new art styles, painting, etc. I also plan on minoring in business to maybe establish my own company (?). People have told me if I major in art, then I should also major in business. I am just all over the place right now and don't know what I should do. I just want a stable future and be happy.\n\nTLDR; I'm an upcoming freshman in uni who doesn't know which career path to follow, art or science. I'm feeling overwhelmed and insecure in my future. Any advice?",
  "author": "theanxiousfreshman",
  "created": 1561810358,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "esbz6sc": {
      "link": "/r/CollegeMajors/comments/c6y8ql/dont_know_what_to_major_in/esbz6sc/",
      "text": "So, what I'm getting from your post, is that you have a very broad range of interests that you aren't exactly sure how to apply yet. Which is great! College should be a time to explore different subjects that interest you, and major in something that reflects your passions, but also leads to a promising career. Based on the interests that you listed, as well as your desire to make a difference/discovery, I've listed some possible majors:\n\n&#x200B;\n\nBiochemical/chemical/biomedical/environmental engineering: All of these degrees should embody a lot of biology or chemistry, and lead to careers where you could do groundbreaking things.\n\n&#x200B;\n\nDouble major in biology and computer science - Bioinformatics is a growing field nowadays (using software to understand biological data). IDK if you're interested in computer science, but if you are, this seems like a good fit.\n\n&#x200B;\n\nBiology/chemistry - Obviously, if you are interested in biology and chemistry, these seem like a logical choice. I would just warn, however, that oftentimes to get a research job in these fields, you need a PHD or at least a masters. \n\n&#x200B;\n\nGraphic design/fine arts - If you're interested in art, becoming a graphic designer is a solid, albeit competitive, choice.  A minor in business could certainly be helpful, though. \n\n&#x200B;\n\nDouble major in computer science/graphic design or psychology/graphic design - UX design is a really interesting multidisciplinary field that could be appealing.\n\n&#x200B;\n\nThose are some suggestions. Don't sweat it too much, since you still have time, but continue to think about what kind of jobs you want and what courses interest you. Definitely also talk to your advisor and college career office to get a sense for your options.",
      "author": "BetUrProcrastinating",
      "created": 1561816432,
      "upvotes": 1,
      "replies": {
        "esc0zyt": {
          "link": "/r/CollegeMajors/comments/c6y8ql/dont_know_what_to_major_in/esc0zyt/",
          "text": "Thank you so much for these suggestions! \nI will definitely check into them and see which interest me the most.\n\nOne more thing. \n\nWhich sounds more beneficial? Waiting until second semester to take chem. classes or sticking with my art classes first and see its what I really want?",
          "author": "theanxiousfreshman",
          "created": 1561817999,
          "upvotes": 1,
          "replies": {
            "esckpq6": {
              "link": "/r/CollegeMajors/comments/c6y8ql/dont_know_what_to_major_in/esckpq6/",
              "text": "If it's an option, take both chem and art classes first semester, so you can find out as early as you can which subject you find more interesting.",
              "author": "BetUrProcrastinating",
              "created": 1561831883,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634059912
}