{
  "sid": "m42vn0",
  "link": "/r/CollegeMajors/comments/m42vn0/i_am_approaching_the_end_of_high_school_and_i/",
  "title:": "I am approaching the end of high school and I still don't know what I want to do.",
  "text": "Hello,\n\nI have been super stressed out for a while now because I can't decide what I want to do in college, and as a career. I've always wanted to go into music, specifically music production, because I have been making music on my computer since the 7th grade, but everything I've read says to pass getting a degree in music as it is basically useless. \n\n\nI know wanting to be a musician/producer requires a ton of luck and skill to get to as a professional career, but I don't know anything else I would be interested in doing. It's probably the one thing I can say I'm actually decent at.\n\nMath has always been my worst subject, I'd barely pass with Bs and Cs, and it was shaky. English has always been my best subject, but I wouldn't say it's something I'm that interested in. The only subject I'm somewhat interested in is history, but I don't know if I would want to go into a career in that space.\n\nI have always been interested in space, galaxies, planets, things like the Pillars of Creation. Space, what it is and what it contains, has always caught, and kept, my interest.\n\nI've also just recently got interested in the stock market, as well as subjects like compound interest. I was planning to go to college to learn the stock market, but now I just don't know.\n\nI love being creative. Making music allows me to express myself in ways nothing else can, and I'd love to do something that allowed me to express myself in this manner.\n\nI don't know if any of the information I've provided is useful, but I would greatly appreciate any advice you have, as I am completely lost on what I want to do. This has been stressing me out so much, and the thought of doing something I despise for my life is scary.",
  "author": "Kirbi126",
  "created": 1615627073,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "gqsa33r": {
      "link": "/r/CollegeMajors/comments/m42vn0/i_am_approaching_the_end_of_high_school_and_i/gqsa33r/",
      "text": "[deleted]",
      "author": null,
      "created": 1615628002,
      "upvotes": 7,
      "replies": {
        "gqtijgl": {
          "link": "/r/CollegeMajors/comments/m42vn0/i_am_approaching_the_end_of_high_school_and_i/gqtijgl/",
          "text": "This! This is great advice OP!\n\nIt’s okay to not know what you want to do going into college - that’s what college is for! College is where you discover your interests and make connections to help you when you graduate. College is a place to figure out who you are as a person and what you want to do with your talents and skills. College has turned from a place to get a better job when you graduate to a place of self discovery and exploration. \n\nI am a second year student and already I have changed my major 7+ times. But that doesn’t mean I’m a failure. It just means I haven’t found my calling yet. It will come to me and when it does, I will embrace it and work hard to raise my, admiringly, shitty GPA so I can keep off of academic probation for more than a couple months. I may not be the best student but that’s not because college failed me, it’s because I failed myself. \n\nGo into music and song writing! It’s your passion so why not explore it? Yes, it’s going to be hard but nobody said college was easy. If you find yourself struggling and, like me, are on the verge of being kicked out - ask for help. Every campus has a place made to help its students out of a rut. Asking for help isn’t a sign of weakness - it’s a sign of strength. \n\nNow that you’ve reached the end of my rant, go off and major in whatever the hell you want. And remember - ask for help if you need it! Someone will always be there to help you back onto the path you chose for yourself. Good luck!",
          "author": "alxotl",
          "created": 1615658878,
          "upvotes": 1,
          "replies": {}
        },
        "gqvfgzn": {
          "link": "/r/CollegeMajors/comments/m42vn0/i_am_approaching_the_end_of_high_school_and_i/gqvfgzn/",
          "text": "Wow, thank you a lot for this advice, seriously. It's making me think about this in a different light. I know I'm just a stranger on the internet, but thank you a lot.",
          "author": "Kirbi126",
          "created": 1615698944,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634059619
}