{
  "sid": "qxgvm7",
  "link": "/r/ApplyingToCollege/comments/qxgvm7/failing_calc_bc_what_should_i_do/",
  "title:": "Failing Calc BC. What should I do?",
  "text": "All year I’ve been telling myself it’ll get better. The quarter is going to end in about a month, though, and by my calculations, the highest I could possibly get in the class is an 82. My teacher has a stick up her ass 24/7 so if I ask her if there’s anything I can do to bring the grade up, I doubt she’d say yes. \n\nY’all please give me some advice. I can’t drop the class, nor do I want to. I want to learn this stuff, but I just know my semester mid year grade is gonna be shitty asf. \n\nI do all the practice quizzes, optional homework, actual homework, I study, I fucking bought princeton review’s homework help program, I have another tutor, and khan academy and organic chem tutor. I don’t understand how people are surviving this class. \n\nIt makes me feel so dumb. But I really don’t know what else to do to bring the grade up 😭",
  "author": "Cute-Ad1655",
  "created": 1637330650,
  "updated": 1637357686,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hl97n9q": {
      "link": "/r/ApplyingToCollege/comments/qxgvm7/failing_calc_bc_what_should_i_do/hl97n9q/",
      "text": "I'm going through the same thing and I don't know what to do either, but hey, you aren't alone Ig",
      "author": "alienatedhuman",
      "created": 1637330752,
      "upvotes": 3,
      "replies": {}
    },
    "hl9zjhu": {
      "link": "/r/ApplyingToCollege/comments/qxgvm7/failing_calc_bc_what_should_i_do/hl9zjhu/",
      "text": "This may not help, but I’ve learned that over time classes would usually just ‘click in place’ for me. It may take longer for things to click though. I would also analyze where you are making mistakes, such as if they are silly or conceptual. I think a problem is that sometimes people can memorize computational processes but not the ideas, and then they can’t apply that to problems which look slightly different. This may be the case for you.",
      "author": "leaf1598",
      "created": 1637342362,
      "upvotes": 2,
      "replies": {}
    },
    "hl98nng": {
      "link": "/r/ApplyingToCollege/comments/qxgvm7/failing_calc_bc_what_should_i_do/hl98nng/",
      "text": "I know you may have already tried this, but the first option I always explore is studying with other students who are doing well. I would learn how they studied, what they thought was more important, how they approached solutions, etc. The trade-off for them is that when they help you learn, they actually end up solidifying their own knowledgebase. Anyway, I figured since you can’t get afterclass help from your teacher it seems the next best source are the kids who are ace’ing it.",
      "author": "pupuphlatter",
      "created": 1637331231,
      "upvotes": 1,
      "replies": {}
    },
    "hl9xr9z": {
      "link": "/r/ApplyingToCollege/comments/qxgvm7/failing_calc_bc_what_should_i_do/hl9xr9z/",
      "text": "U arent alone :(",
      "author": "blue_beluga02",
      "created": 1637341667,
      "upvotes": 1,
      "replies": {}
    },
    "hlb3ihk": {
      "link": "/r/ApplyingToCollege/comments/qxgvm7/failing_calc_bc_what_should_i_do/hlb3ihk/",
      "text": "What exactly is hard? Are the assessments really hard? I had an A in the first quarter and it was pretty easy. I can give you advice if you give me more details on where you are going wrong.",
      "author": "CompetitiveTable1",
      "created": 1637357558,
      "upvotes": 1,
      "replies": {}
    }
  }
}