{
  "sid": "qz01lx",
  "link": "/r/ApplyingToCollege/comments/qz01lx/having_trouble_choosing_a_degree_and_school_los/",
  "title:": "Having trouble choosing a degree and school (los Angeles)",
  "text": "I want to be a firefighter but also a pilot. I’ve always wanted to be an airline pilot but at the moment I feel like It be best for me if I work while saving lives. For both work choices I will need a degree for the good pay. It can be any degree but I’m Not sure what I should pick. Any advice would be appreciated",
  "author": "Cookieeater69_",
  "created": 1637516380,
  "updated": 1637687960,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hljcxrz": {
      "link": "/r/ApplyingToCollege/comments/qz01lx/having_trouble_choosing_a_degree_and_school_los/hljcxrz/",
      "text": "Climatological sciences, emergency management, or public administration might work for both possible career trajectories.\n\nThere are also schools teaching fire science or aviation sciences, but those are obviously more specific.\n\nUCLA has an awesome atmospheric and oceanic institute. On the safer side, SJSU also has climatology. Most undergrad institutions would have something like that.",
      "author": "LadyMjolnir",
      "created": 1637518753,
      "upvotes": 1,
      "replies": {}
    },
    "hljlwio": {
      "link": "/r/ApplyingToCollege/comments/qz01lx/having_trouble_choosing_a_degree_and_school_los/hljlwio/",
      "text": "Are you a senior or younger?  And do you have to be in the Los Angeles area?  Some colleges have aviation programs. I want to say Emory Riddle and Purdue may have something similar. One of the kids I mentor wants to be a pilot. \n\nYou could become EMT certified on the side and work while in college or start with volunteer firefighting and then see how you can get into the fire dept. It is a long process and I thought you needed a four year degree to be a fire fighter?  But maybe they would make an exception if you are a volunteer fire fighter.",
      "author": "TwoSuns168",
      "created": 1637522198,
      "upvotes": 1,
      "replies": {}
    }
  }
}