{
  "sid": "q70lq2",
  "link": "/r/ApplyingToCollege/comments/q70lq2/is_it_bad_that_my_ecs_are_kinda_all_over_the/",
  "title:": "Is it bad that my EC's are kinda all over the place and not spiked, even if I do excel in most of those areas?",
  "text": "My friends and I were helping to revise each others activity lists, and something that quite a few of my friends mentioned was that my activities are kinda scattered all over the place and that it could possibly hurt me come college admissions. I do have a pretty decent spike in the field I'm planning on majoring in (1st place in a national olympiad for it, research at a university pertaining to the field, and a really unique passion project also related to it), but as for my spike that's basically it. \n\nI have a lot of other high-commitment activities but they're really scattered across the board. I've been working about 25 hours a week for the past few years both in the summer and in the school year, I have a ton of achievements in a martial art, I have earnings in a major fighting game and founded the esports club at my school, and I have over 400 volunteer hours combined at a local community center, but these really aren't related in anyway. I don't want this to come off as braggy in anyway, I know my EC's are really good but I'm just concerned that the lack of focus will make it seem like I'm all over the place and hurt my chances.",
  "author": "PrimalVortechs",
  "created": 1634088807,
  "updated": 1634167103,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgfldyk": {
      "link": "/r/ApplyingToCollege/comments/q70lq2/is_it_bad_that_my_ecs_are_kinda_all_over_the/hgfldyk/",
      "text": "Nah. Do what you like",
      "author": "Thunderbird23",
      "created": 1634090409,
      "upvotes": 1,
      "replies": {}
    },
    "hgg3mc8": {
      "link": "/r/ApplyingToCollege/comments/q70lq2/is_it_bad_that_my_ecs_are_kinda_all_over_the/hgg3mc8/",
      "text": "Having a scattered focus won't hurt your chances of getting into college. You will probably actually have a high chance because it shows that you're a hard worker and you want to get involved with the community.",
      "author": "txicab",
      "created": 1634099821,
      "upvotes": 1,
      "replies": {}
    },
    "hggq3yb": {
      "link": "/r/ApplyingToCollege/comments/q70lq2/is_it_bad_that_my_ecs_are_kinda_all_over_the/hggq3yb/",
      "text": "i’m so tired of the word spike. having multiple interests and pursuing them will never hurt you !!",
      "author": "whoreforbrown",
      "created": 1634117956,
      "upvotes": 1,
      "replies": {}
    }
  }
}