{
  "sid": "qihahy",
  "link": "/r/ApplyingToCollege/comments/qihahy/nov_1_deadlines_you_got_this/",
  "title:": "Nov 1 deadlines? You got this.",
  "text": "I know students are likely pretty stressed leading up to Monday. Just a few reminders from the admissions side:\n\n1. It has been said time and time again; this is not the end-all, be-all of your life. I know ED/EA applications might feel like the weight of the world, but you’ll end up at the right place regardless of what happens. \n\n2. I often see panicked emails right around midnight of the deadline. IN NEARLY ALL CASES, colleges will give you grace and leniency in submitting your application after the deadline, and you don’t need to email us and tell us you were five minutes late. Yes, the deadline is usually in your local time before midnight, but I know very few admissions directors that literally turn off their application on the dot. Why do that with so many time zones? There’s actually a grace period feature built into the Common App for administrators, and most of use it. Of course, I hope you don’t wait until the deadline and stress yourself out, but it happens. \n\n3. Colleges - in nearly all circumstances - will also accept materials from your school after the deadline. We are people. We understand your counselors are people. They have a HUGE job leading up to Nov 1, and we will not penalize you. Just make sure things get in as soon as you can. \n\n4. Check your applicant portal and PLEASE don’t email us the next day asking about a missing material. You and your thousand other friends are doing the same thing, and it takes a tremendous amount of time to answer these emails. The time we would otherwise be spending on getting materials into your portal. So please just wait a few days, at least. Again, you’ll be fine. \n\n5. If you need an application fee waiver, ask today (or better yet, Google the college’s name and “application fee waiver”. You can usually find what you need.)\n\n6. Once you submit, take a break for yourself. You crossed a milestone and submitted your first apps. Once you’ve celebrated yourself, I highly suggest you work on your RD apps and supplements. Nothing is guaranteed in ED/EA, and we see it every year of impossibly working on supplements during your winter break. Try to get them out of the way now. You can always withdraw your RD app later on.\n\nYou’ve got this. You have worked hard, should be proud of yourself, and good luck with the college search process.",
  "author": "USAdmissionsDirector",
  "created": 1635526713,
  "updated": 1635778705,
  "over_18": false,
  "upvotes": 173,
  "upvote_ratio": 0.99,
  "comments": {
    "hik4cx2": {
      "link": "/r/ApplyingToCollege/comments/qihahy/nov_1_deadlines_you_got_this/hik4cx2/",
      "text": "Needed this. Thanks!",
      "author": "-IndigoMist-",
      "created": 1635539163,
      "upvotes": 9,
      "replies": {}
    },
    "hilxy76": {
      "link": "/r/ApplyingToCollege/comments/qihahy/nov_1_deadlines_you_got_this/hilxy76/",
      "text": "can my lors be submitted after i hit submit? one of my letters isn’t in yet and the teacher is explicit about submitting on the deadline (for whatever reason she does)",
      "author": "whoreforbrown",
      "created": 1635570860,
      "upvotes": 4,
      "replies": {
        "himigv0": {
          "link": "/r/ApplyingToCollege/comments/qihahy/nov_1_deadlines_you_got_this/himigv0/",
          "text": "yes. if ur application is in on time, colleges don’t care if ur supporting documents are late.",
          "author": "PitzerSimp",
          "created": 1635586862,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hikn7st": {
      "link": "/r/ApplyingToCollege/comments/qihahy/nov_1_deadlines_you_got_this/hikn7st/",
      "text": "Do applicants have to complete also the info on the school’s portal by the deadline? Or does the deadline apply only to the common / coalition app?",
      "author": "angelikesunsets",
      "created": 1635547055,
      "upvotes": 3,
      "replies": {
        "hikv6uj": {
          "link": "/r/ApplyingToCollege/comments/qihahy/nov_1_deadlines_you_got_this/hikv6uj/",
          "text": "Of course, there are hundreds and hundreds of colleges, so I can’t give you a straight answer. I would say try to get everything done by the deadline, if possible. At the very least, submit your app via Common App or Coalition App by the deadline.",
          "author": "USAdmissionsDirector",
          "created": 1635550703,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hilzzna": {
      "link": "/r/ApplyingToCollege/comments/qihahy/nov_1_deadlines_you_got_this/hilzzna/",
      "text": "wait applications are due November 1st? Shit.",
      "author": "FrogsDoBeCool",
      "created": 1635572256,
      "upvotes": 1,
      "replies": {
        "himif5w": {
          "link": "/r/ApplyingToCollege/comments/qihahy/nov_1_deadlines_you_got_this/himif5w/",
          "text": "not all of them are, RD applications are due in January and even for ED, there are quite a few schools with later November deadlines. though, yeah, there are a lot of applications due Nov 1.",
          "author": "PitzerSimp",
          "created": 1635586821,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}