{
  "sid": "rhchpq",
  "link": "/r/ApplyingToCollege/comments/rhchpq/please_answer_this_weird_rec_letter_question/",
  "title:": "Please answer this weird rec letter question",
  "text": "I was going to apply as Econ but I think I want to apply as business now……the thing is, my counselor/teachers make u show them a “brag sheet” with grades/activities but also a part of it is what your intended major/career is and I wrote a short paragraph on there about how I want to major in Econ/be an economist/etc, but now I want to apply to business schools instead w Econ as a second choice\n\nWhat if my recommenders mentioned anything econ related? Will it raise red flags if they talk about my Econ desires when I actually want to apply to business schools? \n\nI realize I could just apply for Econ and change to business later but I plan on applying to some higher caliber schools where it might be difficult to transfer into the business school",
  "author": "riiptemp",
  "created": 1639610741,
  "updated": 1639787197,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hopptc8": {
      "link": "/r/ApplyingToCollege/comments/rhchpq/please_answer_this_weird_rec_letter_question/hopptc8/",
      "text": "If you included it on your brag sheet, I would assume that the teachers included it in your recommendation. This is especially likely if you asked an econ teacher or someone in that field. However, if you haven't turned in your applications, it isn't too late. Just explain to your teachers how you have decided to change majors, maybe give them a paragraph on your passion for business, and ask them to change anything that mentions economics in your rec letter. I would do this asap as they will need time to read things over and deadlines are coming up.",
      "author": "fortuitous_rain515",
      "created": 1639613021,
      "upvotes": 1,
      "replies": {}
    },
    "hoq19e1": {
      "link": "/r/ApplyingToCollege/comments/rhchpq/please_answer_this_weird_rec_letter_question/hoq19e1/",
      "text": "Check the policy for the school first because 'higher-caliber' doesn't necessarily equate harder to change your major. I'd actually argue the opposite, as many top schools don't even let you declare until later.",
      "author": "Own_Bookkeeper574",
      "created": 1639618226,
      "upvotes": 1,
      "replies": {}
    }
  }
}