{
  "sid": "ri0myq",
  "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/",
  "title:": "Should I apply to Rice?",
  "text": "Title. They emailed me and said they've waived my application fee. Here's what they said:\n\n\"Congratulations on your successful completion of the College Board SAT exams.\n\nYou've put in a lot of hard work to get to this point. We hope you'll seriously consider applying to Rice University, which is why we're **waiving your $75 application fee**. Just complete your application and respond to the fee waiver prompts provided in the Common Application or Coalition Application.\"\n\nI actually got really excited about Rice 6 months or so ago but scratched it off the list because it's in Texas. Anyone have any thoughts? If I'm going to apply I'd need to add it to the other 12 colleges I'm writing supplementals for, but I'd really only have to write one more 150 word essay, which shouldn't be too difficult.\n\nShould I do it? Be a crackhead and apply to one more school (on top of 18 total already lol). I'm weak for a fee waiver, and if Rice is emailing me like this does it mean they're interested in me?",
  "author": "tincanC2",
  "created": 1639689905,
  "updated": 1639786070,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hou319s": {
      "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/hou319s/",
      "text": "Apply -go there-register to vote in Texas-vote blue-make a difference-good luck",
      "author": "Hamilton3322",
      "created": 1639691528,
      "upvotes": 8,
      "replies": {}
    },
    "hou10r2": {
      "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/hou10r2/",
      "text": "Houston (excluding burbs) is blue.  Rice is dark blue.  Unless you need to have an abortion, you shouldn't be significantly affected by the fact that Texas is a red state.  I have several friends from HS who went to Rice, and they all loved it.",
      "author": "jayphoward",
      "created": 1639690735,
      "upvotes": 7,
      "replies": {}
    },
    "hotz61m": {
      "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/hotz61m/",
      "text": "I mean... if it’s free",
      "author": "AyaanTheIon",
      "created": 1639689999,
      "upvotes": 8,
      "replies": {
        "hou25yg": {
          "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/hou25yg/",
          "text": "And it’s still in Texas.",
          "author": "RichInPitt",
          "created": 1639691181,
          "upvotes": 5,
          "replies": {
            "hovagvz": {
              "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/hovagvz/",
              "text": "go figure",
              "author": "AyaanTheIon",
              "created": 1639710647,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hou17zq": {
      "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/hou17zq/",
      "text": "Some food for thought: Schools send emails like that often. It's difficult to tell what any specific school means when they message you and urge you to apply.   \n\n\nKeep in mind that they are incentivized to encourage you to apply, since the more applicants they have, the more selective they will have to be, which will feed into both their rankings and how \"prestigious\" the school is seen as.",
      "author": "MapleLeif_",
      "created": 1639690814,
      "upvotes": 3,
      "replies": {}
    },
    "hou4uet": {
      "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/hou4uet/",
      "text": "Don’t apply just for the sake of applying or even just because they might like you. If you actually like the school, then go for it. \n\nI know several people that got rice fee waivers and applied, most did not get in. That doesn’t mean they don’t use waivers to entice students they really want, but I wouldn’t be too optimistic.",
      "author": "sedlaghs",
      "created": 1639692258,
      "upvotes": 2,
      "replies": {
        "hovbetq": {
          "link": "/r/ApplyingToCollege/comments/ri0myq/should_i_apply_to_rice/hovbetq/",
          "text": "Thank you for your advice. I don't know if it would be the right fit for me. Still debating it heavily tho bc the app is free 😮‍💨",
          "author": "tincanC2",
          "created": 1639711074,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}