{
  "sid": "qzjbtg",
  "link": "/r/ApplyingToCollege/comments/qzjbtg/how_to_submit_accolades/",
  "title:": "How to submit accolades?",
  "text": "This might sound like a trivial question but I’d appreciate help as I’m doing this as an international. How do I submit my academic and extracurricular certificates? \nIn the Princeton application, you can only submit 3 additional accolades (no more than that).\nIn Harvard application, you can submit only 5 academic certificates. \n\nThe thing is…I have many accolades and there’s not enough space in the app.  Would I have to use application portal for their submission? \n\nAnd also, how do I send them the proof of my extracurriculars? Like the thousand of hours, I worked at my foundation and in my summer jobs? \nMy summer job employer is writing a \nletter for me, Would he have to emphasize that I spent this many hours?",
  "author": "PossessionStandard42",
  "created": 1637580314,
  "updated": 1637687768,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlmmxoo": {
      "link": "/r/ApplyingToCollege/comments/qzjbtg/how_to_submit_accolades/hlmmxoo/",
      "text": ">How do I submit my academic and extracurricular certificates?\n\nYou don't. You list them in your application. Colleges do not want the certificate.\n\n>how do I send them the proof of my extracurriculars\n\nSame answer as above.",
      "author": "skieurope12",
      "created": 1637581464,
      "upvotes": 5,
      "replies": {}
    },
    "hlmmzmd": {
      "link": "/r/ApplyingToCollege/comments/qzjbtg/how_to_submit_accolades/hlmmzmd/",
      "text": "All of these achievements should be listed in your application. You do not need to send supporting materials.",
      "author": "AO585858",
      "created": 1637581505,
      "upvotes": 3,
      "replies": {
        "hlp21tv": {
          "link": "/r/ApplyingToCollege/comments/qzjbtg/how_to_submit_accolades/hlp21tv/",
          "text": "You think that if a school provides slots for five items, an applicant should list an additional “you didn’t give me enough room for these” ten more in Additional Information?\n\nI disagree. If they ask for 5, they want 5.",
          "author": "RichInPitt",
          "created": 1637620249,
          "upvotes": 1,
          "replies": {
            "hlp3rx4": {
              "link": "/r/ApplyingToCollege/comments/qzjbtg/how_to_submit_accolades/hlp3rx4/",
              "text": "I agree, there is rarely a need for students to list more than five, but listing additional achievements in the Additional Information section is better than emailing or mailing copies of certificates or other materials.",
              "author": "AO585858",
              "created": 1637620994,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlp1tlv": {
      "link": "/r/ApplyingToCollege/comments/qzjbtg/how_to_submit_accolades/hlp1tlv/",
      "text": "If they ask for x, they want your top x.\n\nYou don’t need to send any kind of proof.",
      "author": "RichInPitt",
      "created": 1637620150,
      "upvotes": 1,
      "replies": {}
    }
  }
}