{
  "sid": "rf1k54",
  "link": "/r/ApplyingToCollege/comments/rf1k54/predictions_for_eareaed_decisions_next_week/",
  "title:": "Predictions for EA/REA/ED Decisions next week:",
  "text": "What do you think the trends will be for your specific school?\n\n* Do u think applicant rates will be up like last year? down? \n* Will colleges have more internationals? less? \n\nI overall don't think that these large trends have THAt much effect on your own application, but I'm curious as to what y'all think :)",
  "author": "fettaalfredo",
  "created": 1639352625,
  "updated": 1639514513,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hobb5hc": {
      "link": "/r/ApplyingToCollege/comments/rf1k54/predictions_for_eareaed_decisions_next_week/hobb5hc/",
      "text": "i applied rea to stanford and these are my predictions:\n\n1. more applications indicated by them pushing back the release date compared to many previous years\n\n2. lower acceptance rate however they havent published rea stats in recent years so there’s no real way of knowing\n\n3. i think they will probably take the same number of internationals as previous years as they are need aware for foreign students and need blind for domestic applicants\n\n4. i think this will be one of the more competitive applicant pools in recent years as i’ve seen a lot of chance mes with insane stats and ec’s",
      "author": "socallaghann",
      "created": 1639353410,
      "upvotes": 7,
      "replies": {}
    },
    "hobe5br": {
      "link": "/r/ApplyingToCollege/comments/rf1k54/predictions_for_eareaed_decisions_next_week/hobe5br/",
      "text": ">Do u think applicant rates will be up like last year? down?\n\nAcceptance rates for almost all selective schools were down last year due to test optional policies increasing application numbers (and also increasing yield). As test optional policies have continued, application numbers will likely be up and acceptance rates will likely be down, like last year.",
      "author": "elkrange",
      "created": 1639354770,
      "upvotes": 2,
      "replies": {
        "hobgd44": {
          "link": "/r/ApplyingToCollege/comments/rf1k54/predictions_for_eareaed_decisions_next_week/hobgd44/",
          "text": "When and how does this madness end!",
          "author": "T123369",
          "created": 1639355776,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}