{
  "sid": "qa2q0w",
  "link": "/r/ApplyingToCollege/comments/qa2q0w/full_rides_for_decent_to_normal_students_final/",
  "title:": "Full Rides for decent to normal students: Final part",
  "text": "Hey y’all I am so sorry for posting so late but my life has been just insane. I want to post the last of the scholarships I’ve found but this post won’t be as clean and informative as the others. I’m really just giving the schools I believe to have these scholarships, not the niche score, whether they’re international friendly, HBCU, exact money details, etc*.\n\nAgain I AM SO SORRY for the late reply, I’m really going out with a whimper and not a bang. However, I really do want to try this December break to really clean up this post and also do some deep research for international full rides (which takes a lot lol). \n\nFor my senior internationals this year, I am so sorry but I don’t think my list will come out in time for you guys to benefit from it. I’ll still try to get it out in December regardless because it can help the Juniors. I really do wish you guys the best of luck and I know how hard y’all work. I’m really sorry I couldn’t help sooner but it’s just not possible for me right now.\n\nSo, with all that said here’s the rest of the schools. With a little googling, I think the scholarships will pop up and y’all can go from there.\n\nHere’s what I have on my notes:\n\n\nUniversity of Louisville \n\nACT/SAT/GPA: 31, 1390, 3.5\n\n\nPrairie View A&M\n\n(Don’t have the ACT or SAT, but I remember it being reasonable when I last searched it up)\n\nLATech\n\n(For this one I believe you have to be a nat. Merit  to get the full housing but there’s another one that’s all tuition and one year of housing if that interests you).\n\nLayola Marymount University \n\n(It’s a tad bit more competitive than the usual but I think it’s do-able. I couldn’t find specific ACT/SAT, but just assume they’re decent scores 30+).\n\n\nI lost half of my notes and so I know this seems so incomplete and I’m sorry for that but hopefully once I have my break I can clean this post up and make one for internationals.\n\n\nThanks y’all for your time and patience. I really want you guys to succeed and have the financial freedom to live your lives!",
  "author": "Eva_Reese",
  "created": 1634489912,
  "updated": 1634653186,
  "over_18": false,
  "upvotes": 79,
  "upvote_ratio": 0.99,
  "comments": {
    "hh07f5j": {
      "link": "/r/ApplyingToCollege/comments/qa2q0w/full_rides_for_decent_to_normal_students_final/hh07f5j/",
      "text": "I'd give you an award if I had one",
      "author": "oliversolives",
      "created": 1634490934,
      "upvotes": 19,
      "replies": {
        "hh0hk03": {
          "link": "/r/ApplyingToCollege/comments/qa2q0w/full_rides_for_decent_to_normal_students_final/hh0hk03/",
          "text": "Just gave them the helpful award on your behalf. The Reddit gods must have known since that was my free one today.",
          "author": "chaotically_awkward",
          "created": 1634495070,
          "upvotes": 5,
          "replies": {
            "hh0pry1": {
              "link": "/r/ApplyingToCollege/comments/qa2q0w/full_rides_for_decent_to_normal_students_final/hh0pry1/",
              "text": "Thanks!!",
              "author": "oliversolives",
              "created": 1634498458,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hh2segr": {
          "link": "/r/ApplyingToCollege/comments/qa2q0w/full_rides_for_decent_to_normal_students_final/hh2segr/",
          "text": "Gotchu covered",
          "author": "makarov_skolsvi",
          "created": 1634535407,
          "upvotes": 2,
          "replies": {}
        },
        "hh3uaq1": {
          "link": "/r/ApplyingToCollege/comments/qa2q0w/full_rides_for_decent_to_normal_students_final/hh3uaq1/",
          "text": "Aw thank you, I honestly felt bad for how little this last list went but I’m glad you appreciate it. If you check my pay history there are two others with the same things but more filled out!",
          "author": "Eva_Reese",
          "created": 1634563990,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh34icg": {
      "link": "/r/ApplyingToCollege/comments/qa2q0w/full_rides_for_decent_to_normal_students_final/hh34icg/",
      "text": "I wonder if stuff like this applies to transfer students",
      "author": "Outherepoor",
      "created": 1634545542,
      "upvotes": 2,
      "replies": {
        "hh3ul3f": {
          "link": "/r/ApplyingToCollege/comments/qa2q0w/full_rides_for_decent_to_normal_students_final/hh3ul3f/",
          "text": "Sadly a lot of these are for freshman only, but if you graduate high school with credits ( I had about 30) you can still get most of these I believe.",
          "author": "Eva_Reese",
          "created": 1634564135,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}