{
  "sid": "qt0d50",
  "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/",
  "title:": "Doubting ED app",
  "text": "Guys is it bad that I’m starting to doubt my ED application. So I applied ED to NEU cause I loved everything about it, but the one thing that’s tripping me up is how cold it gets in Boston. Is it worth withdrawing my ED app and applying RD just because of one factor? Like everything else about it is perfect, it’s just I don’t think I’ll be comfortable somewhere that cold.",
  "author": "SomehowUnanxious",
  "created": 1636806846,
  "updated": 1637180388,
  "over_18": false,
  "upvotes": 50,
  "upvote_ratio": 0.87,
  "comments": {
    "hkgefoj": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgefoj/",
      "text": "As someone who lives in Boston, I'll tell you the weather situation isn't *all* bad. Sometimes (maybe for about 2-3 months of the year, but it depends—sometimes it won't snow at all, otherwise there will be snow on the ground from November through March), it will be pretttttyyyyy cold, but in other seasons, there's nowhere I'd rather be. The spring and fall is beautiful and temperate, and the summer, though humid, is really pleasant, especially considering it's such a stark contrast from the winter weather. It obviously isn't southern california (where the weather seems to be 70 degrees and sunny every day? wtf) but it has its own charm. \n\n&#x200B;\n\nAs for if that's sufficient grounds to change your application from ED to RD—absolutely. You would be living in Boston, and if that doesn't sound like something you would enjoy, then it is within your prerogative to change to RD. I think you have a win-win situation on your hands though—no matter what, I promise everything will be ok :)",
      "author": "toastableantitoast",
      "created": 1636810562,
      "upvotes": 38,
      "replies": {
        "hkjkwpz": {
          "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkjkwpz/",
          "text": "This fall absolutely slaps but is it usually really temperate? I remember summer like weather, a week of crisp blue sky days, and a few months of wind and cold and snow and slush and darkness in previous years\n\nBut also yeah I agree that having the contrast is pretty nice. In find that it kind of gives life a nice routine cycle since we actually like have distinct seasons here",
          "author": "night-moth",
          "created": 1636861760,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkgb44y": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgb44y/",
      "text": "It's a little late, but we eliminated colleges for dumber reasons than the cold. If you absolutely think you will hate it, then withdraw.\n\n I went to college someplace colder than expected, and it made it hard to make it to class for me. Other people had no problem.",
      "author": "mommacat94",
      "created": 1636808501,
      "upvotes": 19,
      "replies": {}
    },
    "hkgpseb": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgpseb/",
      "text": "You’re making a $300k decision based on weather? \n\nYou know the buildings in Boston are heated, right?",
      "author": "SpacerCat",
      "created": 1636816557,
      "upvotes": 70,
      "replies": {}
    },
    "hkg96vs": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkg96vs/",
      "text": ">the one thing that’s tripping me up is how cold it gets in Boston.\n\nThere’s no such thing as “cold weather” just “wrong clothes.”",
      "author": "Strict-Special3607",
      "created": 1636807205,
      "upvotes": 99,
      "replies": {}
    },
    "hkgct72": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgct72/",
      "text": "Invest in a good coat and wear layers problem solved",
      "author": "seriesunfortunatesuc",
      "created": 1636809577,
      "upvotes": 14,
      "replies": {}
    },
    "hkgrmkv": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgrmkv/",
      "text": "If your not used to Boston weather it’s more than just adding clothes and heated buildings- the time outside for activities can be limited due to snow,ice. It’s why the rec centers are top notch knowing they are used in abundance during winter. Almost ED to BC loved everything about it but the weather and inability to mountain bike among other things including the temperature,wind and extended winter did deter me,resulting in focusing on schools in the south. It’s all important, no issues changing to RD aside from decreased chance due to vol. of applicants.",
      "author": "7katzonthefarm",
      "created": 1636817434,
      "upvotes": 6,
      "replies": {}
    },
    "hkgfvs2": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgfvs2/",
      "text": "My top is Vermont. Trust me, while the cold is a daunting prospect, you'll live if you prepare correctly. I have family from Maine, so while I'm from the South I know what to wear. Get wool socks to out over your regular socks, get some good waterproof and insulated winter boots (though Boston would likely have all its snow melted and such), get long sleeves, some fleece sweatshirts or such, and then a good thick water resistant and insulated jacket. Layers, layers, layers.",
      "author": "gouverneurmroosevelt",
      "created": 1636811418,
      "upvotes": 3,
      "replies": {}
    },
    "hkgrtsc": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgrtsc/",
      "text": "get a puffer jacket and sweats and you’re gucci",
      "author": "No-Bookkeeper5440",
      "created": 1636817525,
      "upvotes": 3,
      "replies": {}
    },
    "hkgulgh": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgulgh/",
      "text": "Think about this way:\n\nYou can always layer up but can only strip to a certain extent.\n\nDon’t let weather stop you. In the grand of scheme of things, it doesn’t matter. Just bring a lot of winter clothes",
      "author": "Classical_Music26",
      "created": 1636818801,
      "upvotes": 3,
      "replies": {}
    },
    "hkhlabn": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhlabn/",
      "text": "I’m a real weather wimp myself, so I understand the hesitation. One thing to consider tho is that if you live there, you’ll be prepared. Lined sheepskin boots plus good wool socks (so they aren’t itchy) can keep toes toasty even in extreme cold (and can feel as comfy as slippers). If you have a good winter jacket with a layer underneath, the torso is set. Good mittens will keep your hands warm. The toughest to keep warm is the face, but a soft warm scarf works in all but extreme sub-zero temps (which would be rare in Boston). The hardest time I have in the cold is taking all that stuff off once I get indoors as a lot of places keep it so warm, I want summer clothes inside. If you decide to leave your app ED, you’ll know your admission status early & have time to get the right gear (secondhand if money is tight), and the right gear makes the cold a lot more tolerable. \n\nIf you’re not ready for the adventure of cold, it’s ok to change, but you may find it tolerable for 4 years if you love everything else about the school. Are there other places that you vibe with as much or more?",
      "author": "pixelatedpix",
      "created": 1636830281,
      "upvotes": 3,
      "replies": {}
    },
    "hki8yxm": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hki8yxm/",
      "text": "hey!! I currently attend NEU and we do have a tunnel system that makes it easy to travel between buildings when it’s very cold out. also all our buildings are heated, and we have lots of fire pits and covered outdoor areas that are heated.",
      "author": "aziraphale14735",
      "created": 1636840405,
      "upvotes": 2,
      "replies": {}
    },
    "hkis3eo": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkis3eo/",
      "text": "Boy, are you from California? Boston is not that cold, chill",
      "author": "oneulnaeil",
      "created": 1636848540,
      "upvotes": 2,
      "replies": {}
    },
    "hkgdpir": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgdpir/",
      "text": "I'd keep in mind that NEU tracks demonstrated interest & it might affect your chances if you drop from ED to RD (edit: this is wrong, I'm just keeping this here so that no one else is misinformed). Otherwise, I think it's definitely a valid reason to drop a school because of cold weather.",
      "author": "Washed_Bananas",
      "created": 1636810133,
      "upvotes": 3,
      "replies": {
        "hkggtz8": {
          "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkggtz8/",
          "text": "Tracking interest is one thing, but that is not affected by changing an application plan.",
          "author": "blue_surfboard",
          "created": 1636811953,
          "upvotes": 8,
          "replies": {
            "hkgi0bq": {
              "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgi0bq/",
              "text": "Ooh that's interesting, thank you! A friend of mine had their admissions officer at NEU tell them otherwise, but I guess I was probably misinformed. I've edited my comment accordingly.",
              "author": "Washed_Bananas",
              "created": 1636812593,
              "upvotes": 3,
              "replies": {}
            },
            "hkh7h3u": {
              "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkh7h3u/",
              "text": "ED is basically the ultimate demonstration of interest. It’s the simple reality that the yield on students applying ED is more or less 100%, and if you’re using demonstrated interest as a way to assess likelihood of enrollment, you can’t really ask for more than that. NEU is known for practicing yield protection and has an ED II. I'd agree with you if we were talking about MIT. But we are talking about NEU, changing the application plan will be a major factor affecting the outcome.",
              "author": "JJKKLL10243",
              "created": 1636824362,
              "upvotes": -1,
              "replies": {
                "hkhk40f": {
                  "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhk40f/",
                  "text": "Do you have a source for Northeastern practicing yield protection?",
                  "author": "blue_surfboard",
                  "created": 1636829770,
                  "upvotes": -1,
                  "replies": {
                    "hkhlg5p": {
                      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhlg5p/",
                      "text": "All ED II schools are practicing yield protection and NEU is a well-known one. [Example (see the first post)](https://www.reddit.com/r/ApplyingToCollege/comments/7shdvf/schools_known_for_using_yield_protection/).",
                      "author": "JJKKLL10243",
                      "created": 1636830347,
                      "upvotes": 0,
                      "replies": {
                        "hkhlx5l": {
                          "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhlx5l/",
                          "text": "All of that is anecdotal. None of it is actual evidence. And based on MY reliable sources, I’m going to tell you that Northeastern doesn’t do this.",
                          "author": "blue_surfboard",
                          "created": 1636830552,
                          "upvotes": 0,
                          "replies": {
                            "hkhql8y": {
                              "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhql8y/",
                              "text": "People have been reporting this for years, including some of my friends who went to much better schools lmao. Everybody knows. So why does a school which doesn't practice yield protection need to use ED II to lock in students?",
                              "author": "JJKKLL10243",
                              "created": 1636832563,
                              "upvotes": -2,
                              "replies": {
                                "hkhr2ya": {
                                  "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhr2ya/",
                                  "text": "Again, anecdotal evidence. I’ve been saying it in this sub for years, but unless you are in the room when it happens, you don’t know how applications are read and why they make the decisions that they do.",
                                  "author": "blue_surfboard",
                                  "created": 1636832773,
                                  "upvotes": 0,
                                  "replies": {
                                    "hkht9mc": {
                                      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkht9mc/",
                                      "text": "Winston Churchill Quote: “I no longer listen to what people say, I just watch what they do. Behavior never lies.” ED II is basically the ultimate demonstration of yield protection practice.",
                                      "author": "JJKKLL10243",
                                      "created": 1636833710,
                                      "upvotes": -1,
                                      "replies": {
                                        "hkiblmc": {
                                          "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkiblmc/",
                                          "text": "are you trying to explain the admissions process to a verified AO?",
                                          "author": "taylorm898",
                                          "created": 1636841514,
                                          "upvotes": 1,
                                          "replies": {
                                            "hkj7uqk": {
                                              "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkj7uqk/",
                                              "text": "LORD give me strength.",
                                              "author": "blue_surfboard",
                                              "created": 1636855649,
                                              "upvotes": 2,
                                              "replies": {}
                                            },
                                            "hkixzfq": {
                                              "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkixzfq/",
                                              "text": "So why does a school which doesn't practice yield protection need to use ED II to lock in students? Why not just let RD admits choose where they want to go? We are talking about NEU, the one which is known for [gaming the college rankings](https://www.bostonmagazine.com/news/2014/08/26/how-northeastern-gamed-the-college-rankings/).  Jeff Selingo, in his book “[Who Gets In And Why: A Year Inside College Admission](https://jeffselingo.com/)”, specifically details how Northeastern University intentionally manipulated the rankings and successfully elevated their standing. Do not blindly trust internet comments. Think for yourself.",
                                              "author": "JJKKLL10243",
                                              "created": 1636851181,
                                              "upvotes": -1,
                                              "replies": {
                                                "hkiyxzt": {
                                                  "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkiyxzt/",
                                                  "text": "LMAO trying to increase yield =/= yield protection. also literally everyone knows abt the gaming the rankings thing so maybe don't be condescending about it",
                                                  "author": "taylorm898",
                                                  "created": 1636851620,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hkh4yhx": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkh4yhx/",
      "text": "Bruh, and my ED is Syracuse, more snow than anywhere else in America 😭",
      "author": "DizzyMint2",
      "created": 1636823305,
      "upvotes": 1,
      "replies": {}
    },
    "hkhamrm": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhamrm/",
      "text": "texas homie where u at",
      "author": "ThuggerIsMyMother",
      "created": 1636825688,
      "upvotes": 1,
      "replies": {}
    },
    "hkhk86m": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhk86m/",
      "text": "I didn’t apply to NEU because of the weather",
      "author": "Existing-Ad7318",
      "created": 1636829820,
      "upvotes": 1,
      "replies": {}
    },
    "hkhwewp": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkhwewp/",
      "text": "As long as you layer up, it’s not that bad",
      "author": "puffyarrow",
      "created": 1636834999,
      "upvotes": 1,
      "replies": {}
    },
    "hki19iz": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hki19iz/",
      "text": "my sister didn’t like the cold either, but northeastern was just fine with a good jacket",
      "author": "pulsar-beam",
      "created": 1636837088,
      "upvotes": 1,
      "replies": {}
    },
    "hki1gm0": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hki1gm0/",
      "text": "Dude I feel you on the cold. I get miserable when it’s cold outside. But the thing is that your dorm and the buildings are heated.",
      "author": "murpalim",
      "created": 1636837174,
      "upvotes": 1,
      "replies": {}
    },
    "hki44p6": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hki44p6/",
      "text": "If you don't think you'll be comfortable somewhere that cold, withdraw your application entirely. Note that Boston's temperature doesn't change if you apply RD instead of ED. \n\nYou'll also want to withdraw your applications to all schools in New England and the Midwest as all can get \"that cold\". Even North Carolina has average lows below freezing from Dec to Feb.\n\nBest to focus on California, Arizona, Texas, Georgia, and Florida.",
      "author": "guilt-of-admissions",
      "created": 1636838336,
      "upvotes": 1,
      "replies": {}
    },
    "hkjke8m": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkjke8m/",
      "text": "I live in the area so this is kind of weird to hear since I’ve always thought of Boston weather as just the norm not as particularly cold or anything. I hadn’t considered that people ever looked at our thermostats and were like nah not stepping foot in that place",
      "author": "night-moth",
      "created": 1636861512,
      "upvotes": 1,
      "replies": {}
    },
    "hkgvh8t": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgvh8t/",
      "text": "It doesn’t get that cold here. Especially in recent years average winter temperature is like 30 degrees F. You’d be fine in a hoodie and maybe a light down jacket",
      "author": "smuckerssssss",
      "created": 1636819197,
      "upvotes": 0,
      "replies": {}
    },
    "hkgvjf2": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hkgvjf2/",
      "text": "I've lived in the area for all my life. Cold really isn't bad, especially if you stay inside most of the time. It's refreshing, even.",
      "author": "r1ceIsLife",
      "created": 1636819224,
      "upvotes": 0,
      "replies": {}
    },
    "hki9j5y": {
      "link": "/r/ApplyingToCollege/comments/qt0d50/doubting_ed_app/hki9j5y/",
      "text": "i don't live in boston, but within its general vicinity. if, like me, you're always cold, a space heater is an EXTREMELY worthwhile investment & many of them are small enough to be completely unobtrusive in a dorm. also get one of those blankets w/ the hole in the top and wear that lol",
      "author": "taylorm898",
      "created": 1636840640,
      "upvotes": 0,
      "replies": {}
    }
  }
}