{
  "sid": "qp1k1h",
  "link": "/r/ApplyingToCollege/comments/qp1k1h/uiuc_selfreported_courses_by_semester/",
  "title:": "UIUC Self-reported Courses by Semester?",
  "text": "I'm really confused about how to fill out the Self-Reported Academic Record on the UIUC (myIllini) portal.\n\nSo from the UIUC FAQ:\n\n>\\> You must have your high school transcript with you when  self-reporting your courses and grades, entering all information exactly  as it appears on your document. **All semester, trimester, or quarter  grades must be listed. Don’t average grades.**\n\nThe portal says:\n\n>\\> If your transcript shows grades for 2 semesters, 3 trimesters, or 4  quarters for each class, **list each grade separately**; do not list a final grade.\n\nBut the problem is that I don't see a place to enter a Semester 1 and Semester 2 grade for each course -- I can only enter one. This is what I see: [https://i.imgur.com/JwLh3AS.png](https://i.imgur.com/JwLh3AS.png)\n\nI just don't know what to do, should I separate my courses out by semester?\n\n**EDIT: UIUC responded to my email saying that  if a high school issues grades per semester for a year long course, each semester should receive its own line. They’ll know that it was a year long course because we specify first or second semester.** Solved!!",
  "author": "messy_hacker",
  "created": 1636330446,
  "updated": 1636654135,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.76,
  "comments": {
    "hjr48s1": {
      "link": "/r/ApplyingToCollege/comments/qp1k1h/uiuc_selfreported_courses_by_semester/hjr48s1/",
      "text": "If, for a core course like Algebra II or US History, you get a grade at the end of the year, indicate the final grade. For semester courses such as, say, electives like Graphic Design, indicate it is a semester course and report the semester grades.",
      "author": "jasonghor",
      "created": 1636336371,
      "upvotes": 1,
      "replies": {
        "hjr4jpo": {
          "link": "/r/ApplyingToCollege/comments/qp1k1h/uiuc_selfreported_courses_by_semester/hjr4jpo/",
          "text": "Thank you! I’ll probably do this, but this conflicts with the instructions:\n\n>\tIf your transcript shows grades for 2 semesters, 3 trimesters, or 4 quarters for each class, list each grade separately; do not list a final grade.\n\nSo it reads that they don’t want a final grade if it’s a yearly course with 2 semester grades? But their instructions also doesn’t make sense because Algebra II for example, is one course rather than two.",
          "author": "messy_hacker",
          "created": 1636336516,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}