{
  "sid": "qyos0x",
  "link": "/r/ApplyingToCollege/comments/qyos0x/do_i_need_to_send_my_dual_enrollment_transcript/",
  "title:": "Do I need to send my dual enrollment transcript to regular decision if it comes out by Jan 10 (after deadline)?",
  "text": "Im currently taking Multivariable Calc and i don’t think I’ll be able to get an A (most likely end with a high B) because the class is really hard + hard to manage with school work.\n\nCollege apps are due by Jan 7 latest, so I won’t be able to put my grade on the common app. Do I need to send my college transcript though, to colleges like Ivies + Stanford + MIT? I have a 4.0 GPA UW right now, don’t want to mess that up.\n\nWill I need to report this B anywhere as well? Like, will colleges ask for it when trying to transfer credits? Do I need to even transfer credit for this course?\n\nThanks!",
  "author": "hiworld12333",
  "created": 1637475445,
  "updated": 1637688363,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlhc2i4": {
      "link": "/r/ApplyingToCollege/comments/qyos0x/do_i_need_to_send_my_dual_enrollment_transcript/hlhc2i4/",
      "text": "Don’t worry about this B. It won’t influence your admission.\n\nAlso- you would definitely want to transfer the credit because the grade doesn’t transfer with it/ just the credit. On your new college transcript it will show \nMultivariable Calculus  Transfer P\n\nThe P is for Pass.",
      "author": "policywoman501",
      "created": 1637476567,
      "upvotes": 2,
      "replies": {}
    },
    "hlhgu5w": {
      "link": "/r/ApplyingToCollege/comments/qyos0x/do_i_need_to_send_my_dual_enrollment_transcript/hlhgu5w/",
      "text": "Yes. You will need to send your college transcript that includes grades from fall semester (just like the mid-year report that is sent with high school grades). Colleges understand that these will come a bit later than the RD deadlines.",
      "author": "Octocorallia",
      "created": 1637480048,
      "upvotes": 1,
      "replies": {}
    },
    "hlisuqd": {
      "link": "/r/ApplyingToCollege/comments/qyos0x/do_i_need_to_send_my_dual_enrollment_transcript/hlisuqd/",
      "text": "I would not worry about a B in multivariable.\n\nYou will be required to have your high school send the mid-year report with your first semester grades, some time in January. I suspect the colleges would also want to see your dual enrollment transcript at that time.\n\nCredit is a separate question. Yes, you should try to get transfer credit at the college you decide to attend.",
      "author": "elkrange",
      "created": 1637510525,
      "upvotes": 1,
      "replies": {}
    }
  }
}