{
  "sid": "r4iz03",
  "link": "/r/ApplyingToCollege/comments/r4iz03/in_college_do_you_onlymostly_see_people_w_the/",
  "title:": "in college, do you only/mostly see people w the same major as you? or do you still see everyone",
  "text": "i feel like this is a stupid question but ex. if i attend the the uni’s business school, then will i only see other business students? or will i also be taking classes with engineering majors, stem majors, etc?",
  "author": "aj9944",
  "created": 1638146475,
  "updated": 1638204457,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hmh0kge": {
      "link": "/r/ApplyingToCollege/comments/r4iz03/in_college_do_you_onlymostly_see_people_w_the/hmh0kge/",
      "text": "it’s gonna depend on the school, but for lots of university 101 classes like introductory english classes or social sciences, ur most likely gonna be with people from across the university. if you’re taking major specific classes, you might find a smaller niche with the people who are studying similar subjects.",
      "author": "socallaghann",
      "created": 1638147423,
      "upvotes": 9,
      "replies": {}
    },
    "hmh16fm": {
      "link": "/r/ApplyingToCollege/comments/r4iz03/in_college_do_you_onlymostly_see_people_w_the/hmh16fm/",
      "text": "Probably depends a lot on the required courses and how the college structures them. E.g. a college like UChicago with a core curriculum, you’ll see people with all kinds of majors in those core classes. Same if a college has lots of required gen-eds that all majors need to take. Conversely, in a college like Brown with an open curriculum, you might meet people from lots of different majors because it’s easy to take a bunch of courses not related to your major. \n\nI’m not as sure what it looks like at colleges that divide into college of engineering, arts and sciences, etc. You’re probably more likely to see people within that college, but in arts and sciences, for example, there will still be a huge variety. No matter where you go, you’ll probably meet more people from similar majors in your 2nd-4th year when you start taking more major requirements. \n\nIf you want to meet people from different majors, an easy way to do it is to join non-professional student organizations. It’s a way to have fun, meet people with a variety of interests, and get to know upperclassmen.",
      "author": "rainingsiberiancats",
      "created": 1638147703,
      "upvotes": 5,
      "replies": {}
    },
    "hmhqnhv": {
      "link": "/r/ApplyingToCollege/comments/r4iz03/in_college_do_you_onlymostly_see_people_w_the/hmhqnhv/",
      "text": "Into math and science courses will see all engineering and science students. Advanced engineering courses will see those in your specific major (not many business majors taking Machine Design 2).\n\nIntro communications classes and General Education classes, likely required by all students, will see the entire spectrum.",
      "author": "RichInPitt",
      "created": 1638159421,
      "upvotes": 3,
      "replies": {}
    },
    "hmjovx3": {
      "link": "/r/ApplyingToCollege/comments/r4iz03/in_college_do_you_onlymostly_see_people_w_the/hmjovx3/",
      "text": "It depends very much on the school and how they set up their programs.\n\nOne of my kids is a business major and all of her major related classes and required gen eds (that she didn't AP out of) are at the business school.  Electives can be anything, she's taken a music class, foreign language and a writing class.  Those classes are filled by students from every program.\n\nHer sister is a life sciences major at another college, and it's quite different for her.  There is almost no division at all between the different programs and everyone is all mixed up together.",
      "author": "thursmalls",
      "created": 1638203443,
      "upvotes": 1,
      "replies": {}
    }
  }
}