{
  "sid": "qeav0g",
  "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/",
  "title:": "Is it a bad idea to write my college essay on the challenges I've faced due to my adhd?",
  "text": " I'm currently a senior in high school and I'm going through the college application process. I'm doing it all through Common App and I'm not sure which prompt to choose. I'm leaning towards the overcoming obstacles/challenges prompt because I wanted to write about my experience with ADHD. However, I've heard people say to avoid disclosing that information because some colleges are picky about who they accept and might not want students with ADHD as they are sometimes written off as lazy.  I don't want it to be a secret exactly but I'm not sure how to write about it. Can anybody help me? Thank you!!",
  "author": "sisterswagg",
  "created": 1635014816,
  "updated": 1635182961,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.9,
  "comments": {
    "hhrpzz9": {
      "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhrpzz9/",
      "text": "The issue isn't being written off as lazy. It's a more general risk that certain issues, even if handled well in high school, can become a significant problem in college. In short, it's leading with a weakness. It seems like the overcoming obstacles essay is hard to do well.\n\n*First* write your essay and *then* choose the prompt that most closely matches. There is also a catch-all prompt. Think of one or two personal qualities you would like to communicate to admissions and then think of a story or anecdote that shows those. See the essay wiki links in the other post. I like Hack the College Essay.",
      "author": "elkrange",
      "created": 1635015052,
      "upvotes": 7,
      "replies": {
        "hhrqee0": {
          "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhrqee0/",
          "text": "thank you!",
          "author": "sisterswagg",
          "created": 1635015223,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhs35a6": {
      "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhs35a6/",
      "text": ">Is it a bad idea to write my college essay on the challenges I've faced due to my adhd?\n\nI wouldn't.",
      "author": "jayphoward",
      "created": 1635020867,
      "upvotes": 2,
      "replies": {
        "hhs6jcb": {
          "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhs6jcb/",
          "text": "why not?",
          "author": "sisterswagg",
          "created": 1635022406,
          "upvotes": 1,
          "replies": {
            "hhsknnd": {
              "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhsknnd/",
              "text": "For one, it might sound like you're cagily trying to make an excuse for whatever your grades were.  If your grades were super-high, then that's obviously not an issue.\n\nAlso, it may raise concerns about whether your performance \\*at that college\\* is likely to be compromised by your ADHD.\n\nYou really don't want to the write the essay, \"I screwed up in X, Y and Z ways, but really it was just because of my ADHD.\"",
              "author": "jayphoward",
              "created": 1635028930,
              "upvotes": 2,
              "replies": {
                "hhtlpvg": {
                  "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhtlpvg/",
                  "text": "Well, I wasn't diagnosed and medicated until late freshman year. Before that, I got a couple C's on my report card but after being medicated/diagnosed my grades and GPA went up significantly. What if I approached the essay that way?",
                  "author": "sisterswagg",
                  "created": 1635046988,
                  "upvotes": 1,
                  "replies": {
                    "hhuyrs2": {
                      "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhuyrs2/",
                      "text": "I guess you need to ask yourself what story you're trying to tell about yourself, and whether it's the best one to tell.  Is the \"point\" of the ADHD essay to provide an explanation for your lower grades pre-diagnosis?  If you want to do that, then I might use the \"extenuating circumstances\" section (or whatever it's called).\n\nDo you feel like the fact that you have ADHD is the \\*most\\* important thing about you that you'd like an AO to know?  I get that it's had a significant effect on your life, but there are millions of other kids with diagnoses.  Seems like you'd want to tell a story in your essay that's somewhat more unique to \\*you\\*.  Where, after reading it, an AO might feel like they \"know you\" a little better.",
                      "author": "jayphoward",
                      "created": 1635082592,
                      "upvotes": 2,
                      "replies": {
                        "hhvn12f": {
                          "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhvn12f/",
                          "text": "Alright, thank you so much for your help!",
                          "author": "sisterswagg",
                          "created": 1635093539,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhs6i5n": {
      "link": "/r/ApplyingToCollege/comments/qeav0g/is_it_a_bad_idea_to_write_my_college_essay_on_the/hhs6i5n/",
      "text": "Don't. Too risky.",
      "author": "Remarkable-Cat-7864",
      "created": 1635022391,
      "upvotes": 1,
      "replies": {}
    }
  }
}