{
  "sid": "qzuzik",
  "link": "/r/ApplyingToCollege/comments/qzuzik/what_is_my_best_course_of_action_applying_to_a/",
  "title:": "What is my best course of action applying to a University as a military veteran with some college classes?",
  "text": "Hey all! I'm in the Navy and plan on getting out in 2023 in order to go to college full time using the GI Bill. I'm taking my first college class right now at ASU online, and I plan to be able to finish a few more classes before getting out of the Navy. \n\nI would like to go to college full time starting in Fall 2023, so that would mean I'm about a year out from applying to schools. The only problem is I would have to apply as a transfer student since I' would already have a few classes done, but all the schools I've looked at have certain requirements for applying as a transfer student, which involve having a lot more classes than I do, or will have by that point. \n\nI want to study Computer Engineering, and my major at ASU is Software Engineering since that was the closest thing they offered online. My dream school is Stanford, which is obviously a long shot, but a guy can dream. I'd be very happy getting into a UC (I'm from California) or the University of Texas. I also have a bunch of Spanish credits from DLI (Defense Language Institute) since I am a language analyst in the Navy, but most of those wouldn't really transfer to the major I want to pursue; only one class transferred to ASU.\n\nI learn a lot better in an actual classroom, so my question is would it be better to try to transfer from ASU online to the actual ASU campus (which seems to be a possibility from my understanding) and then transfer when I have the right credits? Or should I just find a community college and get the necessary credits that way? Also, are there other options for applying to these schools as a transfer student I'm not aware of? Thank you all in advance!",
  "author": "WestSideGoblin",
  "created": 1637612997,
  "updated": 1637687324,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlormqm": {
      "link": "/r/ApplyingToCollege/comments/qzuzik/what_is_my_best_course_of_action_applying_to_a/hlormqm/",
      "text": "You’ll be considered a non-traditional student at most schools (simply meaning you’re not fresh out of High School). Additionally, most (especially public universities) have a veterans affair department that will help you work through GI benefits and other things.",
      "author": "leadorlead",
      "created": 1637615900,
      "upvotes": 1,
      "replies": {}
    },
    "hlqtzwk": {
      "link": "/r/ApplyingToCollege/comments/qzuzik/what_is_my_best_course_of_action_applying_to_a/hlqtzwk/",
      "text": "definitely talk with their va if they have one",
      "author": "egg_mugg23",
      "created": 1637654081,
      "upvotes": 1,
      "replies": {}
    }
  }
}