{
  "sid": "ri4b9h",
  "link": "/r/ApplyingToCollege/comments/ri4b9h/whats_up_with_undergrad_engineering_college/",
  "title:": "What's up with undergrad engineering college rankings?",
  "text": "US News ranks Rose-Hulman in first for undergrad engineering with Harvey Mudd and Olin underneath it. \n\nNow, Harvey Mudd and Olin are both much more selective to get into:\n\n76.6% for Rose-Hulman (2020)\n\n18% for Harvey Mudd (2020)\n\n16.4% for Olin (2020)\n\nThe average starting salaries for these 3 schools also differ by quite a lot:\n\nAverage starting salary for Rose-Hulman graduates is $73,800.\n\nAverage starting salary for Harvey Mudd graduates is $97,700 \\*Most graduates stay in California where salaries are inflated anyway, but still\\*\n\nAverage starting salary for Olin College graduates is $87,361.\n\n&#x200B;\n\nSo why has Rose-Hulman been beating these two colleges for literal years now? What does RHIT do that others don't. I know that rankings don't matter in the long run (if at all), but I'm still wondering how Rose is beating out both of the aforementioned institutions.",
  "author": "olkemie",
  "created": 1639700617,
  "updated": 1639786027,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "houotau": {
      "link": "/r/ApplyingToCollege/comments/ri4b9h/whats_up_with_undergrad_engineering_college/houotau/",
      "text": "Each ranking specifies the criteria used for obtaining the results - there must be some other criteria were Rose-Hulman is gaining points over the other institutions.",
      "author": "prsehgal",
      "created": 1639700913,
      "upvotes": 7,
      "replies": {}
    },
    "hova2tx": {
      "link": "/r/ApplyingToCollege/comments/ri4b9h/whats_up_with_undergrad_engineering_college/hova2tx/",
      "text": "It's entirely peer review, so it just depends on what those reviewers think - no other criteria.\n\nThe vibes of the schools are pretty different - Rose Hulman is a small school, but much bigger than the other two. It also has more of a traditional engineering school feel in my opinion - more distinct majors, strong emphasis on practical experience, etc.  Their career placement stats are also exceptional. I think it has more in common with schools like WPI and Colorado school of mines than HMC or Olin.\n\nSalary data partly reflects selectivity, partly region where they are, but it also reflects field of study - RHIT proportionally has a lot more mechanical engineers and a lot fewer CS students than Harvey Mudd.\n\nWhen I considered them I preferred Harvey Mudd (Olin didn't exist at the time, which might put in context how long ago this was) - I really liked the LAC feel, and Claremont is definitely preferable to Terre Haute IMO.",
      "author": "BrawnyAcolyte",
      "created": 1639710464,
      "upvotes": 3,
      "replies": {}
    },
    "houpxrs": {
      "link": "/r/ApplyingToCollege/comments/ri4b9h/whats_up_with_undergrad_engineering_college/houpxrs/",
      "text": "You're probably looking at the colleges that don't have doctorate programs category",
      "author": "Sea_Individual1999",
      "created": 1639701427,
      "upvotes": 2,
      "replies": {
        "hourato": {
          "link": "/r/ApplyingToCollege/comments/ri4b9h/whats_up_with_undergrad_engineering_college/hourato/",
          "text": "Yes; Rose-Hulman, Harvey Mudd, and Olin all don't have any graduate programs.",
          "author": "olkemie",
          "created": 1639702044,
          "upvotes": 1,
          "replies": {
            "hourd39": {
              "link": "/r/ApplyingToCollege/comments/ri4b9h/whats_up_with_undergrad_engineering_college/hourd39/",
              "text": "Undergrad rankings are just peer assessment surveys",
              "author": "Sea_Individual1999",
              "created": 1639702072,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}