{
  "sid": "redp2d",
  "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/",
  "title:": "I did not write this but this but it's depressingly relatable (I really need help on the last part)",
  "text": "Confession #3105\n\nMan this is frustrating for me. I hear people applying to shit like Yale, MIT, Cornell, Harvard, etc. with these good ass fucking grades, extracurriculars, and just overall making themselves out to be fantastic. I overhear it all the time, people who honestly sound like they could get in. I just can't help but feel overwhelming regret, self-pity, hopelessness, and being left in a state where I'm completely Jaded to my situation. My GPA isn't all there, my extracurriculars aren't strong at all because I just couldn't handle it the first two years and the last two years were overshadowed by the pandemic, I'm barely scraping up recs, and I don't even have my personal essay completed. By no means do I put blame on these feelings on other people. Honestly I feel happiness for them hearing what sounds like confidence to me and I hold no ill will to people who are happy with the way things have gone in their four years of being here. Its a me problem at the end of the day. Deadlines are closing in like cold, clammy hands going for my neck. I can barely manage my classes now. It's so frustrating, because I don't know how to cope with this regret of just feeling like I was an awful and shitty student the entirety of my time at this school. Does anyone have any tips? Advice? Honestly if you're willing to even entertain this entry, I hope someone can give me tips for essay writing. The personal essay is absolutely murdering me.",
  "author": "GPA-Optional-Student",
  "created": 1639272081,
  "updated": 1639514869,
  "over_18": false,
  "upvotes": 25,
  "upvote_ratio": 0.93,
  "comments": {
    "ho7213x": {
      "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/ho7213x/",
      "text": "If you haven't already, apply to some schools that are essay-optional and give merit. It took a weight off my shoulders and gave me perspective that at least I'd have one or two fallbacks incase I didn't get into my top schools. For essay writing, you really just have to force yourself to start writing through sheer willpower. The tips on the sub's wiki are helpful, but honestly challenge yourself to start writing tonight. It doesn't have to be good, I wrote like 5 different ideas before I decided on my final one. It's just the starting something that's hard.",
      "author": "Boardstill",
      "created": 1639274595,
      "upvotes": 7,
      "replies": {
        "ho7gbq2": {
          "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/ho7gbq2/",
          "text": "Can an essay still be good even if it only takes hours over a few weeks? I hear all these people spending months on their's and it makes me feel unaccomplished.",
          "author": "GPA-Optional-Student",
          "created": 1639281730,
          "upvotes": 2,
          "replies": {
            "ho7n9kx": {
              "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/ho7n9kx/",
              "text": "It can definitely be good, it took me about 3 hours to write mine and I only had 1 teacher look it over and edit it. I was worried about not starting mine in August but it’s definitely possible to do it within a couple of weeks",
              "author": "aprilskies1979",
              "created": 1639285438,
              "upvotes": 2,
              "replies": {}
            },
            "ho8naxr": {
              "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/ho8naxr/",
              "text": "Don’t worry I haven’t started on my essay either lmaooooo.",
              "author": "Mr_Ducke",
              "created": 1639312644,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho7jjko": {
      "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/ho7jjko/",
      "text": "I'm in this post and I don't like it",
      "author": "fierrochasee",
      "created": 1639283423,
      "upvotes": 5,
      "replies": {}
    },
    "ho737x3": {
      "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/ho737x3/",
      "text": "hang in there bud, if you feel that all those deadlines are piling up, take a moment to calm yourself down and do nothing.\nwhen you're sure that you're doing fine, make a list of all the essays you need to write and give yourself ample to time to write good ones. \nI applied to Yale too, but you know why I'm unbothered now? Because I've accepted that i won't get in anyway and I'm happy that other deserving people get to attend it. Plus, if I don't get in then it wasn't meant to be. There's a better place for me and I'm an eternal optimist.\n\nPlease don't think them applying to Ivy Leagues mean that you can't. Heck, my profile is probably worse than you but the only reason I applied is because I loved Yale (from community to academics) and I won't have regrets in the future that at least I didn't try.\n\nYou may think that your application isn't strong enough, and maybe it isn't. But who cares? High School isn't the end. You can still get into state schools, some of which are lowkey amazing. There are SO MANY colleges, and you think you can't get into a decent one? Really?\n \nFor personal statement, I can only write one under one of the two conditions:\n1) I don't have any pending tasks left, life is great and I did all the work I planned to do.\n2) It's half an hour before the deadline and I'm racing the clock to write a 750 word essay.\n\nAnd you know when I write the best essays?\nIn the second case.\n\nHeck, I know first-hand how you feel when you've school work, essays to write and other commitments. My aim wasn't to tell you to write an essay half an hour before the deadline (please don't do that), it was to tell you to give YOURSELF a deadline. One fine day, when you're done with all your work, sit down and think what you're gonna write about, write the shittiest essay on the planet because it'll be your first draft and it will be shit, trust me. But at least now, you've written something. Next step would be refining, or if you want to start over, that's fine too.\n\nYou have to work with yourself, that's all I can say.",
      "author": "just-die-bitch",
      "created": 1639275174,
      "upvotes": 2,
      "replies": {}
    },
    "ho7pycg": {
      "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/ho7pycg/",
      "text": "TBH I feel like that sometimes too, but when you think about the college app process, not all schools are looking for the perfect person, and the people who are confident still have a possibility of not getting in, but sometimes the unexpected people have a chance at the good schools, just because the process is so lottery like. This regret feeling is normal at this stage and I would just say to focus on school work(that's how I am trying to cope). For personal essays, I would just recommend to discuss with your friends or parents about yourself so that you could get some inspiration, listening to the topics of others also might inspire you to get an idea. Best of luck!",
      "author": "Dry-Table-3874",
      "created": 1639286921,
      "upvotes": 2,
      "replies": {}
    },
    "ho7v204": {
      "link": "/r/ApplyingToCollege/comments/redp2d/i_did_not_write_this_but_this_but_its/ho7v204/",
      "text": "if you’re applying for gender studies, dont even bother putting your ec’s on your app",
      "author": "Friendly_Wave1227",
      "created": 1639289985,
      "upvotes": -2,
      "replies": {}
    }
  }
}