{
  "sid": "qmo7xt",
  "link": "/r/ApplyingToCollege/comments/qmo7xt/umd_sat_score_report_send/",
  "title:": "UMD SAT score report send",
  "text": "am i supposed to send ALL my sat scores to UMD? i know they superscore but i got higher scores on both sections on my 2nd SAT so i sent only that one. is that why my application is showing incomplete? or they just haven't matched my scores yet? ( i sent the score report on oct 21 and it says sent on 26 oct on my collegeboard acc)",
  "author": "Virtual_Cat_1013",
  "created": 1636042711,
  "updated": 1636136165,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjb86xb": {
      "link": "/r/ApplyingToCollege/comments/qmo7xt/umd_sat_score_report_send/hjb86xb/",
      "text": "No, UMD does not require all scores. You are fine.\n\nWhen College Board \"sends\" a score, it deposits the score report in the college's account. Then, colleges download score reports from their account in batches on some regular schedule. There may be additional processing steps that need to occur on the college's end before the portal shows that the score was received. I would wait a few more days, at the very least, before asking UMD why your portal hasn't updated.",
      "author": "elkrange",
      "created": 1636049210,
      "upvotes": 1,
      "replies": {
        "hjbb62j": {
          "link": "/r/ApplyingToCollege/comments/qmo7xt/umd_sat_score_report_send/hjbb62j/",
          "text": "thank you sm!! I was getting really worried about this",
          "author": "Virtual_Cat_1013",
          "created": 1636050390,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjcar3r": {
      "link": "/r/ApplyingToCollege/comments/qmo7xt/umd_sat_score_report_send/hjcar3r/",
      "text": "OKAY YOU ARE LITERALLY ME. I sent the score report on the 21st too and it says that it was sent on the 26th and I was freaking out. However I just checked my portal this morning and it says that they received my scores and that my application is complete, so don’t stress too much. They likely have already received them or will receive them very soon.",
      "author": "Tishidiv",
      "created": 1636064502,
      "upvotes": 1,
      "replies": {
        "hje136m": {
          "link": "/r/ApplyingToCollege/comments/qmo7xt/umd_sat_score_report_send/hje136m/",
          "text": "glad yours is complete it's definitely stressful !! hope my portal updates soon too.",
          "author": "Virtual_Cat_1013",
          "created": 1636097803,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjcg6nu": {
      "link": "/r/ApplyingToCollege/comments/qmo7xt/umd_sat_score_report_send/hjcg6nu/",
      "text": "Sending only one is fine. It may take a few takes to process and load the thousands of applications received over the last few days.",
      "author": "RichInPitt",
      "created": 1636066777,
      "upvotes": 1,
      "replies": {}
    }
  }
}