{
  "sid": "qpx9n4",
  "link": "/r/ApplyingToCollege/comments/qpx9n4/advice_for_outsider/",
  "title:": "Advice for Outsider",
  "text": "Hi everyone!\n\nSo I am living outside of the US, but I am a citizen (born in Texas). I'm just wondering if that means I can become \"in-state\" anywhere in America after living there a year, working, getting licence, voting...  would it be worth it? How much of a difference to college tuition does it make? \n\nAlso, does anyone has any advice for taking the SATs, or even advice about which universities/scholarships I should/should not apply for? Or when I am even meant to apply. Anything would be greatly appreciated!\n\n&#x200B;\n\nThank you :)\n\n&#x200B;\n\n(P.S- I have always dreamed of living in America, that's why I want to move there. I don't want to go to university in the country I'm living in already, although it is much cheaper here.)",
  "author": "cookie1952",
  "created": 1636437777,
  "updated": 1636653583,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjwmts6": {
      "link": "/r/ApplyingToCollege/comments/qpx9n4/advice_for_outsider/hjwmts6/",
      "text": "The difference between in-state and out of state tuition can be significant depending on the state, but isn't always the easiest route - check out the exact residency requirements for the state you're thinking of moving to, because unless you're an independent individual, your parents may also be required to move there for an year with you.",
      "author": "prsehgal",
      "created": 1636438266,
      "upvotes": 2,
      "replies": {}
    },
    "hjxd1w2": {
      "link": "/r/ApplyingToCollege/comments/qpx9n4/advice_for_outsider/hjxd1w2/",
      "text": "[deleted]",
      "author": null,
      "created": 1636459545,
      "upvotes": 1,
      "replies": {
        "hjz4omx": {
          "link": "/r/ApplyingToCollege/comments/qpx9n4/advice_for_outsider/hjz4omx/",
          "text": "Yeah, I know. That's why im wondering if it is worth it",
          "author": "cookie1952",
          "created": 1636487493,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}