{
  "sid": "qpbbd5",
  "link": "/r/ApplyingToCollege/comments/qpbbd5/regarding_the_tough_stages_in_my_life_and_the/",
  "title:": "Regarding the tough stages in my life and the personal profile...",
  "text": "- Should I talk about how I went through and recovered from an ed/bulimia that after maintaining a healthy nutrition I was able to help my dad heal from his diabetic issues that got rid of his high insulin?\n\nOr\n\n- Should I talk about my previous experience with an ed/bulimia and how I overcame it that I even started working for a mental health organization to help other's struggling through this?\n\n\nShould I just avoid talking about these past struggles all together? Because I did learn from them and they helped shape me into a better person",
  "author": "The_Earth_is_sexy",
  "created": 1636369484,
  "updated": 1636654014,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hjsr6z8": {
      "link": "/r/ApplyingToCollege/comments/qpbbd5/regarding_the_tough_stages_in_my_life_and_the/hjsr6z8/",
      "text": "Firstly, I’m so glad you got through it!! Unfortunately, many people write about eds, anxiety, depression etc (and that’s absolutely okay, they’re very valid struggles) but I’ve heard AOs tend to get a little bored of that genre of essays. If you think you definitely want to write about it, go for it, but if you’re in a situation where your essay is the make or break part of your application then I’d write about something else and maybe include this in a para",
      "author": "1800needhelpasap",
      "created": 1636376307,
      "upvotes": 1,
      "replies": {
        "hjsrkra": {
          "link": "/r/ApplyingToCollege/comments/qpbbd5/regarding_the_tough_stages_in_my_life_and_the/hjsrkra/",
          "text": "Should I talk about my journey of learning asl so I can communicate with an uncle of mine who had lost his hearing ability?",
          "author": "The_Earth_is_sexy",
          "created": 1636376528,
          "upvotes": 2,
          "replies": {
            "hjsudtf": {
              "link": "/r/ApplyingToCollege/comments/qpbbd5/regarding_the_tough_stages_in_my_life_and_the/hjsudtf/",
              "text": "Yeah you definitely could. If I may make a small suggestion - instead of focusing your essay on just one of these experiences, you can talk about how family is important to you or your strong sense of empathy, and then write about helping your dad and your uncle",
              "author": "1800needhelpasap",
              "created": 1636378071,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}