{
  "sid": "qj04u0",
  "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/",
  "title:": "Score Send TOEFL and Sat",
  "text": "I sent my toefl score report and sat score report to my ED/ EA colleges: Carnegie Mellon (ED), Umich(EA), GATech(EA), MIT (EA). Both of them will be received in 8-10 days. Is it ok if scores reach within a week after the deadline especially for schools like UMich. FYI I’m self reporting the sat for all the EA colleges except CMU it’s just the toefl report that I’m concerned about.",
  "author": "FitBarnacle1198",
  "created": 1635595536,
  "updated": 1635778707,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "himygan": {
      "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/himygan/",
      "text": "It really depends on the school - if they have a strict document deadline, then that could be a problem. If you can't find the deadline on their website, call up the admissions office right away.",
      "author": "prsehgal",
      "created": 1635598223,
      "upvotes": 2,
      "replies": {
        "himyk9r": {
          "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/himyk9r/",
          "text": "That’s the problem. The admissions office is closed on weekends",
          "author": "FitBarnacle1198",
          "created": 1635598284,
          "upvotes": 2,
          "replies": {
            "himytqa": {
              "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/himytqa/",
              "text": "You'll need to call them up on Monday then, but do check out their websites before that.",
              "author": "prsehgal",
              "created": 1635598429,
              "upvotes": 1,
              "replies": {
                "hin2luh": {
                  "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/hin2luh/",
                  "text": "Carnegie Mellon says that all the standardised requirements need to be completed before Nov 1. I gave the sat in March and I sent my score reports to them today.",
                  "author": "FitBarnacle1198",
                  "created": 1635600460,
                  "upvotes": 1,
                  "replies": {
                    "hin6fhk": {
                      "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/hin6fhk/",
                      "text": "You should've ordered it a long time back then.",
                      "author": "prsehgal",
                      "created": 1635602366,
                      "upvotes": 2,
                      "replies": {
                        "hinlvg1": {
                          "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/hinlvg1/",
                          "text": "I did not know that it took 10-12 days to reach the University. But I think it's ok now because Carnegie Mellon Says that the counselor can verify and mail the score reports so I've sent my counselor my SAT and TOEFL score report and asked her to send to the Office of Admissions email id.",
                          "author": "FitBarnacle1198",
                          "created": 1635609360,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "himymza": {
      "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/himymza/",
      "text": "Check each of your colleges' websites to see what score reporting methods they accept. Many colleges now accept scores self-reported in the app (or portal), for free, to be followed by an official report only if you later enroll – self-reporting is faster.\n\nOther colleges still require official score reports sent directly from the testing agency prior to admission. CMU requires an official report.\n\nIn the past, U Mich may be one of the few schools that was strict about the deadline. But, at least for SAT, U Mich accepts self-reported SAT scores this year. MIT and Ga Tech also accept self-reported SAT scores. Go ahead and self-report by the deadline.\n\nI see your addition at the end about TOEFL: GaTech doesn't require TOEFL. MIT accepts TOEFL self-reported. Most (like CMU) won't care that they are a few days late, though possibly U Mich could. U Mich does not seem to indicate whether they accept TOEFL self-reported - if they do, perhaps there is a place in the portal.",
      "author": "elkrange",
      "created": 1635598326,
      "upvotes": 1,
      "replies": {
        "hiqjmx7": {
          "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/hiqjmx7/",
          "text": "For CMU they give an option that I could ask my School counselor to verify and send the score reports to them to their email id so I did just that for the sat and toefl. For umich I think I’m gonna take my chance by self reporting toefl  since they don’t seem to indicate for the toefl.",
          "author": "FitBarnacle1198",
          "created": 1635662151,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hin8aqf": {
      "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/hin8aqf/",
      "text": "doesn't umich allow self reporting?",
      "author": "urlocalant",
      "created": 1635603255,
      "upvotes": 1,
      "replies": {
        "hin8cg1": {
          "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/hin8cg1/",
          "text": "Ik they allow for the sat but do they allow for the toefl though?",
          "author": "FitBarnacle1198",
          "created": 1635603278,
          "upvotes": 1,
          "replies": {
            "hin8f6v": {
              "link": "/r/ApplyingToCollege/comments/qj04u0/score_send_toefl_and_sat/hin8f6v/",
              "text": "couldn't find anything that says they don't",
              "author": "urlocalant",
              "created": 1635603314,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}