{
  "sid": "qlrvin",
  "link": "/r/ApplyingToCollege/comments/qlrvin/difference_between_core_curriculum_and/",
  "title:": "Difference between Core Curriculum and Distribution Requirements",
  "text": "Hi, I’m currently researching colleges and can’t seem to understand the difference between Core Curriculum and Distribution Requirements.\n\nFor example at WashU, the Distribution Requirements are 9 credits each of Sciences, Social Sciences, and Humanities. Isn’t t that the same thing as a Core Curriculum?",
  "author": "SyedAayed26",
  "created": 1635936756,
  "updated": 1636136441,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hj4uqkl": {
      "link": "/r/ApplyingToCollege/comments/qlrvin/difference_between_core_curriculum_and/hj4uqkl/",
      "text": "Depends on the schools, but generally speaking, the core curriculum usually dictates the exact courses that you are required to take, while the distribution requirements allow you to pick and choose courses that you like as long as they satisfy the subject area requirements.",
      "author": "prsehgal",
      "created": 1635938454,
      "upvotes": 9,
      "replies": {
        "hj4yiaw": {
          "link": "/r/ApplyingToCollege/comments/qlrvin/difference_between_core_curriculum_and/hj4yiaw/",
          "text": "To add a bit, think of comparing non-major requirements between schools as an x-y scatter plot where you’re measuring two types of burden. \n\nThe more course requirements, the greater the y. That’s burden #1. \n\nThe fewer options you have to fulfill those requirements, the greater the x. That’s burden #2. \n\nIn some schools a history major may be able to fill a science requirement by taking a history of science class or a class on Darwin. Or a social sciences or philosophy major may find a class on medical ethics, policies around IT and innovation, etc. At other schools, your science distribution may only get filled by “dumbed down” versions of Gen Chem or bio courses that pre-meds, engineers and STEM students take. \n\nPay attention to choice and how much of your course load must be set aside to fulfill those requirements rather than what they are called (core, distribution, etc).\n\nMost of the schools people describe as “core” have more defined literature or history sequences and things like that.",
          "author": "ChampionshipPerfect5",
          "created": 1635940790,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}