{
  "sid": "rfwpen",
  "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/",
  "title:": "waitlisted from safety schools ???",
  "text": "hi, so I have been waitlisted to 2 of my safeties (Minnesota and Iowa (nursing)), although I have a 4.7 gpa weighted, have taken 4 APs and 11 honors, 1400 SAT. do you think I should be worried? I have 6 more colleges to hear back from: 1 being safety, 2 being target, and 3 being hard targets (all nursing BSN). let me knowww I'm stressing.",
  "author": "katieiscooll",
  "created": 1639448476,
  "updated": 1639513754,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hogv2kb": {
      "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hogv2kb/",
      "text": "Those are both direct entry BSN programs right? That would make them a lot more selective than the university as a whole.\n\nYou might want to consider some options that use traditional/standard nursing admissions. Obviously getting entry direct from high school is preferable, but you want to have some options you are ok with if that doesn't happen.",
      "author": "BrawnyAcolyte",
      "created": 1639453469,
      "upvotes": 8,
      "replies": {
        "hogwgql": {
          "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hogwgql/",
          "text": "yes they both were, pretty sure most are direct entry BSN, but I guess I will need to think about some standard admission programs, thanks for the advice.",
          "author": "katieiscooll",
          "created": 1639454129,
          "upvotes": 2,
          "replies": {
            "hogy8h3": {
              "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hogy8h3/",
              "text": "Good luck! \n\nYour stats are great and hopefully you get into some of the options you are applying to, but direct entry programs usually have a fixed number of spots because of how the state is involved in nursing licensure, which makes it really hard to have safe options.",
              "author": "BrawnyAcolyte",
              "created": 1639454975,
              "upvotes": 3,
              "replies": {
                "hoh1waq": {
                  "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hoh1waq/",
                  "text": "do you recommend any schools that would have good standard admit programs? or any direct entry that could be safety? thanks!",
                  "author": "katieiscooll",
                  "created": 1639456794,
                  "upvotes": 1,
                  "replies": {
                    "hoh3w12": {
                      "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hoh3w12/",
                      "text": "I would look at the NCLEX pass rates for your state (if you just google that it should come up -- pretty much every state board of nursing will publish them).  That should list all the BSN programs in your state and give you an idea of how successful their grads are at passing the RN exams.  \n\nWinona State would be a big option to look at in Minnesota for example that I think has guaranteed direct admission with your SAT -- they require you to maintain a very high GPA to stay guaranteed for the upper level nursing classes which is why they can offer that kind of assured admission option.",
                      "author": "BrawnyAcolyte",
                      "created": 1639457851,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoh4gwy": {
      "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hoh4gwy/",
      "text": "Direct entry BSN programs can be dramatically different because they are restricted by the number of clinical spots they can offer students. For example, the nursing admit rate at U San Francisco is less than 15% for a school with a general admit rate north of 50%. If it’s direct entry, it’s generally one of if not the most competitive program on campus. \n\nASU has very clear guidelines for direct entry admit. Are you open to all sorts of schools? Any geographic restrictions?",
      "author": "the-wild-rumpus-star",
      "created": 1639458170,
      "upvotes": 6,
      "replies": {
        "hoh6dg7": {
          "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hoh6dg7/",
          "text": "Pretty much open to all sorts of schools, although I'm not a big fan of the big southern schools, but my options are open",
          "author": "katieiscooll",
          "created": 1639459259,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hogule3": {
      "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hogule3/",
      "text": "Could it be your personal statement/essay(s)? They might not have thought you were a good fit or got the idea that you weren’t passionate about their school",
      "author": "sneevies",
      "created": 1639453241,
      "upvotes": 7,
      "replies": {}
    },
    "hoil3z7": {
      "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hoil3z7/",
      "text": "Nursing is a really impacted major that’s much harder to get into at nearly every school than something like sociology or education. You may still get in off the waitlist later (my daughter with similar grades/scores but more AP credits got into NYU and UVA in May/June) but if you don’t look into doing nursing prerequisites in CC and transferring into a nursing program. And/or completing an alternate BA/BS and doing a post baccalaureate nursing degree. In several states we looked at that made the most sense.",
      "author": "RetiringTigerMom",
      "created": 1639493365,
      "upvotes": 3,
      "replies": {
        "hoj98s3": {
          "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hoj98s3/",
          "text": "thanks for the advice! I'm applying to UVA as well.",
          "author": "katieiscooll",
          "created": 1639503047,
          "upvotes": 1,
          "replies": {
            "hok0h2l": {
              "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hok0h2l/",
              "text": "It’s pretty expensive out of state if you don’t qualify for financial aid, but it’s a very good program.",
              "author": "RetiringTigerMom",
              "created": 1639513690,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hogurtr": {
      "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hogurtr/",
      "text": "you probably got waitlisted bc ur too good. a lot of schools will reject /waitlist ppl that they know can get into a better school. if they know theyre ur safety they know u probably wont go there so accepting u would lower their yield. i forgot the words but there’s a term for it.",
      "author": "mercymainaf",
      "created": 1639453325,
      "upvotes": 0,
      "replies": {
        "hogx8d0": {
          "link": "/r/ApplyingToCollege/comments/rfwpen/waitlisted_from_safety_schools/hogx8d0/",
          "text": "yield protected",
          "author": "jojothebigcat",
          "created": 1639454491,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}