{
  "sid": "qelv2l",
  "link": "/r/ApplyingToCollege/comments/qelv2l/commonapp_additional_info_section/",
  "title:": "CommonApp Additional Info Section",
  "text": "So there’s two sections and I’m a bit confused about the difference between the two!\n\nThe first one states “Please use this space to describe how COVID-19/natural disasters has affected you”\n\nThen there’s the second section: “Provide any additional information you wish to share”\n\nAren’t these both the same thing? The entire additional info section asks the applicant to explain family circumstances, etc so I’m confused as to why there’s two sections seemingly asking the same question?",
  "author": "Oliver_Anchovies",
  "created": 1635053837,
  "updated": 1635182907,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhtxyew": {
      "link": "/r/ApplyingToCollege/comments/qelv2l/commonapp_additional_info_section/hhtxyew/",
      "text": "How are they the same? The first asks you specifically about COVID related issues and the second asks you about any kind of additional information that is relevant to your application.",
      "author": "prsehgal",
      "created": 1635054714,
      "upvotes": 2,
      "replies": {}
    },
    "hhu26nj": {
      "link": "/r/ApplyingToCollege/comments/qelv2l/commonapp_additional_info_section/hhu26nj/",
      "text": "If you were hit by a car Freshman year, missed three months of school, and your grades suffered, how would that fit the COVID/Natural Disaster question?",
      "author": "RichInPitt",
      "created": 1635057937,
      "upvotes": 2,
      "replies": {}
    },
    "hhtxxqr": {
      "link": "/r/ApplyingToCollege/comments/qelv2l/commonapp_additional_info_section/hhtxxqr/",
      "text": "the additional information section has been there from before the pandemic started for people to explain their circumstances related to mental health etc. or even talk about their other ECs.",
      "author": "anuxietys",
      "created": 1635054701,
      "upvotes": 1,
      "replies": {
        "hhty026": {
          "link": "/r/ApplyingToCollege/comments/qelv2l/commonapp_additional_info_section/hhty026/",
          "text": "So what’s the difference between the two sections given to write?",
          "author": "Oliver_Anchovies",
          "created": 1635054748,
          "upvotes": 1,
          "replies": {
            "hhtz42h": {
              "link": "/r/ApplyingToCollege/comments/qelv2l/commonapp_additional_info_section/hhtz42h/",
              "text": "You can write about anything in the additional information section, doesn't even have to be related to a tragedy. If you have more ECs you couldn't fit in the ten slots, you could talk about that. If you've dealt with financial or mental health problems which affected your grades / ECs, you could include that. You could also talk about anything you would want the AO to know about you which isn't reflected in your application",
              "author": "anuxietys",
              "created": 1635055582,
              "upvotes": 2,
              "replies": {}
            },
            "hhtz8tf": {
              "link": "/r/ApplyingToCollege/comments/qelv2l/commonapp_additional_info_section/hhtz8tf/",
              "text": "In the COVID section, you can mention if you had to face any financial problems caused just due to the pandemic, considering many people lost their jobs. You could also talk about if you had to deal with loss during the time or if you personally had covid and how that affected your application (if applicable). You could also talk about the mental pressure etc",
              "author": "anuxietys",
              "created": 1635055682,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}