{
  "sid": "q8ftln",
  "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/",
  "title:": "To those thinking about going out of state...",
  "text": "It is another season of college application. A lot of people will pick schools that are not in their home state. Going out of state is fun and will be a very good experience for you. You will be training to be independent. It will also be an opportunity to get out of your home town and live in a whole new place. The door to many high profile schools will also be opened for you. However, before applying out of state schools, there are a few very important things that you will need to consider.\n\n1. Price  \nThe tuition costs for out-of-staters are usually higher than for in-staters (this applies mostly to public schools). Not only that, you will also lose your access to the vast benefits offered when you go to in-state schools. For example, the financial aids from your home state. It can really make a HUGE difference. Let me take the UCs as an example. The tuition cost for California residents is \\~$30k a year while it costs \\~$60k/yr for an out-of-stater. Additionally, out-of-staters would not be able to receive the Cal Grant. Alongside with the infamous unfriendliness of the UCs towards out-of-staters, it would be a huge financial burden.\n2. Health Insurance  \nMany insurances cannot be used if you're not in your home state. Let's say you are taking particular meds regularly and need your insurance company to cover it. You'll lose this benefits when you leave your state. It'll be extra annoying if you receive Medicaid because you will have to cancel the Medicaid in your home state and apply for it again in your college state. When you come back home, you will need to do the whole process all over again.\n3. Family  \nYou will be leaving your parents. It may not seem much when you're applying. But when it is the time to move in, saying goodbye to your parents at the gate of the airport will always be hard. Trust me. \n\nI, unfortunately, have made the mistake of not considering the above factors when I was doing my college application. I would not say that I am not having a good time at my school. But these above factors are still gonna be a burden. Don't blindly chase for rankings. Think twice before you put a certain school on your list.\n\nEdit: mistake.",
  "author": "JanKwong705",
  "created": 1634269118,
  "updated": 1634331396,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.89,
  "comments": {
    "hgp4l98": {
      "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgp4l98/",
      "text": ">The tuition costs for out-of-staters are usually higher than for in-staters, regardless if it is a private or public school.\n\nNo, private schools *do not* charge different tuition based on state of residence.\n\nIt is true that public universities tend to offer little to no need-based financial aid to out-of-state students and charge them more.\n\nRun the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a *need-based* financial aid estimate before you apply.\n\nAlso note that some public universities, typically somewhat less selective ones, offer large merit scholarships to out-of-state students. Those offering large automatic merit may have a chart or scholarship calculator on their scholarship webpages with the levels of stats and scholarship amounts. Example: [https://scholarships.ua.edu/freshman/out-of-state/](https://scholarships.ua.edu/freshman/out-of-state/); see also UAH, U Maine, U Kentucky, U Mississippi, U Arizona, Arizona State, Wyoming, UTD, etc. Compare the scholarship amount to the out-of-state cost of attendance to see whether the scholarship would make the college affordable for your family.",
      "author": "elkrange",
      "created": 1634269400,
      "upvotes": 21,
      "replies": {
        "hgp4qi9": {
          "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgp4qi9/",
          "text": "Whoops.",
          "author": "JanKwong705",
          "created": 1634269480,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgp5mgc": {
      "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgp5mgc/",
      "text": "Going oos isn't worth it unless it is a private school. There is no public school in the country worth sticker price.",
      "author": "DasaniSubmarine",
      "created": 1634269951,
      "upvotes": 5,
      "replies": {
        "hgp70mq": {
          "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgp70mq/",
          "text": "UCLA, Berkeley, umich, UNC, UVA…",
          "author": "Dizzy_Pressure7337",
          "created": 1634270707,
          "upvotes": 6,
          "replies": {
            "hgpb5cm": {
              "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgpb5cm/",
              "text": "berkeley is absolutely not worth oos price. It is not worth more than ivy tuition i am telling you. save it for grad school, unless you get into eecs. I really dont understand why oos kids go to places like uCR lmao",
              "author": "Euphoric_Shoulder_29",
              "created": 1634272994,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "hgqg5zb": {
          "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgqg5zb/",
          "text": "Going oos isn’t worth it unless you receive merit-based scholarship. \n\nI’m attending a public university out of state because of the opportunities it’s providing me and it came out less expensive than my in-state flagship.",
          "author": "leadorlead",
          "created": 1634303302,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgp4mfj": {
      "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgp4mfj/",
      "text": "Also factor in where you want to get a job/live when you graduate. Was from California and went back East for college, but always knew I wanted to live in California after I graduated. My college alumni network is very strong in the east coast, but not so much in California.",
      "author": "Octocorallia",
      "created": 1634269418,
      "upvotes": 2,
      "replies": {
        "hgp4spt": {
          "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgp4spt/",
          "text": "Yep also there’s that. I’m from the East and now I’m in the west 😬",
          "author": "JanKwong705",
          "created": 1634269513,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgprs02": {
      "link": "/r/ApplyingToCollege/comments/q8ftln/to_those_thinking_about_going_out_of_state/hgprs02/",
      "text": "Me reading this post as an international -_-",
      "author": "imnotokaylol_",
      "created": 1634285616,
      "upvotes": 0,
      "replies": {}
    }
  }
}