{
  "sid": "qyb1lr",
  "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/",
  "title:": "AMA cornell senior pre-med (admitted ED)!",
  "text": "with ED decisions coming up and RD applications due soon, i thought that i do an AMA to anyone interested in Cornell and/or pre-med! i relied on A2C as i anxiously waited for ED decisions, so happy to be back to help anyone out there :)",
  "author": "olivegarden543",
  "created": 1637431338,
  "updated": 1639813313,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.82,
  "comments": {
    "hlevl5r": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlevl5r/",
      "text": "1-How rigorous is Cornell and are there enough opportunities for premeds?\n\n2-Do you think it will be comparatively easier being accepted in med school from Cornell rather than a lower ranking school?\n\n3-How is the culture there? Do you think it is more cutthroat and toxic or collaborative?",
      "author": "SyedAayed26",
      "created": 1637432766,
      "upvotes": 8,
      "replies": {
        "hlfl4mh": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlfl4mh/",
          "text": "1 - cornell is PRETTY rigorous i would say, as the average grade for intro science classes tend to be B/B- or somewhere in between. with that said, you can definitely do well if you use your resources and work hard, and as you get used to the challenging courseloads. clinical opportunities around campus are really hit or miss: there aren't too many volunteer/clinical job positions available in the local area (downside of going to a school in a rural region) so you have to be really proactive to snag them. otherwise you can do your clinical hours at home/other places during breaks. however, i'd say that the research opportunities are fantastic here (important if you want to go to top20/research medical schools) - you can do research in so, so many fields, from chemical engineering to public health to molecular nutrition, to name a few. \n\n2 - i can't say b/c im not applying until next year, but i've heard from others that med schools do take cornell's rigor into account when you apply. this is corroborated by the fact that cornell's average accepted applicant GPA is around 3.65, while the average accepted GPA nationally is around 3.7. on the flip side, b/c a lot of students at cornell represent some of the best students in the nation, the competitive nature of our student body also makes it difficult to stand out. so it's really what you decide is important for you. \n\n3 - i actually (for the MOST PART, there are annoying pre-meds here, don't get me wrong) found my pre-med experience significantly better b/c of the friends i met in some of the intro courses. my fellow pre-med friends have never hesitated to help me out, and i always do my best to pass resources or help my friends if they're having trouble with a concept or something, so the community i found was probably the best part of being a pre-med here.",
          "author": "olivegarden543",
          "created": 1637444029,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hlff72c": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlff72c/",
      "text": "Google tells me that 63% of Cornell applicants to medical schools get accepted while at most peer institutions (other ivies and top LACs) that number is more like 80% or 90%.\n\nThis has made me think that Cornell isn't great for pre-med, if I'm honest. Am I mistaken? Why is it like that?",
      "author": "i_stan_t_cells",
      "created": 1637441355,
      "upvotes": 6,
      "replies": {
        "hlk4dxa": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlk4dxa/",
          "text": "statistically, yes, cornell has a lower acceptance rate to college than other top universities. but that statistic doesn't predict whether YOU will get into medical school. your chances of going to medical school is partially under your control (your grades, MCAT, ECs, letter of recommendation, etc), which is not completely dictated by the institution you attend.\n\nkeep that in mind, because when you choose a college to go to, focus on not whether it has a \"good\" medical school acceptance rate, but whether you truly feel as if you'll be happy there. you're spending 4 years at a single place, so you want to make sure that school provides the kind of environment, resources, and community you want. first and foremost, the most important lesson i learned while going through almost 4 years of college with a rigorous courseload/schedule is that at the end of the day, what i choose to do with my life now and in the future doesn't matter unless i truly feel happy with it.",
          "author": "olivegarden543",
          "created": 1637529585,
          "upvotes": 3,
          "replies": {}
        },
        "hlgj2s4": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlgj2s4/",
          "text": ">Google tells me that 63% of Cornell applicants to medical schools get accepted\n\nAccording to Cornell [Health Careers Evaluation Committee](https://scl.cornell.edu/sites/scl/files/documents/2020-21%20First-Year%20Pre-Med%20Guide-VD.pdf) (HCEC), each year around 400 (464 in the last cycle) undergraduates and alumni from Cornell apply and the acceptance rate is about 25-30% higher than the national average, which is around 40%. You can find all the facts from [2021 FACTS: Applicants and Matriculants Data](https://www.aamc.org/data-reports/students-residents/interactive-data/2021-facts-applicants-and-matriculants-data).",
          "author": "JJKKLL10243",
          "created": 1637459891,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hleszqu": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hleszqu/",
      "text": "hi! what do you think got you into Cornell?\n(btw it’s my dream school, I applied ED this year! manifesting this energy lmao<3)",
      "author": "joydivisible",
      "created": 1637431681,
      "upvotes": 3,
      "replies": {
        "hlewzsn": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlewzsn/",
          "text": "this is a difficult question haha, but i think my common app essay/supplement illustrated my intellectual curiosity and i had a ton of leadership experience throughout high school, alongside solid test scores/grades. to be honest, i'm not really sure what made me stand out amongst my peers as i went to a pretty competitive high school. applying ED also probably helped!",
          "author": "olivegarden543",
          "created": 1637433361,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hlfedap": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlfedap/",
      "text": "What topics did you write about for your supplements? Especially, the \"why\" essay.\n\nAlso, which ECs/Awards made you stand out?",
      "author": "No_External_1764",
      "created": 1637440982,
      "upvotes": 1,
      "replies": {
        "hlk5ctz": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlk5ctz/",
          "text": "i actually first applied to A&S and switched to CALS later. for my supplement to A&S, i wrote about how the mission of cornell/A&S connected to my lifelong pursuit of curiosity and desire to understand the world around me. \n\ni didn't win many major awards, but i think my ECs really sold who i was as a person and what i loved doing, which were serving the local community and leading others. i was the president of a major service organization on campus (\\~300-400 active members) during my senior year and held a top leadership position for a regional division for the same service organization in northern california (represented 63 high school chapters). \n\ni also had  A LOT of community service, as i volunteered at a local science museum for 3 years, volunteered with the service organization i was president of my senior year for 4 years, and volunteered as a youth book club leader for 4 years. \n\ni also did some other things like science olympiad (won some regional awards here and there) and worked a part-time job at at tutoring center, but those didn't matter as much to me as the other things i listed above.",
          "author": "olivegarden543",
          "created": 1637529988,
          "upvotes": 2,
          "replies": {
            "hllco9f": {
              "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hllco9f/",
              "text": "Wow, that's impressive. Thank you for sharing!",
              "author": "No_External_1764",
              "created": 1637549584,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlevzwe": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlevzwe/",
      "text": "Why did you choose Cornell? Was there a specific premed reason?",
      "author": "Comprehensive-Ad-612",
      "created": 1637432937,
      "upvotes": 1,
      "replies": {
        "hlfvv2q": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlfvv2q/",
          "text": "i'm from california, so i really wanted to get out of the \"bubble\" of my neighborhood and looked for schools on the east coast. i really liked how cornell is one of the best schools for the widest variety of fields (especially ones that are very unique) out there; the fact that cornell had some of the best programs for architecture, engineering, hotel administration, AND agricultural sciences, to name a few, really proved that they pride themselves in providing the best education for virtually any field a student wanted to study. since i did not know if i was going to commit to medicine yet as a high school student, knowing that cornell is one of the top for a lot of fields out there was very appealing to me.\n\ni also heard that cornell was a popular and \"good\" (this is subjective though) school for pre-med and the life sciences in general, so i knew that i would be getting a good education for what i was interested in doing for the time-being.\n\nALSO cornell's campus is SO DAMN BEAUTIFUL. although i never visited before commiting ED, the pictures/videos i saw of the campus before visiting are pretty accurate to seeing the campus in person, as even today i'm in awe of the gorgeous campus :)\n\nin retrospect, cornell is probably not the best choice for pre-med, but for what i was looking for in a school, it was still a very good choice. i'm glad i chose to go here :)",
          "author": "olivegarden543",
          "created": 1637448924,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlex29b": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlex29b/",
      "text": "RemindMe!",
      "author": "BumblebeeOdd2924",
      "created": 1637433388,
      "upvotes": 1,
      "replies": {
        "hlex5cg": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlex5cg/",
          "text": "**Defaulted to one day.**\n\nI will be messaging you on [**2021-11-21 18:36:28 UTC**](http://www.wolframalpha.com/input/?i=2021-11-21%2018:36:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlex29b/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fqyb1lr%2Fama_cornell_senior_premed_admitted_ed%2Fhlex29b%2F%5D%0A%0ARemindMe%21%202021-11-21%2018%3A36%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20qyb1lr)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "author": "RemindMeBot",
          "created": 1637433424,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlfh6o4": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlfh6o4/",
      "text": "What are the most unique aspects of Cornell?  What makes it stand out from other elite schools in terms of undergrad experience?",
      "author": "Repulsive-Nerve-5558",
      "created": 1637442243,
      "upvotes": 1,
      "replies": {
        "hllno3h": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hllno3h/",
          "text": "like i mentioned earlier, cornell is not only a very reputable school, but it also offers such a large variety of majors/minors you could study! i don't think there's any other school that has a top programs for hotel administration, engineering, architecture, agricultural sciences, AND many other fields out there! i think that really goes to show how cornell prides itself in providing a top notch education in whatever field students want to study. ALSO cornell makes its OWN ICE CREAM LOL! it's not my absolute favorite but still pretty cool to be going to a school with its own ice cream brand :) \n\nin terms of undergrad experience, i think the \"rural\" local area of cornell makes it super unique - as a result, we really get a \"collegetown\" feel as students here b/c cornell makes up a large portion of the ithaca (the local town cornell is located in) community. \n\nalso we have classes that most other schools probably don't have - like a wines tasting class (you literally drink wine during the class lmao), ice cream making class, beers tasting class, ciders tasting class, scuba diving class, skiing class, etc., so i would say that cornell really can put itself in its own category sometimes!",
          "author": "olivegarden543",
          "created": 1637555034,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlj1p8g": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlj1p8g/",
      "text": "did they request your first quarter grades? also what school at cornell?",
      "author": "carrot207",
      "created": 1637514164,
      "upvotes": 1,
      "replies": {
        "hlln043": {
          "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hlln043/",
          "text": "loll its been so long since applying, so i can't quite remember. i don't remember sending them, so i want to say no, but to be safe, you wanna do your best regardless if they ask or not. i applied to Arts and Sciences, but later switched to CALS b/c of my major interests!",
          "author": "olivegarden543",
          "created": 1637554693,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmhr3ll": {
      "link": "/r/ApplyingToCollege/comments/qyb1lr/ama_cornell_senior_premed_admitted_ed/hmhr3ll/",
      "text": "can you chanceme ?",
      "author": "Round_Cauliflower_12",
      "created": 1638159648,
      "upvotes": 1,
      "replies": {}
    }
  }
}