{
  "sid": "q4sra6",
  "link": "/r/ApplyingToCollege/comments/q4sra6/my_guidance_counselor_maybe_messed_everything_up/",
  "title:": "My guidance counselor (maybe) messed everything up?",
  "text": "I go to a public school in the Milwaukee area, and the way we ask for Letters of Recommendation is that you have to submit a form at the end of the year and then the teacher writes it over the summer. I was meeting with my guidance counselor last May to get that taken care of. Now, my dream school is Cornell. Huge long shot, don't get me wrong (\\~1490), but I've wanted to go there as long as I can remember.\n\nMore backstory: I took AP Bio sophomore year and did really well and really loved the teacher I had. I also know that many of the colleges to which I am applying only want recs from teachers who had you junior year. So I was explaining this to my counselor (how I am going to ask my junior year History and Math teachers), and she saw on [commonapp.org](https://commonapp.org) that Cornell allows a third rec letter to be submitted, and suggested I talk to my bio teacher and ask her for one in addition to the other two. Works for me!\n\nNow, of course, months later, I start looking into it and realize that nope, colleges really only want two! In fact, at least on some independent websites I found, they look poorly on three! I don't know how my counselor didn't know that!\n\nMy question, for anyone who made it through all of that, is am I totally screwed? It's pretty much too late to ask my Bio teacher not to send it. The rec letter won't be bad... but how badly will it mess up my application? Did I just ruin my chances?",
  "author": "throwaway93827182",
  "created": 1633809486,
  "updated": 1634074153,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hg0rjsf": {
      "link": "/r/ApplyingToCollege/comments/q4sra6/my_guidance_counselor_maybe_messed_everything_up/hg0rjsf/",
      "text": "It’s okay lol 3 LORs won’t annoy the admissions office",
      "author": "chumer_ranion",
      "created": 1633810690,
      "upvotes": 7,
      "replies": {}
    },
    "hg0st7q": {
      "link": "/r/ApplyingToCollege/comments/q4sra6/my_guidance_counselor_maybe_messed_everything_up/hg0st7q/",
      "text": "You’re counselor didn’t do anything wrong. Your just overthinking it lmfao.",
      "author": "lostintheabyss_",
      "created": 1633811241,
      "upvotes": 6,
      "replies": {}
    },
    "hg0s34k": {
      "link": "/r/ApplyingToCollege/comments/q4sra6/my_guidance_counselor_maybe_messed_everything_up/hg0s34k/",
      "text": "No one will reject you because you got 3 LORs",
      "author": "TwoSuns168",
      "created": 1633810923,
      "upvotes": 6,
      "replies": {}
    },
    "hg0rwex": {
      "link": "/r/ApplyingToCollege/comments/q4sra6/my_guidance_counselor_maybe_messed_everything_up/hg0rwex/",
      "text": "You are overthinking that. You will be TOTALLY fine",
      "author": "Zestyclose-Suit-5307",
      "created": 1633810843,
      "upvotes": 4,
      "replies": {}
    },
    "hg0sp48": {
      "link": "/r/ApplyingToCollege/comments/q4sra6/my_guidance_counselor_maybe_messed_everything_up/hg0sp48/",
      "text": "If Cornell offers the option to submit a third recommendation letter, they anticipate that some students will send one, and in fact would probably appreciate a third letter being sent if the letter gives a new perspective to the student that the first two didn't.",
      "author": "Stq1616",
      "created": 1633811192,
      "upvotes": 3,
      "replies": {}
    },
    "hg11nqu": {
      "link": "/r/ApplyingToCollege/comments/q4sra6/my_guidance_counselor_maybe_messed_everything_up/hg11nqu/",
      "text": "The Common App lists how many applications a school requires and how many are optional. This is different by school.\n\nCornell requires two teacher recommendations and accepts an additional one as optional, for a total of three. You’re fine.\n\nWhat would annoy a Cornell AO is someone thinking three isn’t enough and sending a fouth Teacher recommendation as an Other recommendation, which is specifically for non-teachers.   \n\n\nThree would be annoying only for a school that specifically requires/recommends a combined 0, 1, or 2.",
      "author": "RichInPitt",
      "created": 1633815090,
      "upvotes": 2,
      "replies": {}
    },
    "hg1iwou": {
      "link": "/r/ApplyingToCollege/comments/q4sra6/my_guidance_counselor_maybe_messed_everything_up/hg1iwou/",
      "text": "You are fine. Breathe.",
      "author": "jjhoster",
      "created": 1633823286,
      "upvotes": 2,
      "replies": {}
    }
  }
}