{
  "sid": "q8wgpo",
  "link": "/r/ApplyingToCollege/comments/q8wgpo/applying_to_kennesaw_state_after_i_attended_8/",
  "title:": "Applying to Kennesaw State after I attended ~8 years ago?",
  "text": "Before I dive into my actual questions I'm going to try to give a little bit of context on my situation. I graduated high school in 2014 and attended Southern Polytechnic State University while it was being absorbed into Kennesaw State University and to say I did abysmally is putting it lightly. I was on academic probation or warning after my first semester and began looking into other options during my second semester. I wound up enlisting in the Marines with a date to go to bootcamp that was before finals. So I withdrew from my classes but it was after the withdrawal deadline so I wound up failing those classes as well. I completed my 5 year enlistment in April of 2020 and began school at one of the Perimeter Campuses of Georgia State that fall semester pursuing an Associate's in Computer Science. \n\nMy initial plan was to work towards Georgia Tech's Veterans Transfer Pathway Program but as I approach the end of the Associate's program I'm realizing that I care less for Computer Science and instead want to pursue Information Technology which more closely matches up with the job I held in the Marines that I enjoyed. I've been exploring my options as both GSU and GT do not appear to offer that as a degree. Kennesaw State however does offer a Bachelor's in Information Technology that I would be interested in pursuing.\n\nI've been researching what the process of applying to KSU both using the material they have available online and a brief phone call to their admissions line. From what I've seen and been told I would be applying as a \"Readmit Degree Seeking\" student and that these old courses would affect my GPA. I am obviously hesitant about this as I feel like it would throwing away the hard work I have done, both bettering myself while enlisted and working to achieve a 3.9 while at my current school. On the other hand KSU does appear to be the school that I should try to attend as it would be the least disruptive to other aspects of my life.\n\nNow that I've given some context my questions are:\n\n* Does anyone have experience with re-admittance to KSU or if not any advice around re-admittance in general?\n\n* Obviously this would be school dependent and I have reached out via email to ask but is there a chance I might be able to plead my case so that only the first semester counts against me\n* Finally if I do decide against KSU does anyone have recommendations for schools that offer similar degrees in the South East? If I'm not able to pursue this in the vicinity of the Atlanta metro area I'm not going to limit myself to staying in Georgia.",
  "author": "zenestroe",
  "created": 1634328741,
  "updated": 1634331369,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}