{
  "sid": "qjx3e3",
  "link": "/r/ApplyingToCollege/comments/qjx3e3/can_someone_please_explain_to_me_css_vs_fafsa/",
  "title:": "Can someone please explain to me CSS vs FAFSA?",
  "text": "Please read because I have a specific question about them:\n\nIf I’m not mistaken, FAFSA determines how much aid the federal government will you give you while CSS determines how much the *school* will give you in grants/scholarships? Is this correct?\n\nIn my case, FAFSA is more favorable because my parents have a share in a small business and FAFSA doesn’t require this info. But the CSS profile does, and I’m wondering whether that will wreck my chances of getting aid from private schools or will only wreck my chances of getting scholarships?\n\nAlso: my EFC for FAFSA is pretty low. If I submit a CSS profile, will it wreck my FAFSA EFC in any way? Am I still subject to federal aid regardless of what my CSS turns out to be?",
  "author": "Brthe9876",
  "created": 1635709360,
  "updated": 1635777744,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hiswkyk": {
      "link": "/r/ApplyingToCollege/comments/qjx3e3/can_someone_please_explain_to_me_css_vs_fafsa/hiswkyk/",
      "text": "FAFSA does determine how much the federal government will give you. Usually state aid too.\n\nSchools decide for themselves how much they will give you directly.  Many of them think they get enough info from FAFSA to make that decision.  Others want more detailed info - the CSS profile is the most common way for them to get that info.\n\nIf a school requires the CSS profile you need to submit it to get aid from them - it wouldn't impact your aid at schools that don't ask for it, or your eligibility for federal aid.  Also don't assume that having more assets on the CSS profile is automatically going to mean worse aid - it might, but it's up to each school how they use that information.  \n\nIf a school has a detailed net price calculator it should still give you reasonable estimates, but small business owners sometimes get inaccurate estimates from calculators that don't get into the details  (and if that's what the school has, there isn't anything you can really do about it).",
      "author": "BrawnyAcolyte",
      "created": 1635710257,
      "upvotes": 1,
      "replies": {}
    }
  }
}