{
  "sid": "qf74vd",
  "link": "/r/ApplyingToCollege/comments/qf74vd/is_taking_too_many_de_classes_over_ap_classes_bad/",
  "title:": "Is taking too many DE classes over AP classes bad?",
  "text": "I wanted to take DE because I don't want to be drowning in debt in college. Also I much prefer that than taking a nerve wrecking AP exam. By the end of high school I plan to have taken at least 7 dual enrollment classes which amounts to at least 21 credits for the school (UMD) I am most likely to attend. I think I will have more DE classes than APs. Will colleges reject me for taking too many since I am technically paying less for college in addition to the fact that my family is poor (meaning that I will get higher financial aid)? Also how does colleges view DE?",
  "author": "ambxr2005",
  "created": 1635129253,
  "updated": 1635182385,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hhxyqhh": {
      "link": "/r/ApplyingToCollege/comments/qf74vd/is_taking_too_many_de_classes_over_ap_classes_bad/hhxyqhh/",
      "text": "No, state schools won’t do that. They are also funded by tax payer. In California, dual enrollment classes are encouraged and given same weight as AP classes. In fact, more so as to get AP credit, one needs to also write the AP exam and get at least 3.",
      "author": "svday",
      "created": 1635131105,
      "upvotes": 3,
      "replies": {}
    },
    "hhy0tvh": {
      "link": "/r/ApplyingToCollege/comments/qf74vd/is_taking_too_many_de_classes_over_ap_classes_bad/hhy0tvh/",
      "text": "DE is fine, but it is not as standardized as AP.\n\nSo unless you are taking courses in the UMD system, it is unlikely to transfer compared to AP.\n\nIn terms of admission, nah. Don't worry about it.",
      "author": "idkname999",
      "created": 1635132251,
      "upvotes": 1,
      "replies": {
        "hhy63ej": {
          "link": "/r/ApplyingToCollege/comments/qf74vd/is_taking_too_many_de_classes_over_ap_classes_bad/hhy63ej/",
          "text": "Yeah I made sure that every DE course I took would transfer over to UMD by checking the trasnfer course database",
          "author": "ambxr2005",
          "created": 1635135378,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhyfbjc": {
      "link": "/r/ApplyingToCollege/comments/qf74vd/is_taking_too_many_de_classes_over_ap_classes_bad/hhyfbjc/",
      "text": "Within your state university system (and probably other states’ universities as well) DE will be looked at favorably and you are definitely saving yourself some money!",
      "author": "RetiringTigerMom",
      "created": 1635141940,
      "upvotes": 1,
      "replies": {}
    }
  }
}