{
  "sid": "qm1jrj",
  "link": "/r/ApplyingToCollege/comments/qm1jrj/anyone_elses_school_like_this/",
  "title:": "Anyone else’s school like this?",
  "text": "At my public hs, if you take AP class, and get a 4 or 5 on the exam they replace your grade with an A for both semesters. It seems so lopsided for people who are naturally better test takers, it removes the aspect of hardwork, which colleges can see in a GPA.",
  "author": "Forward-Bill1729",
  "created": 1635966057,
  "updated": 1636136247,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.93,
  "comments": {
    "hj7mdin": {
      "link": "/r/ApplyingToCollege/comments/qm1jrj/anyone_elses_school_like_this/hj7mdin/",
      "text": "I’ve seen something like that before. The idea being if you’re good enough to earn college credit you deserve a good grade in the class.\n\nBetter test takers get better grades-that’s just life. When you get to college, many classes will have your entire grade based on 3 tests with no homework or other assignments.",
      "author": "ProteinEngineer",
      "created": 1635979619,
      "upvotes": 9,
      "replies": {}
    },
    "hj75tsb": {
      "link": "/r/ApplyingToCollege/comments/qm1jrj/anyone_elses_school_like_this/hj75tsb/",
      "text": "Sus",
      "author": "AaronFM3",
      "created": 1635972915,
      "upvotes": 3,
      "replies": {}
    },
    "hj8gd8v": {
      "link": "/r/ApplyingToCollege/comments/qm1jrj/anyone_elses_school_like_this/hj8gd8v/",
      "text": "my school does that - it removes a ton of stress for students, if you get a B in a really hard class like AP Phyiscs C or APEL it just makes it so you have a second chance, and aren't depressed about how you wont get into colelge, and incentivizes people to study harder.  \n\n\nit makes getting a B less stresful and improves life overall, sure it might screw over some other kids since we all have high gpa's and almost perfect UW but whatever i think the stress and \"bad teacher effect\" being cancelled out is worth it",
      "author": "my_alts_main",
      "created": 1635992944,
      "upvotes": 2,
      "replies": {}
    },
    "hj8s50d": {
      "link": "/r/ApplyingToCollege/comments/qm1jrj/anyone_elses_school_like_this/hj8s50d/",
      "text": "This isn't a school policy for us, but some teachers have this policy. My AP Euro teacher from sophomore year was one of them—if you get a 5 on the exam, your grade changed to an A if it wasn't one already. \n\nThis teacher assigns a fuck ton of work. AP Euro is known as the highest workload at my school. It's mostly busywork, but it takes a WHILE.\n\nOne kid decided he didn't want to do all that work. So he didn't. He did pretty much no homework all year but listened in class and tried hard on the tests. He got mostly B's on the tests (class average on tests was usually a low C). \n\nHe had an F in the class by the end of the year, but got a 5 on the exam and finished with an A. That kid was a legend.",
      "author": "FuriousGeorge1435",
      "created": 1635999130,
      "upvotes": 2,
      "replies": {}
    },
    "hj7x3o6": {
      "link": "/r/ApplyingToCollege/comments/qm1jrj/anyone_elses_school_like_this/hj7x3o6/",
      "text": "But you still have the option of just earning the grades in class right? So doesn’t it work for both good classroom/ bad test takers AND bad classroom /good test takers AND good at both?",
      "author": "WorriedTurnip6458",
      "created": 1635984327,
      "upvotes": 1,
      "replies": {}
    },
    "hj95sgi": {
      "link": "/r/ApplyingToCollege/comments/qm1jrj/anyone_elses_school_like_this/hj95sgi/",
      "text": "my school (international) just puts \"pass\" in the transcript :/\n\nSo, here is my case with 2 APs:\n\nduring the school year (completely online), one of my AP teachers did assign some homework and tests but never checked it saying that we were doing it for the sake of ourselves. Tbh it does remove that aspect of hard work bc I know people that got 5s without any studying throughout the year.\n\nThe other one didn't really care about it, so we were self-studying (no homework, no tests, and no grades)\n\nP.s. the second teacher actually does their teaching work but mostly in offline classes",
      "author": "prixxia",
      "created": 1636008985,
      "upvotes": 1,
      "replies": {}
    }
  }
}