{
  "sid": "qkfb33",
  "link": "/r/ApplyingToCollege/comments/qkfb33/so_worried_about_the_financial_aid_deadline/",
  "title:": "So worried about the financial aid deadline",
  "text": "SO, I am an international student who requires financial aid from colleges. I recently gained access to one of my schools' applicant portals and submitted my financial aid documents. Here's where it gets very complicated. There currently is an updating issue on the status of the application and there is a notification on the portal saying that the issue will be fixed by November 3rd and this will not negatively impact my results. Immediately after that, I received another email from the financial aid office saying that all financial aid documents have to be submitted by the November 1st deadline for students to be considered for financial aid. I have already contacted the admission office about this situation, but I am so confused and worried as of right now.\n\n&#x200B;\n\nDoes anyone have the same issue, or have any idea what will happen?",
  "author": "Ok-Claim-7092",
  "created": 1635777275,
  "updated": 1636165082,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiw4y0j": {
      "link": "/r/ApplyingToCollege/comments/qkfb33/so_worried_about_the_financial_aid_deadline/hiw4y0j/",
      "text": "You've already submitted everything by then deadline, right? So what's the problem?",
      "author": "prsehgal",
      "created": 1635779953,
      "upvotes": 1,
      "replies": {
        "hiw6f08": {
          "link": "/r/ApplyingToCollege/comments/qkfb33/so_worried_about_the_financial_aid_deadline/hiw6f08/",
          "text": "I have submitted before the deadline, but the status won't be updated to receive on my applicant portal by the deadline, and I'm not sure if that can affect my chances of admission or be considered for financial aid.",
          "author": "Ok-Claim-7092",
          "created": 1635780608,
          "upvotes": 1,
          "replies": {
            "hiw6xuh": {
              "link": "/r/ApplyingToCollege/comments/qkfb33/so_worried_about_the_financial_aid_deadline/hiw6xuh/",
              "text": "The portal doesn't matter as long as you submitted the application by the deadline.",
              "author": "prsehgal",
              "created": 1635780841,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}