{
  "sid": "rgcpeo",
  "link": "/r/ApplyingToCollege/comments/rgcpeo/note_from_4th_year_premed_college_student_re/",
  "title:": "Note from 4th Year Premed College student (re: prestige)",
  "text": "Gonna make this short and sweet. \n\nI didn't use Reddit until recently during the premed application cycle, but I was feeling the same way as many of you were here on A2C (just stumbled upon this \\~1 week ago). I was a pretty good college applicant but as many of you will come to know, wealth and luck usually play much larger roles. Anyway long story short I was rejected REA, ED2, and RD from literally every 'top' school except for a waitlist at Stanford that ended up amounting to nothing. I ended up going to my state school (T50) with some merit aid. \n\n4 years down the line and I'm in the middle of my premed application cycle with essentially the best cycle you could possibly have. I already have an acceptance at a top 5 medical school and have interviewed at every top 10 I applied to (leave UCSF). At my state school, I ended up with more publications and academic achievements than many of my friends at HYPMS, not to mention that many of them are having extremely lackluster application cycles (obviously not all, I have friends who are doing great, definitely not better than me but I don't want to sound like I'm just bashing HYPMS or something) \n\nI'm also a CS major (our state school is solid for CS apparently, \\~110k postgrad salary vs. Berkeley 114k) and do research in bioinformatics/modeling as well as molecular dynamics simulations. My projects, experience, and research output alone also got me a return offer at company I interned at over 4.5 semesters' worth (including summers) for \\~185k. I could have probably argued for more, too, since they reached out about keeping me and I didn't even apply. \n\nI also have many friends doing the SWE route who have broken above 200k for job offers, including one who has multiple quant offers at truly ridiculous levels...mid6figs. \n\nAfter this experience as a whole, I truly think the quality of students matters waaaay more than your school. All of us were HYPSM caliber students but got denied, but that didn't necessarily mean we suddenly lost that caliber. Of course, there are people who flail out at this school but honestly it just seems like a product of them just not really caring; many will settle for just getting good grades, doing no ECs and just getting a 80k/yr SWE job after graduation (or finance; I'm just talking CS because that's what I'm familiar with) but literally everyone I've seen who is actually putting in high effort, knows how to appeal to jobs, knows how to develop a portfolio, has meaningful research/side project achievement, networked, etc. have extremely good job offers.",
  "author": "onlymyMCATisgood",
  "created": 1639503467,
  "updated": 1639809214,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hok8qud": {
      "link": "/r/ApplyingToCollege/comments/rgcpeo/note_from_4th_year_premed_college_student_re/hok8qud/",
      "text": ">All of us were HYPSM caliber students but got denied, but that didn't necessarily mean we suddenly lost that caliber\n\nThis",
      "author": "iPerfectHuman",
      "created": 1639517059,
      "upvotes": 17,
      "replies": {}
    },
    "hok52pa": {
      "link": "/r/ApplyingToCollege/comments/rgcpeo/note_from_4th_year_premed_college_student_re/hok52pa/",
      "text": "If you don’t mind me asking, what state school did you end up attending? :) I really love this! It’s nice to get a perspective from someone who’s been through it all",
      "author": "julesonyx",
      "created": 1639515551,
      "upvotes": 5,
      "replies": {
        "hok98v4": {
          "link": "/r/ApplyingToCollege/comments/rgcpeo/note_from_4th_year_premed_college_student_re/hok98v4/",
          "text": "Yeah. They said it’s a t50 state school so there’s not many choices. I wouldn’t be surprised if they go to like UT Austin, Umich, unc, or uva. If they went there then this isn’t surprising. Also they could’ve got into a schools honors college which has a lot more connections so I think this is an anomaly",
          "author": "grdgree",
          "created": 1639517260,
          "upvotes": 2,
          "replies": {
            "hok9smj": {
              "link": "/r/ApplyingToCollege/comments/rgcpeo/note_from_4th_year_premed_college_student_re/hok9smj/",
              "text": "It was a UW-Madison/UNC tier school which at the time of my application accepted almost everyone with a 3.8+/30+ in-state. UMich is a T20 outright and an incredible institution, so I would agree if that was the 'state school' one would be referring to, as well as some of the UCs.",
              "author": "onlymyMCATisgood",
              "created": 1639517483,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hokaadw": {
      "link": "/r/ApplyingToCollege/comments/rgcpeo/note_from_4th_year_premed_college_student_re/hokaadw/",
      "text": "Great post, all isn't lost when you get rejected at T10 schools or whatever T#. Hunker down and just do what you know you would do at the other schools.",
      "author": "Sheggaw",
      "created": 1639517684,
      "upvotes": 2,
      "replies": {}
    }
  }
}