{
  "sid": "qaer8v",
  "link": "/r/ApplyingToCollege/comments/qaer8v/applying_to_ucs_which_major/",
  "title:": "Applying to UC’s, which major?",
  "text": "Hey everyone, I am applying to UC’s and I’m interested in the field of CS/CE. Honestly, between Computer Engineering, Computer Science, Computer Science & Engineering, I just want to choose the major that will increase my chances the most. For every school I have selected Data Science as my second major. Out of those three “computer” majors, which will increase my chances of getting in the most? Or is there not much difference?",
  "author": "TheLivingGranolaBar",
  "created": 1634529191,
  "updated": 1634653648,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh2n5es": {
      "link": "/r/ApplyingToCollege/comments/qaer8v/applying_to_ucs_which_major/hh2n5es/",
      "text": "They’re all very similar so I can’t imagine it’d be much of a difference but for your second major I’d recommend selecting a non impacted major if you’re not set on data science, that’s what they recommend on the Uc application. Personally I’m selecting the one I like the most, computer science.",
      "author": "californiaskiddo",
      "created": 1634531768,
      "upvotes": 1,
      "replies": {}
    },
    "hh2oh2l": {
      "link": "/r/ApplyingToCollege/comments/qaer8v/applying_to_ucs_which_major/hh2oh2l/",
      "text": "They are all impacted similarly, so the difference is likely negligible.\n\nWould pick the one which most aligns with your application themes & activites.",
      "author": "TheSnakeFang",
      "created": 1634532629,
      "upvotes": 1,
      "replies": {}
    },
    "hh2pcas": {
      "link": "/r/ApplyingToCollege/comments/qaer8v/applying_to_ucs_which_major/hh2pcas/",
      "text": "UCs mostly admit by college and transfers to csc after admission is very difficult to say the least. UCs really doesn’t like those who ‘game’ the system. Data science in many UCs is from Math/Statistics dept and is math intensive. Secondly, UC primarily consider your application for the primary major.",
      "author": "svday",
      "created": 1634533225,
      "upvotes": 1,
      "replies": {}
    }
  }
}