{
  "sid": "rh9550",
  "link": "/r/ApplyingToCollege/comments/rh9550/what_percentage_of_ed_applicants_to_columbia_are/",
  "title:": "What percentage of ED applicants to Columbia are deferred?",
  "text": "I was just deferred from Columbia, and am wondering how many applicants from the ED applicant pool are usually deferred. I'm wondering because I imagine that it could give me an idea of how close or competitive I was, and I can adjust my RD list accordingly. What do you guys think?",
  "author": "bernardopetochi",
  "created": 1639601806,
  "updated": 1639786892,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hopzigp": {
      "link": "/r/ApplyingToCollege/comments/rh9550/what_percentage_of_ed_applicants_to_columbia_are/hopzigp/",
      "text": "Heyy, I was also deferred columbia ED the other day, here's some stuff I found. note that I could be wrong on this but I've seen a lot saying that for Columbia ED round applicants, generally 10% are admitted (heavily composed of recruited athletes and legacies) while around 15-25% are deferred and around 65% rejected outright. It ain't acceptance but I still think we should both be proud that we've ourselves competitive enough to make it this far and more or less on par with their standards, a small victory is still a victory eh.  its defininately far more cause to celebrate than a Harvard ED deferral as I've heard they defer around 70% of ed applicants. initially i was a lil sad at the result but it seems our applications still managed to be more compelling than most.  stay hopeful, you've made it this far\n\nwho knows, with luck maybe next year we'll be seeing each other around the Columbia campus :).",
      "author": "ionknowwhyimhere",
      "created": 1639617434,
      "upvotes": 3,
      "replies": {
        "hor0k95": {
          "link": "/r/ApplyingToCollege/comments/rh9550/what_percentage_of_ed_applicants_to_columbia_are/hor0k95/",
          "text": "Hey I definitely hope so:))) good luck with your other apps",
          "author": "bernardopetochi",
          "created": 1639635722,
          "upvotes": 2,
          "replies": {}
        },
        "horb26g": {
          "link": "/r/ApplyingToCollege/comments/rh9550/what_percentage_of_ed_applicants_to_columbia_are/horb26g/",
          "text": "This makes me feel somehow better. Thank you and wish you the best. ◡̈",
          "author": "Cecilia_0320",
          "created": 1639643356,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}