{
  "sid": "rhhckp",
  "link": "/r/ApplyingToCollege/comments/rhhckp/kid_interested_in_pure_math_is_it_okay/",
  "title:": "Kid interested in pure math... is it okay?",
  "text": "My kid is interested in pure mathematics undergraduate program. He has good grades so far. Bit worried about opportunities in getting internship and jobs with just Mathematics. Any comments on this? appreciate on recommendations to other major/minor that my kid can take in addition to Math major?",
  "author": "jk1947",
  "created": 1639625406,
  "updated": 1639786664,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hoqhzkh": {
      "link": "/r/ApplyingToCollege/comments/rhhckp/kid_interested_in_pure_math_is_it_okay/hoqhzkh/",
      "text": "I'm actually slightly disappointed my son is not applying for pure math, because I honestly think that's his true vocation.  \n\n\nHe is applying for computer science and plans to double major with math, many schools have that as a specific pathway.",
      "author": "kaan3836",
      "created": 1639625664,
      "upvotes": 8,
      "replies": {}
    },
    "hoqi9q8": {
      "link": "/r/ApplyingToCollege/comments/rhhckp/kid_interested_in_pure_math_is_it_okay/hoqi9q8/",
      "text": "It's not wise to think of college mainly in terms of job placement. That said, pure mathematics has some of the highest job placement rates and mid-career earnings. Rather than internships, math students should find research opportunities that will prepare them for academic or professional training at the graduate level. If a student does want to pursue industry/employment immediately after undergrad, there are many opportunities for math students in government and with tech firms.\n\nCommon minors for math are physics and computer science. A math major is difficult enough by itself, so I wouldn't assume that any student should get a minor/minors.",
      "author": "tachyonicinstability",
      "created": 1639625796,
      "upvotes": 6,
      "replies": {}
    },
    "hoqhvi1": {
      "link": "/r/ApplyingToCollege/comments/rhhckp/kid_interested_in_pure_math_is_it_okay/hoqhvi1/",
      "text": "Has he told you what career he’s looking to pursue with the pure math degree?",
      "author": "meo6",
      "created": 1639625611,
      "upvotes": 1,
      "replies": {}
    },
    "hoqlnhx": {
      "link": "/r/ApplyingToCollege/comments/rhhckp/kid_interested_in_pure_math_is_it_okay/hoqlnhx/",
      "text": "It depends on what they mean by “pure math” because I think it would be wise to treat math majors like physics majors. If you think directly in the box it will cause difficulties as the first thing you think of physicist or mathematician is a long haul trig with a PhD resulting in 10+ years of college education. But if you think sideways a bit there are plenty of options available to you. As far as money is concerned it does skew [elite](https://collegescorecard.ed.gov/search/?cip4=2701&cip4_degree=c&cip4_degree=a&cip4_degree=b&fos_salary=70000..150000&page=0&sort=completion_rate:desc&toggle=fos)(listed by graduation rate). It can be a bit competitive with only a bachelors but [here](https://myillini.illinois.edu/Programs/MajorDetail/10KV0439NONE) are some sample employers for one school, UIUC. Try looking at LinkedIn for each school he’s interested in to get a more specialized understanding of the options.",
      "author": "TritonTheCat",
      "created": 1639627411,
      "upvotes": 1,
      "replies": {}
    },
    "hoqp03o": {
      "link": "/r/ApplyingToCollege/comments/rhhckp/kid_interested_in_pure_math_is_it_okay/hoqp03o/",
      "text": "There’s plenty of teaching jobs! (beyond schools/colleges there are extracurricular math programs)",
      "author": "Powerful_Focus_243",
      "created": 1639629109,
      "upvotes": 1,
      "replies": {}
    },
    "hoqunj7": {
      "link": "/r/ApplyingToCollege/comments/rhhckp/kid_interested_in_pure_math_is_it_okay/hoqunj7/",
      "text": "What does he want to \\*do\\* with a math degree?  There are lots of different ways to go, but it's good to have a tentative plan (with the understanding that plans change).  Secondary teaching,  academia, actuarial stuff, data science, or just plain software.  If the latter, would want to supplement with some CS courses.  Could also go on to law or medical school.  Or finance.  Or possibly a graduate econ program if he also studied some econ as an undergrad.",
      "author": "jayphoward",
      "created": 1639632176,
      "upvotes": 1,
      "replies": {}
    },
    "hor0tj4": {
      "link": "/r/ApplyingToCollege/comments/rhhckp/kid_interested_in_pure_math_is_it_okay/hor0tj4/",
      "text": "A common path for a lot of math majors at my college: major in math and plan on going to grad school, but also double major in CS in case that plan changes, since the abstract problem solving taught in math makes learning CS relatively easy by comparison, and there’s often substantial overlap between the major requirements, so the double major isn’t that intense. Then getting some sort of programming/software engineering job is usually feasible, since math majors usually learn how to think better than the average CS major. \n\nThere are a number of threads over on r/math asking about career paths for math majors outside of academia—maybe searching through those could also be helpful.",
      "author": "apad201",
      "created": 1639635888,
      "upvotes": 1,
      "replies": {}
    }
  }
}