{
  "sid": "qs4ozj",
  "link": "/r/ApplyingToCollege/comments/qs4ozj/overly_complicated_admission/",
  "title:": "Overly complicated admission",
  "text": "\nOff the bat I just want to say that I flubbed high school but still managed to get my degree. So my plan off action was to attend community college and then transfer to my local university to get my teaching license. \n\nNow here’s the long string of problems that are currently suffocating me! I need SERIOUS help. \n\nI graduated as a ward of the state of Texas. My college tuition is supposed to be completely free. My caseworker abandoned me a year before I became and adult and somehow NO ONE has his contact info so whoops! No one can find my fee waiver. \n\nI got half way through the enrollment process for Saint Philips before I become homeless for a few short weeks and had no cell phone or way to contact them. I got shit together a few days ago and I’m trying to pick up where I left off but I missed class registration and I have to have an appointment with an assigned advisor to continue enrolling. But I haven’t been given one. And the front desk people are incredibly unhelpful. \n\nWill they even admit me now? Do I resend my application with a different start date? Also how do I send my financial aid from fafsa?? I have no parents to answer this and google is vague. Please help.",
  "author": "Skylxrjane",
  "created": 1636696348,
  "updated": 1637376536,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkdndqa": {
      "link": "/r/ApplyingToCollege/comments/qs4ozj/overly_complicated_admission/hkdndqa/",
      "text": "Okay, first off, well done pulling things together. Deep breath. I don't know how to help you with all of this but it looks like St. Phillips is an Alamo College, is that right? If so, maybe contact their PATH Foster Youth Program at [https://www.alamo.edu/experience-the-alamo-colleges/current-students/student-opportunities/p.a.t.h/](https://www.alamo.edu/experience-the-alamo-colleges/current-students/student-opportunities/p.a.t.h/). Tell them all this and ask for help and resources. I'd start there.",
      "author": "msbzmsbz",
      "created": 1636750760,
      "upvotes": 2,
      "replies": {
        "hkdsqfo": {
          "link": "/r/ApplyingToCollege/comments/qs4ozj/overly_complicated_admission/hkdsqfo/",
          "text": "Thank you so very much",
          "author": "Skylxrjane",
          "created": 1636753077,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}