{
  "sid": "qectda",
  "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/",
  "title:": "Still haven’t decided my ED/REA school.",
  "text": "I’ve been trying to decide between Brown, Yale, Grinnell, and Swarthmore for months, and recently I somehow got the idea to consider Stanford, too. I have no clue how i’m going to decide. I love the nature of the tiny LACs but I’m worried their CS curriculum and course offerings won’t be sufficient and that i’ll have trouble getting a good job right out of college (a concern I don’t have at all about the Ivies+Stanford). I think my app and stats are alright enough to give me an okay shot at any of them, but I do think an ED to one of the LACs would give me a better shot, obviously. The deadline is coming up (obviously) but I am really struggling to make a decision. Any pointers would be appreciated (especially people in CS at any of the listed schools). Thank you :)",
  "author": "SenpaiSoren",
  "created": 1635020850,
  "updated": 1635183371,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhs4db1": {
      "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/hhs4db1/",
      "text": "If you don’t have a definite, far and away favorite school, why would you apply ED?",
      "author": "jjhoster",
      "created": 1635021409,
      "upvotes": 3,
      "replies": {
        "hhs4l89": {
          "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/hhs4l89/",
          "text": "From how I understand it, my best chance of acceptance anywhere is through an early admissions path. It would also end my college process by December, which would be really nifty.",
          "author": "SenpaiSoren",
          "created": 1635021509,
          "upvotes": 1,
          "replies": {
            "hhs5eht": {
              "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/hhs5eht/",
              "text": "I don’t think that’s necessarily the case. For the colleges you mentioned, what’s the difference between their ED and RD admit rates? My guess is something like approximately 18% vs. 14%. That’s not much of a difference.",
              "author": "jjhoster",
              "created": 1635021884,
              "upvotes": 1,
              "replies": {
                "hhs7d5z": {
                  "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/hhs7d5z/",
                  "text": "Stanford’s seems to almost double (4% to ~8%), Yale’s is significantly higher (3.4% to 10%), Brown’s is higher (6.8% to 16%), Grinnell is 58% (including ED II) vs 21%, Swarthmore is 23.8% vs 7.7%. I do understand that this is mostly because stronger applicants tend to apply more frequently in the ED type programs, but I would consider myself a fairly strong applicant.",
                  "author": "SenpaiSoren",
                  "created": 1635022789,
                  "upvotes": 2,
                  "replies": {
                    "hhsc6q1": {
                      "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/hhsc6q1/",
                      "text": "Excluding Grinnell, your stats indicate that 76%+ of ED applicants are being rejected at these colleges. So, if you don’t have a clear number one choice, I still feel that ED doesn’t make sense.",
                      "author": "jjhoster",
                      "created": 1635025014,
                      "upvotes": 2,
                      "replies": {
                        "hhscdmu": {
                          "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/hhscdmu/",
                          "text": "I’m just not sure why them all not having an impossibly high acceptance rate means I should forego it entirely? I’m going to be applying to these schools one way or another. Why would I waste the opportunity to have a better chance at getting into one?",
                          "author": "SenpaiSoren",
                          "created": 1635025103,
                          "upvotes": 2,
                          "replies": {
                            "hhsd5rb": {
                              "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/hhsd5rb/",
                              "text": "To me, ED means a student has one school that they want to attend above all others. That’s just my perspective. We can happily disagree on this.",
                              "author": "jjhoster",
                              "created": 1635025462,
                              "upvotes": 1,
                              "replies": {
                                "hhsddya": {
                                  "link": "/r/ApplyingToCollege/comments/qectda/still_havent_decided_my_edrea_school/hhsddya/",
                                  "text": "I guess part of my issue is that there really isn’t one school I want to go to above the rest. I think Stanford is probably the closest thing, but I’d probably be equally happy ending up at the other four. To me, ED/REA is just an opportunity to boost my chances a little bit. Thank you for your insight :)",
                                  "author": "SenpaiSoren",
                                  "created": 1635025563,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}