{
  "sid": "q5paw6",
  "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/",
  "title:": "I wrote a supllementary about optimistic nihlism. Is it too edgy?",
  "text": "Optimistic nihlism is acknowledging your insignificance and making peace with it. The essay is kind of ranty and I can see how it can come off as pseudo-intellectual. Are these big no-no's?\n\nEdit: I didn't specifically name optimistic nihlism in the essay.",
  "author": "ChiliManNOMNOM",
  "created": 1633931354,
  "updated": 1634073440,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hg7ar2v": {
      "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg7ar2v/",
      "text": "I think I saw an essay on CEG that was somewhat similar- something about a meteor.\n\nIt works, but you need to ADVOCATE for yourself. How will making peace with the world around you (and fate, I guess) make you contribute to the community around you? I can think of a few, but you'll have to come up with those reasons yourself and mention them.",
      "author": "sleepkeyichidema",
      "created": 1633935502,
      "upvotes": 4,
      "replies": {}
    },
    "hg75wt7": {
      "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg75wt7/",
      "text": "Ummmmm I'm gonna give that a hard no bestie\n\nBeing dark isn't going to get an AO to fight for you",
      "author": "ssssseabass",
      "created": 1633931800,
      "upvotes": 5,
      "replies": {
        "hg771k8": {
          "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg771k8/",
          "text": "Hmm...\n\nI really like the first paragraph, but the essay really dwells on the concept of insignificance too much, so it comes off edgy. I think I'll keep the first paragraph about insignificance but delete the rest. \n\nThe rest of the essay can be a counterargument towards the first paragraph. But is that still too edgy? The essay prompt is \"Whats meaningful to you?\" or something, and how I acknowledge my insignificance but manage to not care about it is the truthful answer. But anything built on that concept has a %90 chance of coming off as pseudo-intllectual garbage.\n\nI honestly need a second opinion. Mind if I DM the essay to you in like 9 hours?",
          "author": "ChiliManNOMNOM",
          "created": 1633932647,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hg78xhd": {
      "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg78xhd/",
      "text": "telling the admissions reader \"i am insignificant and I'm fine with that\" isn't really going to make them think \"WOW we need this student at our campus,\" especially when other applicants will be convincing them that \"I/my story is significant\"  its good to be honest with your interests and worldview and whatnot, but this is just counter intuitive for the purpose of the essay.",
      "author": "thifting",
      "created": 1633934086,
      "upvotes": 2,
      "replies": {
        "hg868wt": {
          "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg868wt/",
          "text": "Yeah in hindsight I think you're right. Me being at peace with my existence isn't a positive, it just means that I'm not a self loathing and depressed nihlist. \n\nI just got inspired for a much better answer while reading your comment too so thanks!",
          "author": "ChiliManNOMNOM",
          "created": 1633959348,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg7umde": {
      "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg7umde/",
      "text": "Did you just watch that one kurzgesagt video lol",
      "author": "seventyfivezebras",
      "created": 1633952523,
      "upvotes": 1,
      "replies": {
        "hg85dfu": {
          "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg85dfu/",
          "text": "Yeah lol but not in that kind of way.\n\nI called myself an Absurdist when I was an angsty teen and just switched to optimistic nihlism when I decided that being happy out of spite was kind of dumb. \n\nI've been too busy for philosophy the last year. I went on a Kurzgesagt binge like three weeks ago for inspiration. They managed to talk about optimistic nihlism so elegantly and I thought I could too. Guess not, it turned out to be a rant.",
          "author": "ChiliManNOMNOM",
          "created": 1633958900,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg85u5k": {
      "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg85u5k/",
      "text": "1) You’re coming off as someone who’s trying too hard to sound “smart.” Be yourself\n\n2) Calling yourself insignificant doesn’t have a humbling effect on your application. It’ll just make you look bad compared to more assertive applicants.",
      "author": "did_i_inquire",
      "created": 1633959140,
      "upvotes": 1,
      "replies": {
        "hg87pay": {
          "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg87pay/",
          "text": "1) This essay was one of my first supplementaries. I genuinely believe in what I wrote, but the topic is so hard to write about without coming off as someone who's trying too hard to sound smart. I'm just not gonna write about philosophy because I'm not a good enough writer.\n\n2) You're entirely right on this one.",
          "author": "ChiliManNOMNOM",
          "created": 1633960062,
          "upvotes": 1,
          "replies": {
            "hg8feam": {
              "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg8feam/",
              "text": "I bet you're a good enough writer, it's just hard to be philosophical in college essays without sounding pretentious imo",
              "author": "did_i_inquire",
              "created": 1633963608,
              "upvotes": 1,
              "replies": {
                "hg8g744": {
                  "link": "/r/ApplyingToCollege/comments/q5paw6/i_wrote_a_supllementary_about_optimistic_nihlism/hg8g744/",
                  "text": "Yeah, good thing I found that out before sending in Early Apps.",
                  "author": "ChiliManNOMNOM",
                  "created": 1633963952,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}