{
  "sid": "riuh5r",
  "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/",
  "title:": "Asian mom disappointed",
  "text": "Got deffered from columbia ED, then Uchicago EA today. Mom literally took one look at me, sighed, then walked away.\n\nIstg her expectations/perceptions of me are sky high. She doesn’t understand “why they wouldn’t accept me”. Maam im just not good enough. Please try to deal with it.",
  "author": "fishy0404",
  "created": 1639785961,
  "updated": 1645847919,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hozllvz": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hozllvz/",
      "text": "There’s not much happiness in trying to bend yourself to the expectations of others (either schools or parents). I hope you find something you care deeply about and pursue it wholeheartedly.",
      "author": "steeplebob",
      "created": 1639786477,
      "upvotes": 1,
      "replies": {}
    },
    "hozn0kp": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hozn0kp/",
      "text": "She’s feeling hurt for you.",
      "author": "T123369",
      "created": 1639787119,
      "upvotes": 1,
      "replies": {
        "hp0e5kn": {
          "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp0e5kn/",
          "text": "I think you’re right. She probably doesn’t know how to express her feelings in a healthier way.",
          "author": "steeplebob",
          "created": 1639800486,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hozvo9f": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hozvo9f/",
      "text": "Think of it this way, for them, all they needed was good grades. Not just good, even  a single mark off could push them off. The American college app system is very odd comparatively, and she might think that your grades are good enough and does see why not.",
      "author": "askandushantreceive",
      "created": 1639791121,
      "upvotes": 26,
      "replies": {
        "hozwt2v": {
          "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hozwt2v/",
          "text": "thats the thing. my gpa is the weakest part of my app and she knows that 😭😭😭",
          "author": "fishy0404",
          "created": 1639791647,
          "upvotes": 15,
          "replies": {
            "hozxb60": {
              "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hozxb60/",
              "text": "Hmm… then play to the other side. Tell her how many kids with 4.0/val / 1600 get rejected. There’s stats onlie",
              "author": "askandushantreceive",
              "created": 1639791886,
              "upvotes": 19,
              "replies": {}
            }
          }
        }
      }
    },
    "hoznjcl": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hoznjcl/",
      "text": "im sorry to hear that. My mom did the same thing.",
      "author": "FishyPuff_24",
      "created": 1639787359,
      "upvotes": 15,
      "replies": {}
    },
    "hp057uy": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp057uy/",
      "text": "I don't dare to tell my parents about getting rejected from stanford- they'd tell me i wasted my time applying.\n\na bit of a weird asian parent mentality where they don't expect me to do anything but if i do anything and its not perfect they'll have my head \n\nBUT anyway. Good luck for rd! I'm sure you'll get into a great school",
      "author": "sleepkeyichidema",
      "created": 1639795734,
      "upvotes": 13,
      "replies": {}
    },
    "hp0jths": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp0jths/",
      "text": "I hate to hear that. I applied in 1991. 30 years ago. The top universities were competitive back then. People even said that 1991 was the most competitive year ever. But it was nothing compared to how things are now. Back then, I was considered a very strong applicant. Probably the top applicant from my very large school. And I did get into some top universities. But if you transplanted my application to the present day, I doubt I would be accepted. My SAT scores, which were far above average in 1991, are well below what is considered competitive now. My extracurriculars, which were a huge strength of my application, would be considered fairly humdrum For an applicant to the top 20 universities.. My AP classes and exam scores which stood out back then would be considered near the minimum expectation now. I suspect that many parents simply don’t understand what is going on out there. College admissions has become a brutal arms race and there’s no end in sight. Perhaps you disappointed your mother, but that’s about her. Ask whether you disappointed yourself. If you did, Examine why you feel that way and what you can do about it. If not, mom will just have to live with it. It’s not her life.",
      "author": "Madmandocv1",
      "created": 1639803742,
      "upvotes": 11,
      "replies": {}
    },
    "hp0cvfy": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp0cvfy/",
      "text": "I think we might just have the same mom . . .",
      "author": "Friendly_Wave1227",
      "created": 1639799782,
      "upvotes": 5,
      "replies": {}
    },
    "hp0fvvv": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp0fvvv/",
      "text": "I’m so sorry.  I’m a white tiger mom, but I would never do that to my child.  It’s not even a real no.  You are good enough no matter how your decisions turn out.",
      "author": "CaraMorrow",
      "created": 1639801454,
      "upvotes": 2,
      "replies": {}
    },
    "hozvbt3": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hozvbt3/",
      "text": "don’t worry! you got this! them deferring you means that they didn’t reject you, don’t lose faith. there’s always rd!!",
      "author": "_candz",
      "created": 1639790956,
      "upvotes": 2,
      "replies": {}
    },
    "hp0i617": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp0i617/",
      "text": "I am so, so sorry. Please never forget that you are so much more than a decision made by an extremely small group of people behind closed doors. We are all here for you.",
      "author": "purpleflowerr",
      "created": 1639802776,
      "upvotes": 1,
      "replies": {}
    },
    "hp0woic": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp0woic/",
      "text": "idk if this is helpful, but here's me trying to be helpful(?) since I've been in your shoes before:\n\npast asian mom's applicant kid here (lmao). tbh I got rejected Columbia ed and deferred then rejected for uchicago ea and I'm now in college and literally doing fine (I mean, got murdered by finals today so not that fine but literally like long-term practically fine). Having been there, I hate that your mom isn't being supportive to you in such a sucky situation, but don't let their disappointment project onto your mentality!! just buckle down, shotgun if you want to, and work your hardest for rd. that's what matters.\n\nalso sometimes moms just don't understand the college process and you just really gotta hammer into them that it's all just one in a million. ideal situation is xxx couldn't get into their dream college either, so just point to them and be like see? see??? lmao",
      "author": "ampacel",
      "created": 1639812713,
      "upvotes": 1,
      "replies": {}
    },
    "hp125i8": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp125i8/",
      "text": "Tell her to get an ivy if she wants it that hard. (I’m also an Asian who’s parents have high expectations)",
      "author": "Independent_Ad8989",
      "created": 1639817200,
      "upvotes": 1,
      "replies": {}
    },
    "hp14yip": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp14yip/",
      "text": "if it makes you feel better i was lectured after getting a 1510",
      "author": "localramenconsumer",
      "created": 1639819618,
      "upvotes": 1,
      "replies": {
        "hp1rwoa": {
          "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp1rwoa/",
          "text": "I'm still getting scolded for a 1550 even today :(",
          "author": "verity_singapore",
          "created": 1639836657,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hp16wt8": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp16wt8/",
      "text": "Least unreasonable Asian parent",
      "author": "PoopMan616",
      "created": 1639821315,
      "upvotes": 1,
      "replies": {}
    },
    "hp1b1iw": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp1b1iw/",
      "text": "literally me tho!! my mom's smile drops every time she looks at me now and this morning she cried angrily at me calling me irresponsible towards my own future! for reference, i got rejected from yale rea, and now she wants to make me pick apart my application to see exactly where i went wrong. she thinks that one of my essays was too trivial and made me seem too childish to the AOs and she thinks that my math teacher submitted a shit LOR to spite me (which I highly doubt because she liked having me in her math class and wrote me into her speech at honor societies induction. i should mention that my mom has hated that teacher ever since she laid eyes on her.) so i sympathize with you hard.. i'm sorry that we all have to suffer like this.",
      "author": "92coups17",
      "created": 1639824862,
      "upvotes": 12,
      "replies": {}
    },
    "hp1wu49": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp1wu49/",
      "text": "It’s not that you aren’t good enough. It’s that 10k people applied for like 600 spots… of those 10k 1k had perfect scores",
      "author": "Pattywackist",
      "created": 1639839259,
      "upvotes": 2,
      "replies": {}
    },
    "hp20oh1": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp20oh1/",
      "text": "ignore her lol",
      "author": "Dantalian1506",
      "created": 1639841173,
      "upvotes": 2,
      "replies": {}
    },
    "hp2mw7y": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp2mw7y/",
      "text": "The saddest thing I read once was titled \"How do I sound less Asian on my college aps\"  :((\n\nSo disappointing that we all can't just be who we are.",
      "author": "SumaStorms",
      "created": 1639851091,
      "upvotes": 2,
      "replies": {}
    },
    "hp1lqs3": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp1lqs3/",
      "text": "ah debate kid",
      "author": null,
      "created": 1639833048,
      "upvotes": 1,
      "replies": {}
    },
    "hp2df0l": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp2df0l/",
      "text": "Me too with the same schools bestie😃 I know seeing disappointment sucks but the best you can do is know that you’ve done your best and will continue to do so",
      "author": "issiissi",
      "created": 1639846964,
      "upvotes": 1,
      "replies": {}
    },
    "hp2zkmh": {
      "link": "/r/ApplyingToCollege/comments/riuh5r/asian_mom_disappointed/hp2zkmh/",
      "text": "lol I'm Asian, and I'm in the opposite situation 😂\n\nMy mom's constantly saying things like \" \\[INSERT RANDOM SCHOOL\\] is also a really good uni if you go there I'll be really happy\"\n\nwhile I'm like \"NO I don't want to go thereeeeee\" cuz I have higher expectations\n\nTBH, she never ever had a high expectation for me. I only got to the point I currently am now, because I'm randomly talented at academics and did well without even trying hard?",
      "author": "TheVelvet1",
      "created": 1639856651,
      "upvotes": 1,
      "replies": {}
    }
  }
}