{
  "sid": "qft7g3",
  "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/",
  "title:": "asking teacher to revise a LOR?",
  "text": "i asked my art teacher to write me a LOR bc she’s the only teacher i have a strong relationship w/ outside the classroom. \n\nshe sent me my LOR (bc she didn’t know students can’t send the letters themselves) and giving into my temptations, i read it. the LOR was 190 words w/ vague descriptions despite me providing her w/ multiple pages of my experiences, qualities, etc. i later learned it was her first time writing a LOR. \n\ni really do appreciate her help, but i was just expecting a little more with how close we are. \n\nwould it be wrong to ask my teacher to be more specific and enthusiastic in my LOR? or am i being a jerk and asking for too much? or should i just not submit any LORs?",
  "author": "thefinalgate",
  "created": 1635204258,
  "updated": 1635301753,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hi1syto": {
      "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/hi1syto/",
      "text": "Because you’re technically not supposed to see it in the first place, in my opinion, it feels wrong to ask her to revise it \n\nYou’re already seeing something you’re not really supposed to be seeing, and that’s probably the exact reason they don’t want students to see them",
      "author": "collegecolloquial",
      "created": 1635205083,
      "upvotes": 23,
      "replies": {}
    },
    "hi1vcxw": {
      "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/hi1vcxw/",
      "text": ">am i being a jerk and asking for too much?\n\nYes.\n\nFeel free not to submit.",
      "author": "skieurope12",
      "created": 1635206196,
      "upvotes": 22,
      "replies": {}
    },
    "hi1vhw1": {
      "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/hi1vhw1/",
      "text": "Here’s what I would do: send an email saying hey, you can submit your lor directly through the commonapp. Additionally, usually lor’s are more descriptive, and I know that although you’re busy, I would appreciate it if you were more anecdotal in your writing. Obviously this is kinda bold, but this lor is important. She sent it to you so it’s not like she didn’t expect you to read it. Ultimately up to you but it’s ok to advocate for yourself especially when stuff like this can help determine your future.",
      "author": "throwingtheawayof",
      "created": 1635206260,
      "upvotes": 8,
      "replies": {
        "hi21qnu": {
          "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/hi21qnu/",
          "text": "i was actually planning on doing something similar! it is pretty bold, but it makes me feel a bit better knowing that my teacher is pretty easy-going and relaxed. so i don’t think (or at least i hope) she wouldn’t take my request the wrong way. \n\nbtw, ur last sentence is a bit of an eye-opener coming from a non-confrontational person so thanks !!",
          "author": "thefinalgate",
          "created": 1635209148,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hi1up1r": {
      "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/hi1up1r/",
      "text": "Absolutely tell her… she sent it to you so it’s kinda obvious that you’d get tempted. Maybe give her a brag sheet outlining things you’d like to mention…",
      "author": "helpmegetintocolleg",
      "created": 1635205884,
      "upvotes": 4,
      "replies": {
        "hi20pb8": {
          "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/hi20pb8/",
          "text": "the thing is i’ve already given her a brag sheet along with a resume LOL so i’m thinking of explicitly asking her to include some of that info (love ur username btw)",
          "author": "thefinalgate",
          "created": 1635208681,
          "upvotes": 1,
          "replies": {
            "hi28hmd": {
              "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/hi28hmd/",
              "text": "Yepp I think you should too… just make sure not to sound too rude because she may take it as you being ungrateful",
              "author": "helpmegetintocolleg",
              "created": 1635212251,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi4fxnx": {
      "link": "/r/ApplyingToCollege/comments/qft7g3/asking_teacher_to_revise_a_lor/hi4fxnx/",
      "text": "As long as your counselor doesn’t know you saw it you should be good. Keep it on the down low and take advantage of it. But remind your future teachers when you ask for recommendation letters!",
      "author": "imdone145",
      "created": 1635261187,
      "upvotes": 1,
      "replies": {}
    }
  }
}