{
  "sid": "r6z214",
  "link": "/r/ApplyingToCollege/comments/r6z214/are_questbridge_results_similar_to_normal/",
  "title:": "Are questbridge results similar to normal admission results?",
  "text": "I don't know much about questbridge because I don't qualify, but 2 of my close friends were finalists. Both of them matched with Ivy League schools today and are super excited. I'm wondering if comparing my stats to theirs would help me predict my results. I have better stats than both of them, so does that mean I have a good chance at top schools too? Or is the questbridge process different? If I applied to the same schools they got in, will that affect my chances?\n\nEdit: I just found out another one of my friends matched at an Ivy League. Thats 3 friends!!! 2 at my school and 1 at a school close by. My school has never produced an Ivy league student before and I'm so proud right now.",
  "author": "EmmenRose",
  "created": 1638420249,
  "updated": 1638478063,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hmw8hgx": {
      "link": "/r/ApplyingToCollege/comments/r6z214/are_questbridge_results_similar_to_normal/hmw8hgx/",
      "text": "Questbridge follows a different application process, so you shouldn't use their results to predict yours. Plus these schools follow holistic admissions, so your stats are just one part of your application - the rest of it makes a difference too.",
      "author": "prsehgal",
      "created": 1638420787,
      "upvotes": 6,
      "replies": {
        "hmw9ifo": {
          "link": "/r/ApplyingToCollege/comments/r6z214/are_questbridge_results_similar_to_normal/hmw9ifo/",
          "text": "My EC's are equal to or better than theirs. I did ED to Rice which has holistic admissions so I'm just gonna hope that my success is similar to theirs. Only a week or so of anxiety until I find out 😭",
          "author": "EmmenRose",
          "created": 1638421351,
          "upvotes": 3,
          "replies": {
            "hmwecty": {
              "link": "/r/ApplyingToCollege/comments/r6z214/are_questbridge_results_similar_to_normal/hmwecty/",
              "text": "Wow, first time seeing someone mention ED'ing to Rice. Good luck to us both!!",
              "author": "Rude-Candidate-8728",
              "created": 1638424098,
              "upvotes": 3,
              "replies": {
                "hmwi0vi": {
                  "link": "/r/ApplyingToCollege/comments/r6z214/are_questbridge_results_similar_to_normal/hmwi0vi/",
                  "text": "Hopefully we'll get in together",
                  "author": "EmmenRose",
                  "created": 1638426416,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}