{
  "sid": "qax269",
  "link": "/r/ApplyingToCollege/comments/qax269/is_it_even_worth_it/",
  "title:": "Is It Even Worth It?",
  "text": "My mom completed the FAFSA this morning and the EFC it gave it out was way too for what I can afford. It was above 60,000 and I can not afford half that without loans. I was previously planning on applying to a few T20 schools that are only need-based aid, but this put a wrench in my plans and in all honesty ruined my day. Should I still even apply to these schools? I am happy enough with my state school (CU Boulder), but it is by far not my top choice.",
  "author": "Meursault775",
  "created": 1634594464,
  "updated": 1634653030,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hh5uer7": {
      "link": "/r/ApplyingToCollege/comments/qax269/is_it_even_worth_it/hh5uer7/",
      "text": "The EFC you get from FAFSA is somewhat meaningless, as schools have their own criteria for calculating aid.\n\nYou MUST use the specific Net Price Calculator for any school you’re interested in if you want an accurate number.",
      "author": "Strict-Special3607",
      "created": 1634595172,
      "upvotes": 9,
      "replies": {}
    },
    "hh6kays": {
      "link": "/r/ApplyingToCollege/comments/qax269/is_it_even_worth_it/hh6kays/",
      "text": "I also agree that the fafsa estimate is bullshit. Mine was 10k above my family's total yearly income, meaning they think we can afford to put our entire yearly income plus money out of our savings into my education each year. And why the hell does the value of my house even matter to the valuation of what we can pay. Do they think we can just sell out house to pay for college.",
      "author": "AuthenticPhantom",
      "created": 1634607540,
      "upvotes": 3,
      "replies": {}
    },
    "hh73jgg": {
      "link": "/r/ApplyingToCollege/comments/qax269/is_it_even_worth_it/hh73jgg/",
      "text": "I dont know.  If there was a specific school you have always wanted to go to, I would apply and see if the finances work out, or hope for some type of aid or scholarship.  However, if you are applying just because those schools ate ranked higher than CU then no.",
      "author": "JP2205",
      "created": 1634617750,
      "upvotes": 1,
      "replies": {}
    },
    "hh667be": {
      "link": "/r/ApplyingToCollege/comments/qax269/is_it_even_worth_it/hh667be/",
      "text": ">Should I still even apply to these schools?\n\ntbh, I wouldn't.  If your application is strong enough, though, you could apply to some schools that have highly competitive (large) merit scholarships.  Just go into it with the knowledge that you will likely get into most of these schools but *not* win the scholarship, which will mean you'll have to decline their offer.  Think of them as \"admissions safeties/targets\" but \"financial reaches\".",
      "author": "jayphoward",
      "created": 1634600781,
      "upvotes": -1,
      "replies": {}
    }
  }
}