{
  "sid": "q7hf44",
  "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/",
  "title:": "What are some really universities for Computer Science?",
  "text": "I talked to my school counsellor today and guess what she said my college list is ✨too safe✨ I need to add some more dream unis in my list. So what are some great universities for CS that are roughly equivalent to Georgia Tech in terms of chances of getting in...?",
  "author": "Rocky7886",
  "created": 1634149746,
  "updated": 1634573984,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgin6gm": {
      "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgin6gm/",
      "text": "Are you happy with your list?? If yes, no need to change it. You're not supposed to make your list on the basis difficulty of getting in. Fill it up with colleges you'd like to attend and colleges you could attend in case the ones you'd like to attend reject you. That's it.",
      "author": "Concerned-gay-guy",
      "created": 1634151416,
      "upvotes": 7,
      "replies": {
        "hguk3xy": {
          "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hguk3xy/",
          "text": "I'm an international student and am not really that particular about which college I go to other than the location and maybe generosity in terms of scholarships and aid so idm adding more elite unis tbf that would only make me happier",
          "author": "Rocky7886",
          "created": 1634382957,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgilq56": {
      "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgilq56/",
      "text": "If GT is in-state for you, shoot for that.  \nGT is top-tier, and in-state pricing will be baller.  \n\n\nOtherwise, have a look at this:  \n\nhttp://csrankings.org/  \n\nCaution: CSrankings is NOT perfectly accurate in identifying who the actual best schools are. But it's not a bad tool either, and is easier to use than others.",
      "author": "VA_Network_Nerd",
      "created": 1634150825,
      "upvotes": 4,
      "replies": {
        "hgukapn": {
          "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgukapn/",
          "text": "isn't the site meant for identifying good Ph. D / MS programs?",
          "author": "Rocky7886",
          "created": 1634383101,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgj1okz": {
      "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgj1okz/",
      "text": "Lots of really universities. Not many fakey universities. 😛\n\nIn my daughters list, the bucket GT is in includes Michigan, Cornell, UIUC and Washington.  There may be some in the CA system but we avoided them.\n\nA tier up, as a stretch, would be MIT, CMU, Stanford.",
      "author": "RichInPitt",
      "created": 1634157293,
      "upvotes": 4,
      "replies": {
        "hgukdjh": {
          "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgukdjh/",
          "text": "sry for the typo 😬 and thanks i'll check those out",
          "author": "Rocky7886",
          "created": 1634383162,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgj8q7t": {
      "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgj8q7t/",
      "text": "UC Berkeley for L&S, just be aware that you need to hit a 3.3 in CS 61A, 61B and CS 70 once you're in to declare the CS major. You can also apply for EECS and get a direct admit but the acceptance rate for that program is somewhere around 5%. \n\nI'd be a bit concerned about OOS tuition but if you're willing to pay for it then no issues\n\nThey also may be introducing a new declaration policy in the new future, but as long as you're admitted and start school before they deploy it you don't have to worry about any changes they make",
      "author": "MundyyyT",
      "created": 1634160233,
      "upvotes": 1,
      "replies": {
        "hgkd0kn": {
          "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgkd0kn/",
          "text": "UC Berkeley is changing their L&S CS policy to direct admit for almost all of the students interested. You apply to L&S CS as a freshman. If you don’t get in, you will have even more difficulty transferring.",
          "author": "Berkeley_Simp",
          "created": 1634179037,
          "upvotes": 3,
          "replies": {
            "hgkdf2l": {
              "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgkdf2l/",
              "text": "No confirmation if that policy will be in place for entering class of Fall 2022 AFAIK so until there is, assume the status quo. Even if they do implement it after entering class of Fall 2022 has started school they get grandfathered into the old requirements and likely do not have to run the gauntlet\n\nAlso good riddance if it is honestly. Half the kids from my high school applied to some weird fluffy majors and then pivoted straight to CS once they got in. The EECS department is suffering hard with underenrollment in all non-math EE courses and shitloads of impaction in CS classes. My EECS and CS friends from HS trying to take the classes are seeing or have seen hours-long office hour queues in certain classes just to get help for 10 minutes on a lab. Makes the student experience absolutely miserable if you aren't a genius or highly independent\n\nThis is the best solution, who cares if people get rejected from Berkeley because of it. Going to UC Irvine or UC Davis for CS/CSE won't kill someone's future",
              "author": "MundyyyT",
              "created": 1634179232,
              "upvotes": 3,
              "replies": {
                "hgkntqf": {
                  "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgkntqf/",
                  "text": ">Half the kids from my high school applied to some weird fluffy majors and then pivoted straight to CS once they got in\n\nIntended major doesn't impact admissions into College of Letters and Science iirc.\n\nIt's too bad that I'm Fall 2023. Fuck my life.\n\nI just want to get into a target school for top firms. Berkeley should just accept that it's going to be a STEM UC and direct more resources there.",
                  "author": "Berkeley_Simp",
                  "created": 1634184826,
                  "upvotes": 2,
                  "replies": {
                    "hgkq105": {
                      "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgkq105/",
                      "text": "it doesn't \\_officially\\_ affect your acceptance rate but definitely doesn't hurt to be able to just change your majors to the most lucrative and attractive major at a top CS school w comparatively less hurdles to jump than anywhere else that isn't a top private school. that's why the major is exploding with enrollment issues",
                      "author": "MundyyyT",
                      "created": 1634186138,
                      "upvotes": 2,
                      "replies": {
                        "hgksqre": {
                          "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgksqre/",
                          "text": "yeah true true\n\nI'm really praying for Berkeley CS.\n\nI would love to be the one black person to graduate with 5 year BS/MS in Berkeley CompSci for my year.\n\n(The last part is a joke and not the real reason why I want to go.)",
                          "author": "Berkeley_Simp",
                          "created": 1634187885,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgjif9p": {
      "link": "/r/ApplyingToCollege/comments/q7hf44/what_are_some_really_universities_for_computer/hgjif9p/",
      "text": "Denison's Data Analytics.",
      "author": "DiarrheaASMR28",
      "created": 1634164481,
      "upvotes": 1,
      "replies": {}
    }
  }
}