{
  "sid": "rfsnr4",
  "link": "/r/ApplyingToCollege/comments/rfsnr4/how_do_i_convince_myself_i_will_get_rejected_from/",
  "title:": "How do I convince myself I will get rejected from my ED school?",
  "text": "So I applied to like a big reach (Brown), and I'm really trying to convince myself I won't get in, because my current dumbass self is still holding on to some hope and is way too overconfident. I know that if I open my decision letter with my current mindset and its a rejection (or even a deferral) I will be absolutely crushed, and I really do not want that happening. Does anyone have tips for getting their hopes down in order to minimize the damage from rejection? Or is this kinda impossible and I just need to accept that I'll be sad for a couple days?",
  "author": "EffectiveCustard",
  "created": 1639436231,
  "updated": 1639814832,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hog49ue": {
      "link": "/r/ApplyingToCollege/comments/rfsnr4/how_do_i_convince_myself_i_will_get_rejected_from/hog49ue/",
      "text": "No institution can take credit for your achievements, your work is a product of you. The place doesn’t define you. It’s about what you make of it and how you maximize your opportunities. So with that being said, I hope you’ve applied to a few other colleges by now and you should find peace with the fact that there are other colleges. At the end of the day, life goes on. I applied ED too and oddly, I’ve been super calm this week. Thursday!",
      "author": "PsychologicalLook415",
      "created": 1639441168,
      "upvotes": 5,
      "replies": {
        "hogud4d": {
          "link": "/r/ApplyingToCollege/comments/rfsnr4/how_do_i_convince_myself_i_will_get_rejected_from/hogud4d/",
          "text": "Yo same. When I got my WashU decision, I was eating dinner with my family. I honestly just felt really calm in the moment (though a part of me was just gonna nonchalantly put my phone in my pocket if I got rejected, and act like nothing happened). But none of the \"OMGGGGG I CAN'T BELIEVEEE ITTT, I GOTT INNNNNN\" with high pitched screaming. To be honest, I didn't even feel that good when I got in. Like it was a dream come true, and I'm so hyped now, but at the moment I was like \"Oh cool\" and that's it. My dad was like \"good job.\"",
          "author": "Episteme_A",
          "created": 1639453130,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hogcijd": {
      "link": "/r/ApplyingToCollege/comments/rfsnr4/how_do_i_convince_myself_i_will_get_rejected_from/hogcijd/",
      "text": "Hey. I also applied to Brown ED and I know exactly how you feel. Although there is no controlling the decisions of the admissions officers, you can control how you feel. If you don't get in, allow yourself to feel sad. Allow yourself to wallow in your rejection. But please don't let it crush your spirits. Don't take it as a roadblock to future endeavors or a measurement of your worth as a person. Even the most \"qualified\" applicants with perfect scores, GPA, and god-like ECs get rejected. Whether you're religious and spiritual or not, you have to have faith it will all work out in the future. Best of luck to both of us! :)",
      "author": "spicy_doodle",
      "created": 1639445020,
      "upvotes": 3,
      "replies": {}
    },
    "hogkpyv": {
      "link": "/r/ApplyingToCollege/comments/rfsnr4/how_do_i_convince_myself_i_will_get_rejected_from/hogkpyv/",
      "text": "Find a safety or two that you love\n\nThat way, after you go through the traditional 5 minute period of post-rejection grief, you can snap out of it and go “oh shit, I still have Arizona state/Michigan Tech/whatever and I love it there” and you can look forward to that and take your mind off Brown",
      "author": "myfedoraismlg",
      "created": 1639448737,
      "upvotes": 2,
      "replies": {}
    },
    "holcl58": {
      "link": "/r/ApplyingToCollege/comments/rfsnr4/how_do_i_convince_myself_i_will_get_rejected_from/holcl58/",
      "text": "Bruv facts I’m like overconfident af thinking I’ll get in knowing I won’t like most likely cause I’m psychotic no cap",
      "author": "Upstairs-Holiday3033",
      "created": 1639534597,
      "upvotes": 1,
      "replies": {}
    }
  }
}