{
  "sid": "q8c4vm",
  "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/",
  "title:": "Speechless Right Now",
  "text": "I know reddit isn’t a place to seek therapy but I just need to get this off my chest. My parents are in real estate and one of their purchases backfired terribly. My family is in a $250k debt plus interest and I’m just devastated right now. My mom came home and told me about it. I admit that I displayed frustration at her risky financial decision, and she started yelling at me. She called me a selfish bitch, and a bunch of other expletives, and she said that I was gonna have no choice but to attend a cheap college. I worked hard all four years of high school in my academics and extracurriculars and all of it has gone down the drain. I just finished my supplementals for my schools, but those don’t seem useful anymore given my situation. I’m expecting to be a National Merit Finalist, but the schools that give full rides aren’t really the ones I want to attend. I’m just so lost on how to continue in a household where emotions are considered signs of weakness and having been put in a position where my college choices have been taken away. Literally the last thing my parents said to me today was to deal with the situation and to get used to living a more painful life.",
  "author": "Suitable_Alps4862",
  "created": 1634256425,
  "updated": 1634331352,
  "over_18": false,
  "upvotes": 68,
  "upvote_ratio": 0.96,
  "comments": {
    "hgon98t": {
      "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgon98t/",
      "text": "Plenty of people who got into ivy's sometimes go to cheaper schools for aid, my guy friend got into Upenn, but went to Drexel cause of the scholarships he got. Maybe on this subreddit people emphasize good schools, but there are many kids I know who actually choose colleges with aid. If you go to an easier university, get really good grades and accomplish well, it will be totally worth it. \n\nSorry about your situation bud, you're parents must be tense, but she should not have called you a bitch.",
      "author": "That-Catch2289",
      "created": 1634261275,
      "upvotes": 37,
      "replies": {
        "hgqru6s": {
          "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgqru6s/",
          "text": "Off topic but how does he like Drexel so far? I applied and would most likely attend if accepted, but the quarter system sort of puts me off. Thanks!",
          "author": "Colinplayz1",
          "created": 1634308685,
          "upvotes": 1,
          "replies": {
            "hgrgtls": {
              "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgrgtls/",
              "text": "oof I haven't talked with him in a while, but even though it may seem little expensive, they offer scholarships, lot of engineering and stem students seem to like it there, wish I knew more about it though",
              "author": "That-Catch2289",
              "created": 1634318987,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgoebyi": {
      "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgoebyi/",
      "text": "It sucks that it happened, and there isn’t really much you can do about it. All I can say is all of your efforts haven’t gone down the drain. You learned how to work hard and do well in school - that doesn’t end once you get into college. Become financially independent ASAP because who knows what other risky investments your parents may make. Remember, undergraduate schools don’t have a very large impact on life outcome. It’s still in your hands.",
      "author": "Pitsuh",
      "created": 1634257184,
      "upvotes": 27,
      "replies": {}
    },
    "hgoi2p0": {
      "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgoi2p0/",
      "text": "Oh god, that's terrible to hear! I hope you're keeping yourself safe and well, that kind of stress will really wreck anybody.\n\nI can understand that it's...very delicate with your parents at the moment, and you might want to back off on them for a while. It's really hard to get a good grasp on what to do when tensions are running super hot, so before you make any hard decisions I heavily recommend you take a few days to blow off some steam. The most important person right now (usually always) is you, and you should take care of yourself now. \n\nForget about the apps, get to them when you're better. You'll get into college all the same.",
      "author": "Vergilx217",
      "created": 1634258921,
      "upvotes": 7,
      "replies": {}
    },
    "hgojsxv": {
      "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgojsxv/",
      "text": "Won't your family's debt and lack of assets show up on your financial aid form though?",
      "author": "CarpetsAreTasty",
      "created": 1634259718,
      "upvotes": 17,
      "replies": {
        "hgox2au": {
          "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgox2au/",
          "text": "Not for a few years. For example, the 2022-2023 fafsa uses 2020 tax return data.",
          "author": "chickenfightyourmom",
          "created": 1634265729,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "hgoev3n": {
      "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgoev3n/",
      "text": "I'll say that going to college and ending up with less debt is ultimately the more financially safe option. Dream schools are great and all, but do not put yourself in debt just to afford it. It isn't worth it, and for many majors prestige matters not that much (finance/econ might be an exception). But I'm sure if you are doing pre-med or trying to get a nursing degree or anything else, then I think you will be fine no matter where you go.",
      "author": "leaf1598",
      "created": 1634257428,
      "upvotes": 21,
      "replies": {}
    },
    "hgqensr": {
      "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgqensr/",
      "text": "If your family has suffered a financial downturn since the tax year that the FAFSA is based on, you can make an appeal and use the most recent tax year. You will likely need to do that in early 2022 but you should start reaching out to Financial Aid offices now. This won't solve your problem completely, but it may put more schools back in play for you.",
      "author": "Ma22y",
      "created": 1634302537,
      "upvotes": 5,
      "replies": {}
    },
    "hgpf7qj": {
      "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgpf7qj/",
      "text": "That is fucked up.",
      "author": "l33tIsSuperpower",
      "created": 1634275557,
      "upvotes": 4,
      "replies": {}
    },
    "hgp4l0k": {
      "link": "/r/ApplyingToCollege/comments/q8c4vm/speechless_right_now/hgp4l0k/",
      "text": "Sorry about that, but they’re right. Welcome to the real world. I’d recommend applying to your top choices and the full ride schools and weighing ur options later. You probably shouldn’t stress too much right now there’s nothing you can do",
      "author": "shacksaw",
      "created": 1634269396,
      "upvotes": 4,
      "replies": {}
    }
  }
}