{
  "sid": "qh5snk",
  "link": "/r/ApplyingToCollege/comments/qh5snk/independent_study_on_transcript/",
  "title:": "independent study on transcript?",
  "text": "my school recently added a half a semester of health class as a requirement for juniors. i can't easily fit it into my schedule in my second semester, so i plan on taking it from november to january. however, the class is completely filled during that time period, although my counselor said it would still be possible take the class asynchronously (i'm virtual anyways), in which case it will appear as an independent study on my transcript.\n\ndoes an independent study look bad in this case? is it better to take the class asynchronously this semester, or overcrowd my schedule next semester to avoid that?",
  "author": "taylorm898",
  "created": 1635366494,
  "updated": 1635456388,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiar0zk": {
      "link": "/r/ApplyingToCollege/comments/qh5snk/independent_study_on_transcript/hiar0zk/",
      "text": ">does an independent study look bad in this case?\n\nNo. And no college cares about health class anyway, so long as you pass",
      "author": "skieurope12",
      "created": 1635369130,
      "upvotes": 1,
      "replies": {
        "hiasj6v": {
          "link": "/r/ApplyingToCollege/comments/qh5snk/independent_study_on_transcript/hiasj6v/",
          "text": "good to know! thanks for your input :)",
          "author": "taylorm898",
          "created": 1635369732,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hib6vuy": {
      "link": "/r/ApplyingToCollege/comments/qh5snk/independent_study_on_transcript/hib6vuy/",
      "text": "Unless there is something to definitively show that the course was an Independent Study (like at my high school we designate this with an IS but only for unique courses. In the case your describing we list it exactly like regular Health since everyone has to take it.)",
      "author": "BlaqOptic",
      "created": 1635375755,
      "upvotes": 1,
      "replies": {}
    }
  }
}