{
  "sid": "rfwoff",
  "link": "/r/ApplyingToCollege/comments/rfwoff/stop_opening_decisions_with_friends/",
  "title:": "Stop opening decisions with friends",
  "text": "especially if they’re also opening the same decision. like i want to bash you all for doing something so dumb but EVEN I DID IT. and i was so dumb for doing it lmao. like odds are someone is definitely not getting in. \n\nMy experience wasn’t applying to the same school but we were both opening questbridge match decisions. The other person opening was actually a stranger but some friends that were with me knew her so they asked her to join and I felt so bad once we opened it cause i screamed and celebrated and then i look over and she’s just disappointed. \n\nas for opening with friends/family there to just support, i never did that besides the match but I hear people always say how bad they feel with people around if they get deferred or rejected cause they feel awkward and the people want to comfort you and all you really want is to be left alone. \n\nIt’s up to y’all in the end but just some food for thought. Good luck!!!",
  "author": "sc-um-arleth",
  "created": 1639448398,
  "updated": 1639513420,
  "over_18": false,
  "upvotes": 249,
  "upvote_ratio": 1.0,
  "comments": {
    "hognr5t": {
      "link": "/r/ApplyingToCollege/comments/rfwoff/stop_opening_decisions_with_friends/hognr5t/",
      "text": "This!! Idk how to stress it but this is some pretty solid advice",
      "author": "angstrag",
      "created": 1639450091,
      "upvotes": 60,
      "replies": {}
    },
    "hoh36hf": {
      "link": "/r/ApplyingToCollege/comments/rfwoff/stop_opening_decisions_with_friends/hoh36hf/",
      "text": "If I get into my early school then I'm going to open them with my friends because the rest don't matter as much. Might even make a day of it, buy some cigars or something",
      "author": "Remarkable-Unit-3882",
      "created": 1639457472,
      "upvotes": 18,
      "replies": {}
    },
    "hoiyesa": {
      "link": "/r/ApplyingToCollege/comments/rfwoff/stop_opening_decisions_with_friends/hoiyesa/",
      "text": "Counterpoint: I was rejected to my ED with my best friend, and it was probably the best scenario for me. \n\nNot only was it really comforting being with my friend, but I actually had someone I could genuinely talk my mind to about it and just be myself around, even during so much immense disappointment. I honestly feel like if I didn’t have him it would’ve taken me much longer to come to terms and be satisfied with the outcome.",
      "author": "collegeapplicant021",
      "created": 1639498848,
      "upvotes": 4,
      "replies": {}
    },
    "hoj3gtl": {
      "link": "/r/ApplyingToCollege/comments/rfwoff/stop_opening_decisions_with_friends/hoj3gtl/",
      "text": "I wanted my family there, because I wanted someone to hug me if I got in, and hug me if I didn't.  \n\n\nSome people want emotional support regardless. I still think opening with friends is a risky gamble, but opening with family is pretty par for the course",
      "author": "IncompetentYoungster",
      "created": 1639500819,
      "upvotes": 3,
      "replies": {}
    }
  }
}