{
  "sid": "qxm0ki",
  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/",
  "title:": "Y'all want to go to schools you're going to hate",
  "text": "This is something I keep seeing, and it’s confusing and a little infuriating. So many of y’all are like “I must be miserable all throughout high school, and change myself into a person I’m not, to convince my dream college that I’m a great fit for their culture” \n\nLook, either you have what it takes to make it at a top school, or you don't. If you hate every aspect of the \"you\" that colleges want, why the hell do you think you'll like it there? Spoiler alert - you won’t. If you don’t like competitiveness, or thrive under academic pressure, it’s not going to magically change in college.\n\nSO many of you have this really weird victim complex, that you insist on mixing in with humble-bragging. Some of you throw in a little, subtle racism into there, which is not a great look. There’s also a LOT of classism/elitism, because you all seem to believe that only poor/lazy/stupid people’t go to T20’s. I’m not sure what you all want, other than to be praised and told that you’re a genius, but it’s really getting insane. One of you is literally willing to “settle” for BERKLEY.  Another one of y’all thinks only T20 schools are worth attending because they’re the only schools a degree matters from. Delusional. \n\nY’all need to get a fucking grip on yourselves, before you get to your “dream” college and realize you hate it, and that no one there wants to listen to your classist, elitist ass whine about how you hate it there too. ",
  "author": "IncompetentYoungster",
  "created": 1637345512,
  "updated": 1639804147,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.71,
  "comments": {
    "hlaah2q": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlaah2q/",
      "text": "I’m guessing this is about that recent rant post by an op who deleted their account, where they were complaining about having to “fake” themselves on apps to colleges over a probable misconception about what those colleges are looking for. \n\nWhile I think this post is a little harsh, I literally put two hobbies that didn’t amount to any awards or anything on my own apps so I agree with the general point here.",
      "author": "Lil-pants",
      "created": 1637346603,
      "upvotes": 7,
      "replies": {
        "hlactqn": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlactqn/",
          "text": "That, and a dude who went around telling people that no one would hire him if he didn't go to Harvard, or any of the countless, racially tinged rants about how they'll never get into college because they're white/Asian. \n\nI remember being stressed when applying for colleges. I don't remember being delusional. I think that's the difference, for me",
          "author": "IncompetentYoungster",
          "created": 1637347461,
          "upvotes": 6,
          "replies": {
            "hlbw0is": {
              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbw0is/",
              "text": "I think OP have an inferiority complex. It’s common to high schoolers when they’re applying to college because they are alway putting themselves low and the fear of rejection plays a huge role on their mentality. Surrounding by outstanding peers can be stressful too when people in your HS class got into ives and stuff. That and all the other reasons can contribute to the rant.",
              "author": "Zealousideal-Ad-1572",
              "created": 1637369683,
              "upvotes": 19,
              "replies": {}
            }
          }
        },
        "hldr2ey": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hldr2ey/",
          "text": "I have like 6 hobbies on my ECs list because of Covid, and I think only 1 of them amounted to anything really substantial.",
          "author": "DizzyMint2",
          "created": 1637413981,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hlaiii4": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlaiii4/",
      "text": "I hate how colleges like MIT, Harvard and Stanford want you to cure Cancer and establish the first connection with extra-terrestrial beings in order to get an acceptance letter.",
      "author": "fxi2",
      "created": 1637349506,
      "upvotes": 1,
      "replies": {
        "hlaygjw": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlaygjw/",
          "text": "ikr, its hard to believe that thousands of students do these kinds of things",
          "author": "CompetitiveTable1",
          "created": 1637355537,
          "upvotes": 1,
          "replies": {
            "hlbijjm": {
              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbijjm/",
              "text": "It's because thousands of students don't",
              "author": "IncompetentYoungster",
              "created": 1637363770,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "hlbdm2b": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbdm2b/",
          "text": "They absolutely do not.",
          "author": "IncompetentYoungster",
          "created": 1637361726,
          "upvotes": 28,
          "replies": {}
        },
        "hlb4tqe": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlb4tqe/",
          "text": "The worst part it that high school students actually believe this is accurate.\n\nOr can you point to an admission page where this is stated?",
          "author": "RichInPitt",
          "created": 1637358087,
          "upvotes": 33,
          "replies": {}
        },
        "hlbelfe": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbelfe/",
          "text": "if all my classmates can cure cancer why have none of them cured the strange flu that’s been going around the entire campus for like 3 months now.",
          "author": "sc-um-arleth",
          "created": 1637362134,
          "upvotes": 13,
          "replies": {}
        },
        "hlbi954": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbi954/",
          "text": "45% of Harvard admissions are kids of big donors, legacies, or kids of staff members.",
          "author": "lurker_cx",
          "created": 1637363646,
          "upvotes": 10,
          "replies": {
            "hlbjajd": {
              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbjajd/",
              "text": "Now now it’s a good chunk of admissions sure but not nearly half\n\nYou may be citing a poll by the Crimson that errantly recorded the number",
              "author": "Lil-pants",
              "created": 1637364092,
              "upvotes": 6,
              "replies": {
                "hlbku1s": {
                  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbku1s/",
                  "text": "Maybe I am, but the basic point stands....unless you have some fact check.... many articles over the years.... \n\n> 43% of white students were legacy, staff or athletes. https://slate.com/business/2019/09/harvard-admissions-affirmative-action-white-students-legacy-athletes-donors.html\n\n> Harvard freshman class 36% legacies. \nhttps://www.cnbc.com/2019/04/07/harvards-freshman-class-is-more-than-one-third-legacy.html",
                  "author": "lurker_cx",
                  "created": 1637364745,
                  "upvotes": 2,
                  "replies": {
                    "hlbljwn": {
                      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbljwn/",
                      "text": "43% of white students ≠ 43% of all students.\n\nThe cnbc article cites the Crimson poll which had incorrect numbers. If you click on it now, the number reported is wayyyy smaller, and they admit they messed up. It’s like closer to 20%. Which means that you’d consider the vast majority of students to be “qualified.”\n\nBut that also forgets that even legacies, donors, and athletes can be “qualified.”",
                      "author": "Lil-pants",
                      "created": 1637365051,
                      "upvotes": 14,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hla9oe7": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hla9oe7/",
      "text": "Wait who?",
      "author": "Reddit_Crusher",
      "created": 1637346307,
      "upvotes": 1,
      "replies": {}
    },
    "hlasxj5": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlasxj5/",
      "text": "I think I mostly agree with about if you have to fake your personality completely you won't like it when you're there, especially if \"you don’t like competitiveness, or thrive under academic pressure.\" However, I would argue there are other things a college application looks for that doesn't necessarily reflect with how much you'll be happy at a college.\n\nFor example, college essays seem to want you to exhibit some personal growth, overcoming challenges, and do something that stands out from other applicants. However, I assume many people are like me where they haven't changed much as a person their whole life, have had a stable life and their greatest challenges just makes them sound spoiled, and even if they perform above average in their interests it's still in a saturated subject like cs that doesn't stand out. \n\nIt feels like I have to overdramatize such things in my life and look more quirky, when really I think those things have nothing to do with how much I'll like the competitive academics and being around others that enjoy being challenged with advanced concepts.",
      "author": "weakcper",
      "created": 1637353412,
      "upvotes": 4,
      "replies": {
        "hlausry": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlausry/",
          "text": "I think you’re pointing towards the most major misconception people have about college admissions. You don’t need to have done anything super impressive in your life at all. You can talk about very small things in your essays. And you can put small hobbies that make you happy on your app even if they don’t win awards. \n\nWhile you want to make your essays interesting to read, there doesn’t need to be a giant revelation at the end or anything. And college is so much more than just challenging academics. All colleges have challenging academics; it’s in the community space that they greatly vary. So presenting your personality is important of course. But you also don’t need to force yourself to be quirky.",
          "author": "Lil-pants",
          "created": 1637354126,
          "upvotes": 1,
          "replies": {
            "hlc6pi7": {
              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlc6pi7/",
              "text": "This isn't exactly what I mean. Specifically for me, I'm pretty studious and like doing academic contests. However, an essay about how I studied hard for some cs contest doesn't make for a very interesting read, but things like that are the most important thing in my life currently.\n\nHaving to write about the \"small things\" is the problem, I watch youtube and other normal past times, but those are not what I'd say makes me who I am, and I have no other past times that make me stand out. \n\nI don't think not having quirky hobbies will make me not get along with people at a college, and I'd want to collaborate with my peers on the academic things I enjoy, but those things don't make for good essay topics.",
              "author": "weakcper",
              "created": 1637374669,
              "upvotes": 11,
              "replies": {
                "hlc9m9w": {
                  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlc9m9w/",
                  "text": "Honestly, you could probably make an essay about the cs contest interesting. Or think about if those 'normal' interests are actually that 'normal.'\n\nBut also people have written about their family, friends, one-off events, even food. You can literally write a good essay about anything. It's more about the approach than the topic.",
                  "author": "Lil-pants",
                  "created": 1637376082,
                  "upvotes": 10,
                  "replies": {
                    "hlg6tbm": {
                      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlg6tbm/",
                      "text": "I didn’t know your personal statements could be a subject about literally fucking anything, I thought it had to be about this one difficult time in your life and how you overcame it through X and Y & Z. Is this true?",
                      "author": "thecoolan",
                      "created": 1637453976,
                      "upvotes": 2,
                      "replies": {
                        "hlg6xmx": {
                          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlg6xmx/",
                          "text": "I mean if there’s a specific prompt that says you should write about a difficult time, then you follow the prompt. But for the standard common app essay it could basically be anything.",
                          "author": "Lil-pants",
                          "created": 1637454033,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hlcbad9": {
                  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlcbad9/",
                  "text": "I'm in the same situation as you. I have no other thing to write beside how I grind and taught myself CS. rn I'm thinking writing about using code to solve world problem like the environment, but still kinda academical...",
                  "author": "codicate",
                  "created": 1637376941,
                  "upvotes": 3,
                  "replies": {
                    "hlcwtl1": {
                      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlcwtl1/",
                      "text": "Actually, you might be able to write a very effective as they talking about how you’re looking back over your high school career and realizing you’d like a little more balance in the next four. That you’re looking forward to getting to college where you can explore stuff you’ve never tried.",
                      "author": "FeatofClay",
                      "created": 1637389629,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlb2c72": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlb2c72/",
      "text": "i can’t hear you😌",
      "author": "natural_locality",
      "created": 1637357086,
      "upvotes": 1,
      "replies": {}
    },
    "hlam8x9": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlam8x9/",
      "text": "Yeah a lot of kids don’t understand that a college is supposed to fit THEM, not them squeezing themselves to fit into a college (i.e kids applying to all 8 ivies when theyre all wildly different)\n \nAlso, HEAVY on the subtle racism and humble bragging 😩",
      "author": "Any-Fox-9615",
      "created": 1637350891,
      "upvotes": 208,
      "replies": {
        "hlbdbtp": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbdbtp/",
          "text": "Some of it is less subtle than others, to be fair",
          "author": "IncompetentYoungster",
          "created": 1637361608,
          "upvotes": 47,
          "replies": {}
        }
      }
    },
    "hlbexzm": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbexzm/",
      "text": "This is somewhat tangential but thank you so much for posting this. I've been struggling with writing my essays but after reading this I realized that I can just write about myself, and if the school doesn't like me then maybe they're not the right fit for me. I would give you an award but I'm broke lol",
      "author": "marshmallowbake",
      "created": 1637362277,
      "upvotes": 140,
      "replies": {
        "hlbic3f": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbic3f/",
          "text": "I'll give you the word of advice I gave my sister - what colleges want to see is growth. Doesn't have to be born of immense struggle, but connect whatever growth you underwent to how you'll be better prepared to thrive in college",
          "author": "IncompetentYoungster",
          "created": 1637363681,
          "upvotes": 66,
          "replies": {
            "hlg5yii": {
              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlg5yii/",
              "text": "growth like I only did ECs starting in Junior year",
              "author": "thecoolan",
              "created": 1637453567,
              "upvotes": 3,
              "replies": {
                "hlggj33": {
                  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlggj33/",
                  "text": "Personal growth. Even if it’s just like “I learned how to learn” or “I learned how to communicate better due to a misunderstanding with my friends”",
                  "author": "IncompetentYoungster",
                  "created": 1637458635,
                  "upvotes": 3,
                  "replies": {
                    "hlgwbdm": {
                      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlgwbdm/",
                      "text": "My stuttering is not bad anymore",
                      "author": "thecoolan",
                      "created": 1637466765,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlbkhft": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbkhft/",
      "text": "I did what I enjoyed in high school, applied to the U.S. T20s, got cleanly rejected from all of them, and I'm having the time of my life at university now. This is some harsh language, but it's a fair message. If you loathe what you did to get into a school, you might not enjoy the environment there either... you'll do a lot better if you listen to your heart and pick the place that you'll genuinely enjoy attending as opposed to whatever place is most prestigious. (And if those two happen to overlap, that's fine too, but make sure that it's genuine.)",
      "author": "firecomet234",
      "created": 1637364600,
      "upvotes": 37,
      "replies": {}
    },
    "hlb2vb1": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlb2vb1/",
      "text": "This.\n\nCannot agree less, thank you OP. Idk whether those ppl are humble bragging, which is annoying, or being truthful, which need to get a grip. You work hard to get into college because you love that college, and want to work hard there, not because you are in 95th percentile and are somehow obligated to live a miserable life in top 20s.  Be fucking true to yourself, don't work your ass off just to live miserably in four years. If you find it necessary to fake yourself just to get in, then you don't belong there. You more likely than not will suffer throughout the entire process, which is not worth it.",
      "author": "Katsura_Do",
      "created": 1637357298,
      "upvotes": 33,
      "replies": {}
    },
    "hlbf0ly": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbf0ly/",
      "text": "This is 100% true. My son applied to some fairly prestigious schools and a couple of small schools/campuses. I've been pushing the idea of choosing the place he thinks he could actually enjoy living for 4 years!",
      "author": "Philosophy_Exact",
      "created": 1637362307,
      "upvotes": 20,
      "replies": {
        "hldy6sa": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hldy6sa/",
          "text": "Absolutely the same! Have a son who, like so many others is a high achiever and has applied to some top schools. Those are total wildcards and he knows this. Being rejected from them just narrows the decision process and says NOTHING about who he is and what he will become. I will say this- I’m wary of one prestigious school that he’s applied to. If I don’t think he’ll thrive there and be happy- I’m not paying for it. I don’t want him suffering for 4+ years no matter how many people are banging on the door to get in. I don’t care what name is on the gates if it isn’t a fit- don’t go there.",
          "author": "ZuzuBish",
          "created": 1637418052,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hlc4is1": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlc4is1/",
      "text": ">One of you is literally willing to “settle” for BERKLEY. \n\nSeriously. I saw that post and was waiting for someone to comment on that but NOBODY DID",
      "author": "RightWhereY0uLeftMe",
      "created": 1637373610,
      "upvotes": 21,
      "replies": {}
    },
    "hlc074u": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlc074u/",
      "text": "and then they make fun of me for wanting to go to an SEC😭 like sorry I’m gonna enjoy my college years and be surrounded by people I enjoy being with",
      "author": "jesustpwk",
      "created": 1637371593,
      "upvotes": 11,
      "replies": {}
    },
    "hlbxobr": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbxobr/",
      "text": "Even if you love competition and thrive in it, T20 schools should STILL be looked at with your eyebrows raised. I mean do you really wanna work 8-12 hours a day on fucking academics?\n\nMost people here doing hard shit probably want out, and here they are applying to a T20.",
      "author": "NarutoDragon732",
      "created": 1637370438,
      "upvotes": 11,
      "replies": {
        "hlbzppm": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbzppm/",
          "text": "That makes no sense. If you love competition and thrive in it, you should want to be more successful than the people around you. Although this may not be true in college if you go t a T20, going to a T20 makes it easier to become more successful later on in life. And 8-12 hours is a gross exaggeration, as the people I know who are currently getting engineering degrees from difficult schools such as CalTech/MIT are only studying about 3 hours a day on average, although this number ramps up close to assessments but also drops during off-times. It is not really that much work tbh.",
          "author": "CaterpillarTrue",
          "created": 1637371367,
          "upvotes": -5,
          "replies": {
            "hlc2ct5": {
              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlc2ct5/",
              "text": "3 hours a day on average...? Definitely not what my friends have been saying at MIT. Or anyone on this sub for that matter. Either they're geniuses among geniuses, or aren't involved in a  whole lot.",
              "author": "NarutoDragon732",
              "created": 1637372592,
              "upvotes": 10,
              "replies": {
                "hlcdd5x": {
                  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlcdd5x/",
                  "text": "I mean... It might just be because I go to a good high school, but usually they say their intro courses (not the higher level stuff obviously) are similar in intensity and grading as our courses in high school.",
                  "author": "CaterpillarTrue",
                  "created": 1637378008,
                  "upvotes": -4,
                  "replies": {
                    "hlcdu7o": {
                      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlcdu7o/",
                      "text": "And I go to an IB school, friends still don't share that same experience...",
                      "author": "NarutoDragon732",
                      "created": 1637378257,
                      "upvotes": 2,
                      "replies": {
                        "hlci7tj": {
                          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlci7tj/",
                          "text": "IB vs AP doesn't make much difference. Ig it depends on whether it is a good magnet/private/rich town public vs something else",
                          "author": "CaterpillarTrue",
                          "created": 1637380607,
                          "upvotes": -6,
                          "replies": {
                            "hlck9bu": {
                              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlck9bu/",
                              "text": "Ib is leagues ahead of AP lmao what're on on about.",
                              "author": "NarutoDragon732",
                              "created": 1637381732,
                              "upvotes": 1,
                              "replies": {
                                "hlckhqb": {
                                  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlckhqb/",
                                  "text": "The actual test sure, but most good high schools teach way beyond the AP curriculum. I assume the similar is true for IB, and it cannot be the case that IB students go way more in-depth, as apparently they struggle with intro courses even though all the material should have already been taught.",
                                  "author": "CaterpillarTrue",
                                  "created": 1637381859,
                                  "upvotes": -2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hldul1d": {
              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hldul1d/",
              "text": "Sophomore at Swarthmore here and I’d say pretty much studying is all day, every day. Not exactly mandatory or required, but the workload is very intense and then include other personal passions and the like and working and all and it gets up there.",
              "author": "Woshibenben",
              "created": 1637416084,
              "upvotes": 4,
              "replies": {
                "hlehw27": {
                  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlehw27/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1637427060,
                  "upvotes": -2,
                  "replies": {
                    "hlejan0": {
                      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlejan0/",
                      "text": "I need 1 more credit besides a thesis to finish the linguistics major. I really enjoy the subject and self study a lot, and other subjects too of course, and spend a lot of time doing that because I enjoy it, and I think that’s a sentiment a lot of swatties share. I just picked up CS, so I’m not even close to finishing that major, but again it’s just stuff I like to study in my spare time",
                      "author": "Woshibenben",
                      "created": 1637427626,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlb7gaf": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlb7gaf/",
      "text": "That’s exactly what I think. That’s why I resigned from applying to some ivies for example. It’s just not for me. I want to be surrounded by people similar to me. I don’t want to pretend that I am someone else. I wanted to go to Princeton but for what actually? I just wanted the money and the status but then I fell in love with University of Arizona and University of Richmond. I will be applying to them. I really want to enjoy my life a little bit and not try to get an internship, start a business, and overall do things that I don’t like. I enjoy just sitting in front of my computer and doing some stupid, useless things in Vpython, watch some videos about new telescopes, and watch old animated movies and then cry myself to sleep. That’s who I am and I don’t want to lose it because of the college admission process.",
      "author": "RAtararatara",
      "created": 1637359145,
      "upvotes": 29,
      "replies": {
        "hlbekf9": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbekf9/",
          "text": "Absolutely. I'm not saying \"don't apply to Ivies, or any other T20\", because there will be some people that vibe at Ivies. But if you're creating an entire fake persona to be likable to colleges, you're gonna be keeping that up for the next four years of your life, and you are going to be MISERABLE",
          "author": "IncompetentYoungster",
          "created": 1637362123,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "hlb9xvu": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlb9xvu/",
      "text": "it’s super sad because i feel like my environment has influenced me to believe that i have to do the absolute most to get into college.\n\nmy hs has made me burnout like no other, while i have lost nearly 30 pounds unintentionally. i get no sleep and my grades are slipping. i hate it here.",
      "author": "EmotionalShame9654",
      "created": 1637360184,
      "upvotes": 20,
      "replies": {
        "hlddtqv": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlddtqv/",
          "text": "I’m so sorry to hear that. I hope that it will get better soon and that later you will meet people who support you",
          "author": "RAtararatara",
          "created": 1637403887,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlc9v9j": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlc9v9j/",
      "text": "Meanwhile I, a fully paid for Mexican with a 1580 SAT, rejoicing because of my brownness. Seriously I don’t care if “qualified” people don’t get to go to a certain colleges. They have the right to pick whomever they want, for whatever reason. I know I’m not going to a T50, because my gpa is 3.2, and I’m cool with that. People need to stop pretending that they’re not the reason for their rejection. If you want to go to a certain college, do better. Or don’t, and quit whining lol.",
      "author": "AlexGonzalezLanda",
      "created": 1637376207,
      "upvotes": 8,
      "replies": {
        "hlpjhzm": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlpjhzm/",
          "text": "“They have the right to pick whomever they want, for whatever reason.” Are you saying that’s how things actually are or how you think they should be? Or both? Because it isn’t actually true (legally) and I don’t see why anyone would want it to be. Can you explain?",
          "author": "LazyCondition0",
          "created": 1637628192,
          "upvotes": 1,
          "replies": {
            "hlplegd": {
              "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlplegd/",
              "text": "I firmly believe that private entities should have a say in who they associate with, and the government has no business interfering with that decision. If we extend this to colleges, govt should not regulate the admissions process.",
              "author": "AlexGonzalezLanda",
              "created": 1637629100,
              "upvotes": 1,
              "replies": {
                "hlpm3k0": {
                  "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlpm3k0/",
                  "text": "Just so I understand, you’re saying private colleges should be allowed to refuse to admit students of certain races, religions, ethnicities, categorically? Like literally be able to have a policy: Whites Only or No Jews Allowed. Just want to understand what you mean exactly.",
                  "author": "LazyCondition0",
                  "created": 1637629430,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlcbpet": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlcbpet/",
      "text": "It’s important to note the term “T20” is subjective as fuck and pretty much only high schoolers in this subreddit seem to care about it. Unpopular opinion, but I think the term shouldn’t even exist. One list may rank a school T10 but another list may rank them T50. It doesn’t mean there’s a right or wrong, it’s just different criteria and different methodologies of trying to assess and measure the quality of hundreds of billion dollar institutions in different ways. If you tried telling someone in the Bay Area that Berkeley wasn’t a T10, they’d probably just stare at you and laugh. Same thing would happen if you said the same thing about Cornell to someone from NY. \n\nWhat arguably matters more is how good a school’s individual department is and the fit of a school rather than the “universal” or “industry standard” US News and World Report national ranking that employers or literally anyone outside of this sub don’t even know exists or gives a single shit about.",
      "author": "throwawayzbc227",
      "created": 1637377152,
      "upvotes": 7,
      "replies": {}
    },
    "hlbl7ey": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbl7ey/",
      "text": "Yup, this 100%. I remember last year I said I was making a documentary on my college process, and I’m still going to make but it but I’ve been pretty busy with ya know, COLLEGE and a few other personal things. But I know that I really wanted to share the message that not everyone is shooting for T20s, and that’s okay if you’re not. It’s okay if you’re goal is just to go to college. It’s okay if you decided to go to your second or third choice. It’s okay to be rejected.\n\nI was shooting for UT Austin. I didn’t even get to apply because of my schools transcript system. I was bummed yeah but the more I looked at it, the more I realized that wasn’t the school for me. I’m at UNT now, I have an amazing roommate and have found so many opportunities here. It’s not just about where your degree is from, it’s about how you use it, who you network with, what your experience is. Don’t try to fit yourself into a mold you don’t fit in. Work hard but have fun in high school, it’s the youngest you’ll ever be.",
      "author": "snailgoblin",
      "created": 1637364903,
      "upvotes": 5,
      "replies": {
        "hlbojfi": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbojfi/",
          "text": "Go mean green! Enjoy your time there.\n\nClark Hall 1987-1989.\n\nAlso, there are plenty of career opportunities for people with a degree in Emergency Administration and Planning if you're into emergency preparedness, public health management, nuclear security, and more. UNT was the first school in the United States to offer an undergraduate degree in emergency management.",
          "author": "Calvin-Snoopy",
          "created": 1637366347,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlcn15v": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlcn15v/",
      "text": "Yeah that’s why the hardest school I’m applying to is USC the rest are lesser known schools with film programs but I really don’t want to be loaded with a bunch of work. I just want to hone my skill and get into my industry.\n\nMy mom insists that I’d only ever make it in film if I go to a ivy however 😒.",
      "author": "DiegoFuego13",
      "created": 1637383314,
      "upvotes": 5,
      "replies": {
        "hlhfiiv": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlhfiiv/",
          "text": "I wish you luck💛🍀",
          "author": "RAtararatara",
          "created": 1637479081,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlb3mlt": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlb3mlt/",
      "text": "Damn how do I figure out what school I’d be happy at",
      "author": "MLGSwaglord1738",
      "created": 1637357605,
      "upvotes": 3,
      "replies": {
        "hlbfk7a": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbfk7a/",
          "text": "Lots and lots of college visits. Including visits to the dorms and a serious discussion about social life/clubs on campus.",
          "author": "Philosophy_Exact",
          "created": 1637362531,
          "upvotes": 9,
          "replies": {}
        },
        "hlbnz9j": {
          "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlbnz9j/",
          "text": "Follow their social media posts and watch their YouTube videos to see if the people in the pictures/videos look like people you'd want to hang out with. See what kind of clubs and activities they do that you would like.",
          "author": "Calvin-Snoopy",
          "created": 1637366099,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlc9n0u": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlc9n0u/",
      "text": "but what if i go to a party school.\n\n:)",
      "author": "FrogsDoBeCool",
      "created": 1637376093,
      "upvotes": 3,
      "replies": {}
    },
    "hlf0k6v": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlf0k6v/",
      "text": "Whew! Speak on it!!!",
      "author": "blue_surfboard",
      "created": 1637434869,
      "upvotes": 3,
      "replies": {}
    },
    "hlh4aj7": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlh4aj7/",
      "text": "Yes, being an elite is only going to get you so far in life. No reason to be a jerk because you have money, are super smart and went to private schools. Not every person in your dream career has a degree. \n\nThink of things this way: every rejection is a blessing. \n\nIt means that you weren’t a good fit for some reason or another. There is no reason for anyone to hate life because you just had to go to snooty mcsnooty school and get x degree to make a million dollars. There is more to life than that.",
      "author": "Slackermombie",
      "created": 1637471420,
      "upvotes": 2,
      "replies": {}
    },
    "hlc0tsg": {
      "link": "/r/ApplyingToCollege/comments/qxm0ki/yall_want_to_go_to_schools_youre_going_to_hate/hlc0tsg/",
      "text": "I see much more posts complaining about asshole/classist/elitist people than I do posts from asshole/classist/elitist people",
      "author": "Silverdragon246",
      "created": 1637371885,
      "upvotes": 3,
      "replies": {}
    }
  }
}