{
  "sid": "qtjnb2",
  "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/",
  "title:": "\"Doesn't matter where you go to college\"",
  "text": "I have a relative who's a senior in high school. He's nominally a good student (98 average sophomore year, \\~1300 SAT IIRC) but his school is not great. Junior year, he got two 1s, two 2s, and a 3 on his AP exams. He was in online school because of Covid all year, so that didn't help, but it seems like the results are consistent with bad teaching and him not putting in the effort.\n\nAnyways, his mom's family have convinced him that it doesn't matter where he goes to college. Apparently they have some family friends who went to a T20 school and are unemployed/marginally-employed. From this he has extrapolated (or someone has convinced him) that people who go to good schools actually do worse in their lives.\n\nHis dad is uncomfortable pushing him to take a broader view. He doesn't want to spend his limited time with him fighting over this. And his dad has his own baggage - he was pushed too hard when he was a kid, and ended up drinking/smoking weed/failing out of college, so he wants to let his kid \"make his own mistakes.\"\n\nSo the kid has decided to go to a mediocre state school that is well below where his peers in high school (with similar grades/SATs) would go. He told us that he doesn't want any debt, and he can get a scholarship from this mediocre school. His grandparents offered to pay for him to go to a better college, and he turned them down. (This meant so much to them. they were essentially willing to postpone retirement in order to pay for it, not sure he knew that.) I don't think whatever scholarship he might get is more than a fraction of total overall costs, so I dispute the debt argument in general.\n\nHe has a part-time job and he says he is too busy because of the job to apply to any other schools. His grandparents said if he quit his job and focused on schoolwork, they would pay him what he makes at it, and he again refused.\n\nNow it turns out that (in addition to the mediocre school) he is applying to two T20 schools with extensive applications that he has absolutely no shot at (and would put him in massive debt). But he won't add any state schools to his application - even though they use a common application and he just needs to check a box to apply.\n\nIt has been painful watching this, but nobody seems to be able to convince him to at least apply to some better schools that are within reach.",
  "author": "miserablethrowaway20",
  "created": 1636870584,
  "updated": 1637180331,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.73,
  "comments": {
    "hkkzvar": {
      "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hkkzvar/",
      "text": "Going somewhere less selective in order to save money is totally reasonable, even if you’re saving someone else’s money.\n\nAlso, I’m not sure I’d blame his AP performance primarily on poor teaching. To me, it suggests that if he were to get into a T20 he might not be able to handle it.",
      "author": "jayphoward",
      "created": 1636894701,
      "upvotes": 7,
      "replies": {
        "hklfdf9": {
          "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hklfdf9/",
          "text": "He could live at home and save everyone even more money! There are better colleges within commuting distance if that's what he's worried about. But he wants to go away to college. I think it's a red herring - his overall application isn't great (plays one sport, works part-time, no other extra-curriculars), so I think the scholarship is a bit of a fantasy.",
          "author": "miserablethrowaway20",
          "created": 1636902611,
          "upvotes": -2,
          "replies": {
            "hklhkee": {
              "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hklhkee/",
              "text": "True, but nobody wants to live with their parents while in school.  His mind set might be, \"I definitely want to move out of my parents' house, but, beyond that, I'd like to spend as little as possible.\"\n\nEven if he is not in line for any merit scholarships or financial aid, then full-price in-state tuition at a public school is almost certainly going to cost less than a private.",
              "author": "jayphoward",
              "created": 1636903608,
              "upvotes": 7,
              "replies": {
                "hkoqrik": {
                  "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hkoqrik/",
                  "text": "Heh, I think half the kids in my high school class lived at home with their parents in college. At any rate, I'm just saying he should apply to a better public school that will be the same price.",
                  "author": "miserablethrowaway20",
                  "created": 1636954153,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkl1dqu": {
      "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hkl1dqu/",
      "text": "i will say that most top 20s will have good financial aid, but i don't really think he'd be accepted if he has nothing special. his sat score isn't that high (it's good, but not amazing) and his ap exam scores are quite low, which could indicate that he may not do too well at top colleges. lots of state schools have great financial aid AND resources, so just be honest with him.\n\nI'm kinda confused though.. he went from only wanting to apply to a mediocre state school and not t20s to applying to t20s and not state schools?",
      "author": "pauliticks",
      "created": 1636895600,
      "upvotes": 2,
      "replies": {
        "hklfhcl": {
          "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hklfhcl/",
          "text": "He's still applying to the mediocre state school. And he added two T20s instead of other schools he has a shot at.",
          "author": "miserablethrowaway20",
          "created": 1636902663,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkkau73": {
      "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hkkau73/",
      "text": "Sounds like a hard situation.  \n\nI think looking at the differences in graduation rates and at salary data for grads in the field they want to study can sometimes be helpful when comparing regional state schools to say a state flagship -- better than anecdotes and online rankings anyway. Sometimes the differences are minor and the cheaper option does just fine - other times that cheaper option is one where less than half the students graduate.\n\n[https://collegescorecard.ed.gov](https://collegescorecard.ed.gov) is a good source for both those kinds of data.  Net price calculators are worth spending time on too - it's hard to know what a school will actually cost you without them.  Ultimately it's his choice though.",
      "author": "BrawnyAcolyte",
      "created": 1636876701,
      "upvotes": 2,
      "replies": {}
    },
    "hklpjx9": {
      "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hklpjx9/",
      "text": "It would seem that the student has definitely \"dug in\" and any more pressure to convince him otherwise will only lead to frustration and alienation. ..if it has not already.",
      "author": "Radiant-Chipmunk-987",
      "created": 1636907092,
      "upvotes": 1,
      "replies": {}
    },
    "hknlqz5": {
      "link": "/r/ApplyingToCollege/comments/qtjnb2/doesnt_matter_where_you_go_to_college/hknlqz5/",
      "text": "The plural of anecdote is not data.\n\nAt the same time, success metrics have very wide variances. Driven people can succeed very well with less-than-elite educations. And Ivy-educated students can certainly fail",
      "author": "RichInPitt",
      "created": 1636934108,
      "upvotes": 1,
      "replies": {}
    }
  }
}