{
  "sid": "qpa5w4",
  "link": "/r/ApplyingToCollege/comments/qpa5w4/my_parents_getting_excited_over_my_ed_now_im/",
  "title:": "My parents getting excited over my ED, now i'm worried of not get accepted",
  "text": "Applied ED to Syracuse U. Now my family keeps on doing research about Syracuse and how nice it'll be to go there and how much fun i'll have. Even i've been doing extra research even though I already know i'll like it there. Basically we are all hyping up Syracuse. But what if I get denied, all that hype for nothing. man...",
  "author": "DizzyMint2",
  "created": 1636364226,
  "updated": 1636653967,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hjsbpf2": {
      "link": "/r/ApplyingToCollege/comments/qpa5w4/my_parents_getting_excited_over_my_ed_now_im/hjsbpf2/",
      "text": "Same, but I am applying to Columbia. Also found amazing opportunities and already planned everything from transporting my goods to America to where I would live, eat, and do sport, but the chance of getting admitted is miniscule for me as I am an international. Probably it is not the right way to put so much emphasis on one university to not be disappointed when you get rejected.",
      "author": "tynecogyrec",
      "created": 1636364759,
      "upvotes": 7,
      "replies": {
        "hjtetdk": {
          "link": "/r/ApplyingToCollege/comments/qpa5w4/my_parents_getting_excited_over_my_ed_now_im/hjtetdk/",
          "text": "Same, but Vanderbilt. We will make it 😎",
          "author": "Kevin_2112",
          "created": 1636387359,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjsk94s": {
      "link": "/r/ApplyingToCollege/comments/qpa5w4/my_parents_getting_excited_over_my_ed_now_im/hjsk94s/",
      "text": "I applied ED to Syracuse too! Don't worry, we're in the same boat lol. I've talked to current students to relieve my stress. What are you majoring in?",
      "author": "Triggyrd",
      "created": 1636371832,
      "upvotes": 2,
      "replies": {
        "hjslsdp": {
          "link": "/r/ApplyingToCollege/comments/qpa5w4/my_parents_getting_excited_over_my_ed_now_im/hjslsdp/",
          "text": "Im majoring in architecture, so above all else im worried bout my portfolio.",
          "author": "DizzyMint2",
          "created": 1636372927,
          "upvotes": 2,
          "replies": {
            "hjsq2h8": {
              "link": "/r/ApplyingToCollege/comments/qpa5w4/my_parents_getting_excited_over_my_ed_now_im/hjsq2h8/",
              "text": "ohh, im sure you'll be okay! have you shown demonstrated interest?",
              "author": "Triggyrd",
              "created": 1636375648,
              "upvotes": 2,
              "replies": {
                "hjsql7r": {
                  "link": "/r/ApplyingToCollege/comments/qpa5w4/my_parents_getting_excited_over_my_ed_now_im/hjsql7r/",
                  "text": "Not really 😭. Ive tried to join workshops and seminars from SU but everytime one comes up, its at like 5 in the morning or during school time for me. (I live on the other side of the world from America)",
                  "author": "DizzyMint2",
                  "created": 1636375955,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hjwdki8": {
              "link": "/r/ApplyingToCollege/comments/qpa5w4/my_parents_getting_excited_over_my_ed_now_im/hjwdki8/",
              "text": "architecture portfolio for undergraduate admission are just a small piece of your whole application.  in fact, many architecture faculty don't know how to evaluate UG portfolios anyways since they usually don't contain architecture studio materials as that of a graduate school portfolio.  You should be fine.  schools don't expect you to have designed buildings or construction document experience or anything like that.  rather they want to know more about your visual art interests: hand sketches, drawings, paintings, photography, graphic arts, sculptures, etc. These are just some examples that are used to assess your design sensibilities.",
              "author": "jojothebigcat",
              "created": 1636432744,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}