{
  "sid": "re2gbb",
  "link": "/r/ApplyingToCollege/comments/re2gbb/the_quiet_scandal_of_college_teaching/",
  "title:": "The Quiet Scandal of College Teaching",
  "text": "This was a decent read, by Jonathan Zimmerman, a Prof. of the History of Education at Penn.\n\n[https://libertiesjournal.com/articles/the-quiet-scandal-of-college-teaching/](https://libertiesjournal.com/articles/the-quiet-scandal-of-college-teaching/)\n\nStarts by describing a conference that took place in 1925 decrying the state of university education.  Professors not teaching, classes taught by TAs (\"section men\"), students wondering at what the point was.  He then highlights four ways in which (in his opinion) modern universities are failing students:  failing to incentivize faculty to teach well, failing to train faculty (and graduate students) to teach well, relying on itinerant adjunct faculty, and restricting speech in the classroom.\n\nSome A2C posters may disagree with this sentence:\n\n*Surely, college should be about something more than a four-year  party that sets you up for a decent-paying job; it should improve the  way you think, by exposing you to rigorous and imaginative instruction  in the classroom.*\n\nThis, arguably, is the rationale for attending a LAC.",
  "author": "jayphoward",
  "created": 1639237769,
  "updated": 1639515194,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.94,
  "comments": {
    "ho4rl0k": {
      "link": "/r/ApplyingToCollege/comments/re2gbb/the_quiet_scandal_of_college_teaching/ho4rl0k/",
      "text": "I..... wanna attend a LAC now",
      "author": "ssssseabass",
      "created": 1639237970,
      "upvotes": 2,
      "replies": {
        "ho4wdvw": {
          "link": "/r/ApplyingToCollege/comments/re2gbb/the_quiet_scandal_of_college_teaching/ho4wdvw/",
          "text": "On his fourth point, though, LACs are not necessarily any better.  But (in theory) they do at least incentivize better teaching.\n\nOne thing I tried to do (at a large state school) is utilize my priority enrollment status (via honors program) to cherry pick sections of classes w/ the most well-liked instructors.  At least, for classes where there were multiple sections to choose from.",
          "author": "jayphoward",
          "created": 1639240065,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho6dtbw": {
      "link": "/r/ApplyingToCollege/comments/re2gbb/the_quiet_scandal_of_college_teaching/ho6dtbw/",
      "text": "I don’t disagree with the statement.\n\nI disagree that this can only happen at a school that hangs a “LAC” label on the wall, despite what ”LAC”s like to beleive. CMU was certainly not a “four-year party”.",
      "author": "RichInPitt",
      "created": 1639263187,
      "upvotes": 2,
      "replies": {}
    }
  }
}