{
  "sid": "qf6z22",
  "link": "/r/ApplyingToCollege/comments/qf6z22/college_recommendations/",
  "title:": "College recommendations",
  "text": "Currently a Junior in hs, planning on majoring in something like math/econ/physics or maybe like journalism or architecture\n\nHave a 94.5 UW GPA currently, think I can probably improve it to maybe 95 or 96.\n\nAll APs and Honors classes. Took one ap sophmore year, 6 this year, and 6-8 next year. I think I'm a pretty good test taker, so I think I can get mostly 4s and 5s maybe a few 3s.\n\nHaven't taken the SAT yet, but I'm fairly confident I can get a 1500, aiming to get 1550 though.\n\nPretty lacking in ECs and awards. For ECs I'm doing MUN (mostly for fun, no awards) scioly, lots of volunteering, hoping to start tutoring this year, quiz bowl, math club, want to do some summer program at a college before senior year, hopefully I'll be accepted. Most of these clubs I started this year, couldn't last year bc covid. Barely any awards, can't really remember any specific ones but I have a few.\n\nI want to go to a college in either a large city like Columbia or a nice collegetown environment like Cornell.\n\nDream colleges are cornell and columbia, but I doubt I can get in... maybe for grad school?\n\nSo with these stats which colleges do you think I should be aiming for? Thanks!",
  "author": "bicycleinfantry",
  "created": 1635128660,
  "updated": 1635182410,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhxvjj7": {
      "link": "/r/ApplyingToCollege/comments/qf6z22/college_recommendations/hhxvjj7/",
      "text": "Literally all of them lol, there's no University you couldn't get into with your stats and ec",
      "author": "ZeldaLegend3",
      "created": 1635129377,
      "upvotes": 0,
      "replies": {
        "hhyab5k": {
          "link": "/r/ApplyingToCollege/comments/qf6z22/college_recommendations/hhyab5k/",
          "text": "With all due respect that isn't great advice. For schools like Columbia and Cornell, that isn't really true.",
          "author": "dontatmeplz3",
          "created": 1635138202,
          "upvotes": 3,
          "replies": {
            "hhz4p3e": {
              "link": "/r/ApplyingToCollege/comments/qf6z22/college_recommendations/hhz4p3e/",
              "text": "It's not like he doesn't have a chance though",
              "author": "ZeldaLegend3",
              "created": 1635163043,
              "upvotes": 1,
              "replies": {
                "hhzmwtj": {
                  "link": "/r/ApplyingToCollege/comments/qf6z22/college_recommendations/hhzmwtj/",
                  "text": "You said there's no school he can't get into. But with average / just below average GPA and sat for the top schools, that just isn't really true",
                  "author": "dontatmeplz3",
                  "created": 1635172527,
                  "upvotes": 1,
                  "replies": {
                    "hhzpg18": {
                      "link": "/r/ApplyingToCollege/comments/qf6z22/college_recommendations/hhzpg18/",
                      "text": "You're misinterpreting what I said.  I meant he has a chance at any school, I didn't say he would get accepted at every school.",
                      "author": "ZeldaLegend3",
                      "created": 1635173617,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hhy6a71": {
          "link": "/r/ApplyingToCollege/comments/qf6z22/college_recommendations/hhy6a71/",
          "text": "what ec’s ?",
          "author": "tripletim",
          "created": 1635135502,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}