{
  "sid": "qbbslm",
  "link": "/r/ApplyingToCollege/comments/qbbslm/i_want_to_put_self_studying_coding_as_an_activity/",
  "title:": "I want to put self studying coding as an activity on the common app , what do I put for the position/leadership description and organization name sections?",
  "text": "\\^title.",
  "author": "Comprehensive-Yam291",
  "created": 1634650982,
  "updated": 1636152464,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh8egxw": {
      "link": "/r/ApplyingToCollege/comments/qbbslm/i_want_to_put_self_studying_coding_as_an_activity/hh8egxw/",
      "text": "Seems like listing it is of marginal benefit.  It's completely unverifiable, did not result in any credit, credential or award, and, tbh, makes you look like kind of a weirdo.\n\nNow, if you made a mobile app or website that people are actually using, or if you contributed code to an open source project, etc. then that might be worth talking about.\n\n\"Self-study coding\" is on par with \"I read physics books in my free time\".  It's a hobby, and not one that necessarily reflects positively on you.\n\nI work in software.  Hardly anyone \"studies coding\" as a hobby.  They do it in order to acquire skills they need to get a job or because they want to build something and need to figure out how.   Learning how to code (or use a particular framework or library) is a means to an end, not an end unto itself.",
      "author": "jayphoward",
      "created": 1634651865,
      "upvotes": 1,
      "replies": {
        "hh8oze5": {
          "link": "/r/ApplyingToCollege/comments/qbbslm/i_want_to_put_self_studying_coding_as_an_activity/hh8oze5/",
          "text": "Wow, I disagree entirely. The job-world is different from college admissions. Yes, it's unverifiable, but it's still something we want to know about since it's a way this student spends their time.  \n\n\nPosition can be 'student,' organization name can be 'self-study,' whatever you'd like. We'll understand what you mean.",
          "author": "_MyCircusMyMonkeys",
          "created": 1634656434,
          "upvotes": 3,
          "replies": {
            "hhiom68": {
              "link": "/r/ApplyingToCollege/comments/qbbslm/i_want_to_put_self_studying_coding_as_an_activity/hhiom68/",
              "text": "I kind of get what u/jayphoward's saying.\n\nDuring the 3 months of the initial lockdown I spent a lot of time on competitive programming problems - for me it was like a medium to learn the fundamentals of CS through solving challenging problems. As a math-y person I enjoyed the problem solving aspect and treated it like an end in itself without feeling like I had to make something useful out of it. I spent a lot of time but didn't go anywhere with it  , no awards or anything. And when school started I couldn't keep up my effort with my increasing workload and those 3 months of effort just slipped past without anything to show. Maybe that does come off as an unverifiable thing just about anyone could say but I have no way of showing how it isn't.\n\nDo you think it might be a better idea to write it down in the Covid-19 part of the Additional information section ?\n\nI have very little ECs(3) so I wanted to put that as an activity to make it seem like I have other stuff  (T＿T)",
              "author": "Comprehensive-Yam291",
              "created": 1634839376,
              "upvotes": 1,
              "replies": {}
            },
            "hh8z7fk": {
              "link": "/r/ApplyingToCollege/comments/qbbslm/i_want_to_put_self_studying_coding_as_an_activity/hh8z7fk/",
              "text": "Personally, I might take a somewhat dim view of that EC.  Note, though, that I'm drawing a distinction between \"built something that required code\" or \"contributed to a project that required code\" and simply \"self-studying coding\".  The former strike me as meaningful; the latter not so much.\n\nAt the very least, if a student is going to self-study, complete some online course to document the fact.",
              "author": "jayphoward",
              "created": 1634660697,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh8iyle": {
      "link": "/r/ApplyingToCollege/comments/qbbslm/i_want_to_put_self_studying_coding_as_an_activity/hh8iyle/",
      "text": "My kid put piano self study on his app, and I believe he just wrote his name for the organization. Then, for the description he put the approximate grade level to which he had trained himself. That's harder to do with coding, as learning it doesn't happen in measurable levels, but you could maybe include the languages you're working with.\n\nI'd probably first try to find a way to mention it in an essay.",
      "author": "LadyMjolnir",
      "created": 1634653877,
      "upvotes": 3,
      "replies": {}
    }
  }
}