{
  "sid": "reayel",
  "link": "/r/ApplyingToCollege/comments/reayel/increasing_chance_of_acceptance/",
  "title:": "Increasing chance of acceptance",
  "text": "Hello, I've already applied to all my schools and was wondering if there is a way to increase your chances of getting in, specifically for UMaimi. I've been thinking about emailing my admission Counselor and asking them directly but I don't know if that's the best way to go about it. Thank you!",
  "author": "IreIandsoft",
  "created": 1639263280,
  "updated": 1639515348,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "ho6k03s": {
      "link": "/r/ApplyingToCollege/comments/reayel/increasing_chance_of_acceptance/ho6k03s/",
      "text": "I’m surprised to say that UM actually does track demonstrated interest, so correspondence with an admissions officer can help. I’m not saying you should email and ask “how you can boost your odds” though. Instead, ask questions about the application process or what happens after one is admitted, and in that email state that UM is your first choice, like “I’m definitely set on attending the University of Miami should the opportunity present itself” blah blah blah. I will say though that I got into UM through EA with a big merit scholarship and I never made contact even once with my AO, nor did I engage with any of their events, email promotions, etc. Also read that they use demonstrated interest for kids that were deferred or are on the waiting list so idk how it can help rn before EA decisions are out.",
      "author": "sc-um-arleth",
      "created": 1639265979,
      "upvotes": 5,
      "replies": {}
    },
    "ho6ezpm": {
      "link": "/r/ApplyingToCollege/comments/reayel/increasing_chance_of_acceptance/ho6ezpm/",
      "text": "If you've already put your best foot forward in your applications, then all you can do now is to wait for the results.",
      "author": "prsehgal",
      "created": 1639263724,
      "upvotes": 2,
      "replies": {
        "ho6jakw": {
          "link": "/r/ApplyingToCollege/comments/reayel/increasing_chance_of_acceptance/ho6jakw/",
          "text": "of course, but there is nothing else I can do after the fact, even small things to be able to boost my odds?",
          "author": "IreIandsoft",
          "created": 1639265660,
          "upvotes": 1,
          "replies": {
            "ho6p715": {
              "link": "/r/ApplyingToCollege/comments/reayel/increasing_chance_of_acceptance/ho6p715/",
              "text": "Sneak into the walls of your region’s admissions reader, listen to their life issues they discuss over the dinner table, and email them a compassionate note of support in excruciating detail",
              "author": "KingKonchu",
              "created": 1639268397,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    }
  }
}