{
  "sid": "r3ews6",
  "link": "/r/ApplyingToCollege/comments/r3ews6/can_i_have_the_same_experience_from_a_university/",
  "title:": "Can I have the same experience from a university if I do postgraduate studies at it, instead of doing undergraduate studies there?",
  "text": "For example, can the experience of an student at Cornell Engineering completing their bachelor degree be just get just as much of a *Cornell* experience compared to the experience of a student completing their masters degree at Cornell.\n\nAre 2 year masters students from an university invited to conduct their Alumni Interviews? Or are alumni interviews only held by graduates who did a 4 year bachelors at that university?",
  "author": "StunningComposer6905",
  "created": 1638024182,
  "updated": 1638205614,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hma2ark": {
      "link": "/r/ApplyingToCollege/comments/r3ews6/can_i_have_the_same_experience_from_a_university/hma2ark/",
      "text": "I would think the experience of a grad student would be very, very different than an undergrad.\n\nYou won’t be taking core classes with students outside your area so your social circle will be very limited. You won’t live in a dorm or other on-campus housing with other new students. No where near as much socialization/orientation type stuff as freshman get.  I don’t believe grad students get as involved in as many or as wide a range of student activities/clubs, probably related to the two previous points.  Also, grad students have already had their own undergraduate experience (good, bad, or indiffernt) and will be four years older, so by definition they are going to be different people when they set foot on campus than if they were freshman. Overall, I just get the sense that grad students, especially someplace like Cornell Engineering are much more focused, purpose-driven, get-in/get-in-the-lab/get-the-work-done types than undergraduates.",
      "author": "Strict-Special3607",
      "created": 1638025037,
      "upvotes": 5,
      "replies": {}
    },
    "hma2me0": {
      "link": "/r/ApplyingToCollege/comments/r3ews6/can_i_have_the_same_experience_from_a_university/hma2me0/",
      "text": "Having been an undergraduate and graduate student at the same university, it's very different.  Undergrads often live together in dorms; graduate students typically don't.  Undergrads are usually much more into the \"school spirit\" aspect of being on campus and/or identify more with their fellow students.  As a grad student, it feels more like a business transaction.  Any graduate student that is the type to become emotionally invested in a particular school has already done so with whatever school he/she attended for undergrad.",
      "author": "jayphoward",
      "created": 1638025202,
      "upvotes": 3,
      "replies": {}
    }
  }
}