{
  "sid": "repegk",
  "link": "/r/ApplyingToCollege/comments/repegk/feeling_like_i_am_going_to_die/",
  "title:": "Feeling like I am going to die.",
  "text": "I hate this week to be honest. Too much anxiety and unease. What’s gonna happen? I am just stressed, at times I can feel my heartbeat being a bit painful , I am dizzy because of the blood rush . I can’t eat, i am sweating most of the time. I am sure this is not healthy , but there is nothing I can do . \n\nI feel literal pain and I haven’t yet even received a decision. \n\nI feel like if it goes on like this I’ll be dead by the time I receive my admission decision.",
  "author": "friendlyapplicant999",
  "created": 1639317052,
  "updated": 1639514385,
  "over_18": false,
  "upvotes": 48,
  "upvote_ratio": 1.0,
  "comments": {
    "ho8z01s": {
      "link": "/r/ApplyingToCollege/comments/repegk/feeling_like_i_am_going_to_die/ho8z01s/",
      "text": "It’s time do some emotional planning. Get real with yourself and hope for the best but expect the worst. Know that you did everything you could possibly do but it just probably isn’t gonna work out in your favor and be ready for that. A lot a lot a lot of kids with super shiny amazing applications won’t have decisions go their way.\n\nHere’s a post I wrote this weekend that talks more about emotional planning. https://www.reddit.com/r/ApplyingToCollege/comments/r8sjp7/happy_weekend_beautiful_seniors_if_you_applied/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nAnd here’s a podcast from Inside College Admissions from Scoir where I chat about planning for your decisions. https://insidecollegeadmissions.buzzsprout.com/1384537/9651241\n\nThese early decisions can really hurt if things don’t go your way for sure. And it’s ok to give into the pain. But either way — you got this. You are way more than your college admissions. You will grow and learn and be stronger for it in the end.",
      "author": "admissionsmom",
      "created": 1639319200,
      "upvotes": 7,
      "replies": {}
    },
    "ho99mex": {
      "link": "/r/ApplyingToCollege/comments/repegk/feeling_like_i_am_going_to_die/ho99mex/",
      "text": "OMG same, i am super inefficient these days but I have a bunch of homework/school work",
      "author": "Dry-Table-3874",
      "created": 1639323633,
      "upvotes": 2,
      "replies": {}
    },
    "hoc2xpo": {
      "link": "/r/ApplyingToCollege/comments/repegk/feeling_like_i_am_going_to_die/hoc2xpo/",
      "text": "You did everything you could possibly do at that time! And it undoubtedly sucks that we need AOs validation for all our hard works throughout the highschool and beyond. But it is what it is! Even if things go south in ED1, please be hopeful for other rounds. I'll do the same too. I'll be rooting for you OP. Wish you all the best and wish the universe will ignite you with calm and positive energies throughout this process ✨",
      "author": "soul7373",
      "created": 1639366085,
      "upvotes": 2,
      "replies": {}
    },
    "hoahsb0": {
      "link": "/r/ApplyingToCollege/comments/repegk/feeling_like_i_am_going_to_die/hoahsb0/",
      "text": "My g, you are experiencing life",
      "author": "PapaDalio4723",
      "created": 1639341121,
      "upvotes": 1,
      "replies": {}
    }
  }
}