{
  "sid": "qgnu2y",
  "link": "/r/ApplyingToCollege/comments/qgnu2y/my_teacher_told_me_some_things_about_applying_is/",
  "title:": "My Teacher Told Me Some Things About Applying, Is She Right Or Wrong.",
  "text": "She's an avid teacher (I'm not in avid) so it's safe to say she knows a lot about admissions. Well about a week ago she told me a couple things that took me by surprise. Firstly, she said that CSUs don't look at essay's or extracurriculars (I'm in CA and will only be applying to state schools) and only take into consideration GPA. I told her my parents won't be helping to pay tuition so community college is pretty likely and at the end of our conversation she said that if I do chose to go to CC there's no reason for college students to take the SAT/ACT. Is she right about these things? My GPA is a 3.6 and I've never taken either the SAT or ACT. Am I screwed. I know it's a little too late to ask these question as it's almost November but I'm seriously worried of my chances of going to CSUs.",
  "author": "SebastianDeJesus",
  "created": 1635306597,
  "updated": 1635456503,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi7fyw0": {
      "link": "/r/ApplyingToCollege/comments/qgnu2y/my_teacher_told_me_some_things_about_applying_is/hi7fyw0/",
      "text": "CSUs have no essay. However, CSUs do consider hours per week (if I recall) for activities as well as whether you have a paid job. CSUs are test blind, so they will primarily consider your GPA, but no scores.\n\nWhether this is a problem for you will depend on which CSUs (and majors) you wish to apply to.",
      "author": "elkrange",
      "created": 1635306876,
      "upvotes": 1,
      "replies": {
        "hi7ipwe": {
          "link": "/r/ApplyingToCollege/comments/qgnu2y/my_teacher_told_me_some_things_about_applying_is/hi7ipwe/",
          "text": "Only Cal Poly uses the extracurricular information asked on the application. The rest use a system something like this: https://www.sjsu.edu/admissions/impaction/index.php\nMajor is really important. \n\nNo California public school is considering ACT/SAT scores this year so you don’t need to take it. /u/SebastiandeJesus I would apply to any CSUs near you and maybe a lower-tier UC if you have a good story and some extracurriculars and your family is low income because the Blue and Gold scholarship plan can be better than CC.\n\nBut California’s CCs cannot be beat. Many offer the first year free and the second year cheap. There are a bunch of guaranteed admission programs for both CSU schools https://www.calstate.edu/apply/transfer/Pages/ccc-associate-degree-for-transfer.aspx and the UCs https://admission.universityofcalifornia.edu/admission-requirements/transfer-requirements/uc-transfer-programs/transfer-admission-guarantee-tag.html and https://honors.uci.edu/wp-content/uploads/sites/14/2019/10/HonorstoHonorsFlyer_2019.pdf\n\nOne of the biggest expenses is dorms if you don’t qualify for extensive financial aid so look closely at schools near where you (or family/friends you could stay with) live.\n\nIf you have questions I would be happy to help you. I taught at a CSU for a long time and most of my students were CC transfers",
          "author": "RetiringTigerMom",
          "created": 1635308399,
          "upvotes": 1,
          "replies": {}
        },
        "hi7l2mv": {
          "link": "/r/ApplyingToCollege/comments/qgnu2y/my_teacher_told_me_some_things_about_applying_is/hi7l2mv/",
          "text": "I work three part time jobs and work far beyond the 20 hour maximum per week. I want to study business administration which is pretty packed already. I live in San Luis Obispo which is where Cal Poly is. That's my dream school and I'm pretty bummed out I probably won't get in.",
          "author": "SebastianDeJesus",
          "created": 1635309770,
          "upvotes": 1,
          "replies": {
            "hi8o849": {
              "link": "/r/ApplyingToCollege/comments/qgnu2y/my_teacher_told_me_some_things_about_applying_is/hi8o849/",
              "text": "If I recall, being from the local area may help you quite a bit. The old MCA calculator may not be relevant now that Cal Poly is test blind, but check it out https://mca.netlify.app/\n\nAlso, Cal Poly admits by major, so some majors may be much easier or much more difficult for admission.",
              "author": "elkrange",
              "created": 1635338671,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi7fzma": {
      "link": "/r/ApplyingToCollege/comments/qgnu2y/my_teacher_told_me_some_things_about_applying_is/hi7fzma/",
      "text": "No need to worry. All UC schools and all CSU schools are actually **test-blind**, which means that they don't accept SAT or ACT scores, nor do they take them into consideration for admission.\n\nIt's a sorta uncommon policy, so you lucked out for your particular situation! :)\n\nhttps://www.creativemarbles.com/2021/03/01/all-california-state-universities-are-test-blind-for-fall-2022/",
      "author": "toyota2003",
      "created": 1635306887,
      "upvotes": 1,
      "replies": {}
    },
    "hi7gu91": {
      "link": "/r/ApplyingToCollege/comments/qgnu2y/my_teacher_told_me_some_things_about_applying_is/hi7gu91/",
      "text": "She's giving you good advice.   A couple other things to keep in mind -- CSU's recalculate your GPA so if you took honors classes it may be higher.\n\n[https://www.calstate.edu/apply/gpa-calculator](https://www.calstate.edu/apply/gpa-calculator)\n\nMany of them also give you a boost based on location - you might have a better chance of getting into the ones closest to you.  You can see the formula for San Jose State below as an example - students from Santa Clara county get a boost.\n\nhttps://www.sjsu.edu/admissions/impaction/index.php\n\nDefinitely take care of the FAFSA when you have a chance.  Also look into the UC TAG options if you end up deciding to go with the CC path -- even if it's limited by major the guaranteed admission option to schools like the UCs is something most states don't have.",
      "author": "BrawnyAcolyte",
      "created": 1635307352,
      "upvotes": 1,
      "replies": {}
    },
    "hi7t179": {
      "link": "/r/ApplyingToCollege/comments/qgnu2y/my_teacher_told_me_some_things_about_applying_is/hi7t179/",
      "text": "Community Colleges are generally open admissions, requiring only a HS diploma to enroll.",
      "author": "RichInPitt",
      "created": 1635315179,
      "upvotes": 1,
      "replies": {}
    }
  }
}