{
  "sid": "re6mxq",
  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/",
  "title:": "finishing first semester at MIT AMA",
  "text": "yet another ama post. happy to answer any questions about life here or apps (disclaimer though: no i don’t know why i got in as opposed to the thousands of other qualified applicants and i can’t guess whether you will either)",
  "author": "jankysat",
  "created": 1639250166,
  "updated": 1645847903,
  "over_18": false,
  "upvotes": 153,
  "upvote_ratio": 0.98,
  "comments": {
    "ho5tbsy": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho5tbsy/",
      "text": "There isn't too much content online regarding MIT essays and such in my opinion. When you wrote your essays, were they really flamboyant and intricately detailed, or straight to the point? What is your take on the \"quirky\" MIT admissions trope?\n\nAlso, what are the profiles or your MIT classmates? Are like 5% ISEF / Olympiad Campers / Olympiad T50 geniuses, or is it greater? Does an above average high school senior who has done clubs and won some awards, but nothing truly CRAZY, even stand a chance in terms of admissions?\n\nAlso, what is it like at MIT? I've heard its horrible for mental health, but is the community there truly the \"hacker culture\" and \"doing and building\" that everyone associates with MIT?\n\nSorry for the all the questions LOL, I guess I'm just compensating cause I got rejected CMU SCS today lol. Also MIT is my dream school so I really do want to know anything a college freshmen would pick up about the admissions process. Thanks, I really appreciate it.",
      "author": "Competitive_Panic145",
      "created": 1639254010,
      "upvotes": 55,
      "replies": {
        "ho685tu": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho685tu/",
          "text": "Essays: i think the “quirky” trope is more of a way of saying that you aren’t going to get in with a generic essay. there has to be something that makes your essay stand out. for me, i think i wrote essays that weren’t particularly flamboyant but approached stories in a non-standard way. i think i wrote pretty normal stories but with memorable twists/ways of telling them, if that makes sense. \n\n\nClassmates: i don’t think i know anyone who won isef or olympiads? i know a lot of people who went to robotics world championships (i never did though). i think everyone is smart, but most of the time they don’t seem like geniuses. i’d say that it feels like everyone’s minds run at more similar speeds. the “genius” part comes in when you talk to someone about the niche thing they are interested in and know a ton about and you think “wow i will never know this much about that” but it’s their passion and so they have really learned a lot about it. lots of people here did normal clubs in high school, didn’t win awards or didn’t win any big ones. i didn’t do anything truly crazy, and while i do know people who have insane accomplishments, the majority of people i know do not fall into that category.\n\n\nMental health: yes, mental health bad. culture of overcommiting and the extreme pressure and rigor. however, when you find your group, you are really happy. there are many bad moments, but friends help you through it and the good moments outshine the bad ones. surprisingly, despite all the intensity and impostor syndrome and everything, i am the happiest i’ve ever been.\n\nHacking/building: i think it depends on the group you are in and what you are interested in. those communities do exist (as evidence by the alchemist picture in this blog post https://mitadmissions.org/blogs/entry/mmmm-wikipedia/) but not everyone is into that. so to a degree those stereotypes are true, but they definitely do not describe all mit students.",
          "author": "jankysat",
          "created": 1639260656,
          "upvotes": 72,
          "replies": {
            "ho6a4ch": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6a4ch/",
              "text": "Thank you for the help, this is very interesting. I guess I will have to definitely write some banger essays, and its nice to know that not everyone is cracked to a certain level even at top schools.\n\nAgain, I appreciate u doing an AMA its very helpful",
              "author": "Competitive_Panic145",
              "created": 1639261544,
              "upvotes": 11,
              "replies": {}
            },
            "ho73zl9": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho73zl9/",
              "text": "Interesting to know that you managed to write stories in 100 and 250 word limit prompts. I always thought in shorter essays, the focus should be on adding more content rather than trying to create \"hooks\" amd other stylistic stuff.",
              "author": "chiragbhansali",
              "created": 1639275552,
              "upvotes": 8,
              "replies": {
                "ho74rv3": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho74rv3/",
                  "text": "the content is important but if i’m just writing down achievements then it isn’t memorable and your reader gets bored. you need to find a way to show what you want shown in an engaging manner and telling it through the lens of a condensed story is a way to do that.",
                  "author": "jankysat",
                  "created": 1639275936,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "ho743pg": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho743pg/",
              "text": "If you don't mind sharing, did your essays try to reflect one specific spike/unique interest or talk about a variety of activities/topics?",
              "author": "chiragbhansali",
              "created": 1639275608,
              "upvotes": 3,
              "replies": {
                "ho74z9k": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho74z9k/",
                  "text": "no i didn’t try to have a spike. i tried to write essays that each showed different parts of me and i tried to be as authentically myself as possible. mentally, if i got rejected then i would know mit wasn’t the right fit the real me and if i got accepted then i felt like i represented myself accurately and it wasn’t some fake version of myself that was admitted.",
                  "author": "jankysat",
                  "created": 1639276038,
                  "upvotes": 10,
                  "replies": {
                    "ho754uz": {
                      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho754uz/",
                      "text": "Okay, thanks for the response!",
                      "author": "chiragbhansali",
                      "created": 1639276115,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho63ne6": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho63ne6/",
      "text": "shouldn’t you be studying for finals 🤨",
      "author": "sc-um-arleth",
      "created": 1639258618,
      "upvotes": 49,
      "replies": {
        "ho69bf0": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho69bf0/",
          "text": "shh. we don’t talk about that. honestly though, freshman fall is pass/no record so i don’t need to worry too much.",
          "author": "jankysat",
          "created": 1639261179,
          "upvotes": 46,
          "replies": {
            "ho6jujt": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6jujt/",
              "text": "u/sc-um-arleth is an MIT student too haha",
              "author": "GroundbreakingAd1515",
              "created": 1639265910,
              "upvotes": 22,
              "replies": {
                "ho6m8cv": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6m8cv/",
                  "text": "realized that after the sloan comment. bigger question is, shouldn’t u/sc-um-arleth be studying for finals?",
                  "author": "jankysat",
                  "created": 1639266996,
                  "upvotes": 30,
                  "replies": {
                    "ho6n19w": {
                      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6n19w/",
                      "text": "indubitably yes",
                      "author": "sc-um-arleth",
                      "created": 1639267372,
                      "upvotes": 18,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ho6oqi9": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6oqi9/",
              "text": "Lucky, so grades matter in the spring term then",
              "author": "MrJelloYT",
              "created": 1639268184,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ho5sbfg": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho5sbfg/",
      "text": "What is the culture like there? They emphasize collaboration a lot in their marketing, is that really true?",
      "author": "SchrodingersAdvice",
      "created": 1639253564,
      "upvotes": 27,
      "replies": {
        "ho664qq": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho664qq/",
          "text": "collaboration is huge. it is really difficult to get through work alone, and if you do manage to complete it alone, you probably took 3x as long as you would have if you worked with others. out of my 30 or so psets, i only did one written pset completely alone (i say written because i did coding psets alone, but that’s sort of different). the others i either worked through problems with others or bounced ideas off them or compared answers. you very quickly learn that things are so much easier when you work with others.\n\n\nin regards to the general culture, i think there are a couple big things that stick out. \n\n1) overcommiting. everybody takes on way too much. too many activities, classes, urops, groups, and other commitments. i think it’s because there are so so many opportunities here and it’s clear how fast time goes, so everyone is trying to maximize how much they get out of the mit experience. however, this takes a toll on our mental health and leads to extreme burnout and not enough sleep.\n\n2) acceptance and openness. a lot of people are very proud of who they are and are open about it. east campus and random are hot spots for this, but throughout all the dorms people are open about gender identities and sexual orientations (or lack thereof) and many people are very comfortable with their bodies and personalities. of course, many are also insecure about those particular things, but i’ve never seen so many people be authentic about themselves and it’s incredible.\n\n3) dorm culture can vary widely, but your dorm tends to be where you make your friends and where you’ll find people more like you. that being said, you have a lot of opportunities to find a dorm that fits you and you can still visit other dorms and become close with those communities.",
          "author": "jankysat",
          "created": 1639259730,
          "upvotes": 43,
          "replies": {
            "ho66ja4": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho66ja4/",
              "text": "Wow tysm for the detailed answer, I appreciate it!",
              "author": "SchrodingersAdvice",
              "created": 1639259916,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "ho7gxg7": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7gxg7/",
          "text": "I can guarantee you. You will almost definitely fail without collaboration. Not joking. They tend to make the homework hard to force you into collaborating with others",
          "author": "sofiiiiiii",
          "created": 1639282035,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho6ettq": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6ettq/",
      "text": "i have a freshmen friend at MIT and he says that the classes are really hard. he's stay up till like 2 am studying and like the average grade for his math class is like a 50 or something. is this true and/or representative of most other ppl at MIT?",
      "author": "whotookmyusernam",
      "created": 1639263651,
      "upvotes": 23,
      "replies": {
        "ho6gzh0": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6gzh0/",
          "text": "it is definitely representative. freshman fall is hard because we are transitioning to the rigor and it’s a huge difference from most high schools. i’ve heard especially the intro calculus classes tend to have low grades (i tested out of those). but everything is so hard. i leave lecture wildly confused most days.\n\nthe sleep is pretty normal, most people tend to go to sleep late. upperclassmen tend to go to bed later (a friend said he was getting 4 to 5 hrs of sleep a night). i personally prioritize sleep, but yeahhh, 2 is normal.",
          "author": "jankysat",
          "created": 1639264623,
          "upvotes": 25,
          "replies": {
            "ho75bxb": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho75bxb/",
              "text": "Since the calculus classes are quite hard (I think that's the case in every school), do you recommend studying it from a MOOC in the summer before university?",
              "author": "chiragbhansali",
              "created": 1639276212,
              "upvotes": 7,
              "replies": {
                "ho75qpm": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho75qpm/",
                  "text": "what’s mooc? do you mean mit ocw? \n\ni used ocw to study for placing out of the calculus exams, though it was more of a refresher. i haven’t used it as a primary learning method, though if you did the psets i suppose it would be a good tool.",
                  "author": "jankysat",
                  "created": 1639276409,
                  "upvotes": 6,
                  "replies": {
                    "ho75wpg": {
                      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho75wpg/",
                      "text": "MOOC = massive open online courses. Eg: edx, ocw",
                      "author": "chiragbhansali",
                      "created": 1639276488,
                      "upvotes": 6,
                      "replies": {
                        "ho77v1b": {
                          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho77v1b/",
                          "text": "i think that you should relax during the summer after senior year and not study. (do as i say, not as i do). \n\ni also personally would not be motivated to actually do the psets and learn from ocw/edx for topics i’m not already familiar with. that’s just me though, so if they work for you, that’s great.",
                          "author": "jankysat",
                          "created": 1639277463,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ho7h4zr": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7h4zr/",
          "text": "Idk which Calc class he’s referring to, but I wouldn’t say that’s true for the second of the required Calc classes. It’s hard but everyone figures it out enough to do well on exams. I have a feeling he’s referring to that weird accelerating Calc class though which can be rough",
          "author": "sofiiiiiii",
          "created": 1639282145,
          "upvotes": 3,
          "replies": {
            "ho7j43x": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7j43x/",
              "text": "yeah i’ve heard 18.01a/18.02a is particularly rough",
              "author": "jankysat",
              "created": 1639283188,
              "upvotes": 1,
              "replies": {
                "ho9fpkz": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho9fpkz/",
                  "text": "Same. Seems really bad based off what people told me",
                  "author": "sofiiiiiii",
                  "created": 1639326168,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho6rh7u": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6rh7u/",
      "text": "how do you feel having a world class university in BU right across the river? are you ever jealous or do you feel pressured by BU's undisputed greatness?",
      "author": "peewansebastian",
      "created": 1639269485,
      "upvotes": 22,
      "replies": {
        "ho6t74k": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6t74k/",
          "text": "i feel jealous all the time. i don’t live on dorm row because i’m so afraid of waking up and having to look over the river and see what i’m missing. /j",
          "author": "jankysat",
          "created": 1639270294,
          "upvotes": 16,
          "replies": {
            "ho6tva0": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6tva0/",
              "text": "my condolences...\n\nyou can always transfer!",
              "author": "peewansebastian",
              "created": 1639270613,
              "upvotes": 7,
              "replies": {
                "ho6uet8": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6uet8/",
                  "text": "Unfortunately, I doubt that BU would accept transfers from such an under-performing college. Maybe they can go to BU for grad school?",
                  "author": "Stq1616",
                  "created": 1639270872,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho655fu": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho655fu/",
      "text": "This might seem super naive lol, but I get the vibe that everyone at MIT is interested in physics, math, engineering, technology, or something very similar. How common is it to go to MIT hoping for a degree in, say, evolutionary biology or history or psychology? Is that even a thing there? Sorry if this is a dumb question lol but I’ve always been curious if MIT is a school ONLY for students looking to go into tech/engineering fields",
      "author": "SageSparrow12",
      "created": 1639259284,
      "upvotes": 18,
      "replies": {
        "ho68pjl": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho68pjl/",
          "text": "there are a lot of science majors. the most popular majors are mech e and comp sci, but there are lots of people interested in evolutionary biology and psych. humanities majors tend to be a second major, but we are required to take 8 hass (humanities, arts, social studies) classes and it’s not uncommon take a history class as part of that requirement. also, people do tend to enjoy their hasses and i’ve heard some people take more than 8.",
          "author": "jankysat",
          "created": 1639260905,
          "upvotes": 18,
          "replies": {}
        },
        "ho7ha60": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7ha60/",
          "text": "I’m a bio chem major, and I’ve met quite a few of us. So not as big as CS or engineering but it exists",
          "author": "sofiiiiiii",
          "created": 1639282222,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho5ujcq": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho5ujcq/",
      "text": "What do you eat on your hot dogs?",
      "author": "KingKonchu",
      "created": 1639254553,
      "upvotes": 16,
      "replies": {
        "ho687la": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho687la/",
          "text": "i don’t like hot dogs anymore. as a kid though, i’d have ketchup and mustard",
          "author": "jankysat",
          "created": 1639260677,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "ho63quv": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho63quv/",
      "text": "Gonna ask a question that's also popped up elsewhere, but how stacked are people in terms of math/international awards and everything (stuff like that)? Is everyone coming in having done research, olympiads and everything? Did you do anything like this?\n\nThanks for doing this OP!",
      "author": "white_thanos",
      "created": 1639258660,
      "upvotes": 10,
      "replies": {
        "ho693ym": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho693ym/",
          "text": "most people haven’t won olympiads. i think it is more common to have done research, but from those i know who did that, they said it was mostly looking on the internet and then writing a paper on something with a few ideas/comments of their own sprinkled in. it isn’t common to have been published in a journal and attended conferences (at least among those i know)",
          "author": "jankysat",
          "created": 1639261087,
          "upvotes": 17,
          "replies": {
            "ho7q1xc": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7q1xc/",
              "text": "Ah okay that sounds pretty interesting. Thanks!",
              "author": "white_thanos",
              "created": 1639286981,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ho6dicn": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6dicn/",
      "text": "How is Sloan?",
      "author": "bribxr",
      "created": 1639263053,
      "upvotes": 7,
      "replies": {
        "ho6egq8": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6egq8/",
          "text": "all i know is that they get sleep and the rest of us sleep significantly less",
          "author": "jankysat",
          "created": 1639263485,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "ho6ecn1": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6ecn1/",
      "text": "Do you have any info on Sloan, like what type of ecs do they have and personalities that they look for?",
      "author": "anonymoususer0610",
      "created": 1639263433,
      "upvotes": 6,
      "replies": {
        "ho6fk3k": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6fk3k/",
          "text": "mit doesn’t admit by major so “sloan” doesn’t have a particular profile they look for in terms of admissions. In fact, a lot of the people here that major in 15 came in as other majors and switched into it. You just need to have the ECs and personality of anyone that would get into mit (not that i think you should be shaping your application based on how other people got in, be yourself) - mit sophomore",
          "author": "sc-um-arleth",
          "created": 1639263981,
          "upvotes": 10,
          "replies": {
            "ho8gdx3": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho8gdx3/",
              "text": "Are you in Sloan btw?",
              "author": "doptimisticidealist",
              "created": 1639307129,
              "upvotes": 1,
              "replies": {
                "ho9mou4": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho9mou4/",
                  "text": "no, but it isn’t a selective thing to get “into”. you just start signing up for course 15 classes and if you follow the roadmap for the major you’re in the program. also idk if i made it clear in the previous comment, sloan doesn’t read applications. the same mit admissions committee reads for all undergrads.",
                  "author": "sc-um-arleth",
                  "created": 1639328995,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ho6ejhx": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6ejhx/",
          "text": "i don’t know anything about sloan, sorry.",
          "author": "jankysat",
          "created": 1639263520,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho6ut98": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6ut98/",
      "text": "Have you seen the legendary Nina Wang on campus hahahaha",
      "author": "leap2004",
      "created": 1639271067,
      "upvotes": 7,
      "replies": {
        "ho6v9gz": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6v9gz/",
          "text": "no joke, yes. i’m in the same math class as her and i saw her at a midterm",
          "author": "jankysat",
          "created": 1639271289,
          "upvotes": 4,
          "replies": {
            "ho6vv06": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6vv06/",
              "text": "Im jealous XD but also is MIT and pre-med an awful match? Are there a lot of premeds at MIT? How bad is grade deflation?",
              "author": "leap2004",
              "created": 1639271582,
              "upvotes": 3,
              "replies": {
                "ho7i4ao": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7i4ao/",
                  "text": "Imma pitch in one this one. What OP said about cross registration is definitely something some people do to help with GPA. But it isn’t an awful match for premed tbh. The MD-PhD acceptance rate is like 94% or something crazy high like that and the MD acceptance rate is 70something percent. For reference the national acceptance rate is somewhere around 45%. And they have advisors and what not to keep you on track. I’ve also spoken with a med school admissions officer who said that because MIT students are like unicorns in the med school Pool that as long as test scores and GPA aren’t abysmally low, they tend to make it past the first round of cuts. From that point, what matters most are letters of rec and extracurriculars (research, volunteering, leadership, etc.). They work very hard to help anyone who is premed and the average accepted GPA does tend to be a bit lower than say a state school. So it’s not a bad match. \n\nAlso the grade deflation thing is over exaggerated. The classes are hard but it’s not like the grade on a curve or artificially lower your grade or anything",
                  "author": "sofiiiiiii",
                  "created": 1639282666,
                  "upvotes": 3,
                  "replies": {}
                },
                "ho6w31x": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6w31x/",
                  "text": "mit and premed is not a good match. i don’t know anyone doing premed but i’ve heard that if you do, you cross-register at harvard to boost your gpa. classes are really hard and from what i’ve heard maintaining the gpa necessary for med school is very difficult.",
                  "author": "jankysat",
                  "created": 1639271690,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho6keu0": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6keu0/",
      "text": "What’s your major and what is the course load like? Are kids politically involved on campus?",
      "author": "loserlake420",
      "created": 1639266170,
      "upvotes": 4,
      "replies": {
        "ho6o5f0": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6o5f0/",
          "text": "i’m going to major in aeroastro. this semester i took 4.5 classes + a seminar and next semester i’ll take 6 classes (only 4.75 full classes worth of credits). i may or may not drop some, we’ll see how it goes. i haven’t officially started my major but i’m doing general graduation requirements as well as some major requirements. classes tend to be hard and homework takes a long time. i probably do 13 hours of work a day and then do other activities/am in transit to activities or classes for another 4 or 5 hours. \n\ni don’t know much about the political scene on campus. there are groups but i don’t know what they do.",
          "author": "jankysat",
          "created": 1639267900,
          "upvotes": 7,
          "replies": {
            "ho6rxnn": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6rxnn/",
              "text": "13😭Jesus lol also what are the research opps like",
              "author": "loserlake420",
              "created": 1639269704,
              "upvotes": 3,
              "replies": {
                "ho6tgek": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6tgek/",
                  "text": "there are a ton. it’s hard for freshman at the beginning of the semester but pretty much all my friends have one over iap (our january term). i got mine by asking a prof during office hours and she said yes without looking at my resume. there are so many opportunities, it’s ridiculous. they are also real work - like i’m working on a nasa satellite and i literally came into the project with 0 experience.",
                  "author": "jankysat",
                  "created": 1639270417,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "hq5k1by": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hq5k1by/",
              "text": "I’m super late to this party lmao but ayyy course 16 frosh rise up",
              "author": "itsameabree",
              "created": 1640618312,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ho6m0ew": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6m0ew/",
      "text": "what’re you taking for your PE requirement? and how is it?",
      "author": "CrystalsOnGumdrops",
      "created": 1639266892,
      "upvotes": 3,
      "replies": {
        "ho6oac6": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6oac6/",
          "text": "i took sailing during the first quarter and hockey second quarter. i love the pe classes and i definitely plan on taking more than 4. may or may not go for pirate certificate, tbd.",
          "author": "jankysat",
          "created": 1639267966,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "ho6sf1w": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6sf1w/",
      "text": "Hi I saw that you’re in aeroastro, it’s so nice to see someone in my (future) major. I know you probably haven’t done any classes related to the major yet, but how are the aero facilities and resources there? How was the transition to MIT? I haven’t had the chance to tour because of covid",
      "author": "kpr2022",
      "created": 1639269935,
      "upvotes": 5,
      "replies": {
        "ho6txk0": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6txk0/",
          "text": "ok aeroastro is so bad at marketing their department to frosh but their facilities and opportunities are incredible. they just rebuilt the wind tunnel and there are a bunch of space-centered labs. their core classes were developed by basically asking what industry wants to see in new hires. aeroastro is one of the hardest majors, but there are so many opportunities once you get into the department (and even before). \n\ni said this in another response, but i’m literally working on a nasa mission as a freshman and i came in with no relevant experience. the opportunities are incredible and the department wants to give them to you (that’s true of all the departments here). \n\nif you have more specific questions, feel free to respond here or pm me!",
          "author": "jankysat",
          "created": 1639270644,
          "upvotes": 6,
          "replies": {
            "ho6ycff": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6ycff/",
              "text": "Wow you are living my DREAM right now, I appreciate the response. The website definitely could use some work so it almost gave me a “dated” impression of the department but I’m glad to hear otherwise. How did you get that NASA opportunity, was it applying for a NASA internship or did they come to a job/internship fair? My dream would be to work at NASA one day. Good luck with classes, i hope I can join you at MIT aeroastro one day!",
              "author": "kpr2022",
              "created": 1639272785,
              "upvotes": 3,
              "replies": {
                "ho710n6": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho710n6/",
                  "text": "it’s actually through mit aeroastro. the department is running a big part of the project and a prof of mine is very involved. i asked her if she had space in her lab for an undergrad who knows nothing and she said yes and offered me this.\n\nyes, the aeroastro website is awful. and also, i’m living my dream. i am mind blown that i’m doing this, it’s absolutely insane",
                  "author": "jankysat",
                  "created": 1639274101,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho6t8yo": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6t8yo/",
      "text": "Is there any point in applying to MIT with a 750 in math on the sat? How test-centric is MIT??",
      "author": "leap2004",
      "created": 1639270318,
      "upvotes": 5,
      "replies": {
        "ho6u547": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6u547/",
          "text": "not very test-centric at that score-range. honestly, the difference between a 750 and a 780 can be the curve on a particular test or just one question. apply with a 750. you won’t get auto rejected because of it.",
          "author": "jankysat",
          "created": 1639270746,
          "upvotes": 5,
          "replies": {}
        },
        "ho7hggl": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7hggl/",
          "text": "I got a 750 and made it in, so it’s definitely worth a shot :)",
          "author": "sofiiiiiii",
          "created": 1639282313,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ho770b3": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho770b3/",
      "text": "Are you having a good time? I already applied to MIT EA so the cards are gonna fall where they may when decision day comes, but I'm more interested in, if I get in, if college will actually be enjoyable, especially at a notoriously difficult college like MIT. How's the social scene? Do you have time to have fun and hang out with friends, or are you constantly stressed and overwhelmed with work?",
      "author": "noah8597",
      "created": 1639277035,
      "upvotes": 3,
      "replies": {
        "ho794qf": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho794qf/",
          "text": "yes, i am very happy. i am very stressed and overwhelmed and have many bad moments, but the good outshine the bad. \n\nmy “fun” is my extracurriculars and talking with friends. there isn’t much time to completely relax (i mean, i could drop my extracurriculars but that would make me sad) and that does lead to burnout. \n\nthere is a social scene. tons of parties, club events, study breaks (free food). there is always something to do.",
          "author": "jankysat",
          "created": 1639278104,
          "upvotes": 7,
          "replies": {
            "ho7a1e0": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7a1e0/",
              "text": "I'm actually pretty relieved to hear that. I'm targeting all these \"top tier\" schools, and it's great to hear you can still have a good time even in a stressful and challenging environment. Thanks for doing this AMA!",
              "author": "noah8597",
              "created": 1639278566,
              "upvotes": 2,
              "replies": {
                "ho7ck0a": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7ck0a/",
                  "text": "np!",
                  "author": "jankysat",
                  "created": 1639279835,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho7ikfj": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7ikfj/",
      "text": "Damn. Beat me to it. I was gonna wait until after finals but oh well. Guess I’ll just unnecessarily pitch in on your questions hehe",
      "author": "sofiiiiiii",
      "created": 1639282899,
      "upvotes": 4,
      "replies": {
        "hoc2eiv": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hoc2eiv/",
          "text": "You’ve been super helpful!!",
          "author": "ihavenopersonalityha",
          "created": 1639365840,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho6pk3e": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6pk3e/",
      "text": "Motivating me to do my MIT essays, thanks OP. \n\nWhy did you pick your major? \n\nWhat are some clubs or activities you've enjoyed at MIT so far, or that you've heard about from others? \n\nAny advice on navigating MIT's unusual extracurricular limits?",
      "author": "a2c2021throwaway",
      "created": 1639268564,
      "upvotes": 3,
      "replies": {
        "ho6qu9i": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6qu9i/",
          "text": "i love space and so i was debating between aeroastro, physics, and planetary science (eaps) and i came to the conclusion that i was interested in physics and eaps, but that i couldn’t sit in a lab all day and i couldn’t see myself in a career in them. i also am doing a urop (undergrad research) in aeroastro and am super invested and i took that as a hint that that is what i’m really interested in.\n\ni’m on rocket team and club hockey and love them both. rocket team has a bunch of cool people in it and i’m learning so so much. hockey is what keeps me sane and forces me to shut off my brain.\n\n\ni think that for the few extracurriculars you can put on the application (assuming that’s what you are talking about), find ways to group activities into broader categories (i don’t think the activity title had a character limit) and choose what is most important to you ie the things you as a person care about the most.",
          "author": "jankysat",
          "created": 1639269178,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho6x50m": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6x50m/",
      "text": "What are the chances you could hook me up with a research opportunity in the Boston area or MIT in the coming years?\n\nAll jokes aside though, from your MIT student perspective, do you think Biomedical engineering and technology will grow. Is everyone in MIT focused on the traditional engineering and computer science majors? And does everyone at MIT seem to know exactly what they want to do and have known their path for a while?\nThanks a ton and good luck with finals.",
      "author": "Arya_19",
      "created": 1639272190,
      "upvotes": 3,
      "replies": {
        "ho70qpp": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho70qpp/",
          "text": "i know very little about bioeng but i don’t see any obvious reason it wouldn’t grow?\n\nnot everyone is focused on computer science and mech e. within computer science, a lot of the actual majors are sort of combined with other majors (like comp sci and econ or brain and cog sci) so people tend to focus on applications. even with mech e and comp sci being the biggest majors, most people are not in those and there is no way you will only meet people in those departments.\n\nmost people don’t know what they are going to do and they don’t have a clear path. we all came in with ideas, but they were ideas and now that we are actually experiencing what some fields are like, everyone is changing their mind. i have met very few people who have not considered more than one major.",
          "author": "jankysat",
          "created": 1639273967,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho6zdae": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6zdae/",
      "text": "Whats the lowest gpa you know?",
      "author": "lennyyyy4",
      "created": 1639273289,
      "upvotes": 3,
      "replies": {
        "ho71564": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho71564/",
          "text": "i don’t. as a freshman i don’t have a gpa, but from what i understand, the norm is to not ask about gpas.",
          "author": "jankysat",
          "created": 1639274161,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ho71ude": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho71ude/",
      "text": "How much free time would you say that you have a day/a week? Also, what would you say separated you from the applicants who were super smart but didn't get in - what made you special?",
      "author": "aidanisverycool_",
      "created": 1639274502,
      "upvotes": 3,
      "replies": {
        "ho72xrj": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho72xrj/",
          "text": "ha ha ha. not enough. “free time” tends to be talking with friends while being stumped on a pset. i can make time for relaxing, but it tends to be at the expense of doing more work later, so i only do that if i’m very burnt out. i guess my extracurriculars are free time, but in the sense of sitting around and watching tv or reading a book: almost never. that’s different for other people, but i haven’t had a ton of down time.\n\ntldr; my google calendar says an average of an hour per day not blocked out for working/activities.",
          "author": "jankysat",
          "created": 1639275034,
          "upvotes": 4,
          "replies": {
            "ho7dgks": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7dgks/",
              "text": ">my google calendar says an average of an hour per day not blocked out for working/activities.\n\nI hope sleep is one of those activities",
              "author": "bughousepartner",
              "created": 1639280290,
              "upvotes": 2,
              "replies": {
                "ho7ejan": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7ejan/",
                  "text": "yes sleep is one of those activities. i prioritize sleep and try to get between 6-7 hrs every night",
                  "author": "jankysat",
                  "created": 1639280834,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hoaygy7": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hoaygy7/",
          "text": "Honestly, everything is about time management. You have to be responsible with time and getting ahead on psets or you'll be behind and get stressed. I went into the year horrified that I'd fail everything so that was pretty good motivation to make me do my work. That also meant that I usually finished psets early or budgeted time to not be stressed. This resulted in me actually having a lot of free time! (but to be fair I had already been exposed to a lot of the content of my current classes so that probably made it easier) In my first semester, I joined the musical theatre guild and participated in the fall musical (which can actually be VERY time consuming come production week). So it is absolutely possible to have free time. Though I have a feeling that will change for me next semester when I take Org chem and do a UROP \\*Shudders\\* that'll be hell",
          "author": "sofiiiiiii",
          "created": 1639347891,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ho72dnf": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho72dnf/",
      "text": "how were your highschool academic stats (gpa, test scores, aps)? is there a threshold that if you reach academically that it will be all up to your essays and ecs, or would you consider mit a school that NEEDS extremely high scores and gpa?",
      "author": "drpepperrrrrr",
      "created": 1639274764,
      "upvotes": 3,
      "replies": {
        "ho738ju": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho738ju/",
          "text": "my gpa and sat were solid. my self reported aps were a mix of 4s and 5s (had a 3 but didn’t self report it. when they wanted official score reports i sent it in and they didn’t care).\n\ni think most people that apply to mit have the test scores and gpa and for them to differentiate between the thousands of candidates, for most the ecs and essays are the deciding factor.",
          "author": "jankysat",
          "created": 1639275182,
          "upvotes": 3,
          "replies": {
            "hobiqhn": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hobiqhn/",
              "text": "Do you think a 1490 SAT (760Reading/730Math) is a deal breaker for my application? I’m hoping the classes I’m taking will compensate (Just finished Calc 1 at my community college, and am starting Calc 2 in January to self study for the AP BC exam), as well as APs (five self studied + everything my school let me take, got 4s on all self studied ones so far).",
              "author": "AFrostNova",
              "created": 1639356842,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho7bx8m": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7bx8m/",
      "text": "had you not gotten into mit, where would you have gone?",
      "author": "zb_truth",
      "created": 1639279511,
      "upvotes": 3,
      "replies": {
        "ho7cl7i": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7cl7i/",
          "text": "caltech",
          "author": "jankysat",
          "created": 1639279852,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ho7f22s": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7f22s/",
      "text": "I’ve heard that at a lot of colleges that are ~prestigious~ , you sometimes have to apply to clubs, and so was wondering how many there were that required stuff like that, and how many that were open to everyone without all of the extra applications lol",
      "author": "Snoo_62176",
      "created": 1639281098,
      "upvotes": 3,
      "replies": {
        "ho7g0cl": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7g0cl/",
          "text": "there are some clubs that you have to apply for (i think a capella and some business clubs). most are beginner friendly and you just join at the start of the year.",
          "author": "jankysat",
          "created": 1639281575,
          "upvotes": 2,
          "replies": {
            "ho7wkn3": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7wkn3/",
              "text": "Alright, thanks!",
              "author": "Snoo_62176",
              "created": 1639291013,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ho7jmeg": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7jmeg/",
      "text": "I want to hear about the craziest students you’ve met. Startup founder, math god, influencer, tell me about it.\n\nHow’s the entrepreneurship culture there?\n\nWhat’s the coolest part about campus, and or the coolest lab/place. (I’m talking places with $1M motion capture and shit)",
      "author": "Rellkedge",
      "created": 1639283466,
      "upvotes": 2,
      "replies": {
        "ho7t6qb": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho7t6qb/",
          "text": "felt compelled to drop in and mention the senior I know who is turning down 500k at Jane Street to go to grad school instead. That may sound kinda normal but if you met him you'd know he's a total genius, love that dude. \n\nInteresting you mentioned influencer cause I feel like the only one people know, I guess even including me, is Nina Wang? She's in the same social circle as me but she's not as active (? idk the right word) at MIT as I expected her to be. Very ordinary very normal. Nesu is up and coming though I will say that, check out his YouTube he's a bright kid with a great future I'm sure.",
          "author": "sc-um-arleth",
          "created": 1639288805,
          "upvotes": 6,
          "replies": {
            "hojzu4b": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hojzu4b/",
              "text": "I know this is late but Jane Street is *kinda* my dream job - what was his major?",
              "author": "noah8597",
              "created": 1639513438,
              "upvotes": 1,
              "replies": {
                "hok0tx1": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hok0tx1/",
                  "text": "math and econ",
                  "author": "sc-um-arleth",
                  "created": 1639513833,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ho8slb8": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho8slb8/",
          "text": "lucas from lucidvr does some insanely cool stuff. he’s always working on vr or crazy ideas for his gloves.\n\ni also know someone who knows preston bezos/\n\nas far as i know the entrepreneurship is pretty good. there’s a lot of money you can get for it (think 10k in funding) and yeah. idk i’m not involved in it, but i always see announcements about money for start ups.\n\n\nfor me, the wildest place is actually the lab i work in. there are 4(?) satellites being built in there, there’s a clean room that was built by a grad student for the OSIRIS-Rex mission (one of the instruments was built in my lab). there are things to simulate conditions in space and i think it’s so cool.\n\nthere’s also a nuclear reactor.\n\ni like maker spaces too, and one in particular, metropolis, is great because there is free 3d printing and laser cutting, and there’s a waterjet as well (may have to pay for that though).",
          "author": "jankysat",
          "created": 1639315901,
          "upvotes": 2,
          "replies": {}
        },
        "hoaxww7": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hoaxww7/",
          "text": "hmm I met someone who was already halfway to their math degree requirements by the end of their freshman year. But that's about it haha, people are pretty normal here despite everyone thinking everyone is a genius",
          "author": "sofiiiiiii",
          "created": 1639347659,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoaxfuu": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hoaxfuu/",
      "text": "Hey! I am applying in the regular action cycle, and was wondering how does a STEM student exactly stand one in a humanities recommendation? Or, in other words what are they exactly looking for, especially that I am very much a STEM person with little to no activities related to the humanities.",
      "author": "DiamondTechie",
      "created": 1639347463,
      "upvotes": 2,
      "replies": {
        "hoayfgw": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hoayfgw/",
          "text": "to make sure i’m understanding your question, are you asking how to get a good humanities rec if you don’t have humanities activities? the answer to that is to get a recommendation from a humanities teacher in school that knows you well. \n\nhope that helps!",
          "author": "jankysat",
          "created": 1639347874,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho5ncp3": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho5ncp3/",
      "text": "Which university do you attend",
      "author": "Sea_Individual1999",
      "created": 1639251379,
      "upvotes": 6,
      "replies": {
        "ho5p13a": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho5p13a/",
          "text": "mit",
          "author": "jankysat",
          "created": 1639252123,
          "upvotes": 24,
          "replies": {
            "ho5pynu": {
              "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho5pynu/",
              "text": "Thanks OP",
              "author": "Sea_Individual1999",
              "created": 1639252532,
              "upvotes": 28,
              "replies": {
                "ho77r2q": {
                  "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho77r2q/",
                  "text": "i'm so confused",
                  "author": "co3_carbonate",
                  "created": 1639277410,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho6ty8i": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6ty8i/",
      "text": "What were your main ECs that you listed when applying?\n\nDo you know many international students?\n\nWhen you applied, were you actually confident that youd get in?",
      "author": "A80A90",
      "created": 1639270653,
      "upvotes": 1,
      "replies": {
        "ho6uhol": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/ho6uhol/",
          "text": "robotics, a summer job, a small robot i built on my own time (a mini swerve drive, if you know what that is), and outdoor sports.\n\ni know a bunch of international students.\n\nno i did not think i’d get in. i was deferred, so the odds were even smaller and i don’t think of myself as a genius. i’m still baffled by it.",
          "author": "jankysat",
          "created": 1639270911,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hojhlh7": {
      "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/hojhlh7/",
      "text": "Genuinely asking, how advantageous would you say it is for an applicant to have qualified for USAMO of something alike. Do you know a lot of these people? would it be decent boost in possibilities of admission?",
      "author": "nEVErknowwHhy",
      "created": 1639506308,
      "upvotes": 1,
      "replies": {
        "holtmfx": {
          "link": "/r/ApplyingToCollege/comments/re6mxq/finishing_first_semester_at_mit_ama/holtmfx/",
          "text": "honestly, idk. i don’t know people who qualified (or if they did, they don’t go around flexing it) but i think it’d be impressive. imo i don’t think it would be he sole reason someone was admitted, but could be a factor. idk",
          "author": "jankysat",
          "created": 1639542675,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}