{
  "sid": "r58tui",
  "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/",
  "title:": "How do I apply for college with a terrible 2.8 gpa?",
  "text": "Hi everyone: \nI am a student from Colombia who thought she was a decent student, so I applied for hunter college at NYC, I send my transcript to translate to the American metric score and I got back a terrible 2.8, I got a 1520 on the SAT however Hunter isn’t accepting SAT scores due to the pandemic and the average GPA is 3.4 basically I am out of the race, I am oblivious about college admissions in USA, what should I do? How do I get a new GPA? Some people on internet told me to get into a 2 year community college in order to get a new GPA, but even community college asks me for a GPA higher than 3.0, I mean that what I was trying to do with applying to hunter since my first choice was NYU or Columbia.",
  "author": "Melimelo3220",
  "created": 1638228790,
  "updated": 1638479368,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.86,
  "comments": {
    "hmlkl8w": {
      "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlkl8w/",
      "text": "Look for colleges which prioritize SAT over GPA and/or have auto-admit programs — these are often big state schools (e.g. Arizona State accepts anyone with an SAT over 1100, Iowa State will accept you if you've taken at least 14 \"core\" courses during high school)",
      "author": "Stq1616",
      "created": 1638231219,
      "upvotes": 17,
      "replies": {}
    },
    "hmly5v8": {
      "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmly5v8/",
      "text": "community college accepts everyone no matter gpa or test scores!",
      "author": "Ill_Lavishness624",
      "created": 1638237452,
      "upvotes": 9,
      "replies": {
        "hmm4bp4": {
          "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmm4bp4/",
          "text": "\\^ amazing advice! getting into a community college and working hard to build a new GPA with good grades will help you transfer into a good uni!",
          "author": "MeMissBunny",
          "created": 1638240189,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmm3y7d": {
      "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmm3y7d/",
      "text": "Make sure whoever converted your GPA did it properly. I'm from a country in Latin America as well, and the first time I sent in my transcript for review, they returned me with a 3.3 GPA. I knew that wasn't right, so I called and asked how they converted my grades. They had used the wrong system.\n\nAfter everything was corrected, I ended up with a \\~3.7+ GPA.\n\nI'd recommend you double-check with whoever converted your GPA, just in case.",
      "author": "MeMissBunny",
      "created": 1638240025,
      "upvotes": 9,
      "replies": {
        "hmmk9ux": {
          "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmmk9ux/",
          "text": "mmm I going to double check with them… hopefully you are right, I was thinking about sending my transcripts to a different company and verify if the results are right, however I can’t see to find any company that do this type of work, could you let me know which company you used for your GPA? And thanks for the advice",
          "author": "Melimelo3220",
          "created": 1638247738,
          "upvotes": 3,
          "replies": {
            "hmnpavw": {
              "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmnpavw/",
              "text": "which company did you use? was it ECE or WES?",
              "author": "No-Shift-6657",
              "created": 1638277655,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmlh293": {
      "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlh293/",
      "text": "Idk but I feel like the almost perfect SAT score kinda makes up for that",
      "author": "l0s3rZz",
      "created": 1638229622,
      "upvotes": 7,
      "replies": {
        "hmlhojj": {
          "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlhojj/",
          "text": "Nope, Hunter isn’t accepting SAT until 2023 due to the pandemic, admissions are based on GPA, recommendations letters and that’s it. I am done with that GPA.",
          "author": "Melimelo3220",
          "created": 1638229900,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmlfxrr": {
      "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlfxrr/",
      "text": "Same. Colombia and all. I'm actually applying to Columbia U from here with a 3.3 UW kinda thing, but from what I've read GPA is always a tricky thing cause there is no such thing as an American score translation, like they know every GPA is calculated differently. My advice: Get your school to make a good school profile in the application and fill yourself of hope. Your SAT is good asf tho! Best of luck, compañera.",
      "author": "Roundcorner_Weirdo25",
      "created": 1638229117,
      "upvotes": 2,
      "replies": {
        "hmlgmks": {
          "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlgmks/",
          "text": "Thanks for the advice good luck to you too compadre!",
          "author": "Melimelo3220",
          "created": 1638229426,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmlfkao": {
      "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlfkao/",
      "text": "1525? I thought scores ended with a zero. And how did you convert your grades?",
      "author": "stormbirdie_",
      "created": 1638228950,
      "upvotes": 1,
      "replies": {
        "hmlg4nh": {
          "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlg4nh/",
          "text": "Yeah sorry it has been a while, I got 1520, in order to apply for Hunter they require you to send your notes or transcripts to this institution in Florida who convert your A B C or a whatever your country use for scores into a GPA. In Colombia we use ABCD my final score was a B for all my years in high school. However after I read the letter they told me my score was a 2.8 in America GPA. That was soul crushing I didn’t even leave my room for days.",
          "author": "Melimelo3220",
          "created": 1638229202,
          "upvotes": 3,
          "replies": {
            "hmlj18u": {
              "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlj18u/",
              "text": "Hmmm. I see. I am very confused about the conversion, I thought straight Bs warranted at least a 3.0. Especially because you got a 1520 on the SAT. I am also international, and while we speak English in Canada I have never been asked to convert my grades from the Canadian scale to the American ones. But if the school told you to do it then they're probably right. \n\nDisclaimer: I'm not an admissions officer. The only way you can truly find out if you'll get into a school is by applying and having them make the choice of whether to admit you or not.\n\nAre you still taking courses? If you are, you could try aiming for A's, but it might not make as big of an impact as you want. \n\nOtherwise, you should apply to universities in your country and check the transfer policies at the US schools you are interested in. You could try to transfer into them after a year or two, just aim for the highest grades and have good extracurriculars. Transfer admissions are brutal though, even more so than first year admissions, so be careful. \n\nYou could also take a gap year, though. Up to you. I wish you the best of luck tho, hopefully somebody with more experience can give you a better answer than I can.\n\nEdit: I'm still confused about that GPA though 🤨 afaik schools do those conversions internally",
              "author": "stormbirdie_",
              "created": 1638230509,
              "upvotes": 2,
              "replies": {
                "hmln9py": {
                  "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmln9py/",
                  "text": "Thanks for the good wishes, that’s the company they referred on their admissions page for international students, you send them your transcripts and they send the results to Hunter  and you just have to send your application, I sent my application but after seeing the result of my GPA I know I am out of the race.",
                  "author": "Melimelo3220",
                  "created": 1638232462,
                  "upvotes": 1,
                  "replies": {
                    "hmlnoiy": {
                      "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlnoiy/",
                      "text": "Ah im sorry then :( I wish i could help more. I would recommend going to the discord and asking in the international chat, its super active so you'll get a lot more responses",
                      "author": "stormbirdie_",
                      "created": 1638232652,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmlhzq5": {
      "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlhzq5/",
      "text": "I’m so sorry I forgot about that :((( Hopefully the rest of your application can make up for it and they take into account that you’re an international student. I really hope you get in!!!",
      "author": "l0s3rZz",
      "created": 1638230038,
      "upvotes": 1,
      "replies": {
        "hmlik0p": {
          "link": "/r/ApplyingToCollege/comments/r58tui/how_do_i_apply_for_college_with_a_terrible_28_gpa/hmlik0p/",
          "text": "Thanks that’s very sweet of you.",
          "author": "Melimelo3220",
          "created": 1638230294,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}