{
  "sid": "q9ipzk",
  "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/",
  "title:": "Test optional. what?",
  "text": "Ok so here's the thing. \nI'm going to sound really mean during this, but I swear I'm just asking I promise I have nothing against everyone going test optional ok <3 \n\nSo today I got my SAT score back. it's pretty good! I'm happy with it, it's above the 75th percentile for my ED, and I worked really hard for it. I told my school counselor, expecting her to be all like 'WOW GREAT JOB!' instead, I was greeted with a reaction that was like 'oh nice job, cool, it was all for nothing' \nI asked her why she didn't seem too happy, and she told me that a having good SAT score is great, but everyone is going test optional anyways, so who tf cares.\n\nDoesnt this seem super unfair to all the people who really tried to get a good SAT score? Like wouldn't it be ridiculous if you could just say 'Im applying to Harvard *GRADE OPTIONAL*\" HA ALL YOU IDIOTS STUDYING FOR EXAMS WHAT NOOBS JUST GO GRADE OPTIONAL SUCKERZ. Everyone would freak out then right? How is going SAT optional any different?\n\nI'm sorry if I'm missing something important and I swear I'm not trying to be rude. Do people who actually do submit their scores seem even smarter? I honestly have no clue. it seems really unfair to me right now, but who knows maybe I'm just salty.",
  "author": "itsyaboishady",
  "created": 1634412277,
  "updated": 1634423196,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hgwcqcz": {
      "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/hgwcqcz/",
      "text": "“Test optional” does NOT mean “test not valuable.”",
      "author": "Strict-Special3607",
      "created": 1634414469,
      "upvotes": 10,
      "replies": {}
    },
    "hgw8e50": {
      "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/hgw8e50/",
      "text": "sat scores can still help your apps. since a lot of colleges are test optional, it likely means that those who do submit scores are going to have higher scores, but it can still help. since its above the 75% percentile, itll def help",
      "author": "pumpkin2500",
      "created": 1634412593,
      "upvotes": 6,
      "replies": {}
    },
    "hgwlna8": {
      "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/hgwlna8/",
      "text": "Your counselor is stupid. Having a score like that will be a big plus. If you had two applications and both were nearly identical in quality, then they’d choose the one who has a really good test score",
      "author": "MakingCake1",
      "created": 1634418350,
      "upvotes": 3,
      "replies": {}
    },
    "hgwahtm": {
      "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/hgwahtm/",
      "text": "Colleges will obviously give more consideration to applicants with strong test scores. While it varies by school, I know UPenn’s acceptance rate was much higher for applicants who submitted test scores",
      "author": "Good-Charity653",
      "created": 1634413495,
      "upvotes": 2,
      "replies": {
        "hgwdkag": {
          "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/hgwdkag/",
          "text": ">I know UPenn’s acceptance rate was much higher for applicants who submitted test scores\n\nDon’t get fooled by the artifactual nature of this piece of information.\n\n1. People with low scores withheld them, people with high scores submitted them.\n2. SAT scores are highly correlated with high school GPA; high SAT scorers tend to have higher GPAs than lower SAT scorers\n3. Therefore, the group of people who chose to withhold their lower SAT scores will tend to have lower GPA’s on average than the group who submitted scores.\n\nIn order to draw any conclusion about whether simply submitting a score increases chance of admission you’d need to stratify the data by GPA. (eg “4.0 GPA + score vs 4.0 GPA - score, 3.9 + score vs 3.9 - score, etc, etc)",
          "author": "Strict-Special3607",
          "created": 1634414835,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hgwcoye": {
      "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/hgwcoye/",
      "text": "If your score is at the 75th percentile if anything it’s going to help you for sure.",
      "author": "sekki_woo",
      "created": 1634414452,
      "upvotes": 2,
      "replies": {}
    },
    "hgwf18k": {
      "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/hgwf18k/",
      "text": "Dont worry about it, you did great, and your score is very valuable! :)\n\nAs most test centres are open now, colleges will be wary of the test optional kids for withholding their scores.\n\nIf anything your counsellor should tell you that your at an advantage",
      "author": "KidNo711",
      "created": 1634415487,
      "upvotes": 2,
      "replies": {}
    },
    "hgwpq3c": {
      "link": "/r/ApplyingToCollege/comments/q9ipzk/test_optional_what/hgwpq3c/",
      "text": "I mean, your counselor has no idea. Its really easy to go the common data set of any college and see that around 70% students submit tests scores. (And that was 2020!?) So imagine how many would this year.\n\nIf you get a good score, you are proving your academics are excellent dude. Test optional students have to prove in other ways..",
      "author": "Zestyclose-Suit-5307",
      "created": 1634420174,
      "upvotes": 1,
      "replies": {}
    }
  }
}