{
  "sid": "qacaz1",
  "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/",
  "title:": "HYPSM Or CHYMP?",
  "text": "For the last few years, Columbia has consistently been ranked in the top 5, this year tied with MIT and Harvard for 2nd place. Meanwhile, Stanford has consistently been raked out of the top 5, tied or beaten by schools like UChicago. **Isn't it time to redefine the T5 as Harvard, Yale, Princeton, MIT, and** ***Columbia*****?**\n\nJust wondering y'alls thoughts. Also ik a lot of people on this sub are in Cali/SFBA, but I urge you to think from an international perspective. For example, most Europeans see YPC as right below Harvard, but don't know Stanford is that good (even if it is in reality).\n\nAlso, this sub has a LOT of bias towards computer science. **Taking a more broad, international look at top colleges, I think this T5 is fair.**\n\nThen, **T4 computer science is of course MIT, Stanford, CMU, and Berkeley.**",
  "author": "PedaleFrancisca",
  "created": 1634520250,
  "updated": 1634654144,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.26,
  "comments": {
    "hh259gv": {
      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh259gv/",
      "text": "HYPSM are the five most prestigious undergraduate programs in the US because they have historically attracted the greatest share of the most accomplished students. It doesn’t matter what the us news or anyone who isn’t really educated on top universities thinks. Columbia is not as prestigious for undergrad not because it’s not ranked high enough on some list a journalist invented, but because it doesn’t effectively compete for the students who go on to be Rhodes scholars, Marshall scholars, Yale Law grads, etc when compared for HYPSM. It’s  really as simple as that. Same goes for UChicago. The gap isn’t big, but it’s there.",
      "author": "SnooKiwis7945",
      "created": 1634522038,
      "upvotes": 5,
      "replies": {
        "hh25xw5": {
          "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh25xw5/",
          "text": "Stanford seems to have lower numbers for all of these across the board compared to peer schools. Likely because the plurality of Stanford students end up entering industry as SWEs.",
          "author": "PedaleFrancisca",
          "created": 1634522391,
          "upvotes": -7,
          "replies": {
            "hh262ti": {
              "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh262ti/",
              "text": "Stanford wins cross admits by a significant margin with every school except Harvard, and is really well represented among Rhodes scholars etc. I don’t know where you got the idea that their numbers are low.",
              "author": "SnooKiwis7945",
              "created": 1634522460,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hh2cwj8": {
      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh2cwj8/",
      "text": "Columbia is a great school, but they are a bit misleading when they report their statistics to ranking agencies. For example, they greatly under-report the number of undergrad students, omitting SGS (outright wrong, even by Columbia's enrollment data), Barnard (gray area), and SPS (very gray area) -- which then affects variables used for ranking like student:faculty ratio. That's not just my opinion, [even Columbia profs see all of those as undergrads and note how it has stretched the university's resources](http://www.math.columbia.edu/~thaddeus/undergrad/thoughts.html).\n\nFudging the numbers is not something any of the true top 5 need to do nor something they choose to do.",
      "author": "minimuminfeasibility",
      "created": 1634525995,
      "upvotes": 4,
      "replies": {
        "hh31pzf": {
          "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh31pzf/",
          "text": "[deleted]",
          "author": null,
          "created": 1634542969,
          "upvotes": 1,
          "replies": {
            "hh3shnb": {
              "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh3shnb/",
              "text": "Read the link; that is addressed and not comparable.",
              "author": "minimuminfeasibility",
              "created": 1634563068,
              "upvotes": 1,
              "replies": {
                "hh3w1hs": {
                  "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh3w1hs/",
                  "text": "You're right; that's a pretty stark contrast. I guess I just went off personal experience of not feeling the presence of GS much, but those stats are sound.",
                  "author": "Lawgical101",
                  "created": 1634564847,
                  "upvotes": 2,
                  "replies": {
                    "hh5060w": {
                      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh5060w/",
                      "text": "That's sensible. I suspect there might be more GS students than you realize in your classes -- but [some feel reluctant to out themselves](https://www.columbiaspectator.com/opinion/2019/02/08/we-think-we-know-you-the-atypical-gs-student/).",
                      "author": "minimuminfeasibility",
                      "created": 1634581879,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hh3bzx7": {
              "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh3bzx7/",
              "text": "Does Harvard College use HES to be sneaky with the way it reports stats though?",
              "author": "PedaleFrancisca",
              "created": 1634552340,
              "upvotes": 0,
              "replies": {
                "hh3ogf6": {
                  "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh3ogf6/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1634560886,
                  "upvotes": 0,
                  "replies": {
                    "hh3sg5f": {
                      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh3sg5f/",
                      "text": "Look at their reported undergrad numbers in US News: it is only CC and SEAS and excludes SGS. GS is NOT part-time for the most part and if you went to their own enrollment statistics you would see that. Harvard Extension, Northwestern SPS, etc. are not in the same classes or are tiny -- and compare to Columbia SPS, not SGS. That is even addressed in that link, had you bothered to read it. Get your statistics right.",
                      "author": "minimuminfeasibility",
                      "created": 1634563046,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "hh3ssqa": {
                  "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh3ssqa/",
                  "text": "Nope. HES is different classes than undergrads and can be different instructors. Just like how many executive MBAs hire outside instructors and have their own classes. It is uses the brand, but does not affect other student's classroom experience.",
                  "author": "minimuminfeasibility",
                  "created": 1634563229,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh2337a": {
      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh2337a/",
      "text": "The thing is most people on A2C are from the US, it doesn't really matter what internationals think of our schools because very few people here plan on leaving the country in the future.\n\nAnd the whole acronym is stupid anyway. Every private school in the T30 is academically equivalent to each other. It's really a waste of time to debate the T5 rankings",
      "author": "ssssseabass",
      "created": 1634520952,
      "upvotes": 9,
      "replies": {
        "hh25lyb": {
          "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh25lyb/",
          "text": ">Every private school in the T30 is academically equivalent to each other. It's really a waste of time to debate the T5 rankings\n\nAcademics is only a part of a school. The biggest difference between a place like Harvard and a place like Dartmouth is the peer group and perception as it relates to OCR. There's a reason why Harvard pops up everywhere you look when looking at big awards (Putnam, IMO, IOI, Nobel, etc.). It has about the best peer body you can find in the world. And it has a desirability far surpassing Dartmouth.\n\nNot sure why a lot of people bring the \"academic equivalence\" thing up as if the academics of a university is the reason why most people go to them.\n\n>The thing is most people on A2C are from the US, it doesn't really matter what internationals think of our schools because very few people here plan on leaving the country in the future.\n\nFair enough. Though, even within the US, I don't think Stanford has notoriety anywhere near the level of Harvard, outside of the West Coast.",
          "author": "PedaleFrancisca",
          "created": 1634522222,
          "upvotes": 0,
          "replies": {
            "hh4gy7w": {
              "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh4gy7w/",
              "text": "Everything you just said is wrong.",
              "author": "Task876",
              "created": 1634573991,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh5uy9x": {
      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh5uy9x/",
      "text": "Stanford undergrad ranking takes a hit partly due to its lower four-year graduation rate compared with peers (~75%, while the rest of HYPSM are generally in the mid to high 80s). Since graduation/retention rates make up 22% of a school’s US News rank, lagging in this metric brings down Stanford’s average score. Of course, folks dropping out of Stanford to found tech companies is part of what the school is known for. I don’t think as many CS students are leaving Columbia or Princeton to found unicorn tech companies. \n\nAnother reason HYPSM lives on in the public mind has less to do with undergrad reputation and more to do with overall institutional brand. Yale, Stanford, and Harvard have been the best law schools for decades; Stanford and Harvard are the best business schools and two of the best med schools; and MIT and Stanford are synonymous with tech and engineering. Columbia ties Stanford in medicine but lags in everything else. As such, Stanford’s institutional name continues to carry more weight than Columbia’s.",
      "author": "motheatenblanket",
      "created": 1634595423,
      "upvotes": 2,
      "replies": {}
    },
    "hh29lk1": {
      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh29lk1/",
      "text": "why not all six? go chymps!",
      "author": "newjerseyhate",
      "created": 1634524281,
      "upvotes": 3,
      "replies": {
        "hh2c7ny": {
          "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh2c7ny/",
          "text": "I love this! Everyone wins with this acronym.",
          "author": "toyota2003",
          "created": 1634525631,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hh2x1ct": {
      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh2x1ct/",
      "text": "Students from outside HYPSM schools have been trying to use HYPSM\\*, where \\* is the first letter of their school, for a long time. How effective has that been?\n\nIt’s not like this is an ISO standard - no one is going to officially “redefine” it. Terms that have long been used in common vernacular rarely change, even when no longer accurate.",
      "author": "RichInPitt",
      "created": 1634538978,
      "upvotes": 2,
      "replies": {}
    },
    "hh3idy0": {
      "link": "/r/ApplyingToCollege/comments/qacaz1/hypsm_or_chymp/hh3idy0/",
      "text": "this is funny since u made a post about how college rankings often weigh the wrong things lol",
      "author": "valharius",
      "created": 1634557127,
      "upvotes": 1,
      "replies": {}
    }
  }
}