{
  "sid": "ri68wz",
  "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/",
  "title:": "I feel invalidated for some reason.",
  "text": "*this may seem naive and ignorant, so bear with me*\n\nToday I saw 3 kids I know get into Duke, UPenn, and Princeton. I’m super proud of them and they are super deserving of it, but that’s not where my problem is. Seeing them get into these prestigious colleges just makes me think the one I got into is insignificant (UVA). I question myself saying “could I have done better?” and “Did I limit myself?”. I know I’m not qualified for those t10 schools, but it just makes me think. Thank you for listening to my rant, and please don’t take this as egocentric or naive. I don’t mean to come off that way",
  "author": "Throwawayyadigdog",
  "created": 1639706546,
  "updated": 1639785713,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.89,
  "comments": {
    "hov7umz": {
      "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hov7umz/",
      "text": "Bruh, UVA is like t25, so that's pretty significant considering there's thousand of colleges in the US. Just think of the thousands of students that are attending t50, t100, t200, etc schools and how they would think of your own school as \"prestigious.\"",
      "author": "Rude-Candidate-8728",
      "created": 1639709443,
      "upvotes": 12,
      "replies": {
        "hovcax9": {
          "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovcax9/",
          "text": "Yea that’s true, I guess it’s the people I’m surrounded by that impact my thoughts. Thank you for this :)",
          "author": "Throwawayyadigdog",
          "created": 1639711470,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hov5eqj": {
      "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hov5eqj/",
      "text": "You being accepted to UVA is in no way insignificant. If anything you will probably have more fun and less stress with this class load. I have the same sort of thought, I definitely could have shot higher but I liked Miami University and that’s where I’ll go. Either way, you will end up having opportunities, these big colleges have resources and your experience at college will be different from your friends’. You will still find your group of friends, the major that fits with you and all that. Don’t think bad of yourself, what ever school you go to will work out",
      "author": "nguets",
      "created": 1639708367,
      "upvotes": 4,
      "replies": {}
    },
    "hovb75k": {
      "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovb75k/",
      "text": "Same. I got into Emory for ED I loved the school when I applied. But seeing others get into Ivys, some people asking what Emory is😭along with my parents wondering if I could’ve gotten into an Ivy makes me feel like I could’ve done better and is making me regretful",
      "author": "Skillfulaphid",
      "created": 1639710982,
      "upvotes": 2,
      "replies": {
        "hovcvfw": {
          "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovcvfw/",
          "text": "Emory is so good!!!! I was going to apply, but I didn’t want to go to Atlanta lmao. It’s a t25 too, so you accomplished a lot :)\n\nEdit: I also think getting accepted makes you think you have no limits  (for me personally at least lol)",
          "author": "Throwawayyadigdog",
          "created": 1639711735,
          "upvotes": 2,
          "replies": {
            "hovipgb": {
              "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovipgb/",
              "text": "Thank you so much!! I also definitely agree that an acceptance leads to greater expectations. Congrats on uva :)",
              "author": "Skillfulaphid",
              "created": 1639714367,
              "upvotes": 1,
              "replies": {
                "hovlpp5": {
                  "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovlpp5/",
                  "text": "No worries, I hope you enjoy your next 4 at Emory!",
                  "author": "Throwawayyadigdog",
                  "created": 1639715805,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hove3cm": {
      "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hove3cm/",
      "text": "Yo I also go to a school where a lotta people qualify for ivys and a lot of them are my friends and I think the important thing to keep yourself from developing an inferiority complex is to remember why you chose the school you chose and why the school you chose, chose you! If you applied early then you definitely love the school for a lot of reasons and if they chose you then they also love you for a lot of reasons! You’re being appreciated as much as you appreciate the school and that’s all we can really ask for as admits at the end of the day! You can still feel super proud of yourself and feel happy for other people if you remember those things ^-^",
      "author": "Full_Profile5435",
      "created": 1639712270,
      "upvotes": 2,
      "replies": {
        "hovfnv8": {
          "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovfnv8/",
          "text": "Thank you :), I think I should be grateful for being able to attend uva. Although it’s not an Ivy it’s still a good school, and I should be happy for those who are Ivy bound!",
          "author": "Throwawayyadigdog",
          "created": 1639712962,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hovlx8s": {
      "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovlx8s/",
      "text": "Dude. You got into Virginia. You should be Shawn Michaels crotch chopping at people right now. UVA is a fantastic school and I (along with thousands upon thousands of others) would kill to get in.",
      "author": "myfedoraismlg",
      "created": 1639715905,
      "upvotes": 2,
      "replies": {
        "hovmp88": {
          "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovmp88/",
          "text": "Can’t say I understand your reference, but you’re right I should be grateful to attend UVA. Thank you!",
          "author": "Throwawayyadigdog",
          "created": 1639716298,
          "upvotes": 1,
          "replies": {
            "hovmwv7": {
              "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hovmwv7/",
              "text": "Lol I should’ve recognized a WWE reference is probably not gonna have much crossover here [but this is what I’m talking about ](https://youtu.be/_P2MRAD4eAs)",
              "author": "myfedoraismlg",
              "created": 1639716407,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "howzjd6": {
      "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/howzjd6/",
      "text": "UVA is a great school, anyone would be ecstatic to have the opportunity to attend. Also remember it’s not about where you go. It’s about how you make the most of the opportunities given to you there. It’s natural to wonder given the nature of those around you (especially the person who got into Duke. He seems like a stud), but know that UVA is not an insignificant school by any means, and you are just as fortunate as them to go to such a great school. Please do me a favor and stop thinking those thoughts cuz all it’s gonna do it make you less proud of yourself and drive you crazy. PS, I guarantee that if these kids didn’t make it into these schools, at least one of them would’ve gone to UVA :)",
      "author": "Ultralazyboy7",
      "created": 1639748245,
      "upvotes": 1,
      "replies": {
        "hoyc4hk": {
          "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hoyc4hk/",
          "text": "Thanks nugget! You are the most deserving person to go to Duke, imma see you at those basketball games ‼️",
          "author": "Throwawayyadigdog",
          "created": 1639767661,
          "upvotes": 1,
          "replies": {
            "hoydmc9": {
              "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hoydmc9/",
              "text": "See u there 😈",
              "author": "Ultralazyboy7",
              "created": 1639768236,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoy2n07": {
      "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hoy2n07/",
      "text": "Comparison is the thief of joy. You have a wonderful path ahead of you that is full of amazing experiences. Your friends' paths are going to be different, but wonderful as well. Cheers to ALL of you. \n\nI think it's time to watch some hype videos.\n\n[Here](https://www.youtube.com/watch?v=TfqkcyGMq3A)\n\n[Here](https://www.youtube.com/watch?v=F37n22Pj6dU)\n\n[Here](https://www.youtube.com/watch?v=aQ0QhUX0634)\n\nand if you like sports, there's [this](https://www.youtube.com/watch?v=W64zdiiDKgM), [this](https://youtu.be/-htxrSzpDro), and [this](https://www.youtube.com/watch?v=CCbmDo2BsjM).",
      "author": "UVaDeanj",
      "created": 1639764011,
      "upvotes": 1,
      "replies": {
        "hoyby3o": {
          "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hoyby3o/",
          "text": "Thank you DeanJ, I can’t wait to be at UVA for the next 4 :)",
          "author": "Throwawayyadigdog",
          "created": 1639767594,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "howeiwb": {
      "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/howeiwb/",
      "text": "If you think UVA is insignificant, I highly doubt you are smart enough to go there",
      "author": "Valthr4x_",
      "created": 1639734984,
      "upvotes": 0,
      "replies": {
        "hoyckz9": {
          "link": "/r/ApplyingToCollege/comments/ri68wz/i_feel_invalidated_for_some_reason/hoyckz9/",
          "text": "UVA is in no way shape or form insignificant, I could’ve worded it better for sure. Fortunately enough I think I was just smart enough to get in :)",
          "author": "Throwawayyadigdog",
          "created": 1639767835,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}