{
  "sid": "qqkm0n",
  "link": "/r/ApplyingToCollege/comments/qqkm0n/optional_resume_mistake/",
  "title:": "Optional Resume Mistake",
  "text": "So basically I applied ED to an Ivy League school and I would say I'm decently qualified. I submitted the optional resume and it was my first time ever making a resume and I didn't include the dates of my activities because they were listed on my activities list on the Common App and I also made my resume 2 pages long. Would I get rejected for something like this? Should I send the school an updated resume?",
  "author": "whatd0inamemyself",
  "created": 1636513636,
  "updated": 1636653394,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk0zpb5": {
      "link": "/r/ApplyingToCollege/comments/qqkm0n/optional_resume_mistake/hk0zpb5/",
      "text": "There is no need to send an updated resume in my opinion.",
      "author": "jjhoster",
      "created": 1636516427,
      "upvotes": 3,
      "replies": {
        "hk16sr3": {
          "link": "/r/ApplyingToCollege/comments/qqkm0n/optional_resume_mistake/hk16sr3/",
          "text": "How much are optional resumes considered? How much focus is put on resumes? Does format affect consideration? Are there ways that submitting an optional resume would have more of a negative effect than a positive effect? How commonly does a resume have a positive effect on applications?",
          "author": "doridorijamjam",
          "created": 1636520330,
          "upvotes": 1,
          "replies": {
            "hk18yek": {
              "link": "/r/ApplyingToCollege/comments/qqkm0n/optional_resume_mistake/hk18yek/",
              "text": "This is just my opinion - but I don’t think a resume is necessary for an undergraduate application. The Common App provides ample space for a student to list and describe their activities.\n\nPlus, anything that is optional can’t hold a lot of weight.",
              "author": "jjhoster",
              "created": 1636521618,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk0zamp": {
      "link": "/r/ApplyingToCollege/comments/qqkm0n/optional_resume_mistake/hk0zamp/",
      "text": "You won’t get rejected for any of this. First, there is no preset guideline for resumes (except for UT Austin), so without specifying what they’re after, they can’t penalize you. Second, an updated resume will just be more clutter for them to sift through when they probably won’t even look at your first resume.",
      "author": "ApplyingToCollege21",
      "created": 1636516218,
      "upvotes": 1,
      "replies": {}
    },
    "hk0zx9f": {
      "link": "/r/ApplyingToCollege/comments/qqkm0n/optional_resume_mistake/hk0zx9f/",
      "text": "The dates are pretty important imo because they give context on the consistency and longevity of your involvement in an activity. I’m not 100% sure but I’d lean toward sending the college an updated resume. 2 pages is not something they’d reject you over.",
      "author": "1800needhelpasap",
      "created": 1636516540,
      "upvotes": 1,
      "replies": {}
    }
  }
}