{
  "sid": "qw0og2",
  "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/",
  "title:": "how to send an entire stressed senior class over the edge",
  "text": "Seniors,\n\nI looked over the transcripts. Your grades are fine, but I have NEVER seen such weak course work in the past 10 years. Moreover, class participation and effort are also not at its optimal. I want you to know that you might have to be mentally prepared that you are not going to get into the competitive colleges of your choice. Also, compromising attitude is not beneficial for you in the short and long term. Many of you are not working to your potential. The only transcripts that are looking adequate are Tracy, Felix, Rei, Lola, and Max.\n\nI am disappointed with the slackness of things. I see your lack of caring and commitment as seniors to school cleanliness, spirit, sisterhood, communication, and overall leadership.\n\nThose applying for UCs and CSUs should heightened your gears, since the deadline is looming near. \n\nIf I have overlooked your contributions and hard work, please disregard this email. If you wish to respond, please talk to me instead of an email.",
  "author": "throwawayKukido",
  "created": 1637159959,
  "updated": 1637378997,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 1.0,
  "comments": {
    "hl052ae": {
      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl052ae/",
      "text": "So... principal is just going to ignore that there's been a pandemic and altered teaching over the past couple years? Never mind that, though; the message itself is nonsense. Your principal is not leading by example with such clumsy phrases.\n\n* \"<plural subject> are not at its optimal\": \"not at their optima\" -- or (better) just say \"are not optimal.\"\n* \"want you to know that you might have to be mentally prepared that you are not going...\": what weak-voiced word salad is this?  Say \"Prepare to be disappointed on your acceptances to competitive...\" like you actually have a spine.\n* \"compromising attitude is not beneficial for you in the short and long term\": Yuck. The usual phrase with a \"not\" is \"short or long\" (¬A ∪ ¬B = A∩B) though you could say \"neither short nor long\" but really what is \"compromising attitude?\" Just say \"A bad attitude will hurt your prospects sooner and later.\"\n* \"the slackness of things\": What weasel-word phrase is this? Slackness? And what \"things?\" Yeah, English is Germanic and Ding is a useful word, but just say which things.\n* \"should heightened your gears\": Sheesh, this is awful. Just say \"Work harder\" or, even better, \"Work harder and smarter.\"\n\nThat's like a B or C in a freshman writing seminar.\n\nFinally, what a long-winded way to basically say \"you kids get off my lawn!\"",
      "author": "minimuminfeasibility",
      "created": 1637166329,
      "upvotes": 14,
      "replies": {
        "hl0fiir": {
          "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl0fiir/",
          "text": "Haha... the fact that our principal is also our AP Lit/Lang teacher adds to the irony. \n\nShe had a meeting with us after we tried to enforce some (existing) rules to improve \"school cleanliness, spirit, sisterhood, communication, and overall leadership.\" Mostly minor things - no littering/leaving personal belongings in the hallway, no washing dishes during class, and assigned seating. However, it seems that a few younger students felt discriminated against by the rules and wished to leave the school. Since they are at a breaking point, we should cut them some slack. \n\nAccording to her, the main point of the email was that we should take more APs. It's probably worth noting that the add/drop date for classes is long gone. She also said we should talk to her individually if we have issues with the email, but the last line didn't give that impression.",
          "author": "throwawayKukido",
          "created": 1637170415,
          "upvotes": 1,
          "replies": {
            "hl1xnpu": {
              "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl1xnpu/",
              "text": "Speaking as an adult:\n\nThe reason she wants you to talk with her in person is that the \"e\" in \"email\" stands for \"evidence.\" I would strongly encourage you guys to put your opposition to the email in writing, because that's going to have an effect on her during a future review. Email her, bcc yourself, and cc someone else in a position of authority, like the head of the PTA. Better yet, have your parent do so.",
              "author": "lotsofgrading",
              "created": 1637192444,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "hl0en2q": {
      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl0en2q/",
      "text": "This lady is kinda late to the party, no?  Like, if people were signing up for weak courses, that should have been addressed each year in August, not senior year after it's all over.  There's essentially no point in sending this message as far as impacting the future because it's too late to change anything.  Most colleges don't care that much about your senior year spring course schedule and understand that students might back off a bit.  They still look at it and want to see that you're challenging yourself, but if you didn't challenge yourself in 10th and 11th grade, then taking hard classes your final semester isn't going to do anything.  At all.  \n\nSo this email was basically just a longwinded way of saying \"you suck,\" which I find incredibly unprofessional, unnecessary, and frankly cruel.  There is zero reason to insult 17 year olds or call them out for something that you should have been checking, advising them on, and taking a more active role in managing for the last three years.  This is literally nothing more than a lengthy insult because of the timeline.  There's no \"motivational\" angle to this.  It would be like berating someone about to retire for not having a more lucrative or successful career - that's not motivation, it's just pure disrespect.\n\nSeriously, this is a major red flag to me about her competency.  If I were you, I would show this email to your parents, and explain what I explained here - that this is nothing more than emotional abuse and there's zero upside in this.  If they feel the way I do right now, they'd be reaching out to the school board / administration to make sure they know how poor this lady's character and capabilities are.",
      "author": "ScholarGrade",
      "created": 1637170079,
      "upvotes": 8,
      "replies": {
        "hl1wtzq": {
          "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl1wtzq/",
          "text": "Following up on this, and speaking as a teacher, she should not be making comparative statements about students' grades outside of a private letter of recommendation, and even then it should take the form of \"Tracy is among the top five students in the class\" - not \"Tracy, Felix, Rei, Lola, and Max are the top five students in the class.\"\n\nPut another way, it's inappropriate for an instructor to say *even to a student*, outside of a private letter of recommendation, \"You're the best student in this class.\" We can only say, \"You're one of the best students in this class.\" If this person sent an email that named specific students as having the best transcripts, that's a problem.\n\nEven when I was in high school, before students could use computers to check their grades, grades were tacked up on the wall according to student ID number so that we couldn't tell what one another's grades were. This norm has been around for a long, long time.\n\nI'm sorry to be focusing on this one thing, but it's really inappropriate.",
          "author": "lotsofgrading",
          "created": 1637192078,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "hkzu3ak": {
      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hkzu3ak/",
      "text": "Who sent this?",
      "author": "mommacat94",
      "created": 1637161870,
      "upvotes": 6,
      "replies": {
        "hkzv4v3": {
          "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hkzv4v3/",
          "text": "This is our principal. We're a small school, so we have to show her our personal essays, supplements, and recommenders as well. She also helps the counselor write the counselor recommendation.",
          "author": "throwawayKukido",
          "created": 1637162313,
          "upvotes": 6,
          "replies": {
            "hkzvfxp": {
              "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hkzvfxp/",
              "text": "omg brutal. fingers crossed that you are tracy, felix, rei, lola, or max",
              "author": "enkayeleven",
              "created": 1637162440,
              "upvotes": 12,
              "replies": {
                "hl0f85t": {
                  "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl0f85t/",
                  "text": "Maybe.  But you think those people are happy to be called out like this?  One of my worst moments in school growing up was when the most hated teacher in the school berated our class and used me as an example of what people should be like.  I'm sorry ma'am, but I'm just trying to get my A and get out of here.  Don't make this personal.",
                  "author": "ScholarGrade",
                  "created": 1637170306,
                  "upvotes": 9,
                  "replies": {
                    "hl0jybh": {
                      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl0jybh/",
                      "text": "I agree here. Some of my close friends have historically been the toppers of their classes, but they have always despised being called out this way (thankfully, examples of that are very limited around me).",
                      "author": "eccentric-Orange",
                      "created": 1637172134,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hl0lyd4": {
                      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl0lyd4/",
                      "text": "very true, bad situation either way",
                      "author": "enkayeleven",
                      "created": 1637172915,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl0xrly": {
      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl0xrly/",
      "text": "Love bad grammar here thats what really sells it",
      "author": "collegestuff1235",
      "created": 1637177571,
      "upvotes": 1,
      "replies": {}
    },
    "hl1rdox": {
      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl1rdox/",
      "text": "If they literally NAMED students that were adequate your school much be small asf",
      "author": "PitifulClerk0",
      "created": 1637189696,
      "upvotes": 8,
      "replies": {}
    },
    "hl20y1d": {
      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl20y1d/",
      "text": "Glad I go to a school with 4000 students y’all stay safe tho",
      "author": "nailsage_anise",
      "created": 1637193931,
      "upvotes": 6,
      "replies": {}
    },
    "hl31a6w": {
      "link": "/r/ApplyingToCollege/comments/qw0og2/how_to_send_an_entire_stressed_senior_class_over/hl31a6w/",
      "text": "no and they named students too 😭",
      "author": "Foreverinneverland24",
      "created": 1637211101,
      "upvotes": 1,
      "replies": {}
    }
  }
}