{
  "sid": "qvg0w4",
  "link": "/r/ApplyingToCollege/comments/qvg0w4/how_weakcliche_is_this_topic/",
  "title:": "how weak/cliche is this topic",
  "text": "i've spent hours watching essay tip vids and reading successful essay samples to try to figure out where my essay stands and i'm so fed up with the whole process, lmfao. i've written multiple drafts and so far the only usable one still makes me cringe even thinking about it. imo it uses a really cliche theme, but the feedback i've received from irl people who've read it contradicts my opinion. i chose the \"gratitude\" topic to talk about how i received unexpected encouragement through the people i've met in extracurriculars i've pursued over high school and how it helped me overcome self-esteem and confidence issues, as well as how it's impacted me as a pretty secluded homeschooled student and motivated me to seek more opportunities/activities outside of school. the only thing i'm happy about is the writing itself, but the whole theme feels so flat. maybe i've spent too long on this to see clearly though. honest opinions/advice would be really really appreciated ;-;",
  "author": "Prisoner-9430",
  "created": 1637091272,
  "updated": 1637179154,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkw4uc1": {
      "link": "/r/ApplyingToCollege/comments/qvg0w4/how_weakcliche_is_this_topic/hkw4uc1/",
      "text": "I’ve been going through the same thing with my essays! I think it sounds like a pretty cool topic. Whenever I’m unsure if my topic sounds cliche, I try to think of the common values associated with my specific topic. For example, if someone were to write about volleyball, common values associated with it includes teamwork, communication, perseverance, etc. But some uncommon values are ones we don’t typically associate with that activity - has volleyball helped you learn authenticity, or has it taught you objectivity?\nA great resource I use to find these uncommon connections is by googling College Essay Guy’s Value exercise. I hope this helps and you can do this!",
      "author": "NM_1234",
      "created": 1637091633,
      "upvotes": 3,
      "replies": {
        "hky4vu5": {
          "link": "/r/ApplyingToCollege/comments/qvg0w4/how_weakcliche_is_this_topic/hky4vu5/",
          "text": "aahh that value example was actually really helpful in getting me into a different mindset. thank you so much, good luck with your essays! <3",
          "author": "Prisoner-9430",
          "created": 1637122405,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkxi79r": {
      "link": "/r/ApplyingToCollege/comments/qvg0w4/how_weakcliche_is_this_topic/hkxi79r/",
      "text": "Any theme can be good, as long as what you wrote can't be emulated by another person (ie write specifically in your own voice). For the gratitude stuff and any essay highlight other individuals, just be careful not to just talk about them, but center the essay more around yourself! Be selfish/self-centered in that regard. Don't forget the impacts like what you did after you changed as well. But if others have read it and liked it, then I think you should be good. :)",
      "author": "FrostAries",
      "created": 1637112102,
      "upvotes": 1,
      "replies": {
        "hky4yug": {
          "link": "/r/ApplyingToCollege/comments/qvg0w4/how_weakcliche_is_this_topic/hky4yug/",
          "text": "thank you for the input!!",
          "author": "Prisoner-9430",
          "created": 1637122447,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}