{
  "sid": "qmz2u9",
  "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/",
  "title:": "2.7 GPA Senior. Any advice would be helpful",
  "text": "I won’t go in to detail and I’ll give a summary of my HighSchool career with a TL;DR at the bottom. In 9th grade I wasn’t in a good place mentally long story short I ended up dropping out half way thru the school year. Things got better and next school year in enrolled in high school and started 9th grade over again. I fought the good fight for the last three years and did pretty alright. This year I moved to a new school and as I was getting my transcript I found out that my grades for my 1st 9th grade year were put together with my other grades, which makes sense I guess. But what I didn’t realize was how low those grades actually were(50s 60s). So now I’m stuck,confused and don’t know what to do. I planned on getting scholarships and financial aids and things like that, but know I don’t even know if I can go to college at this point. For additional information I wanted to go to college to get a computer science degree and start a career in software engineering. What would be the course of action from this point? My mom is a single mother and she works so hard and I don’t want to burden her my problems. Any advice would be much appreciated.",
  "author": "BotKing_",
  "created": 1636072572,
  "updated": 1636135730,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.92,
  "comments": {
    "hjcz47k": {
      "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/hjcz47k/",
      "text": "Don't sweat it! My high school has free CC and a few weeks ago they had an online seminar with other kids who went that route and I remember 1 was on his way to become a Systems Engineer and another a Nurse Practitioner and all of them were so relaxed and excited about taking all the courses for free, then all are transferable to many universities in the area (I'm in Michigan) they were doing all this while in High School. You only need 2 be enrolled in at least 1 course in your high school and they were all taking \"Seminar\" which is like social hour. So check with your school counselor. There are many ways to the top!",
      "author": "MackinacFleurs",
      "created": 1636075002,
      "upvotes": 8,
      "replies": {}
    },
    "hjcu5n8": {
      "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/hjcu5n8/",
      "text": "Community college or military. Community college is great especially if you live in Cali, you get two years free and if you maintain a good GPA you could get into Berkeley regardless of your highschool blunder",
      "author": "Gubuyguy",
      "created": 1636072817,
      "upvotes": 11,
      "replies": {}
    },
    "hjcw0qf": {
      "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/hjcw0qf/",
      "text": "Did you take an SAT or ACT?  If you did well there that can sometimes qualify you for entry for your in-state public schools  (also for out of state public schools, but financially in-state is probably better for you).   Most states have some schools where a 2.5 GPA or better is good enough to get you in even with a poor test score, but sometimes that's not better than the community college path.\n\nCC and transfer isn't a bad option at all -- the classes you take at a community college can be applied towards a four year degree, and transfer admissions are mostly based on those CC grades, not your high school ones.\n\nWhatever option you go with, you should make sure to fill out and submit a FAFSA soon - that's how you get the financial aid you might need.  Don't think of that as a problem that burdens your mom - it's something you will need her to help with probably, and it doesn't take that long.",
      "author": "BrawnyAcolyte",
      "created": 1636073625,
      "upvotes": 3,
      "replies": {}
    },
    "hjcxb7n": {
      "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/hjcxb7n/",
      "text": "I’d look at all the CS programs around you and see how they admit. Some don’t look at 9th grade at all, except to ensure you have fulfilled minimum math courses. In California only Cal Poly considers 9th grade among all UCs and CSUs, for example. It’s not uncommon for schools to start with 10th grade. All of them will slice and dice your transcript with their own calculation rules - some might see you repeated 9th grade and only look at that second school plus your senior year. To save yourself application money and time, see if you can sign up for virtual appointments with admissions counselors and see how they review things and if they think you are competitive. They’ll have advice. And one option is to consider community college.\n\n Most public schools have clear pipelines from community colleges and some do a good job of prepping students to transfer and do well, often at a much lower cost that a Pell Grant could cover. You could ask the admissions reps and community college counselors about that as one plan. \n\nIf you happen to be in California I’ve researched this and will share some tips.",
      "author": "RetiringTigerMom",
      "created": 1636074199,
      "upvotes": 2,
      "replies": {}
    },
    "hjd7d7z": {
      "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/hjd7d7z/",
      "text": "Depending on which state you are located you should be looking for CC. I believe that’s a great way to save money and to have better grades while experiencing college life.",
      "author": "moisescr_22",
      "created": 1636078755,
      "upvotes": 2,
      "replies": {}
    },
    "hjdjbon": {
      "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/hjdjbon/",
      "text": "I see a lot of people saying go to community college which is a great option. However, if you really want to attend a university, you still have lots of options. Explain your hardships in the additional info section of the common application, apply with fee waivers, and request more aid if needed when you get your acceptances. All aid is not merit-based, many schools offer need-based aid.",
      "author": "Think-Librarian-1600",
      "created": 1636084785,
      "upvotes": 2,
      "replies": {}
    },
    "hjem0p6": {
      "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/hjem0p6/",
      "text": "Don’t be afraid to go to community college. They are good two year schools in which even someone with a “bad” academic career in high school can get into. Make the most of those two years and then hopefully transfer to a good college.",
      "author": "Training-Web6207",
      "created": 1636114372,
      "upvotes": 1,
      "replies": {}
    },
    "hjfspgs": {
      "link": "/r/ApplyingToCollege/comments/qmz2u9/27_gpa_senior_any_advice_would_be_helpful/hjfspgs/",
      "text": "I feel for you man. I had a 2.6 GPA freshman year too. My situtation is different but trust me I know how it feels. I think if you just do good in community or find your state school, you can really apply to anywhere. I was browsing this news and it really made me realize, as long as I keep being consistent and pursue my passions while staying true to what I value, things will work out. Find help ask help always seek it even if you don't feel like the world is all rainbows and sunshine. You have such a beautiful story and i see a fellow doer trying to make something for himself. lets go! news: https://www.charlotteobserver.com/news/local/education/article242834461.html",
      "author": "mysunshinebig",
      "created": 1636132481,
      "upvotes": 1,
      "replies": {}
    }
  }
}