{
  "sid": "qytekv",
  "link": "/r/ApplyingToCollege/comments/qytekv/picking_a_college/",
  "title:": "Picking a college",
  "text": "I am currently a junior in high school and am a North Carolina resident. I have the credentials to get into the colleges I want to get into but I’m unsure which is worth it. The three main colleges I have on my list are Purdue, Virginia Tech, and NC State. I’m going into engineering but I have to ask. Are the out of state tuition costs going to be worth the experiences you can find at the other colleges compared to the in state tuition at NC State? I’m looking more objectively and looking at other peoples subjective opinions so I have a better idea. Thank you!",
  "author": "CreativeName1337",
  "created": 1637495435,
  "updated": 1637687959,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hli1k0s": {
      "link": "/r/ApplyingToCollege/comments/qytekv/picking_a_college/hli1k0s/",
      "text": "NC State has an incredible engineering college, so that would be my first choice as an in-state applicant... The new campus is amazing and the area has near great student life, plus the Research Triangle Park will give you access to a lot of future opportunities.",
      "author": "prsehgal",
      "created": 1637496098,
      "upvotes": 9,
      "replies": {
        "hli1rqe": {
          "link": "/r/ApplyingToCollege/comments/qytekv/picking_a_college/hli1rqe/",
          "text": "Yes I feel like it would be very difficult to justify going anywhere else when NC State is providing me that price tag",
          "author": "CreativeName1337",
          "created": 1637496255,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlib6lk": {
      "link": "/r/ApplyingToCollege/comments/qytekv/picking_a_college/hlib6lk/",
      "text": ">Are the out of state tuition costs going to be worth the experiences you can find at the other colleges compared to the in state tuition at NC State?\n\nDepends on the cost differential, but given reasonable expectations there, the answer is almost certainly \"no\".",
      "author": "jayphoward",
      "created": 1637502245,
      "upvotes": 3,
      "replies": {}
    },
    "hlihv3u": {
      "link": "/r/ApplyingToCollege/comments/qytekv/picking_a_college/hlihv3u/",
      "text": "I doubt Purdue or Virginia Tech are going to end up being a better value than NC State, which is very good.\n\nIf you are in a situation where you qualify for a lot of need based aid, some private options might be as inexpensive or even a better value than in-state.\n\nThere are also a few public options that can get really inexpensive with the right merit scholarships - Texas A&M with national merit is a good example. That's not necessarily a better option than NC State, but it could be pretty competitive.",
      "author": "BrawnyAcolyte",
      "created": 1637505731,
      "upvotes": 3,
      "replies": {}
    }
  }
}