{
  "sid": "qdha9q",
  "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/",
  "title:": "Does Schools that meets 100% of demonstrated financial need provide living expenses?",
  "text": "Hi friends!\n\nDoes anyone know if US Colleges that meets 100% of demonstrated financial aid (such as Yale, MIT, Harvard etc.) provide living expenses as well? Or is it simply no tuition and you would have to pay for your own flights, meals, transport etc.?",
  "author": "humble-burger",
  "created": 1634910348,
  "updated": 1635183941,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhmbner": {
      "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhmbner/",
      "text": "Go look on any of their websites to see the total cost of attendance, which includes living expenses (room and board), fees, and an estimate of personal expenses. Need is calculated based on that total cost of attendance. Look at the travel estimate to see if it seems reasonable for you - I have no idea whether that is increased for international students.\n\nKeep in mind that your financial need is what the college thinks you need, not what you think you need.",
      "author": "elkrange",
      "created": 1634910618,
      "upvotes": 3,
      "replies": {
        "hhp6irj": {
          "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhp6irj/",
          "text": "Ahh. True! Thank you for pointing that out! I will check out their website. Thankyou!",
          "author": "humble-burger",
          "created": 1634956320,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhmbjqd": {
      "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhmbjqd/",
      "text": "It includes living expenses (rent, meals) and some personal expenses (travel, books, miscellaneous) as budgeted by the school. Some include (small) loans in the formula but yes, cost of living is provided along with tuition.",
      "author": "Thirdtimesacharm4me",
      "created": 1634910575,
      "upvotes": 2,
      "replies": {
        "hhp6gk8": {
          "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhp6gk8/",
          "text": "Ahh I see! But I suspect travel, miscellaneous can be quite subjective from person to person. Do you have any idea how they calculate the amount?",
          "author": "humble-burger",
          "created": 1634956288,
          "upvotes": 1,
          "replies": {
            "hhp9i7k": {
              "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhp9i7k/",
              "text": "Only the school knows that, but most of the schools that meet full need are very transparent about what their cost will be. You can also use their websites and plug your financial info into their Net Price Calculator and those are generally pretty accurate in my experience (unless you have a family business or another complicated financial exception). Their website should also state whether they “meet full need” with loans (meaning they expect money from you) or without loans (meaning they don’t expect you to take loans, but they do usually expect you to contribute $2,000 - $3,000 from summer work). Some will also include a Federal Work Study “award” which means you will need to also come up with more money, which they “help” you obtain by offering you on campus employment during the year.",
              "author": "Thirdtimesacharm4me",
              "created": 1634957965,
              "upvotes": 2,
              "replies": {
                "hht6a6i": {
                  "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hht6a6i/",
                  "text": "I see. Thank you for sharing!",
                  "author": "humble-burger",
                  "created": 1635039174,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhmn074": {
      "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhmn074/",
      "text": "It's total cost of attendance, but schools that provide that much institutional aid make up their own rules about how much need each student has.\n\nOne of my kids is a student at one of these 100% need met schools and her freshman financial aid award letter included a statement that all students are expected to contribute a minimum of 2K towards their education each year.  For FAFSA 0 EFC families this basically means that you need to get a summer job to cover the costs getting to campus in August, your books, supplies and misc personal stuff.  All of the expenses that are paid directly to the university like tuition, fees, room and board are covered by aid.",
      "author": "thursmalls",
      "created": 1634915288,
      "upvotes": 2,
      "replies": {
        "hhp6a9t": {
          "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhp6a9t/",
          "text": "Hmm I see. This is really insightful. I did not expect students in 100% need met schools to contribute any sum of money if they meet a certain requirements. Thank you for sharing this, now I know!",
          "author": "humble-burger",
          "created": 1634956197,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhmvaag": {
      "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhmvaag/",
      "text": "Yes for most schools, there might exceptions. Better look into QuestBridge colleges, those schools generally hold better standards in financial aid package.",
      "author": "DiarrheaASMR28",
      "created": 1634918619,
      "upvotes": 1,
      "replies": {
        "hhp65d2": {
          "link": "/r/ApplyingToCollege/comments/qdha9q/does_schools_that_meets_100_of_demonstrated/hhp65d2/",
          "text": "I see. Thank you for sharing!",
          "author": "humble-burger",
          "created": 1634956125,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}