{
  "sid": "r3u4cx",
  "link": "/r/ApplyingToCollege/comments/r3u4cx/how_creative_is_too_creative_uc_piq_help/",
  "title:": "How Creative is TOO Creative? (UC PIQ help)",
  "text": "So I'm on my third PIQ and I feel so conflicted. I keep hearing everyone say that the UCs don't want \"style\" or \"creativity,\" they just want you to get to the point. But I feel like this goes against every piece of writing advice I've ever been taught. Like, no dialogue? No imagery? No storytelling? I can understand avoiding gimmicky stuff (poems, distracting metaphors, etc.), but does that mean I can't use ANY style or narrative elements at all? It just feels... wrong.\n\nI'm actively trying to be straightforward and concise in my responses with elements of my personal voice, but something just feels missing? I've tried to make my 2 completed PIQs more engaging by adding a brief hook and some storytelling, but now I'm worried that I've over done it because it seems like EVERYONE is advising against creativity.\n\nAm I overthinking this? Will having too much \"style\" reflect badly on my application? Someone help",
  "author": "yuuzuuu",
  "created": 1638068345,
  "updated": 1638205014,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "hmct0ce": {
      "link": "/r/ApplyingToCollege/comments/r3u4cx/how_creative_is_too_creative_uc_piq_help/hmct0ce/",
      "text": "Brief hook and some story telling is ok - since it is only 350 words, they don’t want you to waste words building up a scene. Some PIQs like challenges and creativity requires a bit of story telling. Not using the 350 words effectively, UC calls it missed opportunities- they won’t deduct but it won’t add to your score.",
      "author": "svday",
      "created": 1638068945,
      "upvotes": 8,
      "replies": {
        "hmctc5r": {
          "link": "/r/ApplyingToCollege/comments/r3u4cx/how_creative_is_too_creative_uc_piq_help/hmctc5r/",
          "text": "I see, thanks for the insight!",
          "author": "yuuzuuu",
          "created": 1638069111,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmdsekc": {
      "link": "/r/ApplyingToCollege/comments/r3u4cx/how_creative_is_too_creative_uc_piq_help/hmdsekc/",
      "text": "i'm having a hard time with this too, i was always taught to have flair in my writing that it has been really hard for me to move away from that in my UC apps. i am afraid that i am doing something wrong since i give a general overview of my work in two of my supps, rather than an exact example in all four. i try to find ideas on youtube but everyone's style of answering the piq is so different it's stressful",
      "author": "neonheadache",
      "created": 1638091224,
      "upvotes": 5,
      "replies": {
        "hmdv4se": {
          "link": "/r/ApplyingToCollege/comments/r3u4cx/how_creative_is_too_creative_uc_piq_help/hmdv4se/",
          "text": "that’s exactly how i feel. it’s so not helpful when everyone online seems to be giving different advice. i’ve seen some really bland piq examples as well as really unique and engaging ones, and i just don’t know which is preferable.",
          "author": "yuuzuuu",
          "created": 1638093387,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmcxnm4": {
      "link": "/r/ApplyingToCollege/comments/r3u4cx/how_creative_is_too_creative_uc_piq_help/hmcxnm4/",
      "text": "~~concision is another kind of beauty~~\n\n ~~brevity is the soul of wit~~",
      "author": "InitialIdea923",
      "created": 1638071271,
      "upvotes": 3,
      "replies": {}
    },
    "hmdl7q5": {
      "link": "/r/ApplyingToCollege/comments/r3u4cx/how_creative_is_too_creative_uc_piq_help/hmdl7q5/",
      "text": "enough creativity to not sound like a robot",
      "author": "phrog3000",
      "created": 1638085534,
      "upvotes": 2,
      "replies": {}
    }
  }
}