{
  "sid": "qku1nn",
  "link": "/r/ApplyingToCollege/comments/qku1nn/do_i_have_to_request_lors_for_each_program_on_the/",
  "title:": "Do I have to request LORs for each program on the common app separately?",
  "text": "I'm applying to transfer, and the common app looks a lot different than two years ago. Last time I applied, I only had one school added to the common app, and I requested all my recommenders to that school. Then I was able to select my recommenders on each program I added later. So each teacher only had to upload their letter one time to the common app.\n\n Is it still the same as two years ago, or is it set up now where I'll have to send emails to every recommender for each school (aka spam my professors with a dozen requests)?",
  "author": "MorphedAxolotl",
  "created": 1635819417,
  "updated": 1639834755,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiysrck": {
      "link": "/r/ApplyingToCollege/comments/qku1nn/do_i_have_to_request_lors_for_each_program_on_the/hiysrck/",
      "text": "Same as before, so you'll only need to invite them once.",
      "author": "prsehgal",
      "created": 1635821001,
      "upvotes": 2,
      "replies": {
        "hlgnuyg": {
          "link": "/r/ApplyingToCollege/comments/qku1nn/do_i_have_to_request_lors_for_each_program_on_the/hlgnuyg/",
          "text": "My recommenders said they were going to press the \"reuse\" button, but I don't see their letters as an option on any programs except the one I invited them to. Does this mean if I send an LOR request to the same emails, it'll auto-submit it without them having to press upload?\n\nCommon App website: \"Transfer recommenders: The first time you submit a recommendation for a student you'll be asked if you want to reuse that form. This means any incomplete or future requests will automatically be submitted for you using the information in this recommendation.\"",
          "author": "MorphedAxolotl",
          "created": 1637462301,
          "upvotes": 1,
          "replies": {
            "hlgpbbv": {
              "link": "/r/ApplyingToCollege/comments/qku1nn/do_i_have_to_request_lors_for_each_program_on_the/hlgpbbv/",
              "text": "I would chat online with the CommonApp customer service about it - looks like they handle transfer recommendations differently.",
              "author": "prsehgal",
              "created": 1637463052,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}