{
  "sid": "q4ckqx",
  "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/",
  "title:": "is Lady Gaga a topic I should stay away from when writing my college app essay?",
  "text": "i am very passionate about lady gaga, I love her music, and know a lot of things about her. as the title of this Reddit post states, should I stay away from this topic in my college app essay? My friend who I told I was gonna write my essay about is saying I shouldn’t write about Lady Gaga but instead write about something normally boring then turn it into a extended metaphor. he’s apparently was told this by his friends who had rich private college counselors.\n\nhonestly I thought writing about lady gaga would be wayy different than what other kids are writing about. but id like to hear your thoughts!",
  "author": "toolic2",
  "created": 1633747244,
  "updated": 1634074146,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hfxuoh0": {
      "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfxuoh0/",
      "text": "the only flaw i see is that you could very easily make the essay too much about Lady Gaga and not enough about you. What does her music and the \"lot of things\" you know about her have to do with you, your values, and your ambitions? Am I learning more about you or Lady Gaga? Why do I care about Lady Gaga, as ab admissions reader who's just scanning your essay for tidbits about your personality and character?\n\neta: there's also the risk of the interviewer not knowing a song well or by name. some people write \"soundtrack essays\" where they frame the essay around a song's lyrics or something, which is a really cool idea except when the person reading it has no idea what the song sounds like and thus losing its cool effect.",
      "author": "thifting",
      "created": 1633750783,
      "upvotes": 19,
      "replies": {}
    },
    "hfxocst": {
      "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfxocst/",
      "text": "Write about whatever you want. Almost any topic can be made into a good essay. This is a double-edged sword, though, because it also means any topic can be made into a bad essay.",
      "author": "FuriousGeorge1435",
      "created": 1633747497,
      "upvotes": 13,
      "replies": {}
    },
    "hfyg7p8": {
      "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfyg7p8/",
      "text": "I think a Lady Gaga essay would be a really cool way to stand out! Just make sure you make it about you as well, maybe write about how her music has inspired you and shaped the way you view the world, or maybe friendships you've cultivated through your fandom. Just make sure that at the end of the day, the AO's are hearing about what makes you a good student and not Lady Gaga a good popstar. Good luck!",
      "author": "m0nsteraplant",
      "created": 1633764793,
      "upvotes": 2,
      "replies": {}
    },
    "hfxslwb": {
      "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfxslwb/",
      "text": "omg i might write about her for mine too ahh!! btw what are u fave gaga songs i need more little monster friends😩😩",
      "author": "maryjaneh0lland",
      "created": 1633749686,
      "upvotes": 1,
      "replies": {
        "hfxsrsp": {
          "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfxsrsp/",
          "text": "replay and replay Dorian Electra remix is my fav songs of hers that are more recent",
          "author": "toolic2",
          "created": 1633749775,
          "upvotes": 1,
          "replies": {
            "hfxsw8j": {
              "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfxsw8j/",
              "text": "yess that and the fun tonight remix🤌🤌",
              "author": "maryjaneh0lland",
              "created": 1633749840,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfyaihq": {
      "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfyaihq/",
      "text": "I'm interested. AOs read a bunch of similar essays every day, so shaking things up with a Lady Gaga passion project could make you stand out, if done well.",
      "author": "LadyMjolnir",
      "created": 1633760565,
      "upvotes": 1,
      "replies": {}
    },
    "hfz1a07": {
      "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfz1a07/",
      "text": "yes",
      "author": "walruslegolas",
      "created": 1633781025,
      "upvotes": 1,
      "replies": {}
    },
    "hg14p1o": {
      "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hg14p1o/",
      "text": "Can't read my, can't read my, no he can't read my",
      "author": "BrownMambaOfficial",
      "created": 1633816466,
      "upvotes": 1,
      "replies": {}
    },
    "hfxpzzx": {
      "link": "/r/ApplyingToCollege/comments/q4ckqx/is_lady_gaga_a_topic_i_should_stay_away_from_when/hfxpzzx/",
      "text": "I think it can be made into a really good essay. I love lady gaga... And I think only conservatives don't agree with her opinions... Like she literally has the perfect answer to every question. You should be fine as long as you don't write about anything too explicit.",
      "author": "Concerned-gay-guy",
      "created": 1633748323,
      "upvotes": -3,
      "replies": {}
    }
  }
}