{
  "sid": "rehrye",
  "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/",
  "title:": "Northwestern student, AMA",
  "text": "[saw this and i like attention so let’s do it](https://www.reddit.com/r/Northwestern/comments/ree7l3/any_northwestern_student_interested_in_doing_an/)\n\ni’m a second year, majoring in CS in weinberg (the not-engineering college). might double major or minor in classics or philosophy, haven’t decided yet\n\nedit: am sleep. feel free to keep asking stuff tho and i’ll answer when i wake up",
  "author": "alt-meow",
  "created": 1639286085,
  "updated": 1639818733,
  "over_18": false,
  "upvotes": 31,
  "upvote_ratio": 1.0,
  "comments": {
    "ho7p2ln": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7p2ln/",
      "text": "advice to applicants who are anxiously waiting for decisions?",
      "author": "pillowcase582",
      "created": 1639286412,
      "upvotes": 4,
      "replies": {
        "ho7ppgh": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7ppgh/",
          "text": "so like i wouldn’t have listened to this when i was waiting but it’s true: it doesn’t rly matter too much where u end up.\n\nlike NU was honestly not my first choice. it was ,, let’s just say i had a pretty low hit rate on acceptances. but after a year-ish here i really believe that like,, if i had looked into it more it would have been my first choice. for me this is because of some specific aspects of the CS department but i’m sure you’ll find your own reason\n\nthe thing is that i also have a meta-belief that i would end up thinking this about wherever i went. every school has something uniquely amazing (and uniquely perfect for you!) and like. i bet you don’t know what that thing (or many things) is yet for you for whenever you go, even if you think you do",
          "author": "alt-meow",
          "created": 1639286775,
          "upvotes": 6,
          "replies": {
            "ho7pu90": {
              "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7pu90/",
              "text": "is there grade deflation",
              "author": "pillowcase582",
              "created": 1639286853,
              "upvotes": 3,
              "replies": {
                "ho97sqm": {
                  "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho97sqm/",
                  "text": "current cs student in the engineering school, the introductory engineering sequence DOES NOT CURVE AT ALL. for your first two cs classes, they will not curve. the social science classes that i've taken also do not curve. for math, you're looking at a few percentage points for a curve, and chem (one of the basic science requirements) is a bit more significant.",
                  "author": "p13poseidon",
                  "created": 1639322867,
                  "upvotes": 3,
                  "replies": {}
                },
                "ho7q8uh": {
                  "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7q8uh/",
                  "text": "what do you mean by that exactly? i’ve only ever been in classes which curve upwards or not at all",
                  "author": "alt-meow",
                  "created": 1639287099,
                  "upvotes": 2,
                  "replies": {
                    "ho7qcpu": {
                      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7qcpu/",
                      "text": "oh that’s good to hear!",
                      "author": "pillowcase582",
                      "created": 1639287163,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho7qqt2": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7qqt2/",
      "text": "How is the food there? And if you don’t mind asking, what were ur ec’s?",
      "author": "Firm-Radish-7666",
      "created": 1639287391,
      "upvotes": 4,
      "replies": {
        "ho7rgf0": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7rgf0/",
          "text": "food is solid! the meal plan (which u have to be on for 1-2 years) is a little weird, it’s unlimited dining hall swipes (i rly like the dining halls, they have good healthy options and comfort food. avoid any chicken tho), up to 5 meals per week at certain campus restaurants (which are like. really good), and you get 125$ per quarter to use at any food place on campus (the places that don’t accept meal exchanges (including starbucks)). basically you have many options and they’re all good \n\ni honestly don’t remember what i listed for ECs, i bounced around a lot in high school. i definitely emphasized tae kwon do and independent programming projects. i also got some awards for latin and art so i put those,, idk i can check what else tomorrow. oh and my personal essay was about teaching CS to elementary schoolers",
          "author": "alt-meow",
          "created": 1639287803,
          "upvotes": 4,
          "replies": {
            "ho7vfo5": {
              "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7vfo5/",
              "text": ">avoid any chicken tho\n\n,,,why",
              "author": "TemporaryResident288",
              "created": 1639290238,
              "upvotes": 2,
              "replies": {
                "ho8b5pm": {
                  "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho8b5pm/",
                  "text": "It’s hella dry",
                  "author": "fgd0380",
                  "created": 1639302615,
                  "upvotes": 5,
                  "replies": {}
                },
                "hobcj1z": {
                  "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobcj1z/",
                  "text": "yeah like fgd said. there's also this meme (might just be among my friends idek) that the dining halls have 'trap' food that looks amazing but is gross, and chicken is the most common trap food",
                  "author": "alt-meow",
                  "created": 1639354033,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ho98kxd": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho98kxd/",
          "text": "hey! i'm a transfer student to nu who really is a foodie, cooks pretty well, and enjoys seasoning. my friend transferred over from ucla who has one of the best dining halls, and she and i suffer on the daily. the food is kind of terrible at the dining halls, the best one is in the south-area of campus, but that one's quality is still meh. i also have friends who live off the meal swipes, which you get 5 a week and you're able to go to an on-campus deli, two cafés, a grill-ish place, and a pizza restaurant.",
          "author": "p13poseidon",
          "created": 1639323197,
          "upvotes": 3,
          "replies": {
            "hobcnsn": {
              "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobcnsn/",
              "text": "i do not agree that the food is terrible at the dining halls, it's just that the /average/ quality is terrible. knowing which thing will be good when you go on any given day is a skill imo",
              "author": "alt-meow",
              "created": 1639354093,
              "upvotes": 1,
              "replies": {
                "hobdh5f": {
                  "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobdh5f/",
                  "text": "i beg to differ, but we can agree to disagree. frankly, it was a shock to me that the quality can range from bad to average lol as i said. i would just say that the dining hall appeals to a different palate than what i and anyone else i know are used to i guess.",
                  "author": "p13poseidon",
                  "created": 1639354465,
                  "upvotes": 1,
                  "replies": {
                    "hobg5fi": {
                      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobg5fi/",
                      "text": "not sure what you mean by palate but yeah agree to disagree",
                      "author": "alt-meow",
                      "created": 1639355678,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hoc546q": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hoc546q/",
          "text": "I’m a current freshman and the food just is not good. You use as many meal exchanges as you can and the dining halls are honestly a struggle but normally you can find something that at least is edible but it’s definitely not good",
          "author": "jmojmo05",
          "created": 1639367109,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho7opyy": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7opyy/",
      "text": "stats?",
      "author": "HatOnly9300",
      "created": 1639286217,
      "upvotes": 3,
      "replies": {
        "ho7otvy": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7otvy/",
          "text": "like which ones? sorry i was never like active on this sub or anything idk the lingo",
          "author": "alt-meow",
          "created": 1639286279,
          "upvotes": 2,
          "replies": {
            "ho7p9bw": {
              "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7p9bw/",
              "text": "sat, gpa",
              "author": "HatOnly9300",
              "created": 1639286517,
              "upvotes": 2,
              "replies": {
                "ho7prou": {
                  "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7prou/",
                  "text": "36 ACT, i didn’t have a GPA. this is probably not helpful is it\n\nedit: my HS did narrative reports, it’s not like I Personally Simply Didnt Have One. still kind of a weird case but yeah NU knew what was up with it",
                  "author": "alt-meow",
                  "created": 1639286810,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho7w6ua": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho7w6ua/",
      "text": "If you are still answering questions, I'm curious what got you interested in classics and philosophy? Both sound like they would be cool second majors!",
      "author": "darkchocolatewalnut",
      "created": 1639290754,
      "upvotes": 2,
      "replies": {
        "hobcriv": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobcriv/",
          "text": "classics: i did latin in high school and got interested in ancient cultures and stuff\n\nphilosophy: i realized that what i was really mostly interested in was how those ancient cultures thought about things. i only kinda decided that i might pursue this recently though",
          "author": "alt-meow",
          "created": 1639354139,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho92jpd": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho92jpd/",
      "text": "the best place @ campus to  hangout?",
      "author": "InternationalSink341",
      "created": 1639320669,
      "upvotes": 2,
      "replies": {
        "hobdtwl": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobdtwl/",
          "text": "depends what u mean by hangout, ill try to give a summary\n\nnorris is the student center, the bottom floor is a little busier and more social but still a solid work-with-friends spot. floor above that is like halfway between a social spot in a library. vibes are great\n\nfor libraries there's main, deering, and mudd. deering is old, stained glass, big wooden tables, &c. very Romantic vibes. main is massive, w a lot of very good study spots. mudd is connected to the tech building and tbh i dont go there much. probably good for cs majors who are scared of rocks.\n\nin terms of specifically non-public-area hangouts, youll mostly find people in various dorm lounges (some are open to anyone, like shepard) or in their rooms tbh. \n\n(i am probably missing some places here bc im just one person lol)",
          "author": "alt-meow",
          "created": 1639354631,
          "upvotes": 2,
          "replies": {
            "hocem8f": {
              "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hocem8f/",
              "text": "Thanks a lot! Hopefully I get in Northwestern (I applied ED)",
              "author": "InternationalSink341",
              "created": 1639371953,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho99ua0": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho99ua0/",
      "text": "Can you go into more detail about the CS program through Weinberg? Is it super math intensive? Also are you only doing Computer Science/Math courses? What electives do you take? How do I view a list of what electives I have to take with that major? Also have you heard of any one taking the Transportation and Logistics minor? Thanks!",
      "author": "jbethel811",
      "created": 1639323723,
      "upvotes": 2,
      "replies": {
        "hobejca": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobejca/",
          "text": "okay yeah so the CS-through-weinberg thing is something i really love about NU CS. it means that i have weinberg's non-major requirements for graduation instead of mccormick's, but have the exact same CS major requirements. all CS classes are still 'in' mccormick, they're not split or anything.\n\nthis means i get to take quite a bit less math (and avoid EA/DTC engineering stuff entirely). i honestly dont know how electives work in mccormick so i cant quite compare, but weinberg has distros in different categories. assuming you're in weinberg, you have to fulfill the same distro requirements for any major. [see here for details](https://weinberg.northwestern.edu/undergraduate/degree/distribution-requirements/)\n\ni haven't heard of that minor but it looks cool. we have a solid transportation library, which i only know about because i like to study there",
          "author": "alt-meow",
          "created": 1639354944,
          "upvotes": 1,
          "replies": {
            "hobkoo8": {
              "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobkoo8/",
              "text": ">CS-through-weinberg thing is something i really love about NU CS\n\nAh good to hear! I am interested in CompSci but suck at life sciences. Two follow up questions to that: \n\nFirst: Is it easy to switch majors? Let's say I was in SESP and wanted to move to Weinberg before I matriculate, would it be possible, especially for a major as competitive as CS? \n\nSecond: Are those distros firm? Can I tailor my requirements to one specific area like Ethics or Spanish literature?\n\n> this means i get to take quite a bit less math\n\nYay! I suck at Math, but is it necessary to do well in NU CS?\n\n>we have a solid transportation library\n\nOoh! I love that. Are all of the books dedicated to transportation?",
              "author": "jbethel811",
              "created": 1639357708,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho99zhf": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/ho99zhf/",
      "text": "is it nice living there? like lots to do for a college student? i live abt 30 min from evanston and ive always felt like its such a rich area that as a poor college student i wouldnt be able to do anything fun",
      "author": "autumnhong",
      "created": 1639323783,
      "upvotes": 2,
      "replies": {
        "hobeu0w": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobeu0w/",
          "text": "tbh this is a weak point of NU. it definitely depends on what you do for fun but yeah personally i don't leave campus much except for like target",
          "author": "alt-meow",
          "created": 1639355082,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoa0h79": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hoa0h79/",
      "text": "Hey there!  While I don't have a question, I just wanted to say that I hope you're having a great time at Northwestern!  I'm also a sophomore there right now who is minoring in Philosophy so hopefully I will see you in a future Philosophy class.\n\nHave a nice day!",
      "author": "eccentricgalaxy",
      "created": 1639334375,
      "upvotes": 2,
      "replies": {
        "hobex5x": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobex5x/",
          "text": "oh cool! yeah i havent actually taken any yet so ur prolly ahead of me. i see you around on reddit and stuff though. hope ur break is restful!",
          "author": "alt-meow",
          "created": 1639355122,
          "upvotes": 2,
          "replies": {
            "hocijzr": {
              "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hocijzr/",
              "text": "Thank you so much!  I very much appreciate that and hope you have a great break as well.\n\nHave a nice day!",
              "author": "eccentricgalaxy",
              "created": 1639374310,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoa2e3u": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hoa2e3u/",
      "text": "Weinberg has CS? WHOA",
      "author": "Daggy1234",
      "created": 1639335096,
      "upvotes": 1,
      "replies": {
        "hobf4em": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobf4em/",
          "text": "yes!!! look at my response to jbethel811. i love getting to take interesting humanities classes instead of like polyorganic quasimaterial science or whatever the mccormick ppl are doing",
          "author": "alt-meow",
          "created": 1639355214,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hobc86o": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobc86o/",
      "text": "hi, this might be a dumb q bc ur not in SESP but i recently found out that SESP is EXTREMELY small and i was wondering if that would make admissions into SESP a LOT harder?",
      "author": "umuwunu",
      "created": 1639353897,
      "upvotes": 1,
      "replies": {
        "hobf5aa": {
          "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hobf5aa/",
          "text": "they dont accept by school",
          "author": "alt-meow",
          "created": 1639355224,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hochby9": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/hochby9/",
      "text": "I know a lot of people ask about the weather, but to what extent does the cold weather affect students’ mental health? I’m someone who absolutely loves outdoor walks, seeing pretty sunsets, skies, stars, moons, I love the rain and super windy days too, pretty much everything in nature as long as I can physically be outside. I’ve heard several people say the gloomy cold weather can be pretty disheartening or straight up depressing. How has it affected you?",
      "author": "Rini03",
      "created": 1639373559,
      "upvotes": 1,
      "replies": {}
    },
    "houtq4h": {
      "link": "/r/ApplyingToCollege/comments/rehrye/northwestern_student_ama/houtq4h/",
      "text": "Hey there,\n\nIs global health studies competitive? What kind of programs/ opportunities are there for the major, and how is the advising for pre med?",
      "author": "tuti11x",
      "created": 1639703137,
      "upvotes": 1,
      "replies": {}
    }
  }
}