{
  "sid": "ren6js",
  "link": "/r/ApplyingToCollege/comments/ren6js/purdue_aerospace_engineering_sophomore_words_of/",
  "title:": "Purdue Aerospace Engineering Sophomore- Words of Wisdom",
  "text": "Hey A2C it’s been a while since I scrolled through here and I really thought I should share some of my experiences I’ve had in college as I know application deadlines are around the corner.\nFirst of all- STOP AND BREATHE….\nAll of you (or most) are seniors, stop and breathe and enjoy high-school. You guys have one more semester in high-school before you leave your friends and go off to a totally new experience, enjoy it while it lasts.\n\nI’m going to be the one to say it, stop worrying about the prestige of the schools you’re applying to as the number one thing that decides where you go to college. Being here at Purdue I’ve learned a lot about where you end up is through the connections you make and how dedicated you are to make those connections in industry.\n\nCollege is hard, like really hard. I know a large majority of the people in this sub are STEM minded individuals and you have to understand what you are going into. Going into a prestigious school is very challenging, it’s hard to get into for a reason… Purdue is known as one of the hardest universities in the country and for good reason, engineering here is as hard as can be. It doesn’t even compare to high school, you have to be prepared to take that step when applying to a school and choosing a major.\n\nLastly and most importantly, go to a school you will have fun at. In my honest opinion, nothing beats a school with amazing school spirit. I am proud as all hell to be a boilermaker and love getting recognized in public away from campus and being yelled at “Boiler Up” it truly is something that is amazing. Going to a school with lots to do, fun events, Big 10 sports, and endless clubs is something I really wanted to experience. Put yourself in a school that’s not just prestigious, but you will be happy at. If having a school that’s great at sports ( don’t mention our loss to Rutgers in bball cough cough) is important, and screaming on a game day in the student section is something you want to experience, pick a school that will suit you! It’s not all about academics, enjoy college!!!\n\nIf anyone has any questions feel free to ask below or pm, please refrain from the “will I get into this school” type of questions because those have been asked 1000 times…\nSigning out,\nBoiler Up",
  "author": "Fr8ty",
  "created": 1639308451,
  "updated": 1639514791,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "ho9aszf": {
      "link": "/r/ApplyingToCollege/comments/ren6js/purdue_aerospace_engineering_sophomore_words_of/ho9aszf/",
      "text": "Hi! I'm applying to Purdue for BME and am interested in participating in the drumline. Would you say it's relatively possible to be part of the marching band while still completing an engineering major at Purdue (based on your or friends' experiences)? Btw that Purdue vs Rutgers game was clutch (NJ student here)...",
      "author": "mayo1822",
      "created": 1639324125,
      "upvotes": 1,
      "replies": {
        "hoahvv1": {
          "link": "/r/ApplyingToCollege/comments/ren6js/purdue_aerospace_engineering_sophomore_words_of/hoahvv1/",
          "text": "Oh yes completely it is reasonable, I may have made engineering sound like you are going to spend every waking hour of the day studying, which is not true. Time management is something that is crucial in college, and you can definitely fit that in",
          "author": "Fr8ty",
          "created": 1639341160,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoba42g": {
      "link": "/r/ApplyingToCollege/comments/ren6js/purdue_aerospace_engineering_sophomore_words_of/hoba42g/",
      "text": "Hi! I’m applying for aero at Purdue, I wanted to ask are EC’s extremely important or is it more academic focus? I don’t have many aerospace related ec’s but my academics and essays are great",
      "author": "Vikovi",
      "created": 1639352941,
      "upvotes": 1,
      "replies": {
        "hobar0e": {
          "link": "/r/ApplyingToCollege/comments/ren6js/purdue_aerospace_engineering_sophomore_words_of/hobar0e/",
          "text": "I would honestly say, being well rounded is the most important part of an applicant. You can have stellar grades but Purdue seeks for someone who will fit in at Purdue, if you have a solid 1450 SAT and 4.0 gpa you are probably competitive grade wise. I’d say ECs are important yes, however being well rounded is most important",
          "author": "Fr8ty",
          "created": 1639353228,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}