{
  "sid": "rg81bs",
  "link": "/r/ApplyingToCollege/comments/rg81bs/thoughts_on_my_college_choices/",
  "title:": "Thoughts on my college choices?",
  "text": "Here's my list (in no particular order):\n\nSkidmore, Bowdoin, Hamilton, Williams, Colgate, Hamline (safety school) \n\nJust for some background knowledge I live in NY so some of these are out of state. I'm going for political science/public policy analysis. I prefer smaller faculty ratios because I come from a small highschool so I want that environment to be replicated somewhat so I'm not dejected from feeling isolated from my teachers. Also I know most of these are extremely selective, any thoughts on that I accept as well. \n\nTell me any of your guy's thoughts positive or negative.",
  "author": "Snake_Hail72",
  "created": 1639490221,
  "updated": 1639513595,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hoii2om": {
      "link": "/r/ApplyingToCollege/comments/rg81bs/thoughts_on_my_college_choices/hoii2om/",
      "text": "Encourage you to run your numbers through each school's NPC (\"net price calculator\") and make sure you can afford each of them. None of those (save possibly the last; not familiar with it) offer any non-need-based aid.",
      "author": "jayphoward",
      "created": 1639491932,
      "upvotes": 2,
      "replies": {}
    },
    "hoj6x2s": {
      "link": "/r/ApplyingToCollege/comments/rg81bs/thoughts_on_my_college_choices/hoj6x2s/",
      "text": "Skidmore is in Saratoga, which is an awesome town! Colgate is in Hamilton, and there is VERY little to do in that town. Same with Hamilton (which is in Clinton). I am not sure if that factors into your decision. Same goes for Williams - very small town. I would say Hamilton and Colgate and Skidmore are much easier to get into than Williams and Bowdoin.",
      "author": "Brave_Service9803",
      "created": 1639502159,
      "upvotes": 2,
      "replies": {}
    },
    "hoijtwj": {
      "link": "/r/ApplyingToCollege/comments/rg81bs/thoughts_on_my_college_choices/hoijtwj/",
      "text": "My sons have two friends at Colgate, now seniors, who had an excellent experience.  One majored in political science and the other studied French and business, I believe.  Both came in from OOS.",
      "author": "HappyCava",
      "created": 1639492794,
      "upvotes": 1,
      "replies": {}
    }
  }
}