{
  "sid": "qdhe0o",
  "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/",
  "title:": "Applying as a transfer senior to CSUs?",
  "text": "Has anyone ever tried applying as a senior to transfer to a CSU campus? \n\nI’m attending UC Berkeley as a junior transfer, and I’m miserable. The attitude here is super cutthroat and competitive, it’s virtually impossible to access disability services (or really any other services on campus, but I am disabled and have been waiting on accommodations since May), and I just can’t seem to find a way to flourish here. In fact, I went from the best mental health of my life back to wanting to die in just two months of attending because yeah, it really is that soul-crushing. \n\nAnyway, I want to go to a CSU that’s closer to home and that doesn’t use its “elite” status to treat minorities on campus like garbage. I just haven’t been able to find an answer as to whether or not CSU campuses even take seniors. \n\nI never took a comm class, either, so I might not even be eligible. \n\nAnybody know? \n\nAlternatively, I might just drop out.",
  "author": "karatecoconut",
  "created": 1634910686,
  "updated": 1635183515,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.92,
  "comments": {
    "hhn96bm": {
      "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhn96bm/",
      "text": "Don't drop out...I don't know that much about California state schools, but I'd guess it'd be easy to transfer out of Berkeley rather than transfer in. Maybe talk to like an admissions counselor at a CSU?",
      "author": "Texas719",
      "created": 1634924275,
      "upvotes": 8,
      "replies": {}
    },
    "hhnbm09": {
      "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhnbm09/",
      "text": "for the comm class, is taking it at a community college an option? ik a couple offer them online (async and sync). depending on how you've done in your berkeley classes, some credits for your major classes might transfer over as well. be sure to look into disability accommodations when you're applying, i've heard quite lopsided opinions. transferring isn't an impossibility, you shouldn't drop out (unless it's higher ed in general that's affecting you, not just berkeley in specific)",
      "author": "modularmercury",
      "created": 1634925236,
      "upvotes": 3,
      "replies": {}
    },
    "hhok0dl": {
      "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhok0dl/",
      "text": "Do you have an academic counselor you can talk to? They might have connections on campus ( at Cal) to get you the resources you need. Isn’t there a disabilities services office?  There has to be an advocate for you. Now, on the other hand, if you simply hate the vibe there and you’re suffering- that’s another story. You will likely have to take additional classes at your next university because there is a residency requirement. I would suggest contacting the disability office at SFSU and try to set things up before you transfer out of cal. At least you’ll have an idea what to expect before you get there. Good luck to you.  No place is worth compromising your mental health.",
      "author": "ZuzuBish",
      "created": 1634944748,
      "upvotes": 3,
      "replies": {}
    },
    "hhnc4wm": {
      "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhnc4wm/",
      "text": "u do realize if u go to a top university everyone around u is going to do amazing things and many r on the grind. idk why people take it so negatively.",
      "author": "Annual_Zucchini_7528",
      "created": 1634925447,
      "upvotes": 1,
      "replies": {
        "hhngppj": {
          "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhngppj/",
          "text": "Doesn’t mean I should have to wait over 5 months to get academic accommodations I require for autism and a learning disability. The administration at this school is useless, and without those documents my professors are awful to try and work with. And there are plenty of high-ranking universities where people don’t actively try to trip up the students around them. It’s hard to build community when absolutely everything (including pretty much every extracurricular activity) is treated like a competition.",
          "author": "karatecoconut",
          "created": 1634927291,
          "upvotes": 0,
          "replies": {
            "hhnicgc": {
              "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhnicgc/",
              "text": "im pretty sure professors r rly nice abt dsp, like if u ask for an extension theyll give it to u based of trust. also welcome to life bro it isn’t going to get any easier outside",
              "author": "Annual_Zucchini_7528",
              "created": 1634927960,
              "upvotes": -3,
              "replies": {
                "hhnrllh": {
                  "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhnrllh/",
                  "text": "\"welcome to life bro\" That is kind of a bad and condescending way to look at life, to be honest.",
                  "author": "Familiar-Muscle-9168",
                  "created": 1634931780,
                  "upvotes": 6,
                  "replies": {}
                },
                "hhnx1qq": {
                  "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhnx1qq/",
                  "text": "This really comes off as “have you tried not being autistic/having a LD?” And that’s, uhh, not the amazing take you think it is, friend.\n\nI’m also approaching 30 and have lived and worked outside my home for years. I’ve been “outside” plenty, and I’ve never had an issue with any of my jobs violating ADA. Those protections also exist in the “real world”.",
                  "author": "karatecoconut",
                  "created": 1634934037,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhnrqm6": {
      "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhnrqm6/",
      "text": "Do you have any CSU's in mind?",
      "author": "Familiar-Muscle-9168",
      "created": 1634931838,
      "upvotes": 1,
      "replies": {
        "hhnxtcd": {
          "link": "/r/ApplyingToCollege/comments/qdhe0o/applying_as_a_transfer_senior_to_csus/hhnxtcd/",
          "text": "CSUEB or SFSU because they’re local.",
          "author": "karatecoconut",
          "created": 1634934362,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}