{
  "sid": "qkne94",
  "link": "/r/ApplyingToCollege/comments/qkne94/quick_question_about_the_commonapp_school_report/",
  "title:": "Quick Question About the CommonApp School Report",
  "text": "So I'm basically done with my CommonApp and getting ready to submit it for Penn State, but my Guidance Counselor isn't quite done with the School Report yet. I talked to her earlier today and she said she was about 90% done and said she was going to review and finish it this evening when she doesn't have other distractions. That being said, I was wondering if I would be able to just submit the application right now so that I can start working on the SRAR for Penn State and then she can finish the School Report on her end later tonight even if I submit the application.",
  "author": "RoNiN_0001",
  "created": 1635799601,
  "updated": 1635890232,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hixgqcs": {
      "link": "/r/ApplyingToCollege/comments/qkne94/quick_question_about_the_commonapp_school_report/hixgqcs/",
      "text": "Yea you can already send. They all link through ur personal information.",
      "author": "Isa_Isabella",
      "created": 1635799782,
      "upvotes": 3,
      "replies": {}
    },
    "hiz1w2i": {
      "link": "/r/ApplyingToCollege/comments/qkne94/quick_question_about_the_commonapp_school_report/hiz1w2i/",
      "text": "Send everything when it's ready.  Schools can match up components that arrive at different time.\n\nBe aware that PSU requires all parts of the application, which includes the SRAR, by November 1.",
      "author": "RichInPitt",
      "created": 1635825803,
      "upvotes": 1,
      "replies": {
        "hj0hhlp": {
          "link": "/r/ApplyingToCollege/comments/qkne94/quick_question_about_the_commonapp_school_report/hj0hhlp/",
          "text": "Hey man, thanks for the help. I just got the confirmation email from Penn State talking about the checklist and checking the MyPennState and it actually says that the SRAR can be submitted by November 5 for Early Action, which I wasn't aware of either. I did complete my SRAR last night just in case but just an interesting tidbit I thought you might want to know.",
          "author": "RoNiN_0001",
          "created": 1635862297,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}