{
  "sid": "qa8yus",
  "link": "/r/ApplyingToCollege/comments/qa8yus/is_it_possible_to_hire_a_private_counsellor_just/",
  "title:": "Is it possible to hire a private counsellor just for ED?",
  "text": "My school counsellor couldn’t accommodate me for applying Early Decision cz I missed the deadline to tell him by a few days. I’ve completed my application and I just need a counsellor to add to my commonapp and review my essays a few times. Is it possible to hire a service like this? Or can I just apply without a counsellor? My deadlines Nov 1 so I need it done urgently ://",
  "author": "abdullah17078",
  "created": 1634508719,
  "updated": 1634653739,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh1fm0v": {
      "link": "/r/ApplyingToCollege/comments/qa8yus/is_it_possible_to_hire_a_private_counsellor_just/hh1fm0v/",
      "text": "You cannot apply without your high school counselor's form being submitted to Common App. This is why high school counselors have deadlines. They probably have a full schedule.\n\nAnother administrator at the school could potentially also submit the high school forms, so ask around. A *private* counselor cannot do high school forms.\n\nYour high school counselor need not review your essays and probably isn't a good choice for that anyway. You can find that type of help elsewhere - there are private college consultants that charge by the hour.",
      "author": "elkrange",
      "created": 1634509521,
      "upvotes": 3,
      "replies": {
        "hh1gef1": {
          "link": "/r/ApplyingToCollege/comments/qa8yus/is_it_possible_to_hire_a_private_counsellor_just/hh1gef1/",
          "text": "I’m reapplying to this particular university, I used the same counsellor last year is it not possible for me to just use last years form?",
          "author": "abdullah17078",
          "created": 1634509888,
          "upvotes": 1,
          "replies": {}
        },
        "hh1h0x1": {
          "link": "/r/ApplyingToCollege/comments/qa8yus/is_it_possible_to_hire_a_private_counsellor_just/hh1h0x1/",
          "text": "Or maybe I could email the university asking them to use the same transcript as last year would that be possible at all?",
          "author": "abdullah17078",
          "created": 1634510182,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}