{
  "sid": "qr9nyf",
  "link": "/r/ApplyingToCollege/comments/qr9nyf/is_it_worth_retaking_a_1500_sat_for_an_applicant/",
  "title:": "Is it worth retaking a 1500+ sat for an applicant who wants to go to a top school?",
  "text": "For the record, I’m currently a junior who took the sat for the first time in October and got a 1510 (this being said, saying it was my first time was a bit of an exaggeration as I put in countless hours into study and took over 7 full practice tests). This being said, I’m considering if I should even bother retaking. Right now my dream schools (reaches) include places like rice, northwestern, uc Berkeley, Georgia tech, etc and I’m looking into a pretty competitive major (cs or ce). This being said, my splits on the test were 800 math and 710 reading, the math score being one that I feel like I won’t be able to get close to again(averaged like 740 on practices and never got over 760). Likewise , I feel like the reading is hard to improve on too just because I don’t know what more I can do improve there from here (English is my first language for the record). Overall, is it worth studying more and taking it again? Honestly I doubt I’ll ever be able to get in the 1500s again but who knows, maybe I’ll get lucky once more.",
  "author": "Therealjoshreddit",
  "created": 1636594516,
  "updated": 1636652836,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hk5im1h": {
      "link": "/r/ApplyingToCollege/comments/qr9nyf/is_it_worth_retaking_a_1500_sat_for_an_applicant/hk5im1h/",
      "text": "for UC Berkeley it does not matter as they don’t look at SAT for admissions till 2024(at least)",
      "author": "svday",
      "created": 1636597792,
      "upvotes": 4,
      "replies": {}
    },
    "hk5g1ee": {
      "link": "/r/ApplyingToCollege/comments/qr9nyf/is_it_worth_retaking_a_1500_sat_for_an_applicant/hk5g1ee/",
      "text": "Imho, no. Spend the time working on other stuff like grades and ECs.",
      "author": "pupuphlatter",
      "created": 1636596643,
      "upvotes": 3,
      "replies": {}
    },
    "hk5k25s": {
      "link": "/r/ApplyingToCollege/comments/qr9nyf/is_it_worth_retaking_a_1500_sat_for_an_applicant/hk5k25s/",
      "text": "Usually the answer would be no. But since you're still a junior, so you have plenty of time, and one of your scores was perfect, I would consider taking it again if you think you can get a decent increase in your English score without too much extra effort.\n\nIf you'd have to spend a high amount of time studying to increase your English score, then it isn't worth it. But if you think it shouldn't be too hard or take much time, then it may be worth a shot.",
      "author": "FuriousGeorge1435",
      "created": 1636598441,
      "upvotes": 2,
      "replies": {}
    },
    "hk5ilf5": {
      "link": "/r/ApplyingToCollege/comments/qr9nyf/is_it_worth_retaking_a_1500_sat_for_an_applicant/hk5ilf5/",
      "text": "it is a little lackluster, but not quite enough to warrant a retest",
      "author": "Sea_Individual1999",
      "created": 1636597784,
      "upvotes": -1,
      "replies": {}
    },
    "hk5fxh3": {
      "link": "/r/ApplyingToCollege/comments/qr9nyf/is_it_worth_retaking_a_1500_sat_for_an_applicant/hk5fxh3/",
      "text": "No",
      "author": "sarahkppp",
      "created": 1636596593,
      "upvotes": 1,
      "replies": {}
    }
  }
}