{
  "sid": "r6hjci",
  "link": "/r/ApplyingToCollege/comments/r6hjci/reverse_chance_a_polisci_hopeful_w_anxiety/",
  "title:": "reverse chance a polisci hopeful w anxiety",
  "text": "I’m having a crisis and feel like I’m not applying to the right schools lol. Please suggest some!\n\nLocation: Suburban/Urban. I wouldn't mind being in a more rural area, but I want to have a city to go to and lots of things to do nearby. The big thing is I really want a distinct campus, something like Harvard.\n\nRegion: I've been looking at primarily northeastern schools, some mid-Atlantic or West coast. I'm from Texas and want to go far away. Don't mind any weather in particular, but I am tired of the heat. \n\nMajor: Political science. I want to double major in history, public policy, or something along those lines.\n\nCurriculum: ?\n\nSize: Small-Medium. I come from a class of 46 so I think a larger school would kill me. I don't mind a slightly larger school if it feels close-knit.\n\nCosts: EFC is under 1000. I need as close to a full ride as I can get, but I could probably pay 5-10,000 per year if necessary. 100% need met colleges would be best.\n\nOther: I want professors to be focused on teaching. Small class sizes and minimal teaching by TAs. I want a relationship with my professors so I can be held accountable.\n\nSchool spirit is really important to me -- I want the people around me to actually like the college we go to. Not a huge sports fan but I do want to go to games. I'm not great but I do want to try out for cheerleading.\n\nStats: 4.0 UW\n1340 SAT\n18 Dual Credit Hours\nClass President, NHS VP, Choir, Cheer\n\nthank you!!! :-)",
  "author": "aaanderson14",
  "created": 1638373080,
  "updated": 1638478702,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmt2lvo": {
      "link": "/r/ApplyingToCollege/comments/r6hjci/reverse_chance_a_polisci_hopeful_w_anxiety/hmt2lvo/",
      "text": "Where have u applied?",
      "author": "T123369",
      "created": 1638373623,
      "upvotes": 2,
      "replies": {
        "hmtglbb": {
          "link": "/r/ApplyingToCollege/comments/r6hjci/reverse_chance_a_polisci_hopeful_w_anxiety/hmtglbb/",
          "text": "UVM, georgetown, fort lewis, unc chapel hill, northeastern, planning on applying to most of the HWCs and harvard, yale, cornell and dartmouth",
          "author": "aaanderson14",
          "created": 1638379200,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmtfe29": {
      "link": "/r/ApplyingToCollege/comments/r6hjci/reverse_chance_a_polisci_hopeful_w_anxiety/hmtfe29/",
      "text": "Upon reading your post I thought about these schools to consider.........\n\nIndiana U, Univ of Maryland, Oregon-bigger schools but may fit other criteria\n\nCheck out Colleges that change lives website-all small, you can search by area and major\n\nGood Luck! What schools are on your list so far??",
      "author": "Hamilton3322",
      "created": 1638378724,
      "upvotes": 2,
      "replies": {
        "hmtgy8x": {
          "link": "/r/ApplyingToCollege/comments/r6hjci/reverse_chance_a_polisci_hopeful_w_anxiety/hmtgy8x/",
          "text": "UVM, georgetown, fort lewis, unc chapel hill, northeastern, bryn mawr, wellesley, barnard, smith, mt holyoke, boston college, harvard, yale, cornell and dartmouth",
          "author": "aaanderson14",
          "created": 1638379339,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmubhpi": {
      "link": "/r/ApplyingToCollege/comments/r6hjci/reverse_chance_a_polisci_hopeful_w_anxiety/hmubhpi/",
      "text": "Berkeley?",
      "author": "Hamilton3322",
      "created": 1638391082,
      "upvotes": 1,
      "replies": {
        "hmukjry": {
          "link": "/r/ApplyingToCollege/comments/r6hjci/reverse_chance_a_polisci_hopeful_w_anxiety/hmukjry/",
          "text": "i just applied! not sure how realistic it is but i really like it",
          "author": "aaanderson14",
          "created": 1638394471,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}