{
  "sid": "f148vp",
  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/",
  "title:": "Extremely inappropriate interviewer",
  "text": "Sorry if this post comes off like word vomit but I need to get this off my chest because I haven’t told anyone about it yet. I had my Dartmouth interview a couple days ago with a man who was probably 50 years older than me and he was being really inappropriate the entire time. We met in a Starbucks. He complimented me multiple times on my outfit, jewelry, hair, and was very insistent on telling me about the social scene at Dartmouth. I would try to ask about academics or atmosphere and he would steer the conversation back to what the dating scene was like there. He told me to “stay safe at frat parties because God knows what those boys would do to a girl like you.” He asked me if I was part Asian and when I said yes he said his girlfriend during his junior year was Asian. During the interview, he would put his hand on my knee/thigh and keep it there for a minute. He was also constantly staring at my chest. When it was finally over he said he wanted to walk me back to my car and I said that’s okay I need to use the bathroom and he said he would wait for me. I didn’t want him to say I was rude on his review of me so I just washed my hands and let him walk me to my car with his hand on my lower back the whole time. \n\nThe entire time I just felt like he was too close to me, he was practically breathing down my neck at one point. He wouldn’t stop touching me even though I would shrink away from it, and he wouldn’t answer any of my questions. After I saw him drive away I just sat in my car and cried for a while. I don’t know if I can explicitly say it was harassment because I never told him to stop touching me or to stop looking at my breasts but I still feel so disgusting knowing he was looking at me like I’m just a slab of meat. \n\nHe knows my name, email, and my phone number and probably lots of other information about me. At multiple times throughout the interview he said he was good friends with lots of people in the admissions office so I’m scared he’s gonna say something bad about me if I report it. I also just want it to be over, I don’t ever want to have to see him or talk about him again. I have no proof that he was harassing me. I feel like if I report it they’re gonna ask for proof which I don’t have, or they’re going to ask me what I was wearing, or just ignore me. I don’t know what to do and I’m getting really upset again thinking about it. Have any other girls had a similar experience? Boys, too?\n\nEdit: I’ve sent an email with help from u/ScholarGrade and others. Thank you all for the encouraging me to say something and if this happens to you you should as well. Sometimes it’s hard to remember your principles when you’re caught in an uncomfortable situation, but there is nothing wrong with asking someone to stop touching you. Again, thank you all",
  "author": "collegethrowaway9301",
  "created": 1581226073,
  "updated": 1634076759,
  "over_18": false,
  "upvotes": 1801,
  "upvote_ratio": 0.98,
  "comments": {
    "fh1wxsq": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1wxsq/",
      "text": "This should absolutely be reported back to Dartmouth.  Doing so will not impact your application and if you phrase it properly it could actually help show your character.  If you want me to review what you send them I will happily do so.  PM me.\n\nYou don't need proof because this isn't a court of law.  Sure you probably wouldn't be able to successfully sue him or Dartmouth without evidence or proof of some kind.  But the burden of proof is extremely low for them to decide that was his last interview (which they likely will, if only from a liability standpoint.  Imagine he does something worse to someone else *after* you reported this?  Dartmouth would be held liable for that).  You owe it to yourself to do this.  And to the other students he will \"interview\" in the future if you don't.\n\nAlso:\n\n>\"they’re going to ask me what I was wearing\"\n\nNo they won't.  And if the Starbucks employees didn't ask you to leave or change, then what you were wearing has nothing to do with this.\n\n>\"At multiple times throughout the interview he said he was good friends with lots of people in the admissions office\"\n\nThis is an important detail and needs to be reported as well.  It's a hallmark of quid-pro-quo sexual harassment and is 100% unacceptable.  If he admits to this, you would literally have grounds for a civil lawsuit against him (again, court is the only place where the proof matters).\n\n>\"He knows my name, email, and my phone number and probably lots of other information about me.\"\n\nThis is unfortunate, but remember that the admissions office has the same and more information about him.  If you report this, and he tries anything else, the police will be involved and it won't end well for him.  Certainly be careful out there, but I don't think you need to lose sleep over this.",
      "author": "ScholarGrade",
      "created": 1581226759,
      "upvotes": 1044,
      "replies": {
        "fh1xd6c": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1xd6c/",
          "text": "Okay I will report it in the morning. Thank you for your reply your explanation makes me feel a lot better. I don’t want this to happen to anyone else",
          "author": "collegethrowaway9301",
          "created": 1581227173,
          "upvotes": 585,
          "replies": {
            "fh1y6kz": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1y6kz/",
              "text": "I just made a few edits as I was ~~fuming~~ ruminating over this.  Please check those as well.",
              "author": "ScholarGrade",
              "created": 1581227950,
              "upvotes": 212,
              "replies": {}
            },
            "fh25npi": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh25npi/",
              "text": "Listen to this person. u/ScholarGrade brings up some excellent points. And for the time being, try your best not to worry. Get a good night's sleep.\nThis guy's gonna get what he deserves or my name's not KaptainKarma.",
              "author": "kaptainkarma2056",
              "created": 1581236354,
              "upvotes": 127,
              "replies": {
                "fh3bapv": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3bapv/",
                  "text": "Username checks out\n \n\nGet him.",
                  "author": "MagiPan",
                  "created": 1581267009,
                  "upvotes": 28,
                  "replies": {}
                }
              }
            },
            "fh2e279": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2e279/",
              "text": "Any physical contact on his part is wildly inappropriate. This guy needs to be reported to the admissions director and the enrollment management vp.\n\nWrite the email, save the draft, reread/rewrite a few hours after composing it. Maybe have your parents review it.\n\n-Paul Sunde, Director\n-Lee Coffin, Vice Provost for Enrollment & Dean of Admissions and Financial Aid\n\nEdit: thinking about this further, I'd be really surprised if there wasn't already someone in Dartmouth's admissions office monitoring this sub. (still, you need to report it.)",
              "author": "Evinrude44",
              "created": 1581248415,
              "upvotes": 50,
              "replies": {}
            },
            "fh2979e": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2979e/",
              "text": "Glad to hear this. If I were a girl, and in this position, I’d hope I’d have the guts to do so. It’s a shame there are dudes like that out there. He deserves to lose his job. I hope it goes well.",
              "author": "GandalfTheNeonPink",
              "created": 1581241310,
              "upvotes": 45,
              "replies": {}
            },
            "fh38hxb": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh38hxb/",
              "text": "Keep us updated?",
              "author": "Free2MAGA",
              "created": 1581266080,
              "upvotes": 12,
              "replies": {
                "fh3jrxo": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3jrxo/",
                  "text": "Sure",
                  "author": "collegethrowaway9301",
                  "created": 1581269659,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            }
          }
        },
        "fh22viw": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh22viw/",
          "text": "Good stuff, scholargrade. Thanks.",
          "author": null,
          "created": 1581232769,
          "upvotes": 32,
          "replies": {}
        },
        "fh2km9a": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2km9a/",
          "text": "I'm a bit late but ditto to what Scholar said here. Please report this, I know that can be difficult but if he's saying it to you, he's saying it to other people as well. My school ended up cancelling alumni interviews the year after I was there because we had a few alumni making poor impression on students (like this) and it was unacceptable, I know many other schools are moving that direction as well.",
          "author": null,
          "created": 1581256184,
          "upvotes": 27,
          "replies": {
            "fh2pzax": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2pzax/",
              "text": "I wish they would screen their interviewers better. I wonder how many other girls he’s done this to",
              "author": "collegethrowaway9301",
              "created": 1581259329,
              "upvotes": 30,
              "replies": {}
            }
          }
        },
        "fh2cjk3": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2cjk3/",
          "text": "yes to this",
          "author": "peteyMIT",
          "created": 1581246202,
          "upvotes": 13,
          "replies": {}
        },
        "fh2kc7k": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2kc7k/",
          "text": "[deleted]",
          "author": null,
          "created": 1581255906,
          "upvotes": -38,
          "replies": {
            "fh2lzke": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2lzke/",
              "text": ">torpedo an interviewer\n\nAll that means is that they won't be asked to interview anymore or that there would be an inquiry into the incident.  You never need a burden of proof to report something.\n\nEdit:  to further clarify, in criminal court, the burden of proof is \"beyond reasonable doubt.\"  This is a higher standard than civil court where the burden is \"the preponderance of evidence.\"  Neither applies here.  For Dartmouth this won't be about evidence, guilt, or justice; it will be about risk/liability management and protecting their brand/PR.",
              "author": "ScholarGrade",
              "created": 1581257443,
              "upvotes": 31,
              "replies": {}
            },
            "fh2xmbu": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2xmbu/",
              "text": "Why would you think this is a good way to respond when someone is dealing with a situation like this? Even if this didn’t relate to OPs situation it’s still an incredibly inappropriate and inconsiderate way to think of how people report harassment. It’s a volunteer position and no college applicant (or anyone for that matter) should have to deal with something like that, and even one report should be taken seriously.",
              "author": "ThirdLung",
              "created": 1581262222,
              "upvotes": 15,
              "replies": {
                "fh3thl9": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3thl9/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1581272138,
                  "upvotes": -1,
                  "replies": {
                    "fh4f1iy": {
                      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh4f1iy/",
                      "text": "Dartmouth may not act on a single incident, but unless op lets them know about it, they will never know about what may well be a pattern.",
                      "author": "Evinrude44",
                      "created": 1581278089,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fh1wxrd": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1wxrd/",
      "text": "I'm really sorry you had to go through that. I suggest that you report it to Dartmouth, they definitely don't want someone like that representing their school. I wouldn't worry about him saying he's close to the Dartmouth AOs--he was probably just saying that to make sure you don't report him.",
      "author": "lellomn",
      "created": 1581226757,
      "upvotes": 314,
      "replies": {
        "fh1ytse": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1ytse/",
          "text": "Correct.  No college sets up their admissions process such that some interviewers have significantly more power or influence than others (especially to the point that they can use it as a threat).  That would systematically corrupt and unbalance the carefully designed process.",
          "author": "ScholarGrade",
          "created": 1581228552,
          "upvotes": 152,
          "replies": {
            "fh2cka5": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2cka5/",
              "text": "correct",
              "author": "peteyMIT",
              "created": 1581246232,
              "upvotes": 33,
              "replies": {}
            },
            "fh3cior": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3cior/",
              "text": "So did the US government, and guess how that's working out.",
              "author": null,
              "created": 1581267432,
              "upvotes": -9,
              "replies": {
                "fh3g2w0": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3g2w0/",
                  "text": "I'm not here to discuss politics, but with all due respect, Dartmouth didn't hit 64 slices of American cheese with a spray tan and make it Dean of Admissions.  Wherever you stand politically admissions and government are very different.",
                  "author": "ScholarGrade",
                  "created": 1581268628,
                  "upvotes": 18,
                  "replies": {}
                },
                "fh3dt16": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3dt16/",
                  "text": "1. This really doesn’t help OP\n\n2. Two very different situations",
                  "author": "Jayhawk_Dunk",
                  "created": 1581267860,
                  "upvotes": 12,
                  "replies": {}
                },
                "fh3gapi": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3gapi/",
                  "text": "Although I agree that the government has become pretty clearly corrupt in some ways, there’s no need to make this sensitive discussion political",
                  "author": "OGSHAGGY",
                  "created": 1581268700,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fh1xfnp": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1xfnp/",
          "text": "Yeah he was probably just trying to scare me",
          "author": "collegethrowaway9301",
          "created": 1581227240,
          "upvotes": 93,
          "replies": {}
        }
      }
    },
    "fh1yg1n": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1yg1n/",
      "text": "Holy hell, report him. \n\nWhat the heck. My Dartmouth guy was so chill and made me love Dartmouth. This sounds so opposite. I lost it when I read \"put his hand on my knee/thigh and keep it there for a minute\". Like bruh, this is assault. The admissions office thing is probably cap. For Dartmouth, if you check the subreddits, they say the interview barely affects the chances of your admissions as it boils down to: SAT, ACT, ECs, and Essays, so I highly doubt it will have any affect. However, the experience needs to be reported for the safety of future interviewers. If anything, this man needs to be stopped from all future interviews.",
      "author": "RealisticSession",
      "created": 1581228197,
      "upvotes": 221,
      "replies": {}
    },
    "fh1x78c": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1x78c/",
      "text": "i had something similar happen to me during a job interview. he used his status to intimidate me and to scare me away from saying something. but you have to. nothing bad will happen to you. this will in no way, shape, or form, reflect badly on your part if you report it. i’m really sorry this happened to you, i know just how gross it feels to know that he was looking at you like that. this is unfortunately to common an experience. you are NOT alone here",
      "author": "cloudfroot",
      "created": 1581227011,
      "upvotes": 133,
      "replies": {
        "fh1xowv": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1xowv/",
          "text": "Yeah even though it was a public place it was like he was cornering me the whole time. It was like he was escalating his touching to see what he could get away with. I thought he was going to try an grope me when he walked me back to my car but I got in really fast",
          "author": "collegethrowaway9301",
          "created": 1581227488,
          "upvotes": 73,
          "replies": {
            "fh1ynyp": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1ynyp/",
              "text": "I'm glad this ended so benignly.  Just trying to help you and anyone else reading this (not saying you should have done these things, just reminding you that you have this power) - you can say no.  You can remove his hand and tell him off.  You can get up and walk away.  You can call the police.  You can go talk to the baristas and tell them you're uncomfortable or ask them to call the police for you (most retail establishments have a policy that if a customer asks you to call the police, you do it - again, liability management).  You can call him out and tell him his behavior is inappropriate.  You can call your parents or a friend.  You can fake an illness or an urgent call/text.  You can scream.  You can run.  \n\nWhatever happens, you can report it afterward.\n\nNo college admissions office is ever going to rate your application lower if you do these things.  It will not be a he-said, she-said case.  There will be no cross-examination of your story or attempts to pin the blame on you.  They will err on the side of caution and believe you.  You have nothing to fear from them.\n\nI don't mean to go overboard in this thread.  I just have daughters and am incensed right now.",
              "author": "ScholarGrade",
              "created": 1581228409,
              "upvotes": 74,
              "replies": {
                "fh2qj4k": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2qj4k/",
                  "text": "It’s weird because I’m someone who’s always been taught that it’s okay for women to be rude to random guys on the street if I’m getting creeped out. But it’s just random guys on the street and not someone who I thought at the time had way more influence over my application than he did. Thank you for all your kind words ScholarGrade. I wish there were more people out there like you",
                  "author": "collegethrowaway9301",
                  "created": 1581259524,
                  "upvotes": 34,
                  "replies": {
                    "fh376fj": {
                      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh376fj/",
                      "text": "And that's what makes this disgusting on another level. He's using his power over you. It's not okay. This mom is proud of you for speaking up, and getting advice and support. You are Dartmouth material, whether you end up there or not. Any school would be happy to have you. Chin up.",
                      "author": "knitwasabi",
                      "created": 1581265649,
                      "upvotes": 15,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fh23lf8": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh23lf8/",
      "text": "I had a similar very inappropriate interview also with Dartmouth and reported it and they claimed to have removed the interviewer from interviewing privileges and gave me another interview and apologized for what happened",
      "author": null,
      "created": 1581233663,
      "upvotes": 54,
      "replies": {
        "fh2p6pq": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2p6pq/",
          "text": "I'm very sorry you also faced an inappropriate interview.  I know that in such scenarios, words of an apology cannot ever match the gravity of such a scenario, but I do really feel sorry this happened.  I hope your other interview was much better, and I wish you the best of luck with your Dartmouth interview.\n\nHave a nice day.",
          "author": "eccentricgalaxy",
          "created": 1581259030,
          "upvotes": 15,
          "replies": {}
        },
        "fh3gzft": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3gzft/",
          "text": "What the fuck is up with Dartmouth? My dad worked there back in the 90s and he absolutely loved the place. He loved everyone that worked there, he thought the students were very smart and mature, and he thought it was an extremely safe campus. I get the interviewers don’t exactly work directly for Dartmouth, but still, that is disgusting and I’m sure my dad would be devastated to hear stuff like this.",
          "author": "OGSHAGGY",
          "created": 1581268916,
          "upvotes": 9,
          "replies": {
            "fh3j3xo": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3j3xo/",
              "text": "Like the dude was straight up bashing on dartmouth because he was like \"how do you feel about going to a school that still discriminates against women\" and he was also an older dude so tell me why he pulls out a bunch of black and white pictures and starts telling me about the Vietnam war and he literally starts crying. I had no idea what to do. Then he starts being super accusatory and hes like why does your generation thinks itself so superior and to us and he told me to tell him ok boomer like twice. I know it's one old dude but it makes me not want to go to dartmouth anymore.",
              "author": null,
              "created": 1581269445,
              "upvotes": 12,
              "replies": {
                "fh3qop9": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3qop9/",
                  "text": "Wow, that’s insane. I promise you, my dad worked and got into quite a few T20s and his two favs were Dartmouth and Georgetown, I wouldn’t worry too much about what he said. Dartmouth is an excellent school.",
                  "author": "OGSHAGGY",
                  "created": 1581271357,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "fh3r5de": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3r5de/",
              "text": "I graduated in 2010 and worked there from 2016-2019. It still is fantastic and the staff and faculty are wonderful. It's not really surprising that there are a few bad apples out there given that there are some 65,000 living alums. Trust me, hearing about this makes my blood boil.",
              "author": "biggreen10",
              "created": 1581271520,
              "upvotes": 8,
              "replies": {
                "fh3rh4z": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3rh4z/",
                  "text": "Glad to see someone who is a current Dartmouth interviewer give it some praise, I’m glad to hear it’s still as friendly and wonderful. Too bad that a couple people can change the reputation of a school so much.",
                  "author": "OGSHAGGY",
                  "created": 1581271623,
                  "upvotes": 2,
                  "replies": {
                    "fh3rw0a": {
                      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3rw0a/",
                      "text": "Yeah, this is obviously the risk with admission interviews. There's no way the admissions office can interview 25,000 people, and some alums are just plain weirdos and predators. Obviously it is a tiny minority, but they clearly exist.",
                      "author": "biggreen10",
                      "created": 1581271718,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fh1y71f": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1y71f/",
      "text": "Omg I’m so sorry to hear this.. this jerk makes me so angry. It’s sad to think how many other applicants he might have harassed who don’t have the courage to say anything because they’re worried it might affect their chances of admission. Definitely report him to Dartmouth!!",
      "author": "omen_nii",
      "created": 1581227963,
      "upvotes": 45,
      "replies": {}
    },
    "fh234vf": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh234vf/",
      "text": "> I don’t know if I can explicitly say it was harassment […]\n\nIt most definitely was. Everything about this was. \n\nAre you a minor? That could potentially mean a lot more trouble for this person.",
      "author": null,
      "created": 1581233089,
      "upvotes": 37,
      "replies": {
        "fh2qmzc": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2qmzc/",
          "text": "I am 18 sadly",
          "author": "collegethrowaway9301",
          "created": 1581259563,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fh1y0ca": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1y0ca/",
      "text": "I would definitely report him. There are all kinds of people working in the admissions office, and there's no way that he has connections with all of them, so it should be taken seriously. if for no other reason, report him so that he doesn't put anyone other interviewee through that harassment. (also, it was definitely harassment. his behavior was could clearly be seen as unwanted, and was most definitely inappropriate. you don't have to ask someone to stop for it to qualify as harassment.)\n\nI hope that you feel better after reporting the incident and are able to forget. It's terrible that people behave this way, and I'm sorry that it happened to you.",
      "author": "confusedjulia",
      "created": 1581227782,
      "upvotes": 38,
      "replies": {}
    },
    "fh22b5b": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh22b5b/",
      "text": "As a guy, I've had shitty interview, but haven't experienced any harassment.  I'm so sorry this happened to you",
      "author": "seatbelt_on",
      "created": 1581232088,
      "upvotes": 34,
      "replies": {}
    },
    "fh21u7s": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh21u7s/",
      "text": "Touching your thighs? Sue this guy n fuck him up.",
      "author": "Forgotten_Dezire",
      "created": 1581231543,
      "upvotes": 31,
      "replies": {}
    },
    "fh21vei": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh21vei/",
      "text": "[removed]",
      "author": null,
      "created": 1581231582,
      "upvotes": 37,
      "replies": {
        "fh22zwj": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh22zwj/",
          "text": "u/aed2020",
          "author": null,
          "created": 1581232919,
          "upvotes": 18,
          "replies": {
            "fh5q7qf": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh5q7qf/",
              "text": "Wow, I am not sure. Dartmouth seems to have some interview systematic issues...",
              "author": "aed2020",
              "created": 1581291284,
              "upvotes": 10,
              "replies": {}
            },
            "fikxkm5": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fikxkm5/",
              "text": "[removed]",
              "author": null,
              "created": 1582489183,
              "upvotes": 1,
              "replies": {
                "fil3yko": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fil3yko/",
                  "text": "yeah, i pinged to check with them",
                  "author": null,
                  "created": 1582493136,
                  "upvotes": 2,
                  "replies": {
                    "fir6ab1": {
                      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fir6ab1/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1582658216,
                      "upvotes": 1,
                      "replies": {
                        "fir756t": {
                          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fir756t/",
                          "text": "different interviewers",
                          "author": null,
                          "created": 1582658702,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fh3e8ns": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3e8ns/",
          "text": "Reading this, I thought of exactly that post",
          "author": "naijagyal",
          "created": 1581268021,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fh28lda": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh28lda/",
      "text": "This is so so creepy and so inappropriate and I am so sorry you had that experience. I cannot believe that this is still happening after all the metoo movement and awareness. Ugh losing faith in humanity here. \n\nDefinitely report it to the school. They will NOT fault you for it and hopefully fire him. All the comments that you jotted down where so awful and cringey. Like who says that to someone. \n\nAnd also just to give you a sense of normalcy: I have been on maaaany job interviews and no one ever touched me more than the handshake at the beginning. Everything beyond that is just unprofessional and creepy especially the hand on your thigh and your lower back. That is not okay and needs to be reported.",
      "author": "Kittenmckitten",
      "created": 1581240443,
      "upvotes": 16,
      "replies": {}
    },
    "fh2hjjt": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2hjjt/",
      "text": "You alright mate?\n\nHonestly frick the bloody interviewer for putting you through that but it must hurt mentally, you alright?",
      "author": "litfur",
      "created": 1581252961,
      "upvotes": 17,
      "replies": {
        "fh2r5cj": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2r5cj/",
          "text": "Yes I’m okay I’m honestly more angry than anything else. Thank you for asking :)",
          "author": "collegethrowaway9301",
          "created": 1581259782,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "fh2gdsg": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2gdsg/",
      "text": "I'd check and see if Starbucks might have any of the inappropriate behavior on video.  \n\nSorry you had to go through it, OP.",
      "author": "beanfilledwhackbonk",
      "created": 1581251549,
      "upvotes": 16,
      "replies": {}
    },
    "fh1yhjy": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh1yhjy/",
      "text": "Report him",
      "author": "No_boson",
      "created": 1581228237,
      "upvotes": 15,
      "replies": {}
    },
    "fh22vgl": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh22vgl/",
      "text": "I’m really sorry this happened to you but keep in mind it is no way your fault! It doesn’t matter what you were wearing or doing or whether u spoke out against it. There was obviously a power imbalance that he took advantage of. Report him and just know that you have all of our support",
      "author": "nvrwent2oovoojaver_",
      "created": 1581232767,
      "upvotes": 16,
      "replies": {}
    },
    "fh2yid7": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2yid7/",
      "text": "something like this happened to me, except it was a yale interviewer, and it happened at his house, not a starbucks. he also kept talking about the social scene there, telling me that a girl like me didn’t need to worry about getting the best grades, because i needed to have fun in college like he did. he called me attractive many times, told me i looked just like his wife when she was my age, and a whole lot more that i’m not even comfortable sharing on a throwaway. he told me that if i got in he’d come visit me at yale.\n\nhe walked me back to my car, but when he saw my mom had driven me there and was waiting in the car (thank god she did) he was startled. he told her that she had a very attractive daughter (who the fuck says that to a mom of a 17 year old) and then he got his mail and walked back in. my mom sped away and when we got home i cried for a while in my room. \n\ni truly hope you report this, because i wasn’t strong enough to do so. yale was my dream school, and i thought rejecting his advances of reporting him would ruin my chances. i got deferred in the end, so it wasn’t even worth it to do so. PLEASE PLEASE PLEASE tell someone.",
      "author": "teenagememories",
      "created": 1581262529,
      "upvotes": 15,
      "replies": {
        "fh30y0h": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh30y0h/",
          "text": "I will. Thanks for sharing you experience it’s unfortunately an all too common one I suppose. I understand that need to cry after it’s over too. He wasn’t assaulting me or anything but I still felt like I had been violated and I was just grossed out and angry that he had done that and I wasn’t in the position to do anything about it",
          "author": "collegethrowaway9301",
          "created": 1581263390,
          "upvotes": 6,
          "replies": {
            "fh4dgdi": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh4dgdi/",
              "text": "What you described in your post OP actually is sexual assault at least under NY law. Reading ur post made my blood boil and I hope you’re doing okay",
              "author": "Spelmakrt",
              "created": 1581277591,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fhgjzyq": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fhgjzyq/",
          "text": "Sorry to hear your terrible Yale experience. I don’t know how long ago that was but you can still report the miscreant.",
          "author": "vhooloo",
          "created": 1581569258,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fh2q278": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2q278/",
      "text": "I don’t know if I can explicitly say it was harassment because I never told him to stop touching me or to stop looking at my breasts\n\nAbsence of a no doesn't mean yes. Please don't think you're at fault and do report this to Dartmouth.",
      "author": "Kritisinghh",
      "created": 1581259358,
      "upvotes": 13,
      "replies": {}
    },
    "fh2gf8w": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2gf8w/",
      "text": "A few things to remember about these interviews, as someone who is an alum of an Ivy and who has been asked to interview multiple times and has several close friends/roommates who still interview:\n\n1) Interviewers are usually voluntary and are selected because of availability and location. If you being terrorized by this person, it's likely he will be terrorizing other students in your area. \n\n2) They don't hold shit in terms of sway over the admissions processs. Most interviewers just fill out a detailed report/assessment of the candidate and then send it to the admissions office.\n\n3) You should report this sort of behavior. Not only would Dartmouth not penalize you, it would show them that they need to do a better job protecting their potential students. Don't worry too much about admissions but instead consider - Would you want to go to a school that is represented by someone like this? Would you want your family member to experience this?",
      "author": "ktn699",
      "created": 1581251603,
      "upvotes": 11,
      "replies": {}
    },
    "fh2kal4": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2kal4/",
      "text": "Oh my. I’m horrified that this man did this to you. I would report him immediately. Write it out very factually. I have stood up to harassment several times. Two times people lost their jobs. It was scary as hell but it is what needs to be done so this man doesn’t do this to another girl applying to college. I hope you have at least one good person to support you through this. Men don’t understand how scary this is to happen and how terrifying it is to then report it. Now is the time to be brave. You can do this!",
      "author": "lotusblossom60",
      "created": 1581255861,
      "upvotes": 11,
      "replies": {}
    },
    "fh23qn9": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh23qn9/",
      "text": "This is disgusting and I am sorry that you have to go through smth like this! You should definitely report him even if it might influence your chance of getting in (and it wont) cuz if a school is not capable of protecting their students/applicants its not a school that you want to go to. Im sure they'll handle this properly!",
      "author": "bbibiabeyeye",
      "created": 1581233847,
      "upvotes": 11,
      "replies": {}
    },
    "fh2s2h1": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2s2h1/",
      "text": "Hi I’m a Dartmouth ‘10 and have done these admissions interviews before. I can assure you they count for absolutely nothing in the process and agree with everyone else you should report this. Let me know if you need help getting in contact with admissions. Also please don’t let one loser taint your opinion of the place, it’s a wonderful college that focuses on undergrads better than just about anywhere. Try to visit if you have the opportunity!",
      "author": "cmillhouse",
      "created": 1581260188,
      "upvotes": 10,
      "replies": {}
    },
    "fh30b44": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh30b44/",
      "text": "The amount of people who can relate to this is scary. Petition to find all these interviewer pedos so they can catch these hands.",
      "author": "zi124",
      "created": 1581263156,
      "upvotes": 9,
      "replies": {
        "fh4do1v": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh4do1v/",
          "text": "Im just imagining how much goes unreported because they fear whoever did it to them :(",
          "author": "Spelmakrt",
          "created": 1581277660,
          "upvotes": 5,
          "replies": {
            "fh4teev": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh4teev/",
              "text": "So true, and also out of fear of not getting into the college...",
              "author": "zi124",
              "created": 1581281910,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fh2bixe": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2bixe/",
      "text": "I feel like you have enough people telling you this, but this definitely has to be reported. Your proof is you. If Dartmouth doesn't take your account into consideration, or deems it as invalid, then be honest with yourself and think about whether you'd want to go to a school that cares this less about their (prospective) students. I know it's a top school, and you have every reason to be worried, but this is disgusting and not worth tolerating for the prestige of an ivy league. Take care.",
      "author": "shreyako",
      "created": 1581244701,
      "upvotes": 9,
      "replies": {
        "fhgk6zw": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fhgk6zw/",
          "text": "You probably know that Dartmouth had big scandal with psychology department right?\n\n\nA lawsuit has accused three professors at Dartmouth College of turning the human behavior research department “into a 21st-century Animal House",
          "author": "vhooloo",
          "created": 1581569417,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fh2oxo9": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2oxo9/",
      "text": "OP, I know that since I'm also a high school senior, I definitely am really unknowledgeable on such topics, but I felt that I couldn't just say nothing after reading and wanted to let you know that I'm very sorry this happened to you.  As someone who has experienced sexual harassment, I cannot imagine the pain you must have gone through due to this situation, and I also realize that words I give you in sympathy will never match with the pain you received from this man.  I wish you the best of luck, and I think you did the right thing by reporting him to Dartmouth.  Reporting him will help more people in the future avoid this scenario.\n\nBest of luck.  \n\nHave a nice day.",
      "author": "eccentricgalaxy",
      "created": 1581258943,
      "upvotes": 8,
      "replies": {}
    },
    "fh2phuk": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2phuk/",
      "text": "100% if he did this to you then he will do/has done this to other girls. You not asking him to stop is extremely irrelevant when the behavior is so obviously inappropriate. Report him.",
      "author": "BraedenFB",
      "created": 1581259149,
      "upvotes": 9,
      "replies": {}
    },
    "fh32op9": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh32op9/",
      "text": " I'm also a Dartmouth interviewer and wanted to start by apologizing for having to go through that. I hope you're still excited about Dartmouth, but I understand if that experience soured you on it. I also wanted to offer myself, either to help you contact the people who run the interview program (whom I know from my time as a regional interview organizer). They are fantastic women who would LOVE to hear from you to keep this creep away from other applicants. I'd also be happy to answer any questions you weren't able to get answered. Please let me know how I can help.",
      "author": "biggreen10",
      "created": 1581264005,
      "upvotes": 8,
      "replies": {}
    },
    "fh235wg": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh235wg/",
      "text": "Report the fucking wanker.",
      "author": "MeatBeater19",
      "created": 1581233122,
      "upvotes": 7,
      "replies": {}
    },
    "fh27pfo": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh27pfo/",
      "text": "Please report this ASAP. What that person did is very inappropriate and I’m sure it counts as harassment. Hopefully this won’t be done to other people if he’s reported. Send an email to Dartmouth about this. Call them if possible and explain it to them in detail. There are some things that you can explain easier when talking to another person.",
      "author": "punchawaffle",
      "created": 1581239172,
      "upvotes": 7,
      "replies": {}
    },
    "fh21zam": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh21zam/",
      "text": "This is absolutely ridiculous, and you should definitely report him for your safety and that of other students.",
      "author": "aboyblast3",
      "created": 1581231701,
      "upvotes": 7,
      "replies": {}
    },
    "fh24nl8": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh24nl8/",
      "text": "I’m so sorry this happened to you. I really do hope you report this.",
      "author": null,
      "created": 1581235020,
      "upvotes": 6,
      "replies": {}
    },
    "fh2o2t8": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2o2t8/",
      "text": "Can't you get the security camera footage from the Starbucks location you were at? I think you could use that as proof if anyone doubts the story.\n\nI'm so sorry this happened to you though.",
      "author": "AdvancedDrone",
      "created": 1581258616,
      "upvotes": 7,
      "replies": {}
    },
    "fh2g6v8": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2g6v8/",
      "text": "I've heard of similar things happening to others when interviewing at Dartmouth. This is not an isolated incident.",
      "author": "lauset",
      "created": 1581251315,
      "upvotes": 5,
      "replies": {}
    },
    "fh24add": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh24add/",
      "text": "i’m so sorry this happened to you. thank you for posting this",
      "author": "sister-sloth",
      "created": 1581234541,
      "upvotes": 5,
      "replies": {}
    },
    "fh2ewcq": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2ewcq/",
      "text": "I'm so mad on your behalf right now. I hope you're feeling okay, OP. In no way was that guy fit to be an interviewer.",
      "author": "taengs",
      "created": 1581249613,
      "upvotes": 4,
      "replies": {}
    },
    "fh2lnn2": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2lnn2/",
      "text": "You did nothing wrong. I am sorry that you had to experience this.  As said before, you need to 1) tell your parents\n\n2) Either yourself or your parents need to report this to Admissions.\n\n3) If you are worried and are having other issues, get help. See a counselor if need be. The sooner you get help.  The sooner it will be behind you.\n\nYou are strong. You will get through this.",
      "author": "PhotoCrusader",
      "created": 1581257164,
      "upvotes": 4,
      "replies": {}
    },
    "fh2vrb4": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2vrb4/",
      "text": "I report it and ask for another interview with someone who is willing to fill you in on the academics at Dartmouth. I would express that you are interested in this school, but you don’t want your view to be jaded by a bad interviewer who could make others uncomfortable. Good luck, and I hope that dude gets fired.",
      "author": "Thunder10015",
      "created": 1581261592,
      "upvotes": 3,
      "replies": {}
    },
    "fh3n37b": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3n37b/",
      "text": "I know that scholargrade stepped up and helped with the letter but if you ever want to talk then please PM me.",
      "author": "icebergchick",
      "created": 1581270443,
      "upvotes": 5,
      "replies": {}
    },
    "fh2u72h": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2u72h/",
      "text": "I know you are worried about not having proof, but the Starbucks camera may have picked up what happened. Either way, you should definitely report so that this person can't be inappropriate with people in the future.",
      "author": "CallMe_Sim",
      "created": 1581261043,
      "upvotes": 3,
      "replies": {}
    },
    "fh32c3i": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh32c3i/",
      "text": "thats disgusting wtf",
      "author": "Hungrr2",
      "created": 1581263892,
      "upvotes": 3,
      "replies": {}
    },
    "fh4q0ml": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh4q0ml/",
      "text": "I'm an Ivy League grad, my husband does interviews for his alma mater, and my best friend from law school went to Dartmouth.  In no way is this interviewer's behavior acceptable. I just want to reach out and give you a mom hug - you did absolutely nothing wrong, this guy was totally inappropriate, and he has no hold over you. For the record, a guy like this would be a nightmare for legal and HR.  \nA lot of people have already given you advice on reporting him. I would add one more thing - if you're comfortable enough with your guidance counselor or school career office to tell them, please do. My high school, at least, acted as gatekeepers for both colleges and potential students, and have both the interest and ability to prevent this. Not a perfect analogy, but there's top law firm that managed to get banned from UChicago interviews for three years for less egregious behavior than this.",
      "author": "MuffinsAndSparkles",
      "created": 1581281094,
      "upvotes": 3,
      "replies": {}
    },
    "fh343m5": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh343m5/",
      "text": "You’re wrong you do have proof, it’s a Starbucks they most likely have cameras you can use that",
      "author": "derickv12",
      "created": 1581264518,
      "upvotes": 2,
      "replies": {}
    },
    "fh3b7j4": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3b7j4/",
      "text": "He’s disgusting",
      "author": "phymathnerd",
      "created": 1581266981,
      "upvotes": 2,
      "replies": {}
    },
    "fh3hd1j": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3hd1j/",
      "text": "That is extremely inappropriate. I would definitely report this to Dartmouth because this is wrong. I am a guy, but I look down on those that can't treat women with respect, especially with the #MeToo movement. One of my core values is to treat everyone, but especially women, with respect. As others have said, your best option is to report this incident to Dartmouth, I think.",
      "author": "xCheetaZx",
      "created": 1581268977,
      "upvotes": 2,
      "replies": {}
    },
    "fh466t5": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh466t5/",
      "text": "That’s sexual harassment. Email Dartmouth about him, say what he did, and provide his name. They may have had complaints about him before so sending them a formal complaint could force them to address the issue.",
      "author": "Jords4803",
      "created": 1581275580,
      "upvotes": 2,
      "replies": {}
    },
    "fh49mt7": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh49mt7/",
      "text": "Report that scum bag. It seems like he’s been doing it for a while.",
      "author": null,
      "created": 1581276597,
      "upvotes": 2,
      "replies": {}
    },
    "fh2dy7f": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2dy7f/",
      "text": "Please I request you...I plead you,that if unfortunately this sort of thing ever happens again just don't let it happen, don't be quiet, slap the shit outta him right then and there. Publicly shame the shit out of such degenerate mothercuckers.",
      "author": "hollowsoul_",
      "created": 1581248256,
      "upvotes": 5,
      "replies": {
        "fh2rjuc": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2rjuc/",
          "text": "This is what everyone has always told me and I’ve always followed that advice. I know that as a woman there is nothing wrong with telling random guys who are harassing to fuck off. It’s just those are random guys and not my college interviewer. I know now that the interview doesn’t really hold that much weight anyway and that I’m not going to be penalized for it. At the time I just didn’t know what to do. Thanks for your comment :)",
          "author": "collegethrowaway9301",
          "created": 1581259963,
          "upvotes": 9,
          "replies": {
            "fh2srrz": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2srrz/",
              "text": "Look, penalized or not,holds weight or not, one simply shouldn't stay quiet in these sort of situations. You most probably wouldn't get intimate even if he somehow magically guaranteed you admission , would you? Honestly,in life you'll probably meet people who can sure-shot guarantee anything...ppl are rich,but its about your belief system. Nothing is wrong unless its against your belief system and metrics. I do understand that girls sometimes can't, the anxiety is overbearing. But hey have a safe journey, sorry for preachin'.",
              "author": "hollowsoul_",
              "created": 1581260480,
              "upvotes": 0,
              "replies": {
                "fh2tvxt": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2tvxt/",
                  "text": "I knew what he was doing wasn’t ok and he must’ve too. Even though I didn’t say “stop touching me” my body language gave it away I think he was just ignoring that. No I would never in a million years sleep with an alum to get into a college, not only does that go against my beliefs I just wouldn’t want to either. I didn’t say anything though because I was really scared he was going to report badly of me but I know better now. It’s like I can repeat a thousand times over that it’s okay for girls to be rude, it’s okay to let them know they are bothering you, but in the moment all of that just left my brain and was replaced with ‘don’t cause a scene what if he says something bad about you’",
                  "author": "collegethrowaway9301",
                  "created": 1581260923,
                  "upvotes": 6,
                  "replies": {
                    "fh31748": {
                      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh31748/",
                      "text": "Everyone has advice in hindsight, and I find this kind of victim shaming pretty offensive.  You don’t need to feel bad about how you reacted in the moment. Frankly, while Reporting this guy was the right thing to do, you wouldn’t need to feel bad if you had decided to let it go. You are the victim here. And how you react and decide to move forward is your choice. \n\nEveryone has different reactions in stressful situations, and most women have been raised to be “nice”,  not just to be ladylike, but because we’ve learned at some point that confronting or provoking men can be dangerous.  Unfortunately, we still live in a world where you have to make a judgment call to do what you feel is necessary to stay safe. You got out of there without further incident which is your number one goal .  I’m glad you’ve decided to report it, and I hope that gives you back some power, but don’t spend a single second blaming yourself for how you handled it.",
                      "author": "2lhasas",
                      "created": 1581263476,
                      "upvotes": 11,
                      "replies": {}
                    },
                    "fh2unl4": {
                      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2unl4/",
                      "text": "I do understand that moment when you just kinda freeze but feel overwhelmed inside, and don't worry about, just hopefully try to forget. You met a creep, probably wouldn't be the last one so yeah don't over think.... hope ya get in wherever you feel best.",
                      "author": "hollowsoul_",
                      "created": 1581261199,
                      "upvotes": 1,
                      "replies": {
                        "fh2wn4i": {
                          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2wn4i/",
                          "text": "Thank you for this. I had 1 other college interview before with a man and he was nothing short of wonderful. At least it’s over...again thank you for commenting",
                          "author": "collegethrowaway9301",
                          "created": 1581261889,
                          "upvotes": 3,
                          "replies": {
                            "fh2wwcg": {
                              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2wwcg/",
                              "text": "No problemo...do svidanya",
                              "author": "hollowsoul_",
                              "created": 1581261981,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fh2t2jj": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2t2jj/",
      "text": "This is disgusting I’m so sorry you had to deal with this.",
      "author": "CapitalismIsBad123",
      "created": 1581260629,
      "upvotes": 1,
      "replies": {}
    },
    "fh35yuu": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh35yuu/",
      "text": "Report this to the police wtf",
      "author": null,
      "created": 1581265243,
      "upvotes": 1,
      "replies": {}
    },
    "fh3b7yh": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3b7yh/",
      "text": "If you decide to post this, would you edit/update this post? Now I'm really interested to hear what happens to that sick freak.",
      "author": "angur0807",
      "created": 1581266985,
      "upvotes": 1,
      "replies": {
        "fh3jr27": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3jr27/",
          "text": "Okay. I don’t know how long it’ll take for a response",
          "author": "collegethrowaway9301",
          "created": 1581269651,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fh3v1l6": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3v1l6/",
      "text": "I’m so sorry you had to go through that. I hope you get into Dartmouth, sending lots of love ❤️❤️❤️",
      "author": "ilanajacobs6",
      "created": 1581272530,
      "upvotes": 1,
      "replies": {}
    },
    "fh3zbdq": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3zbdq/",
      "text": "I would see if it would be possible to obtain footage of the interview if the Starbucks you went to had cameras or such. I'm not sure, but you should definitely try to check and obtain evidence against him",
      "author": "soggytofu1234",
      "created": 1581273745,
      "upvotes": 1,
      "replies": {}
    },
    "fh4b60g": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh4b60g/",
      "text": "Dear OP, my heart goes to you and I’m so sorry this happened. There’s nothing else I could do than offer you my support and wishes. I wish you will never have to experienced anything like this again and I wish you nothing but the best in your education.",
      "author": null,
      "created": 1581276967,
      "upvotes": 1,
      "replies": {}
    },
    "fhfbjw6": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fhfbjw6/",
      "text": "Something similar has happened with me regarding a Yale interviewer, and the guy used the same line about 'knowing people in admissions.' However, I wasn't actually in an interview, I had just met the guy at a political event and struck up a conversation, and he invited me out to lunch at his country club. I was genuinely excited because I naively thought \"this is my way into Yale!\" But the guy seemed a little bit off-kilter, and the way he grabbed my arm throughout lunch was a little bit uncomfortable for me. He also warned me about recommenders backstabbing me (due to his experience in HS) and to tell my recommenders to send their letters to his address for a \"special scholarship\" so that he could check them for me. I felt this was extremely weird/unethical. He then said he would be happy to write a rec letter to Yale for me, but he needed to see me in action 1 more time and invited me to the pride march to volunteer at his tent (he's running for state rep). But honestly, the interview left me feeling very weird and his conversation sounded quite deranged and paranoid (apparently he worked at Goldman for Steve Mnuchin, so that could be an explanation), and I felt like he was somehow manipulating me using his status as a Yale alum. So I ghosted him. Whew this was smth I was holding onto for a quite a bit of time lmao.",
      "author": "dk7united",
      "created": 1581540104,
      "upvotes": 1,
      "replies": {}
    },
    "fh2dpda": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2dpda/",
      "text": "Honestly Dartmouth or not,I don't care... I'd kick him in the nuts the second he touched me. Sounds like Lolita by Vladimir Nabokov...fuck that pedophile psychopathic turdiest turd. Yo I just wanna say that in the future if you don't approve of something,stand up for yourself.",
      "author": "hollowsoul_",
      "created": 1581247898,
      "upvotes": -5,
      "replies": {}
    },
    "fh2m23d": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2m23d/",
      "text": "You guys have interviews not at the uni? Why?",
      "author": "reCAPTCHAfool",
      "created": 1581257497,
      "upvotes": -2,
      "replies": {
        "fh2pkjz": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2pkjz/",
          "text": "I don’t live in New Hampshire",
          "author": "collegethrowaway9301",
          "created": 1581259175,
          "upvotes": 2,
          "replies": {
            "fh2wnce": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2wnce/",
              "text": "You'd think it would be done via Skype or something then. So you meet someone 'from' the uni? Do they actually work for them or like an alumni?",
              "author": "reCAPTCHAfool",
              "created": 1581261892,
              "upvotes": -2,
              "replies": {
                "fh2xhzn": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2xhzn/",
                  "text": "I don’t think Dartmouth conducts any interviews on their campus. It’s always an alum, and you’re supposed to meet in a public place. I think if you’re international you have an interview on skype but if they have someone living near you who’s an alum that’s who it’ll be",
                  "author": "collegethrowaway9301",
                  "created": 1581262184,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fh3ffdb": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3ffdb/",
      "text": "[removed]",
      "author": null,
      "created": 1581268413,
      "upvotes": -3,
      "replies": {
        "fh3j803": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh3j803/",
          "text": "fuckyoufuckyoufuckyou",
          "author": "lustradi",
          "created": 1581269484,
          "upvotes": 3,
          "replies": {
            "fh4tnxi": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh4tnxi/",
              "text": "idk what they said, but fuck them",
              "author": null,
              "created": 1581281996,
              "upvotes": 2,
              "replies": {
                "fh59422": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh59422/",
                  "text": "they said \"this man is a legend\"",
                  "author": "lustradi",
                  "created": 1581286386,
                  "upvotes": 6,
                  "replies": {
                    "fh6wcja": {
                      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh6wcja/",
                      "text": "gross",
                      "author": null,
                      "created": 1581307782,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fh268bl": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh268bl/",
      "text": "[removed]",
      "author": null,
      "created": 1581237122,
      "upvotes": -5,
      "replies": {}
    },
    "fh236k0": {
      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh236k0/",
      "text": "Don’t report to Dartmouth yet. Make notes with details about time, place, what you and him were wearing, as much of your , tell your bffs. Wait until decisions come out then report to dartmouth.",
      "author": "vhooloo",
      "created": 1581233144,
      "upvotes": -32,
      "replies": {
        "fh260o8": {
          "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh260o8/",
          "text": "no lol. Others are gonna fall victim too",
          "author": "YeetusYouGae",
          "created": 1581236834,
          "upvotes": 11,
          "replies": {
            "fh2cnfw": {
              "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2cnfw/",
              "text": "Report him after so that this does not interfere with your admissions process. It is unlikely that the person will interview more than a few candidates and by now interviews are almost over. Even if you report him now, they will need to go through a long process to determine whether to pull him out.\nWhat if he right away concocts a defense alleging the student was the one who instigated and promised the interviewer a consensual relationship if he could get her in? Then while Dartmouth reviews the case, they will have no choice but to put your admissions on hold.",
              "author": "vhooloo",
              "created": 1581246361,
              "upvotes": -3,
              "replies": {
                "fh2gi19": {
                  "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fh2gi19/",
                  "text": "this is ridiculous. this is how you allow quid pro quo harvey weinstein style harassment to continue. if you wait to benefit first they will always question your credibility.",
                  "author": "ktn699",
                  "created": 1581251702,
                  "upvotes": 11,
                  "replies": {
                    "fhgjkq9": {
                      "link": "/r/ApplyingToCollege/comments/f148vp/extremely_inappropriate_interviewer/fhgjkq9/",
                      "text": "That is my opinion. i would fully support if OP felt like they needed to report immediately. I was not in that situation, so cannot speak from first voice.",
                      "author": "vhooloo",
                      "created": 1581568907,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}