{
  "sid": "ri0oxi",
  "link": "/r/ApplyingToCollege/comments/ri0oxi/what_colleges_should_i_apply_to/",
  "title:": "What colleges should i apply to",
  "text": "Wanted Major: Comsci Stats: 1420 sat Rank 90/615\nGpa unweighted 3.8627 Weighted gpa 4.3529/98.5686\non 100pt scale 2 internships 1 job Eagle Scout Many\nclubs and organizations\n10 ap classes and 2 dual enrollment \nLive in texas but am willing to go out of state",
  "author": "anik225",
  "created": 1639690060,
  "updated": 1639786149,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hou2y6k": {
      "link": "/r/ApplyingToCollege/comments/ri0oxi/what_colleges_should_i_apply_to/hou2y6k/",
      "text": "The most important things to look for in a college are size, location, institution type (public/private research, public teaching, liberal arts, religious, etc.), cost of attendance, and program offerings. No one can tell you what schools to apply for based on your academic stats. You have to build your list based on your preferences and apply to schools that fit your goals.",
      "author": "tachyonicinstability",
      "created": 1639691494,
      "upvotes": 2,
      "replies": {
        "hou39o0": {
          "link": "/r/ApplyingToCollege/comments/ri0oxi/what_colleges_should_i_apply_to/hou39o0/",
          "text": "Sorry i feel like i worded this wrong. I wanted to know what type of colleges I could go to based on my credentials. I would do research based on the feedback I received, but thanks for your input.",
          "author": "anik225",
          "created": 1639691621,
          "upvotes": 1,
          "replies": {
            "hou485o": {
              "link": "/r/ApplyingToCollege/comments/ri0oxi/what_colleges_should_i_apply_to/hou485o/",
              "text": "College admissions doesn't really work that way although people often want it to. \n\nYou have good enough grades to apply to selective institutions. Highly selective schools - the highly \"ranked\" private universities with large endowments - are a struggle for everyone. Doesn't mean you can't apply, but I wouldn't spend the majority of my time applying to those schools. \n\nYour list needs to start with what you want from a college, not where you think you can get in. Once you have a list of many institutions, then you can decide on whether to apply based on which of the schools you'd like to attend will be likely or reach admissions for you.",
              "author": "tachyonicinstability",
              "created": 1639692005,
              "upvotes": 3,
              "replies": {
                "hou4egb": {
                  "link": "/r/ApplyingToCollege/comments/ri0oxi/what_colleges_should_i_apply_to/hou4egb/",
                  "text": "Thank you",
                  "author": "anik225",
                  "created": 1639692075,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}