{
  "sid": "rhm69h",
  "link": "/r/ApplyingToCollege/comments/rhm69h/activities_community_service_or_church/",
  "title:": "Activities: Community Service or Church?",
  "text": "Hi!\n\nI am debating whether I should change my English tutoring (it is a community service, working with an NGO in Korea teaching English to defected North Koreans - it was really fun) to Church/\n\nI am more involved in Church (goes to service, volunteer in projects, and I really enjoy my faith) than the Community Service (I did 2 hours every week for 20 weeks, however, not as much compared to church).\n\nDoes it look better on my application to keep the community service (which I have a lot already - homeless shelters, underprivileged cram schools, orphanage clubs) or to add my activities in church (something that is different from the rest of my activities?)\n\nThanks!",
  "author": "mysunshinebig",
  "created": 1639642387,
  "updated": 1639786746,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hora1o7": {
      "link": "/r/ApplyingToCollege/comments/rhm69h/activities_community_service_or_church/hora1o7/",
      "text": "depends on the kind of school you’re applying to maybe? church would probably be more useful if you’re applying to christian/catholic affiliated schools, if they’re more liberal/not affiliated maybe community service will look better, as your commitment to it is still impressive on its own",
      "author": "poolofgold",
      "created": 1639642567,
      "upvotes": 3,
      "replies": {
        "horabt2": {
          "link": "/r/ApplyingToCollege/comments/rhm69h/activities_community_service_or_church/horabt2/",
          "text": "nope. My best friend got in to stanford with tons of volunteer hours for youth church group leader. He had 800. Definitely put it as it will benefit you greatly!",
          "author": "HatOnly9300",
          "created": 1639642787,
          "upvotes": 1,
          "replies": {
            "horajkx": {
              "link": "/r/ApplyingToCollege/comments/rhm69h/activities_community_service_or_church/horajkx/",
              "text": "oh, i didn’t know that! i was kind of assuming, but i guess it makes the student look unique too in a way!",
              "author": "poolofgold",
              "created": 1639642951,
              "upvotes": 1,
              "replies": {
                "horatyi": {
                  "link": "/r/ApplyingToCollege/comments/rhm69h/activities_community_service_or_church/horatyi/",
                  "text": "hahahaah totally understandable. I was shocked that it benefits others for “standard” institutions too. I think community service all around is good but having a spike is the most important :)",
                  "author": "HatOnly9300",
                  "created": 1639643172,
                  "upvotes": 1,
                  "replies": {
                    "horcajv": {
                      "link": "/r/ApplyingToCollege/comments/rhm69h/activities_community_service_or_church/horcajv/",
                      "text": "Hi!! Thanks so much for you guys's comments.\n\nMy reach schools are Emory, American, and Ohio State. \n\nI have around 40 hours for community service, but for church I have a commitment of more than 100 hours (+ community service)... I am still kind of unsure of which one to put. But as the rest of my activities are filled with community service, does putting church down seem to stand out & be more impressive than another community service commitment of 40 hours?",
                      "author": "mysunshinebig",
                      "created": 1639644350,
                      "upvotes": 1,
                      "replies": {
                        "horczyp": {
                          "link": "/r/ApplyingToCollege/comments/rhm69h/activities_community_service_or_church/horczyp/",
                          "text": "put both",
                          "author": "HatOnly9300",
                          "created": 1639644915,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}