{
  "sid": "q6zdag",
  "link": "/r/ApplyingToCollege/comments/q6zdag/how_to_politely_nudge_a_rec_letter_teacher/",
  "title:": "How to politely nudge a rec letter teacher?",
  "text": "Hey everyone!\n\nI requested my rec letters from teachers in early September and sent them all their required materials. I haven’t heard anything back from them yet, with no activity on naviance, but one of my friends who requested one of the same teachers as me got a completed letter back in a week. \n\nWith ED and EA deadlines coming up soon, would it be ok to email the teachers asking for a status update on the rec letters, and if so how would I go about it without sounding too pushy or rude?\n\nThanks for any help!",
  "author": "DecisiveHypnosis",
  "created": 1634084546,
  "updated": 1634167077,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hgfe7gz": {
      "link": "/r/ApplyingToCollege/comments/q6zdag/how_to_politely_nudge_a_rec_letter_teacher/hgfe7gz/",
      "text": "No need to feel awkward; it's an important duty.\n\nI've probably written hundreds of recs. Best reminder emails from students were to the point and simple, like so:\n\n>Reminder: The deadlines for the following recommendations are approaching. The first deadline is 1 November. Please let me know if you need me to resend my information or have questions.  \n>  \n>Thank you!  \n>  \n>Studious McStudyFace  \n>  \n>\\----  \n>  \n>Podunk University, Computer Science and Agronomy, 1 November  \n>  \n>Whatsamotta U., Resource Economics and Sustainability, 1 November  \n>  \n>College of Knowledge, Bioinformatics, 5 November\n\nYou can then send the same thing three days before deadlines with any schools who have not yet received their letter. If you haven't seen it by the day of the first deadline, send it yet again.\n\nOnce or twice I wrote a rec, sent it, and there was an issue. Had my student not emailed me, I would not have known to resubmit.",
      "author": "minimuminfeasibility",
      "created": 1634087106,
      "upvotes": 5,
      "replies": {}
    },
    "hgfik40": {
      "link": "/r/ApplyingToCollege/comments/q6zdag/how_to_politely_nudge_a_rec_letter_teacher/hgfik40/",
      "text": "Our java teacher told us to start the letter with \"a gentle reminder that ... \" i think it will work well",
      "author": "Buddy_the_Bub",
      "created": 1634089091,
      "upvotes": 2,
      "replies": {}
    },
    "hgfagop": {
      "link": "/r/ApplyingToCollege/comments/q6zdag/how_to_politely_nudge_a_rec_letter_teacher/hgfagop/",
      "text": "If you have a counselor, check with them first. If you don't, it's going to be a little harder, because going directly is awkward. Try emailing them individually for a status, phrasing it like \"I just wanted to check-in about recommendations for college applications...\" etc. \n\nJust try not to make it seem like a \"hurry up!\" and more so \"where are you at in this process?\"",
      "author": "tripletim",
      "created": 1634085367,
      "upvotes": 1,
      "replies": {}
    }
  }
}