{
  "sid": "r5636s",
  "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/",
  "title:": "Sometimes I ask myself why I'm even applying to colleges",
  "text": "I saw a post on this sub on Thanksgiving where everyone was talking about what they're thankful for and someone commented, ' I'm grateful for being in a position to even think about going to college.' And then it hit me. I'm not even in the position to consider college but I have to because it's my only ticket outta poverty. But then again, I don't know why I'm doing this. After an incredibly traumatic app cycle last year, there doesn't seem to be a point in doing it again. I kinda feel like a headless chicken at times during this process...does that make sense... \n\n\\- An international student trying again\n\n&#x200B;\n\n&#x200B;\n\nAlso if you've read and understood this entire pointless rant, thanks..",
  "author": "Catish-Raddish",
  "created": 1638221107,
  "updated": 1638479311,
  "over_18": false,
  "upvotes": 44,
  "upvote_ratio": 0.98,
  "comments": {
    "hmkyv1e": {
      "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmkyv1e/",
      "text": "It's a good question to ask/answer.  If you can't come up with an answer, then you might consider the possibility that you shouldn't, in fact, be applying to colleges.",
      "author": "jayphoward",
      "created": 1638221881,
      "upvotes": -23,
      "replies": {
        "hmm2rg0": {
          "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmm2rg0/",
          "text": "they stated it’s their ticket out of poverty. \n\nso many people (my parents included) work their ass off to come to america for a better life for their families back home and future family. it’s hard to do, but its valid for them to try",
          "author": "whoreforbrown",
          "created": 1638239501,
          "upvotes": 17,
          "replies": {
            "hmnumk1": {
              "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmnumk1/",
              "text": "This.",
              "author": "Catish-Raddish",
              "created": 1638280508,
              "upvotes": 4,
              "replies": {}
            },
            "hmm3zt6": {
              "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmm3zt6/",
              "text": ">they stated it’s their ticket out of poverty.\n\nAnd yet...\n\n>But then again, I don't know why I'm doing this.",
              "author": "jayphoward",
              "created": 1638240045,
              "upvotes": -10,
              "replies": {
                "hmm8h4g": {
                  "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmm8h4g/",
                  "text": "because it’s HARD. it might not feel worth it but it’s still ok for them to try",
                  "author": "whoreforbrown",
                  "created": 1638242058,
                  "upvotes": 14,
                  "replies": {
                    "hmnur48": {
                      "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmnur48/",
                      "text": "Thank you for understanding. I truly appreciate it.",
                      "author": "Catish-Raddish",
                      "created": 1638280572,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "hmmruh8": {
                      "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmmruh8/",
                      "text": "I agree it's okay for them to try.  I'm just saying:  you should know why you're doing it.  That answer might be \"because it's my ticket out of poverty\".  If you find yourself mindlessly applying to college and you have *no idea why*...that's not great.",
                      "author": "jayphoward",
                      "created": 1638252181,
                      "upvotes": -8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hmnujs4": {
          "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmnujs4/",
          "text": "Well that's an astounding lack of empathy from a parent (looking at your flair). And didn't think that I'd wake up to this when my post is flaired  'emotional support' .\n\nI think you missed the part that says that I'm trying again and that I had a traumatic app cycle. I don't think you understand what poverty is like and I hope you don't. I hope that no one in their teens has to take up the weight of the world for their families and be their only hope for a better life. This is my second time applying to colleges. The previous time I didn't get rejected from 1 or 2 BUT 20- 22 colleges from the US and UK together. To top it all off, I did get accepted to 3 top schools in the UK but couldn't go because of what you may ask: POVERTY\n\nHence why I have an unbearable amount of doubt and concern along the way. This post wasn't to discuss whether I should or shouldn't apply to colleges. This post was me merely asking for support because everything feels incredibly heavy knowing that I've got to do this no matter what and that the betterment of my family and me rests on this incredibly unpredictable cycle that screws over 100s of internationals each year.",
          "author": "Catish-Raddish",
          "created": 1638280470,
          "upvotes": 5,
          "replies": {
            "hmnwe5c": {
              "link": "/r/ApplyingToCollege/comments/r5636s/sometimes_i_ask_myself_why_im_even_applying_to/hmnwe5c/",
              "text": "Ultimately it was intended to be supportive.  Clearly you have a well-defined reason for applying to college.  When things gets tough, and it sounds like they have been, remember that reason. The key takeaway was:  don't fret that you're asking the question; it's a great question to ask.\n\nThe alternative is to apply to college mindlessly, for no reason at all.  That person, when things get tough, asks themselves \"Why am I even bothering?\" and has no answer.\n\nSometimes the right call is to push through difficulty and persevere.  Other times the right call is to opt out and preserve one's sanity.  Answering the \"why?\" question a big part of figuring out whether a given situation is the first kind or the second kind.",
              "author": "jayphoward",
              "created": 1638281382,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}