{
  "sid": "qq5hmg",
  "link": "/r/ApplyingToCollege/comments/qq5hmg/i_know_im_just_overthinking_but/",
  "title:": "I know I'm just overthinking but...",
  "text": "Our counselor first told us not to report ranks. Then a few days later, he tells us to report ranks. Good for me because I was rank 1. Now, I was worried that he'll forget to change the rank details from his guidance counselor portal or whatever it is. So I remind him a few times. Even on the day that he was to submit, I reminded him about the rank thing. He probably did everything right...\n\nBut hypothetically speaking, what if he forgot to change the rank info and didn't report my rank? What if he had reported our rank as 'none', which was originally what he wanted to do? On my common app, I reported my rank anyway. If he forgot to change somehow, will the AOs call my guidance counselor to deal with this discrepancy? I'm pretty sure my recs will say I'm at the top of my classes, but will AOs think I'm lying with my reported rank? I already bugged my counselor a few times before submission, and calling him again now after submission and asking about it will ease my mind but it'll be useless and definitely annoy him...",
  "author": "just_casually_living",
  "created": 1636469976,
  "updated": 1636653441,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hjxyiup": {
      "link": "/r/ApplyingToCollege/comments/qq5hmg/i_know_im_just_overthinking_but/hjxyiup/",
      "text": "You're overthinking.",
      "author": "skieurope12",
      "created": 1636470612,
      "upvotes": 9,
      "replies": {
        "hjy7l4c": {
          "link": "/r/ApplyingToCollege/comments/qq5hmg/i_know_im_just_overthinking_but/hjy7l4c/",
          "text": "I agree, but counselors in our country, at least in my HS, aren't well acquainted with this entire process, so there's this tiny chance he'll screw up. I was just wondering what happens if he reports the rank as 'none' and I report it exactly (given my transcripts and recs suggest I'm at the top of my class)",
          "author": "just_casually_living",
          "created": 1636474375,
          "upvotes": 0,
          "replies": {
            "hjy7suj": {
              "link": "/r/ApplyingToCollege/comments/qq5hmg/i_know_im_just_overthinking_but/hjy7suj/",
              "text": "You cannot do anything about it, so no sense in worrying.",
              "author": "skieurope12",
              "created": 1636474462,
              "upvotes": 1,
              "replies": {
                "hjy8bo6": {
                  "link": "/r/ApplyingToCollege/comments/qq5hmg/i_know_im_just_overthinking_but/hjy8bo6/",
                  "text": "Yeah, I did what I could. I just hope things went well from his side.\n\nThank you tho",
                  "author": "just_casually_living",
                  "created": 1636474674,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}