{
  "sid": "g2hzat",
  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/",
  "title:": "My high school class is boycotting online classes. This is wrong.",
  "text": "Yesterday, my HS principal sent a blast email saying that the Class of 2020's prom was cancelled, the senior awards would be presented online, the summa cum laude recognition would also be held online, and the final sting: in-person graduation was cancelled. \n\nThis morning, in our senior class Facebook group, several of my peers decided they would organize a \"senior skip day\" for online school to express their disappointment in our administration. Just a few hours ago, another student shared a long, heart-wrenching email that she sent to our district superintendent, which went into detail about her mom who has cancer and won't make it to her college graduation, wedding, etc. The student's high school graduation, which the mom would've been able to attend, was gone. She has poured kerosene to the flames.\n\nI'm mad our graduation is gone, too. I immigrated to the States with my family when I was 8 years old, and for the past three years, I've been telling my single mom that I'd work to deliver a speech in my high school graduation to tell everyone in the stadium about the sacrifices she's made and express just how thankful I am for her. A normal thank you wouldn't convey my gratitude; a thank you in front of thousands of people, however, could. I also wanted to celebrate how much I've grown as an individual, and thank my friends who were there for me when I ran away from home, encountered a period of depression, etc. Only a proper thank you in front of thousands could express my gratitude.\n\nNo matter how disappointed I am at the news of my graduation's cancellation, I do not doubt for a second the decision that my district administration made. What if just one person--out of the thousands that would attend the gathering--brought the coronavirus? Dozens--if not more--would catch it. What if the girl, whose mom has cancer, acquires the virus and brings it home with her? What will happen to her mother with breast cancer? To the girl: I understand your heartbreak, but what would your mom do? I hope she would choose to protect the lives of hundreds, including hers, at the sacrifice of an monumental experience--a choice that I consider heroic and wise.\n\nAll it takes is one--one out of thousands--to put the lives of dozens in danger. What if all--no, just a few hundred--of the high schools across the US hosted graduations? The physical, economic damage will be unimaginable. We seniors might not even have the fall semester of college. Do we need the spring semester off as well?\n\nNow, I stay home to protect my 50-year-old mom. This is how I express my gratitude for her. I haven't seen a single person outside my family for the past few weeks in order to protect my family. Most of the students here have parents who are aged 50 or older, and let's protect them by staying home. \n\nRant over.",
  "author": "obijuankenoB",
  "created": 1587053818,
  "updated": 1634075362,
  "over_18": false,
  "upvotes": 3238,
  "upvote_ratio": 0.94,
  "comments": {
    "fnljtof": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnljtof/",
      "text": "Does the student with the mom with cancer really want her mom to come to a large social gathering with a pandemic occurring? It really would not be safe for her immunocompromised mother. It really is unfortunate that graduation is canceled but it is for the safety of everyone involved, not malicious I don't think. \n\nAnd you're attitude towards this situation is very mature, good luck with everything!",
      "author": "allegro_con_spirito",
      "created": 1587054772,
      "upvotes": 1163,
      "replies": {
        "fnlutnu": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlutnu/",
          "text": "Exactly that made no sense to me. Putting ppl with weakened immune systems at risk for a graduation makes no sense. Even ppl with strong immune systems can die too",
          "author": "memeqween101",
          "created": 1587060107,
          "upvotes": 205,
          "replies": {
            "fno157k": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fno157k/",
              "text": "Something that didn't make sense either was running away from home and then wanting to thank her mom. 🤔🤔",
              "author": "TheGays",
              "created": 1587108309,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "fnmk3rw": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmk3rw/",
          "text": "She probably planned that event before everything went to shit, but of course you would feel betrayed and sad because of such thing, even if it is the only way in which nobody gets harmed",
          "author": "jimedizfinck",
          "created": 1587072864,
          "upvotes": 26,
          "replies": {}
        },
        "fnm0veo": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0veo/",
          "text": "I mean if the mom knows she’s gonna die soon, then what’s the point? She’ll die anyways. (Sorry if it’s dark but someone I know had a bachelorette party recently but limited the number of people. Her grandma said she’s going either way she’s old and will die soon either way)",
          "author": "litfur",
          "created": 1587063134,
          "upvotes": -90,
          "replies": {
            "fnm1wh9": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm1wh9/",
              "text": "Wow, so edgy!",
              "author": "Stvdent",
              "created": 1587063649,
              "upvotes": 62,
              "replies": {
                "fnmadf8": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmadf8/",
                  "text": "It’s not edgy. It’s actually a pretty mature take on mortality.",
                  "author": "iRun-a-lot",
                  "created": 1587067874,
                  "upvotes": -33,
                  "replies": {
                    "fnmfma8": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmfma8/",
                      "text": "I wouldn't call it mature, as much as I'd say pragmatic. And just to be clear, pragmatism is not always the best course of action. Sure it works for some people, but it's a very divisive concept, especially when dealing with ideas such as mortality",
                      "author": "ShantanuPSinha",
                      "created": 1587070555,
                      "upvotes": 12,
                      "replies": {
                        "fnn1wyf": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn1wyf/",
                          "text": "You said a lot without saying anything.",
                          "author": "iRun-a-lot",
                          "created": 1587082665,
                          "upvotes": -4,
                          "replies": {
                            "fnnmg4d": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnmg4d/",
                              "text": "Thank you",
                              "author": "ShantanuPSinha",
                              "created": 1587095867,
                              "upvotes": 7,
                              "replies": {}
                            },
                            "fnnfjot": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnfjot/",
                              "text": "*This* is the guy judging people's maturity folks.",
                              "author": "Treacherous_Peach",
                              "created": 1587091200,
                              "upvotes": 0,
                              "replies": {
                                "fnnfr40": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnfr40/",
                                  "text": "None of what he said was relevant. I’m not even sure he knows what pragmatism means",
                                  "author": "iRun-a-lot",
                                  "created": 1587091336,
                                  "upvotes": -4,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fnn032k": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn032k/",
                      "text": "No.  I'd say its a pretty arrogant take on mortality, and if you'd like to talk about a mature perspective, I will say your claim has many logical flaws. I mean from your logic, I can also argue that we will all die eventually and the exact moment is uncertain. So should we all just don't care about our lives spread the disease?",
                      "author": "Doreeniiiiic",
                      "created": 1587081583,
                      "upvotes": 6,
                      "replies": {
                        "fnn1r7t": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn1r7t/",
                          "text": "If you read the comments, my reply concerns the actions of the mother alone and her situation as though it exists in a vacuum. Obviously don’t have the gathering. But if the gathering were to happen, she should go.",
                          "author": "iRun-a-lot",
                          "created": 1587082571,
                          "upvotes": -2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fnml0go": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnml0go/",
                  "text": "Lol\n\nJust to explain my case a bit: my moms friend had a bachelorette party, she works in a hospital in Seattle so she was exposed to Covid at work. She sent a notice to everyone about her exposure but still had the party as planned. She was worried about her older grandma (in her 90’s) but she said “what do I care, I’m gonna die sooner or later.” And went to the party.",
                  "author": "litfur",
                  "created": 1587073338,
                  "upvotes": -14,
                  "replies": {
                    "fnnq2fz": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnq2fz/",
                      "text": "So this lady was exposed to coronavirus and decided to host a party after? Wtf this is wrong on so many levels",
                      "author": "AntivaxxersGonnaDie",
                      "created": 1587098508,
                      "upvotes": 3,
                      "replies": {
                        "fnnr6jj": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnr6jj/",
                          "text": "Yup",
                          "author": "litfur",
                          "created": 1587099364,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fnm3wop": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm3wop/",
              "text": ">she’s going either way she’s old and will die soon either way\n\nWell, maybe that granma actually got the virus and spreads it to her other old friends and kills them all. But hey, who cares about old people they're gonna die anyways? Your friend and his grandma are quite selfish when you think about it",
              "author": "silppurikeke",
              "created": 1587064653,
              "upvotes": 25,
              "replies": {}
            }
          }
        },
        "fnlkglu": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlkglu/",
          "text": "[deleted]",
          "author": null,
          "created": 1587055078,
          "upvotes": -28,
          "replies": {
            "fnlljef": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlljef/",
              "text": "[deleted]",
              "author": null,
              "created": 1587055598,
              "upvotes": 33,
              "replies": {}
            },
            "fnlw04c": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlw04c/",
              "text": "We don’t have enough tests for the elderly, let alone enough for an unnecessary large gathering of young people.",
              "author": "megaroo8",
              "created": 1587060704,
              "upvotes": 15,
              "replies": {
                "fnm1t9q": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm1t9q/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1587063604,
                  "upvotes": -2,
                  "replies": {
                    "fnm30mi": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm30mi/",
                      "text": "Who shit in your Cheerios? Please stop being so ignorant and stubborn. I hope you have a better day.",
                      "author": "majesticjhibb",
                      "created": 1587064209,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fnls1dg": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnls1dg/",
      "text": "I think that our high school experience is probably gone. I was really looking forwards to prom but I've shifted my attitude to social distancing and staying away from public places as best as I can. If every little bit matters then I want to make it as likely as possible that they don't have to cancel university o-week, move-in, because I really want to make new friends and experience the independence that comes with university.",
      "author": "firecomet234",
      "created": 1587058733,
      "upvotes": 298,
      "replies": {
        "fnmd5r7": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmd5r7/",
          "text": "The university I committed to already moved orientation online about 2 weeks ago.",
          "author": null,
          "created": 1587069292,
          "upvotes": 43,
          "replies": {
            "fnmj75a": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmj75a/",
              "text": "If college ends up being online in the fall I will lose my last shred of sanity. I don't do well at all with this online learning. And the only reason I'm getting through any of this is the hope that I'll get to college in the fall. I'm incredibly hurt and angry about all that I've lost this year (angry at the universe, not at the people who made the decisions; I do recognize that it was the right call) and college is the only thing I have left to look forwards to. If that gets taken away I don't think I'll even have the motivation to get out of bed anymore.",
              "author": "IaniteThePirate",
              "created": 1587072392,
              "upvotes": 90,
              "replies": {
                "fnml2tf": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnml2tf/",
                  "text": "I can totally relate to how you're feeling right now. I think we're allowed to feel robbed and angry and hope for a quick end to the situation while recognizing that we are doing the right thing as a society. I looked on to university as a new chapter of my life, one that I was really excited for, and I'd be disappointed if it didn't start with the memories & experiences of freshman year.",
                  "author": "firecomet234",
                  "created": 1587073373,
                  "upvotes": 28,
                  "replies": {
                    "fnmrqvm": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmrqvm/",
                      "text": "Completely feel this. Just a month ago, the future was looking so bright, and like you said, a new chapter was going to begin. And it's still going to begin but not in the way that we expected.\n\nI know that's okay, but man, it really stings. Especially because the beginning of one's freshman year in college is an entire cultural tradition that has existed for generations, and we've been robbed of it.",
                      "author": "PuffyCottonCandy",
                      "created": 1587076901,
                      "upvotes": 23,
                      "replies": {
                        "fnmwzc4": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmwzc4/",
                          "text": "That read like the first paragraph out of an apocalyptic novel.",
                          "author": "Mstrmister",
                          "created": 1587079788,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fnmri3f": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmri3f/",
                  "text": "See if you can take a gap year. It's likely most universities will have to start out on line in the fall.",
                  "author": "Burgess1966",
                  "created": 1587076769,
                  "upvotes": 9,
                  "replies": {
                    "fnmu9yi": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmu9yi/",
                      "text": "I would strongly consider that but a) I have no fucking clue what I’d do during that year and sitting around with nothing to do is my absolute nightmare and will eventually send me into a spiral where I hate myself but also b) more importantly I’m not sure how taking a gap year would affect my scholarships / participation in the honors program. I have 40k in scholarships/aid conditional to me enrolling full time so I literally can’t afford a gap year if those aren’t guaranteed to still apply",
                      "author": "IaniteThePirate",
                      "created": 1587078282,
                      "upvotes": 19,
                      "replies": {}
                    }
                  }
                },
                "fnnrc06": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnrc06/",
                  "text": "It’s really not that big of a deal, your potential classmates will be in the same boat. Also, don’t place so much of your sanity in school, that’s bound to backfire. School is temporary, try to build a life worth living where you are now because if you can’t then to be honest it’s probably going to be even tougher when you’re taking college level classes, unless you do some non-stem type of thing.\n\nBut seriously, you’ll probably never have this much free time again, make the best of it",
                  "author": "MyKoalas",
                  "created": 1587099483,
                  "upvotes": -2,
                  "replies": {
                    "fnnsjy8": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnsjy8/",
                      "text": "It is a big deal. I had several opportunities that I've spent the past four years working for and now they're gone and there's nothing I can do about it. It's heartbreaking. And it's not all about school, believe me. These weren't things I wanted to do just for the sake of school or grades but because I was looking forwards to experiences with friends or they were hobbies and projects I find genuinely rewarding that I can no longer do. It's the same with college. I genuinely enjoy school and learning and I'm really excited to go off and learn, but I also am looking forwards to the experience of it. I want to move to a new state and meet new people and try new things. Which wouldn't happen with online classes. \n\nI'm not really sure why you think you know me or my feelings or assume that you get to decide what is and isn't a big deal or that I don't have a life worth living. I want more out of life than being stuck at home all day, believe it or not.",
                      "author": "IaniteThePirate",
                      "created": 1587100456,
                      "upvotes": 3,
                      "replies": {
                        "fnnt371": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnt371/",
                          "text": "I didn’t say you don’t have a life worth living, the exact opposite actually. You have more free time than ever, and you’ve got a world of resources online to go off and learn from! \n\nThe whole world can’t really meet new people right now, so you’re not at a disadvantage, you’re just going to be a tad older",
                          "author": "MyKoalas",
                          "created": 1587100904,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fnmicvl": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmicvl/",
              "text": "Major freaking F",
              "author": "ALT_button",
              "created": 1587071959,
              "upvotes": 2,
              "replies": {}
            },
            "fnmkupk": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmkupk/",
              "text": "Oh no! I'm sorry to hear that.",
              "author": "firecomet234",
              "created": 1587073253,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fnm7xuu": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm7xuu/",
          "text": "Same! I’m really sad about losing grad but for now I’m doing my best and hoping that welcome week and the whole college experience isn’t impacted too badly. We just have to focus on the future and keep moving forward.",
          "author": "itsrainingbees",
          "created": 1587066657,
          "upvotes": 23,
          "replies": {
            "fnml4nw": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnml4nw/",
              "text": "Let's keep our heads up and roll with the punches. Great attitude :)",
              "author": "firecomet234",
              "created": 1587073400,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fnmwtvi": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmwtvi/",
          "text": "Oh man. As an older redditor here, I hadn’t even thought about what the younger generations might face down the line.  College “orientation” completely with “realistic and lifelike graphics” to truly provide that college experience. \n\nThey’ll have e-dorms but really stay living at home. You’ll have e-dorm mates too. Where do you stash the bottle of e-vodka?!\n\nFuck man.",
          "author": "Mstrmister",
          "created": 1587079703,
          "upvotes": 9,
          "replies": {
            "fnnavb8": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnavb8/",
              "text": "Appreciate the sympathy, thank you :)",
              "author": "firecomet234",
              "created": 1587088220,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "fnnzow0": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnzow0/",
          "text": "Same here, I cannot express how mad I am at this situation. I was very un-social before and was only starting to come out of my shell, but this happened, confirming a theory that I have had for a long had – nothing good ever happens to me",
          "author": "ZhenDeRen",
          "created": 1587106891,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fnm4qh3": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm4qh3/",
      "text": "What would they like your school to do? Put hundreds of lives at risk?",
      "author": null,
      "created": 1587065064,
      "upvotes": 72,
      "replies": {
        "fnm9dyg": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm9dyg/",
          "text": "Teenagers don’t always think rationally.  Biological fact",
          "author": "throwawayacc293749",
          "created": 1587067372,
          "upvotes": 58,
          "replies": {
            "fnmryvy": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmryvy/",
              "text": "Yeah we’ve given our principal shit for trying to make changes like push the start of the school day back n shit like that but looking back we were 100% wrong to do that it’s always worked out really well",
              "author": "peacefulghandi",
              "created": 1587077021,
              "upvotes": 12,
              "replies": {}
            },
            "fnmc3tf": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmc3tf/",
              "text": "I can verify",
              "author": "DJ_Saidez",
              "created": 1587068751,
              "upvotes": 12,
              "replies": {}
            },
            "fnonmte": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnonmte/",
              "text": "Something you see a lot in life.  Many people don’t think rationally.  People can be very selfish and think only about themselves.  If they are healthy why worry?  This pandemic affects things they want to do so they’re pissed.  They may not have family that died or friends hooked up to ventilators right now.  They can’t think beyond their own little world.",
              "author": "RoleModelFailure",
              "created": 1587129750,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fnnivst": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnivst/",
          "text": "How about move prom and graduation to the summer?  It doesn’t seem difficult to postpone it to a later date.",
          "author": "BelugaBunker",
          "created": 1587093407,
          "upvotes": 15,
          "replies": {
            "fnnl6am": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnl6am/",
              "text": "I feel like if it was that easy, they would just do it",
              "author": null,
              "created": 1587094976,
              "upvotes": 1,
              "replies": {
                "fnnmuk4": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnmuk4/",
                  "text": "Plenty of schools are.",
                  "author": "BelugaBunker",
                  "created": 1587096148,
                  "upvotes": 11,
                  "replies": {
                    "fnnmwo7": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnmwo7/",
                      "text": "Exactly. Mine included. So there has to be some reason they can’t",
                      "author": null,
                      "created": 1587096190,
                      "upvotes": 6,
                      "replies": {
                        "fnnmy1i": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnmy1i/",
                          "text": "Probably because it’s just cheaper and easier to cancel.",
                          "author": "BelugaBunker",
                          "created": 1587096218,
                          "upvotes": 7,
                          "replies": {
                            "fnnncfe": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnncfe/",
                              "text": "True",
                              "author": null,
                              "created": 1587096507,
                              "upvotes": 4,
                              "replies": {}
                            },
                            "fnnzssr": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnzssr/",
                              "text": "They’re getting cancelled either way.",
                              "author": "IronManConnoisseur",
                              "created": 1587106995,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fnnzrza": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnzrza/",
                      "text": "Only for them to get cancelled in the summer. This isn’t ending any time soon.",
                      "author": "IronManConnoisseur",
                      "created": 1587106973,
                      "upvotes": 0,
                      "replies": {
                        "fo6bzbc": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fo6bzbc/",
                          "text": "Late to the party, but idk why you are at 0 points. This shit is gonna fuck us up for a while.",
                          "author": "OfficialGameCubed",
                          "created": 1587554122,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fnlymtv": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlymtv/",
      "text": "So is it a skip day or a permanent boycott? A skip day isn’t unreasonable but if they’re boycotting for a graduation then I suppose it would be.",
      "author": "springsteeb",
      "created": 1587062022,
      "upvotes": 141,
      "replies": {
        "fnmig0z": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmig0z/",
          "text": "lol \"skip\" day.\n\nSo what, just don't get out of bed?",
          "author": "sfo1dms",
          "created": 1587072004,
          "upvotes": 54,
          "replies": {
            "fnn2dc4": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn2dc4/",
              "text": "a skip day as in one time not every time lol",
              "author": "Meme-Hammer",
              "created": 1587082936,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "fnmy1zp": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmy1zp/",
          "text": "Yeah, this is the distinction to me, skip days are a normal part of senior year, and it’s one of the things you can still at least sort of do with online school. Boycotting though is ridiculous, as awful as it is to miss all those senior staples, the health of the community at large is more important",
          "author": "pokexchespin",
          "created": 1587080402,
          "upvotes": 25,
          "replies": {}
        },
        "fnmsia9": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmsia9/",
          "text": "My class has had a couple skip days at this point, tbh. Skip days mean nothing",
          "author": "doughman02",
          "created": 1587077315,
          "upvotes": 6,
          "replies": {}
        },
        "fnmhfxt": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmhfxt/",
          "text": "[deleted]",
          "author": null,
          "created": 1587071491,
          "upvotes": 1,
          "replies": {
            "fnmiopn": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmiopn/",
              "text": "Most high school seniors organize a skip day regardless",
              "author": "iwantmoresoup",
              "created": 1587072128,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fnlx5oo": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlx5oo/",
      "text": "But why can't schools postpone these things? I would rather have an in person graduation in August (if corona was to die down around then) then an online one. And if corona was still a problem, then we would be doing online fall classes at our homes and could still potentially wait to reschedule prom/graduation etc.",
      "author": "Tenebrose",
      "created": 1587061278,
      "upvotes": 103,
      "replies": {
        "fnm07f2": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm07f2/",
          "text": "Bc there's no way to know if it'll die down by then",
          "author": "yerawiardharry",
          "created": 1587062800,
          "upvotes": 48,
          "replies": {
            "fnm0jld": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0jld/",
              "text": "Exactly, but that’s why it makes sense to tentatively postpone rather than cancel.",
              "author": "budgie1202",
              "created": 1587062970,
              "upvotes": 77,
              "replies": {
                "fnm79vm": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm79vm/",
                  "text": "I also recommend this too. My school has postponed all of our senior events, not cancelled.",
                  "author": "spaghettioohs",
                  "created": 1587066325,
                  "upvotes": 22,
                  "replies": {}
                }
              }
            },
            "fnm0m9p": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0m9p/",
              "text": "Are colleges cancelling fall semester? Not yet because there's no way to know it won't die down by then. And it's not like the school will lose any money if we pick a date that we can't use. We host our own graduation, we already have all the equipment needed and everything.",
              "author": "Tenebrose",
              "created": 1587063007,
              "upvotes": 17,
              "replies": {
                "fnm0pdi": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0pdi/",
                  "text": "I mean you can do that if u want, but some colleges are actually making plans now to continue online classes til spring 2021",
                  "author": "yerawiardharry",
                  "created": 1587063049,
                  "upvotes": 11,
                  "replies": {
                    "fnm10qf": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm10qf/",
                      "text": "What colleges?",
                      "author": "Tenebrose",
                      "created": 1587063208,
                      "upvotes": 3,
                      "replies": {
                        "fnm16r9": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm16r9/",
                          "text": "I know BU off the top of my head just cause that's where I applied (obviously not definitive)",
                          "author": "yerawiardharry",
                          "created": 1587063292,
                          "upvotes": 7,
                          "replies": {
                            "fnm1gqm": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm1gqm/",
                              "text": "If it's not definitive, what's the point? I just want a chance at graduation, at postponing the dates into the summer gives us a much larger chance of being able to enjoy our senior events",
                              "author": "Tenebrose",
                              "created": 1587063429,
                              "upvotes": -1,
                              "replies": {
                                "fnm2jzj": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm2jzj/",
                                  "text": "I mean have you contacted your district superintendent? My district is basically doing an online graduation but also postponing it until the summer just in case quarantine is lifted before the fall",
                                  "author": "yerawiardharry",
                                  "created": 1587063980,
                                  "upvotes": 3,
                                  "replies": {
                                    "fnm4hra": {
                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm4hra/",
                                      "text": "No, but our principal sent out a podcast with the plans already. We're doing a virtual graduation and are \"considering\" postponing it. A lot of other schools in my area already set alternative dates for prom and graduation, and I want my school to take the same iniative. My friends and I are going to email the principal asking for a more definitive plan.",
                                      "author": "Tenebrose",
                                      "created": 1587064945,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                },
                                "fnme1z3": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnme1z3/",
                                  "text": "Most colleges have moved all their summer terms online; unless you plan on missing class in the fall of your first semester in college to come back to do a *high school graduation ceremony*, it's just not likely to happen. Most colleges cancelled their graduation ceremonies too, including mine (graduating from my master's this spring) but it's really, honestly, a good decision. Some colleges are arranging for spring 2021 commencement opportunities but most people I know won't be attending. Shit happens.",
                                  "author": "2muchcaffeine4u",
                                  "created": 1587069752,
                                  "upvotes": 2,
                                  "replies": {
                                    "fnmrq5n": {
                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmrq5n/",
                                      "text": "Early august wont coincide with fall semester of college. And nobody is forced to go to a graduation they dont want to, but people who want one should have the option. I think we should at least get a postponement date for those interested",
                                      "author": "Tenebrose",
                                      "created": 1587076890,
                                      "upvotes": 4,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "fnnnjda": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnnjda/",
                          "text": "Few of the colleges I got accepted to, like UBC, Pratt and PrattMWP have informed me that they'll be doing online classes until 2021.",
                          "author": "Anikkou",
                          "created": 1587096647,
                          "upvotes": 1,
                          "replies": {
                            "fnnxxfw": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnxxfw/",
                              "text": "I looked at pratt institute and British Columbia and could find 0 information on a closing of the fall term. Could you please provide me a link to read ? Thanks:)",
                              "author": "Tenebrose",
                              "created": 1587105226,
                              "upvotes": 1,
                              "replies": {
                                "fnny2l4": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnny2l4/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1587105361,
                                  "upvotes": 1,
                                  "replies": {
                                    "fnp281q": {
                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnp281q/",
                                      "text": "Ya dude! Ofc!",
                                      "author": "Tenebrose",
                                      "created": 1587137955,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fnm13ha": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm13ha/",
                  "text": "i have heard talk of many schools considering going online for fall semester, including my school.",
                  "author": "wheres-the-avocados",
                  "created": 1587063246,
                  "upvotes": 3,
                  "replies": {
                    "fnm1c4j": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm1c4j/",
                      "text": "But nothing is set in stone; like you said, there's only talk right now. So at that point, at least allow us to keep a tentative date in case things do die down. If they don't, they cancel it then. At least give us a chance",
                      "author": "Tenebrose",
                      "created": 1587063365,
                      "upvotes": -2,
                      "replies": {}
                    }
                  }
                },
                "fnm89l3": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm89l3/",
                  "text": "Boston University just cancelled all in person classes until 2021",
                  "author": "GodofDonkeys101",
                  "created": 1587066820,
                  "upvotes": -5,
                  "replies": {
                    "fnm9am1": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm9am1/",
                      "text": "That's not true - they only made a contingency plan in the case that it is not suitable for on-campus instruction for Fall 2020 but it has been widely spun in the wrong way by the media. \n\nsource: am a BU student",
                      "author": "R8a8",
                      "created": 1587067325,
                      "upvotes": 14,
                      "replies": {}
                    },
                    "fnmboqn": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmboqn/",
                      "text": "https://www.foxbusiness.com/lifestyle/boston-university-coronavirus-fall-2020-postponement\n\n\"it is preparing for the possibility -- however unlikely -- that the coronavirus pandemic will prevent students from being able to return to campus until January 2021\" they're just taking precautions. they didn't cancel anything yet",
                      "author": "Tenebrose",
                      "created": 1587068541,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fnm0hv8": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0hv8/",
          "text": "there's no way we'll be business as usual  enough to have a graduation in August tbh, and that's ignoring that people will have other commitments at that time",
          "author": "wheres-the-avocados",
          "created": 1587062946,
          "upvotes": 3,
          "replies": {
            "fnm0z8x": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0z8x/",
              "text": "Why can't we have date just in case we do go back to usual? And if we don't go back to \"business as usual\" what's wrong with cancelling the future date? And I'm not saying we can't host a virtual graduation, but at least allow us to host an optional in person graduation for those of us who do we want to go.",
              "author": "Tenebrose",
              "created": 1587063187,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "fnmxuha": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmxuha/",
          "text": "Everything else aside, it's hard to get a venue. Unless you graduate on you own school's football field, they space you use to graduate is probably already booked for August.\n\nThere's also the issue of money. Depending on contracts, schools may have already had to eat the loss of a lot of graduation expenses, and paying for them again, with a real risk of having to cancel again . . . It's a lot.",
          "author": "FireMartialF",
          "created": 1587080282,
          "upvotes": 0,
          "replies": {
            "fnn3e53": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn3e53/",
              "text": "We use our school football field. And I don't know what graduation expenses are there? They provide no food, we use the same chairs, the school band plays the music. We already purchased our cap and gown too.",
              "author": "Tenebrose",
              "created": 1587083555,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fnln0px": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnln0px/",
      "text": "You think the school gonna care if they boycott classes, students are hurting themselves in the end of the day",
      "author": "yoyoyoposter101",
      "created": 1587056304,
      "upvotes": 134,
      "replies": {
        "fnlyq84": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlyq84/",
          "text": "Public schools get grants based on statistics like attendance",
          "author": "kearjoh88",
          "created": 1587062070,
          "upvotes": 61,
          "replies": {
            "fnm27r4": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm27r4/",
              "text": "That explains a lot",
              "author": null,
              "created": 1587063808,
              "upvotes": 14,
              "replies": {
                "fnmapd6": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmapd6/",
                  "text": "that is actually the answer to almost everything wrong with testing, pass/fail/ISS/everything about the public school system",
                  "author": "cathar_here",
                  "created": 1587068041,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "fnmf8z7": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmf8z7/",
              "text": "There's a lot of talk about that being waived as a result of coronavirus. A lot of rural schools are already seeing 50% absence rates.",
              "author": "2muchcaffeine4u",
              "created": 1587070363,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "fnly10a": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnly10a/",
          "text": "They might because graduation rates are important",
          "author": "Slipmeister",
          "created": 1587061713,
          "upvotes": 16,
          "replies": {
            "fnm20n0": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm20n0/",
              "text": "In Illinois at least, during at home learning, students' grades cannot go down, only stay the same or improve. So if students were passing their classes, they are good.",
              "author": "SOAPToni",
              "created": 1587063708,
              "upvotes": 38,
              "replies": {
                "fnm50xj": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm50xj/",
                  "text": "That happened to my school last semester. It saved a lot of peoples grades, but they said they would not be doing it this semester because online school is easier anyway, and we will have more time for it. \n\nI agree with that kind of, but also I dont want the extra stress of my grades slipping because I didnt see a new assignment that my teacher posted at 6pm because they are unorganized and dont know how to use the internet.",
                  "author": "Voldemort57",
                  "created": 1587065207,
                  "upvotes": 8,
                  "replies": {}
                },
                "fnm85nz": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm85nz/",
                  "text": "You think they’re gonna cancel school for rest of the year here in Illinois?",
                  "author": "GodofDonkeys101",
                  "created": 1587066765,
                  "upvotes": 2,
                  "replies": {
                    "fnmc83x": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmc83x/",
                      "text": "Absolutely. The stay at home order ends April 30th. My last day of school was supposed to be May 15th. What’s the point in having us go back for two weeks? Hella risky. No point.",
                      "author": "sldq",
                      "created": 1587068812,
                      "upvotes": 4,
                      "replies": {
                        "fnmf6pd": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmf6pd/",
                          "text": "Ye mine was set to end on May 19th. Idk tho man Pritzker said they might reopen he hasn’t decided yet. Your right tho it dosent make sense to open for 2 weeks",
                          "author": "GodofDonkeys101",
                          "created": 1587070330,
                          "upvotes": 1,
                          "replies": {
                            "fnml0o5": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnml0o5/",
                              "text": "I think Chicago public schools were scheduled to go until mid June because of the teacher strikes earlier in the school year. idk what is gonna happen with that now, but I agree it would be stupid to reopen.",
                              "author": "Scarblade",
                              "created": 1587073341,
                              "upvotes": 1,
                              "replies": {
                                "fnml9pd": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnml9pd/",
                                  "text": "The new White House guidelines released just last hour suggested that schools which were previously closed should remain closed. I think at this stage the chances of them reopening schools in Illinois is pretty much 0.",
                                  "author": "GodofDonkeys101",
                                  "created": 1587073473,
                                  "upvotes": 2,
                                  "replies": {
                                    "fnmm9a8": {
                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmm9a8/",
                                      "text": "Well that's comforting to hear, I appreciate the up-to-date info!",
                                      "author": "Scarblade",
                                      "created": 1587073990,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "fnmld7c": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmld7c/",
                          "text": "Wow your school ends early! In Ontario we don't finish until June 25th. Is it like that for all of Illinois?",
                          "author": "firecomet234",
                          "created": 1587073524,
                          "upvotes": 1,
                          "replies": {
                            "fnmuej8": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmuej8/",
                              "text": "Here where I live seniors finish right after AP tests and everyone else finishes after the first week of June, but we start at the end of August fwiw",
                              "author": "BylvieBalvez",
                              "created": 1587078351,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fnmkppv": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmkppv/",
                      "text": "I think eLearning will run the rest of the year, yes. School isn't cancelled though, plenty of learning is hopefully still going on!  I say this as a hopeful teacher.",
                      "author": "SOAPToni",
                      "created": 1587073182,
                      "upvotes": 2,
                      "replies": {
                        "fnmkxh5": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmkxh5/",
                          "text": "I mean I’m a senior so this thing has just made my senioritis 100x worst lol. At this stage I’m only going through the motions and just studying for my ap tests",
                          "author": "GodofDonkeys101",
                          "created": 1587073293,
                          "upvotes": 2,
                          "replies": {
                            "fnnvebm": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnvebm/",
                              "text": "Yeah, I struggle with how strict I want to be with my seniors. I feel bad for them.",
                              "author": "SOAPToni",
                              "created": 1587102917,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fnmis54": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmis54/",
                  "text": "Only in public schools though",
                  "author": "iwantmoresoup",
                  "created": 1587072175,
                  "upvotes": 1,
                  "replies": {}
                },
                "fnn04x8": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn04x8/",
                  "text": "same in Oklahoma. Secured myself all As tho which prob wouldve dropped in at least one class.... so not complaining",
                  "author": "imsadandrad",
                  "created": 1587081613,
                  "upvotes": 1,
                  "replies": {}
                },
                "fnnpcs2": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnpcs2/",
                  "text": "That's not entirely true. If you don't complete an assignment, you get an \"incomplete\". If you get a lot of those, you don't get credit",
                  "author": "WindyCityAssasin2",
                  "created": 1587097973,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fnm0cws": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0cws/",
      "text": "It seems like people are really upset and don’t know where to direct their anger. Your graduation had to be cancelled and nobody is to blame. I’m sorry you’re in such an unfortunate situation.",
      "author": "UnqualifiedBiologist",
      "created": 1587062878,
      "upvotes": 23,
      "replies": {}
    },
    "fnm18y5": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm18y5/",
      "text": "Meanwhile in my friend group: \"ugh, they rescheduled graduation. I was looking forward to having it online. Guess we gotta go now. At least we don't have to explain to our parents why we don't really wanna go to prom\"\n\nIn all seriousness though yeah I understand that for most people this really sucks :(. I'm glad to see you're taking it well though and able to understand why its so important. Its really disheartening to see all these people ignoring and/or refusing to quarantine because they don't understand why its so important. Best of luck in quarantine, and try to make the most of it",
      "author": "ZsaurOW",
      "created": 1587063321,
      "upvotes": 35,
      "replies": {
        "fnm4cku": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm4cku/",
          "text": "Yeah, honestly my life hasn't gotten worse at all if anything it has even got a little better lol. I still feel bad for all the people who really cared about prom and graduation but that's just not me",
          "author": "Original_Mac_Tonight",
          "created": 1587064872,
          "upvotes": 13,
          "replies": {
            "fnm5m6e": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm5m6e/",
              "text": "Gamer?",
              "author": "ZsaurOW",
              "created": 1587065500,
              "upvotes": 10,
              "replies": {
                "fnm836m": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm836m/",
                  "text": "Hehe maybe. I've possibly been staying up until 3-4 playing valorant everyday",
                  "author": "Original_Mac_Tonight",
                  "created": 1587066730,
                  "upvotes": 8,
                  "replies": {
                    "fnmjt2l": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmjt2l/",
                      "text": "Nice lol. This quarantine is working out nicely for some of us at least",
                      "author": "ZsaurOW",
                      "created": 1587072710,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "fnm6kp9": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm6kp9/",
                  "text": "Yes. I'd much rather have a massive LAN party instead of prom.",
                  "author": "ccAbstraction",
                  "created": 1587065978,
                  "upvotes": 9,
                  "replies": {
                    "fnmu2od": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmu2od/",
                      "text": "I can't tell if this is sarcastic or not, but I unironically agree. Atleast for homecoming it was the better play lol.",
                      "author": "CobaltStar_",
                      "created": 1587078174,
                      "upvotes": 3,
                      "replies": {
                        "fnneo61": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnneo61/",
                          "text": "I haven't been to a prom, and probably will never get to. I heard my school had fire dancers a few years ago, no clue what I would have been like this year. But from the two times, I went to Homecoming and the dances at GHP, LAN parties > Dance Parties. At GHP, me and the boys got all dressed up and went, but we all left and just played Smash and Jackbox instead. It was way more fun.",
                          "author": "ccAbstraction",
                          "created": 1587090631,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "fnmat2m": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmat2m/",
                      "text": "I would recommend a WAN party and have at it lol",
                      "author": "cathar_here",
                      "created": 1587068094,
                      "upvotes": 2,
                      "replies": {
                        "fnmjtvi": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmjtvi/",
                          "text": "U guys know whats up",
                          "author": "ZsaurOW",
                          "created": 1587072722,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fnnwcbg": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnwcbg/",
          "text": "I can't even tell you how fucking relieved I am that I get to take the money I set aside for prom and spend it on college stuff. Money don't come easy for me so I'm glad I don't have to buy a $50 ticket anymore.",
          "author": "imjustfutura",
          "created": 1587103764,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fnlvmxx": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlvmxx/",
      "text": "What state are you in?",
      "author": "nyc6711",
      "created": 1587060520,
      "upvotes": 15,
      "replies": {}
    },
    "fnm0602": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0602/",
      "text": "I completely agree with your point here and I don’t think the district is the villain but at the same time I’d boycott cause online work fucking sucks and I wish they’d just tell me I passed. So I agree with both.",
      "author": "Captian-Jack_Sparrow",
      "created": 1587062780,
      "upvotes": 16,
      "replies": {
        "fnm9f2x": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm9f2x/",
          "text": "That’s a big mood right there",
          "author": "throwawayacc293749",
          "created": 1587067388,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fnlzoz7": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlzoz7/",
      "text": "Thank you for this mature reflection. Times are super tough, and I feel for you seniors. But the health risks right now are terribly unpredictable.",
      "author": "blue_surfboard",
      "created": 1587062545,
      "upvotes": 16,
      "replies": {}
    },
    "fnmoy1t": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmoy1t/",
      "text": "This shit is like asking to talk to the manager of coronavirus. Like tf do you expect the school to do? Host graduation and literally risking the lives of the thousands attending it?",
      "author": "Icarus_13310",
      "created": 1587075402,
      "upvotes": 6,
      "replies": {}
    },
    "fnlkeu5": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlkeu5/",
      "text": "I feel like your classmates have a right to be mad assuming that your principal did not consult and see if they would rather have a delayed graduation.",
      "author": "DaKillaB",
      "created": 1587055054,
      "upvotes": 56,
      "replies": {
        "fnm9vnr": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm9vnr/",
          "text": "Including the students in the discussion is vital. It’s not about having them make the final decisions but listening to their concerns and who knows, maybe some alternative celebrations be planned at the end of summer",
          "author": "ScamsJunk",
          "created": 1587067624,
          "upvotes": 9,
          "replies": {}
        },
        "fnllo7r": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnllo7r/",
          "text": "...people are dying. There is more to worry about than missing graduation.",
          "author": "6_62607004",
          "created": 1587055662,
          "upvotes": 57,
          "replies": {
            "fnlwwr6": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlwwr6/",
              "text": "Just because there are bigger problems out there doesn't mean you can't complain about what's happening in your life. Yeah, I know that people are dying by the thousands every day, and families are being ripped apart by all this, but I'm still upset that I'm missing out on prom, my senior sports season, and the last few months of being a kid.",
              "author": "NormanQuacks345",
              "created": 1587061154,
              "upvotes": 58,
              "replies": {
                "fnm1cya": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm1cya/",
                  "text": "The problem is, this student body is blaming the administration for a problem they didn't create, and for a solution experts recommended.",
                  "author": "Saurcery4",
                  "created": 1587063377,
                  "upvotes": 15,
                  "replies": {}
                },
                "fnn1t2o": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn1t2o/",
                  "text": "I’m just saying, this energy you are using being pessimistic about your situation could be used for something else; possibly helping those in situations worse than yours. It’s just sad that people aren’t able to understand their privileges until they lose something.",
                  "author": "6_62607004",
                  "created": 1587082602,
                  "upvotes": 1,
                  "replies": {}
                },
                "fnm2mx1": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm2mx1/",
                  "text": "Yes, I agree; prom cancellations are sad. You are losing a big part of your life. However, one of the main problems with the comment was not being upset, but entitled. The person was putting blame on the authoritative personnel who made the decision to keep them safe, when they could have had prom and taken money from the kids instead. I have seen so many posts on social media where seniors are complaining about losing prom. While this is sad, the way some of these kids go about expressing their emotions is, to say the least, scary. A lot of these kids are trying to make this tragic time all about themselves, taking away from those actually affected by the virus. They are the future of our world, and somehow aren’t able to look at the bigger picture. As a fellow teen, I find this very unsettling, hence my comment. Also, there are a lot of people that are being affected by the virus indirectly to a greater extent, that I don’t see complaining as much as you guys. Example 1: people with mental health are being cut of from their professional advisors. Example 2: A multitude of people are losing their jobs. Not to mention, the other examples that you already gave. This form of self pity showcased by our high school seniors is absolutely disgusting. It’s okay to be upset, not entitled.",
                  "author": "6_62607004",
                  "created": 1587064020,
                  "upvotes": -10,
                  "replies": {
                    "fnm627d": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm627d/",
                      "text": "I personally agree with the multitude of cancellations. It sucks, but my prom was supposed to be next weekend, and there was no way that was happening. However, the attitude that \"you can't be sad, you can't express your emotions because someone has it worse than you\" is probably the worst take of all time. Who gets to be upset then? Is it the parent who lost a child to hunger? No, because somewhere out there there's a parent who lost a child to hunger *and* thirst. But not them either, because there's a kid who lost both parents and is now dying of both those. Who gets to express their suffering?",
                      "author": "NormanQuacks345",
                      "created": 1587065724,
                      "upvotes": 12,
                      "replies": {
                        "fnm6aza": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm6aza/",
                          "text": "A direct quote from my comment: “it’s okay to be upset, not entitled”",
                          "author": "6_62607004",
                          "created": 1587065844,
                          "upvotes": -4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "fnlrd6y": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlrd6y/",
              "text": "And graduation can be pushed back until people are not dying. I’m not advocating for graduation to happen right now, all I’m doing is giving reasoning behind anger. I have multiple family members with covid 19 so please don’t try to lecture me on death.",
              "author": "DaKillaB",
              "created": 1587058404,
              "upvotes": 74,
              "replies": {
                "fnmehrk": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmehrk/",
                  "text": "I think the reason most of them aren't \"postponing\" graduation is because by the time it gets to a point where it would be safe to even host a graduation (fall or spring semesters) way too many students would either a) be off to college and not available to come back for the ceremony, or b) not really be invested enough to make the effort to come anyway. Once you start college a lot of people find it weird to keep talking about the things you did in high school and a lot of kids might find the event embarrassing to go to.",
                  "author": "2muchcaffeine4u",
                  "created": 1587069977,
                  "upvotes": 5,
                  "replies": {}
                },
                "fnm5e2i": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm5e2i/",
                  "text": "I never said that you shouldn’t have a graduation, all I’m saying is that is extremely saddening that you put the blame on the principal. My only problem with the comment was not that you weren’t being upset, but entitled. You placed blame on the authoritative personnel who made the decision to keep you safe, when they could have had prom and taken money from you. I have seen so many posts on social media where seniors are complaining about losing prom. While this is sad, the way some of these kids go about expressing their emotions is, to say the least, scary. A lot of these kids are trying to make this tragic time all about themselves, taking away from those actually affected by the virus. They are the future of our world, and somehow aren’t able to look at the bigger picture. As a fellow teen, I find this very unsettling, hence my comment. Also, there are a lot of people that are being affected by the virus indirectly, that I don’t see complaining as much as you guys. Example 1: people with mental health are being cut of from their professional advisors. Example 2: A multitude of people are losing their jobs. Not to mention, the countless others. This form of self pity showcased by our high school seniors is absolutely disgusting. It’s okay to be upset, not entitled.",
                  "author": "6_62607004",
                  "created": 1587065390,
                  "upvotes": 0,
                  "replies": {}
                },
                "fnm07lk": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm07lk/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1587062803,
                  "upvotes": -7,
                  "replies": {
                    "fnm11wq": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm11wq/",
                      "text": "So Covid 19 means that we can never have graduation ever. If the class wants to have graduation then they should have the option to have it or in a way that keeps everyone safe like maybe having it over winter break when most people are home from school.\n\nMy father used to be a principal so I think it’s rather short sighted as an administrator to make a major decision for a group of student and not expect backlash if you do not consult them.\n\nI don’t exactly understand how my attitude causes more cases when I have been in my house for over a month at this point and I am recommending a solution that still keeps people safe. just because you don’t agree doesn’t mean that you should be able to decide for the entirety of America’s seniors,",
                      "author": "DaKillaB",
                      "created": 1587063224,
                      "upvotes": 2,
                      "replies": {
                        "fnm3t1a": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm3t1a/",
                          "text": "I never said that you shouldn’t have a graduation, all I’m saying is that is extremely saddening that you put the blame on the principal. My only problem with the comment was not that you weren’t being upset, but entitled. You placed blame on the authoritative personnel who made the decision to keep you safe, when they could have had prom and taken money from you. I have seen so many posts on social media where seniors are complaining about losing prom. While this is sad, the way some of these kids go about expressing their emotions is, to say the least, scary. A lot of these kids are trying to make this tragic time all about themselves, taking away from those actually affected by the virus. They are the future of our world, and somehow aren’t able to look at the bigger picture. As a fellow teen, I find this very unsettling, hence my comment. Also, there are a lot of people that are being affected by the virus indirectly, that I don’t see complaining as much as you guys. Example 1: people with mental health are being cut of from their professional advisors. Example 2: A multitude of people are losing their jobs. Not to mention, the countless others. This form of self pity showcased by our high school seniors is absolutely disgusting. It’s okay to be upset, not entitled.",
                          "author": "6_62607004",
                          "created": 1587064602,
                          "upvotes": 1,
                          "replies": {
                            "fnm5zl4": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm5zl4/",
                              "text": "The first part of your argument is fair if the Principal didn’t directly make the decision.\n\nThe rest of your argument is a Fallacy if relative privation, let the seniors grieve the things that they lost without calling them entitled or selfish. Just because they choose to express their sadness on social media or other methods doesn’t mean that they deserve to be attacked for being unaware or self serving. You can’t just starving children in Africa away the sadness they feel about losing the rest of their senior year. Also, high school senior make up many of the people in those two groups your mentioning which is often expressed as sadness over the larger issue, at least to them, as part of the loss of senior year.",
                              "author": "DaKillaB",
                              "created": 1587065687,
                              "upvotes": 1,
                              "replies": {
                                "fnm6t1t": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm6t1t/",
                                  "text": "No, they have every right to be upset. If my comment undermined your loss, I’m truly sorry. However, a key aspect of my comment was that people are being entitled. In fact, this is a direct quote from my comment: “it’s okay to be upset, not entitled.” I just hate the fact that people are getting upset at authorities when most of them are  literally trying just trying their best to keep us safe, it completely invalidates their efforts.",
                                  "author": "6_62607004",
                                  "created": 1587066093,
                                  "upvotes": 1,
                                  "replies": {
                                    "fnm7exl": {
                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm7exl/",
                                      "text": "I think that’s fair but getting mad at the administration, regardless of fault, is also kind of a key component of high school, hence the steps that many take to avoid it.",
                                      "author": "DaKillaB",
                                      "created": 1587066395,
                                      "upvotes": 1,
                                      "replies": {
                                        "fnm850o": {
                                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm850o/",
                                          "text": "I think we literally have the same points, lmao. Thank you for the respectful conversation :) I am going to take a nap now...",
                                          "author": "6_62607004",
                                          "created": 1587066756,
                                          "upvotes": 1,
                                          "replies": {
                                            "fnm88aj": {
                                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm88aj/",
                                              "text": "Have fun, I’m gonna attempt to stop procrastinating online school",
                                              "author": "DaKillaB",
                                              "created": 1587066803,
                                              "upvotes": 2,
                                              "replies": {
                                                "fnm8fhj": {
                                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm8fhj/",
                                                  "text": "Mood",
                                                  "author": "6_62607004",
                                                  "created": 1587066900,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "fnlq1mt": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlq1mt/",
              "text": "my school is delaying graduation until July and hope the situation gets better. i don't know why people are downvoting.",
              "author": "delawareyerrd",
              "created": 1587057759,
              "upvotes": 34,
              "replies": {}
            },
            "fnm9mic": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm9mic/",
              "text": "people are always dying from something, so we should never be able to complain about any problems. ever",
              "author": "LilAtex",
              "created": 1587067492,
              "upvotes": 3,
              "replies": {
                "fno1fll": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fno1fll/",
                  "text": "People aren’t always dying from a pandemic, though.",
                  "author": "zaku2",
                  "created": 1587108601,
                  "upvotes": 2,
                  "replies": {
                    "fnp36at": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnp36at/",
                      "text": "we just now hit the death numbers for a normal flu season. look it up. so yea kinda...",
                      "author": "LilAtex",
                      "created": 1587138413,
                      "upvotes": 0,
                      "replies": {
                        "fnpe11c": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnpe11c/",
                          "text": "There is literally a vaccine for the flu every year that people can receive but there is no vaccine for covid. And, since you really wanna harp on the flu season thing — flu season is from October to what? March, maybe? That’s about 6 months and we’ve had Covid for about a month so .... yeah, not everyone dies every day from a pandemic. Get a grip.",
                          "author": "zaku2",
                          "created": 1587143862,
                          "upvotes": 2,
                          "replies": {
                            "fnpez41": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnpez41/",
                              "text": "yes there is a vaccine for the flu every year and yet, many people still die from it. You can agree with that Im sure.\nI believe many people across the world dying from an illness qualifies as a pandemic. so, through these qualifications, a whole lot of people do in fact die from a pandemic every year. \n\nyou are incorrect.\n\nalso we have had coronavirus since January so..? also remember the swine flu? look shit up all the information is there just stop listening to fear mongering celebrities and public figures. so GeT a gRiP\n\nlet me know what’s false here.",
                              "author": "LilAtex",
                              "created": 1587144334,
                              "upvotes": 1,
                              "replies": {
                                "fnqxxvx": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnqxxvx/",
                                  "text": "The fact that you typed out get a grip doing the spongebob meme thing already makes this whole thing a huge waste of time for me.",
                                  "author": "zaku2",
                                  "created": 1587174666,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fnn1ngb": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn1ngb/",
                  "text": "I’m just saying, this energy you are using being pessimistic about your situation could be used for something else; possibly helping those in situations worse than yours. It’s just sad that people aren’t able to understand their privileges until they lose something.",
                  "author": "6_62607004",
                  "created": 1587082509,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "fnm9a25": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm9a25/",
          "text": "The administration was listening to actual scientists and experts though.  Why should they listen to students who don’t really know anything logistical or scientific about the virus?",
          "author": "throwawayacc293749",
          "created": 1587067318,
          "upvotes": 3,
          "replies": {
            "fnmc2d4": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmc2d4/",
              "text": "You can read my other comments but it’s more about satiating them and giving them reasoning. Like giving dc 3 votes in the electoral college",
              "author": "DaKillaB",
              "created": 1587068731,
              "upvotes": 1,
              "replies": {
                "fnmg0rx": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmg0rx/",
                  "text": "As someone who considers myself authoritarian on the political compass, this doesn’t really satisfy me haha",
                  "author": "throwawayacc293749",
                  "created": 1587070761,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "fnm186q": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm186q/",
          "text": "Why should the principal consult the students? They aren't experts on the spread and impact of Covid-19. Also, yeah they can push it back, but nobody has any idea when to push it back to--any promises they make about graduation right now are empty.",
          "author": "Saurcery4",
          "created": 1587063311,
          "upvotes": 7,
          "replies": {
            "fnm1qe9": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm1qe9/",
              "text": "At the lowest level, to satiate the students and let them feel heard, it’s akin to giving DC 3 electoral votes. Also, the principal probably isn’t either and an online graduation vs a delayed graduation at the point where the virus is no longer spreading both keep everyone safe.",
              "author": "DaKillaB",
              "created": 1587063564,
              "upvotes": 8,
              "replies": {
                "fnm2gqr": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm2gqr/",
                  "text": "You would be right if the principal was the one deciding, but none of these schools are really taking orders from a principal; they get orders from districts, who get orders from the state, who follow the directions of the CDC. \n\nAgain, nobody knows when a delayed graduation would happen, and there are way too many variables in play to suggest doing one--not the least of which is money.",
                  "author": "Saurcery4",
                  "created": 1587063935,
                  "upvotes": 3,
                  "replies": {
                    "fnm2rxi": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm2rxi/",
                      "text": "This is fair, but we don’t know if the Principal is or is not deciding. All school districts don’t report directly to the state in matters like these.",
                      "author": "DaKillaB",
                      "created": 1587064090,
                      "upvotes": 0,
                      "replies": {
                        "fnm3dby": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm3dby/",
                          "text": "Well even then, he's following the directions of the CDC: if there is substantial community spread, \n>Broader and/or longer-term school dismissals, either as a preventive measure or because of \rstaff and/or student absenteeism.\r\n>Cancellation of school-associated congregations, particularly those with participation of high-risk individuals.\r\n>Implement distance learning if feasible.",
                          "author": "Saurcery4",
                          "created": 1587064384,
                          "upvotes": 3,
                          "replies": {
                            "fnm477r": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm477r/",
                              "text": "Postponing graduation still follows the guidelines because it’s essentially cancelling for the near future.",
                              "author": "DaKillaB",
                              "created": 1587064798,
                              "upvotes": 2,
                              "replies": {
                                "fnm62ea": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm62ea/",
                                  "text": "Logistically, it's an issue; our principal did a zoom call with the senior class to let us know the situation, and here's a summary of what he said about in-person graduation:\n\nAs of now, it won't happen, but they are monitoring the situation. Logistically, by August (if the virus is done fucking everything up by then) many students will be off to college, and it won't be possible to get everyone to attend. If some can attend and others can't, it certainly wouldn't be fair to those who can't make it, and they will feel like they are missing out on an incredibly important occasion. The best time to hold a graduation, with everyone in attendance, is in June, but nobody can make that promise because the lockdown may still be in effect.\n\nSo basically, the only fair, inclusive, and practical method as of now is an online graduation, even if it doesn't look like it. He stressed that it's making the best of a bad situation.",
                                  "author": "Saurcery4",
                                  "created": 1587065726,
                                  "upvotes": 3,
                                  "replies": {
                                    "fnm67wm": {
                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm67wm/",
                                      "text": "This is valid, all it took was a zoom call/conference to prevent the backlash occurring in the op.",
                                      "author": "DaKillaB",
                                      "created": 1587065801,
                                      "upvotes": 2,
                                      "replies": {
                                        "fnm6g3q": {
                                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm6g3q/",
                                          "text": "Well kind of; he didn't give us any input, he was just explaining the situation and the decisions that had already been made. This principal may not have explained the reasoning fully, but in neither case were the students given any input on the issue. And either way, it's not deserving of a boycott.",
                                          "author": "Saurcery4",
                                          "created": 1587065914,
                                          "upvotes": 2,
                                          "replies": {
                                            "fnm73wb": {
                                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm73wb/",
                                              "text": "Realistically, the boycott is just them releasing frustration and is better than other means (emailing inappropriate things/doxxing) and in your case you guys were not given input but it’s kinda like he took what you would say in retort and explained it.",
                                              "author": "DaKillaB",
                                              "created": 1587066243,
                                              "upvotes": 1,
                                              "replies": {
                                                "fnm7ac8": {
                                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm7ac8/",
                                                  "text": "I know it's them releasing frustration; I think it's just a childish way to do it. Go work out or something instead, you know",
                                                  "author": "Saurcery4",
                                                  "created": 1587066332,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "fnm7ppl": {
                                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm7ppl/",
                                                      "text": "I mean a boycott also has more benefits (you don’t have so online school). But I get your point",
                                                      "author": "DaKillaB",
                                                      "created": 1587066544,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fnlrmch": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlrmch/",
          "text": "No one is going to care about a delayed graduation. Once high school is over people are done and don’t care",
          "author": "VROF",
          "created": 1587058529,
          "upvotes": -7,
          "replies": {
            "fnlrs8f": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlrs8f/",
              "text": "Hence the reason for consulting with the class, I know plenty of people at schools across the nation who would rather have delayed graduation than online graduation. The Class of 2020 isn’t a monolith so you can’t generalize.",
              "author": "DaKillaB",
              "created": 1587058609,
              "upvotes": 24,
              "replies": {
                "fnltf4g": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnltf4g/",
                  "text": "What the class feels in April is not how they will feel in July. I understand this sucks. It is terrible. Colleges are going through this same thing. A friend had his Naval Academy graduation cancelled. And most colleges are allowing 2020 grads to walk in Spring 2021. I bet no one decides to do it though.\n\nYou have to understand what the schools are going through. They are trying to plan for next year and educators aren’t known for being great at planning ahead or being flexible. In California they are struggling to decide if school starts online or in person. And if in person, what changes have to happen.",
                  "author": "VROF",
                  "created": 1587059415,
                  "upvotes": 0,
                  "replies": {
                    "fnltp2b": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnltp2b/",
                      "text": "Some schools have polls that show that students want to do it, as a matter of fact, The majority of my school 200+ would rather have delayed than online. You can’t unilaterally decide what every student everywhere wants.",
                      "author": "DaKillaB",
                      "created": 1587059551,
                      "upvotes": 12,
                      "replies": {
                        "fnlu12q": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlu12q/",
                          "text": "Yes, of course the students want to do it now. My point is they aren’t going to want to come back and do it in August or September. Or even July. Once they start jobs or college high school is over. That is what makes it all so sad, high school graduation is like a snap of fingers and kids turn into adults literally overnight.",
                          "author": "VROF",
                          "created": 1587059714,
                          "upvotes": -2,
                          "replies": {
                            "fnlx4t7": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlx4t7/",
                              "text": "I would much rather drag my ass back to my highschool to have my graduation in late July/August than have it be online or cancelled altogether. It's an important part of coming of age, and I don't want to miss it.",
                              "author": "NormanQuacks345",
                              "created": 1587061266,
                              "upvotes": 11,
                              "replies": {}
                            },
                            "fnlua0m": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlua0m/",
                              "text": "And what makes you more knowledgeable on what people want then they are? These are unprecedented times and, especially in areas where many people don’t go far for college, people would be happy to return as late as winter break (where they’re probably already home) to have a graduation ceremony.",
                              "author": "DaKillaB",
                              "created": 1587059837,
                              "upvotes": 6,
                              "replies": {
                                "fnlw0xr": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlw0xr/",
                                  "text": "!RemindMe 6 months",
                                  "author": "VROF",
                                  "created": 1587060715,
                                  "upvotes": 0,
                                  "replies": {
                                    "fnmbufk": {
                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmbufk/",
                                      "text": "There is a 2 hour delay fetching comments.\n\nI will be messaging you in 6 months on [**2020-10-16 18:11:55 UTC**](http://www.wolframalpha.com/input/?i=2020-10-16%2018:11:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlw0xr/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fg2hzat%2Fmy_high_school_class_is_boycotting_online_classes%2Ffnlw0xr%2F%5D%0A%0ARemindMe%21%202020-10-16%2018%3A11%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20g2hzat)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                      "author": "RemindMeBot",
                                      "created": 1587068619,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fnltakt": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnltakt/",
                  "text": "Delayed graduations would be completely irresponsible. Why would a mass gathering with (probably) family members from other parts of the state/country be a good idea? All it takes is one asymptomatic person passing the disease around and poof, the school is just fucked. Every projection shows that social distancing will probably be reduced come August, but a mass gathering is still a terrible idea that will probably still be banned. There’s a reason summer classes and programs are cancelled into August...",
                  "author": null,
                  "created": 1587059352,
                  "upvotes": -10,
                  "replies": {
                    "fnlu0wt": {
                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlu0wt/",
                      "text": "Wow, it’s almost like they can delay it further than that. And even if they ultimately choose not to delay the problem here is that the students don’t feel listened to.",
                      "author": "DaKillaB",
                      "created": 1587059712,
                      "upvotes": 8,
                      "replies": {
                        "fnm0uhg": {
                          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm0uhg/",
                          "text": "Delay it to when, January? March? Outta here. Schools have their own interests in mind (and federal and state compliances), and the student opinion has absolutely no bearing on decisions made in the face of a mass pandemic. I hope you understand that schools can be held liable if things go south because they decided to host graduation in the midst of a pandemic (without herd immunity or a vaccine in effect) because kids were crying on online forums. It's pretty clear, especially after seeing what universities did. You cant expect schools to take such a risk. Shit happens, but seniors need to understand that in-person graduation within the foreseeable future is absolutely not an option.",
                          "author": null,
                          "created": 1587063121,
                          "upvotes": 1,
                          "replies": {
                            "fnm1z42": {
                              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm1z42/",
                              "text": "No one asked schools to have graduation during a pandemic, that’s a strawman fallacy. Student opinion doesn’t have any real weight but just to consult with them is to make them feel heard and to keep it from blowing up into a bigger thing. \n\nYou’re misrepresenting my argument because any delayed graduation would be after we are out of the window of the pandemic.",
                              "author": "DaKillaB",
                              "created": 1587063685,
                              "upvotes": 5,
                              "replies": {
                                "fnm2k2l": {
                                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm2k2l/",
                                  "text": "So your argument is to have graduation delayed until the pandemic is over and circumstances are appropriate, probably over 1.5 years away? And you want schools to...tell that to students? Okay, cool. Not really an argument and I don't personally see the point in that, but I guess now I understand your previous comments.",
                                  "author": null,
                                  "created": 1587063981,
                                  "upvotes": 1,
                                  "replies": {
                                    "fnm3297": {
                                      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm3297/",
                                      "text": "You say that as if graduation couldn’t be modified (lessen the amount of guest tickets/only students inside, broadcast to family, etc) to happen earlier, not to mention that if colleges open in august having graduation would be a possible event. Clearly these students would rather have an delayed graduation and virtual graduation can happen at any point so they could decide that later if delayed graduation seems impossible.",
                                      "author": "DaKillaB",
                                      "created": 1587064233,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fnljhq6": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnljhq6/",
      "text": "my man, you are a great guy.",
      "author": "kickthevidit",
      "created": 1587054610,
      "upvotes": 19,
      "replies": {}
    },
    "fnmb86f": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmb86f/",
      "text": "I think you just delivered your speech to fellow high school peers. Nothing but respect for you.",
      "author": "BeefStew360",
      "created": 1587068307,
      "upvotes": 9,
      "replies": {}
    },
    "fnlzcdb": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlzcdb/",
      "text": "I applaud you. My mother also has gone through cancer recently and the chemo has left her immune system scarred and deficient. I hope people can help slow the spread so that people like the girl's mom, and my mom don't catch this disease that will almost certainly inflict damage and potentially death.",
      "author": "Cjd114",
      "created": 1587062373,
      "upvotes": 3,
      "replies": {}
    },
    "fnmgyli": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmgyli/",
      "text": "I’m like 80% sure I go to your school and know what girl you’re talking about. And yeah, the whole boycott thing is stupid. But I really wish they’d postponed graduation instead of canceling it outright.",
      "author": "mikey-way",
      "created": 1587071241,
      "upvotes": 3,
      "replies": {
        "fnnms9l": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnms9l/",
          "text": "CBS?",
          "author": "TyrantKoala",
          "created": 1587096102,
          "upvotes": 2,
          "replies": {
            "fntgl3o": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fntgl3o/",
              "text": "Yep lol",
              "author": "mikey-way",
              "created": 1587241227,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fnlz8u3": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlz8u3/",
      "text": "So glad to see you are not taking social distancing norms personally. I am sure it is frustrating, but getting mad at your school is pointless. The school doesn't control the virus or the regulations around it. While students may feel like they need to be consulted, its not up to them. This is serious and your attitude is the best gratitude you can show your mom.",
      "author": "amandagov",
      "created": 1587062325,
      "upvotes": 7,
      "replies": {}
    },
    "fnmj4jp": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmj4jp/",
      "text": "Bro in person graduation has long been canceled everywhere. You think you're having it bad imagine people graduating from Harvard Princeton and Stanford this year.",
      "author": "Anasoori",
      "created": 1587072355,
      "upvotes": 4,
      "replies": {}
    },
    "fnm6dic": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm6dic/",
      "text": "Thank you for sharing this. I’m so heart broken for the seniors too, and I’m lucky enough that my class will probably get some of our senior year experiences next year. But it’s so important that we all stay home right now, so you get your first semester of college and so our parents can live long happy lives and see us succeed. \n\nI understand their sentiments but it’s honestly selfish. The schools are def doing the best they can rn.",
      "author": "bienvenidos-a-chilis",
      "created": 1587065878,
      "upvotes": 2,
      "replies": {}
    },
    "fnm6oi2": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm6oi2/",
      "text": "Your class has \"summa...laude\" cool",
      "author": "gkmwheelspin",
      "created": 1587066030,
      "upvotes": 2,
      "replies": {}
    },
    "fnmawup": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmawup/",
      "text": "totally agree. not only that but i find that a lot of students are blaming the school administration?? when its not even their fault?? like most of this is mandatory protocol set by each of our state health departments, so all of this is out of their control. there’s no point in being angry at the wrong people tbh",
      "author": "ItsMunkle",
      "created": 1587068147,
      "upvotes": 2,
      "replies": {}
    },
    "fnmdoq0": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmdoq0/",
      "text": "I agree completely. It sucks for everyone and of course I wish we could go back to “normal.” For everyone’s safety, though, we can’t. I trust that the schools and the state governments are making the right decisions regarding closures and cancellations of events. All we can do now is stay home and stay safe, and hope that our efforts are enough to slow the rapid spread of the Coronavirus. Stay safe everyone, and stay home!",
      "author": "elroc77",
      "created": 1587069566,
      "upvotes": 2,
      "replies": {}
    },
    "fnmgr8x": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmgr8x/",
      "text": "Yeah fr, all of the seniors are disappointed about the loss of all these events, but get over it. People’s lives are at stake. My district cancelled graduation over 2 weeks ago and no one in the district has been “boycotting” or some shit like that. We’re all sad, but it’s the right thing to do.",
      "author": "OGSHAGGY",
      "created": 1587071136,
      "upvotes": 2,
      "replies": {}
    },
    "fnmgury": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmgury/",
      "text": "I'm in this kids school, these kids are real air heads",
      "author": "TyrantKoala",
      "created": 1587071186,
      "upvotes": 2,
      "replies": {}
    },
    "fnmid0q": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmid0q/",
      "text": "time will give you perspective.",
      "author": "sfo1dms",
      "created": 1587071961,
      "upvotes": 2,
      "replies": {}
    },
    "fnmikpn": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmikpn/",
      "text": "I'm actually surprised your schools administration hasn't even considered postponing graduation and other senior events. In my opinion that's the most reasonable approach, I'm sure students wouldn't mind attending later after the coronavirus goes away.",
      "author": null,
      "created": 1587072070,
      "upvotes": 2,
      "replies": {}
    },
    "fnmsjeq": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmsjeq/",
      "text": "Lol you said cum",
      "author": "rohleder1",
      "created": 1587077332,
      "upvotes": 2,
      "replies": {}
    },
    "fnmtt0j": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmtt0j/",
      "text": "I’m surprised they just cancelled graduation for you. It’s been cancelled here for a long time. As for thanking your parent, the speech idea did not seem like a good idea. Really that’s just an over glorified thank you. Actions speak louder than words so you can show your appreciation by helping around the house, saying I love you and helping your brothers and sisters and taking this time to spend with your family",
      "author": "jakenimbo",
      "created": 1587078027,
      "upvotes": 2,
      "replies": {}
    },
    "fnmuar0": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmuar0/",
      "text": "Senior skip day is a tradition. Skipping a day of online class is exactly what senior skip day should be on line. They can meet up in different zoom rooms\nor whatever, livestream a movie together, prank the school\nWebsite, whatever",
      "author": "mmilthomasn",
      "created": 1587078294,
      "upvotes": 2,
      "replies": {}
    },
    "fnnba0u": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnba0u/",
      "text": "senior skip day is a yearly tradition so if anything they’re keeping it going despite the pandemic. respectable.",
      "author": "spoonVEVO",
      "created": 1587088483,
      "upvotes": 2,
      "replies": {}
    },
    "fnpau7r": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnpau7r/",
      "text": "In my opinion, they should do \"skip day\" as a joyful observation of a time-honored tradition of senior hijinks, not as a protest.  It would a very welcome nod to normalcy at a time when so much is not normal.  It is sad to see it become a statement of anger; that makes it just one more thing you can throw on top of the pile of stuff that COVID-19 has altered/ruined.",
      "author": "FeatofClay",
      "created": 1587142261,
      "upvotes": 2,
      "replies": {}
    },
    "fnlycpb": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlycpb/",
      "text": "Ultimately every high school senior is dealing with the same issue. There’s nothing we can do about it. It frustrates me that there are people out in the world trying to pin blame or force other people to fix something unfixable. I’m glad that you really value protecting your mom and other vulnerable communities. We need more people like that.",
      "author": "itsrainingbees",
      "created": 1587061879,
      "upvotes": 3,
      "replies": {}
    },
    "fnm51o4": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm51o4/",
      "text": "Grad should be postponed!!! Thats just my opinion though!",
      "author": "zeph-yr",
      "created": 1587065217,
      "upvotes": 3,
      "replies": {}
    },
    "fnlytxy": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlytxy/",
      "text": "Your classmates sound like selfish morons. Good for you for not going along with their idiocy.",
      "author": "AfterOccasion",
      "created": 1587062121,
      "upvotes": 5,
      "replies": {}
    },
    "fnmabqo": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmabqo/",
      "text": "I agree that social distancing is important and there is no possibility of having an in person graduation nor prom by the end of June. But the superintendent, principal, or whoever was part of making the final decision should have included the student leaders. Listening to there views and finding alternatives (like a celebration at the end of summer) is an important part of coping with this unprecedented pandemic. \n\nIn my opinion, having one “skip day” is one appropriate method of voicing dissatisfaction with how the decision was made.",
      "author": "ScamsJunk",
      "created": 1587067850,
      "upvotes": 2,
      "replies": {}
    },
    "fnlw7tf": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnlw7tf/",
      "text": "most people are dumb, narrowminded, and irresponsible. its just something you have to accept",
      "author": "DerivativeOfProgWeeb",
      "created": 1587060810,
      "upvotes": 2,
      "replies": {}
    },
    "fnmekca": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmekca/",
      "text": "everything you're saying is absolute facts, Im sad about graduation but we can't do anything about it, you've taken a very mature response that I think your classmates need to understand as well",
      "author": null,
      "created": 1587070014,
      "upvotes": 1,
      "replies": {}
    },
    "fnmosux": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmosux/",
      "text": "You need to share this with your school.  I'm sure you're not the only one who feels this way.",
      "author": "doublesailorsandcola",
      "created": 1587075326,
      "upvotes": 1,
      "replies": {}
    },
    "fnmrag5": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmrag5/",
      "text": "I don’t get why they don’t just let us “graduate” at this point and mail us the diplomas.",
      "author": "the_sky_god15",
      "created": 1587076655,
      "upvotes": 1,
      "replies": {}
    },
    "fnmt1j8": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmt1j8/",
      "text": "i thought this was going in a v diff direction",
      "author": null,
      "created": 1587077609,
      "upvotes": 1,
      "replies": {}
    },
    "fnmxxhh": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmxxhh/",
      "text": "Just wait till you grow up and realize none of this matters!",
      "author": "RudeGarage",
      "created": 1587080331,
      "upvotes": 1,
      "replies": {}
    },
    "fnn0s52": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn0s52/",
      "text": "Is this the tidepod class?",
      "author": "Omniisabii",
      "created": 1587081992,
      "upvotes": 1,
      "replies": {}
    },
    "fnn1dps": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn1dps/",
      "text": "take this with a dose of i respect your passion. it sucks. but in the grand scheme walking through graduation is overrated. its an hours long ceremony that you don't really talk/sit next to friends. your family don't see you outside the 30-60 seconds it takes for you to be announced and walk to get a holding place diploma. \n\nthe fun is having a family event, possible friends event, and after party. \n\ni honestly didn't want to walk for college which is much more monumental. it was much more special celebrating with friends and family. \n\nhigh school means a lot to you. but in the end outside save by the bell type these are your best moments, its just a period you were a kid with no responsibilities. that's about it.",
      "author": "monkeyman80",
      "created": 1587082350,
      "upvotes": 1,
      "replies": {}
    },
    "fnn2sfw": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn2sfw/",
      "text": "I thought this was going to be a post about how angry op is at their schools administration and I was going to point out how essential it is to cancel large events like this, I was pleasantly surprised. Good job op.",
      "author": "JosiahSpears",
      "created": 1587083192,
      "upvotes": 1,
      "replies": {}
    },
    "fnn3ll3": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn3ll3/",
      "text": "Stop complaining and just skip the classes lol",
      "author": "brendanelite",
      "created": 1587083679,
      "upvotes": 1,
      "replies": {}
    },
    "fnn4amp": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn4amp/",
      "text": "Welcome to adulthood, Class of 2020! It blows and you get a crash course jn Making Responsible Sacrifices That Suck.",
      "author": "benevenstancian0",
      "created": 1587084099,
      "upvotes": 1,
      "replies": {}
    },
    "fnn6pyo": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn6pyo/",
      "text": "who cares lol the school admin isn't gonna change it's decision let people seethe if they want to",
      "author": null,
      "created": 1587085608,
      "upvotes": 1,
      "replies": {}
    },
    "fnn728d": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnn728d/",
      "text": "Now see kids, this is what we call maturity.",
      "author": "angelmoths",
      "created": 1587085821,
      "upvotes": 1,
      "replies": {}
    },
    "fnndst8": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnndst8/",
      "text": "I think I know what school you’re referring to.\n\nPeople are upset because a large milestone was lost rather quickly, no alternative options were discussed, and the students were not looped into the conversation.\n\nI don’t think it is much of a good idea to have such a large gathering of students at this time either, but the response was very hasty. Especially when you look at the followup email—there were missteps. The next few weeks are unknown let alone the next few months.\n\nHowever, the students also need to stop being divided over this. Some solidarity would be nice right now, and adding more fire to the flames on both sides is a poor idea. Let’s empathize with each other.",
      "author": "jrf1234",
      "created": 1587090070,
      "upvotes": 1,
      "replies": {
        "fnnmpti": {
          "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnmpti/",
          "text": "Lol I think I know who you are",
          "author": "TyrantKoala",
          "created": 1587096055,
          "upvotes": 1,
          "replies": {
            "fnnmx5d": {
              "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnmx5d/",
              "text": "Hah take a look at my profile and it won’t take ya long to confirm it",
              "author": "jrf1234",
              "created": 1587096200,
              "upvotes": 1,
              "replies": {
                "fnnnj1n": {
                  "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnnj1n/",
                  "text": "Yep 100% sup JF",
                  "author": "TyrantKoala",
                  "created": 1587096641,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fnnf4so": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnf4so/",
      "text": "p sure i know exactly what school you’re talking abt, u dropped this king 👑",
      "author": "thiccgingie",
      "created": 1587090928,
      "upvotes": 1,
      "replies": {}
    },
    "fnngdjr": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnngdjr/",
      "text": "summa cum lmao",
      "author": "cringbro",
      "created": 1587091749,
      "upvotes": 1,
      "replies": {}
    },
    "fnnh0cd": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnh0cd/",
      "text": "they’re just venting, after all they cant do anything to the virus",
      "author": "Mithyi",
      "created": 1587092168,
      "upvotes": 1,
      "replies": {}
    },
    "fnnj7l0": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnj7l0/",
      "text": "I dont think I'm ever going to feel I've graduated. Without the ceremony or any of that, I'm afraid it'll feel like I'm suspended in time from when school was first shut down, maybe forever.",
      "author": "sm0ldering_heart",
      "created": 1587093630,
      "upvotes": 1,
      "replies": {}
    },
    "fnnppb5": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnppb5/",
      "text": "Okay, I think what these people are saying, because my peers are saying the same thing, is that they don't want a cancelled graduation, they want a postponed one. I think a lotta schools are gonna try to have a grad ceremony in the summer (maybe not everyone can attend but still). \n\nTo me, I don't know why a bunch of 17 year olds think that risking the health of your town is okay just for a ceremony or a dance. I know its not great to compare your situation to others, but even as a high school senior I'm tired of these seniors bitching about missing senior activities while other seniors families may not even have jobs, or some of their moms and dads are working a dangerous job in hospitals. I know it sucks, but its kind of insulting to those who are actually suffering.",
      "author": "apparently_whatever",
      "created": 1587098236,
      "upvotes": 1,
      "replies": {}
    },
    "fnnqpeh": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnqpeh/",
      "text": "Senior skip day to boycott the administration’a decision is wrong.  But senior skip day in itself I feel is the same as prom, graduation, etc...   it’s part of the high school experience and a reward for making it through high school. If you can still pull it off from quarantine then that’s bad ass and go for it.",
      "author": "Sisselpud32",
      "created": 1587098997,
      "upvotes": 1,
      "replies": {}
    },
    "fnntw1e": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnntw1e/",
      "text": "I am sorry things worked out this way for you, and I commiserate. Your approach to this matter is very mature. Good on you.",
      "author": "matthewa313",
      "created": 1587101585,
      "upvotes": 1,
      "replies": {}
    },
    "fnnx4m6": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnx4m6/",
      "text": "im a little confused, skip DAY? or boycotting classes?",
      "author": "ScreamingC0lors",
      "created": 1587104478,
      "upvotes": 1,
      "replies": {}
    },
    "fnnyfha": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnnyfha/",
      "text": "Hah sucks to suck",
      "author": "cerebral-thunders",
      "created": 1587105699,
      "upvotes": 1,
      "replies": {}
    },
    "fnor4tt": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnor4tt/",
      "text": "Thats an extremely whiney way to be. \n\n\nTrust me y'all, after college, prom and graduation are not super memorable experiences. They just feel important right now.",
      "author": "shitsfuckedupalot",
      "created": 1587131923,
      "upvotes": 1,
      "replies": {}
    },
    "fnmlbpp": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnmlbpp/",
      "text": "[removed]",
      "author": null,
      "created": 1587073502,
      "upvotes": 1,
      "replies": {}
    },
    "fnm93wn": {
      "link": "/r/ApplyingToCollege/comments/g2hzat/my_high_school_class_is_boycotting_online_classes/fnm93wn/",
      "text": "you guys bow down so easily to authority i swear. what’s wrong with a little discourse?\n\nyou can always postpone. they outright cancelled which is lazy and a copout. \n\nalso why are we patting ourselves on the back for staying indoors? it’s not heroic.",
      "author": "LilAtex",
      "created": 1587067233,
      "upvotes": -1,
      "replies": {}
    }
  }
}