{
  "sid": "q9iyhg",
  "link": "/r/ApplyingToCollege/comments/q9iyhg/how_in_detail_should_i_go_with_some_of_my_hobbies/",
  "title:": "How in detail should I go with some of my hobbies (NFTs, online business, etc.) on the activities section of my common app?",
  "text": "So I was reading some articles and some threads on this sub about how to fill out the activities section of the common app. Many of them emphasize that you should \"focus on quantifiable and significant impact.\" So I understand how to do this for my school activities, clubs, volunteering, etc. but I'm not sure how to do this for my for-profit hobbies like NFTs and my online business that take up a lot of hours of my time and are a pretty big part of my life. I recently made a lot of money from NFT flipping and it's definitely an impressive number but I'm worried that if I put it on my common app it might lower the amount of financial aid i get or something? I really have no idea and any advice would be appreciated. I really want to include these things because they are such a big part of my life but I also don't want to decrease the amount of financial aid that I may get.",
  "author": "Headline123",
  "created": 1634413036,
  "updated": 1634575627,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hgwpkz2": {
      "link": "/r/ApplyingToCollege/comments/q9iyhg/how_in_detail_should_i_go_with_some_of_my_hobbies/hgwpkz2/",
      "text": "Be as specific as you can within the character limit. \n\n>I recently made a lot of money from NFT flipping and it's definitely an impressive number but I'm worried that if I put it on my common app it might lower the amount of financial aid i get or something?\n\nYour ECs will not be factored whatsoever into your financial aid package. That decision is made solely based on the financial information you provide to the school (your FAFSA). Include the amount of money you made.",
      "author": "FuriousGeorge1435",
      "created": 1634420110,
      "upvotes": 1,
      "replies": {
        "hh0h4n5": {
          "link": "/r/ApplyingToCollege/comments/q9iyhg/how_in_detail_should_i_go_with_some_of_my_hobbies/hh0h4n5/",
          "text": "thanks",
          "author": "Headline123",
          "created": 1634494896,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}