{
  "sid": "qeh3mo",
  "link": "/r/ApplyingToCollege/comments/qeh3mo/emailing_admissions_officer_to_express_that/",
  "title:": "Emailing admissions officer to express that financial aid is preventing me from ED'ing",
  "text": "I'd really like to ED to Rice, but I am worried that the financial aid provided will not be enough. \n\nI came across this from [this article](https://admissions.tufts.edu/blogs/inside-admissions/post/dollar-dollar-bills-financial-aid-and-early-decision/) from Tufts, which states that if the net price calculator results are too high, to express that through your essays or to your admission officer if that's the only thing barring you from applying ED : \n\n**\"Make a point of mentioning in your “Why Tufts?” or an email to your admissions officer that Tufts is your first choice but concerns over funding made you hesitate on ED.\"**\n\nHow would I go about writing the email to Rice, since it's just a simple expression of interest and can be done by everyone without proof that the certain school is their top choice? I don't want to annoy the admissions officer or paint myself in a negative light.",
  "author": "dwaynejohnson28",
  "created": 1635035125,
  "updated": 1635182934,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhuhm5g": {
      "link": "/r/ApplyingToCollege/comments/qeh3mo/emailing_admissions_officer_to_express_that/hhuhm5g/",
      "text": "Apply ED. If fin aid is bad or too low for you, then you can either contest the aid or decline the offer entirely. Perfectly normal and acceptable reason to get out of binding ED.",
      "author": "U_of_SOL",
      "created": 1635071013,
      "upvotes": 2,
      "replies": {}
    },
    "hht0hvu": {
      "link": "/r/ApplyingToCollege/comments/qeh3mo/emailing_admissions_officer_to_express_that/hht0hvu/",
      "text": "Hard to guess. If the Net Price Calculator's estimate does not give you a price that is in the ballpark of affordable, ultimately you are unlikely to be given enough aid to attend even if you are admitted. Assuming this is in Regular Decision, that seems possibly unhelpful.",
      "author": "elkrange",
      "created": 1635036365,
      "upvotes": 1,
      "replies": {}
    },
    "hhtrzh2": {
      "link": "/r/ApplyingToCollege/comments/qeh3mo/emailing_admissions_officer_to_express_that/hhtrzh2/",
      "text": "Hm the only thing I can think of that writing a letter could help would be them calculating your exact financial contribution before you even apply. Getting more financial aid seems unlikely. I’d email a couple sentences about how much you love Rice, then explain that you would absolutely ED if it weren’t for the fact you’re uncertain about the cost, and then ask if there’s anything they can do. I wouldn’t overcomplicate it.\n\nAlso, doesn’t Rice have the Rice Investment? You’re guaranteed half tuition if income is below $200k, full tuition if it’s below $130k, and don’t have to pay anything if it’s below $65k.",
      "author": "Anacrisis",
      "created": 1635050633,
      "upvotes": 1,
      "replies": {}
    },
    "hht082u": {
      "link": "/r/ApplyingToCollege/comments/qeh3mo/emailing_admissions_officer_to_express_that/hht082u/",
      "text": "Well that is a big reason not to apply ED. If financial aid is a big factor in ypur decision why would you want to potentially lock yourself in a situation you cannot afford.",
      "author": "AuthenticPhantom",
      "created": 1635036240,
      "upvotes": 0,
      "replies": {
        "hhu6txs": {
          "link": "/r/ApplyingToCollege/comments/qeh3mo/emailing_admissions_officer_to_express_that/hhu6txs/",
          "text": "Financial aid less than provided by the NPC is a valid reason to reject an ED admission.",
          "author": "RichInPitt",
          "created": 1635061748,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}