{
  "sid": "qf2yfo",
  "link": "/r/ApplyingToCollege/comments/qf2yfo/chances_of_a_low_gpa_getting_into_a_good_school/",
  "title:": "Chances of a Low GPA getting into a good school?",
  "text": "Hello all, I'm an international senior who is applying to the US this year for a pre med program. I really slacked off during my first 2 years of high school, since, until then, I was planning on going to college in the country I live in, but, as fate would have it,  I got the opportunity to go study in the US. I have a 2.98 UW GPA, but I take part in the IB program at my school with my higher level subjects being English, Chem and Bio. Would my IB background help counter weight my poor GPA in the grand-scheme of things in the admission process?",
  "author": "Psychological-Bid733",
  "created": 1635114965,
  "updated": 1635182397,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhx5k47": {
      "link": "/r/ApplyingToCollege/comments/qf2yfo/chances_of_a_low_gpa_getting_into_a_good_school/hhx5k47/",
      "text": "Stay in your country. The US is not everything. Maybe you can come back for MAsters?",
      "author": "Wooden-Row7524",
      "created": 1635116256,
      "upvotes": 2,
      "replies": {
        "hhx8juh": {
          "link": "/r/ApplyingToCollege/comments/qf2yfo/chances_of_a_low_gpa_getting_into_a_good_school/hhx8juh/",
          "text": "The problem is that I want to pursue a medical career, and the country I live in right now doesn't have a very bright future in such area.",
          "author": "Psychological-Bid733",
          "created": 1635117707,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhxoyb8": {
      "link": "/r/ApplyingToCollege/comments/qf2yfo/chances_of_a_low_gpa_getting_into_a_good_school/hhxoyb8/",
      "text": "You’re a sophomore? Give it everything you’ve got junior year, and do a ton of ec’s u are passionate abou bro. I know u can do it",
      "author": "Asleep_Course_7162",
      "created": 1635125990,
      "upvotes": 2,
      "replies": {
        "hhzj1qq": {
          "link": "/r/ApplyingToCollege/comments/qf2yfo/chances_of_a_low_gpa_getting_into_a_good_school/hhzj1qq/",
          "text": "I'm a senior, but I already have tons of extra curricular that I really enjoy, but I'm afraid that the admissions office will not have a chance to look at them because of my low grades.",
          "author": "Psychological-Bid733",
          "created": 1635170743,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhxtiq1": {
      "link": "/r/ApplyingToCollege/comments/qf2yfo/chances_of_a_low_gpa_getting_into_a_good_school/hhxtiq1/",
      "text": "Do you need aid?  What are your test scores?  You don’t “need” a super competitive school to get into med school in the states. Med school admissions are t as prestige driven as other professional schools. \n\nWhat you need:  a high undergrad GPA in the pre-med core, a good MCAT, and solid related ECs/shadowing experience/interviewing skills.",
      "author": "ChampionshipPerfect5",
      "created": 1635128326,
      "upvotes": 1,
      "replies": {
        "hhziws4": {
          "link": "/r/ApplyingToCollege/comments/qf2yfo/chances_of_a_low_gpa_getting_into_a_good_school/hhziws4/",
          "text": "I do need aid, since the exchange rate from the currency in my country to the American dollar is stupidly high right now. I did the October SAT and got a 1120 on it, I will be taking the December one as well, as I will be more prepared.",
          "author": "Psychological-Bid733",
          "created": 1635170680,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}