{
  "sid": "qyzzpr",
  "link": "/r/ApplyingToCollege/comments/qyzzpr/ut_applications/",
  "title:": "UT Applications",
  "text": "Texas applications. Tell me stuff about it. How is it, should I apply to Texas as an international(US Citizen), Texan colleges other things. Just put your thoughts!",
  "author": "Upper_Cranberry339",
  "created": 1637516226,
  "updated": 1637687886,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hlj8ag8": {
      "link": "/r/ApplyingToCollege/comments/qyzzpr/ut_applications/hlj8ag8/",
      "text": "UT Austin has an 8 percent acceptance rate for non-Texas residents.\n\nKeep that in mind when applying, if you do decide to apply. Don't be misled by its overall acceptance rate of 31%; that acceptance rate factors in Texas residents who graduate in the top 6% of their class, receiving guaranteed admission.\n\nAlso, you asked about Texan other colleges. Not sure what your financial situation is, but **UT Dallas** is a pretty good school for CS; it's underrated in my opinion.\n\n**Rice** is an Ivy-equivalent school in Texas. Very selective, wonderful school.\n\n**Baylor, TCU, SMU** are notable private universities in Texas.\n\n**Texas A&M** is the 2nd-most-well-known university in Texas,\n\n**U of Houston, Texas Tech, UTSA, Texas State** are non-flagship public universities in Texas.",
      "author": "toyota2003",
      "created": 1637516872,
      "upvotes": 3,
      "replies": {
        "hlj8ntp": {
          "link": "/r/ApplyingToCollege/comments/qyzzpr/ut_applications/hlj8ntp/",
          "text": "My financial situation is around 50- 55k per year\nAfter taxes\n\nShould I apply to private texan unis instead then?\nFor more fin aid?",
          "author": "Upper_Cranberry339",
          "created": 1637517023,
          "upvotes": 3,
          "replies": {
            "hlj9cge": {
              "link": "/r/ApplyingToCollege/comments/qyzzpr/ut_applications/hlj9cge/",
              "text": ">My financial situation is around 50- 55k per year After taxes\n\nSo you mean that your family makes 50-55k a year?\n\nIf you're not a citizen of any state, and your family income is $50k a year, then you should definitely be focusing your college applications on **private liberal arts colleges and private universities.**\n\nYou might see \"public\" and think \"cheap.\" But most public universities are way more expensive to attend as a non-resident of that state. UC schools, for example, cost $62k to $67k to attend as a non-California resident. And most of them do not provide need-based financial aid to non-residents of their respective states either.\n\nI'd really broaden your search to the rest of the United States as well; Texas only has so many universities.\n\nBest of luck.",
              "author": "toyota2003",
              "created": 1637517300,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hlj702j": {
      "link": "/r/ApplyingToCollege/comments/qyzzpr/ut_applications/hlj702j/",
      "text": "You will not get any need-based aid from UT because you are not a Texas resident. PSA, *public* universities tend to offer little to no need-based financial aid to out-of-state students and charge them more.\n\nRun the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based financial aid estimate before you apply.\n\n(While you live abroad and are therefore out of state for public universities, private universities do not distinguish between in-state and out-of-state for admission or for need-based financial aid. As a US citizen, you would be a domestic applicant, not an international.)",
      "author": "elkrange",
      "created": 1637516340,
      "upvotes": 2,
      "replies": {}
    },
    "hlj8qeh": {
      "link": "/r/ApplyingToCollege/comments/qyzzpr/ut_applications/hlj8qeh/",
      "text": "Also should I change most of my public schools to private?",
      "author": "Upper_Cranberry339",
      "created": 1637517051,
      "upvotes": 1,
      "replies": {}
    }
  }
}