{
  "sid": "q78ku1",
  "link": "/r/ApplyingToCollege/comments/q78ku1/can_someone_help_me_please_im_crying_because_my/",
  "title:": "Can someone help me please? Im crying because my school wont help me unless i pay 600 USD",
  "text": " \n\nHello, I'm an international student who is trying to apply as an early decision right now. My school just told me that i need pay them 600USD just for a reccomendation letter. The counselor doesnt even help with my main essay and supplement essays.\n\nI'm at a loss at what i should do. 600 USD is too much for me to afford right now but i'm too inexperienced to write my own counselor reccomendation and i have an exam in a week that lasts for the whole month so i literally dont have the time to invest in this. Its not a joke when i say that i'm crying as i'm writing this post. I cannot burden my parents with the amount because i know they're struggling.",
  "author": "YoujinEugene",
  "created": 1634122400,
  "updated": 1634167070,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hggxek8": {
      "link": "/r/ApplyingToCollege/comments/q78ku1/can_someone_help_me_please_im_crying_because_my/hggxek8/",
      "text": "Hate to say it, but you may need to resign yourself to attending university in your home country.",
      "author": "jayphoward",
      "created": 1634123742,
      "upvotes": 9,
      "replies": {
        "hggyrot": {
          "link": "/r/ApplyingToCollege/comments/q78ku1/can_someone_help_me_please_im_crying_because_my/hggyrot/",
          "text": "Could you help my dilemma then? So i can apply to BYU. I have a fair shot there with my grades plus even if they wont give me a scholarship i can pay the tuition. Should i just bet everything there instead? I dont need to pay the 600USD to my school for that.  \nBut my problem is should i be betting everything there though?  if i dont pay my school 600 USD then tbh i cant even apply to any university cuz they're blocking my application process.And what if i just apply to BYU and not get in. I would have lost a year worth of opportunity",
          "author": "YoujinEugene",
          "created": 1634124690,
          "upvotes": -1,
          "replies": {
            "hggzkvs": {
              "link": "/r/ApplyingToCollege/comments/q78ku1/can_someone_help_me_please_im_crying_because_my/hggzkvs/",
              "text": "Why not apply to BYU plus some other places that don’t require a counselor LoR plus some schools in your home country? Though, it sounds like if you can’t afford $600 then you will probably need full need met for tuition, etc.  The set of schools willing to give that much financial aid to internationals is fairly small.",
              "author": "jayphoward",
              "created": 1634125233,
              "upvotes": 5,
              "replies": {}
            },
            "hgihqvx": {
              "link": "/r/ApplyingToCollege/comments/q78ku1/can_someone_help_me_please_im_crying_because_my/hgihqvx/",
              "text": "You can pay full tuition but not $600?",
              "author": "Valthr4x_",
              "created": 1634149223,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}