{
  "sid": "qcsqfz",
  "link": "/r/ApplyingToCollege/comments/qcsqfz/should_i_include_internship_if_i_dont_have_any/",
  "title:": "should i include internship if i don’t have any experience?",
  "text": "applying as a music business major. i’ve TECHNICALLY been a intern at Interscope Records since 2018 but I literally have NO experience due to me living far from cali. I still feel like it would be a valuable stat to but on my application but i’m not sure.",
  "author": "skiesinvirgo",
  "created": 1634825578,
  "updated": 1634848688,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhhup4f": {
      "link": "/r/ApplyingToCollege/comments/qcsqfz/should_i_include_internship_if_i_dont_have_any/hhhup4f/",
      "text": "What did you do as an intern?",
      "author": "pupuphlatter",
      "created": 1634827206,
      "upvotes": 1,
      "replies": {
        "hhhvl1f": {
          "link": "/r/ApplyingToCollege/comments/qcsqfz/should_i_include_internship_if_i_dont_have_any/hhhvl1f/",
          "text": "supposed to be a a&r/ marketing intern. kid you not i’ve done NOTHING due to covid/distance. but the position is still open for me and i figured that acing the interview enough would be a notable feat.",
          "author": "skiesinvirgo",
          "created": 1634827585,
          "upvotes": 1,
          "replies": {
            "hhhwblo": {
              "link": "/r/ApplyingToCollege/comments/qcsqfz/should_i_include_internship_if_i_dont_have_any/hhhwblo/",
              "text": "Here’s the thing. You *could* put it in as it’s sort of true. But if you get called out during an Admissions interview, you may have an issue explaining the addition. Up to you. If you have a good number of ECs I would consider leaving it out. An alternative is to contact the internship and ask about the role and its responsibilities should you continue this fall/winter/spring. You say it’s still open. Did it have to be an on-site gig or something?… Is that why you had no interaction at all? If you started up would you actually be doing work or just sit in a holding period again (if that’s what’s been happening so far)?",
              "author": "pupuphlatter",
              "created": 1634827897,
              "upvotes": 1,
              "replies": {
                "hhicn9o": {
                  "link": "/r/ApplyingToCollege/comments/qcsqfz/should_i_include_internship_if_i_dont_have_any/hhicn9o/",
                  "text": "I got the position via connections. Yeah, it’s a on site thing and most of the tasks I had to do were in person.  Plus, I don’t have any other music business related ec’s; so i thought it would be a good addition.",
                  "author": "skiesinvirgo",
                  "created": 1634834604,
                  "upvotes": 1,
                  "replies": {
                    "hhidja0": {
                      "link": "/r/ApplyingToCollege/comments/qcsqfz/should_i_include_internship_if_i_dont_have_any/hhidja0/",
                      "text": "Well, you could add it, then try to fit in the details of what it would’ve entailed, and then add something like “[COVID postponement]” to the end?\n\nJust know that ECs don’t always have to be linked with what you are planning to study. Admissions like to see “wide” kids. They’ve realized that focusing on narrow specialized kids wasn’t actually a good thing and probably cultivated the wrong kind of student overall (let alone hamstringing kids from having a broader perspective and experience). They want to know more about you outside of school or the field. Anything and everything else helps.",
                      "author": "pupuphlatter",
                      "created": 1634834950,
                      "upvotes": 2,
                      "replies": {
                        "hhidwi0": {
                          "link": "/r/ApplyingToCollege/comments/qcsqfz/should_i_include_internship_if_i_dont_have_any/hhidwi0/",
                          "text": "ok! thank you!",
                          "author": "skiesinvirgo",
                          "created": 1634835094,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}