{
  "sid": "rhzi0h",
  "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/",
  "title:": "Enrollment Cancellation",
  "text": "I've got into my ED college, and I accepted the enrollment offer because I thought I didn't have the option to decline it. It is a mid-range college, and now I believe I should have taken the risk and applied for a better school. \n\nCan I contact the admission officer to cancel the enrollment? Is it even possible? Or would it be against me?\n\nPS: I'm an international student and Ididn't apply for aid.",
  "author": "OlaSaber",
  "created": 1639686745,
  "updated": 1639786098,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hotr6zr": {
      "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotr6zr/",
      "text": "You are correct in that declining wasn’t an option. If aid is not an issue, you can’t back out of ED agreements.",
      "author": "rainingsiberiancats",
      "created": 1639686899,
      "upvotes": 14,
      "replies": {
        "hott3r1": {
          "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hott3r1/",
          "text": "Yes, you can. I see students back out of ED every year, not always because of financial reasons. There is no legal recourse if a student ends up not attending.   \n\n\nAnd while colleges claim that if you decine, the idea that the school might \"tell on you\".... is a bit of a urban legend. The schools ultimately want you to attend the school you'll be happy and successful at. AO's would not want you to automatically be SOL if you decided not to attend their own school.",
          "author": "MapleLeif_",
          "created": 1639687644,
          "upvotes": 0,
          "replies": {
            "hottxkf": {
              "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hottxkf/",
              "text": "In theory, of course you *can.* The college won’t legally sue you. Whether a college tells on you or not is something none of us can say for sure, unless you’re a verified AO (and as you’re not, excuse me for not trusting an internet stranger claiming to have inside admissions knowledge). And even then, there’s no guarantee all colleges have the same policy on that. At the least, OP withdrawing from the ED contract without the consent of the college can screw over future applicants from OP’s high school to that college, if not OP themselves. If an applicant strategizes ED and is disappointed when they get in, that’s an issue that they’re responsible for.",
              "author": "rainingsiberiancats",
              "created": 1639687966,
              "upvotes": 5,
              "replies": {
                "hotwco3": {
                  "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotwco3/",
                  "text": "They don't have to trust me (I don't put my real name on here for privacy reasons but anyone can DM me to ask for my credentials).   \n\n\nIf validity is of concern.... there are plenty of former AOs who now work in admissions consulting the OP can ask: \"Can I have minutes of your time to help me figure this out?\"",
                  "author": "MapleLeif_",
                  "created": 1639688905,
                  "upvotes": 2,
                  "replies": {
                    "hotypno": {
                      "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotypno/",
                      "text": "You can verify your identity to the mods of this sub if you’re an actual AO—there are a few actual AOs on this sub (some reveal what college, many don’t), and they have the verification below their username. Not sure where you went to high school, but consultants who were former AOs (particularly recently, not like 10 years ago) aren’t common everywhere, particularly for international students. And from what I’ve seen, consultants charge a high premium for any “inside” (to varying extents) knowledge they have, although some will perhaps be more generous if OP can find them. If you personally know such people, OP would probably appreciate receiving that info through PM.",
                      "author": "rainingsiberiancats",
                      "created": 1639689820,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hotruar": {
          "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotruar/",
          "text": "But why there were two options in the portal to either accept or decline it?",
          "author": "OlaSaber",
          "created": 1639687150,
          "upvotes": 1,
          "replies": {
            "hotsel0": {
              "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotsel0/",
              "text": "Those who have financial aid troubles can legitimately back out of the ED agreement after attempting to negotiate with the college if that doesn’t work out. I assume that group of people can choose to decline.",
              "author": "rainingsiberiancats",
              "created": 1639687369,
              "upvotes": 3,
              "replies": {}
            },
            "hotsqzj": {
              "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotsqzj/",
              "text": "Because some students apply ED then realize they can't attend for whatever reason. It happens. The point of ED isn't to lock you into attending, but rather to assess for students who especially hope to attend the school who are qualified --- and to help determine yield and other metrics related to enrollment.",
              "author": "MapleLeif_",
              "created": 1639687503,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hotr2gt": {
      "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotr2gt/",
      "text": "You cannot decline, unless maybe you want to go to school outside the US instead.",
      "author": "mommacat94",
      "created": 1639686849,
      "upvotes": 8,
      "replies": {}
    },
    "hotwet8": {
      "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotwet8/",
      "text": "Maybe you can back out with few repercussions, but I don’t know if I would. There’s no guarantee you’ll get into a better school, especially as an international applicant applying RD. \n\nThe question’s not really if you can, it’s if you *should*.",
      "author": "Lil-pants",
      "created": 1639688928,
      "upvotes": 2,
      "replies": {}
    },
    "hotsb2t": {
      "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotsb2t/",
      "text": "ED is not legally binding. That is a huge myth. I have been working in admissions for seven years and I've seen quite a few people decline ED for a number of reasons.   \n\n\nEvery year, almost all colleges have a handleful of ED students who end up withdrawing.   \n\n\nBefore cancelling your enrollment, think about your options. Do you not want to attend the school? Is it not financially reasonable? Can you afford to take the risks to apply to other schools so late in the game (i.e: do you have the time to write more supplements)? Do you see yourself happier somewhere else?",
      "author": "MapleLeif_",
      "created": 1639687331,
      "upvotes": 2,
      "replies": {
        "hott8z8": {
          "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hott8z8/",
          "text": "Yeah, but I don't have an adequate reason to tell the college, because I have a sponsor who will cover the full cost. So, I cannot talk about any financial reason.",
          "author": "OlaSaber",
          "created": 1639687701,
          "upvotes": 1,
          "replies": {
            "hotwr23": {
              "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotwr23/",
              "text": "Have you visited the campus yet?   \n\n\nI know a handful of students who ended up (this year and last year) declining their ED acceptance because they were unable to visit the campus, and thus when they did, they did not feel \"at home\".  That is one very valid option. Additionally, even if you did visit, you may have recently changed your mind about something big, like your major, what part of the country you want to live in (especially if you have family here), etc.",
              "author": "MapleLeif_",
              "created": 1639689063,
              "upvotes": 1,
              "replies": {}
            },
            "hovdsuu": {
              "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hovdsuu/",
              "text": "who is this sponsor? you can not tell the college about them",
              "author": "blueballer20",
              "created": 1639712139,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hotua7h": {
          "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotua7h/",
          "text": "I have known cases where ED admit info was shared with other colleges so it can harm you (maybe not legally) but other admissions were declined and the student lost out in ED school.",
          "author": "jake2160",
          "created": 1639688102,
          "upvotes": 1,
          "replies": {
            "hotvbig": {
              "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotvbig/",
              "text": "That is strange.   \n\n\nIf the ED school shared that information regarding a student with another school without the student's express consent (which would likely violate FERPA if the student didn't consent), how did all the students you're talking to find out that their decision not to attend their ED school impacted all the other schools?   \n\n\nhttps://www2.ed.gov/policy/gen/guid/fpco/ferpa/index.html",
              "author": "MapleLeif_",
              "created": 1639688503,
              "upvotes": -1,
              "replies": {
                "hotvh4m": {
                  "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotvh4m/",
                  "text": "It seems highly highly unlikely that say, Stanford would be like \"Oh, sorry Jake, you didn't get in because you declined your offer to Dartmouth.\"",
                  "author": "MapleLeif_",
                  "created": 1639688564,
                  "upvotes": -2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hotr42n": {
      "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotr42n/",
      "text": "ED is legally binding. Unless you can prove your family can’t afford it, you are required to accept and attend.",
      "author": "Beneficial_Paint7225",
      "created": 1639686867,
      "upvotes": 0,
      "replies": {
        "hotsiqy": {
          "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotsiqy/",
          "text": "There is no legal recourse when a student declines an ED position. That is false. I would be shocked if you could find a single case study from any school's legal department taking action against another student.",
          "author": "MapleLeif_",
          "created": 1639687414,
          "upvotes": 6,
          "replies": {}
        },
        "hotxu4g": {
          "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hotxu4g/",
          "text": "No admissions police will show up at your home or school with handcuffs. \n\nYou can decline but all AO’s have a network and you will be on an informal blacklist at highly selective schools. ED works because students, parents and guidance counselors value the ED selection process. \n\nCircumstances can change, especially with 18 year old kids, so decide carefully but without fear.",
          "author": "SunnyDay27",
          "created": 1639689484,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hou35lh": {
      "link": "/r/ApplyingToCollege/comments/rhzi0h/enrollment_cancellation/hou35lh/",
      "text": "You signed a binding agreement that you would attend if accepted.\n\nYes, it will certainly be held against you if you reneg on an agreement you voluntarily signed.",
      "author": "RichInPitt",
      "created": 1639691576,
      "upvotes": 1,
      "replies": {}
    }
  }
}