{
  "sid": "qj034r",
  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/",
  "title:": "This subreddit was one of the worst things to ever happen to me this app season.",
  "text": "Let me start off by saying that I absolutely believe in the goal of having a free and active space to ask questions about the admissions process. Many students don't have access to college advisors or have terrible school counselors or limited time to do deep research into different schools or all of the above, and this subreddit can be a great place for that.\n\nBut 99 percent of the time it's not.\n\nThere's a reason that the top posts of this subreddit and r/chanceme are sarcastic and mock its users. I know that everybody knows that there's a lot of self-congratulating and narcissism here, but to many of us those kinds of posts are more than just annoying. I've had panic attacks scrolling through this subreddit, internalizing my future rejections and the failure that I will become after high school. Objectively I know that college is not nearly that important but the people on this subreddit damn well make it feel like that. And I think that that's something inherent to the nature of this kind of platform (the discord is no better), which is terrible because this community has the potential to do so good.\n\nThe only thing I can think of to fix this without nuking the whole place is to place strict limits on what kind of posts and comments you can make to prevent the kind of circle-jerking that's so prevalent here. If you want to vent please feel free to comment your negative experiences with this subreddit and I hope that they can be addressed in the future. This subreddit attracts a particularly vulnerable group of stressed and anxious teenagers and I honestly feel like its doing much more harm than good. Feel free to disagree to if your experiences differ.",
  "author": "SlooBananas",
  "created": 1635595356,
  "updated": 1636167389,
  "over_18": false,
  "upvotes": 752,
  "upvote_ratio": 0.92,
  "comments": {
    "hin4l2o": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin4l2o/",
      "text": "I literally just joined this sub and this is the post I saw in its feed",
      "author": "realangeloann",
      "created": 1635601457,
      "upvotes": 163,
      "replies": {
        "hin6heb": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin6heb/",
          "text": "lmao dw there is a lot of gold on this sub if you search for it",
          "author": "No-Shift-6657",
          "created": 1635602392,
          "upvotes": 99,
          "replies": {
            "hinpg3z": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinpg3z/",
              "text": "Yeah, sort by best all-time reveals a gold mine.",
              "author": "WeGoToMars7",
              "created": 1635610878,
              "upvotes": 36,
              "replies": {}
            }
          }
        },
        "hin85j9": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin85j9/",
          "text": "Sorry! The sub has some mild issues, but as a whole the sub  is reflective of teenagers in high stress, new to reddit app & its functionality, asking for advice or perspective. Anonymity also contributes to the environment. \n\nRead About & Menu\n\nUse search bar (top of mobile screen) & drop down menu\n\n99% of questions have been asked & answered since sub began and are still relevant. Or check colleges website. Or megathreads from previous years admissions cycles.",
          "author": "roguezebra",
          "created": 1635603184,
          "upvotes": 47,
          "replies": {}
        },
        "hio8evw": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio8evw/",
          "text": "oh great",
          "author": "wisesrn",
          "created": 1635618762,
          "upvotes": 3,
          "replies": {}
        },
        "hintp7y": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hintp7y/",
          "text": "Tbh top posts are suer helpful but like 80% of the rest is toxic people seeking validation",
          "author": "disyellowfellow",
          "created": 1635612643,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hin2ohp": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin2ohp/",
      "text": "I’m here for shitpost wednesday",
      "author": "idkjustsomeuser",
      "created": 1635600498,
      "upvotes": 403,
      "replies": {
        "hioiekc": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hioiekc/",
          "text": "Hopefully OP recognizes this sub does not represent most college applicants nor kids at top schools.",
          "author": "ivybrothers",
          "created": 1635623009,
          "upvotes": 44,
          "replies": {
            "hipbh98": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipbh98/",
              "text": "I disagree, I think it does represent most kids at top schools *from a certain demographic*. I go to a public magnet, and I would say that the average person in the magnet program is quite a bit higher achieving than the average person here (and the entire school only sends 20-30 to T20s a year). \n\nPeople keep claiming that top schools are filled with \"smart but not exceptional kids\", but I am simply not seeing it; the vast majority of these people are most likely either hooked in some way or are rich and have connections/went to a top private school.",
              "author": "MasterYiMain1",
              "created": 1635636436,
              "upvotes": 18,
              "replies": {
                "hips6ai": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hips6ai/",
                  "text": "HS Junior moment",
                  "author": "PteradactylCum",
                  "created": 1635644830,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "hin34bq": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin34bq/",
          "text": "😂",
          "author": "Resident_Ad8455",
          "created": 1635600723,
          "upvotes": 26,
          "replies": {}
        },
        "hinc8ur": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinc8ur/",
          "text": "Me 2",
          "author": "BATZ202",
          "created": 1635605120,
          "upvotes": 6,
          "replies": {}
        },
        "hioxy5u": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hioxy5u/",
          "text": "It should be shitpost everyday",
          "author": "kohinoor0607",
          "created": 1635629952,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hin2d9n": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin2d9n/",
      "text": "The only good thing about this sub is u/prsehgal",
      "author": "Verysexy1532",
      "created": 1635600334,
      "upvotes": 154,
      "replies": {
        "hiniknn": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiniknn/",
          "text": "Also other mods/ consultants who gave out a tons of helpful advice for college admission",
          "author": "Feeling_Alternative3",
          "created": 1635607974,
          "upvotes": 50,
          "replies": {}
        },
        "hin55b4": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin55b4/",
          "text": "istg goat",
          "author": "tanisha4150",
          "created": 1635601733,
          "upvotes": 21,
          "replies": {}
        },
        "hinzo04": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinzo04/",
          "text": "y e s",
          "author": "catgirljesse",
          "created": 1635615110,
          "upvotes": 3,
          "replies": {}
        },
        "hipm29p": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipm29p/",
          "text": "this is u/admissionsmom slander",
          "author": "Bryoneehhh_",
          "created": 1635641760,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hin7d0p": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin7d0p/",
      "text": "\"(the discord is no better)\"\n\nOops 👀. I really appreciate the honest take though. Sometimes we're in a community for so long that we miss seeing the obvious aspects.",
      "author": "ImaybeObama",
      "created": 1635602807,
      "upvotes": 37,
      "replies": {
        "hioe3v9": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hioe3v9/",
          "text": "Honestly I think the discord is way better but idk, people with misinformation in there get shot down rq, and there are a much higher percentage of helpful and knowledgeable people than here with all the hsers.",
          "author": "Naytrek",
          "created": 1635621128,
          "upvotes": 13,
          "replies": {}
        },
        "hioow0u": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hioow0u/",
          "text": ">Sometimes we're in a community for so long that we miss seeing the obvious aspects.\n\nQuote of the year\n\nUnrelated but this is me with Kpop",
          "author": "tsmrnt",
          "created": 1635625887,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hinlqiz": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinlqiz/",
      "text": "I've read comments suggesting that A2C be renamed \"Applying to Ivies\" or \"Applying to T-10s\" and they're not bad suggestions.\n\nBut the information provided is helpful to everyone. I just ignore the posts asking about retaking a 1500 SAT and things like that.",
      "author": "Calvin-Snoopy",
      "created": 1635609303,
      "upvotes": 30,
      "replies": {}
    },
    "hinbsj6": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinbsj6/",
      "text": "Parent here.\n\nLet me say that this subreddit is NOT real life. Most of This subreddit are folks looking at T20 which is such a small fraction of the kids in the US. Look at how big state schools are. That’s because that is reality. Don’t let anyone on this subreddit tell u any different.\n\nI’ve been working for a Fortune 500 company for 20 years that is regarded as the leader in our industry. There is not one person I know (from executives to middle management to new hires) that went to a T20. Thousands of employees I’ve interacted with in the 20 years and not 1 that I know of. A majority have gone to a state school. \n\nLots of kids here in this subreddit are those annoying smart kids in class who know they got a 100 on the test but love to pout and say how hard the test was. \n\nKeep your head up and ignore a lot of the noise.",
      "author": "mbrown2626",
      "created": 1635604906,
      "upvotes": 202,
      "replies": {
        "hind8b8": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hind8b8/",
          "text": "I’m not the OP but I needed this .\nThank you so much 💛",
          "author": "RAtararatara",
          "created": 1635605568,
          "upvotes": 43,
          "replies": {}
        },
        "hipbkkw": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipbkkw/",
          "text": "So I've always been curious, when people say they've never met any T20 people at their companies: is this because the company recruits overwhelmingly from a few schools/programs (either due to geographical proximity to offices, the presence of certain specialized programs that are absent at T20 schools, or because an executive went there), or does it actively select against T20 students?\n\nI thought maybe it was a numbers game at first--there's not as many people from T20 schools as there are from state schools--but 0 out of thousands seems really low if chance alone were involved. (Since your company's a leader in the industry and sounds decently big, I assume T20 graduates are applying.) If you meant just Ivy+ schools, as opposed to T20 schools, this would make more sense. But there are massive state schools like UCLA, UC Berkeley, UVA, and UMich Ann Arbor in the T20-T30 rankings, and so, so many more in the T50s.\n\nAnd of the people you've met, how many are from not-so-top state schools with highly competitive nationally renowned programs? For instance, if a company doesn't recruit from T20s, but they recruit overwhelmingly from UIUC CS, that's not really saying much given how competitive and highly ranked that program is.\n\nI really appreciate your input, and I'm not trying to undermine your point, but \"non-T20s\" and even \"state schools\" are such wide nets that they don't mean that much.\n\n>Lots of kids here in this subreddit are those annoying smart kids in class who know they got a 100 on the test but love to pout and say how hard the test was.\n\nQuite frankly, a lot of the kids in this sub don't get into T20s. This sub wasn't a big thing when I was applying to college, but it gives me pretty big College Confidential vibes. Though people did post about getting into Harvard or whatever, those people were often not regulars, and that big \"I got into xyz\" post was the only one they made. On the other hand, the people who posted constantly and were the \"annoying smart kid\" would fall short of those schools and end up going to their local state school more often than not.",
          "author": "junyl_yangide",
          "created": 1635636483,
          "upvotes": 7,
          "replies": {
            "hiretyz": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiretyz/",
              "text": "I just did a quick Google search and there were 19.6 million students enrolled in public and private colleges in 2019. Of that 146,000 were in Ivy League schools. So less than 1% in ivy’s obviously t20 is more but I’m not about to go look at all those and get enrollment  numbers for each one individually. So numbers is some of it for sure. \n\nI also suspect in my company, there are probably a couple from T20 in the legal department but I just don’t know them. \n\nI do think t20 would tend to skew heavily towards legal as a lot of those kids go to graduate and law schools. \n\nI work in the IT department and I know none of the directors and upper mgmt in IT went t20. \n\nLocation also has a lot to do with it. Our metro area doesn’t have a t20 school in it or nearby either.\n\nIndustry as well. I live in Texas where oil and gas is king. I’m not in that industry but oil and gas will have a different set of employees than a Google.",
              "author": "mbrown2626",
              "created": 1635686480,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hiq0kla": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiq0kla/",
          "text": "Needed this",
          "author": "Abe_james",
          "created": 1635649265,
          "upvotes": 2,
          "replies": {}
        },
        "hio7n1h": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio7n1h/",
          "text": "Thank you.... I'm one of the people who get super discouraged by this reddit and I really needed this post.... \nI'm trans and grew up a bit of a stereotype. I was raised in a very rural and conservative part of Pennsylvania. Plus my parents went through a horrible divorce when I was 15... basically a series of unfortunate events ruined my life. And now I'm trying to pick up the pieces as a young adult, but all these super smart kids with tons of resources and supportive parents that are acting like everything is so hard for them and how their chances are \"soooooo slim and they just pray they get it\" is literally making me want to die...",
          "author": "DrLili",
          "created": 1635618445,
          "upvotes": 3,
          "replies": {}
        },
        "hipd61y": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipd61y/",
          "text": "You have to realize things are not like they were in the past, where just having a degree was considered noteworthy. Nowadays, *everyone* has a degree and the job market is becoming more and more competitive, so going to a top school is more important than ever before.",
          "author": "MasterYiMain1",
          "created": 1635637280,
          "upvotes": -1,
          "replies": {
            "hipfapc": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipfapc/",
              "text": "Your a HS Junior? If that’s true, how on earth would u know what hiring practices are right now vs “the past”?",
              "author": "mbrown2626",
              "created": 1635638363,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "hiomasz": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiomasz/",
          "text": "Confirmation bias\n\nEdit: why are you booing me? I'm right",
          "author": "dustyoboe",
          "created": 1635624711,
          "upvotes": -6,
          "replies": {
            "hirislg": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hirislg/",
              "text": "Have multiple nieces/nephews that went t20/Ivy. Yes going to that schools can be an incredible opportunity but those students are the minority. 98% of students are not going to those schools so stressing if u aren’t a t20 school student isn’t worth it. You can be just as successful in life/work going to a local school that isn’t ranked in anything. When u get in the real work environment, t20 isn’t going to be what gets u that promotion.",
              "author": "mbrown2626",
              "created": 1635688645,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hin2lwq": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin2lwq/",
      "text": "I don't think a2c has many people trying to self validate themselves. Only chanceme does but if its seriously affecting you, consider leaving the sub. IMO only the top 5% of HS Students care so much about college applications that they join a dedicated subreddit for it. Its only natural that it would be filled with top students. Its wrong to compare yourself with someone else since you may have different circumstances impacting your GPA or ECs. If you're having panic attacks and stuff I seriously recommend leaving the sub. Its not worth destroying your mental health for something like this. Just giving my honest opinions, sorry if I hurt anyone's feelings.",
      "author": "No-Shift-6657",
      "created": 1635600461,
      "upvotes": 107,
      "replies": {
        "hin3gzp": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin3gzp/",
          "text": "No don't apologize for being honest; I do agree with you  on the selection bias of this sub for sure. I bet a lot of people do not mind the posts about people's amazing accomplishments that are 10x anything you have ever seen a high schooler do and then them also being like \"yeah I'm def gonna get rejected from all my reaches lol\". Because logically that shouldn't bother somebody, but many of us can misconstrue those comments, whether they were compliment baiting or actually honest, and develop inklings of impostor syndrome and general heightened anxiety. I do think the minority of people are actually trying to just \"flex\" but to a very stressed out group of young people, a lot on this sub can be very anxiety inducing.",
          "author": "SlooBananas",
          "created": 1635600897,
          "upvotes": 15,
          "replies": {
            "hio5830": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio5830/",
              "text": "for most people is not just “flexing”, instead it’s celebrating the accomplishment of the goals they worked so hard for with the people that helped you achieve them. it’s not personal. if seeing other people succeed pulls you down, you might to work on yourself buddy",
              "author": "Ok-Percentage-7757",
              "created": 1635617427,
              "upvotes": 17,
              "replies": {
                "hips2up": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hips2up/",
                  "text": "So many people worked incredibly hard on their applications and want to celebrate with the people who supported them throughout the process. It's a little distasteful to dismiss their excitement as flexing. I'm in agreement that most in this subreddit simply care a lot more about their college applications. \n\nOP should leave this subreddit if it's such a problem. It's not worth the poor mental health.",
                  "author": "MissAvarice",
                  "created": 1635644780,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hin2qlx": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin2qlx/",
      "text": "I am gonna play devils advocate for a minute, only because i had a relatively positive experience. had i not obtained the impostor feeling from this subreddit i would have been a lot less productive. sometimes we fail to realize that it’s okay to move past “ignorance is bliss” and get in touch w the reality of applying to college. is the level of anxiety produced by this sub concerning? yes but it may not be the worst thing. i dont want to invalidate the way you feel, but i just wanted to share my take",
      "author": "localramenconsumer",
      "created": 1635600530,
      "upvotes": 79,
      "replies": {
        "hina478": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hina478/",
          "text": "It’s very similar to r/SAT , people in these subreddits are the best of the best and frankly that motivates me.",
          "author": "20091000",
          "created": 1635604120,
          "upvotes": 24,
          "replies": {}
        },
        "hin4bs7": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin4bs7/",
          "text": "This.",
          "author": "um___ok",
          "created": 1635601328,
          "upvotes": 7,
          "replies": {}
        },
        "hin5wsn": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin5wsn/",
          "text": "This is totally fair and this is part of why I think this is a pretty complex issue. I think the issue comes from people who would have been pretty productive already but the mental strain actually makes them less productive.",
          "author": "SlooBananas",
          "created": 1635602113,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hinfzi7": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinfzi7/",
      "text": "I think it gives honest advice in admission though. If u google up or even look at the websites of college, they sugarcoat what admission actually is like, simply saying that how they have holistic approach or want diversity. They dont say that they want nearly all A student with international level award. For sure this sub gives me some anxiety, but I’m glad I found this sub cuz its better to know the cruelty of college admission than getting rejected by all T20s since I thought I would need only good grades.",
      "author": "Interesting_Carrot26",
      "created": 1635606825,
      "upvotes": 44,
      "replies": {
        "hinqnyy": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinqnyy/",
          "text": "this.",
          "author": "galavantingcarrot6",
          "created": 1635611385,
          "upvotes": 6,
          "replies": {}
        },
        "hipr417": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipr417/",
          "text": "most of the time tho its high school students giving out advice or stating facts that arent true bc they are literally still in hs",
          "author": "Witty-Evidence6463",
          "created": 1635644287,
          "upvotes": 0,
          "replies": {
            "hisbiqr": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hisbiqr/",
              "text": "i would say that most of the advice is helpful. just because someone's a college freshman vs a high school senior doesn't make the hs senior's advice invalid",
              "author": "whotookmyusernam",
              "created": 1635701444,
              "upvotes": 0,
              "replies": {
                "hitql5l": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hitql5l/",
                  "text": "…most of the time it could be very untrue and misleading for other high schoolers. better to leave the responses for actually qualified people. I know you high schoolers think you know a lot about college admissions & the process but you dont",
                  "author": "Witty-Evidence6463",
                  "created": 1635724230,
                  "upvotes": 0,
                  "replies": {
                    "hitxmy9": {
                      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hitxmy9/",
                      "text": "So you’re qualified? I check ur profile and see u giving advice. What makes YOU qualified? Does anyone who gets into college is considered qualified to give advice? \n\nAnd can u give an example of some bad advice or false information given out by high schoolers?",
                      "author": "whotookmyusernam",
                      "created": 1635727867,
                      "upvotes": 0,
                      "replies": {
                        "hivyoqy": {
                          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hivyoqy/",
                          "text": "i work in undergraduate admissions at my university, so yes, I consider myself more qualified than a high school student or regular college student. but no, i know im not as qualified as an actual admissions counselor",
                          "author": "Witty-Evidence6463",
                          "created": 1635777116,
                          "upvotes": 1,
                          "replies": {
                            "hiw85y3": {
                              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiw85y3/",
                              "text": "So go ahead and give some common mistakes made by high schoolers giving advice",
                              "author": "whotookmyusernam",
                              "created": 1635781375,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hin3hc4": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin3hc4/",
      "text": ">The only thing I can think of to fix this\n\nAt the personal level, an easy fix is to simply not read this subreddit.  Especially if it's giving you panic attacks.  Learn to self-censor where appropriate.\n\nIf the goal is to have a forum for discussion of college admissions strategies without it turning into A2C, then my suggestion would be to split it in two.  One forum for people targeting highly selective schools; another for people not targeting those schools.  The former would center around topics specific to selective admissions.  The latter would be a forum for general \"mechanical\" questions that are relevant to anyone applying to college anywhere.  I'd also moderate much more liberally.  You guys post some dumb shit sometimes.\n\nThe other issue with A2C is people repeatedly asking questions that are either:\n\n1. Unanswerable,\n2. Easily googled, or\n3. Have already been answered hundreds of times before.",
      "author": "jayphoward",
      "created": 1635600902,
      "upvotes": 60,
      "replies": {
        "hinm8w9": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinm8w9/",
          "text": "I'm always disappointed to read posts asking things that should be a Google search.",
          "author": "Calvin-Snoopy",
          "created": 1635609518,
          "upvotes": 11,
          "replies": {}
        },
        "hin6cok": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin6cok/",
          "text": "Thank you for the advice and I definitely agree. This is mainly a mental health issue so clearly many of possible solutions will be personal. However I do feel like there is blame to be placed on the nature of the subreddit itself which is why I made the post.",
          "author": "SlooBananas",
          "created": 1635602328,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hin668p": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin668p/",
      "text": "Honestly, I think perception matters more. When I started scrolling this sub as a freshman, I realized I didn't have nearly what it took in terms of ECs or grades (I thought my 3.7 was elite, for example) and had enough time to fix things and improve. You can either see this stuff and get discouraged (which, admittedly, I did at first) or you can try to match the people on here and improve your chances. Or you can just leave. No one's forcing you to go on A2C.",
      "author": "15Floater",
      "created": 1635602240,
      "upvotes": 54,
      "replies": {
        "hinyew6": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinyew6/",
          "text": "As a parent, this is the same experience my kid and I have gleaned from A2C. We came here precisely because it's filled with top students. We didn't know what we didn't know, and A2C has been a wonderful resource. There are kind, generous admission professionals and college students here who help guide and advise, wikis for almost everything you need, and there's a peer group of high school students who I see lifting each other up every day. Kids come here and share about their parents or family issues, financial concerns, mental health, victories and defeats, ask for help/advice, request support, etc. This might be the only place they feel heard, the only safe, anonymous space they have to tell their truths and to get honest feedback. It's srsly one of the most wholesome subs on reddit. No, it's not filled with fake \"positive vibes only\" rainbows and sunshine, but that's one of the things we like about it. And who doesn't love Shitpost Wednesdays?\n\nTLDR; A2C is what you make of it. There's a lot of good here.",
          "author": "chickenfightyourmom",
          "created": 1635614590,
          "upvotes": 15,
          "replies": {}
        },
        "hing7ck": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hing7ck/",
          "text": "This is my perspective as well. This sub showed me how shit I’m doing and how I need to get my shit up or I won’t get into my dream school.\n\nIt’s prompted me to to more research. I would never have had all of the opportunities I have suddenly found myself had I not become scared and started comparing myself with others.",
          "author": "Berkeley_Simp",
          "created": 1635606923,
          "upvotes": 15,
          "replies": {
            "hinqck7": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinqck7/",
              "text": "same",
              "author": "galavantingcarrot6",
              "created": 1635611255,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hindj42": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hindj42/",
          "text": "This is a very interesting perspective. I’ve never thought about it like that. But I think what OP’s saying is that A2C is a place strictly for asking college admissions help. But it’s cluttered with egoistical, paranoid, college-loving high schoolers who make it feel like a toxic competition rather than a safe place to ask questions about the entire application process.",
          "author": "daytradingishard",
          "created": 1635605708,
          "upvotes": 15,
          "replies": {
            "hinetfw": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinetfw/",
              "text": "OP's point gets made by people constantly, though. I think for anyone that wants legitimate college admissions help (read: not from other teens), they should go to their high school counselor or someone else that knows what they're doing. A2C was always going to attract a certain kind of high school student, after all. Plus, I can't emphasize enough how much I disagree with OP's idea of \"fixing\" A2C by piling on the rules and censorship.",
              "author": "15Floater",
              "created": 1635606292,
              "upvotes": 15,
              "replies": {
                "hinna7h": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinna7h/",
                  "text": "I think the problem is assuming all of us have someone (read: a high school counselor, or a trusted adult) to figure out the application process. There are many internationals who are literally the first in their school or even town to apply to the U.S. For them, the sub should be a helpful guide. And if you are talking about external counselors, no not all of us can afford them. :)",
                  "author": "Resident_Ad8455",
                  "created": 1635609951,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "hinf77o": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinf77o/",
              "text": "Yes true . Especially they cry abt how their 3.9 gpa might seem low in comparisons to others who r applying to nyu. Like u Karen who r u comparing ur 3.9 with???. So hen people like me think that if u don’t even have a 3.9 u barely stand a chance . And yes it encouraged u cause u might not be a high school senior but it discourages us cause we r already too late",
              "author": "Competitive_Yam_3689",
              "created": 1635606463,
              "upvotes": 4,
              "replies": {
                "hiobuxz": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiobuxz/",
                  "text": "If you're feeling discouraged, like I mentioned before, don't browse the sub. I unsubbed from r/chanceme for the same reason. And what's so Karen-ish about the GPA point? People that are worried about their GPA tend to be people with high GPAs - if you have a low one, chances are that you don't care all that much to begin with. And why would A2C conform to you because you didn't start preparing early?\n\nSorry if I sound aggressive - I'm just annoyed seeing the same posts and comments about this everyday. The \"woe be me\" posts have become the real circlejerk around here.",
                  "author": "15Floater",
                  "created": 1635620189,
                  "upvotes": 4,
                  "replies": {
                    "hipoj6h": {
                      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipoj6h/",
                      "text": "I get where u r comin from man appreciate it",
                      "author": "Competitive_Yam_3689",
                      "created": 1635643005,
                      "upvotes": 1,
                      "replies": {
                        "hipqwdm": {
                          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipqwdm/",
                          "text": "Much appreciated. Good luck with your apps bro",
                          "author": "15Floater",
                          "created": 1635644179,
                          "upvotes": 1,
                          "replies": {
                            "hipxfc5": {
                              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipxfc5/",
                              "text": "Thanks man where do you plan on applying to like ur dream unis",
                              "author": "Competitive_Yam_3689",
                              "created": 1635647576,
                              "upvotes": 1,
                              "replies": {
                                "hirn4qn": {
                                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hirn4qn/",
                                  "text": "My dream is getting into UPenn Hunstman, though I know that's a hell of a long shot. What about you?",
                                  "author": "15Floater",
                                  "created": 1635690773,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hipc8hn": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipc8hn/",
                  "text": "It varies between schools though, for instance if you have a 3.9 GPA at my school, that's a death sentence for all T20s. Basically everyone has straight As here, so just by having 1 B you are fighting an uphill battle. If you have multiple Bs then you might as well forget it. On the other hand, at some other schools, a 3.9 GPA might be the highest in the class.",
                  "author": "MasterYiMain1",
                  "created": 1635636814,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hinde7o": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinde7o/",
      "text": "General life advice: when you see something that makes you uncomfortable on the internet, just silently close the tab, instead of demanding everyone else to change to accommodate you\n  \nPersonally, I found this sub to be really helpful. I pretty much gained all my knowledge on the application process from the A2C hivemind. The dosage of anxiety I get is healthy and actually motivated me to work from an average applicant last year to on-par with everyone else on this sub now. I would have zero shots at top schools if not for this sub. Sorry for the aggressiveness but it's very annoying to me personally(because this happened more than once before) to see something I like change just because it's not the taste of someone else. Not every place is for everyone, and it doesn't have to be for everyone. I hope you will understand",
      "author": "KaiwenKHB",
      "created": 1635605645,
      "upvotes": 39,
      "replies": {
        "hioqrks": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hioqrks/",
          "text": "fr fr",
          "author": "Debatox",
          "created": 1635626722,
          "upvotes": 5,
          "replies": {}
        },
        "hiqep51": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiqep51/",
          "text": "the sub is called applying to college. if most people (those without your, for lack of a better term, privilege) can't receive applicable advice, then what's the point of this sub? there are plenty of other resources out there besides this community.",
          "author": "maclaonie",
          "created": 1635658210,
          "upvotes": 0,
          "replies": {
            "hirffjp": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hirffjp/",
              "text": "r/trees is about weed, r/marijuanaenthusiasts is about trees. r/anime_titties discusses news, r/worldpolitics is a sub where anything goes. The contents of a community naturally evolves, on internet or in reality, and please respect a community of people and their way of life. Besides, most advices on this sub ARE applicable to every applicant. Anxiety is, to be honest, a personal problem. You're perfectly welcome to start a new sub r/Apply2CollegeSafeSpace or whatever if you really have a problem with this sub. You sound like, for lack of a better comparison, those Twitter people who want artists to stop drawing mature content because they're uncomfortable with them.\n  \nIn other words, stop trying to bring social activism on the internet. Social activism exists in the real world because you can't simply move to a new society or create a new one, on the internet you're perfectly capable of doing so, so stop trying to make others change their way of life",
              "author": "KaiwenKHB",
              "created": 1635686828,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hingtlj": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hingtlj/",
      "text": "Things are what you let them be. This subreddit was extremely helpful and positive to me when I was applying. That depends on who you are and where you at. It also depends on how you choose to deal with things. You have a choice over what you do, how you think, and how you choose to perceive and formulate things generally. If you can, do so. It’s easy to compare yourself to others or allow yourself to dive into unhealthy thought patterns. doesn’t mean you have to. If that’s something you literally can’t control , as in the case of mental illness, then make the choice that’s best for you. I took a break after getting deferred early, and came back when I could use the sub in a healthy and effective way. People to protect yourself though, it’s unreasonable to expect otherwise l",
      "author": "maybehelpfulanthony",
      "created": 1635607201,
      "upvotes": 9,
      "replies": {}
    },
    "hin7dea": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin7dea/",
      "text": "I wonder, is it this subreddit that’s stressing you out or the reality of elite college admissions?",
      "author": "catatoniaalar",
      "created": 1635602812,
      "upvotes": 33,
      "replies": {
        "hipchl3": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipchl3/",
          "text": "Exactly, you may not like how competitive this sub seems but that's the reality. College admissions these days are truly brutal, and this sub is simply a reflection of that; there is no use in sugarcoating things.",
          "author": "MasterYiMain1",
          "created": 1635636939,
          "upvotes": 3,
          "replies": {
            "hiqezzb": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiqezzb/",
              "text": "if this kind of toxicity is \"necessary\" then perhaps a t20 college might not be that worthy of a goal...",
              "author": "maclaonie",
              "created": 1635658436,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hinkacr": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinkacr/",
      "text": "why is everyone so dramatic on here",
      "author": "BOODOOMAN",
      "created": 1635608696,
      "upvotes": 5,
      "replies": {}
    },
    "hinytv5": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinytv5/",
      "text": "The only person that will make you a failure is you. But that depends wholly on you. \n\nWhat do you determine as being a failure? Not getting into a T20? Not getting into Harvard?\n\nI got rejected from Harvard. I got rejected from Yale. Best thing that could've ever happened to me. I couldn't imagine being anywhere else (yes it's a t20 but the point is I had been manifesting for Yale basically all my life. I would attend Yale football games, I went to the Yale Whale for hockey games — designed by Eero Saarinen, that fact is still drilled in my head — and a Yale hoodie was my go-to hoodie for a lot of my high school life. \n\nEveryone gets rejected. Everyone fails. But if you are a \"failure\" after high school then that's on you. Truly think about why you would consider yourself a failure. What do you want to do with your life? \n\nThis community is actually awesome. Literally every question I ever had about the CommonApp I could find an answer to without even posting. The database is incredible. I'm in college, but I come back for Wednesdays all the time for the memes and I try to answer some questions while I'm here. \n\nEveryone applying to college is stressed. But you gotta push past that and move on with life. Why TF are you giving yourself a panic attack over something that hasn't even happened? If you get rejected, you get rejected. That's when you go to whichever school sees the proper value in you and accepts you and go make that place your own. \n\nMy attitude is that Harvard and Yale wish they had me. I would be such an addition to their campus. But my school is the one that realized how valuable I could be to their community so they get my love.",
      "author": "Niccio36",
      "created": 1635614760,
      "upvotes": 5,
      "replies": {}
    },
    "hin8teo": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin8teo/",
      "text": "I agree with some parts of your post, but my experience has been the opposite. I've got strong grades, strong ECs, etc. but my school's resources are limited and I'm not always the most social. Having this community has helped me see how I compare to other students around the world, connect with admissions consultants, and more. It's really made my application stronger and I think it's been the same for many users. \n\nIf the rules do change, I think it should be a gradual transition or something along those lines so that the subreddit can maximize its impact for everyone.",
      "author": "iapplexmax",
      "created": 1635603504,
      "upvotes": 12,
      "replies": {
        "hiofoe9": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiofoe9/",
          "text": "I agree w this take, yes some posts abt retaking a 1530 r very… questionable to say the least but otherwise I like the perspective the sub has given me abt college admissions, ranging from all kinds of posts\n\nBut I do also understand where OP is coming from",
          "author": "Lonely-Conversation2",
          "created": 1635621813,
          "upvotes": 4,
          "replies": {
            "hipckzx": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipckzx/",
              "text": "I mean what is wrong with retaking a 1530? A 1570 is the *25th percentile* for CMU SCS, for instance, so if you want to apply there you should definitely retake a 1530.",
              "author": "MasterYiMain1",
              "created": 1635636984,
              "upvotes": 3,
              "replies": {
                "hipd2mh": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipd2mh/",
                  "text": "Nothing is wrong w/ retaking but most people that ask more often than not have their mind made up & are stressing over what is virtually perceived as a good score. & in that circumstance for that program sure retake it but a 1530 is a good score for like any school imo. & I was talking abt posts that ask “should I retake a 1560” or something, I wasn’t saying the act of retaking is questionable",
                  "author": "Lonely-Conversation2",
                  "created": 1635637233,
                  "upvotes": 3,
                  "replies": {
                    "hipdgc1": {
                      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipdgc1/",
                      "text": "Yeah the thing is this sub likes to constantly circlejerk that anything 1520+ is the same, which is why many people ask if they should retake a 1560 and get flamed here, when in reality they absolutely should retake the 1560 and ignore the a2c hivemind.",
                      "author": "MasterYiMain1",
                      "created": 1635637424,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hioj0ur": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hioj0ur/",
              "text": "Definitely! It’s a tough balance to find, and I’m not sure where I personally would stand either.",
              "author": "iapplexmax",
              "created": 1635623278,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hin7vc9": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin7vc9/",
      "text": "I saw someone say that, to have a competitive GPA (in general, not for a specific college) you need a 4.75+",
      "author": "gouverneurmroosevelt",
      "created": 1635603051,
      "upvotes": 4,
      "replies": {
        "hinmwa0": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinmwa0/",
          "text": "There are so many quality colleges/universities that are not very competitive. I wish that applicants didn't put so much emphasis on getting into a \"competitive\" school, like that's the goal of higher education.",
          "author": "Calvin-Snoopy",
          "created": 1635609791,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hin6lda": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin6lda/",
      "text": "Sounds more like a you problem. You shouldn't be having panic attacks when looking at other people applying.  The fact that you want to change this community to fit your standards is absurd",
      "author": "Darkerdead",
      "created": 1635602444,
      "upvotes": 34,
      "replies": {
        "hina05d": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hina05d/",
          "text": "Definitely is a me problem but many other students have similar \"you\" problems, so I just think the subreddit could take some responsibility in this regard. Just my opinion and I understand others' are valid and logical too.",
          "author": "SlooBananas",
          "created": 1635604065,
          "upvotes": 6,
          "replies": {}
        },
        "hinolau": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinolau/",
          "text": "It's not really a \"you\" problem when there are a couple hundred yous.",
          "author": "alienatedhuman",
          "created": 1635610513,
          "upvotes": -6,
          "replies": {
            "hipcqxm": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipcqxm/",
              "text": "There are also plenty of people who are just fine with this sub. In fact, I think this sub is often too nice and needs to be significantly more brutal, rather than sugarcoating things.",
              "author": "MasterYiMain1",
              "created": 1635637067,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hintuo7": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hintuo7/",
      "text": "“This sub is so toxic” *doesn’t leave*",
      "author": "Kidfromwakanda",
      "created": 1635612705,
      "upvotes": 7,
      "replies": {}
    },
    "hinieju": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinieju/",
      "text": "Regarding the anxiety part due to the overachievers of this sub (I presume), I really don't know what to say. This sub is mostly comprised of students from highly competitive schools in the Bay and Tri-State area. Of which naturally is comprised of mainly pre-med/CS/FinBus majors which industries have a high priority on undergrad education (whether through prestige or internship opportunities, etc). Mix highly competitive top-achieving students and highly competitive majors with reddit, you get A2C. The circle-jerking and meme posts are just ways of coping with the extreme stress and academic pressure.\n\nThat being said, I do somewhat agree that some posts need to be limited. We have shitpost wednesdays for a reason but the line between what constitutes as a shitpost and fluff is oftentimes blurry. Then again we do have flairs. \n\nI think the solution would be to just sticky a post that refers people to the wiki and to take everything you read here with a grain of salt. \n\nI mean tbf though, most people that stay on here (I always see the same \\~15 people on nearly every post) are here for the memes and shitpost wednesdays. If you're for genuine advice, then search your question, if it's subjective ask away, then leave. Advice is limited, memes are not.",
      "author": "U_of_SOL",
      "created": 1635607899,
      "upvotes": 3,
      "replies": {}
    },
    "hinrmb1": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinrmb1/",
      "text": "tbh at first it stressed me out a lot but when I started not being insecure at someone's stats or ecs this community has made me feel less alone in this process",
      "author": "ElevatorTemporary114",
      "created": 1635611782,
      "upvotes": 3,
      "replies": {}
    },
    "hinsuvv": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinsuvv/",
      "text": "Genuinely asking, was it wrong for me to just celebrate when I got into UMich here?",
      "author": "StardustNyako",
      "created": 1635612293,
      "upvotes": 3,
      "replies": {}
    },
    "himxzwt": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/himxzwt/",
      "text": "Wow. I will be honest, I have been thinking about this exact same thing for quite some time now. Initially, when I joined this subreddit, I came here thinking I would be able to clarify my doubts, since being from a lower income middle class family in a third world country, I did not have access to resources or opportunities others might have had. It took me a long time to get over the feeling of dejection for aiming for good schools with my comparatively weak stats. While I have no doubt gained extremely helpful tips from here, I have had also developed intense case of impostor syndrome, to the point where even if I do something fulfilling, I feel it is not enough.",
      "author": "Resident_Ad8455",
      "created": 1635597966,
      "upvotes": 15,
      "replies": {
        "hincygx": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hincygx/",
          "text": "I felt the same. I was dreaming of going to top schools but this sub made me think that I shouldn’t even think about it because I am nothing compared to the other applicants. I had a very hard time in my freshman and sophomore years so my grades suck (also because of the unfair grading system in my country where for 1 mistake you are dropping from 100% to 84%). So I feel you. But actually I am still going to apply. I don’t care about other applicants. I have my story to tell and my life to live so honestly I am going to try my best anyway.",
          "author": "RAtararatara",
          "created": 1635605446,
          "upvotes": 5,
          "replies": {
            "hindnbz": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hindnbz/",
              "text": "Kudos to you! I am applying to top schools too. If I get rejected, I get rejected. But at least, I would have the satisfaction of not giving up.",
              "author": "Resident_Ad8455",
              "created": 1635605762,
              "upvotes": 3,
              "replies": {
                "hindqc4": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hindqc4/",
                  "text": "GOOD LUCK GOOD LUCK \nI’ll be rooting for you",
                  "author": "RAtararatara",
                  "created": 1635605800,
                  "upvotes": 3,
                  "replies": {
                    "hine47o": {
                      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hine47o/",
                      "text": "Same mate!😭😭",
                      "author": "Resident_Ad8455",
                      "created": 1635605978,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "himz0xn": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/himz0xn/",
          "text": "This is exactly the point I was trying to make; it feels like it's impossible to have a place to get personalized responses to questions without people also using it as a place to flex and bring others down. I was actually in a very similar place to you when I first found this sub (international student trying to get some answers about my unique situation). Thank you for sharing and good luck in the future",
          "author": "SlooBananas",
          "created": 1635598541,
          "upvotes": 6,
          "replies": {
            "himzqs5": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/himzqs5/",
              "text": "Yeah it becomes rough here sometimes, and I have had already been dealing with mental problems, so this just added to them. Still tho, it is what it is. Good luck to you too mate!",
              "author": "Resident_Ad8455",
              "created": 1635598931,
              "upvotes": 1,
              "replies": {}
            },
            "hincmju": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hincmju/",
              "text": "Why not create our own sub reddit",
              "author": "BATZ202",
              "created": 1635605297,
              "upvotes": 1,
              "replies": {
                "hio4iw7": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio4iw7/",
                  "text": "Isn't there r/IntltoUSA already?",
                  "author": "chaotically_awkward",
                  "created": 1635617127,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hinfgab": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinfgab/",
      "text": "Personally, I really like the sub as long as you ignore the r/chanceme posts and others that are similar to it, there's quite a lot of interesting and funny posts on the sub. This might be corny to say but a lot of stuff on here is also pretty relatable.",
      "author": "WildeBob",
      "created": 1635606579,
      "upvotes": 6,
      "replies": {}
    },
    "hinxaom": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinxaom/",
      "text": "If the sub attacks your well being then leave the sub",
      "author": "wooski29",
      "created": 1635614133,
      "upvotes": 4,
      "replies": {}
    },
    "hinsu7y": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinsu7y/",
      "text": "Agreed, I always try to be uplifting and helpful on A2C :) \n\nBut it's hard to be that sometimes when people channel their need for validation on here. That's probably my least favorite kind of post on A2C.",
      "author": "toyota2003",
      "created": 1635612285,
      "upvotes": 2,
      "replies": {}
    },
    "himvteq": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/himvteq/",
      "text": "god i wish i could give you a award this is so spot on",
      "author": "skiesinvirgo",
      "created": 1635596681,
      "upvotes": 6,
      "replies": {}
    },
    "hindivt": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hindivt/",
      "text": "I agree so much. I know there is no such thing as a perfect app. I am going SAT optional because its not required and when I see 1600 sat scores on various posts I feel so fucking anxious. \n\nI mean there is still time and even if you couldnt apply to ED, there is still RD but the fact that everyones doing it adds fuel to my FOMO. \n\n&#x200B;\n\nall in all, I indeed got my answers regarding admission processes but I also found toxicity and narcissism...",
      "author": "starish69",
      "created": 1635605705,
      "upvotes": 2,
      "replies": {}
    },
    "hinl03z": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinl03z/",
      "text": "Confused why ur post is on r/A2C, but ur criticisms are for r/chanceme. Just dont go on chanceme",
      "author": "pieguy411292176",
      "created": 1635608999,
      "upvotes": 2,
      "replies": {
        "hinlr1e": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinlr1e/",
          "text": "Theyre for both",
          "author": "SlooBananas",
          "created": 1635609309,
          "upvotes": 0,
          "replies": {
            "hinlzbf": {
              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinlzbf/",
              "text": "Sort by new and count how many posts are “sarcastic” and “mocking users”. In my experience ive seen 5x more posts complaining about this issue then posts actually having this issue",
              "author": "pieguy411292176",
              "created": 1635609404,
              "upvotes": 4,
              "replies": {
                "hip6lu0": {
                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hip6lu0/",
                  "text": "\"Sort by **new** and count how many posts are \"sarcastic\" and \"mocking users\"  \nOP specifically said the top posts, not new posts",
                  "author": "UndulatingSky",
                  "created": 1635634024,
                  "upvotes": 0,
                  "replies": {
                    "hipg02z": {
                      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipg02z/",
                      "text": "Ok, i just read the top 21 posts by hot and the only one marginally close to “narcissistic” “sarcastic” or anything like that was someone celebrating a college acceptance to drake.",
                      "author": "pieguy411292176",
                      "created": 1635638723,
                      "upvotes": 0,
                      "replies": {
                        "hiq13mp": {
                          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiq13mp/",
                          "text": "[https://www.reddit.com/r/ApplyingToCollege/comments/en97tp/unpopular\\_opinion\\_a\\_lot\\_of\\_yall\\_dont\\_belong\\_at/](https://www.reddit.com/r/ApplyingToCollege/comments/en97tp/unpopular_opinion_a_lot_of_yall_dont_belong_at/) \n\n[https://www.reddit.com/r/ApplyingToCollege/comments/cygkjg/oh\\_my\\_god\\_i\\_got\\_a\\_36\\_im\\_literally\\_shaking\\_rn/](https://www.reddit.com/r/ApplyingToCollege/comments/cygkjg/oh_my_god_i_got_a_36_im_literally_shaking_rn/) \n\n[https://www.reddit.com/r/ApplyingToCollege/comments/i4bkkw/truth/](https://www.reddit.com/r/ApplyingToCollege/comments/i4bkkw/truth/) \n\n[https://www.reddit.com/r/ApplyingToCollege/comments/kejs72/i\\_got\\_in/](https://www.reddit.com/r/ApplyingToCollege/comments/kejs72/i_got_in/)\n\n[https://www.reddit.com/r/ApplyingToCollege/comments/nldy8i/lets\\_be\\_honest\\_college\\_applications\\_are\\_90\\_faking/](https://www.reddit.com/r/ApplyingToCollege/comments/nldy8i/lets_be_honest_college_applications_are_90_faking/) \n\n[https://www.reddit.com/r/ApplyingToCollege/comments/m7bztw/thank\\_you\\_so\\_much\\_for\\_your\\_offer\\_of\\_rejection/](https://www.reddit.com/r/ApplyingToCollege/comments/m7bztw/thank_you_so_much_for_your_offer_of_rejection/) \n\n[https://www.reddit.com/r/ApplyingToCollege/comments/m9dymq/why\\_is\\_this\\_the\\_expectation\\_for\\_high\\_school/](https://www.reddit.com/r/ApplyingToCollege/comments/m9dymq/why_is_this_the_expectation_for_high_school/) \n\n[https://www.reddit.com/r/ApplyingToCollege/comments/m1zkdz/guess\\_she\\_didnt\\_manifest\\_hard\\_enough\\_to\\_get\\_in/](https://www.reddit.com/r/ApplyingToCollege/comments/m1zkdz/guess_she_didnt_manifest_hard_enough_to_get_in/) \n\n[https://www.reddit.com/r/ApplyingToCollege/comments/nqlcv7/college\\_applications\\_are\\_90\\_faking\\_it\\_till\\_you/](https://www.reddit.com/r/ApplyingToCollege/comments/nqlcv7/college_applications_are_90_faking_it_till_you/) \n\n[https://www.reddit.com/r/ApplyingToCollege/comments/ke9bvd/just\\_learnt\\_that\\_you\\_have\\_about\\_a\\_5\\_chance\\_of/](https://www.reddit.com/r/ApplyingToCollege/comments/ke9bvd/just_learnt_that_you_have_about_a_5_chance_of/)   \n\n\nJust went through a bunch of the top posts and a bunch of those are making fun of college applicants and people on the sub, often in a sarcastic way",
                          "author": "UndulatingSky",
                          "created": 1635649557,
                          "upvotes": 0,
                          "replies": {
                            "hisl48l": {
                              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hisl48l/",
                              "text": "Only the first post you listed is questionable.\n\nLiterally ever other post is a fun noharm joke. Like what, you seriously think these are bad posts that need to get banned off this page?",
                              "author": "pieguy411292176",
                              "created": 1635705500,
                              "upvotes": 0,
                              "replies": {
                                "hisnkoc": {
                                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hisnkoc/",
                                  "text": "I think you're missing OP's point. Yes. They're no-harm jokes, mocking the users. That's literally what OP is saying. You are literally agreeing with OP.\n\nOP is saying that the reason the top posts are mocking the subreddit is because the users are narcissistic. Not that the posts mocking the subreddit are narcissistic.\n\nOP is saying the top posts are mocking the subreddit, not that the top posts are narcissistic.",
                                  "author": "UndulatingSky",
                                  "created": 1635706530,
                                  "upvotes": 1,
                                  "replies": {
                                    "hiss63u": {
                                      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiss63u/",
                                      "text": "Bottom line - you’re overreacting, posts arent so bad as to warrant “99% of posts are toxic and induce panic attacks”",
                                      "author": "pieguy411292176",
                                      "created": 1635708432,
                                      "upvotes": 0,
                                      "replies": {
                                        "hissi58": {
                                          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hissi58/",
                                          "text": "dude. I'm not OP, and I don't hold all of OP's opinions. I was just correcting your misunderstanding bro",
                                          "author": "UndulatingSky",
                                          "created": 1635708568,
                                          "upvotes": 1,
                                          "replies": {
                                            "hiz3cq4": {
                                              "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiz3cq4/",
                                              "text": "OP isnt talking about posts mocking the subreddit nor narcissism",
                                              "author": "pieguy411292176",
                                              "created": 1635826697,
                                              "upvotes": 0,
                                              "replies": {
                                                "hj36ssa": {
                                                  "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hj36ssa/",
                                                  "text": "holy shit dude. YOU WERE THE ONE who brought up narcissism. READ YOUR COMMENTS. PLEASE. For the love of god. Leave me alone",
                                                  "author": "UndulatingSky",
                                                  "created": 1635901243,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hjh8wws": {
                                                      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hjh8wws/",
                                                      "text": "Lmao ur jus dum dum",
                                                      "author": "pieguy411292176",
                                                      "created": 1636152493,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "himw4y8": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/himw4y8/",
      "text": "This is so spot on",
      "author": "anuxietys",
      "created": 1635596878,
      "upvotes": 5,
      "replies": {}
    },
    "hind7k6": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hind7k6/",
      "text": "I agree, I literally cried submitting my application yesterday",
      "author": "Glum-Entertainment39",
      "created": 1635605559,
      "upvotes": 2,
      "replies": {
        "hinpfcw": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinpfcw/",
          "text": "Dw, it'll be good!",
          "author": "alienatedhuman",
          "created": 1635610868,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hin4a1m": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin4a1m/",
      "text": "[removed]",
      "author": null,
      "created": 1635601302,
      "upvotes": -6,
      "replies": {
        "hin4obf": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin4obf/",
          "text": "Well I've finished with most of my applications so probably leave but I think what I said is a reality for many people, so I'm glad that you haven't had that experience for yourself but it is true. And thanks for calling me a failure I really appreciate that too",
          "author": "SlooBananas",
          "created": 1635601502,
          "upvotes": 3,
          "replies": {}
        },
        "hin70xo": {
          "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hin70xo/",
          "text": "Ikr there’s always a post about this every week",
          "author": "illmastahNoodlez",
          "created": 1635602649,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hinjhho": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinjhho/",
      "text": "Please know that your college decisions do not define you as a person. You’ll hear it again and again, but it’s true. The process is completely arbitrary and largely out of one’s control. I fell into the trap of a lot of what you are describing, and, looking back on it as I go into my final year at college, I kind of wish I only got into my state school. Something nobody tells you is that the mentality you see on here doesn’t really go away after you get accepted somewhere. People have these idealized versions of colleges, especially elite institutions, and get very disappointed when they do not pan out. I’m not saying you shouldn’t be excited if you get accepted, or that people don’t enjoy their experiences, but I do want people to take a minute to step away from the blinding lights of prestige.",
      "author": "thatcornellbitch",
      "created": 1635608364,
      "upvotes": 1,
      "replies": {}
    },
    "hino6wc": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hino6wc/",
      "text": "\"the kind of circle-jerking that's so prevalent here\"\n\nYes, exactly, perfectly put. Love this post.",
      "author": "alienatedhuman",
      "created": 1635610343,
      "upvotes": 1,
      "replies": {}
    },
    "hinplbm": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinplbm/",
      "text": "Honestly, the toxicity of this place exactly reflects the toxicity I experienced from a certain vocal minority of elite students at my high school. If you're not dealing with this kind of atmosphere at school, you can count yourself very, very lucky.\n\nI don't deny that there is a lot of toxicity in A2C, but it's not an A2C problem; it's an elite admissions problem. As long as our culture keeps deciding that it's a good idea to put ambitious teenagers under this level of scrutiny, competition, and stress, it's always gonna be like this. You can't moderate your way out of it when the system itself is toxic.",
      "author": "elastricity",
      "created": 1635610939,
      "upvotes": 1,
      "replies": {}
    },
    "hinse44": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinse44/",
      "text": "Agree.",
      "author": "ItsZippy23",
      "created": 1635612102,
      "upvotes": 1,
      "replies": {}
    },
    "hinx43k": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinx43k/",
      "text": "College is of considerable significance, even more so if you are not majoring in CS.",
      "author": "InertiaOfGravity",
      "created": 1635614056,
      "upvotes": 1,
      "replies": {}
    },
    "hinyw2s": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hinyw2s/",
      "text": "Yea understandable. I don't get a ton of negative feelings from browsing, but it is super addicting since I'm so stressed about college and looking for any bits of info I can find. I had to block reddit so that I wouldn't procrastinate last month, now my habits are a little bit better. For me its not negative, like I genuinely feel ppl r nice on here but its just addicting.",
      "author": "collegestuff1235",
      "created": 1635614785,
      "upvotes": 1,
      "replies": {}
    },
    "hio317o": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio317o/",
      "text": "it feels like everyone on here has insanely good grades, at least the people who panic post, and it can be a lot sometiems",
      "author": "remvangelion",
      "created": 1635616503,
      "upvotes": 1,
      "replies": {}
    },
    "hio7xl2": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio7xl2/",
      "text": "I'm 10 years out from college and work for a well-known healthcare provider, making a comfortable six figure salary in this field. \n\n-Nobody cares where you went to school. Nobody asks except the rare patient; they don't really care either but just are making small talk or are themselves interested in pursuing a degree in my field. \n\n-Before I got my advanced degree, I started my first job out of college with a few Ivy league grads. After introductions, nobody really talked about what school they went to unless it was a college-related topic of conversation.  Oh, and I ended up getting promoted along with one of them and we made the same amount (we were buddies so she flat out told me before I even asked). \n\nSo, as so many are noting, it's WAY less about the college you go to and WAY more about your experience, abilities (e.g. writing, interpersonal skills, your network, etc), work ethic and just plain luck!",
      "author": "JungProfessional",
      "created": 1635618566,
      "upvotes": 1,
      "replies": {}
    },
    "hio84j2": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio84j2/",
      "text": "I wouldn't say a whole 99% of the time it's not helpful, because the people on here will give me an honest opinion, no sugarcoat, without somehow tearing into me like my parents. Their \"oh look at this skating friend of yours getting a 5 on every AP test\" gets to me more than any content on A2C because I know them and I know the people they're talking about. I don't think I'd be wrong in saying many people on this reddit come here for any sort of validation because of this. \n\nThis sub has also brought me down to earth. I know that I have strong stats and good essays but I've been reminded that there are thousands of other applicants out there and there isn't enough room for us all at a single top school. I am fine with that, because I know that my fellow A2Cers have also tried their best and I wish them success.\n\nJust piling restrictions on would ruin all of that. Saying that you can't post about your SAT score if it's above a 1550 takes away the ability of hundreds of redditors to share their excitement. Once again, this place may be the only one certain posters can actually vent to - I myself felt uncomfortable telling anyone at school and my parents' first reaction to mine was \"Not an 800 on the math score?\"\n\nSo in the end, there could probably be some mild rules to maybe guide the real narcissistic behavior more, but there really isn't much you can change without killing the true spirit of this subreddit. And if that's still too much, then this may not be the subreddit for your and you may need to leave for your own mental health.",
      "author": "chaotically_awkward",
      "created": 1635618644,
      "upvotes": 1,
      "replies": {}
    },
    "hio8aen": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio8aen/",
      "text": "The exact opposite for me it motivates me to be better than the narccist I would have gotten all bs and some as if not for this sub.",
      "author": "Superb_Fail5740",
      "created": 1635618711,
      "upvotes": 1,
      "replies": {}
    },
    "hioc42m": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hioc42m/",
      "text": "I mostly get humorous posts, fluff, or truly helpful posts, and I think part of that is just not totally stalking the sub and only getting the highly voted posts / posts related to my interests on my dash. I don't click on posts if the title doesn't interest me. When the title does interest me, all the comments are typically very kind and helpful. \n\nI love having the large resource of current college students, certified AOs, etc. and as a first gen low income very average student I find really useful info here. Of course, I started this process knowing next to nothing, so for me, the reward far outweighed any negativity. \n\nI totally understand feeling anxious / panicky, but when I feel that way I don't check A2C. And if I encounter posts from people with way better stats that aim for way better colleges than me, I don't assign value or thought to those posts. I'm realistic about where I'm at and proud of what I've managed to do, so people who are on a different (higher) tier kind of. aren't important to me. Especially when I take into account how happy I am right now and how much sleep I get. That mindset was one I built up before fully immersing myself on this sub, and it helps me navigate it a lot better I think.",
      "author": "frostedsnowfall",
      "created": 1635620292,
      "upvotes": 1,
      "replies": {}
    },
    "hiodnnm": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiodnnm/",
      "text": "i enjoy helping others with their questions, i've mastered blocking out any over-egotistical posts at this point lol",
      "author": "neonheadache",
      "created": 1635620940,
      "upvotes": 1,
      "replies": {}
    },
    "hiohndw": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiohndw/",
      "text": "Honestly half the people here are utterly deluded. You have all these people who are like “Ivy or bust!” without taking a second to really, *really* consider what going to an ivy (or any school of equivalent prestige, i.e. Stanford, MIT, etc) really entails. Sure, you might have great test scores, stellar GPA, and you might very well get into Harvard; but chances are you’re not going to get a full ride, or much of a scholarship. Let’s be realistic, maybe 5% of applicants will ever get that, and if you do get any aid at all you’d be one lucky son of a bitch. Facts are 90% of people coming from out of state to these colleges are gonna end up paying full-price. Sure, you might have the bragging rights of being a Harvard grad, *but will it be worth it?* When you’re $100,000+ in debt, will your degree in whatever the hell be worth it? So many people here are caught up in that American “college culture,” where the more name a school has the more they have to get into it, no alternatives. In doing this, they ignore far more economical options (or even ignore that college itself is not the only option, but that’s another can of worms in and of itself) which *would* give them a path to still attend their dream colleges without having to sell and arm and a leg. This sub promulgates this ignorant sentiment to no end, and frankly it pisses me the hell off. How many people now, who will end up getting into Yale, Brown, Dartmouth, UPenn, or wherever, will get out of school in four years with their nigh useless “ivy degree” and be kicking themselves for putting themselves in insurmountable debt because they got it into their heads through this place that in order to succeed in this world is to get into the most prestigious school possible? The mindset of overachievement and “college is the only way” needs to be dispelled from this place, but frankly I don’t think it ever will. This place could be a place to share resources to help us all achieve, but it ends up being a dick-measuring contest that does more harm to its regular users than good. /rant",
      "author": "SpaceGamer03",
      "created": 1635622678,
      "upvotes": 1,
      "replies": {}
    },
    "hiomy0i": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiomy0i/",
      "text": "i totally agree",
      "author": "seniorskz",
      "created": 1635625004,
      "upvotes": 1,
      "replies": {}
    },
    "hiopr1m": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiopr1m/",
      "text": "I know one other person in real life that knows what this subreddit is. You just have to realize that the sub doesn’t contain any regular high school students, like, at all.",
      "author": "ThoughtSafe9928",
      "created": 1635626276,
      "upvotes": 1,
      "replies": {}
    },
    "hioq0jw": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hioq0jw/",
      "text": "Oh no same every time i oppen this sub i feel like shit. But at least it has good advice too",
      "author": "Foreverinneverland24",
      "created": 1635626397,
      "upvotes": 1,
      "replies": {}
    },
    "hiouosr": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiouosr/",
      "text": "This sub can have issues but at least it’s honest about the admissions process. Sometimes we need brutal honesty",
      "author": "ltn748",
      "created": 1635628484,
      "upvotes": 1,
      "replies": {}
    },
    "hiourcg": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiourcg/",
      "text": "ㅍ 포호 ㅗ ㅗ ㅗ ㅗ 한 ㅗ.",
      "author": "Snoo-58198",
      "created": 1635628514,
      "upvotes": 1,
      "replies": {}
    },
    "hiozv3i": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiozv3i/",
      "text": "i'm gonna be honest, the way you process the information you see on this sub is your problem. if you are insecure or stressed, you're gonna process it differently than someone who's not. so i recommend you get off this sub and focus on yourself or address the root of you feelings rather than trying to regulate an extremely large group of people. not everyone can cater to every single person's triggers and feelings",
      "author": "gloppy213",
      "created": 1635630836,
      "upvotes": 1,
      "replies": {}
    },
    "hip0ukw": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hip0ukw/",
      "text": "My son refused to visit it or A2C when he was a junior/senior. I’ve followed both over the last few years now anyway, as my other son is a hs junior.  I quickly figured out why older son would only get anxiety (his grades were rough 9th/10th grades while our family was dealing with some stuff-obviously affecting his overall gpa despite <3.5+ uw gpas in 11th/12th).  These subs have *me* anxiety.\n\nHis younger brother is an outstanding (nationally-ranked) athlete, and has worked hard for his 3.25 uw gpa.  These are still not subs for him.  They help to keep me, as a parent, on top of things he can be doing (SAT prep/score goals, ECs, awareness of the coming need for letters of rec, etc.) to help build his app and spend this time wisely.  But sending him here for motivation is not happening.  I do wish it were a more realistic community, but not every kid is motivated to post on Reddit about these subjects, so I kinda understand.",
      "author": "ransomed_sunflower",
      "created": 1635631296,
      "upvotes": 1,
      "replies": {}
    },
    "hipfxu7": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipfxu7/",
      "text": "Dad here.\n\nI joined this sub to provide support to my son who was going through college application process.\n\nI personally did my education in India and was subject to a very different sense of social pressure and competition, but some factors of stress are universal.\n\nIf someone wanted to hear this …\n\nI was above average student all years leading to high school. Almost failed college. Didn’t know what to do for career till I stumbled upon comp science class , literally by chance. Took me two years to find a program that would take me in spite of my poor under grad record.\n\n20 years later , I am working for a Fortune 500 company. Decent salary . Respected at work . \n\nBut these 20 years weren’t smooth either. Got laid off . Almost got fired . But I survived .\n\nI am bot sure what your path is going to be like. Hang in there . Things will get better , and at times worse too . But then back to better again .\n\nBest ,",
      "author": "sat_dad_99",
      "created": 1635638692,
      "upvotes": 1,
      "replies": {}
    },
    "hiprb7l": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hiprb7l/",
      "text": ">But 99 percent of the time it's not.\r\n\nTextbook definition of survivorship bias. I'd argue 99% of content on this sub is questions and helpful answers. You are sorting by hot or top. What you will find is either funny stuff or stuff that will make you angry. It's the human condition: we like/upvote what makes us laugh or makes us mad.",
      "author": "DavidTej",
      "created": 1635644389,
      "upvotes": 1,
      "replies": {}
    },
    "hipsr4l": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipsr4l/",
      "text": "Why are people booing you? You're right. I will add that the good thing about this sub is shitpost wednesday but everything else is annoying",
      "author": "dreams_do_come_true",
      "created": 1635645130,
      "upvotes": 1,
      "replies": {}
    },
    "hitsrzk": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hitsrzk/",
      "text": "Hi! Sorry I’m just seeing this. I’ve been out camping this weekend and only had a couple brief chances to get some signal. I’d like to go over a few of the points you brought up.\n\nI feel like perspective is important when discussing  this. While your post only vaguely touches on it, the comments here seem to have a focus on top students. So for reference, I’ll give a quick background about where I am: I’m a college student with first year standing at a community college. I’m supposed to be a third year student, but I dropped out of a 4 year school after doing 3/4 of a year once covid hit and then took a year off before starting CC.\n\nTL;DR: I’m nowhere near the level of the vocal people you tend to see on this subreddit.\n\nNow for some of the points you mentioned:\n\n> Many students don't have access to college advisors or have terrible school counselors or limited time to do deep research into different schools or all of the above, and this subreddit can be a great place for that.\n\nI’m in agreement. I mainly applied to UCs and Cal States and never actually talked to my counselor. I also never really researched those schools and only applied for in state tuition. Knowing about my counselor as a resource would’ve been helpful. \n\n> There's a reason that the top posts of this subreddit and r/chanceme are sarcastic and mock its users.\n\nI see the sarcasm, yes. Can’t speak for r/chanceme as I don’t really go on there, but I’d say the userbase mocking is debatable for here. Sure, we do get a lot of fluff posts, but I wouldn’t necessarily say a lot of them are targeted (or if they are, they typically aren’t malicious).\n\n> I know that everybody knows that there's a lot of self-congratulating and narcissism here, but to many of us those kinds of posts are more than just annoying.\n\nI get the self-congratulating. That’s part of why I personally push the results megathreads so hard. For both of the points you mentioned, our current ruling is that we allow it provided it isn’t something that’s putting someone else down—although we do remove results posts in favor of them going in the aforementioned megathreads. If you do see a post that’s putting someone down, feel free to report it under rule 1. The reason we allow these is because we group them in with fluff, which is typically defined as anything not directly related to college admissions questions. \n\n> And I think that that's something inherent to the nature of this kind of platform (the discord is no better)\n\nTo a degree, yes. For the most part, people looking to apply to non-top schools aren’t as likely to frequent communities like A2C (although we welcome them if they choose to). There’s also more competition for spots at top schools, so people feel the need to one up each other more. When it comes to the Discord server, I’m the “official owner” of it, so if you have any suggestions that are more specific to there, feel free to let me know.\n\n> The only thing I can think of to fix this without nuking the whole place is to place strict limits on what kind of posts and comments you can make to prevent the kind of circle-jerking that's so prevalent here.\n\nMind elaborating on the circlejerking? Is it just the self-congratulating or anything else?",
      "author": "carlyc999",
      "created": 1635725375,
      "upvotes": 1,
      "replies": {}
    },
    "hio16wx": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hio16wx/",
      "text": "This sucks dick except for the few posts by the mods",
      "author": "soomr1",
      "created": 1635615739,
      "upvotes": 0,
      "replies": {}
    },
    "hipct5v": {
      "link": "/r/ApplyingToCollege/comments/qj034r/this_subreddit_was_one_of_the_worst_things_to/hipct5v/",
      "text": "this sub has a lot of bullies and angry people in it",
      "author": "theendoflove1212",
      "created": 1635637099,
      "upvotes": 0,
      "replies": {}
    }
  }
}