{
  "sid": "r6t010",
  "link": "/r/ApplyingToCollege/comments/r6t010/wait_uc_is_for_fall_sem_what_about_spring/",
  "title:": "Wait UC is for Fall Sem? What about Spring?",
  "text": "Wait UC is for Fall Sem? What about Spring?",
  "author": "CandyLand3601",
  "created": 1638402609,
  "updated": 1639837686,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmw6clm": {
      "link": "/r/ApplyingToCollege/comments/r6t010/wait_uc_is_for_fall_sem_what_about_spring/hmw6clm/",
      "text": "I’m not completely sure whether I understood your question, but if you’re asking on whether you can also apply for spring instead of fall, then each UC has a different system regarding this - UC Berkeley and UC Merced are on the semester system, while all other UCs are on the quarter system. UC Merced allows you to apply for Spring 2022 (freshman, sophomore transfer, junior transfer). UC Santa Cruz is open for Winter 2022 (junior transfer). Riverside is open for Winter 2022 (sophomore transfer, junior transfer). The deadline for these was July 31, 2021 - I would assume that the applications for winter/spring 2023 would be around the end of July in 2022. I hope this helps!",
      "author": "StarlightSolarShadow",
      "created": 1638419661,
      "upvotes": 1,
      "replies": {
        "hn5lv3v": {
          "link": "/r/ApplyingToCollege/comments/r6t010/wait_uc_is_for_fall_sem_what_about_spring/hn5lv3v/",
          "text": "Oh so you have to apply each semester?",
          "author": "CandyLand3601",
          "created": 1638590270,
          "upvotes": 1,
          "replies": {
            "hn8dph4": {
              "link": "/r/ApplyingToCollege/comments/r6t010/wait_uc_is_for_fall_sem_what_about_spring/hn8dph4/",
              "text": "Well, if you applied for fall quarter/semester and got accepted, then you would be accepted essentially for all of undergrad. If you didn’t make it, however, or you wanted to take a gap, then you could apply instead for winter/spring at the UCs that allow you to do so. Most UCs however only accept applications for fall quarter/semester. \nTo summarize: if you get accepted to attend a UC for fall quarter/semester and you accept the offer of admission, then you are accepted for all of undergrad (unless you seriously break some rules and/or get in serious trouble either before going to the UC or while you are a student at the UC, which would lead to possible rescinding of the offer of admission, as well as suspension or expulsion). You do not need to apply for spring semester if you have been accepted for fall.",
              "author": "StarlightSolarShadow",
              "created": 1638647691,
              "upvotes": 2,
              "replies": {
                "hna3kkz": {
                  "link": "/r/ApplyingToCollege/comments/r6t010/wait_uc_is_for_fall_sem_what_about_spring/hna3kkz/",
                  "text": "Ohh that makes much more sense thank you!",
                  "author": "CandyLand3601",
                  "created": 1638674878,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}