{
  "sid": "qkhnaw",
  "link": "/r/ApplyingToCollege/comments/qkhnaw/why_is_my_gpa_scale_weird/",
  "title:": "Why is my GPA scale weird?",
  "text": "Hey y'all.\n\nI have no idea whether my GPA scale is \"normal\" or adjusted. My school claims to use a 4 scale, but I don't think the grades are necessarily out of 4.0. They seem to be out of 4.3. I finished my High School career with a 4.0 unweighted, 4.19 weighted GPA. Most of my grades were A's to A+'s save for one semester where I was just in a terrible place mentally, as is reflected in my grades (I do ensemble almost ever semester, and this was the only semester I did not have an A+. I ended with a B+. Just to demonstrate)\n\nWhile researching colleges, I would often look to average GPA to determine whether or not I should apply to a school, or what the odds are that I could get into this school would be. For example, I look to a place like Villanova where I'm applying today, and I see a 3.84 GPA. That seems manageable, right? However, in a period where I need more self assurance than ever, I make the pretty stupid decision to research college calculators that calculate the chance I have at any school of my choosing. Another school (Williams) I saw had an average GPA of a 4.07. I accidentally type 4.07 into the \"Type your GPA\" section to discover none of these sites actually accept grades over a 4.0. This now has brought me into a last second period of heavy doubt. If these grades are done on a 4.0 scale rather than the other scale, my GPA would be a 3.72, a noticeable downgrade from basically any school that I am applying to.\n\nAfter calming down, I decided to rationalize some of the possibilities. First, I think the most likely possibility is that the calculators I'm using are simply out of touch. Perhaps this doesn't immediately seem obvious, but there is strong evidence to support this. For one, how does Williams have an average of 4.07 if it's out of 4.0?\n\nSecond, maybe that is the weighted GPA. In that case, I might still be good, but it might not be good enough.\n\nI know another calculator said the average GPA was a 4.2, and frankly, that might be a bit unreasonable for a school like Villanova. Villanova is an incredible school, but those are the standards of a Harvard. Near perfect grades seem almost impossible. However, this still aligns with the other site saying the average GPA is a 3.86 out of 4. Please let me know what's going on, I am as stressed as many of you are.\n\n&#x200B;\n\n(Also, I hope this does not violate rules 4 or 8. I'm really not asking for a chance, and don't think that this is anything too personal.)",
  "author": "ABCDEFUCKINGKILLME",
  "created": 1635783928,
  "updated": 1635890304,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiwftyr": {
      "link": "/r/ApplyingToCollege/comments/qkhnaw/why_is_my_gpa_scale_weird/hiwftyr/",
      "text": "You GPA scale is normal.\n\nA couple of things:\n\n1/ Colleges are inconsistent on whether their average GPA is weighted or unweighted.\n\n2/ Chance calculators are all shit. Every single one of them. If your school uses Naviance, you are better off using that data to see where past applicants from your HS were accepted, if you need a benchmark.\n\n3/ A B+ is not a bad grade and will not kill your chances for any college.",
      "author": "skieurope12",
      "created": 1635784700,
      "upvotes": 3,
      "replies": {
        "hiwgdtg": {
          "link": "/r/ApplyingToCollege/comments/qkhnaw/why_is_my_gpa_scale_weird/hiwgdtg/",
          "text": "Thank you so much, my friend. You have taken a serious weight off my shoulders!",
          "author": "ABCDEFUCKINGKILLME",
          "created": 1635784933,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiwucva": {
      "link": "/r/ApplyingToCollege/comments/qkhnaw/why_is_my_gpa_scale_weird/hiwucva/",
      "text": "[GPAs are kind of meaningless because the scales are all over the place](https://www.tiktok.com/@uvadeanj/video/6986662280230456582?is_copy_url=1&is_from_webapp=v1). \n\n&#x200B;\n\nFWIW, I don't even glance at what the student enters for the GPA. The school's official one is on the transcript, but I'm more concerned with the actual course and grades anyway. The full transcript tells a story the GPA can't.",
      "author": "UVaDeanj",
      "created": 1635790703,
      "upvotes": 1,
      "replies": {}
    }
  }
}