{
  "sid": "jmnnl3",
  "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/",
  "title:": "Thoughts from someone who was rejected from all his top choices",
  "text": "Hey all,\n\nLast year I was in your exact position. I ED'd to my dream school and thought I had a very good chance of getting it. Four of my family members had attended, I had a strong academic/extracurricular profile, I had good essays, etc. I was set on applying to this school since middle school.\n\nWaiting sucked.\n\nSome days, I felt like there was no way I was going to get in. Other days, I planned how I would react when I got accepted. On a few occasions, I literally had to check my application portal because I dreamed I got in.\n\nAnyway, December rolls around, and I opened my early college decisions. I was rejected or deferred from almost every single ED/EA I applied to. Nevertheless, I poured myself into all my essays, letters of continued interest, etc., determined to get into my dream school. I literally can't remember the last time I had written and re-written so many essays.\n\nIt was exhausing.\n\nFast forward a few more anxious weeks and a pandemic to regular decision day. With the exception of one school, I got rejected or waitlisted from every single reach and target I applied to. My family awkwardly patted me on the back and left my bedroom to give me some space.\n\nAt first, I felt nothing.\n\nLiterally nothing. I didn't feel sad, mad, or anything. Looking back, I think I was in shock and couldn't process it. I read the rejection/waitlist emails a few more times, hoping I had somehow misread the messages... I didn't. The one reach school I was accepted into was literally on the bottom of my list. It's not that it was a bad school or anything, I just felt zero affinity to the school and had a bad visiting experience. The only reason I applied was because it had an easy application.\n\nI had some friends who were also rejected from their top choices, but it seemed like they got over their rejections really easily. I, on the other hand, continued to be unhappy about the school, even after doing all the summer visiting stuff they have for accepted students. I seriously pondered taking a gap year. I wrote email reminders to myself to learn about applying to schools as a transfer.\n\nAs I'm writing this, I'm sitting in my dorm room, and I think my perspective has changed. I don't know if I finally drunk the school's kool-aid or if covid has changed my values, but I'm honestly so incredibly grateful to be here. Getting rejected from all my top choices was a huge wake up call for me. It's funny, I was doing a reading for one of my classes last night, and it mentioned a study about overconfident people. Statistically, if you ask someone how well they think they'll do in a class, a large majority will say in the top half. I guess everyone likes to think of themselves as smart, top of our class, etc., but someone has to get rejected. Someone has to get a C on the exam.\n\nLook, I'm not saying that \"everything works out in the end\" or anything like that. But, I do want to encourage you to remember to keep things in perspective.\n\nGood luck all!\n\nedit: thanks for all the rewards! Really made my day waking up to this! Just want to emphasize that I wasn't trying to come off as ungrateful for getting into one of my reaches, rather, I was trying to emphasize that I simply didn't feel like I fit in the school's environment very well. I think the point of my post was also that perceptions can change overtime (i.e., I didn't like the school and now I do)",
  "author": "maximus284284",
  "created": 1604324776,
  "updated": 1634076193,
  "over_18": false,
  "upvotes": 2174,
  "upvote_ratio": 0.98,
  "comments": {
    "gawausb": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawausb/",
      "text": "This post was something else. Its crazy how random admissions are. Irs kinda scary if you think about how your application is viewed. Within 10-20 minutes someone you will never meet probably 100s of miles away (I'm international) decides where you will spend the next the 4 years of your life.\n\nThis post is highly underrated props to you for writing it.",
      "author": "ShadowSH_2306",
      "created": 1604326376,
      "upvotes": 799,
      "replies": {
        "gaxtizk": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxtizk/",
          "text": "Wait this is kind of a dumb question but do colleges really view your application 10-20 minutes after you submit or do they wait until they've received all their apps after the deadline and then start reading? 😰",
          "author": "zzjenni",
          "created": 1604352915,
          "upvotes": 18,
          "replies": {
            "gaxuwkg": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxuwkg/",
              "text": "I think this person was referring to how long it takes to review an application, not how soon after you submit.",
              "author": "itallbeganwithameme",
              "created": 1604353595,
              "upvotes": 58,
              "replies": {
                "gaxz7jo": {
                  "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxz7jo/",
                  "text": "oh shoot im dumb haha 😔",
                  "author": "zzjenni",
                  "created": 1604355743,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            },
            "gay0dqu": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gay0dqu/",
              "text": "Some get reviewed in 5 or 6 minutes.  And some don’t even get that! 😬",
              "author": "Emory2020",
              "created": 1604356335,
              "upvotes": 20,
              "replies": {}
            },
            "gaxxnjj": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxxnjj/",
              "text": "It depends on the school. In this case, they meant that it will take only 10-20 minutes from when they beginning reading your application to make a decision, not 10-20 minutes from when you submit your application.",
              "author": "alexander11626",
              "created": 1604354955,
              "upvotes": 9,
              "replies": {
                "gaxzmk0": {
                  "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxzmk0/",
                  "text": "thanks for explaining haha im dumb 😔",
                  "author": "zzjenni",
                  "created": 1604355952,
                  "upvotes": 5,
                  "replies": {
                    "gay0qdl": {
                      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gay0qdl/",
                      "text": "You’re welcome and you’re not dumb! I’ve been asking some of the dumbest questions for months now 💀",
                      "author": "alexander11626",
                      "created": 1604356517,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gawa6a6": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawa6a6/",
      "text": "Thank you for this! I'm so motivated.",
      "author": "Awelawi",
      "created": 1604325970,
      "upvotes": 129,
      "replies": {}
    },
    "gawexy4": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawexy4/",
      "text": "Dude, I've not been through the same thing obviously, and I can't imagine how felt at that point in time. But recently, I'd been seeing some repercussions of being overconfident. I was never a top student, but was definitely above average. So in the past years after I've seen people really improve themselves, at one point it really bothered me. Like I used to find it hard to think during class if I couldn't get an answer that other people were getting.\n\nThen one evening, while I'm thinking about all of it, I open a google doc, and just type and type to explain to myself what this superiority complex is doing to me, and it somehow worked.\n\nI got over it. Thank god I'm over that shit. Fuck that competition. It's toxic and unhealthy as fuck. I just work without looking at anybody else now, and honestly its so much better.\n\nThat kind of turned into a rant, sorry about that. Thanks for the post OP, glad you're doing well. Post made me feel a little better too.\n\nEdit: Typo",
      "author": "faraaz_eye",
      "created": 1604328654,
      "upvotes": 106,
      "replies": {
        "gaytzgi": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaytzgi/",
          "text": "YES. THIS IS ME.",
          "author": "plsletmeincollege",
          "created": 1604372465,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gawdlec": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawdlec/",
      "text": "Are you me? I ended up at a school I nearly didn’t apply to because I disliked it so much and now I couldn’t imagine being anywhere else",
      "author": "37scrub",
      "created": 1604327937,
      "upvotes": 37,
      "replies": {}
    },
    "gawcbr8": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawcbr8/",
      "text": "Good idea not to get attached to any single school and just get on with life once you get accepted somewhere",
      "author": "wertu1221",
      "created": 1604327225,
      "upvotes": 77,
      "replies": {}
    },
    "gawhz2m": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawhz2m/",
      "text": "When I applied for colleges the only one I visited was John's Hopkins.  During the visit I realized I was in trouble because everyone else in my group was very charismatic and had been president of one or more clubs and honor societies.  So I applied for a second college, UMBC.  Don't think I ever visited it, but my dad went there and he said it was good.  Got rejected from JHU, got accepted to UMBC with a fairly nice scholarship.  Ten years later now, and I think UMBC was an awesome experience and I probably would have been miserable at JHU.",
      "author": "drillgorg",
      "created": 1604330239,
      "upvotes": 60,
      "replies": {
        "gaxnox7": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxnox7/",
          "text": "How hyped were you when they won",
          "author": "MrTreadmill",
          "created": 1604350079,
          "upvotes": 9,
          "replies": {
            "gb0uawm": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gb0uawm/",
              "text": "Haha I remember that!  Sports is not real big there, so I didn't find out until after the game.  So many reddit people calling us the Doggos, or Golden Retrievers.  It is a Chesapeake Bay Retriever damn it!  People outside of UMBC have definitely heard of that dog /s.  So we had a big party to watch the next game and of course they lost.  But it was ok because we all considered that the \"authentic UMBC experience\".",
              "author": "drillgorg",
              "created": 1604424149,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gawadq9": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawadq9/",
      "text": "Thanks for the perspective.  I think it shows that the admissions process can be unpredictable.  You got rejected by your targets but accepted by one of your reaches.  You never know what a particular school is looking for at any given point in the admission cycle.  I'm happy for you.",
      "author": "applyingcoed",
      "created": 1604326095,
      "upvotes": 106,
      "replies": {}
    },
    "gawh7da": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawh7da/",
      "text": ">\"...someone has to get rejected. Someone has to get a C on the exam.\"\n\nThis hits different rn",
      "author": "oooreily",
      "created": 1604329846,
      "upvotes": 67,
      "replies": {}
    },
    "gawww8c": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawww8c/",
      "text": "Many of you seem to be missing the point. It's not about \"how random admissions are\" (yes, they can be random), the point is about realistically self-reflecting on your application and yourself, and to hope for the best and expect the worst. Not to blindly confide your trust in the fact that \"it's random.\"",
      "author": "goobagibba",
      "created": 1604337421,
      "upvotes": 44,
      "replies": {
        "gax16jo": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gax16jo/",
          "text": "This. \n\nYes, admissions are random but the point of this post was that what you think may be the \"most important thing\" to you might change in 3 months. Your world will not end if you get rejected",
          "author": "maximus284284",
          "created": 1604339423,
          "upvotes": 30,
          "replies": {}
        }
      }
    },
    "gawaci0": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawaci0/",
      "text": "Thank you for writing this, it means a lot for each and everyone one of us :)",
      "author": null,
      "created": 1604326074,
      "upvotes": 30,
      "replies": {}
    },
    "gaws0ne": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaws0ne/",
      "text": "Yes, I understand this. And I’m sure whenever you tell this story, you get a lot of “oh, but it’s WashU, so you don’t have a right to complain,” even if that’s not where you wanted to go.\n\nI can emphasize with “well, I got into one elite school, but not the *right* one for me.” It feels like I should be abundantly grateful just to have gotten in where I got in, though it has felt hard sometimes not to tearfully ponder what could have been. \n\nWhen I was deciding between the one T20 I was admitted to (where I did not think I’d fit in) and another T30 that I liked a bit better, everyone told me I’d be crazy for choosing the T30. I chose the T20, and sure enough, I don’t fit in. I’m applying to transfer now, and this T30 is likely going to be on my list. \n\nMy point?\n\nSometimes, a good fit that is “almost elite” trumps an “elite” school where you won’t be happy.",
      "author": null,
      "created": 1604335135,
      "upvotes": 29,
      "replies": {}
    },
    "gax1vtc": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gax1vtc/",
      "text": "thanks for sharing;  i think the moral of the story is that most American colleges try really hard to make their schools a good experience, and most students will be perfectly happy at almost any school. Every school will have people you will like (and some you won't).  Every school will have clubs or activities that fit for you.  Every school will have good classes and professors. The idea that every school is some unique pearl and nothing can be like it is just marketing nonsense.",
      "author": "PennAlum",
      "created": 1604339742,
      "upvotes": 13,
      "replies": {}
    },
    "gax4rw2": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gax4rw2/",
      "text": "Great story.\n\nAnd just a thought...no one REALLY calls it the \"T20\" or \"T30\" outside of the those immersed in the culture on admissions boards (or from their parents obsessed with rankings perhaps).",
      "author": "sunshinedayhere",
      "created": 1604341094,
      "upvotes": 8,
      "replies": {
        "gcxtmha": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gcxtmha/",
          "text": "I think more people in the culture and sub need to know this too! Thank you for reminder :))",
          "author": "lasagnatt",
          "created": 1605879382,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gax54h8": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gax54h8/",
      "text": "Hey, OP!  I hope you are doing well.  I just wanted to comment by as someone who had a very similar experience as you that I know that it is an incredibly tough feeling, and I agree with everything you said.  However, I am so happy to hear you're doing well at your current university and that you are really enjoying it.  All the best of luck to you from here on out!\n\nHave a nice day!",
      "author": "eccentricgalaxy",
      "created": 1604341260,
      "upvotes": 7,
      "replies": {}
    },
    "gax7vr8": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gax7vr8/",
      "text": "I was supposed to have my 10 year college reunion this year, but Covid got in the way of that.  Instead, my friends and I have been playing D&D over Zoom these past few months, a new experience for most of us.  I am so happy to have these friends, especially after all these years.  I would never have met any of them if my college entry had gone the way I wanted and expected it to.\nI got a big envelope from my top school, and was so excited until I got to the part of the letter saying it was a deferred acceptance for the spring semester, but I could study abroad for the first semester if I wanted; it felt at the time like I just wasn't quite good enough to join the rest of the class in August.  Fortunately, some wiser people convinced me that I would be a fool to pass on that opportunity, and I met my best friend that first night in London.  This affected the trajectory for my academic, social, and personal life in innumerable ways that I wouldn't trade away for anything.  \nI guess my point here is that it's easy to get frustrated when life doesn't follow a plan that you have, and that can blind you to all the good things that just aren't what you expected.  Awesome job recognizing the positive things that came out of your own plan getting thrown off the rails, OP!",
      "author": "gaius_vagor",
      "created": 1604342544,
      "upvotes": 9,
      "replies": {}
    },
    "gaxhyar": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxhyar/",
      "text": "You deserve so much credit for this selfless post. It says so much about your incredible personality.\n\nI’ll like to share my own insight to help encourage other students as well. As an ivy grad and an active alum interviewer, my kid couldn’t get into my alma mater. Her grandpa (my dad) also went there and her aunt and uncle are well known professors at this Ivy. I pictured my kids going to this school ever since I was a frosh shopping at the school’s bookstore looking at all the infant and child sized spiritwear emblazoned with the ivy’s name and crest. We visited this school countless times since my kids were little and they all felt destined to go there for college. Despite this ivy being known for admitting legacy kids, my eldest applied ED and was coldly rejected. She had the stats, the EC’s and everything else on the check list, but still wasn’t “lucky” enough.\n\nThe problem these days is getting into any college these days is waaaaaaay different than just five years ago, let alone a full generation ago. Most parents DON’T get it. They don’t know getting into state schools isn’t even a sure thing these days.\n\nIf you don’t get into any of your dream schools or even the top 3/4 of your list, please don’t lose hope.\n\nThere are just too many overqualified applicants these days that it is not possible to admit all of them. Oftentimes, this leaves your fate to chance or the mood of a tie breaking admissions officer who forgot her Starbucks coffee that morning. \n\nAs long as you’re open to making things work, it will work- anywhere you go - even at a junior college.\nIf it’s of any consolation, for grad school - I got into an ivy and a state school and decided on the state school. My parents had a fit. \n\nAnyway I met my husband there. My hubs went to a community college and was my classmate; we wound up not only going to the same grad school together but “couple matched” to our post grad residency. Ultimately, we opened a practice together and have a happy family and work life. I thank God I didn’t go to that ivy grad school. Lol!! Sure I got slack from friends and family who thought I probably could not get in but I learned to care less.\n\nSometimes, you just never know why things happen, but embrace it and you can always make it work beyond your greatest expectations.\n\nEdited: typo",
      "author": "smileymomma",
      "created": 1604347343,
      "upvotes": 8,
      "replies": {
        "gaxj677": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxj677/",
          "text": "Thank you for your kind words!\n\nI know it's cliche to say this, but how you do is more important than where you go. But, I know it's hard to believe that until you're on the other side of the application cycle (I know that I didn't believe that until after I finished high school).",
          "author": "maximus284284",
          "created": 1604347927,
          "upvotes": 4,
          "replies": {
            "gaxjq0c": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxjq0c/",
              "text": "Facts",
              "author": "smileymomma",
              "created": 1604348188,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gay0598": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gay0598/",
      "text": "You have matured so much! Instead of being bitter, you’ve come to realize you were a bit overconfident. I can tell you are a very bright, emotionally-aware person. Enjoy the rest of your awesome college experience!",
      "author": "Emory2020",
      "created": 1604356213,
      "upvotes": 5,
      "replies": {
        "gay6tba": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gay6tba/",
          "text": "Thanks! Good luck to you as well!",
          "author": "maximus284284",
          "created": 1604359712,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gawx7hf": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawx7hf/",
      "text": "Thanks for writing this. It’s honestly scary how much time and effort we put into our essays/applications for reach schools and we get nothing but a copy pasted “we regret to inform you that...” you don’t hear a lot from the rejected students’ side. I’m glad things worked out for you in the end.",
      "author": "Kamushiny",
      "created": 1604337567,
      "upvotes": 8,
      "replies": {}
    },
    "gawmv61": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawmv61/",
      "text": "i go to the same school as u and while i never had any apprehensions, i did have doubts (which is normal considering this is probably one of the biggest decisions u’ll make at this point in ur life). but now, after being here for a solid two months, i genuinely cannot imagine myself anywhere else. i used to think it was stupid to say that u always end up where u belong bc that just can’t be true right? it is true though. when i talk to my friends who go to schools that i thought abt going to, i just KNOW that i would not love it as much as i love it here. things always work out, and if they don’t, u usually find a way for it to work out.",
      "author": "apsuffer",
      "created": 1604332658,
      "upvotes": 7,
      "replies": {}
    },
    "gawv7hi": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawv7hi/",
      "text": "Great post, shows the real side of things.",
      "author": "thecoolchicken18",
      "created": 1604336624,
      "upvotes": 3,
      "replies": {}
    },
    "gax2jxi": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gax2jxi/",
      "text": "As a college freshman i feel exactly like this! Great way of telling others that in the end it is what it is! You cant change the past, and maybe the target or safety school has a wonderful community!",
      "author": "happyajammeraj",
      "created": 1604340047,
      "upvotes": 2,
      "replies": {}
    },
    "gax7eby": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gax7eby/",
      "text": "[deleted]",
      "author": null,
      "created": 1604342318,
      "upvotes": 3,
      "replies": {
        "gaxd517": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxd517/",
          "text": "Penn haha",
          "author": "maximus284284",
          "created": 1604345049,
          "upvotes": 5,
          "replies": {
            "gaxklx3": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxklx3/",
              "text": "Ahem *cough cough",
              "author": "smileymomma",
              "created": 1604348603,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gay0t92": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gay0t92/",
      "text": "As another person who used to be overconfident and consistently praised, what we really need is a wake up call. I was falling apart in highschool and doing things for all the wrong reasons. That wake up call was the best thing that happened. I transferred to the school I wanted to go to after a year and am excelling here keeping a 4.0. I have no doubt in my mind I would probably be failing some of these classes without that wakeup call. Its not the end of the world and can teach you a lot of things that will help you get further than you could before.",
      "author": "smartymarty1234",
      "created": 1604356558,
      "upvotes": 4,
      "replies": {}
    },
    "gawbujh": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawbujh/",
      "text": "I mean you’re going to WashU...",
      "author": "miniraise",
      "created": 1604326954,
      "upvotes": 16,
      "replies": {
        "gawegy4": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawegy4/",
          "text": "I loved WashU when I visited, but that doesn't mean it's for everybody.\n\nBut it's definitely for that one girl who couldn't stop crushing over her financial aid officer...",
          "author": "ScholarGrade",
          "created": 1604328405,
          "upvotes": 49,
          "replies": {
            "gawtrkl": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawtrkl/",
              "text": "LMFAOOO SCHOLARGRADE",
              "author": null,
              "created": 1604335952,
              "upvotes": 12,
              "replies": {}
            },
            "gawu0xc": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawu0xc/",
              "text": "😹😹😹😹😹",
              "author": "isheetaborah2021",
              "created": 1604336072,
              "upvotes": 1,
              "replies": {}
            },
            "gayfhux": {
              "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gayfhux/",
              "text": "LMAFJDK",
              "author": "MegaSocky",
              "created": 1604364446,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gawch9h": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawch9h/",
          "text": "And? WashU is a great school, but, like he said, he didn't particularly want to go there and so he wasn't too happy initially.",
          "author": null,
          "created": 1604327311,
          "upvotes": 40,
          "replies": {}
        },
        "gawcb5f": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawcb5f/",
          "text": "and? it wasn't his top choice, he got rejected from most of his top choices. that's difficult to absorb no matter what. it's not that easy to develop perspective that quickly. \n\nglad that OP has more perspective on his situation now, though.",
          "author": "massconstellation",
          "created": 1604327216,
          "upvotes": 47,
          "replies": {}
        },
        "gawcgmy": {
          "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawcgmy/",
          "text": "Ikr",
          "author": "Jayson1222",
          "created": 1604327301,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gawnynb": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawnynb/",
      "text": "When i was applying to graduate school I received my first two letters the same day. One was from my “backup” school and the other from my first choice. Both rejections...\n\nI did get into one good program and decided to go there rather than take a year off. I don’t know if I made the right decision or not or even why I’m sharing her other than to say that things did work out in the end for me and I’m glad that I stuck with it and finished.",
      "author": "peekay427",
      "created": 1604333195,
      "upvotes": 2,
      "replies": {}
    },
    "gay756s": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gay756s/",
      "text": "I didn’t get into any schools I wanted to go to after high school. I ended up transferring to where I finished my undergrad and it all worked out. It might take longer for you, but it’s not a sentence for you in not having a happy life or fulfilled college experience. Imo",
      "author": "spingal5",
      "created": 1604359887,
      "upvotes": 2,
      "replies": {}
    },
    "gazsahi": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gazsahi/",
      "text": "thanks for this! I'm really kicking myself about my ED and getting very emotionally attached to it and this really helped 💖",
      "author": "plantagat",
      "created": 1604401177,
      "upvotes": 2,
      "replies": {}
    },
    "gbqz6vx": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gbqz6vx/",
      "text": "Sharing your experience will no doubt be of comfort to the countless students who will be experiencing the same disappointment. Kudos to you for gaining a new perspective and moving forward. Good luck to you and all your future endeavors.",
      "author": "newsgal360",
      "created": 1604950512,
      "upvotes": 2,
      "replies": {}
    },
    "gawo5lq": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gawo5lq/",
      "text": "I also felt bad at first on getting rejected from all of my top choices, but now I'm kinda glad that I didn't get in 😂💁‍♂️ Love the uni I'm at rn, even though it's not as \"prestigious\" as Ivys and other top US univs!",
      "author": "pysapien",
      "created": 1604333289,
      "upvotes": 4,
      "replies": {}
    },
    "gax51pq": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gax51pq/",
      "text": "Love you random person, good luck and do well",
      "author": "gkmwheelspin",
      "created": 1604341223,
      "upvotes": 1,
      "replies": {}
    },
    "gayt56r": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gayt56r/",
      "text": "Lower your expectations.",
      "author": "ozigiri",
      "created": 1604372000,
      "upvotes": 1,
      "replies": {}
    },
    "gaz3e2j": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaz3e2j/",
      "text": "Wow. That wasn’t what I was expecting\n\nSomething a lot of people, including me, really needed to read. Thank you!",
      "author": "Beast331215",
      "created": 1604378055,
      "upvotes": 1,
      "replies": {}
    },
    "gaxx31v": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxx31v/",
      "text": "I totally agree with you. Covid has really changed my priority. I got accepted to some Ivy-tier colleges last year but given the pandemic, it doesn't worth it to be in debt. I'm happy with my safety that offered me full scholarship. I don't think college is everything; it doesn't worth to pay so much attention on.",
      "author": "labose123",
      "created": 1604354667,
      "upvotes": 1,
      "replies": {}
    },
    "gaxa0k6": {
      "link": "/r/ApplyingToCollege/comments/jmnnl3/thoughts_from_someone_who_was_rejected_from_all/gaxa0k6/",
      "text": "Also, this was REALLY well written LOL A lot of \"showing\"\\~\\~\\~",
      "author": "Anitathefab02",
      "created": 1604343544,
      "upvotes": 0,
      "replies": {}
    }
  }
}