{
  "sid": "rexdln",
  "link": "/r/ApplyingToCollege/comments/rexdln/so_you_got_in_ed1_congrats_advice/",
  "title:": "So you got in ED1 (congrats!!!! + advice)",
  "text": "I was accepted ED1 to my dream school last year, so here's a perspective on what it's like and what you can/should do. First of all, I would sincerely like to congratulate you!! This is a fantastic accomplishment and it means you will hopefully spend the next few months stress-free. I hope your financial aid awards come through for anyone worried about that; I did not know if I would be able to attend my ED1 school until a few days after when we received my award. I can only provide a perspective on what it was like being accepted to my ED1 school (which has not released yet for 2026), but hopefully this sheds some light.\n\n**What happens next:**\n\nAfter you open your letter and scream and notify your friends and enter the first stages of denial and imposter syndrome, a couple things happen. For starters, your portal changes. There are a lot of documents you have to fill out by a certain time period, including committing to the school. Usually one of the requirements for committing is that you withdraw from all the other schools you applied to by a certain time period. After you are accepted, your financial aid award should appear either immediately or within a few days. Celebrate!\n\nThe college usually has a link to a Facebook group for accepted students. As much as I hate Facebook, I would recommend making an account and joining because it's your main access to all OTHER social forums with your fellow classmates. This will get FLOODED with introductory posts that you can't possibly keep up with. They're fun and maybe you'll see some people you want to talk to but it's very difficult to keep track of everything. I'll cover the specifics of what my experience was like and advice next. P.S. if your college is great they'll send you a thoughtful acceptance package but if they're cheap they won't at this point :/\n\n**Advice/My Experience:**\n\n* **Get off A2C if you can.** Despite getting accepted in December, I was obsessed with A2C and seeing the cycles of rejection and acceptance secondhand messed up my mental health. Once you think you're done with all the documents, please try to limit your A2C exposure if you think this applies to you. I wasn't able to get out of the applying to college mindset until JUNE.\n* **Join social media platforms your classmates create.** Within a few days, people will start organizing and making other social media groups to communicate with. These were way easier to navigate but very time consuming. However, I'm glad I was very involved because I believe it made my first few weeks of college easier. Here are some examples of what my (overachieving) class had that it self-organized: (\\*\\*Warning: this may be overwhelming and do what you're comfortable with)  \n\n   * *A class Instagram page.* This is pretty standard; sometimes you have to show your acceptance letter to make an introductory post and sometimes you don't. Look out for scam accounts trying to make CO 2026 pages. If you're like me, you try and fail to follow all of your classmates. This itself doesn't do much, although occasionally people will reach out to you over insta and/or put you in smaller groupchats on there. My class instagram is still active and posts notifications for our class.\n   * *A GroupMe.* My class groupme was set up by a student who deferred a year and had been in the previous one for CO 2024. GroupMes are enormous (mine had \\~1000 students by the end or half of our class) and is the main way my class communicates even now. A lot of it was social. Most people don't talk on there but some people do, and those are the people you'll get to know best. I was very active on GroupMe so I'll have random people from my class recognize me on campus despite us never meeting before. A lot of it is joking, polls, and important questions about the portal. Now, on campus, we use it for questions about finding IDs, people who want to go to concerts with us, questions about course selection, etc. In my class we also created 50+ smaller GroupMes divided by region (ex. California), interests (ex. cooking, working out, hoe groupchat), safe spaces (ex. international students, LGBTQ students) which were also great. This is probably the best way I got to know my classmates.\n   * *A spreadsheet.* Because we had so many people and pages for our class, we made a spreadsheet of people with contact information and social media, as well as several documents that had lists of links to different social pages. Depending on the size of your school this will be a manageable size for ED1 and maybe ED2 then quickly spiral.\n   * *A discord.* I was in my college discord, my CLASS discord for my college, and a Boston colleges '25 discord (there is also a general discord for boston schools as well). Depending on your region/school this is fairly standard. We asked questions, sometimes messaged each other, and played among us together a few times as a class. GroupMe was generally more conducive to conversation in my experience though.\n   * *An app?* One of my absolutely lovely classmates had coding(?) experience and made us an app that organized our contact information and links to all our class pages. It was a great way of organizing things for our class size. However, I've heard that this isn't normal and wasn't present in CO 2024 or probably many other college classes.\n   * *Zooms.* My class had weekly? biweekly? sometimes monthly Zooms we set up with each other. Typically we broke into breakout rooms and introduced each other. It was a cool way of getting to know each other if you feel comfortable with that; our inside joke was that we also played WAP at the beginning of each Zoom as our class anthem. In February we ran a 1 on 1 speed dating Zoom. I've also been on Zooms with classmates so we could play games together and Zooms for Boston colleges to meet people in my area.\n   * *Talking to. . . other schools?* As I kind of covered in the Zoom section, I was on a groupme for schools in my area and met some people from other schools on joint discords/Zooms. I didn't get to know many of them as well as my actual classmates but it was a cool experience.\n   * *Other:* We had spotify playlists, Strava groups, and stickers for our school classmates created on redbubble that were inside jokes\n* **Takeaways:** Personally, I'm glad I socialized with my classmates so much. We had a lot of inside jokes, which is pretty standard from what I've heard: apparently the JHU CO 25 sexualized their mascot and the Tufts and Duke CO 2024 invaded each other's groupmes. I was in remote learning when I got accepted, so my class was a huge social support for me for months before I returned to school. I looked forward to weekly Zooms when I couldn't see my irl friends. I still feel a bit closer to ED1 people than ED2 people or general RD people who got accepted; we all kind of know who each other are and are at least casually friendly. You guys are getting introduced to the first part of your family for the next four years. Overall, despite being incredibly active on GroupMe, I had mixed results and it varied from person to person. I know a lot of people who used social media to find each other, meet up, and become close friends who would sometimes drive across state lines to hang out before we even stepped on campus. Some people started virtual relationships. Personally, I have walked away from this with one close friend I still talk to (and otherwise wouldn't have talked to without groupme since she's on the other side of campus), a lot of people I am friendly/loose friends with who I wave to on campus, and weird knowledge of stranger's names. My orientation group and dorm were the most indicative of who I made friends with, but smaller groupchats and the GroupMe made me feel more comfortable arriving on campus because I felt like I already knew people and had people I could reach out to. I see my ED1 acceptance and socialization as a positive experience, and I hope it is for you guys too. However, I would like to warn you guys: be careful what you say. No one should be homophobic/transphobic/racist etc. in the first place, but being offensive on the groupchats will only polarize a large percentage of the class against you before you even step on campus and you may get reported to the administration. It's not hard to be a nice person while socializing with others.\n\nI hope this helped and feel free to reach out with any questions! Peace and love.",
  "author": "clifbaraddict",
  "created": 1639340495,
  "updated": 1639514243,
  "over_18": false,
  "upvotes": 140,
  "upvote_ratio": 1.0,
  "comments": {
    "hobobsl": {
      "link": "/r/ApplyingToCollege/comments/rexdln/so_you_got_in_ed1_congrats_advice/hobobsl/",
      "text": "Love this post! Thank you so much!!!",
      "author": "VIKHYAT04",
      "created": 1639359395,
      "upvotes": 11,
      "replies": {}
    },
    "hoc51oe": {
      "link": "/r/ApplyingToCollege/comments/rexdln/so_you_got_in_ed1_congrats_advice/hoc51oe/",
      "text": "i agree completely!!! my class discord/groupme rly got me through online learning + helped me meet some amazing ppl. and if there isn't anything like that take the initiative yourself!",
      "author": "lovelyluna17",
      "created": 1639367076,
      "upvotes": 5,
      "replies": {
        "hocpvms": {
          "link": "/r/ApplyingToCollege/comments/rexdln/so_you_got_in_ed1_congrats_advice/hocpvms/",
          "text": "Right!? I had such a positive experience <3 hoping all is well where you ended up",
          "author": "clifbaraddict",
          "created": 1639379255,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hobowvq": {
      "link": "/r/ApplyingToCollege/comments/rexdln/so_you_got_in_ed1_congrats_advice/hobowvq/",
      "text": "this is so awesome thank you for taking the time to write this",
      "author": "CreativeGuide0",
      "created": 1639359670,
      "upvotes": 3,
      "replies": {}
    },
    "hode0rr": {
      "link": "/r/ApplyingToCollege/comments/rexdln/so_you_got_in_ed1_congrats_advice/hode0rr/",
      "text": "saving this post",
      "author": "blurry_a",
      "created": 1639398551,
      "upvotes": 2,
      "replies": {}
    },
    "hoerxbr": {
      "link": "/r/ApplyingToCollege/comments/rexdln/so_you_got_in_ed1_congrats_advice/hoerxbr/",
      "text": "class socials are awesome!! i made friends and recognized people before even stepping onto campus and it helped transitioning a lot",
      "author": "19SwiftsAndCounting",
      "created": 1639420674,
      "upvotes": 2,
      "replies": {}
    }
  }
}