{
  "sid": "r5cj14",
  "link": "/r/ApplyingToCollege/comments/r5cj14/what_are_some_reasons_one_would_choose_usc_over/",
  "title:": "what are some reasons one would choose USC over UC Berkeley/LA?",
  "text": "in terms of campus environment/social life/quality of academics/ability to take courses one wants/guidance from advisors/scholarships/tuitions, anything/etc.?\n\nmy dad's friend's daughter chose USC over Berkeley and LA so I got curious but didn't feel close enough to ask her.\n\nshe got into computational neuroscience at USC and computer science (not eecs) at Berkeley and some engineering (EE?) at LA so I thought that going to berkeley or LA seemed like solid choices, especially in terms of tuition/job searching in the future.\n\n&#x200B;\n\nWhat do you guys think? what are some of the big pros/cons of these schools? thanks!",
  "author": "Possible-Concept8867",
  "created": 1638239803,
  "updated": 1638479341,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hmm5ljy": {
      "link": "/r/ApplyingToCollege/comments/r5cj14/what_are_some_reasons_one_would_choose_usc_over/hmm5ljy/",
      "text": "Just a thought: maybe she's really into computational neuroscience and the programs at UCLA and Berkeley wouldn't cover the same material.\n\nAlso:\n\n* It's not likely, but USC could conceivably be less expensive (even for a CA resident) if she won one of their big merit scholarships.\n* Maybe she doesn't like big classes; the student/faculty ratio at USC is half that of the other two.\n* Maybe she had a bunch of friends going to USC and none to the other two.\n* Maybe she's a snob and wants to hob-nob with other wealthy students; USC has a much higher concentration of those.\n* Maybe she's a snob and is somehow opposed to the idea of attending a public school.\n* Maybe she's also interested in music, drama or musical theater or film.  Thornton at USC is highly regarded.\n* Maybe she's loaded enough that paying more doesn't phase her (or her parents)?\n\nTo flip the question: why do you feel her choice is especially surprising?",
      "author": "jayphoward",
      "created": 1638240762,
      "upvotes": 12,
      "replies": {
        "hmm7izx": {
          "link": "/r/ApplyingToCollege/comments/r5cj14/what_are_some_reasons_one_would_choose_usc_over/hmm7izx/",
          "text": "i remember hearing that most of her college applications were in the cs/engineering realm with USC being one of the only non cs/engineering schools (although there still is the computational/coding aspect to her major), so I assumed her interests/career goals were more in line with the majors at berkeley/la. Tuition didn't seem like a huge issue for her family, so maybe she did like the vibes at USC more.",
          "author": "Possible-Concept8867",
          "created": 1638241632,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmm3znc": {
      "link": "/r/ApplyingToCollege/comments/r5cj14/what_are_some_reasons_one_would_choose_usc_over/hmm3znc/",
      "text": "I have cousins that are attending USC and Berkeley right now.  Completely different vibes. I’d never go to Berkeley because it’s just not me- very activist student body, almost an aggressive vibe in some ways. By all means, worthwhile and for those who are so inclined it’s a wonderful environment. USC is a more typical, laid back vibe of a top school where their students also enjoy a good time. I go to Vandy, and when I visited my cousin I got a somewhat similar vibe. But that’s just me.",
      "author": "rickershack",
      "created": 1638240043,
      "upvotes": 4,
      "replies": {
        "hmm6zkb": {
          "link": "/r/ApplyingToCollege/comments/r5cj14/what_are_some_reasons_one_would_choose_usc_over/hmm6zkb/",
          "text": "interesting. when I visited berkeley a while back it was like the day after april 20 (aka weed day) and so i got super chill vibes from the place back then lol. i see how that environment wouldn't be appealing to some people, though.",
          "author": "Possible-Concept8867",
          "created": 1638241391,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmmjlxf": {
      "link": "/r/ApplyingToCollege/comments/r5cj14/what_are_some_reasons_one_would_choose_usc_over/hmmjlxf/",
      "text": "There is a big different with private vs public, and the UCs are a public system that struggles with funding to some degree even though the UCs have world renowned academics. Many UCs have housing and class shortage issues. Unless you’re in a smaller college at a UC with more personal academic advising (eng should be better at most UCs so maybe doesn’t 100% apply to the person OP knows), you also have to figure things out on your own a lot. These “negatives” aren’t necessarily as bad as they sound in the long run; figuring out how to manage (persistence often gets one into a class that’s full for example) in such an environment helps prepare one for the adult world. On the other hand, a little hand-holding is nice, and you’ll get that more often at a private school.",
      "author": "pixelatedpix",
      "created": 1638247378,
      "upvotes": 1,
      "replies": {}
    },
    "hmmmjx9": {
      "link": "/r/ApplyingToCollege/comments/r5cj14/what_are_some_reasons_one_would_choose_usc_over/hmmmjx9/",
      "text": "USC gives out some pretty big scholarships.  Also, I've heard getting classes you want at Berkeley and UCLA are super hard/competitive.  Private schools are usually better with this since they want your tuition money.  If you live in the LA area, maybe one of her parents works at or is affiliated with USC?  My friend's father works at USC and she gets a full ride if she gets in, and another one of my friend's mother works at a hospital/research center affiliated with USC (not Keck) and he'll get a full ride as well.",
      "author": "rosamundpie",
      "created": 1638248995,
      "upvotes": 0,
      "replies": {}
    }
  }
}