{
  "sid": "r6yc3c",
  "link": "/r/ApplyingToCollege/comments/r6yc3c/in_need_of_reassurance_about_grades/",
  "title:": "in need of reassurance about grades",
  "text": "it’s the end of the semester and im feeling terrible. i’ve never earned a b in my academic career, but im taking accelerated math and despite spending so much time studying and going to after school office hours/tutoring i only managed to bring my grade up to a 79.5. rounding isn’t common at my school and so i’ll probably end up with a big fat c on my transcripts for first semester of my junior year, which is the most important year, and i feel like i’ve thrown my chances at college acceptance away. if anyone has any advice or uplifting words (i don’t care if you think a c is terrible and will tell me to lower my expectations for my applications, i know, i know it’s my fault) that would be much appreciated as i don’t know how to reconcile everything i’ve worked for with this one grade. has it really ruined everything??",
  "author": "Careful_Biscotti",
  "created": 1638417964,
  "updated": 1639823958,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmwmrew": {
      "link": "/r/ApplyingToCollege/comments/r6yc3c/in_need_of_reassurance_about_grades/hmwmrew/",
      "text": "colleges take a holistic view of all grades and classes, and generally like students taking more challenging classes than less challenging ones.\n\nYour C in advanced math is at least as valuable as an A in an on-level one, if not a little more valuable.\n\nEspecially if you improve it next semester, even an improvement to a B would show colleges what they want to see, since it's in an advanced class.\n\nAnother note to help you feel better is you'll have a spot to explain additional circumstances about a low grade for a lot of schools. One example is if it's in a zero-hour class, or your jumping from on-level to advanced classes without preparation.  Colleges understand that, especially if you improve it next semester. \n\nAlso, 1 C really doesnt hurt your GPA that much if you improve your grade in that class next semester. (well.. if your school uses weighted gpa/rank.. but you can explain this to colleges if they dont in additional info) 1 semester of a bad grade is such a small portion of your total GPA by the end of it, the valedictorian in my class has 3 C's in AP classes. (and it's a class of 600, general public magnet school, lots of tryhards)\n\nFocus on improving next semester, I wouldn't at all worry, and like another commenter said, we've all got that class or even a couple that got us.. (for me it was zero-hour advanced chemistry I got a C in, improved it to an A the next semester)\n\nEdit: it definitely hasnt ruined your app. Turn it into a story of improvement and seeking a challenge.\n\nDont make it a habit though, C's can only be viewed positively by top colleges if theres improvement attached to it.. I cant honestly say they're in the habit of admitting many students with more than 4-6 C's at a max from what I've seen unless you've got insane qualifications otherwise.",
      "author": "DrDrago-4",
      "created": 1638429747,
      "upvotes": 2,
      "replies": {
        "hmyyq63": {
          "link": "/r/ApplyingToCollege/comments/r6yc3c/in_need_of_reassurance_about_grades/hmyyq63/",
          "text": "thank you thank you!! this was very reassuring :) i definitely dont plan to make it a habit—i’m hopeful now!! thank you",
          "author": "Careful_Biscotti",
          "created": 1638473975,
          "upvotes": 1,
          "replies": {
            "hn142no": {
              "link": "/r/ApplyingToCollege/comments/r6yc3c/in_need_of_reassurance_about_grades/hn142no/",
              "text": "you're very welcome\n\nI spent a little while freaking out about my C in advanced chem since it's an outlier for me, but the more I talk to people about their apps the more I realize mines actually pretty strong, relatively speaking\n\nI'm sure you'll experience the same\n\nmake sure you get your extracurriculars as good as you can this year, its something I'm kicking myself for, I couldve done a bit more junior year to get more involved in my ECs and make them stronger.\n\n^ dont misread that as \"join as many clubs as I can in number\" -- it's the contributions that matter most, otherwise you'll find yourself writing descriptions of your activity that just.. suck (personal experience)\n\nI figured I'd have a little time at the start of senior year to get in a few extra EC accomplishments, both for activities and writing material... but I was absolutely incorrect \n\nEven starting your apps at the start of senior year is too late imo.. when some single person like 1 counselor says to you one time \"you should complete most of your writing during the summer after junior year\" LISTEN TO THEM like GOSPEL\n\ncurrently near death trying to 1. study for and max out SAT scores 2. write all my supplementals 3. finish apps in general, send transcripts and LORs, its.. just stressful to keep track of it all.  even with a massive spreadsheet\n4. survive through my senior year classes and maintain near the same GPA 5. maintain a social and family life\n\nall at the same time\n\nand all because I was a stupid junior who really only did basic surface level research into what colleges I'd want to attend.. made a list.. had to gut it at the start of senior year when I learned about net price calculators!\n\ndo your research while you can junior year and the summer after.. you'll heavily regret it if you dont.. \n\nI'm finding out that more than 2-3 hours of sleep a night is, in fact, optional..-ish",
              "author": "DrDrago-4",
              "created": 1638506880,
              "upvotes": 2,
              "replies": {
                "hn1f5or": {
                  "link": "/r/ApplyingToCollege/comments/r6yc3c/in_need_of_reassurance_about_grades/hn1f5or/",
                  "text": "yep! thank you for the advice. i’m not super strong in stem (planning on majoring in either something adjacent to law or linguistics) and as such taking accelerated precalculus was not a good idea haha. i’m currently contemplating dropping to regular precalc just because the pace of the accelerated class is a lot in conjunction with 4 other aps that i’m getting good grades in. in PLENTY of ecs so i think i’ll be alright, but i couldn’t get the idea that there would be hundreds of applicants who didn’t have a c in math out of my head when i posted this needing a confidence boost but thank you!!! such good advice!!",
                  "author": "Careful_Biscotti",
                  "created": 1638513498,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmw76bc": {
      "link": "/r/ApplyingToCollege/comments/r6yc3c/in_need_of_reassurance_about_grades/hmw76bc/",
      "text": "Honestly, each one of us will go through that one class that will really test and challenge us. Take it as an opportunity to really learn how to ask help, study, and prepare- those skills will help you later in the future as well. If it looks like others around you are breezing by, those people too will have to meet a challenging class and learn how to work through it. If you are like me, you may have a problem with inattention to detail. It’s not necessarily that you don’t know how to do the problems; you simply may have a hard time reading the question and writing math down in an organized way. I can attest to that, since my math grades have usually been brought down by 1.) not reading the question correctly and 2.) just really messy organization. Naturally I do read quite fast and gloss through things a lot, which helps in humanities, but will not serve you well in math. I would learn how to force yourself to slow down and read the entire question. If it’s organization, I would learn to write steps next to each thing you do or draw lines to deep separate them.",
      "author": "leaf1598",
      "created": 1638420091,
      "upvotes": 1,
      "replies": {}
    },
    "hmwc0hx": {
      "link": "/r/ApplyingToCollege/comments/r6yc3c/in_need_of_reassurance_about_grades/hmwc0hx/",
      "text": "That happened to my daughter. She still got into ucla",
      "author": "RetiringTigerMom",
      "created": 1638422740,
      "upvotes": 1,
      "replies": {}
    }
  }
}