{
  "sid": "quvg7a",
  "link": "/r/ApplyingToCollege/comments/quvg7a/not_gonna_apply_to_scholarships_until_after/",
  "title:": "Not gonna apply to scholarships until after college deadlines, is this ok?",
  "text": "I’ve been so bombarded with college applications, homework, SAT/ACT prep recently that I have had absolutely no time to look for and apply for scholarships. It’s also so hard when you don’t know where you are going to get accepted into, so the idea of taking the time to apply for scholarships, get them, and not even be able to use them because they apply to a different state, school, etc. is disheartening. I tried to look to scholarships nearing the end of the summer but ultimately came up empty handed due to the aforementioned reasons. So to simply put it, will I still be able to apply for a large number of scholarships come roughly January 5th? Or should I try to cram as much in while I still can? Of course, the deadlines vary for each scholarship, but I am just looking for a broad idea on the average deadlines of them all, thanks so much!",
  "author": "I-already-redd-it-",
  "created": 1637024656,
  "updated": 1637373590,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hksqu46": {
      "link": "/r/ApplyingToCollege/comments/quvg7a/not_gonna_apply_to_scholarships_until_after/hksqu46/",
      "text": "The scholarships you're most likely to win are going to come from the schools you're actually applying to.  Two things to bear in mind:\n\n1. Most of them want you to apply during their EA period, or by a priority deadline, in order to be considered for all scholarships.\n2. A few of them have a \\*separate application\\* you must fill out in order to be considered for certain scholarships.",
      "author": "jayphoward",
      "created": 1637026964,
      "upvotes": 3,
      "replies": {
        "hl6qgyj": {
          "link": "/r/ApplyingToCollege/comments/quvg7a/not_gonna_apply_to_scholarships_until_after/hl6qgyj/",
          "text": "Good to know, thanks! So then, how should I go about applying for the non school-given scholarships? I obviously don’t know which ones I should apply for before I am accepted to a school, so should I just wait? Thanks for the help! Sorry it took so long to respond",
          "author": "I-already-redd-it-",
          "created": 1637278815,
          "upvotes": 1,
          "replies": {
            "hl6zlxp": {
              "link": "/r/ApplyingToCollege/comments/quvg7a/not_gonna_apply_to_scholarships_until_after/hl6zlxp/",
              "text": "There are a various websites where you can search for them and books you can buy. The easiest to win will be those that are only open to a very specific set of students (assuming you're in that set of students) but these are usually also pretty small in amount.\n\nThere are some that are both large and open to anyone in the U.S. (e.g. Coca-Cola, Coolidge, U.S. Presidential, Burger King, Jack Kent Cooke, etc.) but they're also insanely competitive.",
              "author": "jayphoward",
              "created": 1637282977,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}