{
  "sid": "qfu0bp",
  "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/",
  "title:": "The more essays I write, the worse they get...",
  "text": "Suddenly my safety school are becoming my dream schools",
  "author": "KaiWillson",
  "created": 1635206770,
  "updated": 1635301640,
  "over_18": false,
  "upvotes": 61,
  "upvote_ratio": 0.99,
  "comments": {
    "hi1xjqf": {
      "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/hi1xjqf/",
      "text": "Lmao I’m in the same boat as you. I’m currently struggling big time writing a why us essay, and I stg my essay isn’t even coherent English anymore",
      "author": "sweethotpoTatoes",
      "created": 1635207225,
      "upvotes": 21,
      "replies": {
        "hi2ohw4": {
          "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/hi2ohw4/",
          "text": "I just keep reusing my old ones. After covid hit I just can't write as well as I did before. Unless the prompts are new in which case you're starting from scratch",
          "author": "NarutoDragon732",
          "created": 1635220273,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hi2lisr": {
      "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/hi2lisr/",
      "text": "ive never felt anything more",
      "author": "doctorzhivag0",
      "created": 1635218621,
      "upvotes": 3,
      "replies": {}
    },
    "hi36m6e": {
      "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/hi36m6e/",
      "text": "Take a break after your Ed round. Do the RD round over Christmas break",
      "author": "ivybrothers",
      "created": 1635233432,
      "upvotes": 2,
      "replies": {
        "hi3hfnn": {
          "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/hi3hfnn/",
          "text": "I wish I could but my school has this requirement where you have to submit it two weeks before the deadline not including breaks which means that’s I have to have it done before winter break and I don’t want to be dealing with finals at the same time so I only have this month to get everything done 🥲",
          "author": "KaiWillson",
          "created": 1635242676,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hi4mixu": {
      "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/hi4mixu/",
      "text": "I know how you feel!! But also I think there could be something more here.\n\nSo I’ve been practicing my flute tone lately, to get a more full and ringing sound versus just ~flavored air~. And at the bottom of one of my tone pages, it says this:\n\nFeels like your tone’s getting worse? It’s not! Your ear is just getting better. As you get more experienced with listening to music, your standards increase way before your skill does. \n\nI think this might be happening here! As you’re writing more and more essays, your standards increase way before your essay skill does. The only thing left to do is write more and cry!",
      "author": "mydogisstinky",
      "created": 1635263839,
      "upvotes": 2,
      "replies": {}
    },
    "hi3da35": {
      "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/hi3da35/",
      "text": "ah definitely felt that back when i was applying,,, my advice would really just be write out that “bad draft” and let it sit for a while before you go back to it",
      "author": "Fantastic_Boss843",
      "created": 1635239319,
      "upvotes": 1,
      "replies": {}
    },
    "hi6jg9t": {
      "link": "/r/ApplyingToCollege/comments/qfu0bp/the_more_essays_i_write_the_worse_they_get/hi6jg9t/",
      "text": "I started off strong. Great common app essay. Then went to still pretty solid quality; write about a piece of art that has moved me? Portrait of Ross in L.A and my interpretation of its meaning towards the societal view of Gay men. Easy. A culture? Write about Virginia and my pride in its shifting culture towards the future. Nice nice. \"Why [College]\" oh no. Uhhhhh it has good education program. \"Name a quirk\" uhhh I play my music in the middle of work if I need to think oh haha I just played some in the middle of writing this essay. \n\n\"Why UVM?\" I love New England, UVM's culture and location would give me the chance to grow into the person I want to be more than any other college (my last essay written), ehhhhh people on here telling me the why UVM one is shit but you know, I have good grades and a good personal essay so I'm solid.",
      "author": "gouverneurmroosevelt",
      "created": 1635291662,
      "upvotes": 1,
      "replies": {}
    }
  }
}