{
  "sid": "q7eml0",
  "link": "/r/ApplyingToCollege/comments/q7eml0/isfaa_house_loan_section_doubt/",
  "title:": "ISFAA House loan section doubt",
  "text": "I'd really appreciate any advice on this.\n\nSo there's this one section where they ask in which year house was purchased and what was the value at the time of purchase. But we bought land and our house was constructed (Indian Dad's crazy obsession). What should I fill then??\n\nThen in the same section, there's a third question asking how much value of the house do we still owe. I'd assume I'll have to fill the amount of loan left.\n\nBUT, in the end of ISFAA, there's another question asking how much money we owe to financial institutions and the reasons for them too. So should I mention the house loan here or in the upper section or both places???",
  "author": "Concerned-gay-guy",
  "created": 1634141820,
  "updated": 1636154362,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh5cqrn": {
      "link": "/r/ApplyingToCollege/comments/q7eml0/isfaa_house_loan_section_doubt/hh5cqrn/",
      "text": "1. I guess all these questions are asked in the CSS profile too so you can easily ask their reps about all of these (just don't mention that you're filling the IFSAA and not the CSS).\n2. Write the current value of your property. If your parents are employed by others, they generally have to submit proof of immovable properties to their employer every year. You might find the value there. This is the most convenient way IMO.If your parents aren't employed by others, you'll probably just have to write an **accurate** estimate which might include the current market value of the land in which the house is built and an estimate of how much the house might cost in the present day (you can lowball it a bit here I guess). You might want to double-check with your regional bank branch because worst-case scenario, you'll have to submit proof of immovable property in your IDOC, and in that case, you'll have to have a legit bank statement stating the value of the property. So, if the value you state comes out to be too little or too much, banks won't sign the document. I know the whole process is a pain in the ass :(For the date, just list the date your land was purchased in.\n3. Now, this once I'm not sure of. I'm more inclined to believe that you don't have to list the loans twice but I might be wrong. Better to ask the financial aid office of the college you're applying to. They will surely help you.\n\n&#x200B;\n\nSource (for 2nd point)– My neighbour who went through this process two years back (he got into a university with full tuition).\n\n&#x200B;\n\nEDIT: Just re-read your question and I **might** have read it wrong. If you're asking the price of purchase, just include the amount written in your land documents.",
      "author": "makarov_skolsvi",
      "created": 1634587009,
      "upvotes": 1,
      "replies": {}
    }
  }
}