{
  "sid": "qjlvmd",
  "link": "/r/ApplyingToCollege/comments/qjlvmd/should_i_opt_in_for_an_interview/",
  "title:": "Should I opt in for an interview?",
  "text": "The ED school I applied to offers an interview program, should I opt in for this? I know it's completely optional and it won't affect my application negatively in any way if I don't enroll for it, but is it worth a shot?   \nI'm worried I'll f\\*ck it up and reduce my chances of admission. Any advice would be dope.",
  "author": "Kevin_2112",
  "created": 1635671860,
  "updated": 1635778164,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiqvqjm": {
      "link": "/r/ApplyingToCollege/comments/qjlvmd/should_i_opt_in_for_an_interview/hiqvqjm/",
      "text": "I think this is an open door to walk into. Universities wouldn't know you as a person when you apply. The essay questions help but they're usually short and don't contain a lot of detail. Interviews will almost definitely reflect positively on you, so just think of it like talking to a friend about why you want to apply to the university in question. When universities say that not having interviews won't *reduce* your chances of admission, they're being sneaky. They never explicitly say that having an interview will increase your chances of admission, which I believe is the case (just like how SATs are \"optional\" but submitting them still gives a large advantage).\n\nChances are, if you're so sure that you'll fuck up the interview no matter what, you probably won't be a good fit for any school. I doubt many people are like that, and you very definitely aren't. So just give it a shot and try to make a good impression.",
      "author": "peewansebastian",
      "created": 1635672486,
      "upvotes": 3,
      "replies": {
        "hir0vlv": {
          "link": "/r/ApplyingToCollege/comments/qjlvmd/should_i_opt_in_for_an_interview/hir0vlv/",
          "text": "Thanks dude, this really helped. I’ll probably give it a shot then!",
          "author": "Kevin_2112",
          "created": 1635676764,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}