{
  "sid": "qunhyx",
  "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/",
  "title:": "CSS profile, Tax Help",
  "text": "I was looking into how to make a CSS profile and came across that I needed to mention payed tax on 2020. My dad has payed tax for 2019 in 2020 but for 2020 itself, hasn't payed any tax yet. He has filled the tax form for 2020 and sent it for assessment. But it hasn't been assessed and returned yet. What can I do?\n\nHe said that he'll probably be able to get papers by Nov 30, but my deadline is Dec 1. In fact, for financial aid, some deadlines may have already been crossed.\n\nSo should I just not apply for financial aid? What can I do? Please help me.\n\nAnd while we're on the topic, since I have yet to receive the tax return and apply for financial aid, should I actually not apply for it? Do universities reject those that tend to ask for aid?",
  "author": "Zarclaust",
  "created": 1637002403,
  "updated": 1637179754,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hkr4nmf": {
      "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hkr4nmf/",
      "text": "Wait, he didn’t pay any taxes or didn’t file a tax return in ***2020***?",
      "author": "pupuphlatter",
      "created": 1637002852,
      "upvotes": 1,
      "replies": {
        "hkrbck7": {
          "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hkrbck7/",
          "text": "He payed tax for 2019 in 2020, but hasn't payed tax for 2020 itself yet",
          "author": "Zarclaust",
          "created": 1637005507,
          "upvotes": 1,
          "replies": {
            "hkrblt1": {
              "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hkrblt1/",
              "text": "Did he fill out the tax return (forms) for 2020?",
              "author": "pupuphlatter",
              "created": 1637005605,
              "upvotes": 1,
              "replies": {
                "hkrc4wm": {
                  "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hkrc4wm/",
                  "text": "Yes, he has filled a tax form for 2020 and sent it. However, it has yet to be assessed and returned.",
                  "author": "Zarclaust",
                  "created": 1637005812,
                  "upvotes": 1,
                  "replies": {
                    "hkrjy4s": {
                      "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hkrjy4s/",
                      "text": "If he has sent it, it can be considered completed to the best of his abilities and knowledge. In other words, once sent to the IRS, I believe it’s considered done. They may adjust, and as long as he hasn’t attempted to defraud or something, it shouldn’t be that far off (especially if a tax preparer handled the return). So you can use the data from it regardless of if he has a refund or payment due because he has sent the official return.",
                      "author": "pupuphlatter",
                      "created": 1637008884,
                      "upvotes": 2,
                      "replies": {
                        "hkrluna": {
                          "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hkrluna/",
                          "text": "Thnx, that helps. I just hope I can make it within deadlines. On that note, can u answer my other questions I mentioned at the end of my post?",
                          "author": "Zarclaust",
                          "created": 1637009621,
                          "upvotes": 2,
                          "replies": {
                            "hkrn17c": {
                              "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hkrn17c/",
                              "text": "Definitely apply. It’s worth the small hassle. Many colleges separate their decision to accept you from what tuition aid they may grant; many colleges are need-blind. You can search on the schools’ websites for this info under “financial aid.” If you’ve already done FAFSA the CSS shouldn’t take much longer. It’s more detailed but it’s what you need for school aid (vs gov’t aid).",
                              "author": "pupuphlatter",
                              "created": 1637010084,
                              "upvotes": 2,
                              "replies": {
                                "hku48dw": {
                                  "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hku48dw/",
                                  "text": "Sadly, I'm an international student, so FAFSA won't help me. That's y I'm approaching financial aid via CSS. Thanks for ur help",
                                  "author": "Zarclaust",
                                  "created": 1637056549,
                                  "upvotes": 1,
                                  "replies": {
                                    "hku4ayv": {
                                      "link": "/r/ApplyingToCollege/comments/qunhyx/css_profile_tax_help/hku4ayv/",
                                      "text": "Gotcha. Okay. Well hope I helped with the CSS. Good luck! \n\nI’m sure you’ve seen this but just in case: https://www.proprofs.com/training/course/?title=completing-the-202223-css-profile-as-an-international-student_612d141eb69b9",
                                      "author": "pupuphlatter",
                                      "created": 1637056612,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}