{
  "sid": "rir12p",
  "link": "/r/ApplyingToCollege/comments/rir12p/which_universities_do_i_have_a_good_shot_of/",
  "title:": "Which universities do I have a good shot of getting in with 1440 sat score?",
  "text": ".",
  "author": "PoopyPringle",
  "created": 1639775562,
  "updated": 1639785504,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hoz0y4c": {
      "link": "/r/ApplyingToCollege/comments/rir12p/which_universities_do_i_have_a_good_shot_of/hoz0y4c/",
      "text": "This highly depends on your other stats. You can look at different schools' average SAT ranges to see how you compare to accepted applicants, but that's only one of many metrics for many schools. Congrats on the score!",
      "author": "peponibus",
      "created": 1639777599,
      "upvotes": 1,
      "replies": {}
    },
    "hoz4ny9": {
      "link": "/r/ApplyingToCollege/comments/rir12p/which_universities_do_i_have_a_good_shot_of/hoz4ny9/",
      "text": "Thousands.\n\n>The U.S. Department of Education lists nearly 4,000 degree-granting academic institutions.",
      "author": "RichInPitt",
      "created": 1639779124,
      "upvotes": 1,
      "replies": {}
    },
    "hozcxfn": {
      "link": "/r/ApplyingToCollege/comments/rir12p/which_universities_do_i_have_a_good_shot_of/hozcxfn/",
      "text": "A lot of state schools offer merit money with that score. You would be above the 75th percentile for most of them and the scholarships can be substantial. If you are looking strictly for the highest ranked schools, regardless of tuition costs, you would be in the accepted range for almost all schools, but without a “hook” of some sort, very much a shot in the dark for top 20s who regularly reject kids with higher scores for the simple reason that they get way more applications than they have spots. I think I read somewhere that UCLA gets over 100k applicants a cycle. \n\nIf you want to try and get into one of the top 20-30 ranked schools, consider the strategy of applying to 20 or so of them to increase the chances that (1) of them will accept you. Who knows, some school might be wanting to expand their class based on geography or some other metric that you aren’t aware of and you just happen to fill that need. \n\nThat’s an awesome score, btw, and 99% of all schools would love to have an entire Freshman class with that metric.",
      "author": "BourbonHazmat",
      "created": 1639782592,
      "upvotes": 1,
      "replies": {}
    }
  }
}