{
  "sid": "re6kuq",
  "link": "/r/ApplyingToCollege/comments/re6kuq/does_tutoring_count_as_an_ec_i_can_put_on_my/",
  "title:": "does tutoring count as an ec i can put on my college app even if i don't officially do it?",
  "text": "back when in-person school started for me in september, i used to tutor my friends during lunch break for fun. surprisingly word spread around that i'm a good math teacher and now i tutor 3-5 students every day, and charge like 5 dollars for 40 minutes. i spend a lot of time doing this since i figured it can help me collect some money. i usually get to school an hour earlier to tutor kids. it doesn't hurt me too much since it pretty much serves as a revision \n\nthe thing is, i don't have a fixed schedule, and i just do it on and off depending on whether we have free periods, exams, and my students keep changing. \n\nwould this be a good ec to add to my college apps? considering this is not verifiable and my teachers don't know about this. they probably won't like it very much if they hear about it lol",
  "author": "stale-doritoO",
  "created": 1639250005,
  "updated": 1639515439,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "ho5ko8t": {
      "link": "/r/ApplyingToCollege/comments/re6kuq/does_tutoring_count_as_an_ec_i_can_put_on_my/ho5ko8t/",
      "text": "Yes. It counts.",
      "author": "Octocorallia",
      "created": 1639250228,
      "upvotes": 2,
      "replies": {}
    },
    "ho5kplr": {
      "link": "/r/ApplyingToCollege/comments/re6kuq/does_tutoring_count_as_an_ec_i_can_put_on_my/ho5kplr/",
      "text": "Yeah that would count. I had SAT study sessions with my classmate and when I mentioned it to a teacher, they said they can mark me down as teacher's assistant for that, since i technically taught the classmate most of the math material and we met frequently and for multiple hours at a time. i tutored another student in school subjects 2-3 times just to solidify the whole \"teacher's assistant\" thing and it was totally fine",
      "author": "CrispierWater",
      "created": 1639250244,
      "upvotes": 2,
      "replies": {}
    },
    "ho7b6hr": {
      "link": "/r/ApplyingToCollege/comments/re6kuq/does_tutoring_count_as_an_ec_i_can_put_on_my/ho7b6hr/",
      "text": "Yes i mean even you can put Minecraft as an EC depending on your commitment.",
      "author": "9und9zigluftwaffles",
      "created": 1639279143,
      "upvotes": 1,
      "replies": {}
    }
  }
}