{
  "sid": "qx3gdf",
  "link": "/r/ApplyingToCollege/comments/qx3gdf/due_to_self_imposed_family_obligations_i_am/",
  "title:": "Due to self imposed family obligations I am limited to online colleges for a CS degree. Recommendations??",
  "text": " I’m currently looking into snhu to transfer from PCC with a general transfer degree. It is $225/credithr for military (hope that includes reserves) which is affordable as I don’t think I’ll be getting much aside from FAFSA and a lousy reservist’s GI bill. \n I’d like to major in computer science with a concentration on data analysis. Everyone else I look into is far more expensive and/or don’t offer CS degrees online. \n My local state college is shit for CS and I can’t move to go to a better school. Anyone else have suggestions for good online universities for CS or opinions on snhu?\n\nThank you!",
  "author": "Tomoudon",
  "created": 1637280721,
  "updated": 1637353027,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hl6w25b": {
      "link": "/r/ApplyingToCollege/comments/qx3gdf/due_to_self_imposed_family_obligations_i_am/hl6w25b/",
      "text": "Look at UF online, and see if reserves qualifies you for the in-state rate.  They have some automatic exemptions for military, and their in-state rate is very low.\n\nI would personally prefer one of the big state university programs over SNHU.  Oregon State and Arizona State are a couple of prominent ones that offer online degrees. Just avoid ones where the school really tries to separate it from their in-person offering (Purdue Global for example).",
      "author": "BrawnyAcolyte",
      "created": 1637281344,
      "upvotes": 4,
      "replies": {
        "hl750hv": {
          "link": "/r/ApplyingToCollege/comments/qx3gdf/due_to_self_imposed_family_obligations_i_am/hl750hv/",
          "text": " From your perspective, why would you prefer a big state program over snhu? I only care about my degree being legit and actually learning useful applications for a future job in the coursework. And graduating.",
          "author": "Tomoudon",
          "created": 1637285493,
          "upvotes": 1,
          "replies": {
            "hl760ha": {
              "link": "/r/ApplyingToCollege/comments/qx3gdf/due_to_self_imposed_family_obligations_i_am/hl760ha/",
              "text": "SNHU is a legit university, but I think the perception of a school that's almost entirely online and known for that can hurt in a job search.  Same issue with Western Governors University.\n\nWell known public universities don't have that same perception issue IMO, at least when the diploma isn't specifically associated with it being an online program.",
              "author": "BrawnyAcolyte",
              "created": 1637285949,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}