{
  "sid": "r3ebum",
  "link": "/r/ApplyingToCollege/comments/r3ebum/is_studying_physics_from_an_lac_a_good_idea/",
  "title:": "Is studying Physics from an LAC a good idea?",
  "text": "Basically title.\n\nI am looking at colleges that meet 100% demonstrated need of intl students, and most of them are liberal arts colleges. I want to study Physics (and some comp sci too) at university. Do you think its a good idea?",
  "author": "Upanshu_",
  "created": 1638022281,
  "updated": 1638205132,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.96,
  "comments": {
    "hm9ysx4": {
      "link": "/r/ApplyingToCollege/comments/r3ebum/is_studying_physics_from_an_lac_a_good_idea/hm9ysx4/",
      "text": "It can be a good idea -- liberal arts includes sciences, they aren't just good for humanities.  Schools like Reed, Carleton, Haverford, Swarthmore, and Grinnell have really strong programs and their students continue on to PhDs at higher rates than pretty much all major research universities outside of Caltech and MIT.",
      "author": "BrawnyAcolyte",
      "created": 1638023228,
      "upvotes": 25,
      "replies": {}
    },
    "hm9xq66": {
      "link": "/r/ApplyingToCollege/comments/r3ebum/is_studying_physics_from_an_lac_a_good_idea/hm9xq66/",
      "text": "Yes.",
      "author": "Concerned-gay-guy",
      "created": 1638022642,
      "upvotes": 14,
      "replies": {}
    },
    "hma0gra": {
      "link": "/r/ApplyingToCollege/comments/r3ebum/is_studying_physics_from_an_lac_a_good_idea/hma0gra/",
      "text": "yup! plenty of lacs have fantastic physics programs\n\nv anecdotal but ik somebody who studied physics at a lac (williams) that wound up going to mit for grad school, since he had sm opportunities at college (undergraduate focus + smaller class sizes allowed for stronger relationships w profs, research opportunities, advising and mentoring, strong alum program, etc)",
      "author": "tteasis",
      "created": 1638024099,
      "upvotes": 10,
      "replies": {}
    },
    "hmb2moo": {
      "link": "/r/ApplyingToCollege/comments/r3ebum/is_studying_physics_from_an_lac_a_good_idea/hmb2moo/",
      "text": "You will have greater access to resources (e.g. labs) and electives to choose from in bigger places. Even elite LACs depend on partnerships with R1 institutions to support their students.  They simply don’t have the in-house capacity so you have to shuttle yourself to another institution to take advantage of the options. \n\nGiven that physics is often a “service”course in LACs to meet the science general requirements, LACs have little incentive to build advanced physics programs, labs or hire lots of physics faculty in different areas. \n\nI would recommend going to a LAC only if to are truly invested and believe in the value of the liberal arts. If your passion and interest is in getting the best possible education in physics, I would recommend against them.\n\nGood luck!",
      "author": "LoopVariant",
      "created": 1638040950,
      "upvotes": 1,
      "replies": {}
    }
  }
}