{
  "sid": "qfh0zs",
  "link": "/r/ApplyingToCollege/comments/qfh0zs/ed_to_tcu/",
  "title:": "ED to TCU?",
  "text": "The title has said it all, should I apply ED to TCU? I planned to only apply ED/EA to TCU and UH, however as UH doesn't offer need-based financial aid, I'm scared that I won't be able to afford it. So I'm thinking about just applying to TCU only, then should I go ED? What if I got admitted but TCU wouldn't offer me enough the amount of financial aid that I need?",
  "author": "_beautifulnightmare_",
  "created": 1635169356,
  "updated": 1636169789,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhzh13o": {
      "link": "/r/ApplyingToCollege/comments/qfh0zs/ed_to_tcu/hhzh13o/",
      "text": "If that is your first choice school and it makes sense financially, then go for it... If their financial aid package is much lower than what the Net Price Calculator estimates, then you can back out of the commitment.",
      "author": "prsehgal",
      "created": 1635169800,
      "upvotes": 2,
      "replies": {
        "hhzpogm": {
          "link": "/r/ApplyingToCollege/comments/qfh0zs/ed_to_tcu/hhzpogm/",
          "text": ">If their financial aid package is much lower than what the Net Price Calculator estimates, then you can back out of the commitment.\n\nThis is a critical point.\n\nIn order to be released from the ED commitment, it is the SCHOOL that determines if they have met your demonstrated need; it’s not sufficient for you and your parents to simply decide “nah, it’s still too expensive.”\n\nAs u/prsehgal mentions,  you  need  to  run  the  specific  NPC  for  TCU  —  with  your  parents  at  your  side  with  their  tax  returns  and  financial statements  in  hand  —  and  make  sure  you  are  comfortable  with  that  number.    If  you  are  not  100%  comfortable  with the  amount  the  NPC  says  you  will  need  to  pay…  don’t  ED.  I’d  even  say  don’t  apply  at  all.",
          "author": "Strict-Special3607",
          "created": 1635173720,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hi19rxa": {
      "link": "/r/ApplyingToCollege/comments/qfh0zs/ed_to_tcu/hi19rxa/",
      "text": "Run your numbers through their NPC.  If you'd be happy with the number it spits out, then go ahead and ED.  If you would prefer to hold out for a possibly better number elsewhere, then don't ED.\n\nWhen you run your stuff through the NPC, document exactly what information you input and what value it spit out.  If you are admitted ED and they offer you significantly worse aid, then you will want that information when you ask them to let you out of your ED obligation.",
      "author": "jayphoward",
      "created": 1635196597,
      "upvotes": 2,
      "replies": {}
    }
  }
}