{
  "sid": "r2fhyv",
  "link": "/r/ApplyingToCollege/comments/r2fhyv/how_hard_will_colleges_look_at_middle_school/",
  "title:": "How hard will colleges look at Middle School grades on transcripts? (I promise I'm not joking)",
  "text": "I know this sounds like the long-running joke of the kid who thinks they will get rejected from Harvard because of a B in 6th grade, but I have found out recently that all of my 8th grade classes at my school are technically high school credits, and thus will be on my transcript. The issue is, I did not apply myself at all in 8th grade as I had thought it would be my last year to slack off, so I ended with an 82.3 GPA or around a 2.7 on the 4.0 scale. Since then, I have been a much more diligent student and I have a 98.2 UW GPA through my 3 years of high school. Will AOs look at these grades at all? Will they take them into consideration when recalculating GPA?",
  "author": "WelshNational",
  "created": 1637903486,
  "updated": 1638206228,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.2,
  "comments": {
    "hm4er3p": {
      "link": "/r/ApplyingToCollege/comments/r2fhyv/how_hard_will_colleges_look_at_middle_school/hm4er3p/",
      "text": "Colleges may look at them but it works to your favorite that there is a steady improvement in your performance since that year. What's your average GPA when all grades are taken into account? If it's above 3.8 you're fine. If it's above 3.6 you're okay. Even if it's 3.4 you've still got a shot at some good schools - depending on other factors.",
      "author": "LadyMjolnir",
      "created": 1637903687,
      "upvotes": 3,
      "replies": {
        "hm4fvo4": {
          "link": "/r/ApplyingToCollege/comments/r2fhyv/how_hard_will_colleges_look_at_middle_school/hm4fvo4/",
          "text": "I mean my school calculates on the 100 point scale so it would be a 94.2, which is fine but still a significant drop from a 98.2. It would just really suck because I am aiming quite high and it seems a little bit insane that the 13 year old kid that sat and played video games for 8 hours after school every day could affect my academic record that I have built up over the past 3 years at all.",
          "author": "WelshNational",
          "created": 1637904394,
          "upvotes": 1,
          "replies": {
            "hm4g69j": {
              "link": "/r/ApplyingToCollege/comments/r2fhyv/how_hard_will_colleges_look_at_middle_school/hm4g69j/",
              "text": "That does totally suck, but at 94.2 you're still a top student, plus you improved over time. I wouldn't let it worry you.",
              "author": "LadyMjolnir",
              "created": 1637904580,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hm4epsn": {
      "link": "/r/ApplyingToCollege/comments/r2fhyv/how_hard_will_colleges_look_at_middle_school/hm4epsn/",
      "text": "I’m sure they’d understand that you’re a completely different person than you were in eighth grade, and you’ve shown that with your consistently high grades for the next three years. It was 4 years ago",
      "author": "Pitsuh",
      "created": 1637903664,
      "upvotes": 2,
      "replies": {}
    },
    "hm4f89q": {
      "link": "/r/ApplyingToCollege/comments/r2fhyv/how_hard_will_colleges_look_at_middle_school/hm4f89q/",
      "text": "They don’t count grades from middle a school so it does not matter at all that they’re listed.",
      "author": "Emory2020",
      "created": 1637903980,
      "upvotes": 2,
      "replies": {}
    },
    "hm61yp7": {
      "link": "/r/ApplyingToCollege/comments/r2fhyv/how_hard_will_colleges_look_at_middle_school/hm61yp7/",
      "text": "This will not be an issue. Your performance in grades 9-12 is what matters.",
      "author": "jjhoster",
      "created": 1637943575,
      "upvotes": 1,
      "replies": {}
    }
  }
}