{
  "sid": "q9ee9z",
  "link": "/r/ApplyingToCollege/comments/q9ee9z/what_do_online_guides_mean_by_personal/",
  "title:": "What do online guides mean by personal",
  "text": "So as many of you I am a senior who is writing my essays (my personal statement in particular) and whenever I read online all the guides say “could you put another name at the top because it could be an essay written by many other students? Or is the essay personal to you so that basically yours is the only name that could be at the top?” \n\nLike wtf does this mean. Of course other students could have the same experience and write this same damn essay. I tried to be unique but literally every topic faces this same issue. Like anything personal to you I’m sure there are hundreds of others who could write about the same topic and share the same experiences.\n\nI approached this by just showing off my thinking and personality in my story but others could write the same thing and could be feeling the same. But like if someone wrote about say the Costco essay, I’m sure there are thousands who also could have their name on the top of the page and it would work. Idk can someone explain what these guides are tryna say?",
  "author": "Public-Tip6038",
  "created": 1634398720,
  "updated": 1634423241,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgvdl4g": {
      "link": "/r/ApplyingToCollege/comments/q9ee9z/what_do_online_guides_mean_by_personal/hgvdl4g/",
      "text": "They are trying to get you to write about your experiences. Admissions officers are trying to understand who you are as a person. By writing something that literally anyone could say like how managing money for NHS as treasurer made you want to major in finance. But no one else could write about that one time the club had an activity that they wanted to pursue but couldn’t then as the treasurer you worked with the money they had and fundraising to accomplish the goal. From that experience it changed their perspective on money and finance towards being a source for good. Then they learned about accounting principles implementing them into the club. All this while throwing in some quotes and an anecdote. That is a story that no one else but someone who did all of that could talk about. \n\nTry looking at this: https://blog.emoryadmission.com/2017/09/strong-personal-statements-part-2-be-proud-and-genuine/ Emory has a decent series on the personal statement and what admissions look at while reading it.",
      "author": "TritonTheCat",
      "created": 1634399320,
      "upvotes": 3,
      "replies": {
        "hgvyst8": {
          "link": "/r/ApplyingToCollege/comments/q9ee9z/what_do_online_guides_mean_by_personal/hgvyst8/",
          "text": "So being specific? I feel that both stories have the same basic principles but the second one is personal because you have the specifics. Am I right on that?",
          "author": "Public-Tip6038",
          "created": 1634408530,
          "upvotes": 1,
          "replies": {
            "hgw51iz": {
              "link": "/r/ApplyingToCollege/comments/q9ee9z/what_do_online_guides_mean_by_personal/hgw51iz/",
              "text": "Kinda it’s more so the difference between telling your story vs. a story.",
              "author": "TritonTheCat",
              "created": 1634411177,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}