{
  "sid": "r01252",
  "link": "/r/ApplyingToCollege/comments/r01252/how_do_i_transfer_to_a_csu/",
  "title:": "How do I transfer to a CSU",
  "text": "Ahh lowkey freaking out because the apps are due soon and J haven’t even started. I am my second year at my CSU and currently have a 3.8 or 3.9 gpa at my cc. I am planning on majoring in accounting and I  am hoping to get accepted at SDSU. \n\nSo basically how do or what do I need in order to transfer? I have all the pre req done by the time I will attend, do I need to complete personal essays, submit SAT scores as a transfer? Any help would be so helpful, I’m so lost on where to begin",
  "author": "Sunsetsky29",
  "created": 1637629638,
  "updated": 1639831137,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlpn0al": {
      "link": "/r/ApplyingToCollege/comments/r01252/how_do_i_transfer_to_a_csu/hlpn0al/",
      "text": "Begin by looking at the website. https://admissions.sdsu.edu/transfers",
      "author": "elkrange",
      "created": 1637629859,
      "upvotes": 1,
      "replies": {
        "hlpneza": {
          "link": "/r/ApplyingToCollege/comments/r01252/how_do_i_transfer_to_a_csu/hlpneza/",
          "text": "Does CSUs generally require personal essays? I’m not seeing anything on the website and I just wanna make sure",
          "author": "Sunsetsky29",
          "created": 1637630053,
          "upvotes": 1,
          "replies": {
            "hlpqc3s": {
              "link": "/r/ApplyingToCollege/comments/r01252/how_do_i_transfer_to_a_csu/hlpqc3s/",
              "text": "No - they are pretty stat based.  Sometimes there are bonuses for things like being a first gen student or being in their local area, but for the most part your admission depends on your current GPA (which looks very good) and how competitive admissions are for your specific major.",
              "author": "BrawnyAcolyte",
              "created": 1637631432,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hluj81i": {
      "link": "/r/ApplyingToCollege/comments/r01252/how_do_i_transfer_to_a_csu/hluj81i/",
      "text": "Most CSUs admit similar to SJSU\n\nhttps://www.sjsu.edu/admissions/impaction/\n\nYou have the grades, so it’s just a matter of looking at the department web pages for admission requirements at the schools you are interested in and figuring out if you have the classes that will boost your application and if not, maybe registering to complete them next semester or over winter break through your school or https://cvc.edu/. For more competitive majors (like nursing or CS) they’ll often have a presentation on any supplemental applications or requirements and what kinds of grades and classes you need. Accounting is a smart practical major but not too competitive. Good luck!\n\nThere is no essay and the only school that looks at extracurricular stuff is Cal Poly. It’s a pretty straightforward process.",
      "author": "RetiringTigerMom",
      "created": 1637719262,
      "upvotes": 1,
      "replies": {}
    }
  }
}