{
  "sid": "rhsbem",
  "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/",
  "title:": "Any non-resident Americans feel screwed over by the admissions system?",
  "text": "As Americans who don’t live in the US, I feel like we get a lot of the downsides and none of the upsides. We pay some of the highest tax rates in the world, sign up for the military draft, yada yada yada. We pay for infrastructure that we use MAYBE two weeks a year.\n\nA lot of people think that US citizens have it really easy in terms of applying to American colleges, but in reality it only applies to US residents, and not citizens on the whole. Non-residents literally have to go through the exact same process that intl students go through when applying to college.\n\nNot only does this ostracise us and make us feel like foreigners in our own country, it’s an astonishing lack of goodwill on the part of the government. Why is it that despite millions of dollars in taxes (that we will inevitably pay in the future, and that our parents have already paid), we aren’t treated equally as American citizens? \n\nWe have it tougher, more competitive, and MUCH more expensive than any of our counterparts who live in the US. And here’s the kicker - most of us have NO OTHER OPTION. There is simply no other country for us to go, and since EVERY country subsidises its own citizens, we are essentially rendered stateless in terms of affordable college. There are no scholarships, bursaries, athletic scholarships, no where for us to go but the lenders. \n\nI would argue that Americans who don’t live in the US have it worse than a true international student, for the simple fact that we have nowhere to go. Any international student will almost always have his or her own country that gives them access to affordable education. \n\nWe’re an afterthought for the admissions system, and we’ve been left behind by our government. It’s laughable.\n\nTl/dr: Americans who live abroad are treated like foreigners in their own country even though we contribute millions in taxes",
  "author": "SnooDoughnuts7250",
  "created": 1639666372,
  "updated": 1639786194,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.7,
  "comments": {
    "hoseloj": {
      "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hoseloj/",
      "text": ">it’s an astonishing lack of goodwill on the part of the government.\n\nWhat does the US government have to do with college admissions? They only run five colleges… and those are all free if you’d like to attend one of those.",
      "author": "Strict-Special3607",
      "created": 1639667884,
      "upvotes": 14,
      "replies": {
        "hotdr88": {
          "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hotdr88/",
          "text": "“The U.S. Department of Education spends tens of billions of dollars a year on subsidies for higher education. The bulk of the spending goes to student aid, with the balance going to grants for educational institutions. Federal Pell grants are more than $30 billion a year, federal student loans are about $100 billion a year, and grants to colleges and universities are $2.5 billion a year.”\n\n[Higher Education Subsidies](https://www.downsizinggovernment.org/education/higher-education-subsidies)\n\n[The Real Cost of College ](https://www.theatlantic.com/education/archive/2015/05/the-real-cost-of-college/393086/)\n\nIt’s really clear that half the people on this sub really have no clue what they’re even talking about. Literally takes 1 google search buddy.",
          "author": "SnooDoughnuts7250",
          "created": 1639681619,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hosd7st": {
      "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hosd7st/",
      "text": ">in reality it only applies to US residents, and not citizens on the whole. \n\nNo. In reality, US citizens living abroad are not disadvantaged in admissions with the exception of public school in-state tuition. And even that is no different from any other US citizen living a different state. And no OOS applicant should be salty about OOS tuition if they paid no taxes to the state",
      "author": "skieurope12",
      "created": 1639667305,
      "upvotes": 13,
      "replies": {
        "hotc65o": {
          "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hotc65o/",
          "text": "No. I am in a school with about 12 guys who are US citizens (passport holders). The majority of my class is Indian. The application process is the exact same - we are treated as international applicants, not domestic. We do not qualify for aid, scholarships or bursaries. I’m not an idiot - I’m literally going through the motions of US college apps right now. Why tf would I lie about this?",
          "author": "SnooDoughnuts7250",
          "created": 1639680998,
          "upvotes": -1,
          "replies": {
            "hotdwk7": {
              "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hotdwk7/",
              "text": "I didn't say you were lying, only that you are wrong. While there may be a small number of exceptions, in the cast majority of cases, US citizens living abroad are domestic applicants for admissions and financial aid purposes; they are not part of the international cap.\n\nThat said, if you have been targeting top US colleges, admissions is difficult for everyone.",
              "author": "skieurope12",
              "created": 1639681677,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hoser6z": {
      "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hoser6z/",
      "text": "You might get pissed off more if you see the internationals here getting financial aids and acceptance from the top schools  and not you LOL And to add insult to injury, they are not paying any tax LOL",
      "author": "Minimum-Artichoke-51",
      "created": 1639667947,
      "upvotes": 0,
      "replies": {
        "hotgvqm": {
          "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hotgvqm/",
          "text": "lol 🤡",
          "author": "SnooDoughnuts7250",
          "created": 1639682857,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hosdrid": {
      "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hosdrid/",
      "text": "yes, i am an american going to school abroad and it sucks that were put in the same boat as the much more cut throat and competitive international student crowd",
      "author": "HelicopterNatural",
      "created": 1639667531,
      "upvotes": 1,
      "replies": {}
    },
    "hosl3lp": {
      "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hosl3lp/",
      "text": "Just look at the borders and healthcare LOL Citizens here are not priorities LOL",
      "author": "Minimum-Artichoke-51",
      "created": 1639670499,
      "upvotes": 0,
      "replies": {}
    },
    "hosr5s8": {
      "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hosr5s8/",
      "text": "Who thinks that US Citizens have it really easy applying to American colleges?  This is your error right here.  It’s a bitch for US Citizens as well.  And for all the International students complaining about being rejected because they need aid, plenty of US Citizens are rejected for needing aid or despite paying lots of taxes earn too much to receive aid.  The whole process is a disaster.  You don’t have it worse than anyone else. You just have a different flavor of bad.",
      "author": "caaway2026",
      "created": 1639672883,
      "upvotes": 0,
      "replies": {
        "hotctey": {
          "link": "/r/ApplyingToCollege/comments/rhsbem/any_nonresident_americans_feel_screwed_over_by/hotctey/",
          "text": "Buddy, never did I say the college system was great. However, I stand by my point that it’s far worse for international students - we do not qualify for many of the scholarships that you guys do, ie national talent search, etc. \n\nI’m not trying to get into some sort of victim competition here, but we have to call a spade a spade. There are objectively far less places for international applicants, we pay more money, and we don’t qualify for the same aid. So yes, ours is a particularly nasty “flavour of bad.”",
          "author": "SnooDoughnuts7250",
          "created": 1639681252,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}