{
  "sid": "qgltj6",
  "link": "/r/ApplyingToCollege/comments/qgltj6/what_exactly_does_admitted_mean/",
  "title:": "What EXACTLY does admitted mean???",
  "text": "Soooooo on U Miami’s (Oxford) app they say “If you are admitted under an Early Decision plan, you must promptly withdraw the applications submitted to other colleges and universities and make no additional applications to any other university in any country. If you are an Early Decision candidate and are seeking financial aid, you need not withdraw other applications until you have received notification about financial aid from the admitting Early Decision institution.” meaning that if I tell the school I’m going to attend I can’t just dip and go to another school without telling them, or that I won’t accept any waitlist offers right. My mom is telling me it’s saying that if I just get accepted I have to go. I’m still going to message my counselor as well I think but if I’m gonna look stupid I’d rather look stupid on Reddit. Cheers",
  "author": "McLovens22",
  "created": 1635299658,
  "updated": 1635301540,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi735lp": {
      "link": "/r/ApplyingToCollege/comments/qgltj6/what_exactly_does_admitted_mean/hi735lp/",
      "text": "Admitted means, well, admitted... You're admitted when the university accepts you and updates the portal to reflect the same or sends you an acceptance letter... As for the terms, they're pretty typical of what Early Decision means, which is a binding decision.",
      "author": "prsehgal",
      "created": 1635300606,
      "upvotes": 1,
      "replies": {}
    },
    "hi748p2": {
      "link": "/r/ApplyingToCollege/comments/qgltj6/what_exactly_does_admitted_mean/hi748p2/",
      "text": ">My mom is telling me it’s saying that if I just get accepted I have to go\n\nAnd… she’s right!",
      "author": "Strict-Special3607",
      "created": 1635301107,
      "upvotes": 1,
      "replies": {}
    }
  }
}