{
  "sid": "q8s661",
  "link": "/r/ApplyingToCollege/comments/q8s661/are_these_prompts_similar_enough/",
  "title:": "Are these prompts similar enough?",
  "text": "Hey ppl, had a small question.\n\n&#x200B;\n\n Here are 2 prompts:                                                                                        \n\nPlease tell us something about yourself, your experiences, or activities that you believe would reflect positively on your ability to succeed at Penn State. This is your opportunity to tell us something about yourself that is not already reflected in your application or academic records. We suggest a limit of 500 words or fewer.                     \n\n&#x200B;\n\n\n\n Rice is lauded for creating a collaborative atmosphere that enhances the quality of life for all members of our campus community. The Residential College System and undergraduate life are heavily influenced by the unique life experiences and cultural tradition each student brings. What life perspectives would you contribute to the Rice community?\\*                    \n\nAre these 2 similar enough for me to use the second essay for the first prompt with some college-specific editing?",
  "author": "Disastrous-Ad-1328",
  "created": 1634315720,
  "updated": 1634331411,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgr9dgs": {
      "link": "/r/ApplyingToCollege/comments/q8s661/are_these_prompts_similar_enough/hgr9dgs/",
      "text": "So… not quite (from how I’m reading it). The first one is about how *you* will succeed. The second is how you will contribute to the community for *everyone* to succeed.\n\nIt’s a slight difference. If you are good enough at writing you can easily bridge the gap.",
      "author": "pupuphlatter",
      "created": 1634315944,
      "upvotes": 3,
      "replies": {
        "hgr9mvx": {
          "link": "/r/ApplyingToCollege/comments/q8s661/are_these_prompts_similar_enough/hgr9mvx/",
          "text": "Fair enough, thank you!",
          "author": "Disastrous-Ad-1328",
          "created": 1634316053,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}