{
  "sid": "r6120t",
  "link": "/r/ApplyingToCollege/comments/r6120t/college_say_they_havent_received_my_sat_yet/",
  "title:": "College say they haven't received my SAT yet?",
  "text": "So back in October there was that opportunity to send SAT scores for free via Collegeboard to a few schools so I sent them to two of my schools, but I checked the status checker for one of my schools and it says they haven't received my SAT score yet!!! Wtf!!! Supp materials for them are due dec 1 so I'm stressin   \nI think I clicked no receipt so I'm unsure of whether I have any confirmation but maybe i got an email one idkkkk  \n\n\nThey also say they haven't received payment but when I applied on commonapp with my credit card out it completely skipped the payment portion to the congratulations page and i was so confused... I'm willing to pay but like wtf?????? I don't see the option anywhere to.",
  "author": "JunoIsMyLove",
  "created": 1638316497,
  "updated": 1638479136,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmqf5ca": {
      "link": "/r/ApplyingToCollege/comments/r6120t/college_say_they_havent_received_my_sat_yet/hmqf5ca/",
      "text": "Check the Score Sends page in your College Board account to see if/when the scores were sent out. If you just applied to that college, it may take them a few days to match your score with your application.\n\nAs for the application fee issue, contact the admissions office.",
      "author": "prsehgal",
      "created": 1638318810,
      "upvotes": 2,
      "replies": {
        "hmqftsg": {
          "link": "/r/ApplyingToCollege/comments/r6120t/college_say_they_havent_received_my_sat_yet/hmqftsg/",
          "text": "I checked and it said \"N/A\" for date score was sent out and \"pending\". I did end up finding the email receipt for the transaction so I'll send out emails later.",
          "author": "JunoIsMyLove",
          "created": 1638319117,
          "upvotes": 2,
          "replies": {
            "hmqfzyb": {
              "link": "/r/ApplyingToCollege/comments/r6120t/college_say_they_havent_received_my_sat_yet/hmqfzyb/",
              "text": "That means the score wasn't sent out. Contact College Board to see why the delay took place.",
              "author": "prsehgal",
              "created": 1638319193,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}