{
  "sid": "r2c311",
  "link": "/r/ApplyingToCollege/comments/r2c311/need_help_regarding_film_schools_vancouver/",
  "title:": "Need help regarding film schools (Vancouver)",
  "text": "In short:\nI'll be honest here. I am from India, want to become a video editor and basically get PR and settle in Canada. Please suggest some good uni/colleges in Vancouver.\n\nIn Detail:\nI love video editing and I want to continue this as my career.\nBut the problem is that there are not any good colleges/uni here in New Delhi and even if I take online course the pay here is very low.\nI'll be graduating high school in 2022 and (most probably) will come Canada for higher studies (coz my cousin lives there). \nI know a lot of people will say that I should take some online course and it will be worth way more than any university, But the thing is I want to settle in Canada coz of lot of reasons \n(Like income equality, affordability,etc.) . So I might as well attend a college/uni related to career I want to pursue.\nBut all the colleges that I am searching for either turn out to be a scam - like or are not worth the student loan debt. \nSo, it would be really helpful if you can suggest me few colleges/uni which are worth money and maybe give work permit.\nThank you in advance!!",
  "author": "Arshjot_56096",
  "created": 1637891857,
  "updated": 1638206245,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hm4101j": {
      "link": "/r/ApplyingToCollege/comments/r2c311/need_help_regarding_film_schools_vancouver/hm4101j/",
      "text": "UBC Film School or Simon Fraser's Film in the Contemporary School of Arts are good bets. Emily Carr has a Film + Media arts program that might be good too, although I don't know much about it - they're more famous for visual arts (my sister went there for art).\n\nOther private schools like the Vancouver Film School are not worth it as they let anyone in and are absurdly expensive.",
      "author": "LadyMjolnir",
      "created": 1637895921,
      "upvotes": 2,
      "replies": {
        "hm4iram": {
          "link": "/r/ApplyingToCollege/comments/r2c311/need_help_regarding_film_schools_vancouver/hm4iram/",
          "text": "I agree with you. At first I was deciding to go to VanArts or VFS but I became suspicious when I saw their acceptance rate. And after some more research,I found out that students studying there arent very happy and say that these private schools only care about our money, etc.",
          "author": "Arshjot_56096",
          "created": 1637906225,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm3tuax": {
      "link": "/r/ApplyingToCollege/comments/r2c311/need_help_regarding_film_schools_vancouver/hm3tuax/",
      "text": "hi there! r/reversechanceme may be a better place for your post. ppl on that sub are generally more constructive and willingly to read your full academic and EC profile \nbest of luck on your college journey!!",
      "author": "the_Kleminator",
      "created": 1637892131,
      "upvotes": 1,
      "replies": {
        "hm4i1z6": {
          "link": "/r/ApplyingToCollege/comments/r2c311/need_help_regarding_film_schools_vancouver/hm4i1z6/",
          "text": "Ohh Thanks",
          "author": "Arshjot_56096",
          "created": 1637905775,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}