{
  "sid": "r4yyvp",
  "link": "/r/ApplyingToCollege/comments/r4yyvp/burnout_advice/",
  "title:": "Burnout Advice?",
  "text": "Does anyone have any advice for avoiding burnout? The time period between Thanksgiving and winter break can be super stressful and I can't help but feel like just giving up.",
  "author": "senioryearsurvival",
  "created": 1638201799,
  "updated": 1639824855,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmjux6n": {
      "link": "/r/ApplyingToCollege/comments/r4yyvp/burnout_advice/hmjux6n/",
      "text": "[deleted]",
      "author": null,
      "created": 1638205895,
      "upvotes": 10,
      "replies": {
        "hmksqva": {
          "link": "/r/ApplyingToCollege/comments/r4yyvp/burnout_advice/hmksqva/",
          "text": "Love this",
          "author": "thegoat1904",
          "created": 1638219446,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmkfjkz": {
      "link": "/r/ApplyingToCollege/comments/r4yyvp/burnout_advice/hmkfjkz/",
      "text": "My differential diagnosis here is that you have senioritis.\n\nSenioritis is a terrible disease and it can cast even the strongest students into helpless bouts of idleness and apathy.  It hits harder when preparing for life-changing news like applying to college - because who cares about Mrs. Thimblevinter's 13th physics worksheet or some meaningless final exams with all this stress and pressure?  There are several ways to deal with senioritis:\n\n  **1.  Go down in a blaze of glory.**  Just let it consume you and fall off the deep end.  Once you hit rock bottom, you'll realize you made a terrible mistake and you can start clawing your way back.  It will probably be too late, but you will also now be inoculated against ever getting it again.\n\n  **2.  Graduate.**  The summer after senior year was *made* for senioritis.  It is glorious and you'll love it.  Look forward to that finish line and focus on working harder now.  You've worked so long and so hard - it would be senseless to let it fall apart now.  It would be like giving up or resting on your laurels once you make it into the final 5 of a Fortnite Battle Royale (is this reference still cool, /r/FellowKids?).  You're so close, and victory is right there for you to grasp.  Just stick with it.\n\n  **3.  Get some real self-improvement / motivational / bootstrap stuff going**.  Read some self-help books, browse /u/AdmissionsMom's Instagram and her [blog post about this](https://admissionsmom.medium.com/the-cure-for-senioritis-9cc71d830d7b), or check out some of the myriad motivational subreddits (/r/GetMotivated, /r/GetDisciplined, /r/GetStudying, etc).  Then find some support through family/friends/teachers to stick with it.  The key to this is having other people to support you and hold you accountable.  If you hear Gollum's voice in your head saying \"But you don't have any friends,\" head on over to /r/GetMotivatedBuddies or [our own Discord server](https://discord.gg/a2c) and make some.\n\n  **4.  Take some time to reflect and organize your priorities.**  Review the grading system for each of your classes and put the work where the grade weight is.  Recognize that you are feeling lazy and that you would benefit from streamlining your responsibilities or cutting some stuff.  Delegate some tasks to other people in the groups/clubs/sports/activities you lead.  Lower your standards across many areas of life so that more areas can still be passable.  **Realize that putting in minimal effort will still provide FAR better results than no effort at all, and it isn't that much harder to do.  Pareto's 80/20 Rule applies here - 80% of the value is produced by 20% of the work - so focus on that 20%.**  Give yourself a little license to relax, take breaks, go for a jog, hang out with friends, read a book, whatever helps you unwind.  Then get back to it with renewed vigor.  \n\n  **5.  Any task you think of that can be done in 3 minutes or less needs to be done immediately.**  Any tasks that are longer than an hour need to be prioritized and broken down into steps so you can make a plan and muster the motivation to tackle them.  Schedule it out.  Ask your friends/family to help you stick to it.  Set an alarm on your phone and when it goes off, get to work again.  Do what it takes to stay organized and focus on making continuous progress, not on the size of the mountain, the proximity of the deadlines, or herculean all-nighters to catch up.  If you fail to plan, plan to fail.",
      "author": "ScholarGrade",
      "created": 1638214150,
      "upvotes": 10,
      "replies": {}
    }
  }
}