{
  "sid": "q7nj6i",
  "link": "/r/ApplyingToCollege/comments/q7nj6i/admission_officers_how_bad_does_w_withdrawal_look/",
  "title:": "Admission Officers: How bad does W (withdrawal) look on a high school transcript?",
  "text": "I am currently taking 3 courses at a state (not community) college as well as 2 AP classes, one being AP Calc. AP Calc is really not working for me. I study hours on end and I still am barely passing. I have a C in that class. I do not want a C on my transcript so I am really considering withdrawing from the class. I just hope that the W on my transcript won't affect my college admissions. For reference, I have at the top of my class with a near-perfect GPA. I have never received such bad grades and I want to drop the class not only because it will affect my GPA but also because of my mental health and anxiety surrounding that class. \n\nPlease let me know if you think this is a wise decision.",
  "author": "cakepop029",
  "created": 1634168272,
  "updated": 1634251722,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjqxdf": {
      "link": "/r/ApplyingToCollege/comments/q7nj6i/admission_officers_how_bad_does_w_withdrawal_look/hgjqxdf/",
      "text": "Commented due to having similar circumstances:\n\nI hate to be the one talking about if I will get rescinded or not, but here I am.\r  \n\r  \nI recently moved into a different school in NJ, and I am struggling with Calc 3. It is so early in the year that this should not even my focus, but will one F or D along with A's in rest of AP/honors classes senior year as a final grade be a serious concern for state colleges like Rutgers to rescind admission.\r  \n\r  \nMy unweighted GPA is around a 3.9 and I have a positive GPA trend. I will be applying EA and hope to major in chemical engineering",
      "author": "Express-Couple-3386",
      "created": 1634168419,
      "upvotes": 2,
      "replies": {
        "hgjs3d4": {
          "link": "/r/ApplyingToCollege/comments/q7nj6i/admission_officers_how_bad_does_w_withdrawal_look/hgjs3d4/",
          "text": "Also, in the extra info part on the application, definitely put information on moving schools and maybe why that affected your grade.",
          "author": "cakepop029",
          "created": 1634168972,
          "upvotes": 2,
          "replies": {
            "hgjsn8r": {
              "link": "/r/ApplyingToCollege/comments/q7nj6i/admission_officers_how_bad_does_w_withdrawal_look/hgjsn8r/",
              "text": "I am applying EA, so schools will not be seeing my senior grades only until mid year or June. My school has withdraw fail and withdraw pass, so I do not think withdrawing is an option.",
              "author": "Express-Couple-3386",
              "created": 1634169235,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgkc1jw": {
      "link": "/r/ApplyingToCollege/comments/q7nj6i/admission_officers_how_bad_does_w_withdrawal_look/hgkc1jw/",
      "text": "A Withdrawal will obviously show up, but definitely don't risk a C or a D in my opinion. As long as you maintain a rigorous course load, then you would be fine. If you are going into a hard STEM field, CS, or Engineering, then perhaps think harder on that.",
      "author": "leaf1598",
      "created": 1634178572,
      "upvotes": 1,
      "replies": {}
    }
  }
}