{
  "sid": "qnccu4",
  "link": "/r/ApplyingToCollege/comments/qnccu4/trying_to_figure_out_which_associates_degree_i/",
  "title:": "Trying to figure out which associates degree I should go for based on my major",
  "text": "Okay so I’m really confused in multiple areas. I’ve been researching a bunch of things related to getting a bachelors degree in animation. It looks to me like a BFA in animation would give me a more diverse bit of knowledge about animation specifically. Which sounds like what I want.\n\nWhile I was researching BFA’s I saw some people saying they were useless degrees which is concerning. I’ll need to find a job. From other resources I read that this BFA could get my foot in the door with many different paths including working in an art gallery or art museum. I could even pursue a masters so that I can teach animation. My main goal is to learn all of the ins and outs to animation but I need to feed myself as well.\n\nI need to go to community college before attending university for financial reasons. I need to know whether or not I should get an associate in art or an associate in fine arts.\n\nI can’t find many schools near me that offer a BFA program specializing in animation. I might be looking in the wrong places because of how inexperienced I am with all of this. If my AFA wouldn’t get my foot in the door for a BA in animation then I’d need to go for an AA. From what I can tell the AA has more math and science credits and I can’t get two associate degrees at once. I may be wrong though, that was just what I read online.\n\nI live in North Carolina. Does anyone know of any resources or any information that can help me come to a decision soon? I need to make a decision on my associates degree by December so I can enroll for the spring semester at my community college.",
  "author": "OzTheGreatPretender",
  "created": 1636122548,
  "updated": 1636135729,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}