{
  "sid": "rioh3c",
  "link": "/r/ApplyingToCollege/comments/rioh3c/do_counselorteacher_mistakes_affect_the/",
  "title:": "Do counselor/teacher mistakes affect the application?",
  "text": "Hi everyone.\n\nSo I got rejected from UPenn (was fully accepting it though and I'm not sad at all. Just read the rejection and went to bed lol). However, this made think about some stuff.\n\nMy school has absolutely no idea about how to help apply to colleges. I had to guide my teachers step by step on how to send the recommendation letters. And my \"counselor\" (who isn't really a counselor, just a lady at the office responsible to documents and stuff and she barely knows me) kept asking me me how to fill in the Common App school report and what to write and stuff. So I was wondering: If she made mistakes on the school report and I didn't know, would it affect me negatively?",
  "author": "Liby2",
  "created": 1639768088,
  "updated": 1639785458,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hoyqljc": {
      "link": "/r/ApplyingToCollege/comments/rioh3c/do_counselorteacher_mistakes_affect_the/hoyqljc/",
      "text": "Not in the way you're thinking. And my advice is not to second guess yourself or try to figure out a \"reason\" for a rejection. College admissions are about luck as much as anything else, and while it is hard to do, it's best not to dwell on the topic. You will be accepted to many fine institutions and get a world class education wherever you go. \n\nThat said, the unfortunate reality is that education in the US is highly unequal and you've experienced that in a real way. While a small error in your counselor's part of your application  certainly didn't have an impact on whether you were accepted or rejected, students at Ivy League campuses come primarily from high performing and very wealthy schools that not only have experienced counselors, but have far more resources than most young people have at their schools. An Ivy League acceptance is not an indication of a student's worth or potential, but much more about whether their family was wealthy enough to afford independent college counseling, expensive extracurriculars, or private schools that offer advanced coursework.",
      "author": "tachyonicinstability",
      "created": 1639773409,
      "upvotes": 4,
      "replies": {
        "hoyr7xm": {
          "link": "/r/ApplyingToCollege/comments/rioh3c/do_counselorteacher_mistakes_affect_the/hoyr7xm/",
          "text": "Yeah I needed to hear that, thanks. I'm an international btw, but this is still correct tbh.\n\nAnd I don't really dwell on UPenn's rejection, already expected it. Was just making sure because I applied to 10 other colleges RD.\n\nAgain thanks for taking your time to write all that C:",
          "author": "Liby2",
          "created": 1639773663,
          "upvotes": 1,
          "replies": {
            "hoyrf2p": {
              "link": "/r/ApplyingToCollege/comments/rioh3c/do_counselorteacher_mistakes_affect_the/hoyrf2p/",
              "text": "You'll be okay on the RD decisions. : ) \n\nUS universities are all - with very rare exception - excellent places to study. The Ivy League isn't the beginning or end of higher education in America.",
              "author": "tachyonicinstability",
              "created": 1639773743,
              "upvotes": 2,
              "replies": {
                "hoys9xi": {
                  "link": "/r/ApplyingToCollege/comments/rioh3c/do_counselorteacher_mistakes_affect_the/hoys9xi/",
                  "text": "Wasn't expecting at all to get into any Ivy Leagues. Just a case of \"hey they give financial aid so I'll apply and see\". I'm focusing rn on 3 non Ivies.\n\nAgain thank you C:",
                  "author": "Liby2",
                  "created": 1639774089,
                  "upvotes": 2,
                  "replies": {
                    "hoyuy9m": {
                      "link": "/r/ApplyingToCollege/comments/rioh3c/do_counselorteacher_mistakes_affect_the/hoyuy9m/",
                      "text": "Good Luck...great attitude!",
                      "author": "Radiant-Chipmunk-987",
                      "created": 1639775159,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}