{
  "sid": "q77igy",
  "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/",
  "title:": "Carnegie Mellon vs Brown",
  "text": "Hi\n\nSo I'm applying as a CS Major. I'm having trouble deciding between Brown CS and Carnegie mellon SCS for the ED round. On one hand Carnegie Mellon SCS has a stellar reputation for Computer Science. It's cognitive science and psychology electives i've heard are really amazing.And the research and number of nobel laureates in Carnegie Mellon is greater than at Brown (for CS at least). But is it true that for undergraduate programs the rankings of individual departments do not matter much? Plus all the talk on the internet about CMU stress culture has me all freaked out(I've done the application for CMU, not submitted yet). Brown on the other hand has a open curriculum and is easy going, and I like the old ivy league school prestige they have going on. But it's CS not as good as CMU.\n\nI am more interested in the hands on approach to CS and am particularly interested in AI and cognition aspect. I'm ok with stress, but i don't want it to be too much(Not the best at handling stress). I would also prefer taking a good amount of Humanities, Arts, and Sciences courses throughout my undergrad degree (CMU's breadth focus is good and Brown's open curriculum is equally good for me). In terms of social scene, I would prefer is a group of friends that I can hang out with or do something fun with over the weekend(Im an introvert). I don't want a party school.\n\nI prefer small class sizes, more individual attention from professors and tons of experiential learning opportunities like internships study abroad etc.\n\nIn terms of location, I would prefer a small town environment with decent greenery but not totally isolated from cities.\n\nPS: I've completed the Carnegie Mellon application, not started with Brown. Im just freaking out whether I might have chosen the wrong school or something and Brown might be better for me.",
  "author": "FitBarnacle1198",
  "created": 1634117580,
  "updated": 1634167059,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hggrs8l": {
      "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hggrs8l/",
      "text": "While CMU tops every CS ranking, I think Brown has a great CS program too, along with the additional benefit of their open curriculum... But if you're looking for hands on experience during your program, CMU wins hands down (no pun intended)... Having experienced the \"stress culture\" there first hand, yes, it is there for sure, but if you're able to manage your time and your tasks well, you can achieve amazing things there - and the employers all know that, and appreciate it as well... That being said, CMU doesn't give much of a boost to their ED applicants, so consider that factor when applying there.",
      "author": "prsehgal",
      "created": 1634119425,
      "upvotes": 8,
      "replies": {
        "hghidbd": {
          "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hghidbd/",
          "text": "Hi. Thank you for the advice. One of the major disadvantages of Brown for me is that it has single choice early decision, so I won't be able to apply to other schools in the early phase. I also want to be able to apply Early Action to MIT and UChicago, and Carnegie Mellon allows me to do that since it's early decision policy isnt restrictive.",
          "author": "FitBarnacle1198",
          "created": 1634134979,
          "upvotes": 1,
          "replies": {
            "hghir00": {
              "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hghir00/",
              "text": "That's actually incorrect - Brown has an ED, not an REA... So you can easily apply to other schools EA if you want to ED to Brown.",
              "author": "prsehgal",
              "created": 1634135142,
              "upvotes": 3,
              "replies": {
                "hghsroh": {
                  "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hghsroh/",
                  "text": "Oh. I did not know that, thanks for correcting me. But from what I have gathered in the comments, CMU seems to better for CS than Brown in almost all aspects. The only thing that I see Brown has the advantage in is in the open curriculum and the location (I personally love the foliage rich campus). Also, I am not completely sure, but from what I've checked on the Internet the ED rates for CMU are 18% in the regular round and 25% in the Early Decision Round (of course SCS will have far lower acceptance rates) and for Brown the acceptance rate is 8% in Regular and 18% in Early Round (CS should have lower admit rates because CS is competitive everywhere), so I don't see any drastic boost that Brown offers.",
                  "author": "FitBarnacle1198",
                  "created": 1634139242,
                  "upvotes": 1,
                  "replies": {
                    "hght7ce": {
                      "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hght7ce/",
                      "text": "I would say that Brown still gives a little boost to ED applicants, but CMU is known to not give any ED boost at all, so decide accordingly.",
                      "author": "prsehgal",
                      "created": 1634139419,
                      "upvotes": 1,
                      "replies": {
                        "hghtu97": {
                          "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hghtu97/",
                          "text": "Oh Ok. I'm not sure how big of an advantage that would be for me though. Because I'm an Indian International Male applying for CS. As it is, it is really competitive for me",
                          "author": "FitBarnacle1198",
                          "created": 1634139681,
                          "upvotes": 1,
                          "replies": {
                            "hghvcrr": {
                              "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hghvcrr/",
                              "text": "In case you're looking for aid, I would skip CMU since they don't offer aid to international students.",
                              "author": "prsehgal",
                              "created": 1634140296,
                              "upvotes": 2,
                              "replies": {
                                "hghw00z": {
                                  "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hghw00z/",
                                  "text": "I'm not looking for aid. But thanks anyways.",
                                  "author": "FitBarnacle1198",
                                  "created": 1634140566,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hggsj54": {
      "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hggsj54/",
      "text": "Both of them are going to get you where you want to be for internships and new grad positions:\n\nCMU might have superior recruiting because it's CMU but Brown being an Ivy is elite enough to get interest from recruiters, from which point on it's OA and technical interview performance which gets you the offers. This is more dependent on your Leetcode grinding than school name.\n\nI go to a school with a barely T50 CS program and avg engineering overall but we still have FAANG internship offers and FT positions rolling in like no one's business, Brown's CS program is T20 and the school carries generally higher regard in comparison so 100% can't be worse w.r.t outcomes\n\nIn terms of stress levels and competition, they’re both top schools with top students so expect the environment to be hectic; top students retain or impose high self-standards and will work to meet them. I’d give the edge to Brown if only because of grade inflation + you can S/NC your classes and make the academic exp as tough or easy as you want\n\nCMU would probably win if you're thinking about graduate school for an MS or PhD. School name inherently isn't a big factor but the professors you do research under definitely are and their arsenal of high-impact contributions, recognition & connections definitely won't hurt. The overrepresentation of T5 universities and top CS programs in top PhD programs is real for a reason. It is an easy guess which school wins here\n\nThe main thing which swings me towards Brown is the fact that CMU SCS is stupidly hard to. No one from my high school has ever gotten a direct admit into CMU for CS, including people who eventually committed to UC Berkeley, CalTech or MIT. It could be a waste of an ED to throw it at CMU and then face harsher odds RD for Brown and potentially not get into either",
      "author": "MundyyyT",
      "created": 1634120044,
      "upvotes": 5,
      "replies": {
        "hghrhf0": {
          "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hghrhf0/",
          "text": "I think of the main reasons (correct me if I'm wrong) is a very heavy reliance on standardized test scores and academics. For example if you see the average SAT scores for SCS they are from 1570-1600. I personally have a 1580 and have been at the top of my class throughout high school. So I'm at least hoping that I have a decent chance at CMU.",
          "author": "FitBarnacle1198",
          "created": 1634138717,
          "upvotes": 1,
          "replies": {
            "hgitc1z": {
              "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hgitc1z/",
              "text": "I don't think that's a good metric\n\nThere's no way any of the admits had bad extracurriculars, so them _still_ being able to whittle it down to just people with uber test scores and grades honestly tells me even more about how difficult it is to get in",
              "author": "MundyyyT",
              "created": 1634153901,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hghh6ip": {
      "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hghh6ip/",
      "text": "I think anyone saying \"undergrad school does not matter\" for CS or engineering has never been through internship and job recruiting. It *absolutely* matters because many firms -- especially those which are more on the cutting-edge -- only recruit at top engineering and CS schools. Your internship influences the permanent offers you get. I've also seen the same from the recruiting side when I helped recruit undergrads.\n\nYou'll get firms recruiting at Brown; but, will they be the same caliber of firms as at CMU? Not usually.  A look at [Brown's industry partners](https://cs.brown.edu/about/partners/partners/) should make that clear: good firms but not the next Google. A look at the [CMU SCS-ECE careers site](https://www.cs.cmu.edu/career-center-events/archive) will show you what kind of firms recruit there.\n\nEdit: CMU SCS-ECE careers site link did not get added before; fixed.",
      "author": "minimuminfeasibility",
      "created": 1634134465,
      "upvotes": 4,
      "replies": {}
    },
    "hggq0sv": {
      "link": "/r/ApplyingToCollege/comments/q77igy/carnegie_mellon_vs_brown/hggq0sv/",
      "text": "Imho, the environment and the people are just as important as the curriculum. If you aren’t comfortable or find the environment hard to handle then it will certainly affect your ability to thrive and learn.\n\nIf you can visit the schools, do so. If not, try to get online with student-led presentations to ask these questions and get a better sense.",
      "author": "pupuphlatter",
      "created": 1634117878,
      "upvotes": 2,
      "replies": {}
    }
  }
}