{
  "sid": "q9yuc6",
  "link": "/r/ApplyingToCollege/comments/q9yuc6/anyone_else_concerned_by_the_appalling_drop_in/",
  "title:": "Anyone else concerned by the appalling drop in acceptance rate for ED schools??",
  "text": "Data in question: https://ingeniusprep.com/blog/early-decision-acceptance-rates-2020-2021/\n\nIf you look at the table they gave, almost all top schools lowered their ED acceptance rate significantly. What startled me the most was Hopkins going from 28% to 19%. One of the main advantages of applying ED is the increased acceptance rate, but even that seems to be slowly going away 😭",
  "author": "SecondOpossum",
  "created": 1634477694,
  "updated": 1634654143,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hgzewu1": {
      "link": "/r/ApplyingToCollege/comments/q9yuc6/anyone_else_concerned_by_the_appalling_drop_in/hgzewu1/",
      "text": "Did they accept the same amount of students or similar range from previous years?  If yes, I wouldn’t worry about. Likely they saw increased applications due to test optional.",
      "author": "TwoSuns168",
      "created": 1634478214,
      "upvotes": 3,
      "replies": {}
    },
    "hgzgt2x": {
      "link": "/r/ApplyingToCollege/comments/q9yuc6/anyone_else_concerned_by_the_appalling_drop_in/hgzgt2x/",
      "text": ">almost all top schools lowered their ED acceptance rate significantly.\n\nNo, they didn’t.\n\nThey received thousands of extra applications vs previous years.\n\n&#x200B;\n\n>What startled me the most was Hopkins going from 28% to 19%.\n\nDo you believe that JHU accepts lesser-qualified applicants during the ED round?",
      "author": "Strict-Special3607",
      "created": 1634479171,
      "upvotes": 3,
      "replies": {}
    },
    "hgzfys9": {
      "link": "/r/ApplyingToCollege/comments/q9yuc6/anyone_else_concerned_by_the_appalling_drop_in/hgzfys9/",
      "text": "Remember, last year was test optional almost everywhere due to COVID test date cancelations. There is no question that is the reason for the increase in app numbers and corresponding decrease in acceptance rates at highly selective schools.\n\nI would expect similar this year, simply because most schools are still test optional.\n\nOn the bright side, it seems likely there will be fewer deferred acceptances for schools to account for in their enrollment numbers, a little more room in the class than last year's seniors were given.",
      "author": "elkrange",
      "created": 1634478748,
      "upvotes": 1,
      "replies": {}
    },
    "hgzgn07": {
      "link": "/r/ApplyingToCollege/comments/q9yuc6/anyone_else_concerned_by_the_appalling_drop_in/hgzgn07/",
      "text": "It's almost like you shouldn't apply ED and obligate yourself to attend a single school....",
      "author": "jayphoward",
      "created": 1634479085,
      "upvotes": 1,
      "replies": {}
    },
    "hh1nhjx": {
      "link": "/r/ApplyingToCollege/comments/q9yuc6/anyone_else_concerned_by_the_appalling_drop_in/hh1nhjx/",
      "text": "No.\n\nIt means they’ve been effective at marketing and convincing more students to pay the fee to apply.\n\nStanford is making news with their “historically low” acceptance rate, while they actually accepted 7% more students than last year.",
      "author": "RichInPitt",
      "created": 1634513234,
      "upvotes": 1,
      "replies": {}
    }
  }
}