{
  "sid": "qzoj0k",
  "link": "/r/ApplyingToCollege/comments/qzoj0k/intl_student_need_help_for_ap_exams_please_advice/",
  "title:": "Intl. Student, need Help for AP exams, please advice?",
  "text": "I am an Indian International  Student and I would like to take AP exams (my college doesn't offer one) as well as my state exam. So my reach school is Wharton ,Stern, Stanford, Columbia, Sloan and if I go crazy Harvard(not coz I can't get in But cause it's heavy focus on pure eco, I would something more business, Entrepreneurship oriented). So how many APs should I take. Also please share timeline, I am a Class Of 27 Prospective student. Also can there be any reduction in price for non-americans?",
  "author": "InvictusHomo",
  "created": 1637596443,
  "updated": 1637687704,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlnj877": {
      "link": "/r/ApplyingToCollege/comments/qzoj0k/intl_student_need_help_for_ap_exams_please_advice/hlnj877/",
      "text": ">can there be any reduction in price for non-americans?\n\nNo.\n\nNo US college expects AP scores if your school does not offer the course.",
      "author": "skieurope12",
      "created": 1637598132,
      "upvotes": 3,
      "replies": {
        "hlnl4i0": {
          "link": "/r/ApplyingToCollege/comments/qzoj0k/intl_student_need_help_for_ap_exams_please_advice/hlnl4i0/",
          "text": "Ik but my state exam is a joke, my younger sister in IGCSE is studying almost same as me, except math. So if schools  knows what it is, they may not take it serious consideration",
          "author": "InvictusHomo",
          "created": 1637598905,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hloxixd": {
      "link": "/r/ApplyingToCollege/comments/qzoj0k/intl_student_need_help_for_ap_exams_please_advice/hloxixd/",
      "text": "Why do you want to take AP tests if you haven’t taken the course?   \n\n\nAre you thinking this will help with US college admissions?",
      "author": "RichInPitt",
      "created": 1637618305,
      "upvotes": 1,
      "replies": {
        "hlqbus5": {
          "link": "/r/ApplyingToCollege/comments/qzoj0k/intl_student_need_help_for_ap_exams_please_advice/hlqbus5/",
          "text": "Kinda, cause my 11th and 12th college, though reputable, teaches State board, which is frankly a joke. I am pretty sure I can cope up with AP, I am Taking SATs without teachers guidance too. Also I am going through IB curriculum, which is way more rigorous, so I can cope up",
          "author": "InvictusHomo",
          "created": 1637641873,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}