{
  "sid": "qscn0m",
  "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/",
  "title:": "Why do strong candidates on this sub set their standards so low?",
  "text": "I've seen countless people on this subreddit and on r/chanceme with awesome stats and really distinctive ECs (publications etc.) applying at most to second-tier schools (UNC, NYU, and sometimes lower). Comments are usually harsh too. Why? Is it really that competitive or are people just undermining themselves?\n\nEdit: Let me clarify, there are incredible schools that are not considered T20, but there are applicants who (I believe) are very much qualified for T20s who don't apply. I wanted to know why- that's it.\n\n&#x200B;",
  "author": "nNutritious",
  "created": 1636728191,
  "updated": 1637364402,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.28,
  "comments": {
    "hkca3ac": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkca3ac/",
      "text": ">applying at most to second-tier schools (UNC, NYU, and sometimes lower)\n\nOh heavens, lower than *second tier schools* like NYU and UNC? \n\nIn all seriousness though, girlypop, you need a reality check",
      "author": "freeport_aidan",
      "created": 1636730308,
      "upvotes": 22,
      "replies": {
        "hkcdk9g": {
          "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkcdk9g/",
          "text": "wasn't saying those aren't great schools (they are), I was just wondering why these applicants weren't shooting their shot at higher ranking schools",
          "author": "nNutritious",
          "created": 1636731753,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "hkc5kr6": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkc5kr6/",
      "text": "Cost.  Not everybody wants to spend $300k on a bachelor's degree.  Though, that doesn't work in the case of NYU.\n\nAlternately, they may be applying to those schools as targets while also applying to more selective options as reaches.",
      "author": "jayphoward",
      "created": 1636728341,
      "upvotes": 11,
      "replies": {}
    },
    "hkc5vpv": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkc5vpv/",
      "text": "Generally cost. Here’s an example:\n\nFor someone with a 1500 SAT and a 4.2 GPA, whose parents make $200k a year, is it worth it to pay $70,000-$80,000 a year to attend a T20 over a T40-T100 for maybe $40,000 with strong programs?",
      "author": "toyota2003",
      "created": 1636728478,
      "upvotes": 9,
      "replies": {
        "hkcha7f": {
          "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkcha7f/",
          "text": "At that point just get paid $2,000 a year to go to Alabama",
          "author": "ssssseabass",
          "created": 1636733274,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hkc745g": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkc745g/",
      "text": "First of all, even with super stats (assuming all are true), nothing is guaranteed at MIT, Stanford levels. In your essay, you might come out as arrogant. Or have one stat that college cannot verify or believe. Irrespective, one needs to have reaches, targets and safeties.",
      "author": "svday",
      "created": 1636729013,
      "upvotes": 6,
      "replies": {}
    },
    "hkcaac1": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkcaac1/",
      "text": "You can pretty much do the same stuff at those “second-tier schools” that you can at a school you’d probably consider “first-tier.” So people with good achievements like applying to them for a slightly better chance at admission, better fit, and maybe a lower cost.",
      "author": "Lil-pants",
      "created": 1636730391,
      "upvotes": 2,
      "replies": {}
    },
    "hkcazjw": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkcazjw/",
      "text": "Ignoring the fact that there are no “tiers” for a moment (those are social constructs), the reasons vary. \n\nTop (USNWR ranked) schools are not always the best choice for everyone. For some, it may be the price, others, the culture surrounding the schools or other intrinsic factors. For many students, there are better universities out there than just blanket applying to those on top of an arbitrary list.",
      "author": "the_Q_spice",
      "created": 1636730686,
      "upvotes": 2,
      "replies": {}
    },
    "hkcgn3k": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkcgn3k/",
      "text": "If you like a school, who cares what it's rank is?\n\nAlso NYU & UNC are very much so top-tier",
      "author": "ssssseabass",
      "created": 1636733011,
      "upvotes": 2,
      "replies": {}
    },
    "hkcgmmw": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkcgmmw/",
      "text": "Yeah, I agree with the other commenters.  \n\nI think the vastly healthier question is:  \n\n*\"Why is everyone killing themselves to stretch so far to the farthest reach institutions instead of aligning themselves with more solid fit institutions, who might offer more FinAid & even Merit Aid?\"*  \n\n\nPeople are applying Binding-ED to mega-reach schools that they are praying they receive piles and piles of aid for, but that isn't how ED is intended to be used.  \n\n\nThe \"T50-or-die\" phenomenon needs to just go away.  \n\nWe need to be more supportive of Community Colleges and our respective in-state Public University networks.  \n\n\nThe fallacy that attending a T50 will **promise or guarantee** better-paying employment needs to end.  \n\nThere might be opportunity, but There is no promise. There is no guarantee.",
      "author": "VA_Network_Nerd",
      "created": 1636733005,
      "upvotes": 1,
      "replies": {
        "hkciln2": {
          "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkciln2/",
          "text": "but don't the statistics demonstrate otherwise? I know there are plenty of other factors for why students at top schools succeed, but it makes sense when you think of it. Put the wealthiest and/or highest achieving students in an institution with lots of funding from successful alumni and you have the perfect breeding ground for good work opportunities. Plus, there are internships that are only offered to students attending top schools.",
          "author": "nNutritious",
          "created": 1636733813,
          "upvotes": 1,
          "replies": {
            "hkclkwl": {
              "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkclkwl/",
              "text": "> but don't the statistics demonstrate otherwise?  \n\nThe statistics indicate that opportunities to access higher salaries exist at higher-ranked schools, but there is no guarantee that an individual student will access them.  \n\n> I know there are plenty of other factors for why students at top schools succeed, but it makes sense when you think of it.  \n\nThis is a very important sentence, and it holds the key to the point I am trying to make.  \n\n> Put the wealthiest and/or highest achieving students in an institution with lots of funding from successful alumni and you have the perfect breeding ground for good work opportunities.  \n\nI agree with the general idea that top-tier schools can offer higher-quality career opportunities for graduates, than a lower-tier institution can.  \n\nBut you need to consider who is going to actually access those opportunities.  \n\nThe recruiters at Princeton have better opportunities to offer than the recruiters at a nice, average second-tier State University have to offer.  \n\nConsider who those recruiters are looking for.  \n\nSmart as hell. Aggressive. Outgoing. Locked-on. Informed. Personable. Rock-Stars.  \n\nWe have threads here in A2C where people are asking for career guidance on what degree or job to take with soul-crushing introversion so bad they can't talk to a Professor.  \n\nRespectfully, and meaning no hate or ill-will, but you can be smart as hell, and savagely destroy your standardized tests, and write a majestic and glorious essay, but if you can't sell yourself to a recruiter in sixty seconds, you're not going to be offered that glorious job opportunity that you are dreaming about.  \n\n\nPeople latch on to the fantasy or narrative that \"If I can just get into <PrestegiousU>, I'll be set for life.\" and it's just an incomplete view of the recruiting process.  \n\nNobody wants to think of themselves as average.  \nNobody wants to be told they are average or not-exceptional.  \n\nBut there is no guarantee that you will receive an especially high-paying job-offer just because you attend a higher-tier university.  \n\nThe opportunities are probably there. But that doesn't guarantee you will be handed one of them.  \n\nEmployers have to pay the university to attend a career fair, or otherwise recruit from a graduating class.  \n\nBetter universities charge more money for access to their pool of graduates.  \n\nIf a high-end employer paid top-dollar for the ability to recruit, they aren't looking for average applicants - they came looking for exceptional applicants.  \n\nSo...  \n\nIf you reach and stretch and claw your way into a top-tier university, you might find the academic workload so challenging you have difficulty maintaining the 3.5+ overall GPA the recruiters want to see.  \n\nMeanwhile, you could have been at your State's Flagship University, in the Honors College, on a 90% Scholarship, with an academic workload that is better aligned to your capabilities where you are maintaining that 3.5+ overall GPA...",
              "author": "VA_Network_Nerd",
              "created": 1636735009,
              "upvotes": 1,
              "replies": {
                "hkdm1n2": {
                  "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkdm1n2/",
                  "text": "> The statistics indicate that opportunities to access higher salaries exist at higher-ranked schools, but there is no guarantee that an individual student will access them.\n\nIt's not even that strong. We've seen plenty examples where schools that are lower ranked by US News still have better employment outcomes than higher ranked schools. \n\nAnd it's been well-documented that the most influential thing on your salary isn't the specific college you go to but what you study. The average flagship CS major is going to make more than the average English major from Harvard.",
                  "author": "doneanddead",
                  "created": 1636750190,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkdlkmx": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkdlkmx/",
      "text": "Wow ouch lol. \n\nWell to start off with, T20 is an arbitrary term and in many other rankings, schools that are not \"T20\" by US News rankings are T20 by other metrics. I've long criticised US News for not considering employment numbers given that they're basically the #1 reason why people go to college today and schools like Michigan, UVA, NYU, etc. sometimes have comparable if not much stronger employment numbers than \"T20s.\" My go to [example for this is](https://www.topuniversities.com/university-rankings/usa-rankings/2021) how if you look at the employment metrics, berkeley, UCLA and NYU rank 8th, 9th, and 10th respectively according to QS (and Michigan, USC and GA Tech are all T20 for employment). I've referenced this on the sub before but if you look at actual employment reports, a lot of T20s fall behind supposedly non T20s. Especially if you have a specific discipline in mind (for example, UIUC and Georgia Tech do really well in CS vs. many T20s.). Let me give you a more concrete example: [NYU 2019 career survey](https://www.nyu.edu/content/dam/nyu/wasserman/documents/LBTS%202019%20Final_Updated%204.13.20.pdf), [NYU 2020 career survey](https://www.nyu.edu/content/dam/nyu/wasserman/documents/LBTS%202020%20UG%20Summary%20Report%20Final_4.27.21.pdf), [Northwestern 2020 career survey](https://www.northwestern.edu/careers/images/beyond-northwestern-2020.pdf), [Notre Dame 2019 career survey](https://undergradcareers.nd.edu/assets/351131/fd_19_public_report.pdf). ND only has 2019 and NU only has 2020 so I wanted to offer comparison points. \n\nLet's compare ND and NYU first:\n\nFor CAL vs. CAS, ND is at $55k while NYU is at $59k (ND's college of science is at $60k). For business, ND is at $70.6k while NYU is at $75.8k. For engineering, ND is at $72k while NYU is at $80.6k. Now, there are some factors to consider like these not being perfect comparisons (NYU has many other schools which are probably grouped under the CAL/CoS for ND) but engineering and business are pretty clear comparisons. And while there is also going to be a difference in compensation due to location, it still does a good job of highlighting how a T20 doesn't necessarily make a school a better option career wise. \n\nNow let's look at NU vs. NYU:\n\nFor CAS, NU is at $62.8k while NYU is at $62.6k. For engineering, NU is at $79.2k while NYU is at $79.5k (yeah, not sure why engineering went down). The other schools don't have good comparisons since NYU and NU have very different ways of grouping majors. (Comm, music, journalism, and education is all literally under Steinhardt at NYU.) This again shows where parallels are hard to draw. NU's CAS numbers are going to be inflated because econ majors that would study finance at NYU and go into banking are now included under CAS numbers. In any case, you can again see that the comparisons are very much there. There is not a world of difference between where NYU and NU grads end up (location being the biggest difference if anything) and the overlap is clearly going to be there. \n\nYou can do this comparison as well with other schools. Berkeley's numbers are super impressive and it goes to show why Berkeley has an outsized reputation outside of America (if you think NYU's numbers are surprising, Berkeley does significantly better IIRC esp. for stem disciplines.) I hope it has clearly made my point though. \n\nIf you're going to school because you want to have a good career, choosing between schools like NYU and Berkeley and NU on the basis of one side being clearly better for professional careers would be foolish. \n\n****\n\nNow to other points:\n\n\nSecondly, in terms of actual opportunities, \"non T-20\" schools often have identical if not better opportunities. If you're interested in finance, NYU beats out half of the T20 (as do Michigan, UVA, Berkeley, and other T30s like CMU still outperform many \"T20s\"). If you're interested in CS, from a career standpoint, you would have to be dumb to choose something like Northwestern CS over CMU CS even though the former is an Ivy+ school and a regular T10. There is the exception that for very few career paths, Ivy prestige is a legitimate thing (PE/Buy-side recruiting really loves Ivy prestige and schools like Berkeley and NYU tend to do poorly comparatively even though their sell-side recruiting is competitive.) But we're talking about something like 2-4% of the student body max. And that's Ivy prestige, a student at Vanderbilt or Rice would likely not see such benefits even though they're T20s. \n\nThird, there are plenty of amazing people at these schools you're calling second tier. Any of these schools have produced world class scholars and industry elites and if you can't succeed at a place like UNC, you should probably do some introspection rather than blaming the school for your failure. I've met people who've made me question if I belong at my school (I've also met the opposite but that ties into the point-- there are all sorts of people no matter where you go, both far more qualified and less qualified than you, whether that's Harvard or your local state flagship.) Kids at the Ivies or HYPSM aren't fundamentally unique or different. I don't know as much about UNC, but if you want to work with a particular scholar or learn about a particular field early on, NYU has specialties in many departments that make it top tier (philosophy is a good example, where NYU has long been considered one of the top philosophy programs in America.) \n\nFourth, financial opportunities. Many of the kids with these distinctive ECs (publications particularly tends to be an upper middle class + activity because how else are you going to have those connections by high school?) come from upper middle class backgrounds which means schools like the Ivies will not grant financial aid, in which case top tier flagships like UNC are much more economical. Anyone trying to justify going to harvard full-price vs. Berkeley/UNC/UCLA/etc. at in-state tuition is fooling themselves if they're trying to claim that it's a financial benefit. That doesn't mean it's a bad choice (I would make the choice of Harvard over the latter) but it's certainly not a \"financially optimal\" decision. I would make that decision because I'm fortunate enough to be able to afford splurging on a luxury branded education.",
      "author": "doneanddead",
      "created": 1636749990,
      "upvotes": 5,
      "replies": {}
    },
    "hkdxirb": {
      "link": "/r/ApplyingToCollege/comments/qscn0m/why_do_strong_candidates_on_this_sub_set_their/hkdxirb/",
      "text": "It’s literally impossible to get into T10s. These schools are getting 45,000 applications plus and there are not many spots.",
      "author": "bergenplace189",
      "created": 1636755203,
      "upvotes": 3,
      "replies": {}
    }
  }
}