{
  "sid": "q64a0v",
  "link": "/r/ApplyingToCollege/comments/q64a0v/when_do_dukeed_interviews_happen/",
  "title:": "When do Duke(ED) interviews happen?",
  "text": "Title.",
  "author": "Beginning_Antelope_9",
  "created": 1633982210,
  "updated": 1634575551,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hg9rvn9": {
      "link": "/r/ApplyingToCollege/comments/q64a0v/when_do_dukeed_interviews_happen/hg9rvn9/",
      "text": "\"INTERVIEWS  \nAlumni interviews are an optional component of the Duke application process. After applying, students are matched with alumni volunteers on a first-come, first-served basis if an alumni interviewing committee is present in their area. Students who wish to interview must submit their application by the Early Decision deadline (November 1) or the Regular Decision priority interview deadline (December 20). An alumni interviewing committee member will contact you via phone or email to arrange an interview.  \nFor the 2021-2022 admissions cycle, alumni volunteers will conduct virtual one-on-one interviews. Students may expect the interview to last 30–60 minutes.  \nWe do not offer on-campus interviews with admissions officers.  \nBecause of the high volume of applicants we receive from China, Duke will accept admissions interviews from InitialView for students attending school in China. These interviews will serve in lieu of alumni interviews. We encourage interested students to arrange an interview with InitialView as soon as possible in order to secure an appointment. All interviews must be submitted by December 1 for Early Decision and March 1 for Regular Decision.",
      "author": "Radiant-Chipmunk-987",
      "created": 1633984088,
      "upvotes": 2,
      "replies": {
        "hgbu598": {
          "link": "/r/ApplyingToCollege/comments/q64a0v/when_do_dukeed_interviews_happen/hgbu598/",
          "text": "thanks",
          "author": "Beginning_Antelope_9",
          "created": 1634022817,
          "upvotes": 1,
          "replies": {
            "hgewdgb": {
              "link": "/r/ApplyingToCollege/comments/q64a0v/when_do_dukeed_interviews_happen/hgewdgb/",
              "text": "You are welcome. Sorry I didn't have time to shorten that, so I just went with the copy/paste thing.",
              "author": "Radiant-Chipmunk-987",
              "created": 1634078833,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}