{
  "sid": "q4oowp",
  "link": "/r/ApplyingToCollege/comments/q4oowp/high_pay_healthcare_job_without_the_schooling/",
  "title:": "High pay healthcare job without the schooling?",
  "text": " Hello my fellow healthcare workers/students. Ive just been accepted into college for math but found that I dont want to be stuck in the math field. Ive always been an individual who loves sports and i want to stay in that field. Ive looked at being a nutritionist but have been told the pay is not worth it. Along with looking into being a PT, but people saying that the amount of schooling is not worth it. As I agree. So does anyone have any jobs that im not thinking of that might satisfy my hobby of sports and medicine but still pay well. Ive also looked at medical tech which seems to pay well without all the schooling. Any suggestions would be greatly appreciated :)",
  "author": "gabebiagioni",
  "created": 1633796963,
  "updated": 1634074115,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfzxuzy": {
      "link": "/r/ApplyingToCollege/comments/q4oowp/high_pay_healthcare_job_without_the_schooling/hfzxuzy/",
      "text": "[https://www.bls.gov/ooh/healthcare/home.htm](https://www.bls.gov/ooh/healthcare/home.htm)\n\nThat could give you some ideas - it definitely depends on what you consider high paying and a lot of schooling.  Keep in mind those are national averages - nursing pay is a lot higher in California than it is in Missouri.",
      "author": "BrawnyAcolyte",
      "created": 1633797531,
      "upvotes": 2,
      "replies": {
        "hg06sh0": {
          "link": "/r/ApplyingToCollege/comments/q4oowp/high_pay_healthcare_job_without_the_schooling/hg06sh0/",
          "text": "Thank you for the site!!! It definitely brings out more options in healthcare jobs",
          "author": "gabebiagioni",
          "created": 1633801450,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg04jnv": {
      "link": "/r/ApplyingToCollege/comments/q4oowp/high_pay_healthcare_job_without_the_schooling/hg04jnv/",
      "text": "Sonographers and nurses are probably the highest earners without a strict medical school education but they both require 2-4 years usually. Sonographers make 50-100k and nurses average around 75k (in the US). For nursing it’s highly dependent on what type of nurse you become tho",
      "author": "BumblebeeOdd2924",
      "created": 1633800476,
      "upvotes": 1,
      "replies": {
        "hg06mq6": {
          "link": "/r/ApplyingToCollege/comments/q4oowp/high_pay_healthcare_job_without_the_schooling/hg06mq6/",
          "text": "Ive heard that nurse anesthesiologist make a ton but i think it requires more schooling. But can defiantly work my way up if I were to become one.",
          "author": "gabebiagioni",
          "created": 1633801380,
          "upvotes": 2,
          "replies": {
            "hg0r160": {
              "link": "/r/ApplyingToCollege/comments/q4oowp/high_pay_healthcare_job_without_the_schooling/hg0r160/",
              "text": "Yup nurse anesthetists can make a LOT of money but I think it’s usually doctoral-level education—but I wouldn’t shy away because of that because nursing makes a lot of money (especially if you’re an RN) and you can still work while you get more education",
              "author": "BumblebeeOdd2924",
              "created": 1633810467,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}