{
  "sid": "qrzo56",
  "link": "/r/ApplyingToCollege/comments/qrzo56/i_am_a_latino_boy_from_texas_wondering_what_i_can/",
  "title:": "I am a Latino boy from Texas wondering what I can do to better qualify for merit based scholarships",
  "text": "I am a Latino boy that lives in Texas, and I an a junior this year. By the time I graduate high school, I will have been on the varsity tennis team for 4 years, in three UIL academic events (Ready Writing, Headline Writing, and Copy Editing) for two years, NHS for two years, and band for one year. I have a 5.2 GPA and I am 7th in my class of 284 students. I would like to apply to UT Austin, Texas State, Texas A&M, and Rice. What chance do I currently have of receiving any merit based scholarships, and what can I do to improve my odds? (I do not qualify for pell grants or any financial aide).",
  "author": "Tgore49",
  "created": 1636678850,
  "updated": 1636745328,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hka6gfg": {
      "link": "/r/ApplyingToCollege/comments/qrzo56/i_am_a_latino_boy_from_texas_wondering_what_i_can/hka6gfg/",
      "text": "If you do well on the PSAT, TAMU will give u a lot more merit $ than UT.  \n\nUT has some other scholarships based on things like if you are a decendant of a veteran or even a WW2 vet but you would need to look up specific scholarships at UT for all the different merit scholarships bc some are very specific.   Some South Texas cities have their own scholarships for UT w Texas Exes.  \n\nMany of the scholarships look for leadership roles and volunteer hours so maybe spend some time on these things over the next year or so.  Good luck!",
      "author": "5gators",
      "created": 1636683790,
      "upvotes": 3,
      "replies": {}
    },
    "hk9ytdu": {
      "link": "/r/ApplyingToCollege/comments/qrzo56/i_am_a_latino_boy_from_texas_wondering_what_i_can/hk9ytdu/",
      "text": "If you're an auto-admit to UT and aren't targeting a competitive major, and if you can afford it, then you may not need to apply to Texas State and A&M.  Unless you're prioritizing cost, in which case both of those are likely to give you more $ than UT-Austin.\n\nIn terms of what you can do as a Junior:  keep your grades high, do as well as possible on the SAT or ACT, maybe try to take on some leadership positions.\n\nIf you'd consider leaving the state, there are several schools with large scholarships that are restricted to under-represented minorities.  Might have a shot at one of those.  Though, they often also have financial need as a requirement.  (Not always.)",
      "author": "jayphoward",
      "created": 1636680239,
      "upvotes": 1,
      "replies": {}
    }
  }
}