{
  "sid": "qp13qw",
  "link": "/r/ApplyingToCollege/comments/qp13qw/how_important_is_the_name_these_days/",
  "title:": "How important is the name these days?",
  "text": "I am increasingly of the belief that it makes more sense to go to a college where one can get practical skills in the area that they are interested in having a career rather than going farther away and/or paying much more for an education from a big-name university.\n\nI would be curious to hear from parents of recent grads who are now working or recent grads who are now working to figure out what the current climate is. Is there significant value in getting an education from a splashy name? Is there substantial value in developing a network at a prestigious university? Or are we now living in a more decentralized society where what matters most are a person’s character, skills and merit?",
  "author": "BK2021",
  "created": 1636328982,
  "updated": 1636654032,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 1.0,
  "comments": {
    "hjquixo": {
      "link": "/r/ApplyingToCollege/comments/qp13qw/how_important_is_the_name_these_days/hjquixo/",
      "text": "You and I are very alike in the way we think. For the majority of my high school career, I thought that attending a prestigious, well known institution would serve as proof that the extreme effort I put in over the past few years was worth it. All those sleepless nights and days of studying and extra help sessions, all worth it.\n\nBut as I’ve made my way through the college application process, I’ve come to see that not only would it not make any sense for me to drop $320k on an education I could get for $20k, I also would most likely not be happy at any of these “top” institutions. I spent the past 4 years in a miserable rat race to the top against my classmates, and it sucked. I don’t want another 4 years of competition and high stress.\n\nIn regards to your question, my father is in a managerial position at a well known tech company. He is in charge of hiring a great deal of employees to his team from all around the world each year. Every day, he stresses to me that it is not the name on your degree that will get you a job, but rather how well you are able to interact with others, APPLY what you learned in college, and accomplish tasks in a timely manner. He has turned down applicants from big name T10s in favor of applicants from state schools, simply because they were more personable and did better in mock sessions.\n\nGo where you will be happiest, with the least amount of debt as possible.",
      "author": "littleschmoop",
      "created": 1636331778,
      "upvotes": 9,
      "replies": {
        "hjr52rv": {
          "link": "/r/ApplyingToCollege/comments/qp13qw/how_important_is_the_name_these_days/hjr52rv/",
          "text": "Thank you so much for sharing such valuable insight. I appreciate your father’s experience and wisdom, as well as your perspective based on what you have gone through thus far. 🙏",
          "author": "BK2021",
          "created": 1636336766,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hjqq6ie": {
      "link": "/r/ApplyingToCollege/comments/qp13qw/how_important_is_the_name_these_days/hjqq6ie/",
      "text": "Generally speaking, you are absolutely correct in your thought.",
      "author": "prsehgal",
      "created": 1636329815,
      "upvotes": 6,
      "replies": {}
    },
    "hjrp8ba": {
      "link": "/r/ApplyingToCollege/comments/qp13qw/how_important_is_the_name_these_days/hjrp8ba/",
      "text": "It's not that black and white. In some fields, a lot of gates are opened. In others, not so much,",
      "author": "CLOWN_ALERTO",
      "created": 1636347059,
      "upvotes": 1,
      "replies": {
        "hjsh5hp": {
          "link": "/r/ApplyingToCollege/comments/qp13qw/how_important_is_the_name_these_days/hjsh5hp/",
          "text": "And the relative cost is highly dependent on your EFC. \n\nA lot comes down to what you will take advantage of. Highly selective do have pretty amazing internship and research opportunities,  along with really fantastic job placement support. The name on the degree isn't what matters, but your first job really does: if you come out of college with a business degree and your get a job as an office manager of a small mattress firm, it's not the same as if you get a job at Bain. The skills you learn on the job (and take to the next one) will be different, and the Bain job is much more likely to give you the opportunity to learn valuable, marketable skills and connect you with people who might help you find other jobs.",
          "author": "FoolishConsistency17",
          "created": 1636369480,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}