{
  "sid": "rinnyr",
  "link": "/r/ApplyingToCollege/comments/rinnyr/how_screwed_am_i/",
  "title:": "how screwed am i",
  "text": "i have a 2.73 GPA for the first semester sophomore year with a C- in mandarin, a D+ in chem and a B in math :/ i was sick with covid for roughly 3 weeks starting on the first day of school, and kept on having to miss class due to being overly tired/getting sick again every week after that. i know that i have an \"excuse\" for why my GPA is so bad this semester, but does this totally kill my chances at all the T20s\n\nif it helps, i got a 1510 on the PSAT in october. i'm not braindead, i just wasn't able to submit a lot of work or study at all",
  "author": "eggyeahyeah",
  "created": 1639765795,
  "updated": 1639785414,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hoyaszc": {
      "link": "/r/ApplyingToCollege/comments/rinnyr/how_screwed_am_i/hoyaszc/",
      "text": "For T20’s, it’s gonna be very difficult even though those are very valid extenuating circumstances. Just try your best to grind out straight A’s the rest of the way and work on your EC’s as much as you can. You’ve been dealt a shit card so far but you’re obviously extremely bright and capable so I believe you’ll find a great spot somewhere even if its “just” a T50",
      "author": "myfedoraismlg",
      "created": 1639767150,
      "upvotes": 8,
      "replies": {}
    },
    "hoy7nud": {
      "link": "/r/ApplyingToCollege/comments/rinnyr/how_screwed_am_i/hoy7nud/",
      "text": "What is your overall GPA?",
      "author": "HeisenbergNokks",
      "created": 1639765957,
      "upvotes": 2,
      "replies": {
        "hoy8hrv": {
          "link": "/r/ApplyingToCollege/comments/rinnyr/how_screwed_am_i/hoy8hrv/",
          "text": "3.22. got a C in math and a B in mandarin + bio last year because of some other extenuating factors (found out i have a chronic illness and needed to start treatment for that, family member died, was recovering from an eating disorder)",
          "author": "eggyeahyeah",
          "created": 1639766271,
          "upvotes": 3,
          "replies": {
            "hoy9bmv": {
              "link": "/r/ApplyingToCollege/comments/rinnyr/how_screwed_am_i/hoy9bmv/",
              "text": "I would say that it depends. If you start getting straight A's this year and get straight A's your entire junior year, you can prove that you really are capable of getting good grades. However, if your bad grades continue, you can't just explain away everything. Basically, if your GPA improves drastically your T20 chances aren't ruined. However, if you continue to get bad grades, you aren't getting in.",
              "author": "HeisenbergNokks",
              "created": 1639766586,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}