{
  "sid": "r3wukg",
  "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/",
  "title:": "My friend hasn't applied to any colleges yet",
  "text": "I have a friend who literally hasn't done any college research or any of her applications. The calstate app (she's not doing UC) is due on the 30th. I'm a little worried, and I'm not sure if she even wants to go to college because she has said she wants to work (and has also expressed a college interest), but hasn't been very specific. I suggested community college but still idk. She's just clueless about the process and it seems like her siblings and parents haven't helped or mentioned it at all (at least 1/2 of them have gone/are going to college). She doesn't have bad grades (almost, if not all As) but she doesn't take any challenging classes either. Just what is offered. She also barely has any extracurriculars. I think she'll be able to get into some colleges (if she wants to), but I don't know how best to support her.\n\nShould I even try to do anything? I don't know if she actually wants to apply or is just embarassed that she's not going to. I helped her start the app (like create a login) a few weeks ago but that's literally all she's done! Also I'm busy as well so I can't help her with everything. I'm going to send her our school's resources and advice on how to research but idk what else? I'm wondering what you guys think I should do. Thanks!",
  "author": "overCaffeinated0_0",
  "created": 1638077447,
  "updated": 1638204694,
  "over_18": false,
  "upvotes": 41,
  "upvote_ratio": 0.98,
  "comments": {
    "hmda1xh": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmda1xh/",
      "text": "Let her know if she needs help or pointers you're available then leave her alone.  Sounds like she hasn't figured out what she wants to do yet or may be depressed and not have the motivation (and there's nothing you can do to help with that, she would need to get medical help).",
      "author": "1976Raven",
      "created": 1638078117,
      "upvotes": 35,
      "replies": {
        "hmdb8p6": {
          "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmdb8p6/",
          "text": "Yeah I think it’s mainly confusion and not mental health related (hopefully) but I will probably just check in again tmrw and hope things work out for her",
          "author": "overCaffeinated0_0",
          "created": 1638078854,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmda292": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmda292/",
      "text": "You can try having an honest conversation with her about the whole process. Maybe she's made up her mind about not going to college, whatever the reason might be. And if there is an issue because of which she is procrastinating, maybe your talk can help her in getting starting with the whole process.",
      "author": "prsehgal",
      "created": 1638078123,
      "upvotes": 20,
      "replies": {
        "hmdb3ve": {
          "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmdb3ve/",
          "text": "Thank you! I will try to have a longer conversation with her about this tomorrow",
          "author": "overCaffeinated0_0",
          "created": 1638078768,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmdkxuj": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmdkxuj/",
      "text": "tbh the cal state app takes like an hour if you focus. it’s totally doable! with straight a’s, tell her to apply to your zoned csu + the top 5 (the cal polies, sdsu, sjsu, csulb)",
      "author": "phrog3000",
      "created": 1638085342,
      "upvotes": 8,
      "replies": {}
    },
    "hmdq2ch": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmdq2ch/",
      "text": "update us! hope it goes well :)\n\nyou sound like a really awesome friend",
      "author": "fierrochasee",
      "created": 1638089367,
      "upvotes": 7,
      "replies": {
        "hmhwwh4": {
          "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmhwwh4/",
          "text": "Thanks!! I mainly left her alone today since I sort of spammed her last night (she did ask) with some tips/info. We were going to practice our sport together today but she said she was going to focus on her apps instead so I am hopeful 👍 I will check in at lunch tmrw as well",
          "author": "overCaffeinated0_0",
          "created": 1638162710,
          "upvotes": 2,
          "replies": {
            "hmhzmlh": {
              "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmhzmlh/",
              "text": "sounds awesome!",
              "author": "fierrochasee",
              "created": 1638164305,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmda845": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmda845/",
      "text": "well if she wants to work in a field that generally needs college education, tell her she should start working on the app and send her a few resources ~~not college confidential~~",
      "author": "glossyducky",
      "created": 1638078223,
      "upvotes": 6,
      "replies": {
        "hmdb1lf": {
          "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmdb1lf/",
          "text": "That’s a good idea thank you! I guess I should tell her to think about future career as well (I know some of her interests don’t require degrees)",
          "author": "overCaffeinated0_0",
          "created": 1638078729,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmdlu80": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmdlu80/",
      "text": "Worst case she can go to a community college and transfer, she would just end up in a bit less debt. Still talk to her about it and try to let her know. The UC app is time consuming and I’m terrified because I still have two PIQs to write for it. The csu app is a breeze.",
      "author": "Ok-Bookkeeper-7052",
      "created": 1638085993,
      "upvotes": 5,
      "replies": {
        "hmf2k7d": {
          "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmf2k7d/",
          "text": "Yea, it sounds like they’re in California where CC is a really good option and there are clear transfer pathways. Nothing wrong with it.",
          "author": "idkcat23",
          "created": 1638118692,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmf2g9h": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmf2g9h/",
      "text": "This is a common phase to get into around this time. This whole thing is nerve-wracking and people get freaked out and freeze up. Never mind the fact that many 18 year olds are absolutely not ready to move away from home. Offer her some help but then leave her alone. I had some friends like this and their reluctance was because they didn’t feel ready. Most of them wound up taking a gap year or went to community college. She’s also had a large portion of her high school experience impacted by COVID so I wouldn’t be surprised if she just doesn’t feel prepared.\n\nI do get the sense that she might be embarrassed about this, and she might just want to be left alone and go to community or take some time off. Offer to help, but leave her alone if she refuses. You sound like a good friend but this is a deeply personal process and I doubt she wants to be nagged. For all you know, she isn’t planning to apply to CSU at all but just wants to hide the fact that she isn’t applying.",
      "author": "idkcat23",
      "created": 1638118647,
      "upvotes": 3,
      "replies": {}
    },
    "hme365c": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hme365c/",
      "text": "Does your school have a college counselor that can sit down with her to have a frank discussion (maybe you can join them if that helps her open up)?",
      "author": "pupuphlatter",
      "created": 1638099796,
      "upvotes": 1,
      "replies": {}
    },
    "hmfbb2t": {
      "link": "/r/ApplyingToCollege/comments/r3wukg/my_friend_hasnt_applied_to_any_colleges_yet/hmfbb2t/",
      "text": "I would encourage her to just apply a few places and see what happens so that she can weigh her options. In addition, how about a meeting with the HS counselor?",
      "author": "Hamilton3322",
      "created": 1638122282,
      "upvotes": 1,
      "replies": {}
    }
  }
}