{
  "sid": "k3akox",
  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/",
  "title:": "Analysis on what T20 Schools WANT",
  "text": "After 1 year of research:\n\nStanford - Most well-rounded school in America. If you have 3.5 UW or higher in hard courses, but extraordinary ECs or an EC, you're qualified to get in. They’re looking for the next-gen.\n\nCaltech and MIT - You'll need to be a straight-A (or nearly) a straight-A student in the most challenging courses offered at your school to get in. (Again, nothing set in stone, but this is what I have analyzed after looking at some Naviance scatterplots.) MIT looks for \"academically talented students interested in an analytical-based, hands-on education, who have shown true engagement, initiative, curiosity, and community mindedness.\" Caltech's mission: to advance the borders of human knowledge by doing scientific research.\n\nDuke and Vandy - A balance of nice ECs and very good coursework. I’d say 3.8 UW in rigorous courses is the sweet spot for these schools, but then again, if you have an EXTRAORDINARY EC, you could get in with 3.6 UW, etc.\n\nUSC - LOVES seeing great extracurricular activities! I attended one of their webinars, where they were so proud of a student who didn’t have straight A's, but had superb EC activities. Remember that they want a balance of ECs and a strong interest in your major; this is evident in the USC essay prompts themselves. If you’re an engineer, make sure that you’re rounded.\n\nUVA - One of the least rounded schools in the country. They want to see excellent course selection and grades (which the GPA does not convey) first and foremost, then strong recs, essays, and activities. Academics have always come first. It's not about doing unusual or unique things.\n\nUMich - A very rounded school that wants to see students who excel academically, but also those who have a personality and cool extracurriculars that \"wow\" the admissions officers.\n\nNotre Dame - Extraordinary school with extraordinary people. The people who go to that school somehow have always stood out to me. Very kind and hard-working souls. Definitely aligns with their mission statement: Notre Dame is dedicated to providing a Catholic co-educational program in a --> \"value-centered\" <--- environment. Be sure that your teachers write you EXCELLENT recommendations. :)\n\n\nIvies - Think they’re the kings of the country. Always asking for top gpa........ That’s like the only qualification. And be URM or an athlete\n\nTufts - looks for students who can balance their extracurricular activities with their academics. They also love students who are passionate about their field (medical, etc.) It is indeed, a pretty rounded school although they look at academics a bit more than UF, etc.\n\nUF and UNC - They absolutely don’t want nerds. They want personality. I’ve talked to the AOs there and that’s what I’ve heard.\n\nUChicago - Essays matter 55%. The only school that looks STRONGLY at essays! But then it should’ve been your dream school to apply to since you had to have thought about the essays and written them over the summer. You can't write anything here. The essays must be thoughtfully written out to have a chance of getting in. :)\n\nRice - Rice definitely wants students who are very strong academically and who have good SAT/ACT scores. On the non-academic end, the AOs are really looking for students who think differently, much as UChicago does. Have you ever dealt with an unfavorable circumstance but then created something positive out of it? Can you portray something small in a different light? I’m pretty sure that’s what Rice AOs want. Haven't formally attended any of their webinars, so this is just info I got from previous posts on Reddit, online, etc. 😃\n\nLiberal Arts Colleges - I think all LACs are looking for passion. A good balance of academics and ECs. And most importantly, that you’re a rounded student!\n\nUCLA/Berkeley - Academics (since they are, after all, competitive state schools), but if you have great essays or something that sets you apart, definitely apply. A respected Redditor also stated that Berkeley looks for grit. :)\n\nJHU - Looking for innovators with strong GPAs. Let the GPA and SAT/ACT part not deter you though. They love seeing people who’ve invented new things!!\n\nUIUC/Purdue/Northwestern: How have you explored your interest for your major? This is the MAIN thing. For NW though, be sure to have great grades too.\n\nWashington University in St Louis - Mainly looks at SAT/ACT (surprising, huh!) If you have close to a 1500, definitely apply. GPA must be okay too. These guys focus on kids who have a passion for research, so be sure to mention research somewhere.\n\nCMU - Not rounded. You need great grades and SAT/ACT scores. The only other way: have you won hackathons? Etc..\n\nNew post on ECs on the way! I myself am an avid science researcher and have researched in many labs about amoebas! \n\nGood luck guys and sorry for the mediocre grammar. Typed this out in a rush! I know we will succeed!! Also, remember that colleges follow a holistic admissions process. Nothing here is set in stone. :)\n\n*MOST IMPORTANTLY: some people on Reddit will discourage you citing that your GPA is too low. There is NO cut-off to apply to top tier schools!!! Don't listen. tothem! I know 5 people who had below a 3.7 UW GPA who got into top schools! Your other parts of the application are important too!!! NEVER listen to them. If colleges truly are only looking for GPA and don't care about academic improvement, etc., then you know that this country doesn't care for inventors, etc. Then you know the state of the country. :)",
  "author": "thayirshetti",
  "created": 1606661520,
  "updated": 1634572664,
  "over_18": false,
  "upvotes": 2703,
  "upvote_ratio": 0.97,
  "comments": {
    "ge1spw9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1spw9/",
      "text": "OP is goatified",
      "author": "mynameisjeff0704",
      "created": 1606666629,
      "upvotes": 130,
      "replies": {}
    },
    "ge1mre1": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1mre1/",
      "text": "I had no idea UNC is a top 20. I live in NC and it always seems like every other person I talk to has it on their list and every 5th person gets accepted. Is it easier to get in if you’re in state?\n\nAlso awesome post, saved for further reference",
      "author": "DragonIce01",
      "created": 1606664536,
      "upvotes": 115,
      "replies": {
        "ge1n84u": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1n84u/",
          "text": "Ah it’s not T20, but it’s close (depending on what you consider T20.) These are the great unis that people generally apply to. UNC is definitely a little easier to get into if you’re not OOS, but then again, they have fewer applicants applying from OOS. Naviance indicates that it’s definitely harder to get into UNC and UVA OOS. Same with UCLA/Berkeley, but most people applying to those schools from OOS are geniuses with perfect scores haha.",
          "author": "thayirshetti",
          "created": 1606664690,
          "upvotes": 86,
          "replies": {
            "ge24adz": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge24adz/",
              "text": "Oooh okay, thank you!",
              "author": "DragonIce01",
              "created": 1606671703,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ge2ttyj": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ttyj/",
          "text": "all unc system schools have a massive in state preference",
          "author": "miserableimbecile",
          "created": 1606682507,
          "upvotes": 20,
          "replies": {}
        },
        "ge2apik": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2apik/",
          "text": "i’ve heard that public schools in NC have to fill up their class with 84% in state students so the OOS acceptance rate is like. 12%.",
          "author": "dearwikipedia",
          "created": 1606674850,
          "upvotes": 13,
          "replies": {
            "ge2eyn5": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2eyn5/",
              "text": "it’s required that 82% of each class is instate. i don’t know the specific number but the acceptance rate for instate is about 50% give or take which really isn’t that bad.",
              "author": "quarticorn",
              "created": 1606676908,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "ge2f2hq": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2f2hq/",
          "text": "the acceptance rate is somewhere around 50% for instate. i think it’s dropped to 40 something in the past few years but that’s not too bad for a school like chapel hill.",
          "author": "quarticorn",
          "created": 1606676961,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ge1eys7": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1eys7/",
      "text": "Let me know which schools you want me to analyze! This is after digging up AO’s comments, Reddit posts, Naviance scatterplots, etc etc",
      "author": "thayirshetti",
      "created": 1606661756,
      "upvotes": 313,
      "replies": {
        "ge1h7m5": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1h7m5/",
          "text": "Hey! Could you possibly do URochester?",
          "author": "FatimaMakama",
          "created": 1606662549,
          "upvotes": 94,
          "replies": {
            "ge1hiud": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1hiud/",
              "text": "Sure bro! As far as I’ve heard, U of R looks for students who want to explore an open-ended curriculum and utilize their research opportunities. Academically, they look for the same type of grades as UF does. They want to see you challenge yourself and get good grades in those courses. They love explorers (which was pretty new to me.) Go yellow jackets!",
              "author": "thayirshetti",
              "created": 1606662654,
              "upvotes": 125,
              "replies": {
                "ge1hwk7": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1hwk7/",
                  "text": "Thank you so much! That’s really good to hear. Do you think they take a good look at essays. I have a pretty unique story and I think my essay is pretty good. Would that be a boost?",
                  "author": "FatimaMakama",
                  "created": 1606662785,
                  "upvotes": 22,
                  "replies": {
                    "ge1i8os": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1i8os/",
                      "text": "Oh yeah then sure! I know someone who got in with lower stats, but a great, vivid essay. Good luck!",
                      "author": "thayirshetti",
                      "created": 1606662902,
                      "upvotes": 14,
                      "replies": {
                        "ge1iht6": {
                          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1iht6/",
                          "text": "Thanks for the input!!",
                          "author": "FatimaMakama",
                          "created": 1606662993,
                          "upvotes": 7,
                          "replies": {
                            "ge2is51": {
                              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2is51/",
                              "text": "Hey! So my gpa was not the best (around 3.4 uw) though my test scores were good, ecs were kind of weak, but I got in and my acceptance letter mentioned something I said in my essay :) I am currently a senior at UofR!",
                              "author": "Violyre",
                              "created": 1606678586,
                              "upvotes": 1,
                              "replies": {
                                "ge2kpfo": {
                                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2kpfo/",
                                  "text": "Wow, that’s amazing! My situation isn’t that my GPA is bad, but that I’ve been in two high schools and one was in a different country, and the grading scale is different. When I came here, my counselor calculated my GPA based on the US system and that made my GPA low even though it should be much higher than it is. I plan on explaining this in the additional info section so they can recalculate it and my counselor also mentioned it in her LoR, so hopefully they understand. My essay is about my experiences moving around and living in another country and how that shaped who I am and the things I learned from it, and I think it’s pretty good. Hopefully they appreciate the diversity and accept me because it’s my top school😭",
                                  "author": "FatimaMakama",
                                  "created": 1606679266,
                                  "upvotes": 1,
                                  "replies": {
                                    "ge2l64f": {
                                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2l64f/",
                                      "text": "That sounds like a cool essay, and I hope the explanation helps! I think the counselor mentioning it should definitely give you credibility too. I didn't really have any good reason for my gpa haha, just bad times in HS. Best of luck to you though, I hope you get in!! I don't often see my school getting enough love on this sub ❤️",
                                      "author": "Violyre",
                                      "created": 1606679422,
                                      "upvotes": 1,
                                      "replies": {
                                        "ge2llne": {
                                          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2llne/",
                                          "text": "Thank you so much!! I think it’s an amazing school and I’ve heard they’re really good for premed and that’s what I want to do. The open curriculum will definitely benefit me in that sense, and also for research!",
                                          "author": "FatimaMakama",
                                          "created": 1606679573,
                                          "upvotes": 1,
                                          "replies": {
                                            "ge2m94o": {
                                              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2m94o/",
                                              "text": "Oh yes, I don't know a lot about the premed (I'm an engineering student) but research is definitely plentiful here, half the people I know are involved in it in some way and it's pretty easy to ask profs about their labs and get involved :) and the open curriculum is nicer than I imagined, as someone who couldn't wait to stop taking history classes, haha! We do have a very small little subreddit that people post and answer questions on sometimes, r/URochester (we say UofR, but the sub is named that for some reason)",
                                              "author": "Violyre",
                                              "created": 1606679771,
                                              "upvotes": 1,
                                              "replies": {
                                                "ge2mxie": {
                                                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2mxie/",
                                                  "text": "Thanks for that!! And I’m actually already following the subreddit😂(that’s how obsessed I am😭)",
                                                  "author": "FatimaMakama",
                                                  "created": 1606679969,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "ge2n7sg": {
                                                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2n7sg/",
                                                      "text": "Oh sweet! Well you certainly have a clear passion for the school and I hope they can see that and let you in!! 💕 (btw, Sue B > Quad when you pick your first year housing... I'm not biased at all :P)",
                                                      "author": "Violyre",
                                                      "created": 1606680059,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "ge2odzb": {
                                                          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2odzb/",
                                                          "text": "Me too!! And thank you, really appreciated hearing from someone who goes there😊💓",
                                                          "author": "FatimaMakama",
                                                          "created": 1606680414,
                                                          "upvotes": 2,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ge1nt6i": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1nt6i/",
          "text": "Hello! Thank you so much for doing this btw. Can you do Georgetown?",
          "author": "OverlordRexImperator",
          "created": 1606664903,
          "upvotes": 74,
          "replies": {
            "ge2wcvf": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2wcvf/",
              "text": "I definitely second this (or more accurately twenty-third this)",
              "author": "one-mappi-boi",
              "created": 1606683654,
              "upvotes": 16,
              "replies": {
                "ge37n44": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge37n44/",
                  "text": "Me three!",
                  "author": "Monsieur_BlueSky",
                  "created": 1606689135,
                  "upvotes": 7,
                  "replies": {
                    "ge4401w": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4401w/",
                      "text": "Me four. My aunt is an alumni and an AO there.",
                      "author": "Poop__Pirates",
                      "created": 1606707026,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ge37wnx": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge37wnx/",
              "text": "Yep, particularly SFS!",
              "author": "wordgenius",
              "created": 1606689273,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "ge1ty52": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ty52/",
          "text": "You’re an absolute Chad for this. Can you do Georgia Tech?",
          "author": "goflyint0",
          "created": 1606667118,
          "upvotes": 52,
          "replies": {
            "ge1yu5a": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1yu5a/",
              "text": "From my experience tech wants who looks promising, not just smart. Most of the people are well rounded and super smart, so testscores and gpa dont weigh nearly as much as ecs and personality.",
              "author": "Acoww123",
              "created": 1606669087,
              "upvotes": 33,
              "replies": {}
            },
            "ge1ugsk": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ugsk/",
              "text": "Thanks bro! And ah, yes! I must. Indeed, an extraordinary tech school! How could I have forgotten?",
              "author": "thayirshetti",
              "created": 1606667338,
              "upvotes": 18,
              "replies": {
                "ge26o8i": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge26o8i/",
                  "text": "i went to a tour/info session pre-covid and they said they weight the transcript more than the other parts of your application. they are looking for someone beyond grades though, who shows genuine interest in innovation and knows pretty solidly what they want to do",
                  "author": "cldec",
                  "created": 1606672875,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge1rgtm": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rgtm/",
          "text": "Separate ivy analysis, please :)",
          "author": "throwaway65024",
          "created": 1606666180,
          "upvotes": 27,
          "replies": {
            "ge1rs5j": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rs5j/",
              "text": "Definitely. Coming soon. Be sure to save this post so that you can come back when I update it! Every Ivy is unique in its own way. :)",
              "author": "thayirshetti",
              "created": 1606666294,
              "upvotes": 35,
              "replies": {
                "ge1rx11": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rx11/",
                  "text": "Already have! Thanks for the effort :)",
                  "author": "throwaway65024",
                  "created": 1606666341,
                  "upvotes": 3,
                  "replies": {}
                },
                "gendxhz": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gendxhz/",
                  "text": "Cool thanks!",
                  "author": "gunshotaftermath",
                  "created": 1607125701,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge1sxzr": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1sxzr/",
          "text": "Could you do Brown please?",
          "author": "piedrafundamental",
          "created": 1606666720,
          "upvotes": 21,
          "replies": {
            "ge1tbkq": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1tbkq/",
              "text": "Sure, soon!",
              "author": "thayirshetti",
              "created": 1606666864,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "ge1s1n0": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1s1n0/",
          "text": "[deleted]",
          "author": null,
          "created": 1606666386,
          "upvotes": 22,
          "replies": {
            "ge3o9we": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3o9we/",
              "text": "This",
              "author": "RedditoDorito",
              "created": 1606698081,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ge1fd5o": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1fd5o/",
          "text": "Tufts ngl, I'm freaking out over my ED1 app so maybe knowing I match up will calm me down more",
          "author": null,
          "created": 1606661902,
          "upvotes": 19,
          "replies": {
            "ge1g0zx": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1g0zx/",
              "text": "You’ll be fine bro!! I’m sure you’ll get into Tufts. Tufts looks for students who can balance their extracurricular activities with their academics. They also love students who are passionate about their field (medical, etc.) They are indeed, a pretty rounded school although they look at academics a bit more than UF, etc.",
              "author": "thayirshetti",
              "created": 1606662138,
              "upvotes": 25,
              "replies": {
                "ge1gezp": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1gezp/",
                  "text": "thank you!! also all this research is really helpful I appreciate it :)",
                  "author": null,
                  "created": 1606662273,
                  "upvotes": 6,
                  "replies": {
                    "ge1gysf": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1gysf/",
                      "text": "No problem bro!! Love doing this. Hope we get into great colleges!",
                      "author": "thayirshetti",
                      "created": 1606662459,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ge1ofgh": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ofgh/",
          "text": "Could you do UT Austin?",
          "author": "RoopDog123",
          "created": 1606665119,
          "upvotes": 38,
          "replies": {
            "ge2i6rw": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2i6rw/",
              "text": "For UT, 75% of their students were inside the top 6% of their class from a Texas school, but if you are not one of these students, then make sure you do well in other parts of your application and show why you are a great fit at a school as large as UT.",
              "author": null,
              "created": 1606678337,
              "upvotes": 16,
              "replies": {}
            },
            "ge2h3kc": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2h3kc/",
              "text": "Be from Texas, they have some deal with the state, I don't know specifics, but it's something like they have to accept the top 10% of students in texas, meaning that out of state applicants need to literally be at ivy league level to get in. I had a friend who got into every school he applied for, but not UT",
              "author": "PM_Me_Modal_Jazz",
              "created": 1606677886,
              "upvotes": 9,
              "replies": {
                "ge2nufy": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2nufy/",
                  "text": "Top 6% class ranked students in Texas get automatic admissions to UT Austin. For every other state school it’s top 10%. According to my counselor if you don’t qualify for auto admission chances of getting in are like for a T20.",
                  "author": "WinterWhippet",
                  "created": 1606680248,
                  "upvotes": 16,
                  "replies": {}
                },
                "ge3g2qh": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3g2qh/",
                  "text": "Texas HS Senior here, to clarify a bit, texas schools are required by law to fill 75% of their seats through auto admissions. UT, being the most popular college in the state, has been steadily shrinking their margin from 10% some years ago to 6% now or else they would overflow with auto admit students, they may even take it down to 5% in a few years. It sucks for us who done meet the threshold for this, so be sure to put your best foot forward.",
                  "author": "NigelLasater123",
                  "created": 1606693536,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "ge1pbx3": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1pbx3/",
              "text": "I was about the ask about UT Austin too.",
              "author": "Syntzz",
              "created": 1606665411,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "ge20t0f": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge20t0f/",
          "text": "Uwash Seattle",
          "author": "PotatBdedw3",
          "created": 1606669950,
          "upvotes": 8,
          "replies": {
            "ge211b7": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge211b7/",
              "text": "Sure.",
              "author": "thayirshetti",
              "created": 1606670065,
              "upvotes": 3,
              "replies": {}
            },
            "gfhjajl": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gfhjajl/",
              "text": "Wants a well-rounded person. You need to have a personality and a decent gpa. They really care about essays and don’t care about SAT at all.",
              "author": "Nikkiforever",
              "created": 1607745261,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ge1jokv": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1jokv/",
          "text": "Thank you for doing this! Can you take a look at Bates, Colby, and Williams please? Thank you!",
          "author": "richardblaine",
          "created": 1606663429,
          "upvotes": 12,
          "replies": {
            "ge385bq": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge385bq/",
              "text": "Yep, please write about the LACS!",
              "author": "wordgenius",
              "created": 1606689398,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ge1f8sc": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1f8sc/",
          "text": "this is cool! could you do top LACs too? williams, amherst, swat... etc",
          "author": "undermyknee",
          "created": 1606661858,
          "upvotes": 6,
          "replies": {
            "ge1ff8p": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ff8p/",
              "text": "Sure bro! I think all LACs are looking for passion. A good balance of academics and ECs. And most importantly, that you’re a rounded student! If you want me to research a particular school, just lmk bro!",
              "author": "thayirshetti",
              "created": 1606661923,
              "upvotes": 6,
              "replies": {
                "ge1s1gj": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1s1gj/",
                  "text": "Hey, do you think you could research middlebury?",
                  "author": "Redherring26",
                  "created": 1606666384,
                  "upvotes": 1,
                  "replies": {}
                },
                "ge43ih2": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge43ih2/",
                  "text": "Is there anything for Amherst in particular?",
                  "author": "Renard245",
                  "created": 1606706741,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge1g6mp": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1g6mp/",
          "text": "Could u do USC pls?",
          "author": null,
          "created": 1606662194,
          "upvotes": 11,
          "replies": {
            "ge1gtkb": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1gtkb/",
              "text": "For sure! USC LOVES seeing great extracurricular activities! I attended one of their webinars, where they were so proud of a student who didn’t have straight As, but had superb EC activities. Remember that they want a balance of ECs and a strong interest for your major; this is evident in the USC essay prompts themselves. If you’re an engineer, make sure that you’re rounded, but nail 3/4 prompts talking about your intended major. HOWEVER, do NOT mention specific details such as arrays, etc. If you keep it too technical, they said that they DON’T want the person at USC. It must be conversational. For sure, these guys want good GPAs and all, but would definitely accept a 3.66 UW with improvement who LOVES his/her intended major over a 4.0 UW just applying for the heck of it. They are rounded! And I know this for sure. 😀😀",
              "author": "thayirshetti",
              "created": 1606662408,
              "upvotes": 24,
              "replies": {
                "ge1mzjq": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1mzjq/",
                  "text": "What are arrays?",
                  "author": "Thatboy000",
                  "created": 1606664609,
                  "upvotes": 2,
                  "replies": {
                    "ge1nish": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1nish/",
                      "text": "They’re data structures you use when you code. If you can explain to AOs what it is, then sure use technical words. But if it’s just to BS, USC’s AOs know that!",
                      "author": "thayirshetti",
                      "created": 1606664797,
                      "upvotes": 12,
                      "replies": {
                        "ge1o58m": {
                          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1o58m/",
                          "text": "Ohh, I don’t code so that is probably why I didn’t know what it was but thank you for the insight!",
                          "author": "Thatboy000",
                          "created": 1606665020,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ge1gyw4": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1gyw4/",
                  "text": "Thanks!",
                  "author": null,
                  "created": 1606662460,
                  "upvotes": 1,
                  "replies": {
                    "ge1h1qu": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1h1qu/",
                      "text": "Np!",
                      "author": "thayirshetti",
                      "created": 1606662490,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ge1gqlu": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1gqlu/",
              "text": "Mood",
              "author": "DryGift1435",
              "created": 1606662381,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ge1jrj9": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1jrj9/",
          "text": "Could you maybe do NYU and Villanova please?",
          "author": "Ok-Communication-433",
          "created": 1606663463,
          "upvotes": 11,
          "replies": {
            "ge1rlki": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rlki/",
              "text": "not OP but NYU depends very strongly on major. for example, a student applying to tisch could have a lower gpa as long as their audition/portfolio is incredible and their ECs relate to their major. someone applying to Stern likely will need better grades and stats in general",
              "author": "feirly",
              "created": 1606666226,
              "upvotes": 18,
              "replies": {}
            }
          }
        },
        "ge1sbvu": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1sbvu/",
          "text": "Could you do George Washington?",
          "author": "mstamp1",
          "created": 1606666487,
          "upvotes": 8,
          "replies": {
            "ge1t3u2": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1t3u2/",
              "text": "Oh yes, soon!",
              "author": "thayirshetti",
              "created": 1606666782,
              "upvotes": 6,
              "replies": {
                "ge23lxj": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge23lxj/",
                  "text": "Thank You! Just curious, what made you want to do this?",
                  "author": "mstamp1",
                  "created": 1606671362,
                  "upvotes": 6,
                  "replies": {
                    "ge25r5t": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25r5t/",
                      "text": "I got frustrated since no colleges tell us directly what they're looking for.",
                      "author": "thayirshetti",
                      "created": 1606672422,
                      "upvotes": 17,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ge1n49e": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1n49e/",
          "text": "could u do yale pls 🥺",
          "author": "doofenshmirtz_123",
          "created": 1606664653,
          "upvotes": 6,
          "replies": {
            "ge1nub1": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1nub1/",
              "text": "For sure, it’s just gonna take some time though. I’ve grouped Ivies into two categories: Ivies that look for students that are very interested in their intended major and students who have had an experience or experiences so great that they can share them with other students for the school “vibe” to last for generations. Cornell and Columbia seem to fall under the first category, while the rest fall in the latter. The myth that Ivies look for strong reading scores.... is most likely false. More on this later, will definitely do Yale soon! (Yale looks like the only Ivy that looks for really high GPAs, but then again, don’t know for sure what they want.)",
              "author": "thayirshetti",
              "created": 1606664914,
              "upvotes": 18,
              "replies": {
                "ge1oa66": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1oa66/",
                  "text": "thank you so much!",
                  "author": "doofenshmirtz_123",
                  "created": 1606665067,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge20bf4": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge20bf4/",
          "text": "Can you elaborate a bit more on UF, please? :)",
          "author": "DruhveenSchool",
          "created": 1606669699,
          "upvotes": 6,
          "replies": {
            "ge21bzn": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21bzn/",
              "text": "Sure! They definitely want personality. Great essays can get you in! Just make sure that you're challenging yourself and taking AP classes. :)",
              "author": "thayirshetti",
              "created": 1606670213,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "ge1xwdg": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1xwdg/",
          "text": "[deleted]",
          "author": null,
          "created": 1606668703,
          "upvotes": 13,
          "replies": {
            "ge1y0mo": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1y0mo/",
              "text": "Sorry! Will do!",
              "author": "thayirshetti",
              "created": 1606668751,
              "upvotes": 9,
              "replies": {
                "ge2b8g7": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2b8g7/",
                  "text": "I'd also love if you did u dub, US News ranks them in the 50's and WSJ around 40, so it's somewhere in the 40's, so not T20, but definitely a good school which many of us apply to lol!\n\nEdit: as a UW simp, I have gathered some info, if you'd like it lol",
                  "author": "saddaythrow",
                  "created": 1606675107,
                  "upvotes": 4,
                  "replies": {
                    "ge3hfz3": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3hfz3/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1606694254,
                      "upvotes": 5,
                      "replies": {
                        "ge3q1ox": {
                          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3q1ox/",
                          "text": "yeah - and 40's is a damn good ranking overall, anyways, probably closer to top 30 for STEM. (especially pre med and CS are excellent at udub)",
                          "author": "saddaythrow",
                          "created": 1606699117,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "ge3vnkt": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3vnkt/",
                      "text": "I think all applicants are simps for u dub, its impossible not to be when applying there",
                      "author": "devembre",
                      "created": 1606702281,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "ge70f8k": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge70f8k/",
                      "text": "broo release the secrets",
                      "author": "12apor",
                      "created": 1606774618,
                      "upvotes": 2,
                      "replies": {
                        "geg89pa": {
                          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/geg89pa/",
                          "text": "lol abt UW? I mean pm me if u want my extensive research lmao",
                          "author": "saddaythrow",
                          "created": 1606965933,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ge22n50": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge22n50/",
          "text": "Hey, could you do UT Austin???",
          "author": "timofeymozgov23",
          "created": 1606670875,
          "upvotes": 5,
          "replies": {
            "ge25xsn": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25xsn/",
              "text": "Sure!",
              "author": "thayirshetti",
              "created": 1606672513,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "ge23v6c": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge23v6c/",
          "text": "Hey! Thanks so much for doing this; it clears up a lot of misconceptions. \nCould you possibly do Georgia Tech?",
          "author": "Kamushiny",
          "created": 1606671489,
          "upvotes": 3,
          "replies": {
            "ge25pw2": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25pw2/",
              "text": "Sure!",
              "author": "thayirshetti",
              "created": 1606672405,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ge289c8": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge289c8/",
          "text": "Thoughts on UWaterloo?",
          "author": "Clouds_Are_Cool",
          "created": 1606673660,
          "upvotes": 3,
          "replies": {}
        },
        "ge2bwns": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bwns/",
          "text": "Can you please elaborate more on Vanderbilt?",
          "author": "student731",
          "created": 1606675436,
          "upvotes": 3,
          "replies": {}
        },
        "ge2cgju": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2cgju/",
          "text": "NYU!",
          "author": "Implement-Mindless",
          "created": 1606675704,
          "upvotes": 3,
          "replies": {}
        },
        "ge2dsnk": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2dsnk/",
          "text": "If you have time, SBU and NYU please.",
          "author": "SadWolverine24",
          "created": 1606676341,
          "upvotes": 3,
          "replies": {}
        },
        "ge1qyi3": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1qyi3/",
          "text": "[deleted]",
          "author": null,
          "created": 1606666001,
          "upvotes": 5,
          "replies": {
            "ge1s5cd": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1s5cd/",
              "text": "Extraordinary school with extraordinary people. The people who go to that school somehow have always stood out to me. Very kind and hard-working souls. Definitely aligns with their mission statement: Notre Dame is dedicated to providing a Catholic co-educational program in a --> \"value-centered\" <--- environment. Hope you get in!",
              "author": "thayirshetti",
              "created": 1606666423,
              "upvotes": 13,
              "replies": {
                "ge1sgto": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1sgto/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1606666535,
                  "upvotes": 6,
                  "replies": {
                    "ge1tb30": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1tb30/",
                      "text": "They want to see that transfer applicants continue to push their boundaries and challenge themselves. They also REALLY want to see that you're interested in the school you're planning on transferring into. Unless it's a state school, I'm pretty sure that there are less spots reserved for transfer applicants. Good luck!! :))",
                      "author": "thayirshetti",
                      "created": 1606666859,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ge27hib": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge27hib/",
          "text": "Would you be down to look at Northwestern? This is a really cool resource, thank you!",
          "author": "WhatIsAUsernameee",
          "created": 1606673284,
          "upvotes": 2,
          "replies": {}
        },
        "ge2an3x": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2an3x/",
          "text": "Could you do Reed College as well as William and Mary? That’d be awesome! 😀",
          "author": "buffaLo_cartographer",
          "created": 1606674818,
          "upvotes": 2,
          "replies": {}
        },
        "ge2qu5x": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2qu5x/",
          "text": "Can u do Boston u by any chance",
          "author": "stayinschoolchirren",
          "created": 1606681167,
          "upvotes": 2,
          "replies": {}
        },
        "ge2tvaf": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2tvaf/",
          "text": "Could you explain your process a bit more? I'm looking at a bunch of schools and want to know more about them.",
          "author": "TheBrokenCondom2",
          "created": 1606682524,
          "upvotes": 2,
          "replies": {}
        },
        "ge2uv11": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2uv11/",
          "text": "Also, could you please do Georgetown and UVA? Thanks",
          "author": "piedrafundamental",
          "created": 1606682982,
          "upvotes": 2,
          "replies": {}
        },
        "ge23wp4": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge23wp4/",
          "text": "UMiami plsss",
          "author": "Peach613",
          "created": 1606671510,
          "upvotes": 1,
          "replies": {}
        },
        "ge2e068": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2e068/",
          "text": "Can you do northeastern pls",
          "author": null,
          "created": 1606676442,
          "upvotes": 1,
          "replies": {}
        },
        "ge2g02b": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2g02b/",
          "text": "If it's not a big deal, it would be great if you could also look at West Point and/or Penn State",
          "author": "Psylocke_X-23",
          "created": 1606677409,
          "upvotes": 1,
          "replies": {}
        },
        "ge2jd1r": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2jd1r/",
          "text": "Could you please do Brown, Yale, Drew, and Vassar? When you get the chance of course.",
          "author": "swift-aasimar-rogue",
          "created": 1606678804,
          "upvotes": 1,
          "replies": {}
        },
        "ge2klo8": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2klo8/",
          "text": "Colgate?",
          "author": "another_mistake19",
          "created": 1606679232,
          "upvotes": 1,
          "replies": {}
        },
        "ge2nnn6": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2nnn6/",
          "text": "NYU!",
          "author": "SnooGrapes5199",
          "created": 1606680191,
          "upvotes": 1,
          "replies": {}
        },
        "ge2nrzu": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2nrzu/",
          "text": "Yo thanks so much for doing this! By any chance, could you do UPitt?",
          "author": "TechSupport06",
          "created": 1606680228,
          "upvotes": 1,
          "replies": {}
        },
        "ge2uy1h": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2uy1h/",
          "text": "Thanks for doing this! I know it's not as popular but could you consider taking a look at Cal Poly SLO Engineering?",
          "author": "Parker_Ku",
          "created": 1606683022,
          "upvotes": 1,
          "replies": {}
        },
        "ge3858m": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3858m/",
          "text": "Could you do uiuc? If not, that’s okay!",
          "author": "Messyace",
          "created": 1606689397,
          "upvotes": 1,
          "replies": {}
        },
        "ge3hw2c": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3hw2c/",
          "text": "Could you possibly go into a bit more depth on Penn Wharton or just Penn in general? (this is my dream school that I get decisions back in only 2 weeks!)",
          "author": "IvyGuy13",
          "created": 1606694499,
          "upvotes": 1,
          "replies": {}
        },
        "ge3jz1w": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3jz1w/",
          "text": "It’d be really cool if you could do umd!!:)",
          "author": "maedos1",
          "created": 1606695624,
          "upvotes": 1,
          "replies": {}
        },
        "ge3qs93": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3qs93/",
          "text": "Could you please look into the Air Force and Naval Academy?",
          "author": "MGTOW-Academy",
          "created": 1606699542,
          "upvotes": 1,
          "replies": {}
        },
        "ge3ub00": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3ub00/",
          "text": "I love you so much for doing this",
          "author": "RoseThunder",
          "created": 1606701541,
          "upvotes": 1,
          "replies": {}
        },
        "ge43n9l": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge43n9l/",
          "text": "Anything about Georgia tech? 😋",
          "author": "DruhveenSchool",
          "created": 1606706819,
          "upvotes": 1,
          "replies": {}
        },
        "ge4d6m1": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4d6m1/",
          "text": "Columbia !",
          "author": "moritzwest",
          "created": 1606712901,
          "upvotes": 1,
          "replies": {}
        },
        "ge4ezwf": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4ezwf/",
          "text": "Could you do Brown? Also nice job on this post!",
          "author": "Xperiority",
          "created": 1606714240,
          "upvotes": 1,
          "replies": {}
        },
        "ge4vh0a": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4vh0a/",
          "text": "Amherst",
          "author": "mwazz57",
          "created": 1606729397,
          "upvotes": 1,
          "replies": {}
        },
        "gesm4j1": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gesm4j1/",
          "text": "I guess I’m pretty late here, but I was wondering if you could do Boston University. Sorry if someone already asked and I just missed your comment. This must be blowing up you inbox.",
          "author": "Bey_145",
          "created": 1607240295,
          "upvotes": 1,
          "replies": {}
        },
        "ge1u354": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1u354/",
          "text": "Would you be able to do NYU?",
          "author": "Savage_303",
          "created": 1606667173,
          "upvotes": 1,
          "replies": {
            "ge1uhyl": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1uhyl/",
              "text": "Definitely! Please check back though. Will have it done by tonight (EST).",
              "author": "thayirshetti",
              "created": 1606667353,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "ge29p79": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge29p79/",
          "text": "Could you do Tulane by any chance?",
          "author": "Probably_NotJoe",
          "created": 1606674362,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1s4ej": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1s4ej/",
      "text": "Fun and good work. But gotta keep it real: 3.5 at Stanford (even with blue chip point of excellence) is only, maybe, the next Andy Luck. --Admitium",
      "author": "admitium",
      "created": 1606666414,
      "upvotes": 104,
      "replies": {
        "ge208mp": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge208mp/",
          "text": "Yep, came here to say this.  A 3.5 would require some rather large hook.",
          "author": "ScholarGrade",
          "created": 1606669661,
          "upvotes": 58,
          "replies": {
            "ge2gasi": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2gasi/",
              "text": "Yeah, these GPA ranges are a bit optimistic",
              "author": "mordiscasrios",
              "created": 1606677551,
              "upvotes": 29,
              "replies": {
                "ge3icd7": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3icd7/",
                  "text": "You can get into Stanford with a 3.5, all you need to do is win a science olympiad or intel STS!",
                  "author": "whitelife123",
                  "created": 1606694735,
                  "upvotes": 29,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge1syrj": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1syrj/",
          "text": "Haha, but there are incredible students who apply bro! Some students have done extraordinary things to get into Stanford. I've heard from their AOs that as long as you show improvement and have a great EC(s), you should be fine. Very competitive though, so if not the GPA in challenging courses, you'd better hope you have ECs that set you apart!",
          "author": "thayirshetti",
          "created": 1606666728,
          "upvotes": 37,
          "replies": {
            "ge23564": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge23564/",
              "text": "If I may add, two of the students that I know that have gotten accepted to Stanford lacked strong ECs but had strong essays. I mean one was good at art on the state level but that’s it, and the other guy just had membership in clubs. Just something to add if ur looking for anecdotal info.",
              "author": "samrogdog13",
              "created": 1606671127,
              "upvotes": 41,
              "replies": {
                "ge25s1o": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25s1o/",
                  "text": "Yes! That matters!!",
                  "author": "thayirshetti",
                  "created": 1606672434,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            },
            "ge3gzqv": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3gzqv/",
              "text": "I like your enthusiasm, but he used to be a Stanford AO!",
              "author": "bsheep014",
              "created": 1606694017,
              "upvotes": 13,
              "replies": {}
            },
            "ge3dzjo": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3dzjo/",
              "text": "By 3.5 gpa, it would be the unweighted gpa from 10 to 11th grade right?",
              "author": "Untaken____Username",
              "created": 1606692460,
              "upvotes": 12,
              "replies": {
                "glnobtc": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/glnobtc/",
                  "text": "Yes",
                  "author": "VitexDesign",
                  "created": 1612217681,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge3ib3r": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3ib3r/",
          "text": "To be fair Andrew Luck was basically Trevor Lawrence and was pretty hyped up. He prob cuold've gotten a 3.0 and still gotten in",
          "author": "whitelife123",
          "created": 1606694716,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "ge1ox4l": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ox4l/",
      "text": "Thanks for doing this! Could you do northeastern and Boston University?",
      "author": "VegetableShops",
      "created": 1606665280,
      "upvotes": 103,
      "replies": {
        "ge2kmip": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2kmip/",
          "text": "this!!",
          "author": "kaecactus",
          "created": 1606679240,
          "upvotes": 8,
          "replies": {}
        },
        "ge36wvo": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge36wvo/",
          "text": "^^^^",
          "author": "nushband",
          "created": 1606688759,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "ge1mtkj": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1mtkj/",
      "text": "Hey, could you explain Georgia tech and UT Austin (out of state) please?",
      "author": "Merabethzhuk",
      "created": 1606664556,
      "upvotes": 39,
      "replies": {
        "ge1nb3y": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1nb3y/",
          "text": "These are major tech schools! Can’t believe I forgot them! Will do soon for sure!!",
          "author": "thayirshetti",
          "created": 1606664719,
          "upvotes": 36,
          "replies": {
            "ge2fr0i": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2fr0i/",
              "text": "Are you going to put UT Austin in another post, or just put them here?",
              "author": "MuhsinBaba",
              "created": 1606677289,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1qkji": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1qkji/",
      "text": "I know the Wholesome award isn’t necessarily relevant to the post...but it was my free one, and this post definitely deserves more than a single upvote",
      "author": "KatoLaxBro",
      "created": 1606665862,
      "upvotes": 43,
      "replies": {
        "gecjwfo": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gecjwfo/",
          "text": "same omg",
          "author": "stripedscrunchie",
          "created": 1606894541,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge27b05": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge27b05/",
      "text": "I don’t think WashU is accurate. In fact, the biggest mistake my HS friend with a 4.0/1570 and another with 4.0/1580 thought they made (and I quote them verbatim) was “assuming WUSTL emphasized high stats”. The SAT and ACT range for WashU is honestly about the same as other T20s, so idk where people get the “they especially love high SAT students” shpiel from. Both had strong ECs as well and were rejected RD. Also, almost everyone I know did not do research in high school. \n\nI would say WashU cares more about demonstrated interest than most other schools and showing that they would legitimately be interested in attending the school by showing up to info sessions, attending webinars, clicking emails they send, etc. A lot of students I’ve met here actually weren’t super notable and especially not in the context of this subreddit (i.e many of my friends are Asian but had 3.7 GPAs and 1450-1500 SATs — one person ik is majoring in Bio but got a 2 on the AP test as his only STEM AP score) but all of them mentioned showing a LOT of demonstrated interest when they applied via ED1/2 or visiting and attending their HS infosessions. The reason for the strong emphasis is that WUSTL has a rather low yield rate for a T20 from losing cross-admit battles with other universities and has earned itself a reputation in the past as a school with a lot of strong students who are salty Ivy Rejects (and anecdotally, I know that a fair number of people actually transfer out to more prestigious universities or attempt to do so from being dissatisfied here). From what I have seen so far, they would 100% reject someone they think is a very competitive candidate in favor of someone who might not be a superstar across the board but shows a definite desire to attend. \n\nAnd as unfortunate as it is — your ability to pay the tuition matters. Checking that you plan on filing the FAFSA will lower your chances of admission as WashU is need-aware and considers your financial means. I suspect this is why a sizable number of students that I have met come from relatively expensive private high schools / academies as opposed to public high schools (disclaimer that this does not mean that it’s hard to fit in as someone who isn’t as most people here tend not to flaunt their wealth and are relatively down to earth, but it is still worth a note).",
      "author": "MundyyyT",
      "created": 1606673192,
      "upvotes": 36,
      "replies": {
        "ge4gywl": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4gywl/",
          "text": "This is so true. Honestly, I’m kind of concerned that the OP’s post got so many upvotes without any hedging about admissions being a crapshoot. There are just so many factors that go into college admissions—GPA, SAT scores, ECs, essays, recs, demonstrated interest, etc. And then add in a dash of randomness. The post reads as horoscope-y to me. \n\nMy advice to potential Wash U applicants would be to demonstrate as much interest as you can, work hard on your application, and write an essay that really captures your voice and speaks to who you are. College applications can be super stressful and can feel like the be all end all, but you’re going to have the opportunity to succeed wherever you end up.",
          "author": "feartherex",
          "created": 1606715760,
          "upvotes": 5,
          "replies": {
            "ge4hhbf": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4hhbf/",
              "text": "I agree with this. I have no clue what OP is really going off about, I’ve met so called “innovators” at WashU, my friends have met students with low GPAs and SATs at UC berkeley who didn’t do something ridiculously extraordinary to get there. In fact, these T20 colleges pride themselves on getting a diverse student body with all sorts of interests, and not just one specific caricature that this post claims they are targeting. The only thing anyone can really say for sure about T20 admissions is that someone should have good grades and SATs and no red flags to be competitive. Beyond that and the information provided on the universities’ Common Data Sets, there is not really any hard data stating exactly the type of persona they’re trying to recruit. I only say WashU cares about how much money someone has because they literally say so themselves that they are need-aware. Anything other than a direct confirmation from a university official or admissions officer is to be taken with a grain of salt.",
              "author": "MundyyyT",
              "created": 1606716176,
              "upvotes": 4,
              "replies": {
                "ge4j5i6": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4j5i6/",
                  "text": "So true. You’re a Wash U sophomore; I’m a Wash U grad. We definitely have a different perspective than a high school senior, and in my eyes, OP’s list has some stereotypes that are misleading. I encourage any student to research more into any school that interests them instead of going off of these kinds of generalities.",
                  "author": "feartherex",
                  "created": 1606717552,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge66rg5": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge66rg5/",
          "text": "Thank you for this! WashU is my dream school and OP had me a little freaked out (obviously stats are important but hopefully not everything!)",
          "author": "hippiebabyted",
          "created": 1606760614,
          "upvotes": 2,
          "replies": {}
        },
        "hgpltvl": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/hgpltvl/",
          "text": "WashU is no longer care about demonstrated interests anymore....",
          "author": "wwhhwhhwww",
          "created": 1634280483,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1o5jb": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1o5jb/",
      "text": "I’m not sure how much data you have, but this seems extraordinarily accurate from what I’ve seen. I attend JHU and I can absolutely attest to the fact that they care about innovation the most—both my common app and supplemental essay were about products I created! Many of my friends also did really impressive projects and research in high school. \n\nI don’t know about the GPA bit (mine was pretty good, but I haven’t asked others for theirs), but I can guarantee that the SAT is not at all important for JHU. Of course, I’m not saying that you can outright fail it, but many people I’ve talked to scored in the 1300s or 1400s (myself included) and got in just fine. I think they’re quite lenient on this aspect compared to other schools.",
      "author": "MrDarSwag",
      "created": 1606665023,
      "upvotes": 132,
      "replies": {
        "ge1tuam": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1tuam/",
          "text": "Agreed",
          "author": "orionsgreatsky",
          "created": 1606667076,
          "upvotes": 8,
          "replies": {}
        },
        "gu3ph3l": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gu3ph3l/",
          "text": ">both my common app and supplemental essay were about products I created!\n\nI know this is super old, but I just wanted to say thank you for this—based on this I also wrote my supplemental essay on a product I made and I'm about to commit to JHU :) again tysm",
          "author": "perfectlypeabrained",
          "created": 1618103690,
          "upvotes": 3,
          "replies": {
            "gu3prs0": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gu3prs0/",
              "text": "Congratulations, so happy for you! Hope you enjoy it here, and welcome to the nest!",
              "author": "MrDarSwag",
              "created": 1618103862,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "ge21qbg": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21qbg/",
          "text": "1400 sat wont be a disadvantage even for internationals who need aid?",
          "author": "irox123",
          "created": 1606670415,
          "upvotes": 1,
          "replies": {
            "ge25i7n": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25i7n/",
              "text": "Ah, now there’s the exception. My two suitemates are actually international and both had very good SAT scores. In general, I’ve noticed that all of the internationals have surprisingly high SAT scores compared to domestic students, and they are the top performers in many classes. It’s just a theory, but I believe that the criteria for international applicants is a lot more rigorous than the criteria for domestic students. My comment on SAT scores refers primarily to domestic students.",
              "author": "MrDarSwag",
              "created": 1606672301,
              "upvotes": 5,
              "replies": {
                "ge26b5x": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge26b5x/",
                  "text": "Ahh i see.. thank you!! What do you think it will be like for internationals now that SAT is optional? Will this change anything?",
                  "author": "irox123",
                  "created": 1606672695,
                  "upvotes": 1,
                  "replies": {
                    "ge2cs9j": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2cs9j/",
                      "text": "I’m honestly not too sure, but I’d assume that they put more emphasis on your GPA and ECs. Just a guess though.",
                      "author": "MrDarSwag",
                      "created": 1606675862,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ge28e0y": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge28e0y/",
          "text": "what was your GPA, weighted and uw? thanks!",
          "author": "guacamolenippatoilet",
          "created": 1606673723,
          "upvotes": -2,
          "replies": {
            "ge2coed": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2coed/",
              "text": "It was about a 4.2 W and 3.9 UW by the time I started applying for colleges.",
              "author": "MrDarSwag",
              "created": 1606675810,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1o917": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1o917/",
      "text": "Feels bad when almost all of the schools on my list here like ECs over academics when my ECs are weak but my academics are strong :(",
      "author": "DaaaYankeesLose",
      "created": 1606665056,
      "upvotes": 140,
      "replies": {
        "ge1rc2l": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rc2l/",
          "text": "Saaaaame and like I'm so nervous about joining ECs too and bc there aren't many that are very apparent in my area idek what to do.",
          "author": "remembertherats",
          "created": 1606666133,
          "upvotes": 44,
          "replies": {}
        },
        "ge1qafu": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1qafu/",
          "text": "omg SAME. I feel like I made some sort of fundamental mistake in my fresh/soph yrs by focusing so heavily on my classes and grades. and now because of corona I feel like my ecs are just pitiful like ughhhgg",
          "author": "spineappletwist",
          "created": 1606665753,
          "upvotes": 26,
          "replies": {}
        },
        "ge4idbe": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4idbe/",
          "text": "I had a 4.0 unweighted GPA and 1600 SAT, and my ECS were nothing special. I was in one club, did band, volunteering, and had no leadership positions and had no prizes or awards. I went to Wash U. I think my essays were good and helped me put together a cohesive picture of who I was and what I would add to the school. There are plenty of schools that look highly upon students who have only a few ECs that they’re dedicated to (even if they’re not rock stars at their ECs).\n\nI think your essays will be important, as well as the tier of school. If you have top grades and scores, I think top 10-20 schools are completely reasonable, especially with good essays. This list is one high school senior’s perspective. Keep in mind that the top schools not only look for well-rounded students but also a well-rounded class of students, and your application will help you make the argument to be the student to help round out that class.",
          "author": "feartherex",
          "created": 1606716909,
          "upvotes": 7,
          "replies": {}
        },
        "ge26b9c": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge26b9c/",
          "text": "yep 🤘😔🤘\n\nhoping my grades and sat can carry me enough but i don’t know any schools that value GPA/SAT very highly besides the ones listed here",
          "author": "Gecko---",
          "created": 1606672697,
          "upvotes": 10,
          "replies": {
            "ge3ld6h": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3ld6h/",
              "text": "wait what top schools value GPA/SAT very highly??? cause all I have to my name is a 4.57 and 1540 LOL. my ec's are complete trash. i honestly don't know which schools I have a chance at getting into",
              "author": "codyfernfan",
              "created": 1606696401,
              "upvotes": 2,
              "replies": {
                "ge3w1xb": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3w1xb/",
                  "text": "The list says CMU, Washu, UCB and UCLA I’m pretty sure",
                  "author": "Gecko---",
                  "created": 1606702504,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge5dgjv": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge5dgjv/",
      "text": "**Your UVA statement is incorrect.**\n\nWe're going to admit 9,000 students. We don't expect every student to differentiate themselves. OOS admission is more competitive, but we are looking for the same things. I feel really strongly about being clear in our communications - we want to see excellent course selection and grades (which the GPA does not convey) first and foremost, then strong recs, essays, and activities. Academics have always come first. It's not about doing unusual or unique things. Check the admission blog for more. I talk about this a lot!",
      "author": "UVaDeanj",
      "created": 1606745656,
      "upvotes": 24,
      "replies": {
        "ge5nobn": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge5nobn/",
          "text": "Thanks for the info, but does standing out not matter at all? Granted, there are going to be thousands of applicants with perfect scores. But for those applicants that put their heart into something else, but then improved in academics over time and took challenging courses, are they at a disadvantage? Thanks sir.",
          "author": "thayirshetti",
          "created": 1606751349,
          "upvotes": 3,
          "replies": {
            "geo9bev": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/geo9bev/",
              "text": "Ma’am*\nDean J probably gonna disagree with me but I doubt any college admissions office is widely different than the others. Maybe a few outliers.",
              "author": "lefukcos",
              "created": 1607145263,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "ge2649j": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2649j/",
      "text": "You can be a perfect candidate for each of these schools and still get denied. \n\nI know someone who got a 1590 on the SAT, took 22 AP exams and managed to receive a 5 in all them (10 of which she self studied for), had a 4.4 GPA, had a total of 34 extracurriculars (in & out of school combined starting from freshman year) she was a leader for about half of her ECs, about 4,000 hours of community service. Just a side note, half of her ECs are continuos (to show that she has passion) and about half are new ECs where she tried new stuff. And yes, these are not your easy going ECs. Her ECs are the types where they met everyday. She also had people from Northwestern and University of Chicago proofread her essay. \n\nWith all that hard work guess what?? Still got denied by Stanford, MIT, Brown, and Caltech. She managed to get accepted to Yale though. \n\nWhen applying to T20s just try your best to have good school records and always remember that LUCK comes into play. \n\nUp to this day, I don’t understand how she got denied. \n\nAs I said, you CAN be the perfect student and still get denied.",
      "author": "SillyWillyBillyLilly",
      "created": 1606672601,
      "upvotes": 19,
      "replies": {
        "ge26peb": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge26peb/",
          "text": "Oh yeah. Luck is a major part. Maybe affordability played a role in her admissions?",
          "author": "thayirshetti",
          "created": 1606672891,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "ge1so9s": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1so9s/",
      "text": "I'm so glad that I'm able to contribute at least 1% to make college applications less stressful, and I thank you all for your great questions! I will definitely continue to update this post, so be sure to check back! Colleges aren't all about GPAs! There's so much more to the equation! Work hard, play hard, and most importantly, be passionate.",
      "author": "thayirshetti",
      "created": 1606666611,
      "upvotes": 77,
      "replies": {
        "ge2egaq": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2egaq/",
          "text": "Could you explain Duke?",
          "author": "Immortal_Ninja_Man",
          "created": 1606676660,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge23z3v": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge23z3v/",
      "text": "Can you please do Georgia Tech?\n\nIt is my dream school and now I'm really curious to know their standards. I know there are a lot of comments, but would greatly appreciate if you could help on this one as well. Thanks a bunch!",
      "author": "BobBob1000000",
      "created": 1606671545,
      "upvotes": 17,
      "replies": {
        "ge25pc6": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25pc6/",
          "text": "Sure! It's a great tech school, don't know how I missed it.",
          "author": "thayirshetti",
          "created": 1606672398,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "ge1wrar": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1wrar/",
      "text": "Hey man just wanted to say thanks for putting this all together, definitely took a lot of work. For umich, what do you mean by “what sets u apart if ur applying out of state?” Like should my essays focus on why umich compared to my state or my ecs/grades and how I’m an accomplished student so that sets me apart. Thx a bunch",
      "author": "pHaNTommz15",
      "created": 1606668243,
      "upvotes": 30,
      "replies": {
        "ge1x4zk": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1x4zk/",
          "text": "Hey! So UMich is definitely looking for students who are very interested in their major. They also want students who have contributed to a community. No matter how you go about writing your essay, look for things that make you interesting. Things you've done for the community. And most importantly, what you intend to do in the future with your major. Good luck bro! :))",
          "author": "thayirshetti",
          "created": 1606668398,
          "upvotes": 26,
          "replies": {
            "ge55ho1": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge55ho1/",
              "text": "Thanks man that really helps. Again, can’t thank u enough for making this list and showing us what these different AOs want.",
              "author": "pHaNTommz15",
              "created": 1606739792,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ge26xby": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge26xby/",
          "text": "Happy Cake Day!",
          "author": "MrJelloYT",
          "created": 1606673003,
          "upvotes": 2,
          "replies": {
            "ge55igv": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge55igv/",
              "text": "Thanks!",
              "author": "pHaNTommz15",
              "created": 1606739811,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ge2wb3a": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2wb3a/",
          "text": "happy cake day!!",
          "author": "wafabhayani",
          "created": 1606683633,
          "upvotes": 1,
          "replies": {
            "ge55iwn": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge55iwn/",
              "text": "Thanks!",
              "author": "pHaNTommz15",
              "created": 1606739821,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1zz8k": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1zz8k/",
      "text": "I think it's worth expanding on U Chicago. \n\nGood essays that convey your personality well don't' get you in.  Good essays that show you vibe with the school will get you in.\n\nThey don't look for people who can solve differential equations in their heads. They look for people who ENJOY solving differential equations, on paper or in their head.\n\n&#x200B;\n\nI was so excited about seeing your analysis and was momentarily confident in myself, but then I saw the last line and realized basically everyone applying is going to have pog essays",
      "author": "TooShyToSayILoveYou",
      "created": 1606669540,
      "upvotes": 35,
      "replies": {}
    },
    "ge1lxgk": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1lxgk/",
      "text": "Have you heard anything about Emory?",
      "author": "takenpassword",
      "created": 1606664233,
      "upvotes": 14,
      "replies": {
        "ge1mnu0": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1mnu0/",
          "text": "Pretty sure Emory wants students who fit in their atmosphere of “work hard, play hard.” They want kind students who are passionate about what they intend to do!",
          "author": "thayirshetti",
          "created": 1606664506,
          "upvotes": 31,
          "replies": {
            "ge1n2kw": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1n2kw/",
              "text": "I hope I fit that criteria well enough 😳",
              "author": "takenpassword",
              "created": 1606664638,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1t8ea": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1t8ea/",
      "text": "Could we do a bit more in-depth for Stanford?",
      "author": "mynameisjeff0704",
      "created": 1606666831,
      "upvotes": 11,
      "replies": {
        "ge1tewa": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1tewa/",
          "text": "For sure! I realize that many of you guys are applying there.",
          "author": "thayirshetti",
          "created": 1606666899,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "ge1kftm": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1kftm/",
      "text": "Could you explain more about each Ivies? Brown, Yale, Dartmouth, Columbia...",
      "author": "slee20512",
      "created": 1606663701,
      "upvotes": 25,
      "replies": {
        "ge1ldr4": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ldr4/",
          "text": "For sure, it’s just gonna take some time though. I’ve grouped them into two categories: Ivies that look for students that are very interested in their intended major and students who have had an experience or experiences so great that they can share them with other students for the school “vibe” to last for generations. Cornell and Columbia seem to fall under the first category, while the rest fall in the latter. The myth that Ivies look for strong reading scores.... is most likely false. More on this later, thanks for your question bro!!",
          "author": "thayirshetti",
          "created": 1606664038,
          "upvotes": 28,
          "replies": {
            "ge1lpyo": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1lpyo/",
              "text": "OMG It's great! Thank you so much :)",
              "author": "slee20512",
              "created": 1606664156,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "gecjy91": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gecjy91/",
          "text": "!RemindMe 2 weeks",
          "author": "stripedscrunchie",
          "created": 1606894589,
          "upvotes": 1,
          "replies": {
            "gecjzj2": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gecjzj2/",
              "text": "I will be messaging you in 14 days on [**2020-12-16 07:36:29 UTC**](http://www.wolframalpha.com/input/?i=2020-12-16%2007:36:29%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gecjy91/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fk3akox%2Fanalysis_on_what_t20_schools_want%2Fgecjy91%2F%5D%0A%0ARemindMe%21%202020-12-16%2007%3A36%3A29%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20k3akox)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "author": "RemindMeBot",
              "created": 1606894620,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1q2gw": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1q2gw/",
      "text": "Could you explain UofM in state, please? Especially for Ross? I've heard it's easier to get in when you live in MI, but Ross is just so selective and I have no opportunities for business ECs.",
      "author": "spineappletwist",
      "created": 1606665668,
      "upvotes": 8,
      "replies": {
        "ge1qra4": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1qra4/",
          "text": "Ross is definitely selective, but they're looking for students who have a passion for business. How have you explored business outside of the classroom? It's pretty evident from their essays that they definitely do want somebody who can not only learn, but also contribute to the learning environment at Ross. Just think: what have you done or intend to do in regards to \"business?\" Good luck bro! Hope you get in. There might be less applicants this time. :)",
          "author": "thayirshetti",
          "created": 1606665931,
          "upvotes": 14,
          "replies": {
            "ge1r4nk": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1r4nk/",
              "text": "[deleted]",
              "author": null,
              "created": 1606666062,
              "upvotes": 2,
              "replies": {
                "ge1rwtw": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rwtw/",
                  "text": "Ah, I see. And AOs understand that! But try to research more about business then. How do you plan to pursue business in the future? These are some questions I suggest you think about. :)",
                  "author": "thayirshetti",
                  "created": 1606666340,
                  "upvotes": 3,
                  "replies": {}
                },
                "ge279gs": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge279gs/",
                  "text": "What kind of business field do you want to go into? There is plenty you can do with personal projects",
                  "author": "Jokernun",
                  "created": 1606673172,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "ge2ck2a": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ck2a/",
              "text": "I don't have any business ECs, but I work 20+ hours a week in hospitality and have some communication heavy ECs. I also attended their fly-in to demonstrate interest. Do you think that kind of is enough. I know you don't work there or anything but I'm hella anxious",
              "author": null,
              "created": 1606675752,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1vk15": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1vk15/",
      "text": "This is a super interesting post, OP!  Awesome!  If you are a senior, I wish you the best of luck with your applications!\n\nHave a nice day!",
      "author": "eccentricgalaxy",
      "created": 1606667765,
      "upvotes": 10,
      "replies": {
        "ge1wcf7": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1wcf7/",
          "text": "Thanks, and yes, I am a senior. Good luck to you as well! :)",
          "author": "thayirshetti",
          "created": 1606668083,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ge21bbk": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21bbk/",
      "text": "[deleted]",
      "author": null,
      "created": 1606670204,
      "upvotes": 12,
      "replies": {
        "ge21jgs": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21jgs/",
          "text": "Oh yeah for sure! Have heard many people like them!",
          "author": "thayirshetti",
          "created": 1606670319,
          "upvotes": 4,
          "replies": {}
        },
        "ge37yol": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge37yol/",
          "text": "Did she get in?",
          "author": "Forsaken-Key-9306",
          "created": 1606689303,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1oiit": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1oiit/",
      "text": "Saved! Do extraordinary ECs have to be national? My best ones are statewide :/",
      "author": "perfectlypeabrained",
      "created": 1606665147,
      "upvotes": 28,
      "replies": {
        "ge2665c": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2665c/",
          "text": "no lol my “national” ec was ap scholar with distinction... i got into uchicago ed i",
          "author": "daolmo17",
          "created": 1606672627,
          "upvotes": 26,
          "replies": {
            "ge2e4fa": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2e4fa/",
              "text": "Congrats!!",
              "author": "a1zteakzauce",
              "created": 1606676501,
              "upvotes": 3,
              "replies": {
                "ge2e66c": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2e66c/",
                  "text": "lol thank u",
                  "author": "daolmo17",
                  "created": 1606676525,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "ge2sqr6": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2sqr6/",
              "text": "umm what the f?  UCHICAGO DECISIONS ARE OUT",
              "author": "rero0",
              "created": 1606681993,
              "upvotes": 2,
              "replies": {
                "ge2tgoq": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2tgoq/",
                  "text": "no read my other comment",
                  "author": "daolmo17",
                  "created": 1606682332,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "ge2ni5v": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ni5v/",
              "text": "UChicago results came out already?",
              "author": "ygenluryak",
              "created": 1606680148,
              "upvotes": 1,
              "replies": {
                "ge2oqlz": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2oqlz/",
                  "text": "no, i got in early bc im from chicago, applied ed, and submitted my app at the end of september",
                  "author": "daolmo17",
                  "created": 1606680532,
                  "upvotes": 6,
                  "replies": {
                    "ge37vkb": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge37vkb/",
                      "text": "Ohh okay, congrats!!!",
                      "author": "ygenluryak",
                      "created": 1606689257,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ge377rk": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge377rk/",
              "text": "Can I pm you",
              "author": "Forsaken-Key-9306",
              "created": 1606688914,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1jhh7": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1jhh7/",
      "text": "what qualifies as an ok ec?",
      "author": "ohyesitstuesday",
      "created": 1606663353,
      "upvotes": 9,
      "replies": {
        "ge1jvag": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1jvag/",
          "text": "Anything that you’re passionate about! An ok EC could even be contributing something to your club, volunteering, etc. Just think - what makes you exciting??",
          "author": "thayirshetti",
          "created": 1606663502,
          "upvotes": 23,
          "replies": {
            "ge1kio1": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1kio1/",
              "text": "Ah ok, my mom kind of have me freaking out a little bit because she said my uncle (Duke alumni also went to their med school) said that although it's good I have something I'm interested in they wanted to see more than \"just being a fan of something you like. Most of my \"ecs\" are hobbies so I don't really participate in any competitions or conventions for any of them and that kind of has me worrying",
              "author": "ohyesitstuesday",
              "created": 1606663727,
              "upvotes": 9,
              "replies": {
                "ge1sbfm": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1sbfm/",
                  "text": "Duke and Vandy want just that! What are your hobbies? What are you passionate about?",
                  "author": "thayirshetti",
                  "created": 1606666483,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "ge407ke": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge407ke/",
              "text": "So would quizbowl for me be a good club? I’ve done it all 4 years, I love it. I’ve been one of the core members. I’m very passionate about it but I don’t really know how to demonstrate that in writing😅",
              "author": "KillerAc1",
              "created": 1606704783,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1k4c7": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1k4c7/",
      "text": "Hello! Could you do one for Harvey Mudd? I know this is specific but it’s one of the most unique LACs I’ve seen. Thank you!",
      "author": "Former-Extreme",
      "created": 1606663593,
      "upvotes": 7,
      "replies": {
        "gesuula": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gesuula/",
          "text": "Yes, and the Claremont Colleges in general! It's so interesting that they're each small schools that function in this larger community and I love the fact that I'd be able to get the best of both really small and larger schools! This post, btw, OP, is incredible! You put so much work into it and I'm sure it'll help people massively who are still searching! I know if I had this when I was searching my list would probably be very different lol. I was also wondering if later you would do non T-20 yet still popular schools? \n\nThank you!",
          "author": "gravityneon",
          "created": 1607244593,
          "upvotes": 2,
          "replies": {}
        },
        "ge2te84": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2te84/",
          "text": "Yeah at least to me it feels like HMC is similar to MIT and CalTech in that they want really strong STEM ECs and good grades, but I think they also want to see how the student has cross disciplinary abilities and can take advantage of all the humanities courses there.",
          "author": "ClearlyADuck",
          "created": 1606682299,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1tb7x": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1tb7x/",
      "text": "For CMU: I've never won a hackathon, but I was on a team that did very well in picoCTF, CMU's sponsored CTF (29th/20,000ish) and also did CMU SAMS my sophomore year and am re-applying this year. My grades are okay (3.7-3.8ish) and my SAT is fine (taking in a week, practicing around 1540). Does this fall into what CMU is looking for?",
      "author": null,
      "created": 1606666860,
      "upvotes": 9,
      "replies": {
        "ge1tlg1": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1tlg1/",
          "text": "Absolutely. These E.C.s and grades are great!!  Well done. I think you'll get in, but we'll have to see since CS is very competitive there. Be sure to apply to schools like Purdue too just in case. Nice though!",
          "author": "thayirshetti",
          "created": 1606666974,
          "upvotes": 11,
          "replies": {
            "ge1toa3": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1toa3/",
              "text": "I'd also suggest that you list 1-2 non-tech based E.C.s just to show that you're rounded, but I doubt that CMU looks for those.",
              "author": "thayirshetti",
              "created": 1606667006,
              "upvotes": 8,
              "replies": {
                "ge1yc9f": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1yc9f/",
                  "text": "Oh I have theater and debate! Most of my ECs are CS-related, but I'm also board member for a theater festival (and a school actor) plus a leader on my school's debate team!",
                  "author": null,
                  "created": 1606668882,
                  "upvotes": 6,
                  "replies": {
                    "gegwsl0": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gegwsl0/",
                      "text": "Theater! Definitely list Theater! I went to CMU for my MBA, and was pleasantly surprised to find out they have one of the topmost Drama programs in the US.",
                      "author": "prsehgal",
                      "created": 1606984312,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ge1tpts": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1tpts/",
              "text": "Thank you so much!! And thank you also for doing this for A2C. This is great work!",
              "author": null,
              "created": 1606667024,
              "upvotes": 1,
              "replies": {
                "ge1uf7y": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1uf7y/",
                  "text": "Thank you so much! :)",
                  "author": "thayirshetti",
                  "created": 1606667319,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge24eye": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge24eye/",
      "text": "u/admissionsmom what is your analysis on this haha?",
      "author": "secretcollegeaccount",
      "created": 1606671764,
      "upvotes": 8,
      "replies": {
        "gedgwgq": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gedgwgq/",
          "text": "Oh wow. I just saw this. Will have to read through to give an analysis! 😊",
          "author": "admissionsmom",
          "created": 1606920950,
          "upvotes": 2,
          "replies": {
            "geseeaf": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/geseeaf/",
              "text": "!remindme 3 days",
              "author": "ibapconflicted",
              "created": 1607235984,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ge2bty1": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bty1/",
      "text": "Idk, I feel like many of these are just generally good things to have as an applicant which all schools look for, and this categorization is just the result of confirmation bias. \n\nThis post is good though so people know generally what schools would look for, and they can work towards these things. But I wouldn't rely on this post to think about specific schools strategically.",
      "author": "PedaleFrancisca",
      "created": 1606675399,
      "upvotes": 7,
      "replies": {}
    },
    "ge29494": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge29494/",
      "text": "Gen X here who went to an Ivy with a B average in high school, who for some reason stumbled upon this post and sub.  One time advice for the entire sub: college admissions, getting a job, starting a company, etc. all fundamentally on other humans’ ability to connect with a story.  Be intentional with you story.  Show; don’t tell.  That story might actually be useful to you when you show up at college and wonder WTF now.\n\nAs for grades, do your best but don’t sweat it.  I quickly learned that the folks who were to become math professors and physics professors were fun friends, but I also realized that I could create connections across disciplines that they didn’t see.  I was def a bit over my head as a freshman and mostly got Cs at first, perhaps a result of my trying to punch a bit higher than my weight.  In hindsight, my time would have been better spent slowing down and not rushing up the mountain of technical education.  \n\nHave had two successful startups and am working on a third as CTO.  I consider myself very fortunate, but it’s hard to attribute much of that to the Ivy League pedigree and connections.  Most successful people I know did not go to top schools.  \n\nIt’s fine to not know what you want to be when you grow up.  I’m still not sure I do.  But try to focus on derivative instead of position.  Specifically, if you don’t feel that there’s a story that explains you and your current direction (that’s a lot to ask anyone), one place to start with with what you are curious about.  What questions do you have about the world?  What projects, the the loose sense, are you currently working on to answer those questions?  How will your education give you better to tools to not only answer those questions, but also ask better questions?",
      "author": "customdemo",
      "created": 1606674078,
      "upvotes": 14,
      "replies": {}
    },
    "ge24j1s": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge24j1s/",
      "text": "I’m an NU student, and I’m not sure I agree with what you have for NU here. NU does not admit by major, allows you to switch majors (even schools) very easily, does not have a single essay about major, and (anecdotally) it feels like everyone here has 2 majors and switches at least once. \n\nI honestly think that NU admissions are among the most predictable of T20s — get a 34, top 5% of your class, a few classic ECs (sports, student government, newspaper, etc...), and you’re more likely than not going to be admitted ED. RD is a lot more random, and demonstrated interest helps a lot. I’d say that we’re most like WashU and Vanderbilt in admissions — a higher stats threshold than most Ivies, but a lower threshold for “intangibles.”",
      "author": null,
      "created": 1606671819,
      "upvotes": 11,
      "replies": {
        "ge58zch": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge58zch/",
          "text": "Also, lumping Northwestern University with Purdue and UIUC’s engineering departments is certainly... a choice.",
          "author": "BabyFaceIT",
          "created": 1606742597,
          "upvotes": 6,
          "replies": {}
        },
        "ge39m5q": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge39m5q/",
          "text": "Do universities consider interest demonstrated AFTER the application submission? E.g. if I attend more events even though I've already submitted my app, will they look like that?\n\nAnd, when colleges see who attended the events, do they look at email or name? I sign up for events with my school email but my CommonApp email is my personal email ...",
          "author": "wordgenius",
          "created": 1606690163,
          "upvotes": 1,
          "replies": {
            "ge3bzmt": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3bzmt/",
              "text": "They might look through it. If you *really* want to demonstrate interest, send the AO a brief update of your latest accomplishments, and reaffirm how excited you are about the school.",
              "author": null,
              "created": 1606691401,
              "upvotes": 1,
              "replies": {
                "ggvb9u1": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ggvb9u1/",
                  "text": "Can you expand more on how to do that?",
                  "author": "RandomPerson777666",
                  "created": 1608783773,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge3btsl": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3btsl/",
          "text": "How do I demonstrate interest for northwestern (esp during this time)",
          "author": "Dependent-Fisherman2",
          "created": 1606691315,
          "upvotes": 1,
          "replies": {
            "ge3c4op": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3c4op/",
              "text": "Go to every event you can that tracks your name, email your AO an update that reaffirms your excitement about the school, make your essays *specific*, and maybe reach out to a professor or two to ask about their department.",
              "author": null,
              "created": 1606691476,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1qs1v": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1qs1v/",
      "text": "You have anything on NYU Stern? Also, what metrics are you using to using to come to these conclusions?",
      "author": "FewElevator4",
      "created": 1606665938,
      "upvotes": 8,
      "replies": {
        "ge1r6c2": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1r6c2/",
          "text": "Hey! No conclusions bro. Have surfed the internet and college websites, talked to AOs, heard from AOs on Reddit, attended NUMEROUS webinars, studied Naviance scatterplots, etc. to generalize these things. But remember that nothing is set in stone. Like a school? Definitely apply bro. I see that you're a junior and wish you nothing but the best of luck!! Do remember to work hard this year. Junior year matters the most bro. Kill it!! :)",
          "author": "thayirshetti",
          "created": 1606666078,
          "upvotes": 19,
          "replies": {
            "ge1ryc6": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ryc6/",
              "text": "Thanks fam, this post is fire, appreciate you taking the time to write it out",
              "author": "FewElevator4",
              "created": 1606666354,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1r2i6": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1r2i6/",
      "text": "Harvard pls:)",
      "author": "AsleepImagination1",
      "created": 1606666042,
      "upvotes": 8,
      "replies": {
        "ge1rxky": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rxky/",
          "text": "Soon!",
          "author": "thayirshetti",
          "created": 1606666347,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ge1uj2z": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1uj2z/",
      "text": "thank you for this!! i go to a STEM high school, where literally everyone does research at universities, yet only a few ppl get into t20 schools; i think this is partially because my school does not offer AP classes, they offer classes that are pretty much equally as hard (as in, I've taken AP tests with just the knowledge of the class and scored well) but without the label - i think that the rigor of our curriculum is not made aware to AOs as much as it should be, bc sometimes, I feel like they might see no APs or no honors and automatically just assume the rigor of the high school. I have no idea if this is completely true, but it might play a factor (please correct me if i'm wrong though). My advice to other younger students is to go to a high school where the rigor of the curriculum is self-presenting. (again, someone should correct me if i'm wrong lol)",
      "author": "seporpopo",
      "created": 1606667366,
      "upvotes": 6,
      "replies": {
        "ge1vbvc": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1vbvc/",
          "text": "Yep! Definitely agree. I think that AOs are looking to see where you stand in a class and whether you've consistently improved or not. Some schools don't even rank, so they compare you with other students. Anyways, are you able to take AP classes online? :)",
          "author": "thayirshetti",
          "created": 1606667676,
          "upvotes": 1,
          "replies": {
            "ge1xltt": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1xltt/",
              "text": "yeah we can take AP classes online, but i just ended up self studying for a few them bc of cost lol\n\nbut tbh my school is so weird. no rank, no GPA calculated, at all. also, before COVID, we weren't allowed to get a job (i go to a residential public high school so they could control that) while in the school year, and no dual enrollment classes during the school year, and they restricted the number of EC leadership positions that we could hold. it's like they didnt want some of us to get into college smh lol",
              "author": "seporpopo",
              "created": 1606668581,
              "upvotes": 1,
              "replies": {
                "ge2tznn": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2tznn/",
                  "text": "I wonder if you can email your local AOs about it, like hey my school is in an odd situation  blah blah blah, can you explain to me how that might be evaluated in admissions?",
                  "author": "ClearlyADuck",
                  "created": 1606682580,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ger7n2i": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ger7n2i/",
          "text": "Your school sends (at least should be sending) a school profile to your colleges that specifies they don’t have APs and what courses are considered rigorous. My school doesn’t have APs, yet 50% of the graduating class goes to a T20",
          "author": "lovemesomenuggets",
          "created": 1607214060,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1vpv7": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1vpv7/",
      "text": "I know someones already asked but more on yale plz!!!!!! Tysm for the post ur amazinggg<3<3",
      "author": "helpmeplease849",
      "created": 1606667831,
      "upvotes": 6,
      "replies": {
        "ge1wdq6": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1wdq6/",
          "text": "Oh yeah definitely will do Yale by the end of today. Thanks!! :)",
          "author": "thayirshetti",
          "created": 1606668097,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ge1k65t": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1k65t/",
      "text": "Great job dude! I am gonna save this post",
      "author": "Wolverine002",
      "created": 1606663609,
      "upvotes": 6,
      "replies": {
        "ge1kx4a": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1kx4a/",
          "text": "Thanks dude. Will keep adding schools.",
          "author": "thayirshetti",
          "created": 1606663871,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ge1z3pu": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1z3pu/",
      "text": "Hey this is amazing. Could you do Emory and NYU? They’re my ED colleges and my dream schools. I would really like to know about these ones Thanks!!",
      "author": "VTDMAN7",
      "created": 1606669195,
      "upvotes": 6,
      "replies": {
        "ge4adal": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4adal/",
          "text": "You mean early colleges? Ya cant ED to multiple colleges..",
          "author": "Gappia",
          "created": 1606710958,
          "upvotes": 1,
          "replies": {
            "ge4c0lm": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4c0lm/",
              "text": "Umm ED1 and ED2",
              "author": "VTDMAN7",
              "created": 1606712076,
              "upvotes": 1,
              "replies": {
                "ge4ep12": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4ep12/",
                  "text": "Ah shit yeah that actually makes sense my bad",
                  "author": "Gappia",
                  "created": 1606714013,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge1jx3f": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1jx3f/",
      "text": "Could you elaborate on Rice? :)",
      "author": "Dragonfly-Current",
      "created": 1606663520,
      "upvotes": 3,
      "replies": {
        "ge1kt5d": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1kt5d/",
          "text": "Hey bro! Rice definitely wants students who are very strong academically and who have good SAT scores. On the non-academic end, the AOs are really looking for students who think differently, much like UChic does. Have you ever dealt with an unfavorable circumstance but then created something positive out of it? Can you portray something small in different light? I’m pretty sure that’s what Rice AOs want. 😃",
          "author": "thayirshetti",
          "created": 1606663828,
          "upvotes": 13,
          "replies": {
            "ge1l8uj": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1l8uj/",
              "text": "Cool! I applied ED so too late to change anything lol but this is a very helpful and insightful post. Thank you so much!",
              "author": "Dragonfly-Current",
              "created": 1606663993,
              "upvotes": 2,
              "replies": {
                "ge1lmc5": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1lmc5/",
                  "text": "Sorry that I was late! Will keep adding schools. Remember that there’s more time for regular action! Hope you get into you’re dream school!",
                  "author": "thayirshetti",
                  "created": 1606664119,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge1rm1u": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rm1u/",
      "text": "Wow! This is great info!! Can you please offer more insight about UVA, preferably in state?",
      "author": "inflewants",
      "created": 1606666231,
      "upvotes": 3,
      "replies": {
        "ge1xy4b": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1xy4b/",
          "text": "I was UVA in-state (here for genera advice on applying to grad programs!) I personally felt UVA valued me as an individual with interests and passions more than say VT which only wanted hard numbers like GPA, SAT and ACT scores. My extracurriculars showed I had more to offer than just my scores could tell you. UVA also offered the chance to send a portfolio which no other program did for my area of study",
          "author": "KillroysGhost",
          "created": 1606668722,
          "upvotes": 3,
          "replies": {}
        },
        "ge1rqa1": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1rqa1/",
          "text": "Oh yeah, for sure! Coming soon. Be sure to save this post so that you can come back when I update it! Hope you get into UVA. Great school!",
          "author": "thayirshetti",
          "created": 1606666275,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ge1t6k5": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1t6k5/",
      "text": "What exactly counts as an extraordinary EC?",
      "author": "SemiDeadGhost",
      "created": 1606666811,
      "upvotes": 5,
      "replies": {
        "ge1ubbw": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ubbw/",
          "text": "[deleted]",
          "author": null,
          "created": 1606667271,
          "upvotes": 13,
          "replies": {
            "ge21zfe": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21zfe/",
              "text": "I’m famous enough on tiktok for sutherlandphys to follow me that’s all I got :(",
              "author": "SemiDeadGhost",
              "created": 1606670540,
              "upvotes": 9,
              "replies": {
                "ge22a29": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge22a29/",
                  "text": "Mention that on the honors section if you want! :)",
                  "author": "thayirshetti",
                  "created": 1606670691,
                  "upvotes": 3,
                  "replies": {
                    "ge22kgs": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge22kgs/",
                      "text": "I’m not gonna risk an AO finding my tiktok... I have some measly research at Stanford and a paper to make up for it",
                      "author": "SemiDeadGhost",
                      "created": 1606670837,
                      "upvotes": 1,
                      "replies": {
                        "ge22p2r": {
                          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge22p2r/",
                          "text": "Nice!",
                          "author": "thayirshetti",
                          "created": 1606670902,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ge2d01i": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2d01i/",
                  "text": "damnnnn no need to flex",
                  "author": null,
                  "created": 1606675967,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge1zxd9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1zxd9/",
      "text": "Do you know anything about NYU in general, and specifically for Stern?",
      "author": "ryandemotte",
      "created": 1606669517,
      "upvotes": 6,
      "replies": {
        "ge3a0k4": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3a0k4/",
          "text": "Yep, seconding this!",
          "author": "wordgenius",
          "created": 1606690367,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge21rq0": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21rq0/",
      "text": "bruh moment: reading this after i wrote my UC hicago essays two days before the deadline",
      "author": "kli678",
      "created": 1606670435,
      "upvotes": 3,
      "replies": {
        "ge21tuj": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21tuj/",
          "text": "Haha, that's fine! Did you passionately write your essays or rush them?",
          "author": "thayirshetti",
          "created": 1606670464,
          "upvotes": 2,
          "replies": {
            "ge22imf": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge22imf/",
              "text": "well i felt pretty passionate but honestly who knows what the AOs will see",
              "author": "kli678",
              "created": 1606670811,
              "upvotes": 2,
              "replies": {
                "ge2uafn": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2uafn/",
                  "text": "Me with literally application dude... But when I turn them in I'm satisfied so who knows? Plus I found that a lot of ideas are recyclable. It's like chiselling a new statue for a school with the same block of concepts.",
                  "author": "ClearlyADuck",
                  "created": 1606682718,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge22z8h": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge22z8h/",
      "text": "Bro reading that UChicago comment was like throwing off a backpack full of bricks! My test scores fall within their middle 50 percent, and my EC’s are pretty decent, but I was SUPER proud of both of my UChicago essays. I’d definitely consider them to be the strongest part of my application (I put over 25 hours into my Why UChicago essay alone). I know I’ve still got a fairly low chance come mid-December, but knowing that value essays so heavily makes me think that I may have a semi-okay shot. Thank you so much for doing all of this research, OP!",
      "author": "SwamiTsunami",
      "created": 1606671044,
      "upvotes": 5,
      "replies": {
        "ge25uqt": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25uqt/",
          "text": "Oh, amazing!!! Dude I really hope you get in! Essays are almost everything at UChic!!",
          "author": "thayirshetti",
          "created": 1606672471,
          "upvotes": 2,
          "replies": {
            "ge25v5u": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25v5u/",
              "text": "They want thinkers!",
              "author": "thayirshetti",
              "created": 1606672477,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge2a239": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2a239/",
      "text": "I hate how highly weighted ECs are. I have a 4.8 Weighted gpa and my only impressive EC is having a job for the past two years working 30+ hours a week.",
      "author": "NoHacksJustTacos",
      "created": 1606674532,
      "upvotes": 2,
      "replies": {
        "ge2ucvt": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ucvt/",
          "text": "Is your school gpa out of 5 normally?",
          "author": "ClearlyADuck",
          "created": 1606682748,
          "upvotes": 1,
          "replies": {
            "ge3dlod": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3dlod/",
              "text": "No it’s 4. I’m dumb I meant I have a 4.8 weighted my bad. I have a 4.0 UW.",
              "author": "NoHacksJustTacos",
              "created": 1606692256,
              "upvotes": 1,
              "replies": {
                "ge3eo12": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3eo12/",
                  "text": "4.8??? how is that possible that's insane?? Your school must have a lot of weighted courses. Our school literally made it so that all 9th grade courses are unweighted and the only AP courses you can take 10th grade are AP foreign language, AP CS A/P, and AP Arts. Makes it really hard for any STEM non-CS student to get decent APs without being like 2 grades ahead in math :/",
                  "author": "ClearlyADuck",
                  "created": 1606692801,
                  "upvotes": 1,
                  "replies": {
                    "ge4k0ho": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4k0ho/",
                      "text": "I’m currently taking 5 AP classes senior year. I’ve taken 3 last year which made me have a 4.7 unweighted and I have all A’s this year meaning it’s bumped to a 4.8. I’m either 1st or 2nd rank in my school GPA wise",
                      "author": "NoHacksJustTacos",
                      "created": 1606718281,
                      "upvotes": 1,
                      "replies": {
                        "ge4ki0x": {
                          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4ki0x/",
                          "text": "Are you saying 3 weighted classes alone brought your GPA to a 4.7? Maybe my math is wrong, but assuming you have As in all of your classes, over half of your course load would have to be weighted for you to have above a 4.5.",
                          "author": "ClearlyADuck",
                          "created": 1606718688,
                          "upvotes": 1,
                          "replies": {
                            "ge4on4d": {
                              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4on4d/",
                              "text": "I have a dual enrollment class as well I forgot to mention that is weighted. I’ve also taken 1 app in both freshman and sophomore (in sophomore-senior I take dual enrollment). So this year I’m taking 5 AP classes plus a dual enrollment class which will definitely raise my weighted to a 4.8 last year I took 3 ap plus dual enrollment.",
                              "author": "NoHacksJustTacos",
                              "created": 1606722422,
                              "upvotes": 1,
                              "replies": {
                                "ge4qrgc": {
                                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4qrgc/",
                                  "text": "Ah ok that makes more sense.",
                                  "author": "ClearlyADuck",
                                  "created": 1606724445,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ge1nct2": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1nct2/",
      "text": "Remind me 2 days",
      "author": "fallishere02",
      "created": 1606664736,
      "upvotes": 3,
      "replies": {
        "ge1o18w": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1o18w/",
          "text": "RemindMe! 48 hours “amazing T20 Analysis post”",
          "author": null,
          "created": 1606664981,
          "upvotes": 2,
          "replies": {
            "ge1o4bd": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1o4bd/",
              "text": "I will be messaging you in 2 days on [**2020-12-01 15:49:41 UTC**](http://www.wolframalpha.com/input/?i=2020-12-01%2015:49:41%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1o18w/?context=3)\n\n[**13 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fk3akox%2Fanalysis_on_what_t20_schools_want%2Fge1o18w%2F%5D%0A%0ARemindMe%21%202020-12-01%2015%3A49%3A41%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20k3akox)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "author": "RemindMeBot",
              "created": 1606665011,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ge1q0ha": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1q0ha/",
          "text": "**fallishere02** , kminder in **2 days** on [**2020-12-01 15:45:36Z**](https://www.reminddit.com/time?dt=2020-12-01 15:45:36Z&reminder_id=329be2de8de042a99c5c97cce72df752&subreddit=ApplyingToCollege)\n\n> [**r/ApplyingToCollege: Analysis_on_what_t20_schools_want**](/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1nct2/?context=3)\n\n> kminder 2 days\n\n[**1 OTHER CLICKED THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-12-01T15%3A45%3A36%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2FApplyingToCollege%2Fcomments%2Fk3akox%2Fanalysis_on_what_t20_schools_want%2Fge1nct2%2F) to also be reminded. Thread has 2 reminders.\n\n^(OP can )[^(**Delete reminder and comment, Add email notification, and more options here**)](https://www.reminddit.com/time?dt=2020-12-01 15:45:36Z&reminder_id=329be2de8de042a99c5c97cce72df752&subreddit=ApplyingToCollege)\n\n**Protip!** You can use the same reminderbot by email by sending email to bot @ bot.reminddit.com.\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Donate](https://paypal.me/reminddit)",
          "author": "remindditbot",
          "created": 1606665648,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1z2k7": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1z2k7/",
      "text": "im pretty sure stanford looks at essays a good deal just like uchicago",
      "author": "puny_piano",
      "created": 1606669182,
      "upvotes": 3,
      "replies": {
        "ge202h5": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge202h5/",
          "text": "Oh yeah for sure. And ECs.",
          "author": "thayirshetti",
          "created": 1606669578,
          "upvotes": 2,
          "replies": {
            "ge206pe": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge206pe/",
              "text": "When is the Ivy list coming? Thanks for making this btw",
              "author": "theworldiscool123",
              "created": 1606669635,
              "upvotes": 2,
              "replies": {
                "ge21dlq": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21dlq/",
                  "text": "Hopefully by the end of tomorrow. (EST.) :) Doing my research now.",
                  "author": "thayirshetti",
                  "created": 1606670237,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge2vhde": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2vhde/",
      "text": "Could you expand more on UMich?",
      "author": "sassyclassy117",
      "created": 1606683267,
      "upvotes": 3,
      "replies": {}
    },
    "ge4197e": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4197e/",
      "text": "To add something to your future Ivy post: I know they keep very close track of what EC activities are available for each region, and they will measure applicants against the ECs that past applicants had from an area. If you have a university that easily lets students take classes there and you haven't, you're probably competing against people who have. If you have a great volunteering opportunity that your classmates have taken advantage of, or even students in your city frequently take advantage of, the person reading your app will be aware of that. Something to consider in the \"black box\" of ECs. Likely other schools do this too, but I know the top ivies do.",
      "author": "sevaiper",
      "created": 1606705405,
      "upvotes": 3,
      "replies": {}
    },
    "ge1prjn": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1prjn/",
      "text": "Hey, could you do specific ivies? like Cornell, Brown, or Yale?",
      "author": "ThefateofMandMs",
      "created": 1606665561,
      "upvotes": 4,
      "replies": {
        "ge1qg3n": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1qg3n/",
          "text": "Definitely soon!",
          "author": "thayirshetti",
          "created": 1606665815,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ge1mkif": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1mkif/",
      "text": "Yo! this is really great!  \nCould you elaborate a bit about Williams College tho?  \nThank you so much!",
      "author": "SpongeBobBlab",
      "created": 1606664475,
      "upvotes": 2,
      "replies": {
        "ge1mr73": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1mr73/",
          "text": "Sure, will have to research Williams a bit though.",
          "author": "thayirshetti",
          "created": 1606664535,
          "upvotes": 2,
          "replies": {
            "ge39za9": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge39za9/",
              "text": "Williams and Amherst too! Everyone says they're super similar...but is what they're looking for in students different?",
              "author": "wordgenius",
              "created": 1606690348,
              "upvotes": 2,
              "replies": {}
            },
            "ge1nk0o": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1nk0o/",
              "text": "Yup, Please do!  \nThank you!",
              "author": "SpongeBobBlab",
              "created": 1606664810,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1obg4": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1obg4/",
      "text": "This is great. Could you explain Carleton?",
      "author": "beetSchrutes",
      "created": 1606665080,
      "upvotes": 2,
      "replies": {}
    },
    "ge1t3pe": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1t3pe/",
      "text": "This is a really great post!",
      "author": "piedrafundamental",
      "created": 1606666780,
      "upvotes": 2,
      "replies": {}
    },
    "ge1ursj": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ursj/",
      "text": "Do you have any more analysis in-depth for northwestern? Thanks! :)",
      "author": "tali1213",
      "created": 1606667457,
      "upvotes": 2,
      "replies": {
        "ge1ve0j": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ve0j/",
          "text": "Oh sure! Will post more info about the great school before tonight! Be sure to check back! :)",
          "author": "thayirshetti",
          "created": 1606667700,
          "upvotes": 4,
          "replies": {
            "ge3qdau": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3qdau/",
              "text": "thank you!",
              "author": "satripimsad",
              "created": 1606699302,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1w93s": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1w93s/",
      "text": "Can I pm you for questions? Also would you do Reed and Macalester?",
      "author": null,
      "created": 1606668046,
      "upvotes": 2,
      "replies": {}
    },
    "ge1wers": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1wers/",
      "text": "Penn please!!",
      "author": "sweetpotato31",
      "created": 1606668108,
      "upvotes": 2,
      "replies": {
        "ge1wgs9": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1wgs9/",
          "text": "Sure! A rigorous school!!",
          "author": "thayirshetti",
          "created": 1606668130,
          "upvotes": 1,
          "replies": {
            "ge1wmpm": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1wmpm/",
              "text": "i think they love students who are really interested in their major",
              "author": "sweetpotato31",
              "created": 1606668195,
              "upvotes": 1,
              "replies": {
                "ge1wra6": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1wra6/",
                  "text": "Yes!!",
                  "author": "thayirshetti",
                  "created": 1606668243,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge1xi97": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1xi97/",
      "text": "Can you do Wharton pls",
      "author": "random581",
      "created": 1606668542,
      "upvotes": 2,
      "replies": {
        "ge1xmgi": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1xmgi/",
          "text": "Yes.",
          "author": "thayirshetti",
          "created": 1606668588,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1y4dw": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1y4dw/",
      "text": "Hey! Could you expand on CMU? Like what do you mean by creating a fan following? Is it like social media stuff?",
      "author": "_aneeta",
      "created": 1606668791,
      "upvotes": 2,
      "replies": {
        "ge1ydb7": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ydb7/",
          "text": "Yeah social media stuff pertinent to tech, etc., or maybe won a hackathon, competed in tech tournaments, etc. :)",
          "author": "thayirshetti",
          "created": 1606668894,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ge1ybe3": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ybe3/",
      "text": "hey! thanks so much for this, very helpful. i know you’ve gotten lots of comments for schools but i’m very curious about william and mary! from what i can tell it seems that they really like passionate and quirky but it would be great to see your opinion!",
      "author": "pterodactylwings",
      "created": 1606668872,
      "upvotes": 2,
      "replies": {
        "ge1ys2k": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ys2k/",
          "text": "I think that they want passionate students who are WELL-ROUNDED. Make sure to nail your essays and contribute to the community in some way. :)",
          "author": "thayirshetti",
          "created": 1606669063,
          "upvotes": 3,
          "replies": {
            "ge1zdcz": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1zdcz/",
              "text": "thank you!",
              "author": "pterodactylwings",
              "created": 1606669301,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1yx3i": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1yx3i/",
      "text": "Do you have an tips for Canadian schools, mainly U of T and Waterloo? Probably not but worth a shot",
      "author": "cristinon",
      "created": 1606669120,
      "upvotes": 2,
      "replies": {
        "ge200ms": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge200ms/",
          "text": "Not really bro! Sorry... Hope you get into those schools though! :))",
          "author": "thayirshetti",
          "created": 1606669557,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "ge28qch": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge28qch/",
      "text": "For CMU you’re right, but you don’t necessarily need to do hackathons or “create a fan following”. Most of my CS friends never participated in big hackathons in high school and almost 1/3 of the SCS freshmen take the intro 15112 class (the rest skip it with APCSA credit). Idk how it works for other STEM or non STEM majors.",
      "author": "klausklass",
      "created": 1606673889,
      "upvotes": 2,
      "replies": {
        "ge2bqd3": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bqd3/",
          "text": "For sure! They just want to see that you have passion for STEM!",
          "author": "thayirshetti",
          "created": 1606675351,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge28sen": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge28sen/",
      "text": "lmao rip me who applied to Rice test-optional\n\nemory is one I'd like to see please!",
      "author": "Lumpy2416",
      "created": 1606673917,
      "upvotes": 2,
      "replies": {}
    },
    "ge29kv2": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge29kv2/",
      "text": "when stanford only accepts kids with over a 4.7/5 wgpa from your school 💔",
      "author": "torredegliangeli",
      "created": 1606674304,
      "upvotes": 2,
      "replies": {}
    },
    "ge2aewz": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2aewz/",
      "text": "Any more details on Rice?",
      "author": "SpeedyboyAubameyang",
      "created": 1606674706,
      "upvotes": 2,
      "replies": {}
    },
    "ge2bkxw": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bkxw/",
      "text": "Can u do upenn specifically? Thank you sm!",
      "author": null,
      "created": 1606675279,
      "upvotes": 2,
      "replies": {}
    },
    "ge2blo0": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2blo0/",
      "text": "Can you do a more in-depth piece on Vanderbilt please?",
      "author": "student731",
      "created": 1606675288,
      "upvotes": 2,
      "replies": {}
    },
    "ge2bp71": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bp71/",
      "text": "A detailed MIT please",
      "author": "eraico",
      "created": 1606675335,
      "upvotes": 2,
      "replies": {}
    },
    "ge2bx38": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bx38/",
      "text": "Dude this is absolutely amazing. I don't have award money but im definately saving this thread. Keep bringing us info like this please!",
      "author": "sparsh26",
      "created": 1606675442,
      "upvotes": 2,
      "replies": {
        "ge2c4qb": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2c4qb/",
          "text": ">UF and UNC - They absolutely don’t want nerds. They want personality. I’ve talked to the AOs there and that’s what I’ve heard.\n\nThanks bro!",
          "author": "thayirshetti",
          "created": 1606675546,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ge2c87x": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2c87x/",
      "text": "welp lets hope my essays are good enough for uchicago lmao i put a ton of work into them.",
      "author": "elijahperk",
      "created": 1606675592,
      "upvotes": 2,
      "replies": {}
    },
    "ge2cs3c": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2cs3c/",
      "text": "Comment about Notre Dame: what you said was correct, but it is missing one important piece. ND is huge on education for social good/impact, so they will place a greater emphasis on EC's that show a student's drive to create positive change (volunteering, etc.)",
      "author": "dbattack",
      "created": 1606675860,
      "upvotes": 2,
      "replies": {
        "ge2htor": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2htor/",
          "text": "Oh yes for sure",
          "author": "thayirshetti",
          "created": 1606678189,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge2fbws": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2fbws/",
      "text": "Wait, UMich is a T20?? Damn.....I have like no clue about rankings im just applying to state schools because private schools do too much. Like 70% of the reason I'm going to college anyway is just to move out becuse I hate it here.",
      "author": "morningstarbee",
      "created": 1606677088,
      "upvotes": 2,
      "replies": {
        "ge32yeu": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge32yeu/",
          "text": "Believe they’re #24",
          "author": "QueenDeScots",
          "created": 1606686753,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ge2lo62": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2lo62/",
      "text": "What’s your opinion on what the military academies look for?",
      "author": "mrwonderfull_",
      "created": 1606679596,
      "upvotes": 2,
      "replies": {}
    },
    "ge305ms": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge305ms/",
      "text": "Stanford has an average accepted gpa of around 3.97",
      "author": "SnooLentils2147",
      "created": 1606685365,
      "upvotes": 2,
      "replies": {}
    },
    "ge3iep7": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3iep7/",
      "text": "I hate that you actually have to be a person to get into good schools",
      "author": "SpadeMagnesDS",
      "created": 1606694769,
      "upvotes": 2,
      "replies": {}
    },
    "ge3n10g": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3n10g/",
      "text": "hi i’m a disabled harvard applicant that just had my interview! my interviewer absolutely loved my story of overcoming obstacles and said it is definitely something they look for so you are right!",
      "author": "makmakt1",
      "created": 1606697358,
      "upvotes": 2,
      "replies": {}
    },
    "ge3q7s2": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3q7s2/",
      "text": "a lot of this advice -- particularly on ivies -- is inaccurate, so take this with a grain of salt",
      "author": "Unhappy_Second4209",
      "created": 1606699213,
      "upvotes": 2,
      "replies": {}
    },
    "ge3zxpg": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3zxpg/",
      "text": "u/fat_morgz wtf are these GPA ranges",
      "author": "looolokbuddy",
      "created": 1606704622,
      "upvotes": 2,
      "replies": {}
    },
    "ge45vs6": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge45vs6/",
      "text": "Uhh is this troll or like real. Like genuinely wondering?",
      "author": "pleasehelpimnotrdy",
      "created": 1606708110,
      "upvotes": 2,
      "replies": {}
    },
    "ge4nszy": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4nszy/",
      "text": "Terrible misinformation that relies on stereotypes. Watching naive teenagers taking this roleplaying OP seriously hurts my soul.",
      "author": "DarkSkyKnight",
      "created": 1606721666,
      "upvotes": 2,
      "replies": {}
    },
    "ge4sbut": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4sbut/",
      "text": "Honestly most of the stat bars given to these colleges are unrealistic. I can agree that for some the exception can be made (athletes, legacy, feeder school) but for the average applicant definitely not.\n\nIf this post had an impact on how you view the college admissions process I highly recommend you read posts written by u/williamthereader , it will help humble most of the claims made in the above post. Also William if you read this post above feel free to leave your feedback about it, should be interesting. And welcome back dude (manifesting his return lol).",
      "author": "samrogdog13",
      "created": 1606726024,
      "upvotes": 2,
      "replies": {}
    },
    "ge5f6tg": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge5f6tg/",
      "text": "This is all just this dudes opinion and has no factual base. I stopped reading after 3.5 in hard classes ensures you’re into Stanford",
      "author": null,
      "created": 1606746729,
      "upvotes": 4,
      "replies": {}
    },
    "ge1qn02": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1qn02/",
      "text": "could you do UCSC and UC Davis?",
      "author": "toelickingasmr",
      "created": 1606665888,
      "upvotes": 2,
      "replies": {}
    },
    "ge1s1lj": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1s1lj/",
      "text": "Lmao",
      "author": "Eatyourgreens47",
      "created": 1606666386,
      "upvotes": 2,
      "replies": {}
    },
    "ge20var": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge20var/",
      "text": "After 1 year of research you say? With what professor at what university? /s",
      "author": "ck614",
      "created": 1606669982,
      "upvotes": 2,
      "replies": {
        "ge213ks": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge213ks/",
          "text": "Hey bro! Nope, just webinars, some AOs, AOs on Reddit, Naviance scatterplots, college websites, etc. :)",
          "author": "thayirshetti",
          "created": 1606670097,
          "upvotes": 4,
          "replies": {
            "ge217td": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge217td/",
              "text": "Lol nice! And thank you so much for compiling this valuable research, I got a good brief answer to my questions about USC, UCLA/Berkeley and Stanford!",
              "author": "ck614",
              "created": 1606670156,
              "upvotes": 1,
              "replies": {
                "ge21k2o": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21k2o/",
                  "text": ":)",
                  "author": "thayirshetti",
                  "created": 1606670327,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge2bd6m": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bd6m/",
      "text": "Hey, if it’s not too much trouble, could you do Grinnell College?",
      "author": "whereisthesushi",
      "created": 1606675172,
      "upvotes": 2,
      "replies": {}
    },
    "ge2ouf3": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ouf3/",
      "text": "Maybe they don't do this anymore, but when I was applying to MIT, you had to interview with an alumnus as part of the requirements. The interview was somewhat informal and asked similar questions to the essay, but the goal was really to see if you could talk about your passions and show that you do really have a strong desire to go to MIT and such. Basically, if they still make you do this, and I think they still do, be prepared to really sell yourself and show how much your really want to be at MIT. I wouldn't say the interview can make or break an application, but they're an incredibly competitive school and almost everyone there will have perfect academic scores and great extra curriculars, so it is a great idea to stand out and get a good recommendation from your interviewer. It might also help raise you up into the accepted pool if you were just below the cut for getting in or not if you interviewed really well, or could even be the difference between definitely not accepted or second round offer.",
      "author": "MoaXing",
      "created": 1606680566,
      "upvotes": 2,
      "replies": {}
    },
    "ge1ua3b": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ua3b/",
      "text": "This is an amazing analysis omg looking forward to more of your posts!",
      "author": "forthetea",
      "created": 1606667255,
      "upvotes": 1,
      "replies": {
        "ge1ujir": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1ujir/",
          "text": "Thank you! More posts soon!",
          "author": "thayirshetti",
          "created": 1606667369,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1uqcq": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1uqcq/",
      "text": "Thank you for doing this! Can you please do Harvard soon!",
      "author": "Locomocoboco",
      "created": 1606667442,
      "upvotes": 1,
      "replies": {
        "ge1venp": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1venp/",
          "text": "Definitely.",
          "author": "thayirshetti",
          "created": 1606667707,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ge1vhgv": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1vhgv/",
      "text": "This is so awesome.\n\nCould you do Notre Dame?",
      "author": "britishsaintsfan",
      "created": 1606667738,
      "upvotes": 1,
      "replies": {
        "ge1wawx": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1wawx/",
          "text": "Definitely. Superb school with superb people. And I think that's what sets them apart.",
          "author": "thayirshetti",
          "created": 1606668067,
          "upvotes": 1,
          "replies": {}
        },
        "ge2dfyc": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2dfyc/",
          "text": ">Comment about Notre Dame: what you said was correct, but it is missing one important piece. ND is huge on education for social good/impact, so they will place a greater emphasis on EC's that show a student's drive to create positive change (volunteering, etc.)\n\nAs a Notre Dame student, I agree with OP's write-up. You don't need crazy extraordinary EC's to get into ND, but you need strong grades, stats, and solid EC's. They are looking for wholesome, hardworking kids who fit the social good/impact values of the school.",
          "author": "dbattack",
          "created": 1606676175,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1yr0e": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1yr0e/",
      "text": "Georgetown?",
      "author": "lgm879",
      "created": 1606669051,
      "upvotes": 1,
      "replies": {
        "ge1zz42": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1zz42/",
          "text": "Sure!",
          "author": "thayirshetti",
          "created": 1606669539,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ge1yy0w": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1yy0w/",
      "text": "Could u plz do UNC Chapel hill and scripps",
      "author": "Psychological-Cell-5",
      "created": 1606669131,
      "upvotes": 1,
      "replies": {
        "ge201oz": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge201oz/",
          "text": "Sure! UNC is on there, will elaborate more this evening though.",
          "author": "thayirshetti",
          "created": 1606669569,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge1zdi9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1zdi9/",
      "text": "Hey, so when you talk about CMU, is that specifically with respect to the SCS?",
      "author": "wslmllr",
      "created": 1606669302,
      "upvotes": 1,
      "replies": {}
    },
    "ge20q52": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge20q52/",
      "text": "Could you explain what UVA (in-state) wants in an applicant?",
      "author": "beeniepeep",
      "created": 1606669909,
      "upvotes": 1,
      "replies": {
        "ge2196c": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2196c/",
          "text": "They get so many applicants! Why should they accept you? What are you interested in? How are you unique? Remember that when you apply to state schools, nail your personal statement. :)",
          "author": "thayirshetti",
          "created": 1606670174,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge21h42": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21h42/",
      "text": "When you say good grades and SAT for CMU, do you mean ACT as well? Or does CMU have a preference for the SAT over the ACT?",
      "author": null,
      "created": 1606670286,
      "upvotes": 1,
      "replies": {
        "ge21ih2": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21ih2/",
          "text": "SAT/ACT sorry about that!",
          "author": "thayirshetti",
          "created": 1606670305,
          "upvotes": 1,
          "replies": {
            "ge21o5e": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21o5e/",
              "text": "[deleted]",
              "author": null,
              "created": 1606670385,
              "upvotes": 1,
              "replies": {
                "ge21rz3": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21rz3/",
                  "text": "Doesn't matter, colleges will prefer one or the other. :) Extraordinary score though for this year! Nice job!",
                  "author": "thayirshetti",
                  "created": 1606670438,
                  "upvotes": 2,
                  "replies": {
                    "ge21ub9": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge21ub9/",
                      "text": "Thanks!",
                      "author": null,
                      "created": 1606670470,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ge228c9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge228c9/",
      "text": "Syracuse please!?!? Thx!",
      "author": "okobojigirl",
      "created": 1606670667,
      "upvotes": 1,
      "replies": {}
    },
    "ge22t5d": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge22t5d/",
      "text": "[deleted]",
      "author": null,
      "created": 1606670959,
      "upvotes": 1,
      "replies": {
        "ge25xbw": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25xbw/",
          "text": "They matter a lot. They get to know you beyond just your academic history.",
          "author": "thayirshetti",
          "created": 1606672507,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge231pi": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge231pi/",
      "text": "[deleted]",
      "author": null,
      "created": 1606671079,
      "upvotes": 1,
      "replies": {
        "ge25sej": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25sej/",
          "text": "Sure!!",
          "author": "thayirshetti",
          "created": 1606672439,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge23ll9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge23ll9/",
      "text": "Uva",
      "author": "DeMonstaMan",
      "created": 1606671357,
      "upvotes": 1,
      "replies": {
        "ge25reu": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25reu/",
          "text": "Sure!",
          "author": "thayirshetti",
          "created": 1606672425,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge244ea": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge244ea/",
      "text": "this was super interesting! ty for taking the time to do this",
      "author": "stripedscrunchie",
      "created": 1606671618,
      "upvotes": 1,
      "replies": {
        "ge25oai": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25oai/",
          "text": "Thanks!",
          "author": "thayirshetti",
          "created": 1606672383,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge245qg": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge245qg/",
      "text": "You mention academics being mainly considered for UCLA/Berkeley, the SAT isn't allowed on their application this year, does that mean they are strictly focusing a lot on GPA? - Out of state student btw\nThanks so much!!",
      "author": "E-ratic__Conqueror",
      "created": 1606671638,
      "upvotes": 1,
      "replies": {
        "ge25nz7": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25nz7/",
          "text": "Yes. A lot more on the types of courses you have chosen throughout high school, and importantly, your personal traits. That's why there's so much of space for awards, activities, etc. on the UC schools's app!",
          "author": "thayirshetti",
          "created": 1606672379,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ge246oy": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge246oy/",
      "text": "WashU is one of my dream schools but I don't have any research related to what I want to study because of the lockdown. Won't this be the case with many applicants to that school? I did do some research in the past but it was in theoretical math stuff that doesn't interest me at all, should I still mention that in my application?",
      "author": "These7963System",
      "created": 1606671651,
      "upvotes": 1,
      "replies": {}
    },
    "ge24s23": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge24s23/",
      "text": "Most of my activities are CS related oof",
      "author": "lambda5x5",
      "created": 1606671945,
      "upvotes": 1,
      "replies": {}
    },
    "ge24ufs": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge24ufs/",
      "text": "Thank you so much for this priceless information! Could you please provide some inforemation about Franklin&Marshall College and Kenyon?",
      "author": "ParsnipOk8645",
      "created": 1606671978,
      "upvotes": 1,
      "replies": {
        "ge344z4": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge344z4/",
          "text": "Not OP, but I think I can answer just based off the posted information above. Franklin & Marshall qualifies as a private LAC, which means - based on OP - they're looking for well-rounded students and someone who's passionate. I'd also wager that since they have a relatively higher acceptance rate, exceptional academics OR EC's would most likely guarantee an acceptance.\n\nI'd say the exact same for Kenyon college.",
          "author": "Lt_Quill",
          "created": 1606687342,
          "upvotes": 2,
          "replies": {
            "ge4ywin": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4ywin/",
              "text": "Thank you so much",
              "author": "ParsnipOk8645",
              "created": 1606733192,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge25z3w": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge25z3w/",
      "text": "All of mine are a bit less fancy, but any similar info for UConn, U of Oregon, or U of Alabama?",
      "author": "Ivanelgreat",
      "created": 1606672531,
      "upvotes": 1,
      "replies": {}
    },
    "ge262op": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge262op/",
      "text": "[deleted]",
      "author": null,
      "created": 1606672580,
      "upvotes": 1,
      "replies": {
        "ge26q9t": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge26q9t/",
          "text": "Thanks for letting me know!",
          "author": "thayirshetti",
          "created": 1606672903,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge269x0": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge269x0/",
      "text": "I absolutely love you for doing this. Thank you! Could you do UC Irvine?",
      "author": "StuckInDreams",
      "created": 1606672679,
      "upvotes": 1,
      "replies": {
        "ge26n0i": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge26n0i/",
          "text": "Sure!",
          "author": "thayirshetti",
          "created": 1606672857,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge27n69": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge27n69/",
      "text": "Really great post my guy! I feel like for engineers/cs students, test scores and academics need to be near perfect at almost every school",
      "author": "kermitwantstodie",
      "created": 1606673361,
      "upvotes": 1,
      "replies": {
        "ge2bqwl": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bqwl/",
          "text": "Thanks bro!",
          "author": "thayirshetti",
          "created": 1606675358,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge28hnw": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge28hnw/",
      "text": "this is awesome! thanks so much!",
      "author": "_thegreenhouse",
      "created": 1606673770,
      "upvotes": 1,
      "replies": {}
    },
    "ge2920m": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2920m/",
      "text": "RemindMe! 24 hours",
      "author": "hurricanelesbian",
      "created": 1606674048,
      "upvotes": 1,
      "replies": {}
    },
    "ge299c9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge299c9/",
      "text": "[deleted]",
      "author": null,
      "created": 1606674148,
      "upvotes": 1,
      "replies": {
        "ge2bmnf": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2bmnf/",
          "text": "Thank you so much! Very helpful information!",
          "author": "thayirshetti",
          "created": 1606675301,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge29aaw": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge29aaw/",
      "text": "this is amazing thank you so much 🙏",
      "author": "DABEAST0",
      "created": 1606674161,
      "upvotes": 1,
      "replies": {}
    },
    "ge29de5": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge29de5/",
      "text": "more on northwestern would be awesome :)",
      "author": "Lizzyms",
      "created": 1606674203,
      "upvotes": 1,
      "replies": {}
    },
    "ge2e11k": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2e11k/",
      "text": "Thank you for this!! Can you please do Northeastern?",
      "author": "xviekta",
      "created": 1606676454,
      "upvotes": 1,
      "replies": {}
    },
    "ge2eat7": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2eat7/",
      "text": "GOD BLESS THANK U SO MUCH. I’m just writing the USC essays for the scholarship ddl and was debating on my focus of my essay (whether I should spend some words in describing interests other than my intended major) and this definitely helps!",
      "author": "itsmegloria_",
      "created": 1606676587,
      "upvotes": 1,
      "replies": {}
    },
    "ge2ftcy": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ftcy/",
      "text": "What do you think of Babson college?",
      "author": "Jo_Sudany03",
      "created": 1606677320,
      "upvotes": 1,
      "replies": {}
    },
    "ge2gajc": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2gajc/",
      "text": "Could you elaborate on Tufts?",
      "author": null,
      "created": 1606677548,
      "upvotes": 1,
      "replies": {}
    },
    "ge2gi5n": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2gi5n/",
      "text": "specific tips for harvard yale and stanford please",
      "author": "Emir_Gulash",
      "created": 1606677643,
      "upvotes": 1,
      "replies": {}
    },
    "ge2gnwd": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2gnwd/",
      "text": "If I’m correct, UCLA and Berkeley aren’t even considering test scores this application cycle? Wish I’d have known that before leaving my essays to the last minute!",
      "author": "ManUtd90908",
      "created": 1606677709,
      "upvotes": 1,
      "replies": {
        "ge2h8cp": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2h8cp/",
          "text": "Same here! So weird! However, if your out of school stuff are fine, you should have a good shot!",
          "author": "thayirshetti",
          "created": 1606677942,
          "upvotes": 2,
          "replies": {
            "ge2hi0g": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2hi0g/",
              "text": "What would you consider fine? I didn’t do anything revolutionary in way of ECs so I was hoping my test scores could do the talking.",
              "author": "ManUtd90908",
              "created": 1606678055,
              "upvotes": 1,
              "replies": {
                "ge2hmcr": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2hmcr/",
                  "text": "Clubs, out of school activities, volunteering, etc.",
                  "author": "thayirshetti",
                  "created": 1606678106,
                  "upvotes": 1,
                  "replies": {
                    "ge2i42u": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2i42u/",
                      "text": "I have great athletics (captain of nationally ranked soccer club and captain of high school team) and hundreds of volunteer hours, and some involvement in clubs but little leadership. Would that be enough?",
                      "author": "ManUtd90908",
                      "created": 1606678306,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ge2he3d": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2he3d/",
      "text": "this is so helpful. thank you for taking the time to do this! much appreciated <3",
      "author": "alp-02",
      "created": 1606678008,
      "upvotes": 1,
      "replies": {
        "ge2hgbq": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2hgbq/",
          "text": "Thanks!!!! Np!",
          "author": "thayirshetti",
          "created": 1606678035,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge2ieri": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ieri/",
      "text": "RemindMe! 2 days",
      "author": "cosine-2pi",
      "created": 1606678429,
      "upvotes": 1,
      "replies": {}
    },
    "ge2j90p": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2j90p/",
      "text": "I’m writing my “Why USC ” essay right now. You mentioned that USC loves kids who are passionate about their major. I feel as though I am very passionate about the Iovine and Young Academy at USC, so I was wondering if I should focus most, maybe even all, of my essay on my first major choice (IYA) or if I should include my second choice major (which I also really like) in it.",
      "author": "brenmnm",
      "created": 1606678764,
      "upvotes": 1,
      "replies": {}
    },
    "ge2kfoc": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2kfoc/",
      "text": "wow super interesting to read!! does anyone else know other posts like this or have other thoughts?",
      "author": "likesundayslikerain",
      "created": 1606679176,
      "upvotes": 1,
      "replies": {}
    },
    "ge2lj87": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2lj87/",
      "text": "for the schools you listed as mainly looking at standardized tests and GPA: do you think that having just mediocre ECs and essays is a dealbreaker? (aka nothing mind-blowing, but not terrible either) \n\njust wondering if i have any hope with pretty high stats but relatively average activities (leadership roles and lots of time commitment, but no research or internships) and writing abilities :)",
      "author": "pixiedusted-",
      "created": 1606679549,
      "upvotes": 1,
      "replies": {
        "ge2lq50": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2lq50/",
          "text": ">Rice - Rice definitely wants students who are very strong academically and who have good SAT/ACT scores. On the non-academic end, the AOs are really looking for students who think differently, much as UChicago does. Have you ever dealt with an unfavorable circumstance but then created something positive out of it? Can you portray something small in a different light? I’m pretty sure that’s what Rice AOs want. Haven't formally attended any of their webinars, so this is just info I got from previous posts on Reddit, online, etc. 😃\n\nNot at all.",
          "author": "thayirshetti",
          "created": 1606679614,
          "upvotes": 1,
          "replies": {
            "ge2mnr3": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2mnr3/",
              "text": "ahh alright, thank you so much for taking the time to make this post, by the way!! it’s really helpful and definitely easing my worries a little bit",
              "author": "pixiedusted-",
              "created": 1606679888,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge2m0fi": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2m0fi/",
      "text": "something for me is that my intended major isn’t offered as a *main* course at my school, or even a course relating to it, which is weird. (architecture)",
      "author": "inmyheadari",
      "created": 1606679700,
      "upvotes": 1,
      "replies": {}
    },
    "ge2mtqw": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2mtqw/",
      "text": "What are your thoughts on Dartmouth",
      "author": "kristalzappa",
      "created": 1606679937,
      "upvotes": 1,
      "replies": {}
    },
    "ge2ooqt": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ooqt/",
      "text": "Hey! Could you elaborate a bit more on Duke?",
      "author": "the-sideline-story",
      "created": 1606680515,
      "upvotes": 1,
      "replies": {}
    },
    "ge2os37": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2os37/",
      "text": "Northwestern?",
      "author": "katunare",
      "created": 1606680545,
      "upvotes": 1,
      "replies": {}
    },
    "ge2t4kb": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2t4kb/",
      "text": "For USC - I have a lot of ECs that relate to my major (music industry), but not a lot of leadership roles. For example, two of the clubs I was in didn’t have a president or any specific titles like that but they were a big part of my life in high school. Would my rec from a music teacher that knows me well be enough to offset that? I also have some small awards like student of the month for my music department last year, and results for a state song competition are coming up that I was nominated for. Would this be enough for a USC AO? Thanks!!",
      "author": "BravestestDoubloon",
      "created": 1606682174,
      "upvotes": 1,
      "replies": {}
    },
    "ge2uuun": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2uuun/",
      "text": "I’m afraid I’m gonna be stuck with my 1370 going into next year since tests are closing again. Was supposed to retake soon",
      "author": "emadd17",
      "created": 1606682980,
      "upvotes": 1,
      "replies": {}
    },
    "ge2vm3m": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2vm3m/",
      "text": "Could you do Georgetown? :)",
      "author": "ohmygodihatechem",
      "created": 1606683326,
      "upvotes": 1,
      "replies": {}
    },
    "ge2xna7": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2xna7/",
      "text": "What would make you come off as a “nerd” to schools like UF? Could high grades/SAT scores hurt you in any way?",
      "author": "more_juice_please",
      "created": 1606684229,
      "upvotes": 1,
      "replies": {
        "ge3aza2": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3aza2/",
          "text": "As someone who just got into UF it’s more like if you aren’t the Valedictorian of your school you need to show who you are in your essay. Your essay along with your extra curriculars need to stand out beyond I’m smart.",
          "author": "Shazam08",
          "created": 1606690868,
          "upvotes": 2,
          "replies": {
            "ge3bi86": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3bi86/",
              "text": "Would being the valedictorian of your school hurt? (maybe the perception of being too academically focused?)\nOr should you be fine as long as you have somewhat of a balance?",
              "author": "more_juice_please",
              "created": 1606691147,
              "upvotes": 1,
              "replies": {
                "ge3bqsf": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3bqsf/",
                  "text": "No no if you have some insane academics you should be fine. I’m just saying if you weren’t at the very top of your class you need something other than above average grades",
                  "author": "Shazam08",
                  "created": 1606691270,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge3086r": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3086r/",
      "text": "You are an absolute godsend",
      "author": "sungjoon0710",
      "created": 1606685400,
      "upvotes": 1,
      "replies": {}
    },
    "ge31xve": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge31xve/",
      "text": "Great post!",
      "author": "godtier101",
      "created": 1606686240,
      "upvotes": 1,
      "replies": {}
    },
    "ge32e0r": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge32e0r/",
      "text": "NYU and Boston University?",
      "author": "TheBrookAndTheBluff",
      "created": 1606686465,
      "upvotes": 1,
      "replies": {}
    },
    "ge33g4s": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge33g4s/",
      "text": "Can you speak to Tulane?",
      "author": "support-narwhals",
      "created": 1606686997,
      "upvotes": 1,
      "replies": {}
    },
    "ge34oey": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge34oey/",
      "text": "one defining factor for most of these - can / will you pay the sticker price?",
      "author": "wertu1221",
      "created": 1606687616,
      "upvotes": 1,
      "replies": {}
    },
    "ge3b72s": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3b72s/",
      "text": "Hey! Could you do CWRU and the other UC's?",
      "author": null,
      "created": 1606690981,
      "upvotes": 1,
      "replies": {}
    },
    "ge3c7ce": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3c7ce/",
      "text": "Hey man, can you go more in depth on Virginia, especially for in state",
      "author": "MarcPOlson",
      "created": 1606691516,
      "upvotes": 1,
      "replies": {}
    },
    "ge3d2nj": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3d2nj/",
      "text": "could you remind me when you do a thorough analysis of penn please!!",
      "author": "Dependent-Fisherman2",
      "created": 1606691978,
      "upvotes": 1,
      "replies": {}
    },
    "ge3d4w9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3d4w9/",
      "text": "For Berkeley, they definitely look for “Grit”, which can be characterized as perseverance, problem-solving, tenacity, and things like that. Great analysis:)",
      "author": "theoldbatblues",
      "created": 1606692011,
      "upvotes": 1,
      "replies": {}
    },
    "ge3eq0n": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3eq0n/",
      "text": "Thank you for sharing, OP!",
      "author": "TrafficSoft6353",
      "created": 1606692829,
      "upvotes": 1,
      "replies": {}
    },
    "ge3f80i": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3f80i/",
      "text": "this is awesome! can you do barnard? :)",
      "author": null,
      "created": 1606693091,
      "upvotes": 1,
      "replies": {}
    },
    "ge3god4": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3god4/",
      "text": "Can you talk about Columbia/Barnard?",
      "author": "emaltz101",
      "created": 1606693851,
      "upvotes": 1,
      "replies": {}
    },
    "ge3iir1": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3iir1/",
      "text": "Hey could you do Emory?",
      "author": "wholelottar3d",
      "created": 1606694830,
      "upvotes": 1,
      "replies": {}
    },
    "ge3k77e": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3k77e/",
      "text": "can you do Stony Brook?",
      "author": "cruzer963",
      "created": 1606695750,
      "upvotes": 1,
      "replies": {}
    },
    "ge3kaj9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3kaj9/",
      "text": "Hey, I wonder if you've expanded on Yale yet? I know you mentioned in a couple other posts that you'd get back to it by tonight.",
      "author": "wormholejoy",
      "created": 1606695803,
      "upvotes": 1,
      "replies": {}
    },
    "ge3l39d": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3l39d/",
      "text": "Where is Georgetown?",
      "author": "A-MUSICAL",
      "created": 1606696249,
      "upvotes": 1,
      "replies": {
        "ge3qxom": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3qxom/",
          "text": "Washington DC",
          "author": "spineappletwist",
          "created": 1606699631,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge3n4mp": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3n4mp/",
      "text": "When you say ECs, are these ECs graded in any fashion. I’m looking at this from a teacher’s perspective. A lot of my students apply to US colleges and we have ECs such as maths club, photography club. Are these what you refer to?",
      "author": "TheImpundulu",
      "created": 1606697417,
      "upvotes": 1,
      "replies": {
        "ge3o3i4": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3o3i4/",
          "text": "Yes, those are fine. But winning hackathons, volunteering, participating in events like national debate competitions may be better. :)",
          "author": "thayirshetti",
          "created": 1606697976,
          "upvotes": 1,
          "replies": {
            "ge3q45p": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3q45p/",
              "text": "Right on, thanks for the quick reply.",
              "author": "TheImpundulu",
              "created": 1606699156,
              "upvotes": 1,
              "replies": {
                "ge3rl8t": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3rl8t/",
                  "text": "Thank you for educating children! :)",
                  "author": "thayirshetti",
                  "created": 1606700011,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge3q6w4": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3q6w4/",
      "text": "What's UW?",
      "author": "Witherllooll",
      "created": 1606699199,
      "upvotes": 1,
      "replies": {
        "ge3rmoj": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3rmoj/",
          "text": "Unweighted GPA.",
          "author": "thayirshetti",
          "created": 1606700034,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge3qb6x": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3qb6x/",
      "text": "I’ve written my UChicago supplemental essays in 1 hour and I got in. I’m not even kidding.",
      "author": "Gre456",
      "created": 1606699268,
      "upvotes": 1,
      "replies": {}
    },
    "ge3ti8w": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3ti8w/",
      "text": "Sorry, but what do you mean by USC doesn't want \"arrays\"?",
      "author": "NLT319",
      "created": 1606701088,
      "upvotes": 1,
      "replies": {
        "ge3yw0z": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3yw0z/",
          "text": "they don't want technical terms.",
          "author": "thayirshetti",
          "created": 1606704025,
          "upvotes": 1,
          "replies": {
            "ge3ywja": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3ywja/",
              "text": "Unless you can explain them.",
              "author": "thayirshetti",
              "created": 1606704032,
              "upvotes": 1,
              "replies": {
                "ge4jj8o": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4jj8o/",
                  "text": "oh makes sense, thanks",
                  "author": "NLT319",
                  "created": 1606717875,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ge3vbt9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3vbt9/",
      "text": "Can you Umich for in-state?",
      "author": "Fat_Morgz",
      "created": 1606702098,
      "upvotes": 1,
      "replies": {}
    },
    "ge3vjwt": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3vjwt/",
      "text": "I'm trying to get evaluated because ”Chanceme” reddit is something else",
      "author": "Omar-Dreaming",
      "created": 1606702224,
      "upvotes": 1,
      "replies": {}
    },
    "ge3voik": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3voik/",
      "text": "THIS GIVES ME HOPE. THANK YOU 🙏",
      "author": "CryptographerThis197",
      "created": 1606702296,
      "upvotes": 1,
      "replies": {}
    },
    "ge3xbbj": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3xbbj/",
      "text": "Awesome thanks !!",
      "author": "Err000r__1010",
      "created": 1606703173,
      "upvotes": 1,
      "replies": {}
    },
    "ge3y8rt": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3y8rt/",
      "text": "Hi! Could you maybe do instate UVA-- I applied ED and am kinda stressing haha",
      "author": "Ok_Faithlessness7910",
      "created": 1606703669,
      "upvotes": 1,
      "replies": {}
    },
    "ge3yua2": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3yua2/",
      "text": "Could you do UT Austin?",
      "author": "KillerAc1",
      "created": 1606703997,
      "upvotes": 1,
      "replies": {}
    },
    "ge4099y": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4099y/",
      "text": "So according to your unc description, how could I show that I’m a passionate person w/o sounding nerdy? How do I show personality? Can we pm, I promiseee I’ll keep it short 🙂👍🏽",
      "author": "perplexedproton",
      "created": 1606704812,
      "upvotes": 1,
      "replies": {}
    },
    "ge42nzh": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge42nzh/",
      "text": "Could you explain the process you used to determine all of this?",
      "author": "TheBrokenCondom2",
      "created": 1606706247,
      "upvotes": 1,
      "replies": {}
    },
    "ge4882x": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4882x/",
      "text": "can you do UC Santa Barbara?",
      "author": "oliplat0303",
      "created": 1606709563,
      "upvotes": 1,
      "replies": {}
    },
    "ge4btfg": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4btfg/",
      "text": "Tysm for this! just a quick question, when you describe Stanford as “well-rounded”, are you referring to its student population, or is well-roundness something they look for in applicants?",
      "author": "WWIsnoopy",
      "created": 1606711938,
      "upvotes": 1,
      "replies": {}
    },
    "ge4bxkj": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4bxkj/",
      "text": "What about UofM in state? I'm a dumbass shitty grades exponential growth",
      "author": "Sam_Seaborne",
      "created": 1606712016,
      "upvotes": 1,
      "replies": {}
    },
    "ge4ctbw": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4ctbw/",
      "text": "Hi! These are great, thank you! If you don't mind, could you analyse Illinois and Princeton too? Thanks!",
      "author": "Outrageous_Count_324",
      "created": 1606712638,
      "upvotes": 1,
      "replies": {}
    },
    "ge4cx9m": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4cx9m/",
      "text": "Just wanted to say if you are an intl needing financial aid these are not at all applicable.",
      "author": null,
      "created": 1606712715,
      "upvotes": 1,
      "replies": {}
    },
    "ge4d50f": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4d50f/",
      "text": "thank you so much for this!! can you do northeastern?",
      "author": "minischnauzer13",
      "created": 1606712869,
      "upvotes": 1,
      "replies": {}
    },
    "ge4dwzm": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4dwzm/",
      "text": "What does UW mean? Unweighted GPA average?",
      "author": "Shonisaurus",
      "created": 1606713434,
      "upvotes": 1,
      "replies": {}
    },
    "ge4eb52": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4eb52/",
      "text": "Stanford at 3.5 uw with strong EC’s is a acceptance? Idk that seems like a stretch to me.",
      "author": "mrepicoolguy",
      "created": 1606713727,
      "upvotes": 1,
      "replies": {}
    },
    "ge4fot0": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4fot0/",
      "text": "reading this makes me want to cry. i am a good student but nothing special. i have no official ECs other than youth group if that even counts. i can’t fucking help that i’m depressed and can’t do more than get my multiple hours of homework done each night. i might as well stop trying no college would want me man",
      "author": null,
      "created": 1606714766,
      "upvotes": 1,
      "replies": {
        "ge4wjfi": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4wjfi/",
          "text": "There will be so many colleges that will want you on their campus, just need to cast a wide net. The fact that you do multiple hours of homework a night shows that you value education!",
          "author": "shishito2002",
          "created": 1606730572,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge4gvox": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4gvox/",
      "text": "Could you expand more on what Duke/Vandy are looking for? Is there a certain \"spike\" they tend to favor? Thanks in advance!!",
      "author": "lolavendar",
      "created": 1606715689,
      "upvotes": 1,
      "replies": {}
    },
    "ge4kx5o": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4kx5o/",
      "text": "I'm not sure if the frosh I've met at Stanford neccesarily fit into that.",
      "author": "balck_mist",
      "created": 1606719052,
      "upvotes": 1,
      "replies": {}
    },
    "ge4lui4": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4lui4/",
      "text": "this was so helpful thank you! can’t wait for you ivy update (columbia is my dream uni)",
      "author": "seas_and_skies",
      "created": 1606719880,
      "upvotes": 1,
      "replies": {}
    },
    "ge51eqk": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge51eqk/",
      "text": "this is really great!! thank you so much for this post",
      "author": "intlstudent728",
      "created": 1606735865,
      "upvotes": 1,
      "replies": {}
    },
    "ge5l9cc": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge5l9cc/",
      "text": "Wow dude, this is amazing!!! If I am allowed to put in requests, I was wondering if you could do Georgetown and possibly UPenn in a little more depth. These are really cool and major props to you for putting in the time for this!",
      "author": "RTN30",
      "created": 1606750116,
      "upvotes": 1,
      "replies": {}
    },
    "ge5li3n": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge5li3n/",
      "text": "Thanks a lot for this! Happy with my grades and test scores but I don't really know what I want to major in which could hurt my chances at some of these schools.",
      "author": "LegendOfPokemon1",
      "created": 1606750243,
      "upvotes": 1,
      "replies": {}
    },
    "ge5lprt": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge5lprt/",
      "text": "thank you for this post !! what counts as superb/good ecs, i'm looking over mine and i'm not very confident :(",
      "author": "anpanseok",
      "created": 1606750355,
      "upvotes": 1,
      "replies": {}
    },
    "ge5n4e0": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge5n4e0/",
      "text": "could you do georgetown please ? :) this is super helpful!",
      "author": "olivepizza5",
      "created": 1606751074,
      "upvotes": 1,
      "replies": {}
    },
    "ge66c7i": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge66c7i/",
      "text": "Hi! Thank you so much for this information, it's so helpful! Could you do Emory University? Thanks so much!",
      "author": "hippiebabyted",
      "created": 1606760411,
      "upvotes": 1,
      "replies": {}
    },
    "ge6mzun": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge6mzun/",
      "text": "THIS IS THE POST I NEEDED! \nI'VE NEVER BEEN HAPPIER!!!\nTHANK YOU SO MUCH!",
      "author": "dumb004",
      "created": 1606768185,
      "upvotes": 1,
      "replies": {}
    },
    "ge7xl90": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge7xl90/",
      "text": "Hey! Thanks for doing this. Can you go more deeper into UNC. Like what is the GPA requirement for UNC since they do not want \"nerds\"? Thanks",
      "author": "PotentiallySweaty",
      "created": 1606790695,
      "upvotes": 1,
      "replies": {}
    },
    "gebxaqg": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gebxaqg/",
      "text": "Yo could you please do each UC",
      "author": "yashch19",
      "created": 1606878586,
      "upvotes": 1,
      "replies": {}
    },
    "geckjss": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/geckjss/",
      "text": "any thoughts on NYU? i already applied ED but i just wanted to know anyway haha",
      "author": "moistegg20",
      "created": 1606895141,
      "upvotes": 1,
      "replies": {}
    },
    "gepz12m": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gepz12m/",
      "text": "can you expand on Penn?? TYSM for doing this!!!",
      "author": null,
      "created": 1607193146,
      "upvotes": 1,
      "replies": {}
    },
    "geqaybb": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/geqaybb/",
      "text": "Could I ask about Case western?",
      "author": "Sad_Carrot97",
      "created": 1607199115,
      "upvotes": 1,
      "replies": {}
    },
    "geqsuuf": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/geqsuuf/",
      "text": "What does “grit” mean for Berkeley ?",
      "author": "blankpapr",
      "created": 1607207207,
      "upvotes": 1,
      "replies": {}
    },
    "getpg0s": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/getpg0s/",
      "text": "Can you search Harvard?",
      "author": "carbsandbutter",
      "created": 1607259918,
      "upvotes": 1,
      "replies": {}
    },
    "gfhtle5": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gfhtle5/",
      "text": "But can I apply to grad school with a 3.0 gpa though?",
      "author": "OddOutside101",
      "created": 1607752512,
      "upvotes": 1,
      "replies": {}
    },
    "gfizzpv": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gfizzpv/",
      "text": "could you expand on uchicago? other than essays being a major part of the app what do they look for in their students in particular, preferences, etc",
      "author": "seas_and_skies",
      "created": 1607781956,
      "upvotes": 1,
      "replies": {}
    },
    "gg3kddy": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gg3kddy/",
      "text": "Do I have a solid shot at any of these? Ivies? UT Austin and UCLA? \n\nUW GPA: 3.4 W GPA: 4.1\n\nSAT: 1480\n\nHard course rigor\n\nFirst Place FBLA Winner National\n\nFounded two organizations (one is a nonprofit, one is more of a job type thing)\n\nLots of leaderships club positions\n\nAny other info to tell you that would help?",
      "author": "Environmental-Tear93",
      "created": 1608171489,
      "upvotes": 1,
      "replies": {}
    },
    "gg7mg2p": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gg7mg2p/",
      "text": "Hey, when can we expect one of these for the Ivies?",
      "author": "waysky20",
      "created": 1608260078,
      "upvotes": 1,
      "replies": {}
    },
    "ggseihm": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ggseihm/",
      "text": "should I submit a 1480 SAT with a 700 reading to T20s if I'm applying as a politics major?",
      "author": "Suitable_Pickle_7615",
      "created": 1608722836,
      "upvotes": 1,
      "replies": {}
    },
    "ghf8adc": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ghf8adc/",
      "text": "I know this post is like 50 years old in reddit time but I just want to let op know this gave me so much more confidence 🙏",
      "author": "CaptainSullyPhillips",
      "created": 1609271303,
      "upvotes": 1,
      "replies": {}
    },
    "giog40a": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/giog40a/",
      "text": "This is the stupidest post I've ever seen on this sub.",
      "author": "yhtsr",
      "created": 1610217437,
      "upvotes": 1,
      "replies": {}
    },
    "gj9forp": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gj9forp/",
      "text": "Emory?",
      "author": "VTDMAN7",
      "created": 1610653389,
      "upvotes": 1,
      "replies": {}
    },
    "gl5138j": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gl5138j/",
      "text": "columbia and nyu please? also, you mentioned you’ve done research, could you maybe do a post on getting research opportunities for high schoolers? this was really helpful though, thanks!",
      "author": "seas_and_skies",
      "created": 1611864795,
      "upvotes": 1,
      "replies": {}
    },
    "gnd3ey9": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gnd3ey9/",
      "text": "Hey can you do Emory and NYU",
      "author": "VTDMAN7",
      "created": 1613282932,
      "upvotes": 1,
      "replies": {}
    },
    "gqmcjyc": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gqmcjyc/",
      "text": "Ngl Your Notre Dame one is spot on because a friend of mine got in Early and she’s exactly like that. She’s also insanely hard driven and passionate in a good way!",
      "author": "Sad_Carrot97",
      "created": 1615498683,
      "upvotes": 1,
      "replies": {}
    },
    "ge1qfhx": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1qfhx/",
      "text": "[deleted]",
      "author": null,
      "created": 1606665808,
      "upvotes": 0,
      "replies": {
        "ge1r0qq": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1r0qq/",
          "text": "[deleted]",
          "author": null,
          "created": 1606666025,
          "upvotes": 3,
          "replies": {
            "ge23jqa": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge23jqa/",
              "text": "i think: https://i.kym-cdn.com/entries/icons/original/000/032/114/manhattan.jpg",
              "author": "peteyMIT",
              "created": 1606671330,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ge1o7xs": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge1o7xs/",
      "text": "if you don't mind, please give your analysis on Wellesley College 🥺🙈",
      "author": "19SwiftsAndCounting",
      "created": 1606665045,
      "upvotes": 1,
      "replies": {}
    },
    "ge2owv1": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2owv1/",
      "text": "This makes me feel like I’m not going to get in anywhere 😔",
      "author": "WinterWhippet",
      "created": 1606680585,
      "upvotes": 1,
      "replies": {
        "ge2udr3": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2udr3/",
          "text": "Haha same...",
          "author": "unpotato7313",
          "created": 1606682759,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge2q4py": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2q4py/",
      "text": "Do you think you could do UW-Madison? Is it basically the same as Purdue/UIUC? Awesome list!",
      "author": "blockygravy",
      "created": 1606680946,
      "upvotes": 1,
      "replies": {
        "ge2q9np": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2q9np/",
          "text": "Yes!",
          "author": "thayirshetti",
          "created": 1606680990,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge2ruw4": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ruw4/",
      "text": "[deleted]",
      "author": null,
      "created": 1606681580,
      "upvotes": 0,
      "replies": {
        "ge2si0u": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2si0u/",
          "text": "I definitely think you'd still be qualified, but Idk for MIT. I suggest you apply to UVA too, which looks strongly at improvement.",
          "author": "thayirshetti",
          "created": 1606681883,
          "upvotes": 1,
          "replies": {
            "ge2ufuh": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge2ufuh/",
              "text": "That's a shame, I shouldn't have gotten my hopes up lol. I was planning to apply to other colleges as well\n\nThanks!!",
              "author": "ReneeHiii",
              "created": 1606682786,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge32duz": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge32duz/",
      "text": "[deleted]",
      "author": null,
      "created": 1606686463,
      "upvotes": -2,
      "replies": {
        "ge3kaan": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3kaan/",
          "text": "I think you do! You challenged yourself a lot man! However, if you don’t have extraordinary essays or ECs, that could hurt your chances for T15. It’s getting competitive. 😕 Do you have an upward trend?",
          "author": "thayirshetti",
          "created": 1606695799,
          "upvotes": 2,
          "replies": {
            "ge3oyjw": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3oyjw/",
              "text": "Not really with grades, but my GPA got better because more APs, I got into more honors societies, my volunteering increased",
              "author": "vish_the_fish737",
              "created": 1606698487,
              "upvotes": 2,
              "replies": {}
            },
            "gfd8wmh": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/gfd8wmh/",
              "text": "I didn’t get it",
              "author": "vish_the_fish737",
              "created": 1607667577,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ge3ij59": {
      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge3ij59/",
      "text": "You say T20, but then include an incredible number of non-Top 20. Uiuc, purdue, uf, etc.....",
      "author": "waterfrog987654321",
      "created": 1606694836,
      "upvotes": -3,
      "replies": {
        "ge4i219": {
          "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4i219/",
          "text": "[deleted]",
          "author": null,
          "created": 1606716650,
          "upvotes": 2,
          "replies": {
            "ge4i9f6": {
              "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge4i9f6/",
              "text": "Yeah, thats when youre really grasping at straws. I can name more than 5 schools i guarantee you will take before uiuc even if your a CS major. Stanford, MIT, Caltech, uchicago, Princeton, Harvard, etc. Yeah you're not taking uiuc over those and frankly the list is quite a bit longer.\n\n\n\n\n\n\nMajor rankings is getting into major cope territory.",
              "author": "waterfrog987654321",
              "created": 1606716820,
              "upvotes": -2,
              "replies": {
                "ge6fkiz": {
                  "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge6fkiz/",
                  "text": "stanford/mit/berkeley/cmu are ranked better than uiuc for cs. uiuc is better than cornell for cs. tech companies know uiuc is better for cs than uchicago (which barely has an engineering department) and many other 't20' schools so yes it should be included on this list lol. also if you dont believe in major rankings why do you care so much about school rankings",
                  "author": "hlharry",
                  "created": 1606764731,
                  "upvotes": 3,
                  "replies": {
                    "ge6g7c0": {
                      "link": "/r/ApplyingToCollege/comments/k3akox/analysis_on_what_t20_schools_want/ge6g7c0/",
                      "text": "You can tell yourself that, but as someone with close ties to people actually in tech, i can tell you now, theyre gonna take people with the better university for undergrad. Major rankings are mainly fueled by graduate programs. If we're talking undergrad, a Caltech, northwestern, uchicago, princeton, brown, cornell, etc degree all look more impressive than uiuc and will get you better inroads. Period. Talking about major rankings, again, for undergrad, is a coping tale as old as time. Might be one thing if you get into a better school and genuinely choose uiuc for CS (but lets be real...almost no one is gonna choose uiuc over caltech, all else being equal)",
                      "author": "waterfrog987654321",
                      "created": 1606765024,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}