{
  "sid": "q9k87a",
  "link": "/r/ApplyingToCollege/comments/q9k87a/utsa_vs_texas_tech_vs_unt/",
  "title:": "UTSA vs Texas Tech vs UNT",
  "text": "Which would be a better university for Computer Science?\n\nI’ll be a international transfer student from another 4 year university in the US. So, I just wanna make sure I’m employable and the degree is not seen as 2nd rate by employers. \n\nThat being said, I know most of CS anywhere is about learning skills yourself and applying your knowledge by making projects. \n\nDo you get a lot of companies that send recruiters? (Non-Defense)\n\nPersonally, I rather avoid Lubbock because it seems kinda dead. I hear that Denton is fun. I also get mixed reviews about SA. Anyway, I don’t exactly want to risk employability over trivial stuff (if that makes sense).\n\nI would be grateful if current CS majors and CS alumni to share their experiences with me.",
  "author": "FillRecent",
  "created": 1634417125,
  "updated": 1634573997,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgwkcbl": {
      "link": "/r/ApplyingToCollege/comments/q9k87a/utsa_vs_texas_tech_vs_unt/hgwkcbl/",
      "text": "Not UTSA.  Of Tech vs. UNT, probably Tech, but it's close and you're not wrong about Lubbock.  Tech student body is generally more conservative; North Texas more artsy and/or progressive.  Over 50% of UNT CS grads end up working in the DFW area.",
      "author": "jayphoward",
      "created": 1634417772,
      "upvotes": 3,
      "replies": {}
    },
    "hgwjm2l": {
      "link": "/r/ApplyingToCollege/comments/q9k87a/utsa_vs_texas_tech_vs_unt/hgwjm2l/",
      "text": "Try their subreddits r/UTSA, r/TexasTech, r/unt and r/cscareerquestions",
      "author": "elkrange",
      "created": 1634417450,
      "upvotes": 1,
      "replies": {}
    },
    "hgwksq9": {
      "link": "/r/ApplyingToCollege/comments/q9k87a/utsa_vs_texas_tech_vs_unt/hgwksq9/",
      "text": "UNT is a good school in general and Denton can be fun. I don't know about computer science programs.",
      "author": "Calvin-Snoopy",
      "created": 1634417974,
      "upvotes": 1,
      "replies": {}
    },
    "hgx5k9q": {
      "link": "/r/ApplyingToCollege/comments/q9k87a/utsa_vs_texas_tech_vs_unt/hgx5k9q/",
      "text": "Why limit yourself to just these three options? Even if you want to stay within Texas, UT Dallas and UT Arlington are better options and they're not too selective.",
      "author": "prsehgal",
      "created": 1634427453,
      "upvotes": 1,
      "replies": {}
    }
  }
}