{
  "sid": "qk51o6",
  "link": "/r/ApplyingToCollege/comments/qk51o6/would_moving_from_an_honors_level_to_a_regular/",
  "title:": "Would moving from an honors level to a regular level look bad?",
  "text": "Hi! I'm currently taking Honors Calc (highest my school offers) but I'm struggling a lot. I have the opportunity to move to the regular class, but that means \"withdraw\" will come up on my transcript for the honors level. Would this leave me in a bad position for applying to colleges?",
  "author": "Alarmed-Lime69",
  "created": 1635735928,
  "updated": 1636151834,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hiv1zxp": {
      "link": "/r/ApplyingToCollege/comments/qk51o6/would_moving_from_an_honors_level_to_a_regular/hiv1zxp/",
      "text": "You should take the class in which you will effectively learn and eventually succeed.\n\nA low grade and not actually learning the subject will not benefit anyone. If you have tried the usually paths for addressing a challenging situation and they haven’t helped, moving to a course with a greater chance of success probably makes sense.\n\nFwiw, my daughter dropped from a top-level history class to the next tier, as a Junior in HS, and recently graduated from a T10 engineering school. One class will not in itself be a barrier to success.",
      "author": "RichInPitt",
      "created": 1635754520,
      "upvotes": 1,
      "replies": {
        "hj2r47q": {
          "link": "/r/ApplyingToCollege/comments/qk51o6/would_moving_from_an_honors_level_to_a_regular/hj2r47q/",
          "text": "Thank you so much! People tell me to take the highest level courses, but that's not always ideal. I'm enjoying the class, but math isn't my strongest subject. I think I will see how the quarter plays out, then make my decision.\n\nI’m also glad to know that others in this position have been just fine!",
          "author": "Alarmed-Lime69",
          "created": 1635894751,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}