{
  "sid": "qa2da5",
  "link": "/r/ApplyingToCollege/comments/qa2da5/canadian_universities_for_tech/",
  "title:": "Canadian universities for tech",
  "text": "Hey,\n\nI live in Canada and my school doesn’t give us a lot of information about universities. Since I want to study in CS or SWE, I was wondering if you guys knew useful ressources that could help me make chose which college to attend. I have a few in mind  but I’m really not sure which on would suit me the best.",
  "author": "LKrs13",
  "created": 1634488847,
  "updated": 1634653871,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh036je": {
      "link": "/r/ApplyingToCollege/comments/qa2da5/canadian_universities_for_tech/hh036je/",
      "text": "Waterloo would be my favourite option, followed by UToronto, UBC, and UAlberta. But there are many others - you should be able to find some lists online.",
      "author": "prsehgal",
      "created": 1634489142,
      "upvotes": 1,
      "replies": {}
    },
    "hh0bzwr": {
      "link": "/r/ApplyingToCollege/comments/qa2da5/canadian_universities_for_tech/hh0bzwr/",
      "text": "waterloo for CS, uofT for Eng, Queens/Ivey for biz",
      "author": "DiarrheaASMR28",
      "created": 1634492816,
      "upvotes": 1,
      "replies": {}
    },
    "hh0h9eo": {
      "link": "/r/ApplyingToCollege/comments/qa2da5/canadian_universities_for_tech/hh0h9eo/",
      "text": "Waterloo, McGill, UofT, UBC, and Queens.\n\nIf you plan to stay and work in Canada, you can also consider Western, Windsor, McMaster, or Carleton. They all have decent programs but aren't as well recognized here in silicon valley. \n\nConsider where you want to live for the next four years, too. As in, what type of environment. If you want a college town, then Waterloo or UBC are for you. (UBC is in Vancouver, but is its own little magical world). If you want big city life right outside your door, then UofT, Carleton, McGill. If you want to be bored when you leave campus, then Queen's or Western (sorry Kingston and London, ya basic.)",
      "author": "LadyMjolnir",
      "created": 1634494949,
      "upvotes": 1,
      "replies": {}
    }
  }
}