{
  "sid": "dybazd",
  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/",
  "title:": "People need to stop saying recruited athletes took their spot in college",
  "text": "These kids worked their butts off to become top tier athletes so that they could earn a spot on a D1 or top tier university's team. And these schools have elite athletic programs with large followings of fans, so they have to make room in their class for these athletes or they wouldn't have a competitive team. They earned their spot in these colleges, albeit a different way than most, (sometimes harder if they still have really good gpa / sat score) and its just a shitty thing to say to them that they took someone else's spot.\n\nEdit: (parantheses)\nAlso, my argument is not for or against atheletics in universities, it's something that's already there and plays a big role in universities",
  "author": null,
  "created": 1574118524,
  "updated": 1634076536,
  "over_18": false,
  "upvotes": 1885,
  "upvote_ratio": 0.87,
  "comments": {
    "f80a33z": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80a33z/",
      "text": "I myself haven't actually said this, but I think they have a kind of jealousy towards athletes, which I can kind of understand. In my school (I imagine others as well), sports is heavily funded and valued while the more academic clubs and activities almost never get any attention. For example, I'm in my school's Science Olympiad team, and last year we made it to the state competition and were very proud of ourselves because it was the first time in years our school had accomplished this. We only got a short congratulations in the morning announcements, which no one listens to. In contrast, the sports teams have banners up all over school and special recognition in the weekly news videos we have.\n\nThis is not to say that athletes don't work as hard as others; they sacrifice a lot of time to pursue their sports, and I respect that. It just feels like consistently getting the short end of the stick in terms of positive feedback from peers and others.",
      "author": "______Nobody______",
      "created": 1574124009,
      "upvotes": 479,
      "replies": {
        "f80db6u": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80db6u/",
          "text": "exactly, most schools value athletics (tbh, mainly football) a fuck ton over everything else. my school’s football team is always getting congratulated despite having a 2-6 record this year while the mock trial team was 1st in state and in the top 15 for the nation and literally no one cared",
          "author": "ughpierson",
          "created": 1574126300,
          "upvotes": 219,
          "replies": {
            "f80rteo": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80rteo/",
              "text": "Not most schools— most people. There’s just a much bigger audience for football or basketball than mock trial or whatever and schools adjust accordingly. It’s kind of human nature I guess...",
              "author": "SkippnNTrippn",
              "created": 1574136548,
              "upvotes": 82,
              "replies": {
                "f80vxfv": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80vxfv/",
                  "text": "Yeah exactly this is the point lol. I get it ppl work hard for their academic competitions but nobody cares about them at all, a lot of people care about sports, that's the difference. Nothing wrong with doing ur academic competitions for your own purposes, good for you actually, but don't expect it to get a lot of attention from normal people lol",
                  "author": "Jusuf_Nurkic",
                  "created": 1574139950,
                  "upvotes": 41,
                  "replies": {
                    "f80xq2f": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80xq2f/",
                      "text": "of course, but i think the point that was trying to be made is that mock trial should be perceived that way",
                      "author": "thenewwwguy2",
                      "created": 1574141672,
                      "upvotes": 2,
                      "replies": {
                        "f81rx5c": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81rx5c/",
                          "text": "it definitely should be but unfortunately we can’t really do anything to change it.",
                          "author": null,
                          "created": 1574175928,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "f82vmyb": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82vmyb/",
                      "text": "He’s not asking people to care more about something they don’t. He’s just saying that kids are obviously gonna be jealous of athletes when they put in the same amount of work and get zero attention from their school or the colleges they’re applying to.",
                      "author": "THROWAWAY_thetr4sh",
                      "created": 1574199095,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "f80wbev": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80wbev/",
                  "text": "It’s not human nature, it’s American culture.",
                  "author": "kashuda2",
                  "created": 1574140308,
                  "upvotes": 15,
                  "replies": {
                    "f80xdrm": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80xdrm/",
                      "text": "I’d hesitate to say American... in other countries soccer/rugby play the exact same role",
                      "author": "SkippnNTrippn",
                      "created": 1574141334,
                      "upvotes": 4,
                      "replies": {
                        "f810opv": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f810opv/",
                          "text": "True, I'm from Costa Rica and it happens here. Not even just with non sports activities like Model UN or Math Olympiad. Sports like swimming (one of our more successful teams) and volleyball (girl's team is the most successful for the school and men's is about to get there this year) don't get any attention. Pretty much only soccer and basketball get watched and people only play those sports. Girls volleyball is doing great, there are quite a few middle schoolers that are training every day and are gonna be great when they're in highschool. But then there's men's which has 1 middle schooler ATM that practices once a month. We're currently mostly sophomores and juniors; when we leave there won't be a team to continue playing.",
                          "author": "Cardonutss",
                          "created": 1574144863,
                          "upvotes": 7,
                          "replies": {}
                        },
                        "f80xh50": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80xh50/",
                          "text": "Sure, mainly saying it isn’t human nature.",
                          "author": "kashuda2",
                          "created": 1574141423,
                          "upvotes": 1,
                          "replies": {
                            "f813eea": {
                              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f813eea/",
                              "text": "Sure it is. Humans have consistently valued physical perfection over artistic and mental for thousands of years. The Olympics were a purely physical celebration and were by far the most famous. Many folks enjoyed classic theater, but *everyone* enjoyed chariot racing and gladiatorial combat.",
                              "author": "Treacherous_Peach",
                              "created": 1574148229,
                              "upvotes": 6,
                              "replies": {
                                "f81khle": {
                                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81khle/",
                                  "text": "Gah, it is American culture to prioritize it in schools. It is not like that in many places. I went to a high school that didn’t have any sports at all, it was all spent on technology programs.",
                                  "author": "kashuda2",
                                  "created": 1574170300,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "f811pa5": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f811pa5/",
                      "text": "definitely American culture, at my school half the funding goes towards football while the rest of the clubs and remaining sports have to share the remaining budget.",
                      "author": "kekekejill",
                      "created": 1574146066,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f80zsec": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80zsec/",
              "text": "I compered in both athletics and math team in highschool and while it sucks, it makes sense for schools to support athletics substantially more than smaller, more niche programs.\n\nI'm from Wisconsin so it's not the most football-centric area, but still if our highschool team was playing at home the stadium was sold out and everyone from 80 year old retirees with no grandkids to the elementary school kids who play touch football for the YMCA would be there. Makes more sense to support a community building program that requires much more equipment and such, but also generates alot of revenue, compared to a debate team where no matter how good you are, very few people will go to competitions to watch.",
              "author": "CreamyCheeseBalls",
              "created": 1574143840,
              "upvotes": 11,
              "replies": {}
            },
            "f82i3j3": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82i3j3/",
              "text": "My brother's science bowl team made the national finals in his freshman year and they got a short shoutout on the intercom in the morning while the football team won 0 games and got shoutouts each week for the best performer from our football team each game. Like wtf, how good could he have been if they legit won 0 games?\n\nThe same thing basically happened the next 2 years when my team lost 0 games throughout science bowl regionals. Undefeated regional champions, back to back, and we held our own against top 5 teams in the nation at nationals both years. We only got short shoutouts and even the girls soccer team got more attention and stuff while literally being cannon fodder.",
              "author": "sammy_sam0sa",
              "created": 1574191672,
              "upvotes": 3,
              "replies": {
                "f82ih53": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82ih53/",
                  "text": "wow, my school hardly cares about most of the other sports, let alone soccer. i only know the soccer schedule because my stats teacher writes each event on her calendar for convenience",
                  "author": "ughpierson",
                  "created": 1574191887,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "f816es4": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f816es4/",
              "text": "2-6 record damn you guys are good. The high school I used to go to literally made merch mocking the other team (2nd worst team). If you’re wondering who was the worst, we lost against them. The amount of money that went into our shitty spirts teams was insane. The best teams we had was for golf and wrestling (the coaches are monsters).",
              "author": "Alger_Onzin",
              "created": 1574152425,
              "upvotes": 2,
              "replies": {
                "f82gtrn": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82gtrn/",
                  "text": "ironically, my school has produced several decent golfers who play for colleges and literally no one cares or acknowledges it most of the time",
                  "author": "ughpierson",
                  "created": 1574190950,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "f81ribt": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81ribt/",
              "text": "What school do you go to cause this sounds like my high school?",
              "author": "Sparta_Kush",
              "created": 1574175648,
              "upvotes": 2,
              "replies": {
                "f82gnmq": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82gnmq/",
                  "text": "i go to this relatively small high school in louisiana, west feliciana or wfhs",
                  "author": "ughpierson",
                  "created": 1574190851,
                  "upvotes": 1,
                  "replies": {
                    "f832rm4": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f832rm4/",
                      "text": "Oh nvm then",
                      "author": "Sparta_Kush",
                      "created": 1574203141,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f81q5wc": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81q5wc/",
              "text": "Ok boomer",
              "author": null,
              "created": 1574174712,
              "upvotes": 1,
              "replies": {
                "f82gqc9": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82gqc9/",
                  "text": "nah, boomers value sports over most academic pursuits i’m a zoomer 😎",
                  "author": "ughpierson",
                  "created": 1574190895,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f80egre": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80egre/",
          "text": "I agree, but I think it's mainly just certain sports that get recognition.\n\n In my high school the only things people give a shit about are football, basketball, and softball. Our tennis, cross country, and golf teams qualify for state every year and last year 5 out of 6 boys on our hs boys tennis team medaled at state and no one ever said anything about it. Yet, we have pep rallies almost every Friday in football season just so our team can go get fucking ran 0-51.",
          "author": "KeatonLollis",
          "created": 1574127105,
          "upvotes": 46,
          "replies": {
            "f81t19q": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81t19q/",
              "text": "> no one ever said anything about it.\n\nBut ... you just said something about it.",
              "author": "kickstand",
              "created": 1574176678,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f80d9yx": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80d9yx/",
          "text": "[deleted]",
          "author": null,
          "created": 1574126275,
          "upvotes": 26,
          "replies": {
            "f80gkye": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80gkye/",
              "text": "I’m also on an FTC team at my school. We meet year-round from September to February (or March, if we did well in the meets) 3 times a week. Our team doesn’t get recognized at all when we do well in competitions. Some people at my school don’t even know we have a Robotics Club",
              "author": "-day-dreamer-",
              "created": 1574128541,
              "upvotes": 13,
              "replies": {
                "f80h7kl": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80h7kl/",
                  "text": "my team made worlds 13 yrs in a row for FRC w barely any recognition (but we get HELLA funding and tbh getting money + getting left alone >>>>> scrutiny any day)",
                  "author": "perspica",
                  "created": 1574128970,
                  "upvotes": 10,
                  "replies": {
                    "f80iw0n": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80iw0n/",
                      "text": "Our school doesn’t even fund our team. We get the money from people joining ($250 per domestic student, and every international student automatically pays through their tuition) and sponsors",
                      "author": "-day-dreamer-",
                      "created": 1574130111,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f80iwh7": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80iwh7/",
              "text": "Most athletes have to hit certain scores and grades to even be considered for recruiting. Athletes going to top schools are certainly no dumber than the children of millionaires who donated a building to get their kid in, and have worked a whole lot harder than that kid to get the spot on the team. It’s probably unfair in both cases, but that’s just how the process works. If the application process is about making yourself attractive to colleges, then sports (and being the child of a billionaire) are qualities that make you attractive.",
              "author": "stickerforprez",
              "created": 1574130120,
              "upvotes": 14,
              "replies": {}
            },
            "f80i1pu": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80i1pu/",
              "text": "Athletes with high GPAs do work hard though. I play a varsity sport (Lacrosse) and during the off-season we have something going on 5 days a week and 6 days a week during the season. Nobody’s saying that non-student athletes don’t work hard, especially if you do do clubs and work and have extra curriculars. It’s just that sports do take a lot of time and hard work. \n\nIt’s also not fair that athletes get a bad rap for being dumb all the time. There are sports where a lot of them are (see: football) but a lot of high school athletes are smart guys who like to be active.",
              "author": "college_throwaway34",
              "created": 1574129538,
              "upvotes": 5,
              "replies": {}
            },
            "f81iuej": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81iuej/",
              "text": "> But did they work harder than me?\n\nWell, if they are D1 athletes, they did worked their ass off. Hard to tell if harder than you or me, but 4 years of high school should be more than just 4.O GPA and 1600 SAT.",
              "author": "shadowpreachersv",
              "created": 1574168835,
              "upvotes": 2,
              "replies": {}
            },
            "f80ojo4": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ojo4/",
              "text": "[deleted]",
              "author": null,
              "created": 1574134097,
              "upvotes": 3,
              "replies": {
                "f83653f": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f83653f/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1574205156,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "f80pao0": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80pao0/",
              "text": "[deleted]",
              "author": null,
              "created": 1574134648,
              "upvotes": -2,
              "replies": {
                "f80pyqj": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80pyqj/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1574135149,
                  "upvotes": -2,
                  "replies": {
                    "f80qjvz": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80qjvz/",
                      "text": "That comparison makes no sense at all. Schools openly are proud about their sports and consider it an integral part of their identity. There's more to college than just academics purely. If you don't like it then that's your problem, but for the majority of people, they actually care about sports and want to have some sort of school spirit/excitingness in their life during college, and sports fills that for so many. If you find random weird academic competitions as super exciting, that's your thing. Just realize that for the average person sports are pretty fun and interesting, even if its just for a way to hang out with friends and celebrate your school pride and have some sort of social life. That's a huge part of the college experience for most people. In comparison, very few people give any sort of crap at all about academic competitions. \n\n&#x200B;\n\nColleges openly advertise their athletics as part of the experience of the school. The NFL never has for a second claimed to be an institution for education. Nobody buys NFL tickets for educational value. But people actually care about sports in their colleges, or else the system would totally collapse",
                      "author": "Jusuf_Nurkic",
                      "created": 1574135583,
                      "upvotes": 4,
                      "replies": {
                        "f80refn": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80refn/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1574136223,
                          "upvotes": -4,
                          "replies": {
                            "f80so6n": {
                              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80so6n/",
                              "text": "Dude you're just being extremely disingenuous and its soooooo obvious. This is simple economics colleges will provide what the people want them to give otherwise they would lose money, it's a business after all. People buy tons of gear, tickets, etc. to support their school's sports, bringing in a ton of money for colleges. The students on campus are extremely open in their support of their sports teams, which is why they pack the stadiums all the time. Go on like Duke's subreddit and ask them if they are happy that they have an elite basketball team, I promise you 99% of the responses will tell you that they greatly appreciate having that as part of their college experiences lol.\n\n&#x200B;\n\nI think what you don't realize with your NFL example is that you're entirely shutting down your own point. Let's say that you want the NFL to be an academic institution. Well guess what, nobody gives shit because you're like the only person in the world to believe that. 99.99% of people who follow the NFL want it to be a purely sports academics. Your outlier opinion on what you think \"should\" happen means nothing in this context.\n\n&#x200B;\n\nThe same goes for college sports. You're the clear outlier here because again, the majority of people who go to college probably care about their sports. Ask in like the duke subreddit how many of them care about college sports, I'll bet nearly all of them do. \n\n&#x200B;\n\n [http://fs.ncaa.org/Docs/stats/football\\_records/Attendance/2018.pdf](http://fs.ncaa.org/Docs/stats/football_records/Attendance/2018.pdf) \n\n&#x200B;\n\nFor D1 football, average attendance is 40k. College sports is a hugeeeee deal. People actually care about this. You go find some data that people actually don't care about college sports lol, your in the small minority here just like the theoretical NFL fan who wants it to become an academic institution.\n\n&#x200B;\n\nAnd of course popular obviously does not always mean right. But if you wanna play the game that college should remove sports just because a few people think so then you can use your same arguments to the NFL point and they would be legitimate.",
                              "author": "Jusuf_Nurkic",
                              "created": 1574137220,
                              "upvotes": 7,
                              "replies": {
                                "f80tf7x": {
                                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80tf7x/",
                                  "text": ">Dude you're just being extremely disingenuous and its soooooo obvious. This is simple economics colleges will provide what the people want them to give otherwise they would lose money, it's a business after all. People buy tons of gear, tickets, etc. to support their school's sports, bringing in a ton of money for colleges. The students on campus are extremely open in their support of their sports teams, which is why they pack the stadiums all the time. \n\nI'm on mobile now, but In my last comment I provided a link to NCAA financial reports. The median FBS school lost 16 million on their programs. >75% of them *lost* money on their athletic departments. Don't call me \"disingenuous\" when I'm the only one providing numbers.\n\n>I think what you don't realize with your NFL example is that you're entirely shutting down your own point. Let's say that you want the NFL to be an academic institution. Well guess what, nobody gives shit because you're like the only person in the world to believe that. 99.99% of people who follow the NFL want it to be a purely sports academics. Your outlier opinion on what you think \"should\" happen means nothing in this context.\n\nThat's the point. It a stupid fucking idea. It's one of the worst ideas ever. And it goes the other way to, you are just used to it the other way.\n\n>The same goes for college sports. You're the clear outlier here because again, the majority of people who go to college probably care about their sports. Ask in like the duke subreddit how many of them care about college sports, I'll bet nearly all of them do.\n\nAsk northwestern students how they feel that the football program dumped $2.4 million into winning 2 games when our mental health service isn't adequately funded.\n\n>For D1 football, average attendance is 40k. College sports is a hugeeeee deal. People actually care about this. You go find some data that people actually don't care about college sports lol\n\nAnd developer leagues can be just as big of a deal. Look at every other country which hasn't needlessly intertwined sports and school\n\n>your in the small minority here just like the theoretical NFL fan who wants it to become an academic institution.\n\nYou realize that I wasn't being serious there? That I was making a comparison to something idiotic to show my point. Please tell me you aren't that daft.",
                                  "author": "Zeus1325",
                                  "created": 1574137825,
                                  "upvotes": -1,
                                  "replies": {
                                    "f80u59x": {
                                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80u59x/",
                                      "text": "\\> I'm the only one providing numbers \n\nLmao you literally didn't even read my comment I linked to CFB attendance stats to show you how much people care about this. If college sports is such a terrible idea why do so many people love it so much? Why does d1 football have 40k attendance?  It may not be profitable in all cases but some of the benefit such as creating a culture where students can actually enjoy their life and have fun. If there was no benefit to the university why the hell wouldn't they cut the program entirely? It's a business\n\nWe can go back and forth cherry picking random data points for days on the northwestern/duke thing. I'm just not even gonna go into this\n\n\\> You realize that I wasn't being serious there? That I was making a comparison to something idiotic to show my point. Please tell me you aren't that daft. \n\nOf course I do read my comment. I'm saying that your idea that we should end college sports is a dumb opinion in the small minority. Most normal people actually enjoy college sports, which is why attendance is so high as an objective measure, and it's also just extremely obvious. Look how popular march madness is.",
                                      "author": "Jusuf_Nurkic",
                                      "created": 1574138390,
                                      "upvotes": 1,
                                      "replies": {
                                        "f80wric": {
                                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80wric/",
                                          "text": ">Lmao you literally didn't even read my comment I linked to CFB attendance stats to show you how much people care about this.\n\nBut I didn't call you a liar and say that \"people don't care\" or that \"people don't show up\". I said that they are mostly losing money and you called me a liar.\n\n>If college sports is such a terrible idea why do so many people love it so much? Why does d1 football have 40k attendance? I\n\nBecause it replaces something else. There's no reason to believe that the development sports leagues have a substantially increase in fans just because they are affiliated with a school, or that the school should care about it's fans. \n\nFurthermore, 40k isn't that much. Let's assume that a generous 1/3 of those in attendance were students. (Michigan had 2x the number of people attend on average than # of students, Penn St 2.6x, Ohio St. 2.19x). So 13.3k students per game, at an average of 6.79 games per team. Total attendance of 90,500 students at all the games. So it's $177 per person per game. There exists a  significant discontinuity there. \n\n\n>If there was no benefit to the university why the hell wouldn't they cut the program entirely? It's a business\n\nschools make decisions we disagree with all the time. Schools make financially unwise decisions we can disagree with all the time. How is this one different? \n\n>I'm saying that your idea that we should end college sports is a dumb opinion in the small minority.\n\nI'm not saying \"end college sports\" I am saying:\n\n1. Don't hold spots for athletes\n\n2. Don't pump millions of dollars into the programs.",
                                          "author": "Zeus1325",
                                          "created": 1574140732,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "f81ryq8": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81ryq8/",
              "text": "I do FTC year round and I play a sport. Let me tell you I spend way more time than that on my sport. You average 2 hours a day on FTC? I average 3.5 hours a day on my sport (not counting frequent tournaments), and then an additional 1 hour a day for FTC assuming we don’t have competitions. \n\nI also have a 4.5 weighted GPA (4.0 unweighted), and as you can tell, have taken numerous AP classes. I have more stats but I don’t feel the need to get into it as I think I’ve said enough.",
              "author": "Sparta_Kush",
              "created": 1574175958,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "f80phjd": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80phjd/",
          "text": "It's cuz average people don't care at all about academic competitions while many more people care about sports. Like or or not that's just what people are interested in lol",
          "author": "Jusuf_Nurkic",
          "created": 1574134788,
          "upvotes": 3,
          "replies": {}
        },
        "f80io42": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80io42/",
          "text": "[deleted]",
          "author": null,
          "created": 1574129959,
          "upvotes": 18,
          "replies": {
            "f80lv8i": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80lv8i/",
              "text": "A lot of music stuff can be the same way. I’ve been getting home at 7 or 8 almost every day since about a month into the school year cause of music stuff",
              "author": "Hydraulicmink4",
              "created": 1574132170,
              "upvotes": 19,
              "replies": {}
            },
            "f81jnva": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81jnva/",
              "text": "The robotics team at my school meets 3-5 hours after school each day, sometimes more. Plus, in weekends all day if we need it. Whenever we get to World's we just get a short \"congrats\". The most we've gotten was when we won all of our state offseason competition, and they spliced together 5 seconds of footage of our comp with 5 seconds of footage from an entirely different comp. It's sort of a meme at my school how the football team gets so much coverage only to say they lost and \"we'll get them next time\". That being said, I still think sports require so much dedication. They've got to make sure they're eating right, keeping up their training, etc. At my school they take weight training class, so that adds on to their 2+ hour total. There's a lot of pressure because they know there's only so many spots, and therefore understand all their work could be for nothing.",
              "author": "Artist552001",
              "created": 1574169579,
              "upvotes": 6,
              "replies": {}
            },
            "f80jypg": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80jypg/",
              "text": "[deleted]",
              "author": null,
              "created": 1574130854,
              "upvotes": 8,
              "replies": {
                "f817837": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f817837/",
                  "text": "Bro are you really saying maintaining that low ass minimum gpa is hard? I was a wrestler, had some friends who did both wrestling and football. The minimum gpa is a joke. It would be taxing if you took AP classes at the same time which I’ve seen people do and that’s taxing.",
                  "author": "Alger_Onzin",
                  "created": 1574153647,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "f811ysm": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f811ysm/",
              "text": "I’ve been in debate and mock trial and I have travelled around for competitions too and sure the hours are long. But the amount of conditioning and games dont compare to the amount of physical and mental effort it takes to play a sport.",
              "author": "kekekejill",
              "created": 1574146391,
              "upvotes": 1,
              "replies": {}
            },
            "f81752s": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81752s/",
              "text": "As a wrestler and musician you’re not very well informed. The amount of preparation for this stuff is insane in any stance. The difference is one is more academic and the other is physical.",
              "author": "Alger_Onzin",
              "created": 1574153521,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f81argu": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81argu/",
          "text": "Yep, my mock trial team made it pretty far in nat/state competitions and won 4th in the main tourney in the state, not even an announcement. I get it but it kinda sucks when the soccer and football teams are blared out 3 times a day for beating a rival",
          "author": null,
          "created": 1574159096,
          "upvotes": 2,
          "replies": {}
        },
        "f81btom": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81btom/",
          "text": "I went to a D1 school and the basketball coach made $980,000 in 2016. I get that schools want sports, but that is a ridiculous amount of money to spend when my adjunct PhD professor is barely making enough to pay her loans.",
          "author": null,
          "created": 1574160710,
          "upvotes": 2,
          "replies": {}
        },
        "f826v91": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f826v91/",
          "text": "A lot of people forget sports usually rack in a fuckton of money, and are for the most part funding themselves",
          "author": "legaljoker",
          "created": 1574185225,
          "upvotes": 1,
          "replies": {}
        },
        "f80lwe2": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80lwe2/",
          "text": "I know right. Same thing with our school. Our computer science team goes to competitions all the time. Including UILs, yet we never get a mention on our school’s news. A cross country runner places 87th, in a UIL competition, and BAM everyone is celebrating. Our team places top 10 on a competition with over 100 teams, and yet no mention. Our team gets 3rd place at a UIL district competition, some member get 1st and 3rd places individually, and yet no mention.",
          "author": "UltmteAvngr",
          "created": 1574132193,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f8008v5": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8008v5/",
      "text": "I def agree. How else would a school get players, tryouts? This isn't high school. I'm a Cal fan and i couldn't see any team worth watching coming out of tryouts for the student body.",
      "author": "BoostedBanana12",
      "created": 1574118873,
      "upvotes": 419,
      "replies": {
        "f80ln2q": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ln2q/",
          "text": "Matt Levine put it really well in his [article talking about the admissions scandal](https://www.bloomberg.com/opinion/articles/2019-03-13/you-have-to-pay-the-right-person): \n\n> Selective colleges have admissions spots that they want to award in particular ways. They want to award some based on academic factors; they want to award others based on athletic skill; they want to award others in exchange for cash, but—and this is crucial—really a whole lot of cash. Buildings are not cheap.\n\nUnfortunately, it's the people who think that *every* seat should be based on academic factors that complain the most.",
          "author": "powereddeath",
          "created": 1574132010,
          "upvotes": 79,
          "replies": {
            "f80p54s": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80p54s/",
              "text": "And the data, as well as your article, show that selective colleges *aren’t* just purely academic institutions. Academics is their core purpose, but they have other needs as well. And they tell us this! Admissions data tells us what a college is looking for and, most of the time, it isn’t just the best academic students. \n\nBy applying to selective schools, we accept the agreement that those colleges are not just academic institutions. And, if you don’t want to accept that agreement, the solution is simple: apply elsewhere.",
              "author": "stickerforprez",
              "created": 1574134532,
              "upvotes": 26,
              "replies": {
                "f80u1wz": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80u1wz/",
                  "text": "> colleges are not just academic institutions\n\nBut at the root of things, that is why they exist...",
                  "author": "digothlian",
                  "created": 1574138323,
                  "upvotes": -3,
                  "replies": {
                    "f80v3mi": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80v3mi/",
                      "text": "No. They exist as cultural centers as well as institutes of higher education-- and they have been this way since the first universities in India and the Middle East.",
                      "author": "dishpanda",
                      "created": 1574139197,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "f81fs1l": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81fs1l/",
                      "text": "At the root of things they were an institution to practice and develop enlightenment. Whether that be through learning, research or hell, even \"cultivating the soul\".\n\nIt would've been the place to discuss and talk about sports, physical health and physical therapy. It would also be the place to keep you mind healthy.\n\nTo think universities were solely related to academia is at best, shortsighted.\n\nHowever, there's a difference between keeping your body healthy and accepting a highschool senior who almost failed all of his classes only because he can run a fucking 4.4.",
                      "author": "cerr221",
                      "created": 1574165807,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f80mcid": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80mcid/",
          "text": "[deleted]",
          "author": null,
          "created": 1574132506,
          "upvotes": 16,
          "replies": {
            "f80okuy": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80okuy/",
              "text": "Colleges / universities are institutions of higher learning, but that's not the only thing they are. They also serve as incubators for the country's athletes that provide a decent bridge between amateur and pro levels. You could try to argue that academics and sports should be separated into different schools then, but both benefit highly from being tied to each other. Sports consistently bring in a lot of money for schools through alumni donations, and athletes receive degrees from these schools which can help act as a safety net if athletics don't pay off.",
              "author": null,
              "created": 1574134121,
              "upvotes": 45,
              "replies": {
                "f80pbk4": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80pbk4/",
                  "text": "> They also serve as incubators for the country's athletes that provide a decent bridge between amateur and pro levels\n\nYou don't know much about the NCAA do you",
                  "author": "Beerspaz12",
                  "created": 1574134666,
                  "upvotes": 6,
                  "replies": {
                    "f80qfpn": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80qfpn/",
                      "text": "How many athletes in the NFL or NBA didn't go to college? How many Olympic athletes didn't go to college / train there?\n\nI don't know of any alternative that can match colleges' ability to connect amateur athletes to the professional level and train them to get there.",
                      "author": null,
                      "created": 1574135498,
                      "upvotes": 24,
                      "replies": {
                        "f813ftj": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f813ftj/",
                          "text": "Yao Ming, Luka Donkic, Dirk....",
                          "author": null,
                          "created": 1574148282,
                          "upvotes": -2,
                          "replies": {
                            "f8147ti": {
                              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8147ti/",
                              "text": "Compared to the number of NBA players who went to college? In the NBA you have international recruitment and other countries operate differently which is why more international players don't have college experience (to be fair my understanding here is limited). You also have a few like LeBron who go straight from high school into the NBA.\n\nIf you're in the U.S. and aren't one of the few who can go pro right after high school, going to a university with a strong basketball program is in all likelihood your best bet to work your way into the NBA. As far as I'm aware the majority of NBA players have gone to college.",
                              "author": null,
                              "created": 1574149322,
                              "upvotes": 8,
                              "replies": {
                                "f814ld9": {
                                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f814ld9/",
                                  "text": "That's because the NCAA has a racket going with the NBA and NFL.  To be eligible for the draft, before this year, one year of college ball was necessary.  They're trying to make it so players can go straight to the G league.  The NFL requires players go thru their junior year before they're draft eligible.  With the NFL, there is a sort of size/growth justification for not allowing 18 year old kids to get bludgeoned by 250 lb men.\n\nHowever, I think there should be a way that is not thru college for the, let's say plurality, that are not interested in education.  I will certainly grant you that, as a practical matter, as the system currently exists, college sports will get an athlete the most exposure.  Especially with football.  States are.legislating the right to make money off the athletes image and name and there is not an international talent pool.  You can't say that about the other big three sports.",
                                  "author": null,
                                  "created": 1574149834,
                                  "upvotes": 0,
                                  "replies": {
                                    "f81b49d": {
                                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81b49d/",
                                      "text": "This is not correct. You can enter the NFL Draft without ever playing football in college. It just hasn't happened very often yet, only once AFAIK, Moritz Böhringer from Germany. The NCAA is still pretty shit though.",
                                      "author": "herrqles",
                                      "created": 1574159645,
                                      "upvotes": 4,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "f8502m4": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8502m4/",
                          "text": "> How many athletes in the NFL or NBA didn't go to college? How many Olympic athletes didn't go to college / train there?\n> \n> I don't know of any alternative that can match colleges' ability to connect amateur athletes to the professional level and train them to get there.\n\nYes, the NCAA has set it up explicitly that way. It is not for the betterment of the students but just to line their own pockets. They were literally selling students rights away for a video game until they had to stop or else pay the students money.\n\nYour argument that they are the only game in town doesn't mean they are at all altruistic or helpful, just that they have a stranglehold / monopoly on student athletes.\n\n[I take issue with your use of the word decent. The NCAA is not decent.](https://www.youtube.com/watch?v=pX8BXH3SJn0)",
                          "author": "Beerspaz12",
                          "created": 1574264677,
                          "upvotes": 0,
                          "replies": {}
                        },
                        "f80vnnh": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80vnnh/",
                          "text": "\"The way things are right now is the best possible way that things could be because that's the way things are.\" See how that sounds?",
                          "author": "Uruz2012gotdeleted",
                          "created": 1574139699,
                          "upvotes": -2,
                          "replies": {
                            "f80vx45": {
                              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80vx45/",
                              "text": "Sure does sound ridiculous. Good thing that's not at all what I said.",
                              "author": null,
                              "created": 1574139942,
                              "upvotes": 7,
                              "replies": {
                                "f80wfsy": {
                                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80wfsy/",
                                  "text": "Pretty much is. You stated support for university athletic programs based on your own lack of knowledge of alternative ways to train pro athletes. Sounds like you support the status quo because it is the status quo.\n\nEdit: wording",
                                  "author": "Uruz2012gotdeleted",
                                  "created": 1574140424,
                                  "upvotes": -2,
                                  "replies": {
                                    "f80xwpl": {
                                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80xwpl/",
                                      "text": "Saying that college is an effective bridge between amateur and pro sports and that I know of no better alternative that exists for that doesn't mean I think there are 0 faults with the current system. It means of the options available, I think that college is the most effective vehicle for athletes to go professional.\n\nIf there are any existing alternatives to training athletes that sets them up *better* for a pro career, you should've just listed them instead of calling me ignorant (something I've already acknowledged I could be) and leaving it at that. If all you're saying is that it *hypothetically* could be better (which is what it seems like you're trying to say), that's kind of a dumb point because literally everything could be hypothetically better.",
                                      "author": null,
                                      "created": 1574141857,
                                      "upvotes": 3,
                                      "replies": {
                                        "f811f9m": {
                                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f811f9m/",
                                          "text": "Essentially zero uk football (soccer) players went to university, and few have a post 16 education.  You can debate the wisdom of this (players who don’t make it are fucked, and the lack of intellectual ability is painfully obvious if they become managers or coaches) but clearly there are alternatives to college sport while maintaining a sporting ladder.  With the exception of rowing at oxbridge (and even that is a niche edge case) uk universities regard sport as a minor social activity run by the union.",
                                          "author": "tokynambu",
                                          "created": 1574145727,
                                          "upvotes": 2,
                                          "replies": {}
                                        },
                                        "f80zt9h": {
                                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80zt9h/",
                                          "text": "No worries. I got the impression that you were arguing for the current system as the best thing going. The whole thing could be completely divorced from higher education couldn't it? University team budgets are separate from academic budgets anyway so we know that the teams could be self sufficient. Athletes could then be paid in money instead of education that they may or may not benefit from.",
                                          "author": "Uruz2012gotdeleted",
                                          "created": 1574143868,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "f80prz3": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80prz3/",
                  "text": ">Colleges / universities are institutions of higher learning, but that's not the only thing they are.\n\nHence why I said, *should* not \"are they\"\n\n>They also serve as incubators for the country's athletes that provide a decent bridge between amateur and pro levels.\n\nSo could a development league, like ya know, every other country does? \n\n>You could try to argue that academics and sports should be separated into different schools then, but both benefit highly from being tied to each other. \n\nMore money is spent on sports than the other way around at most schools in PAC, Big 10, Big 12, and SEC. How does academics benefit? \n\n>Sports consistently bring in a lot of money for schools through alumni donations\n\nCiiiiitation needed. Esp if you want to claim it's a net profit\n\n> and athletes receive degrees from these schools which can help act as a safety net if athletics don't pay off.\n\nWhy do athletes deserve that safety-net over any other person that isn't necessarily academically qualified to get into the school? \n\nSchools should separate admissions from athletics. If you are an athlete and want to put the sport down to show commitment/hard-work, go ahead. And the admissions department should take it into account only so far as the commitment and hard-work, the coaches shouldn't have a say in admissions and there should be no reserved spots.",
                  "author": "Zeus1325",
                  "created": 1574135008,
                  "upvotes": -5,
                  "replies": {
                    "f80rfrz": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80rfrz/",
                      "text": "Are you saying that schools spend money on athletics just for the hell of it and don't care about making a return? That makes 0 sense, and quick Google searches show the obvious that schools benefit financially from their athletics programs. [Here's one example of that.](https://www.athleticscholarships.net/profitable-college-football-programs.htm) This isn't even considering the money coming in from alumni donations who often feel that college sports helps them stay connected to their alma mater.\n\nIf colleges are going to profit off of their athletes, the least they could do is allow these athletes to graduate with a degree. If anything, these athletes should be paid on top of getting a degree given how much money they bring in for their universities, and we're starting to see a slow shift in this direction with California's Fair Pay to Play Act.\n\nEDIT: [To be fair, here's a counter article against my own argument.](https://college.lovetoknow.com/campus-life/does-college-football-make-money) In these cases where athletics are not a major part of the college program, it's true that colleges can spend more on these programs than what the programs bring in. The given reason for this is that these programs are meant to enrich the college experience for their students, and I'd venture a guess that in these cases the universities are likely not giving out athletic scholarships or recruiting for these kinds of sports.",
                      "author": null,
                      "created": 1574136251,
                      "upvotes": 5,
                      "replies": {
                        "f80s829": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80s829/",
                          "text": ">Are you saying that schools spend money on athletics just for the hell of it and don't care about making a return?\n\nI don't think they are caring about making a financial return, especially considering the time value of money \n\n>That makes 0 sense, and quick Google searches show the obvious that schools benefit financially from their athletics programs. Here's one example of that.\n\nI don't know what that source is, but it aint it chief. Texas, by far the most profitable school, sends all of $10 million back. (https://www.usatoday.com/story/sports/2019/01/15/texas-athletics-program-had-over-219-million-revenue-2018/2586818002/). [Tennessee](https://www.timesfreepress.com/news/breakingnews/story/2018/jan/29/revenue-and-expenses-reach-new-highs/462390/), one of the most profitable by %, brought in all of $10 million. In total, FBS schools lost a median of $16,000,000 **per school**. [Source](http://www.ncaa.org/sites/default/files/2019RES_D1-RevExp_Report_Final_20191107.pdf) is the NCAAs required financial reporting. Over 75% of schools LOST money. \n\n>This isn't even considering the money coming in from alumni donations who often feel that college sports helps them stay connected to their alma mater.\n\ncitation needed on how much \n\n>If colleges are going to profit off of their athletes, the least they could do is allow these athletes to graduate with a degree\n\nThey shouldn't be profiting off of their athletes. They should have athletes.\n\n> If anything, these athletes should be paid on top of getting a degree given how much money they bring in for their universities\n\nYou had me in the first half, lost me in the second. The athletes should be getting paid, but by the NCAA, not the schools. They aren't bringing in anything for their schools, other than the 16 million dollar deficit. NCAA is getting $$ and should be paying em'.\n\nedit: I be responding to your edit rn\n\nedit 2: \n\n>  In these cases where athletics are not a major part of the college program, it's true that colleges can spend more on these programs than what the programs bring in. \n\n75% of FBS (the big ones) schools are losing millions of dollars a year. It's a select few that turn a profit. (And I would doubt the majority of those turn an economic profit)",
                          "author": "Zeus1325",
                          "created": 1574136868,
                          "upvotes": -3,
                          "replies": {
                            "f80tnvy": {
                              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80tnvy/",
                              "text": "I don't understand your point about colleges not caring to make a financial return and what the time value of money has anything to do with that. Maybe you can elaborate?\n\nWith Texas and Tennessee, beyond the direct millions in profits the athletic programs are already returning to the schools, there's the indirect benefits of increased alumni engagement and resulting donations - I don't know how much this would be to be fair, and to be frank I don't care enough about this to look into it much further. If anyone else is curious on the actual numbers and ends up looking it up, perhaps report back to us.\n\nAs for the other schools that are losing money on their athletics programs, I wonder how many of those are actively recruiting for sports + reserving seats for athletes. I'd venture a guess that most of them are not, and if there are some that are I'd guess it would likely be because the benefit from those indirect revenue streams offsets the direct costs. That's just a guess.",
                              "author": null,
                              "created": 1574138018,
                              "upvotes": 5,
                              "replies": {
                                "f80vvhx": {
                                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80vvhx/",
                                  "text": ">I don't understand your point about colleges not caring to make a financial return and what the time value of money has anything to do with that. Maybe you can elaborate?\n\nThere's very few schools that make a accounting profit on their athletics. Even fewer will make an accounting profit. I.e., if you invest $100 million on your football program to get a $101 million payment a year later, you made an accounting profit of $1 million. However, because you could have just thrown that into your endowment and gotten $7 million instead, you really lost about $6 million on the football program. So the schools with little positive returns aren't making money, they are losing it. \n\n>With Texas and Tennessee, beyond the direct millions in profits the athletic programs are already returning to the schools, there's the indirect benefits of increased alumni engagement and resulting donations -I don't know how much this would be to be fair,\n\nI highly doubt anyone but the schools, if that, has that data. \n\n>As for the other schools that are losing money on their athletics programs, I wonder how many of those are actively recruiting for sports + reserving seats for athletes\n\nThat's 75% of D1 FBS schools. Those are the big ones doing the recruiting and saving spots, though many of those are probably big enough where the reserved spots for athletes is a much smaller portion of the student body. At a school like NU, it makes a much bigger difference.",
                                  "author": "Zeus1325",
                                  "created": 1574139900,
                                  "upvotes": 1,
                                  "replies": {
                                    "f80x6sa": {
                                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80x6sa/",
                                      "text": "I'm still not understanding your first point - why wouldn't colleges care about making a financial return?\n\nFurther on this point, I'm still struggling to see how the time value of money has much to do with what you're saying. All that you do for time value of money would be to discount your future cash flows by your opportunity cost (which increases exponentially for each year) and then add those values up to then get the real present value of the investment. In your example, the opportunity cost is 7% (100 million invested elsewhere gets 7 million profit), and the present value of the year 1 cash flow would be 94.4 million. This implies that in year 2 we would need at least 5.6 million dollars in present value to be profitable, so we'd need to solve for X where X/1.07^2 = 5.6. This works out to about $6.4 million needed in year 2 to get a positive return, and if the stadium took in $101 million in year 1 they'd easily surpass that goal.\n\nNone of this has anything to do with the reasons why a college wouldn't care to see a financial return on their athletics programs.",
                                      "author": null,
                                      "created": 1574141140,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "f814v48": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f814v48/",
              "text": "My school spends millions on football yet a student with disabilities (I forgot what it’s called, but she doesn’t have legs) literally had her arm broken on a door that the office of disabilities wouldn’t fix for her to make it accessible. And we are supposedly an inclusive school. The country’s obsession with college sports makes me sick.",
              "author": "youngthotiana",
              "created": 1574150204,
              "upvotes": 7,
              "replies": {
                "f81hcpo": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81hcpo/",
                  "text": "It is certainly problematic if the school is neglecting capital needs, especially if it makes property inaccessible or dangerous.\n\nBut you can’t really argue that the university should be taking athletic dollars in spending them on these things. Those budgets are separate.  Revenues and expenditures for athletics are their own thing.  \n\nPut another way, if the school did not have sports (And you can certainly make a solid argument that this might be a better) it probably wouldn’t have those dollars spent on the football in the first place.  So while having no sports might alter priorities,  and make the school focus more on things you feel it should be focusing on, it is unlikely that it would suddenly have millions and millions of athletics dollars freed up to spend on those things. Without athletics, the school will not have the ticket revenues, media revenues, some of the logo and licensing revenues, and some of the donations.\n\nIt is true, that some schools use student fees to help subsidize athletics. On those campuses, eliminating sports means they could either charge less, or use those dollars for other things.",
                  "author": "FeatofClay",
                  "created": 1574167420,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "f81agks": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81agks/",
          "text": "Go bears, but honestly the athletics department aside from football is losing money and that just doesn’t seem right for the California taxpayer who’s struggling to pay rent while some rich kids use public funds to race sailboats.",
          "author": "pr3st0n192",
          "created": 1574158626,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f80hst3": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80hst3/",
      "text": "[deleted]",
      "author": null,
      "created": 1574129373,
      "upvotes": 28,
      "replies": {
        "f80j275": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80j275/",
          "text": "I feel like people that say athletes are taking spots are probably not referring to people like you. More like the ones that can barely maintain a C average and still get recruited to schools like Cal and UCLA. \nreference: UCLA football player went to my high school and barely maintained a C average.",
          "author": "ilysillybilly7",
          "created": 1574130231,
          "upvotes": 23,
          "replies": {
            "f80jvj6": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80jvj6/",
              "text": "[deleted]",
              "author": null,
              "created": 1574130795,
              "upvotes": 5,
              "replies": {
                "f81xcw2": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81xcw2/",
                  "text": "Username checks out. You deserve it though (going there, not the abuse). Don’t ever let them convince you otherwise",
                  "author": "uglypenguin5",
                  "created": 1574179424,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f80vqg9": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80vqg9/",
      "text": "Man fuck that. I worked admissions for my Ivy League alma mater and never held any bias against athletes until I saw the behind the scenes details. Now other schools this prob won’t apply but the Ivy League has a rule that financial aid is given ONLY based on need . So this means athletes that get in can (and many do) quit and still not be at risk of losing any of their financial support to get their degree.  I saw many horrendous gpa’s and crap test scores by rich Connecticut private school kids who were good soccer or field hockey players . I knew many and most (I’d say about 80%) would quit in the first year or two. \n\nFor the Ivy League it’s like the back door entrance to a good degree . Once you get in you don’t have to play any sports or keep up any type of GPA to continue getting financial aid . \n\nSo fuck that . I think they should rescind all offers and aid to athletes who commit to our school only to drop out within the year . They were admitted for being an athlete and short of a career ending injury I think they should be obligated to stay on the team . \n\nBc as it stands, the next year the coach has to recruit even more people and YES they take deserving students’ spots.",
      "author": "BNmakesmeacatlady",
      "created": 1574139771,
      "upvotes": 25,
      "replies": {
        "f81o22k": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81o22k/",
          "text": "If these students got need-based aid, then they are still entitled to it even if they change their participation or interest in sports.  And I'd be surprised if the Ivy you're referencing has no expectations of \"satisfactory progress\" (including a passing GPA) to retain aid.",
          "author": "FeatofClay",
          "created": 1574173181,
          "upvotes": 5,
          "replies": {}
        },
        "f80xl43": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80xl43/",
          "text": "That's actually fucked up for people to take advantage of the system at ivies like that. I don't think this applies to all schools and athletes tho, as many of the student athletes ik who went to really good universities had to still have good gpas and sats to get into schools like Cal and UCLA",
          "author": null,
          "created": 1574141533,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f80cotj": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80cotj/",
      "text": "Have international students taken *your* spot? Have out-of-state students taken *your* spot? Have disadvantaged kids with learning disabilities taken *your* spot? Have undocumented kids taken *your* spot? Nope. Neither have the athletes. From what I understand, the word \"taken\" only applies if something is actually in your possession, which never was. Hence, why you're applying. It's the college that has the power to grant a spot.",
      "author": "Marshmlol",
      "created": 1574125866,
      "upvotes": 103,
      "replies": {
        "f80em9v": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80em9v/",
          "text": "School is first and foremost a place for schooling, not sports. That’s where the resentment comes from",
          "author": "iRun-a-lot",
          "created": 1574127211,
          "upvotes": 54,
          "replies": {
            "f80ja0t": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ja0t/",
              "text": "Unfortunately, what a college is or isn’t for is not a question you, or any of us, get to decide. Colleges tell us what they value, and they clearly value sports just as much as academics.",
              "author": "stickerforprez",
              "created": 1574130382,
              "upvotes": 30,
              "replies": {
                "f80ml84": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ml84/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1574132679,
                  "upvotes": 8,
                  "replies": {
                    "f80njvo": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80njvo/",
                      "text": "The spots set aside for athletes were never going to be your spots at any point in time, so nothing is being “taken” from you. And honestly i don’t think theres any reason to complain, colleges are currently holding up pretty much every sport in the country, giving the majors and/or pros pretty much all their players. Not to mention sports are a big money generator for schools, the school pride sports generate leads to donations which spills over to the academic side of things.",
                      "author": "BylvieBalvez",
                      "created": 1574133369,
                      "upvotes": 25,
                      "replies": {}
                    },
                    "f80o1ub": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80o1ub/",
                      "text": "But we do have a say in it. Our say is our application; if we are applying to a school, we implicitly accept the standards the school has when evaluating admissions. Athletics are one of those standards. \n\nWhen we apply to colleges with sports teams, we accept that, yes, some less academically strong applicants will be accepted. If you, or anyone, has a problem with that, then the solution is simple: just don’t apply. But if you do apply to a school with athletic programs, you can’t simultaneously complain about athletic recruits getting in over other qualified applicants. The school gave you the terms and you accepted them by applying there.",
                      "author": "stickerforprez",
                      "created": 1574133735,
                      "upvotes": 9,
                      "replies": {
                        "f80qh3x": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80qh3x/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1574135526,
                          "upvotes": 4,
                          "replies": {
                            "f80vl0y": {
                              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80vl0y/",
                              "text": "You got it. The rules are wrong. *And that doesn’t matter.* Colleges get to set the rules, and we get to play by those rules. By applying to the colleges that set these rules, we perpetuate the same exact system. \n\nI really don’t think you understand my point. Colleges tell us the standards by which they admit people. They show us that they will accept kids with low grades if they are legacy/URM/athlete/etc. We know all these things when we apply to schools. We have all the admissions information beforehand. And we still apply to highly selective schools, even with the knowledge that less qualified students will get in and we may not. By applying to these schools, we accept that reality. We accept the rules colleges have set for us. To then turn around and be outraged that athletes/URM/legacies have an advantage is wildly disingenuous. *You knew that fact when you applied, and yet you still applied.* No one forced you to apply to schools that admit students “unfairly,” but you did. Clearly, your desire to attend the school overcame your outrage over their admission practices. \n\nAlso, let’s clarify some things. Did I say that applying to a school means that you agree with everything they do? No. I said that applying to a school means you accept the terms on which admission is decided upon. Not that you agree with a school’s stance on anything else—only admissions. \n\nWhile it was kind of you to dig through my history, I’m afraid you’re mischaracterizing my comments on the cost of college. I specifically say that I accept the tuition price of college, as I see a return on that investment that I think is fair. For textbooks, I do not see that return on investment; thus, I will use old textbooks/share/borrow/etc. when possible.",
                              "author": "stickerforprez",
                              "created": 1574139634,
                              "upvotes": 3,
                              "replies": {
                                "f80w78v": {
                                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80w78v/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1574140200,
                                  "upvotes": -2,
                                  "replies": {
                                    "f80yfef": {
                                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80yfef/",
                                      "text": "We participate by coercion? Last I checked, no one was forcing us to attend an elite college, or any college at all. We choose if and where to attend college, and acting like we are coerced into the college admissions process is an insult to anyone who does not have the opportunity to participate.\n\n\nWhether the practices are right or not is irrelevant. The practices are the way they are because colleges choose them that way. If people truly felt that the practices were unfair or wrong, then they wouldn’t apply to the school. Since people do apply to the school, the college has no incentive to change its behavior. By applying to schools with admission systems that are unfair, you signal your tacit acceptance of those systems and perpetuate the system itself. That is how the argument is disingenuous. The outrage doesn’t extend far enough to actually affect behavior. If it did, maybe the system would change.\n\nHonestly, choosing to attend a school does, implicitly, signal acceptance of the entire school. Even if you object to parts of the school, those objections weren’t powerful enough to effect your decision-making. Attending a school signals that, on the whole, you accept the bad parts of the school. You can work to change them, of course, but you do accept them as not bad enough to prevent you from attending. In other words, you can bear any objections you have.\n\nEven if I did say something bad about a college, what would that prove? If I truly found the college objectionable, I just wouldn’t apply there. If I would still apply there, I would be admitting that the objectionable parts of the college are not objectionable enough to affect my actions; therefore, I can’t really complain about them.\n\nAs for tuition, my take is simple: if you are attending the college, you can’t really complain about tuition. Can you make it known that you would prefer tuition to be cheaper? Absolutely. In fact, interest articulation around issues like that is extremely important. But complaining about the “unfairness” of high tuition is not just interest articulation. It’s complaining about something you don’t like because it hurts you in some way in an attempt to make yourself feel better about it.\nThat’s the entire crux of my argument: there’s a difference between complaining and expressing a preference. It’s fine to express preferences from within the system. It’s not fine to complain about the unfairness of the system when you are tacitly endorsing that system by being included in it. Of course, tuition is an entirely different beast than the admissions process—you have many more options to express your preferences to the college over tuition, but with the admissions process you only have one option: your choice over whether to apply to the school or not. In that way, it’s not really a great parallel, but there are still similarities between the two.",
                                      "author": "stickerforprez",
                                      "created": 1574142391,
                                      "upvotes": 4,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "f81o40j": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81o40j/",
                      "text": "Think of it like a shop. The store decides what they want to sell, not us. The only thing we can do is just not buy their stuff. If enough people do the same, they'll change. If not, they won't (and they shouldn't).",
                      "author": "JustAwesome360",
                      "created": 1574173220,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f80v5cp": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80v5cp/",
              "text": "I truly don't understand this idea, can't you focus on more than one thing? Can't you learn different things in a sport as well, so isn't that considered schooling as well? If a college just did schooling, I don't think anyone would want to go there because it would be so boring because there wouldn't be any clubs or organizations and it would practically be a prison for students outside of class hours.\n\nI think a place can have more than one thing and still succeed, as we can see from Amazon, where they went from just selling books to spreading out into more things which allows for them to succeed. The same can be said about Walmart, Hyvee, or any other store or business.\n\nColleges these days aren't just operating as a school, they are operating as a business to grab and get more students to come to their college. So they can't just do that on academics alone, so they have clubs, organizations, different perks being there, scholarships, sports, and more to get the most and the best students. There is definitely a bigger underlying problem at hand than most people realize with American Education.",
              "author": "majesticjhibb",
              "created": 1574139239,
              "upvotes": 3,
              "replies": {
                "f81kera": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81kera/",
                  "text": "Never did I say that schooling is the only thing colleges do or should care about. Funny coincidence, the ceos/founders of the giant companies you named are notorious for hoarding their wealth and engaging in minimal philanthropy (Carnegie isn’t just rolling in his grave at this point, he’s screaming and throwing a giant fit). Funny coincidence. Unrelated maybe. Who knows. Again, nowhere did I say schooling is the only thing they should do. I said first and foremost school are a place for schooling. They shouldn’t make sacrifices for athletics, etc.",
                  "author": "iRun-a-lot",
                  "created": 1574170232,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "f81keaa": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81keaa/",
              "text": "Honestly..... no. I would argue that my university saw itself as a place for research and knowledge. Teaching undergrads is a part of that, but so are the masters students, the PhDs, the visiting academics and the tenured faculty. There's a reason they pour so much money into funding labs and grants, etc. The undergraduate admissions process skews your perception of it, but in reality, it's about the university's position as a community of knowledge. Sports help build your reputation simply by getting your name out there, and it brings in money. That helps bolster the community overall. If letting in some basketball players translates into notoriety and piles of money, why wouldn't they?",
              "author": "poondi",
              "created": 1574170220,
              "upvotes": 2,
              "replies": {
                "f81kjci": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81kjci/",
                  "text": "Because I believe in having integrity. The first part I agree with. I think a better term in place of schooling would be “seeking knowledge/truth.”",
                  "author": "iRun-a-lot",
                  "created": 1574170342,
                  "upvotes": 1,
                  "replies": {
                    "f81kldm": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81kldm/",
                      "text": "What do you mean by integrity?",
                      "author": "poondi",
                      "created": 1574170391,
                      "upvotes": 1,
                      "replies": {
                        "f81kn2w": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81kn2w/",
                          "text": "Staying true to the core values of the school instead of sacrificing them to bolster an image or reputation.",
                          "author": "iRun-a-lot",
                          "created": 1574170432,
                          "upvotes": 0,
                          "replies": {
                            "f81l0nh": {
                              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81l0nh/",
                              "text": "Ah, sadly, that's true of any university for reasons much worse than athletics. My university had terrible teams that functioned more as a way to recruit smart kids who didn't want to give up their athletic interests completely. But on the subject of image and reputation -- tuition does not cover very much of university costs. They depend on corporate sponsors, alumni gifts, government aid, etc. They do prioritize research that can help them with those goals. All of those things force universities to deviate from their core values much more than something like athletics. I say all of this from personal experience, and I went to a school that truly values the knowledge it produces. I can't even imagine what it's like overall.",
                              "author": "poondi",
                              "created": 1574170755,
                              "upvotes": 1,
                              "replies": {
                                "f81l4y4": {
                                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81l4y4/",
                                  "text": "Yeah. Ik. It sucks. I guess I’m still living in this idealistic world that’s just not viable in practice. I guess it’s better than being cynical about everything. That’ll probably come in a few years",
                                  "author": "iRun-a-lot",
                                  "created": 1574170859,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "f81kiyb": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81kiyb/",
                  "text": "Because I believe in having integrity. The first part I agree with. I think a better term in place of schooling would be “seeking knowledge/truth.”",
                  "author": "iRun-a-lot",
                  "created": 1574170333,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "f81pdd7": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81pdd7/",
          "text": "I mostly agree but I would be careful when arguing about undocumented students & kids with learning disabilities. Jealousy for athletes comes from people’s envy. But the argument that undocumented kids are taking your spot comes from a completely different place, racism. \n\nAlthough we can probably agree on one thing. *FUCK* legacy.",
          "author": "GussOfReddit",
          "created": 1574174145,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "f8042bv": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8042bv/",
      "text": "[deleted]",
      "author": null,
      "created": 1574120559,
      "upvotes": 224,
      "replies": {
        "f80alss": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80alss/",
          "text": "They're both pretty hard. Sports take a lot of talent and determination, and academics take a FUCK TON of determination.\n\nSo yeah, your chances of going to D1 for sports are prbably lower due to the innate talent/genetics needed to perform some sports (ie shorter lifters generally lift more than tall powerlifters. Also I said generally not always.)\n\nBut everyone has the capability to get a 1600 on the SAT, it just matters how much time and effort you're willing to put into it, whereas with sports you need a lot more than just effort.",
          "author": "nydanny2014",
          "created": 1574124380,
          "upvotes": 57,
          "replies": {
            "f82ycvc": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82ycvc/",
              "text": ">Sports take a lot of talent and determination, and academics take a FUCK TON of determination.\n\nThats pretty subjective. Some people are super smart and suck at sports and some people are really dumb hut good at sports. Some people require different amouns of  time and energy for different things. Ik people who put in almost 0 work and have above a 4.0 and really good test scores",
              "author": "WindyCityAssasin2",
              "created": 1574200595,
              "upvotes": 2,
              "replies": {}
            },
            "f80m77l": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80m77l/",
              "text": "Woahhh not everyone has the capability to get a 1600. Being smart is a special talent that not everyone is born with. Athletics rely more on natural talent while being less forgiving. Academically I'll always be smart but athletes can have their career ruined by an injury.",
              "author": "teamikv121812",
              "created": 1574132403,
              "upvotes": -1,
              "replies": {
                "f80n55g": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80n55g/",
                  "text": "Nah he’s right, everyone is capable of getting a 1600. You don’t need to be smart per say, just good at that specific test. If you tutor long enough in the patterns of the SAT and what kinda questions and all that you could get a 1600. Would it be easy, definitely not, I didn’t get a 1600 but I imagine that would be easier than me trying to become a D1 caliber athlete from nothing. Not to mention your brain can be ruined from an injury same as a QBs arm.",
                  "author": "BylvieBalvez",
                  "created": 1574133078,
                  "upvotes": 27,
                  "replies": {}
                },
                "f80n6mo": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80n6mo/",
                  "text": "And we can have our careers ruined by a single AP or test. Actually, we can have our admissions ruined by a single application, since we are wholly dependent upon our transcript.",
                  "author": "nydanny2014",
                  "created": 1574133107,
                  "upvotes": -5,
                  "replies": {
                    "f80nd6d": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80nd6d/",
                      "text": "You can take SAT and ACT multiple times. AP tests have a solid margin of error if you take the class seriously. They can overlook certain things. Obviously both can be changed by a lot of things but athletics (only certain sports I guess) can be changed very quickly. One bad coach or game can make a huge difference.",
                      "author": "teamikv121812",
                      "created": 1574133237,
                      "upvotes": 7,
                      "replies": {
                        "f80nlmd": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80nlmd/",
                          "text": "Just like one bad SAT can change the whole game. Do you think colleges ask for your entire history just for fun?",
                          "author": "nydanny2014",
                          "created": 1574133404,
                          "upvotes": -6,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f80hz5o": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80hz5o/",
          "text": "Fellow swimmer here! I've been swimming all my life, but when it came time to look at colleges, I chose to only look at the schools that catered to my academic interests. Although I could've gotten a scholarship at a big DI school, I instead looked at several smaller DIII schools with better academic reputations. \n\nI just submitted my ED app a few days ago, and I know for a fact that I have much less stress than my peers going through the college process. By having the swimming aspect of my application, I was able to look at schools that if I didn't have swimming, I might not be able to get in to. People are probably jealous, but let them be. I get up before anyone else to train, and I get home later than most people after practice. Over the summer, I've had to get up as early as 4:45 to make it to the first of two practices for that day, while working at a lab all summer. I know the amount of time that I've put into swimming, and I don't care what people might say. If they wanted to have the same opportunities, then they should've put in the same amount of work.",
          "author": "NicDT",
          "created": 1574129491,
          "upvotes": 16,
          "replies": {
            "f80ifn6": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ifn6/",
              "text": "[deleted]",
              "author": null,
              "created": 1574129798,
              "upvotes": 3,
              "replies": {
                "f80jd5l": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80jd5l/",
                  "text": "Same. I know a few people that are at the same competitive level as me that are literally only looking at ivies, but I wasn't really interested in them (personal preference), but the downside is the absence of likely letters in DIII recruiting. \n\nI ended up ED'ing somewhere because I loved the school and the coach had a pretty decent say in admissions so I'm not stressing a s much. I know the situation you're in though (especially with MIT and caltech) and its honestly even more stressful. I wish you the best of luck!",
                  "author": "NicDT",
                  "created": 1574130442,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f80eqtf": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80eqtf/",
          "text": "I don't think you can necessarily generalize it like that. While I agree with the sentiment of giving credit to athletes, it is way more than just \"being good at academics is harder\" or \"athletics is way harder.\" Current person I know, insanely good at tennis, getting offers to some schools (Men's D1), but they have put a couple more hours into school than tennis because for them they are just that talented at tennis and had struggled more with academics to where they needed to grind a couple of classes for graduation requirements. I just don't think it's as black and white as you painted it to be.",
          "author": "NiceAesthetics",
          "created": 1574127293,
          "upvotes": 9,
          "replies": {}
        },
        "f804mgt": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f804mgt/",
          "text": "> Getting a 36 ACT, 4.0 GPA etc. was much easier to do than the effort I've put into my sport. I imagine it's the same with many of the athletes recruited to those schools.\n\nYeah no. You have a point being a top tier athlete is not easy, but it's not like getting a  36 and 4.0 is just something everyone can do.",
          "author": "PointAxross",
          "created": 1574120804,
          "upvotes": 54,
          "replies": {
            "f806qqu": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f806qqu/",
              "text": "[deleted]",
              "author": null,
              "created": 1574121793,
              "upvotes": 25,
              "replies": {
                "f81hv9i": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81hv9i/",
                  "text": "One thing to take into account is that having enough athletic skill to be signed to a college is a lot closer to “the full package” than  a 36 ACT. Someone can have a 36 ACT with a 3GPA and it won’t mean shit to ivies, but that’s not the case for athletes.",
                  "author": "iiMurk_",
                  "created": 1574167917,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "f80bjah": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bjah/",
              "text": "Neither being a top tier athlete or getting a 36 on the ACT is something everyone can do.\n\nI don't particularly care for recruits, but I got a 35 twice with maybe 30 minutes of studying, but I could've put in hundreds of hours a year since I was 10 and probably could never have been good enough to be recruited.\nSome people have always been good at sports and do get recruited, but would just never be capable of getting a 36 or 1590.\n\nYou can get a 36 without too much effort if you're smart enough, nobody can get recruited without huge talent and lots of effort.",
              "author": "prefrontalobotomy",
              "created": 1574125040,
              "upvotes": 20,
              "replies": {
                "f819a1m": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f819a1m/",
                  "text": "If you're smart enough you can get a 36. If you're athletic enough you can play D1. Most people who achieve either are coming from families who did a lot to nurture those abilities. \n\nNot everyone is smart enough or athletic enough though.",
                  "author": null,
                  "created": 1574156795,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "f80573c": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80573c/",
              "text": "I’ll take it from the guy who does both tho cuz he probably would know pretty well what is easier.",
              "author": "rp708",
              "created": 1574121061,
              "upvotes": 37,
              "replies": {
                "f806lzh": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f806lzh/",
                  "text": "1. One persons experience isn't reflective as a whole\n\n2. As someone who was recruited by D3s for basketball I don't possibly see how getting a 36 ACT is easier. That's something I could never do no matter how hard I tried. Which goes back to my first point",
                  "author": "Darthmemer2",
                  "created": 1574121714,
                  "upvotes": 42,
                  "replies": {}
                }
              }
            },
            "f808bmq": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f808bmq/",
              "text": "You’re genuinely insane if you think being a top tier athlete is easier than getting a 36 on the ACT lmao. Most people would fucking die in 5 seconds if they were put on a D1 Football field or Basketball court. Hell, getting a high ACT score was easier for me than making my fucking *High School* basketball team, and I live in the middle of fucking nowhere.",
              "author": "RanThroughLust",
              "created": 1574122794,
              "upvotes": 33,
              "replies": {
                "f80av4w": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80av4w/",
                  "text": "Easiest way to see this is xc+ track. To make varsity for the 1600m at my school you need to break 4: 50 on the mile. Most people can't even run an 8 min mile. To be recruited by a top tier college your time would need to be at least under 4 25 to be even considered.",
                  "author": "BoostedBanana12",
                  "created": 1574124563,
                  "upvotes": 21,
                  "replies": {}
                },
                "f80azsk": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80azsk/",
                  "text": "I'm getting recruited to D3 schools and I'd love a 36 on the ACT...",
                  "author": null,
                  "created": 1574124654,
                  "upvotes": 1,
                  "replies": {
                    "f80bxiz": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bxiz/",
                      "text": "I got a 34 on the ACT and would love to get a fucking starting spot on my High School Varsity Team...\n\n&#x200B;\n\nAlso, when I say Top-Tier, i'm referring to D1 athletics (mostly). I think most people would find it harder to make a college football/basketball/track/etc...team than to score a high mark on the ACT/SAT. You can improve your test scores by great amounts in months through rigorous studying. Meanwhile, a couple months of rigorous training and improvement for a sport is ***not*** enough to get you recruited for a college sports team, especially a high level one. Most of these people have been playing competitively and dedicating massive amounts of time into their sports since they were kids.",
                      "author": "RanThroughLust",
                      "created": 1574125326,
                      "upvotes": 3,
                      "replies": {
                        "f833y5d": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f833y5d/",
                          "text": "I have a 34 on the ACT lmao. Academics should be the main focus of academic institutions.",
                          "author": null,
                          "created": 1574203850,
                          "upvotes": 0,
                          "replies": {
                            "f835iju": {
                              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f835iju/",
                              "text": ">Academics should be the main focus of academic institutions.\n\nThey are tho??? Lmao even at schools with massive sports teams, academics is their main purpose. Schools do, however, make tons of money off of sports, most notably Football and Basketball. So it’s not ridiculous for them to concentrate a lot of their money into that. I’m sorry, but people like watching college sports. If you have big college sports teams, you make more money, get more name recognition, and more people wanna go to your school. Studies have shown this.",
                              "author": "RanThroughLust",
                              "created": 1574204790,
                              "upvotes": 1,
                              "replies": {
                                "f8390vu": {
                                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8390vu/",
                                  "text": "Yep, money is the reason for all these boosts.\n\nAthletes bring in revenue, legacies bring endowment money, and URMs raise the schools rankings, which creates selectivity. \n\nI think that money being the sole factor for acceptance into top institutions is morally wrong, but I understand why it is.",
                                  "author": null,
                                  "created": 1574206980,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "f80ey9h": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ey9h/",
              "text": "Everyone can’t be an athlete either. Both accomplishments require good genetics (either IQ or physical traits).",
              "author": null,
              "created": 1574127431,
              "upvotes": 0,
              "replies": {
                "f838mpv": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f838mpv/",
                  "text": "Yes I fully agree with that, it seemed like he was really underselling the difficulty of high grades and ACT",
                  "author": "PointAxross",
                  "created": 1574206740,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f80bk0k": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bk0k/",
          "text": "Getting a 36 and a 4.0 aren’t easy feats. Even if you achieve them, you will still not be given admission to those ivies or top 10. You need to do much more than this. For example, participating and reaching the international level in a science research contest, summer research with professors, olympiads, personal projects aside from competition ones. So reevaluate whether being a top tier athlete is harder than doing the things above. Also, unless your goal is to go pro in sports, what’s the point of going to college to play a sport if you want to study something like Computer Science or Economics? I assume you won’t have time to practice and do good in college.",
          "author": null,
          "created": 1574125055,
          "upvotes": 9,
          "replies": {}
        },
        "f80gp1z": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80gp1z/",
          "text": "[deleted]",
          "author": null,
          "created": 1574128621,
          "upvotes": 1,
          "replies": {
            "f80iwvf": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80iwvf/",
              "text": "They do, but the coaches have very little power in admissions. Honestly, caltech coaches most likely have the least say in admissions out of any DIII school at the same academic level.",
              "author": "NicDT",
              "created": 1574130127,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "f80ksto": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ksto/",
          "text": "Username checks out",
          "author": "ROBRO-exe",
          "created": 1574131428,
          "upvotes": 1,
          "replies": {}
        },
        "f80o1eq": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80o1eq/",
          "text": "You got Texas over Cal this year at NCAAs? (I'd like to see it too). Anyway, I'm curious what kind of ballpark times you have to be recruited by those schools. I'm a junior this year, so they probably wouldn't be doing that yet, but I'm wondering if I'm good enough or what I need to do.",
          "author": "Meaca",
          "created": 1574133726,
          "upvotes": 1,
          "replies": {
            "f80u3tv": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80u3tv/",
              "text": "[deleted]",
              "author": null,
              "created": 1574138361,
              "upvotes": 1,
              "replies": {
                "f80u8ad": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80u8ad/",
                  "text": "Yeah I'm there all the time. I compare athletically with lots of people going to schools I'd like to, but it's hard to tell whether they got in for their academics or if swimming helped them out.",
                  "author": "Meaca",
                  "created": 1574138453,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "f80ud5o": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ud5o/",
          "text": "yea waking up in the morning at 4:45 to swim then going to school then coming back from school going to swim to do another 8k yards is hella hard all while keeping good grades and a decent social life is nearly impossible. OLY swim represent",
          "author": "R3FR1DG3R4T0R",
          "created": 1574138560,
          "upvotes": 1,
          "replies": {}
        },
        "f80a7gm": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80a7gm/",
          "text": "Same scenario here, getting recruited by low D1 rowing schools and I have 36 and like 3.92 because of Freshman year, and I can say for certain that rowing has been so much harder than any studying or classes I have ever done.",
          "author": "SternSupremacist",
          "created": 1574124096,
          "upvotes": -2,
          "replies": {}
        },
        "f805ihk": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f805ihk/",
          "text": "If it’s easier to get a 36 or 4.0 why are so many of my athlete friends struggling to get a 26 to meet their recruit requirements lol",
          "author": "fmemate",
          "created": 1574121201,
          "upvotes": -7,
          "replies": {
            "f80bljk": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bljk/",
              "text": "If these athlete kids put all their effort they have put into their sport into getting a 36 on the ACT they could easily do it with time to spare. The difference is that the passion and motivation they have for a sport doesn't just transfer to answering some questions",
              "author": "c9lulman",
              "created": 1574125085,
              "upvotes": 6,
              "replies": {}
            },
            "f806tky": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f806tky/",
              "text": "I actuallly agree with the original post, but some comments he made are very hot takes",
              "author": "Darthmemer2",
              "created": 1574121844,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "f80qaft": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80qaft/",
          "text": "yeah fucking right fish boy, no way it’s harder than 36 on ACT",
          "author": "Sir_Squiggly",
          "created": 1574135388,
          "upvotes": -3,
          "replies": {
            "f80ut73": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ut73/",
              "text": "Getting a 36 requires a few months of practice (based on intelligence), being able to compete even at a d3 level takes years and years of practice. Anybody that hasnt tried doing both and wants to make comments similar to yours is just arrogant",
              "author": "bigguy318",
              "created": 1574138943,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f809gb0": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f809gb0/",
      "text": "Yeah... the last athlete I sent to a school on a D1 scholarship (not counting the 5 this year) was dumb as a bag of rocks and didn’t work at her sport of choice and she was naturally gifted at both sports she was a 4 year varsity athlete in.\n\nShe was a rarity though. My 5 this year all are hard working students and dedicate hours on the field/in the pool.",
      "author": "BlaqOptic",
      "created": 1574123557,
      "upvotes": 31,
      "replies": {}
    },
    "f80xhge": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80xhge/",
      "text": "The issue I have is that schools put way too much of a focus on sports and let academics fall to the wayside pretty often. My first high school spent several thousand dollars on a fancy drone to keep geese from shitting all over the football field while we had to share textbooks and sit on the radiators in my history class because there weren't enough desks and books for all of us.",
      "author": "breeriv",
      "created": 1574141433,
      "upvotes": 11,
      "replies": {}
    },
    "f809q42": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f809q42/",
      "text": "This. the one girl I know who got recruited by UPenn volleyball early in her junior year, has a 3.9 uw, 35 ACT, active participant in classes, always takes up the leader spot in group discussions, and is easily one of the most beautiful/attractive person Ive met. People who work hard in one area usually tend to work hard in other areas too.",
      "author": "INEEDTOSTUDYYY",
      "created": 1574123753,
      "upvotes": 120,
      "replies": {
        "f80ddie": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ddie/",
          "text": "[deleted]",
          "author": null,
          "created": 1574126346,
          "upvotes": 184,
          "replies": {
            "f80du23": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80du23/",
              "text": "some ppl just have it all. i have nothing lol (other than an unhealthy amount of reddit karma and far too many hours on csgo)",
              "author": "qctum",
              "created": 1574126671,
              "upvotes": 76,
              "replies": {}
            },
            "f80dncg": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80dncg/",
              "text": "Nothing but also ¯\\_(ツ)_/¯",
              "author": "nerdlolxd",
              "created": 1574126542,
              "upvotes": 16,
              "replies": {}
            },
            "f80knuw": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80knuw/",
              "text": "Being physically attractive IS another achievement, you know",
              "author": "INEEDTOSTUDYYY",
              "created": 1574131331,
              "upvotes": -4,
              "replies": {}
            },
            "f80hbat": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80hbat/",
              "text": "well, people actually need to make an effort into appearing attractive in EVERY SINGLE OCCASION, you know - like for girls it'd be doing makeup, dress nicely, etc. And she is one of those people who never appeared anything less than that, which is VERY impressive to me as a fellow girl. its so attempting to just pull up in a hoodie and sweatpants ngl",
              "author": "INEEDTOSTUDYYY",
              "created": 1574129039,
              "upvotes": -14,
              "replies": {
                "f80j1xo": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80j1xo/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1574130226,
                  "upvotes": 15,
                  "replies": {
                    "f80ke7t": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ke7t/",
                      "text": "Thank you for the clarification - I thought of it more like being physically attractive is yet another accomplishment that the girl has worked hard on & achieved. (You'd be lying if you say that attractiveness is not an accomplishment - you need to work out, maintain a healthy diet, etc.) And yes, if she was a guy I'd mention that too. (he is incredibly handsome/physically attractive - to which, I imagine, wouldnt stir up such conversation) I guarantee you I had no misogynistic intentions as I posted this.",
                      "author": "INEEDTOSTUDYYY",
                      "created": 1574131148,
                      "upvotes": 4,
                      "replies": {
                        "f80l9gl": {
                          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80l9gl/",
                          "text": "I understand the downvotes, but I also think you’re right. I’m in college now, but I know when things get really rough (lots of projects, deadlines, etc.), it shows in how I dress/look. Normally I put in some time to make sure I look nice and put together, but it takes time. Like you said being physically attractive is more than just being born pretty. It’s definitely something that can be appreciated as a skill and as work.",
                          "author": "Meeesh-",
                          "created": 1574131748,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "f80i4ef": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80i4ef/",
                  "text": "yikes.",
                  "author": "angieluvsokazaki",
                  "created": 1574129587,
                  "upvotes": 2,
                  "replies": {}
                },
                "f80saqs": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80saqs/",
                  "text": "Why are you getting downvoted? You're right. It's just another testament to her dedication/skill that she's able to hold up *every single day* under scrutinizing and ruthless male gaze. You're 100% right when you say it's an accomplishment.\n\nEDIT: Thought the original commenter was someone different and was just mentioning it as a weird thing - been a bad night for my brain :(",
                  "author": "BOT_Retro",
                  "created": 1574136928,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "f80edmi": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80edmi/",
          "text": "Yeah that’s one case. I also know a 1300 3.6 UW who went to Princeton for lacrosse",
          "author": "iRun-a-lot",
          "created": 1574127046,
          "upvotes": 14,
          "replies": {
            "f80fxgh": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80fxgh/",
              "text": "Yep. That happens too. The point is that not all recruited athletes are like that, even if some are. It’s not like those athletes are the ones that aren’t competitive academically, either.",
              "author": "stickerforprez",
              "created": 1574128098,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "f838pdn": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f838pdn/",
          "text": "im at brown, my friends who are recruited athletes were told they only need a 1200-1300 SAT. \n\nyour UPenn friend might be an outlier recruited athletes don’t need that high of scores and GPA lol",
          "author": "davidcf67",
          "created": 1574206786,
          "upvotes": 5,
          "replies": {}
        },
        "f80bjkj": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bjkj/",
          "text": "One of my closest friends got into the same school via sports and was salutatorian and is very attractive too",
          "author": null,
          "created": 1574125046,
          "upvotes": 17,
          "replies": {
            "f80iev2": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80iev2/",
              "text": "jackpot",
              "author": "GeneriksGiraffe",
              "created": 1574129782,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "f80mldq": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80mldq/",
          "text": "There is a girl at my school who is going to northwestern as a recruited athlete next year and there is no way she would’ve gotten in if she applied regularly.",
          "author": "Just_a_nonbeliever",
          "created": 1574132682,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "f80g6wi": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80g6wi/",
      "text": "Can’t get behind the logic of supporting an athlete who does the bare minimum in high school and gets a “scholarship” to a place of academia when they’re not there for school. you know, the thing a lot of scholars actually work their asses off to get to.",
      "author": "ilysillybilly7",
      "created": 1574128276,
      "upvotes": 16,
      "replies": {}
    },
    "f80qpht": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80qpht/",
      "text": "my high school favors the athletes and the teachers definitely have a secret rule to help them first rather their other students. So yes, it is unfair. Ever since I saw that I realized their 4.0 gpas are bullshit and they basically get free A+’s.",
      "author": "the_artistic_nerd",
      "created": 1574135701,
      "upvotes": 10,
      "replies": {
        "f816t7j": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f816t7j/",
          "text": "This is why teachers shouldn’t be coaches. The amount of bullshit they pull to help their athletes when their non-athletic students are struggling because they don’t have time to help them.",
          "author": "Alger_Onzin",
          "created": 1574153034,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "f80n1pp": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80n1pp/",
      "text": "I have a friend that got into uchicago (DIII) because he is an alright baseball player and an alright student, not excellent at either... these are the cases that piss me off",
      "author": "Shmookley",
      "created": 1574133008,
      "upvotes": 5,
      "replies": {}
    },
    "f80n9ud": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80n9ud/",
      "text": "I just think it's weird that the top academic colleges *have to* also be top athletic colleges? Why can't there be an \"Ivy League\" that's amazing for athletes, and a second \"Ivy League\" that's amazing for academics? Why pitt the nerds and the athletes against each other for a finite number of spots?",
      "author": null,
      "created": 1574133171,
      "upvotes": 7,
      "replies": {
        "f80o6b8": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80o6b8/",
          "text": "[deleted]",
          "author": null,
          "created": 1574133828,
          "upvotes": -1,
          "replies": {
            "f80ydfk": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ydfk/",
              "text": "[deleted]",
              "author": null,
              "created": 1574142333,
              "upvotes": 2,
              "replies": {
                "f814p3t": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f814p3t/",
                  "text": "Your perspective on higher merit is disregarding athletic merit",
                  "author": "BoostedBanana12",
                  "created": 1574149975,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "f81e430": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81e430/",
              "text": "yeah, I know that's how the Ivy League started. I'm just wondering, why can't there be good-at-academics schools that don't care about sports, and why can't there be good-at-sports schools that don't care about academics? Why must the two be intertwined?",
              "author": null,
              "created": 1574163857,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f80yaui": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80yaui/",
      "text": "I totally agree that athletes put a lot of dedication and efforts in over the years to be in a recruited position - arguably more dedication and efforts required by any academic commitment.\n\nThat said, colleges and universities are academic institutions. Their main if not sole purpose is to provide the best education for their students. As a college student, I can attest that a lot of athletes are not on par academically with the majority of students on campus. This hinder the educational experience of other students, such as through lower caliber of intellectual discussion in the classroom.\n\nAs a side point, some athletes act like they are entitled to their spot at the college they’re in. I believe no one is entitled to the spot in highly-selective colleges. There are certainly dozens of other students who deserve your spot - it is just they were not lucky during the admission process.",
      "author": "nahpvretep",
      "created": 1574142260,
      "upvotes": 5,
      "replies": {}
    },
    "f80evz2": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80evz2/",
      "text": "I’m sorry, but I’m going to dissent here. Some athletes can and do attend universities on the basis of both their academic and athletic merit, and I applaud those people for their dedication to their schooling and their craft (sports). However, this is NOT always the case. There are certainly plenty of students who are admitted to universities that they otherwise would not be qualified for because they could play a sport well. In my opinion, that’s absolute bullshit. Schools should be solely academic institutions, not also minor leagues for professional sports. There’s enough issues with qualified, smart people not being able to attend the college that they’re best fit for, if they can even afford college. Having recruited athletes usurp positions from qualified students (even if it’s only a small percentage) exacerbates the multitude of issues with our college system and only serves to strengthen the notion that it matters more that one is rich or athletically talented.\n\nThat being said, those people do work incredibly hard mastering their craft and there should be an avenue for them to foster their skills for either professional or Olympic play without having to sacrifice the integrity of the college and university system.",
      "author": null,
      "created": 1574127389,
      "upvotes": 17,
      "replies": {
        "f82br67": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82br67/",
          "text": "This comment is ignorant as fuck. While a university was built on the foundation of academics and receiving higher education, every top tier/well known universities have a form of recognition through athletics . These D1 athletes make it to the top tier uni to reach out further through the schools reputation. They get more popular and the school benefits from it.\n\nStop saying it’s wrong that highly qualified student are getting their spots taken. They were never accepted. It’s not like they received an admission letter then the school emails them again saying “oh sorry but we decided to accept an athlete instead of you. We apologize for blah blah blah” D1 athletes have the same right as your typical 1600 4.3gpa scholar. \n\nIsn’t the phrase work smarter not harder true? These athletes have a gift and need to hone their skills and you saying they should work on olympic play is retarded. I’m sorry that these other students couldn’t stand out by going through the same path as literally every kid in America. Do something special to get the schools attention instead of literally high gpa high test score high ec. These athletes are special to their eyes because they can provide sth you can’t",
          "author": "Erahia01",
          "created": 1574188106,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "f80caod": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80caod/",
      "text": "I’m not going to lie and say I’m not jealous. But I’m not upset that they “took my spot” or “they don’t deserve it” because THEY WORKED THEIR BUTTS OFF. Most of us put our effort into academics. They put their effort into sports.\n\nIf you think that being recruited is easier, then why doesn’t everyone try to be recruited?",
      "author": "nathanwwdd",
      "created": 1574125588,
      "upvotes": 17,
      "replies": {}
    },
    "f80bqjx": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bqjx/",
      "text": "So not all college programs are elite. And the main resentment comes from how incredibly easy and free of stress applying to college is for recruited athletes. They don’t need to have a robust profile to get into top school. They just need decent grades and test scores (look up academic index). Students who get into elite colleges academically have spent years building their story and marketing it to colleges, for lack of a better term. Recruited athletes have a much easier time with the application process. Also, schools are first and foremost schools, places of knowledge, learning, and high academic caliber. So yes it is very reasonable for someone to feel like an athlete far less academically qualified took their spot. They did. That’s just how it works.",
      "author": "iRun-a-lot",
      "created": 1574125187,
      "upvotes": 25,
      "replies": {
        "f80p6xn": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80p6xn/",
          "text": "> Also, schools are first and foremost schools, places of knowledge, learning, and high academic caliber.\n\nThis. Whatever one’s stance on college athletics, I think this too often is undervalued. (A semi-relevant anecdote: the very first collegiate baseball game was a double-header—a baseball game followed by a chess match.)",
          "author": "ephemeral-pseudonym",
          "created": 1574134570,
          "upvotes": 7,
          "replies": {}
        },
        "f80ovji": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ovji/",
          "text": "I think the point a lot of people miss is that these athletes made a trade-off understanding that their athletics were a way into college - even in middle school, I was at least aware that the time I was putting into my sport had a chance of paying off that way. If the spots for athletes didn't exist, I'd wager that a lot of them would put more time into studying and academics to achieve the same statistics as their peers. It's fair to criticize the fact that the schools prioritize athletes so much in admissions, but the people themselves worked their asses off with the understanding that it was an avenue into college. Also, the idea that recruitment is a cakewalk compared to admissions is ridiculous - they've been spending years honing their skills, with the knowledge that their chances can be ended by an injury or just not being good enough. I'd argue the hours are comparable, and probably more towards athletes as you go down in school prestige.",
          "author": "Meaca",
          "created": 1574134339,
          "upvotes": 6,
          "replies": {
            "f80pv2b": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80pv2b/",
              "text": "Well gasp. Trade offs have consequences!! Who knew",
              "author": "iRun-a-lot",
              "created": 1574135072,
              "upvotes": 1,
              "replies": {
                "f80pyfi": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80pyfi/",
                  "text": "All I'm saying is hate the game, not the player.",
                  "author": "Meaca",
                  "created": 1574135142,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "f83yxol": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f83yxol/",
          "text": "Sure, but are athletes who spent countless hours practicing their sport in order to be good enough to get recruited not building *their* story?",
          "author": "jdono927",
          "created": 1574224971,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f80e3vn": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80e3vn/",
      "text": "It's shitty to downplay the hard work that recruited athletes put into earning their spot. At the same time, I think there's a discussion that can be had about the role/importance/purpose of athletic programs at universities--but there's no right answer there and different universities have different philosophies. Personally, for example, I'm a fan of how MIT approaches \"recruiting\"--but I'm obviously biased.\n\nUltimately, I think when people get mad about athlete's \"taking\" a spot, it comes from their own views on how colleges should prioritize athletic programs and value student athletes. Unfortunately, they don't realize what the larger issue is at hand and resort to taking it out on people who benefit from the \"system.\" \n\nIt's not really productive to engage with those people by arguing about how much time is put into sports and how hard athletes work--again, I think it really comes from different philosophies about what the role of athletics is in contributing to a university's mission.",
      "author": "impressionlevant",
      "created": 1574126859,
      "upvotes": 13,
      "replies": {
        "f81j6gj": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81j6gj/",
          "text": "You also need to keep in mind how much money these schools make from athletics. Tickets, merch, networks, and donations make up a huge amount of money for these universities and not to mention it keeps the alma maters active in the community",
          "author": "dburg35",
          "created": 1574169137,
          "upvotes": 2,
          "replies": {
            "f82rjly": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82rjly/",
              "text": "Of course. What I'm getting is that there are reasons why schools might consider athletics important (ie. the ones you mentioned) but how they incorporate it into their system varies by school to school depending on each institution's values/model. There's no \"right\" answer here--it's all about how athletics plays into each institution's mission and goals. There are many schools who don't place high importance on sports and still maintain a high level of prestige, income, and alumni involvement (ie. my university).\n\nDifferent schools have different models and priorities and I think it's fair to both acknowledge the monetary/other benefits of a strong athletics program and, in accordance with one's own idea of what an institution of higher education should accomplish, believe that athletics programs are overemphasized within the model.",
              "author": "impressionlevant",
              "created": 1574196843,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f80ffu0": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ffu0/",
      "text": "my friend got a good gpa, below average sat , in a shitty public school n he got recruited to hypsm\n\nbut man is he fucking good at football n nice too",
      "author": "Kaori-Miyazono",
      "created": 1574127765,
      "upvotes": 6,
      "replies": {}
    },
    "f80kqjq": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80kqjq/",
      "text": "I’m a recruited football player by D3 schools (multiple offers from NESCAC schools) and I’ve worked my ass off to put myself in a place to attend a top tier school. Having said that, top schools non-D1 don’t lower their standards for athletes, so it’s generally just people looking to blame other people for their own misfortune.",
      "author": "NickWHU",
      "created": 1574131382,
      "upvotes": 5,
      "replies": {}
    },
    "f80awnq": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80awnq/",
      "text": "Working hard doesn't mean you should automatically be accepted to an academic institution. I can work hard at solving rubiks cubes - doesn't mean I deserve to be at a top tier college. Let's be honest, recruited athletes have a place at universities because they bring in money, and I'm saying this as a guy who will probably be recruited to D3 teams.",
      "author": null,
      "created": 1574124592,
      "upvotes": 31,
      "replies": {
        "f80bu8x": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bu8x/",
          "text": "\\>Working hard doesn't mean you should automatically be accepted to an academic institution.\n\nBruh this is like the antithesis to the American education system. The whole point of it is regardless of who you are if you work hard and you get the results necessary you can get into the school of your choice. Because guess what, that valedictorian who was the leader of two clubs worked Omega hard. The same is true for that D1 level athlete with a 3.5 GPA and 34 ACT. Sure they worked in different ways but they were excellent in their own field. The whole point of recruiting and college acceptances is taking into account what level of excellence they achieved. Sure athletes bring in money but literally every other student does too. They pay tuition remember.",
          "author": "Puglord55",
          "created": 1574125261,
          "upvotes": 15,
          "replies": {
            "f80gvua": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80gvua/",
              "text": "I'm all for athlete recruitment, let me put that out there, but it is so painfully clear that athletes bring in MUCH MORE than everyone else. Fans spend so much money on college gear and tickets, and comparing that to tuition is simply not an equal comparison.\n\nAnd, despite you pointing out that it is an \"antithesis,\" have you directly responded to his point? Do you think people who work hard at solving rubik's cubes automatically deserve a place at an elite college?",
              "author": "gargar070402",
              "created": 1574128746,
              "upvotes": 7,
              "replies": {
                "f80nxhe": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80nxhe/",
                  "text": "The problem is when you think of recruited athletes, you’re just thinking of football and basketball, which there is a lot of money behind, but there are so many other sports schools sponsor that make them nothing, or might even lose them money. Track meets, golf tournaments, rowing, things like that aren’t drawing massive crowds or moving mountains of merchandise, but those athletes still rightfully get recruited",
                  "author": "BylvieBalvez",
                  "created": 1574133645,
                  "upvotes": 3,
                  "replies": {
                    "f833uf9": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f833uf9/",
                      "text": "They still make much more than a normal student.",
                      "author": null,
                      "created": 1574203788,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f833rcp": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f833rcp/",
              "text": "Hmmm maybe work smarter not harder. If I work hard to be the top rubiks cuber in the nation does that make me qualified to go to a top school? Give me one good reason why rubiks cubing is different than athletics in top school admissions, and I'll delete my tuition. \n\nI can't tell if your joking about the \"literally every other student does too\" stuff.",
              "author": null,
              "created": 1574203738,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f80czvj": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80czvj/",
          "text": ">Work hard to become one of the best of your age in your field, essentially trading your future health and comfort.\n\nA top university, whose purpose is training students to become the best in their field, shouldn't take them because they didn't get a high SAT.\n\nI say this being one of the top students at my school academically. It's bullshit that physical achievement is dismissed so heavily.",
          "author": "coldblade2000",
          "created": 1574126079,
          "upvotes": 4,
          "replies": {
            "f833kc7": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f833kc7/",
              "text": "Ok so, again, why don't they help me become the best rubiks cuber of all time? Because it doesn't bring in money. I'm not doubting that athletes work hard - but they don't deserve to go to an ivy for \"working hard\". And don't give me that YoU nEeD tO bE qUaLiFiEd FoR aN iVy bullshit. Getting into top schools with GPAs of 3.6 is not qualified. It only might be ok because they are in the same boat as a bunch of other athletes.",
              "author": null,
              "created": 1574203621,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f80ol1v": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ol1v/",
      "text": "Christ some of you need a lesson in how “exception to the rule” applies to the real world. \n\nThere are many athletes that go to college and do nothing but athletics and pass by on that. I get it, just look at those UNC basketball teams. But a person getting in over you even though they “only” have a 3.9 UW and 30 ACT but are a D1 basketball talent compared to your 4.4 and 34 doesn’t make them unworthy. You worked hard yes, no one is doubting that. \n\nI see so many people in here saying dumb things like, “Well because they were born gifted they get a pass?” Absolutely not. They “get a pass” because of the thousands of hours they’ve poured in honing their craft to be some of the most talented and athletic people in their sports in the most athletically gifted country in the world. They “get a pass” because they, with no one who can cheat and do the work for them, chose to dedicate themselves to be excellent in a way few people will ever get to realize for themselves. \n\nYou can be jealous of them sure; because of the attention they receive, because they can be given favors related to that, etc... but to downplay the sheer level of work they did to get where they are because you’re jealous? You’ll have a lot to learn in the coming years if that’s your current mindset. \n\nThis all coming from an unathletic, out of shape, post grad. Athletes, as a rule, earned their way wherever they went. If you’ve met otherwise, I assure you it’s the exception.\n\nSource: attended school for 8 years across two schools and was a tutor for multiple sports teams.",
      "author": "TypicalVegetarian",
      "created": 1574134125,
      "upvotes": 6,
      "replies": {}
    },
    "f80t4el": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80t4el/",
      "text": "Universities are meant for academics. If I could math my way onto a sports team I'm sure everyone would be furious having to deal with me, so having to deal with students with no interest in academics that just got in for baseball or some shit is annoying.\n\nI have no problem with athletes that care about their courses though, it's just the ones that put no effort into classes because their coaches will protect them that annoy me.",
      "author": "gnat7890",
      "created": 1574137578,
      "upvotes": 8,
      "replies": {}
    },
    "f81e1ul": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81e1ul/",
      "text": "I've had athletes in my classes before. There was one in a 300 level English class who thought Anonymous was a good author, because we read a lot of his stuff. One in a 200 level biology class thought lions and tigers were the same species (stripes=female, manes=male) and that all fish were blind. Had one in a 400 level English class -that required a class on Shakespeare as a prerequisite- who thought that Shakespeare lived in the 1900's and that he was American.\n\nI'm sure there are some that are ok but in my experience most athletes don't deserve their degree.",
      "author": "Moravic39",
      "created": 1574163780,
      "upvotes": 4,
      "replies": {}
    },
    "f802t4a": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f802t4a/",
      "text": "Athletes, minorities, and legacies all have a role to play in a university’s operating model. People hate on these groups as well. Good job for making this point because it is a good one and it applies for the others as well.",
      "author": "icebergchick",
      "created": 1574120007,
      "upvotes": 19,
      "replies": {
        "f809t39": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f809t39/",
          "text": "~~legacies~~",
          "author": "mcoolinham",
          "created": 1574123814,
          "upvotes": 17,
          "replies": {
            "f80lgxd": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80lgxd/",
              "text": "Regarding legacies. See this article. Pretty solid. Financial in my opinion and that’s why I mentioned operating model of universities. \n\nhttps://www.theatlantic.com/education/archive/2019/04/legacy-admissions-preferences-ivy/586465/\n\nWhen I said minorities I was talking about the ones that get hate on this sub so it should be obvious that I’m referring to URM.",
              "author": "icebergchick",
              "created": 1574131891,
              "upvotes": 3,
              "replies": {}
            },
            "f80a8hn": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80a8hn/",
              "text": "I'd like the commenter to explain what significant contribution legacies make to universities",
              "author": "sand_dunes37",
              "created": 1574124117,
              "upvotes": 7,
              "replies": {
                "f80b22y": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80b22y/",
                  "text": "money - just like minorities and athletes. \n\nAthletes bring in money.\n\nMinorities raise rankings - which brings in money",
                  "author": null,
                  "created": 1574124700,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        },
        "f80aqes": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80aqes/",
          "text": "[removed]",
          "author": null,
          "created": 1574124470,
          "upvotes": 5,
          "replies": {
            "f80c5rj": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80c5rj/",
              "text": "Facts. Lowkey sucks when I'm more of a minority in my area than any other URM, but hey, too bad I'm of East Asian descent.",
              "author": "jungofficial",
              "created": 1574125489,
              "upvotes": 9,
              "replies": {
                "f80daow": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80daow/",
                  "text": "RIGHT?\n\nI spent the first 14 years of my life in one of the poorest cities in upstate/central NY.\n\nWe literally had a single school system of my 600 kids total.....",
                  "author": "nydanny2014",
                  "created": 1574126290,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "f80bz0w": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bz0w/",
              "text": "hes prolly referring to URMs",
              "author": null,
              "created": 1574125355,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f80jicr": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80jicr/",
      "text": "Athletes also make a lot of money for the school and that money goes into providing resources for all of the students.",
      "author": "Luciditi89",
      "created": 1574130542,
      "upvotes": 3,
      "replies": {}
    },
    "f80ry9w": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ry9w/",
      "text": "I graduated high school in 2015, and 4 years ago people took issue specifically with the fact that student athletes could have the bare minimum academic requirements but get awarded full sholarships. In other words, an athlete with a mediocre GPA being given money from the college which might otherwise have been used on an academic scholarship and therefore making scholarships _even more competitive_ for an academic basis. There’s also the issue that once in college, atheletes are likely to get special priveleges when it comes to matters of maintaining their grades and accusations of sexual assault getting glossed over or ignored entirely.\n\nI’m not at all implying that all student athletes are just dumb and don’t deserve to go to college. Student atheletes put in incredible work. But the point of going to college is to get a degree, not play a sport. Partial scholarships for sport, sure. Even musicians can be offered scholarships. Yes, colleges make money on sports and college sports are how major league teams often recruit. But that system is bullshit, and athletes benefit from it while others are faced with constantly mounting challenges in not just admittance, but scholarship qualification. \n\nI went to overseas to university in the UK, and while I’m not sure what academic scholarships might exist and how common or rare they are, they didn’t have the sports-worship that the US has. The unis seem to do just fine without counting on their sports teams for money, and even in the application process, consideration is only given to your grades and scores. They don’t care what sports you did, what clubs you were in, or what instrument you played. Basically I’m saying that’s the way it should be. You want to continue working hard at your sport? Great. But you’re not getting funding for it, and if you don’t have the marks, you’re not getting in.",
      "author": "lizdahbiz",
      "created": 1574136656,
      "upvotes": 3,
      "replies": {}
    },
    "f8192uz": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8192uz/",
      "text": "I really don’t agree with athletics taking a priority over academics at an *academic institution* (which they may not do by the amount admitted but definitely by the standards expected), but, like, if you think you didn’t get in because of an athlete you probably would not have gotten in anyway.\n\nIt’s a harsh truth.",
      "author": "RepressedSpinach",
      "created": 1574156478,
      "upvotes": 3,
      "replies": {}
    },
    "f81fuyz": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81fuyz/",
      "text": "Imagine thinking College's and University's are anything except a money making business. Sport brings in huge amounts of money, so giving a place to a high level athlete who will aid in bringing in more money over an incredibly average student who is on the borderline of gaining entry anyway is really not that much of a shocker.",
      "author": "BigWamAl",
      "created": 1574165896,
      "upvotes": 3,
      "replies": {
        "f81luea": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81luea/",
          "text": "Besides football and basketball, colleges lose money on sports and especially womens sports. With scholarships and money lost from the sport, these athletes are largely net negatives for their univeristies from a financial standpoint",
          "author": "kinglee0",
          "created": 1574171440,
          "upvotes": 2,
          "replies": {
            "f81y3bh": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81y3bh/",
              "text": "I mean if a college charges 50k for a full education and then a sports department gives a scholarship to a student then they have supposedly spent 50k on the student. When really the college has just forfeited 50k from another student for an athlete who will generate income to some degree, and it wont cost the college 50k to educate that student, not even close. Higher education in itself is a business and a lot of the time you're paying for a certificate with a shiny name on it. Whatever they are doing at some point down the line its helping them generate some profit.",
              "author": "BigWamAl",
              "created": 1574179881,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f80m4md": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80m4md/",
      "text": "Cough*bullshit*cough\n\nThe standards are lower fir the athletes\nThey get special tutors \nThey usually major in business or philosophy \nThey serve their purpose but don’t delude yourself\nAthletes do not need to be idolized",
      "author": null,
      "created": 1574132352,
      "upvotes": 6,
      "replies": {
        "f80x6a0": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80x6a0/",
          "text": "All he is saying is don't shit on people because they're an athlete for the school you didn't get into",
          "author": "BoostedBanana12",
          "created": 1574141126,
          "upvotes": 2,
          "replies": {}
        },
        "f81obwn": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81obwn/",
          "text": ">They usually major in business or philosophy\n\nMaybe on some campuses.  Don't make the mistake of thinking these are easy/flexible majors everywhere",
          "author": "FeatofClay",
          "created": 1574173384,
          "upvotes": 1,
          "replies": {
            "f8249oq": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8249oq/",
              "text": "A lot easier than STEM. Send at my school they all start in engineering and change.",
              "author": null,
              "created": 1574183665,
              "upvotes": 1,
              "replies": {
                "f82qr6e": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82qr6e/",
                  "text": "So by this response, you're saying that because at *your* campus, engineering majors become business and philosophy majors, that these majors are easy majors on *every* campus?  That just doesn't follow for me.  Rigor and selectivity vary from campus to campus, and that can translate down to the department/major level as well.",
                  "author": "FeatofClay",
                  "created": 1574196412,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f80k5c3": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80k5c3/",
      "text": "this ain’t it",
      "author": "mollyirl",
      "created": 1574130982,
      "upvotes": 7,
      "replies": {}
    },
    "f80bhbb": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bhbb/",
      "text": "I trained super hard in school athletics (soccer, boxing, volleyball, swim) but I have some friends who trained even harder in both sports and academics and got into better schools for a *reason*",
      "author": null,
      "created": 1574125001,
      "upvotes": 3,
      "replies": {
        "f80fy5p": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80fy5p/",
          "text": "Seriously and people don’t get that if you have an exceptional academic record on top of your athletic talent/training that opens soooo many recruiting doors, so there is an actual incentive to have good grades but there’s only so much time and people manage differently",
          "author": "Do__Math__Not__Meth",
          "created": 1574128111,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "f80d90m": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80d90m/",
      "text": "[deleted]",
      "author": null,
      "created": 1574126257,
      "upvotes": 5,
      "replies": {
        "f80mo9l": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80mo9l/",
          "text": "I feel like UChicago probably is a bit more on the \"athletes must be academically qualified\" side than a LOT of schools though.",
          "author": "Zeus1325",
          "created": 1574132739,
          "upvotes": 6,
          "replies": {}
        },
        "f80icoa": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80icoa/",
          "text": "Hey, can I dm you about getting recruited by UChicago? I might have interest in me but I’m not sure how to approach it.",
          "author": "actimols",
          "created": 1574129740,
          "upvotes": 1,
          "replies": {}
        },
        "f80evtr": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80evtr/",
          "text": "Well it’s definitely different a D3 schools, especially UChicago. Just saying",
          "author": "iRun-a-lot",
          "created": 1574127386,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f80io8e": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80io8e/",
      "text": "My main problem comes in when these athletes who “worked their butt off” start slacking in classes, “oh I can’t meet outside of class for this mandatory group project bc I have sports practice every day,” *insert loud obnoxious stadium noises interrupting my studying here*, etc. Or how there’s been tons of cases of (especially football) athletes just whining to their prof that a bad grade will mean they can’t be on the team & suddenly they have a perfect grade. Or how at many big football universities, coaches are paid way more than professors. \n\nIt’s a SCHOOL. Academics should come first and foremost. If someone wants to kick a ball around professionally, they should go do that & not interfere with the education of others. If it’s an extracurricular, then it shouldn’t impact at all when profs need to schedule mentor sessions or other things outside of class, group projects, etc. Professors should be paid more than coaches, period. It’s a fucking extracurricular and if you seriously think it’s more than that, then go do that and stop interrupting my education at my SCHOOL. Not sportsball Stadium, it’s a SCHOOL. An institution of learning. If you’re in a university, your first and foremost priority should be learning and education.",
      "author": "hecaete47",
      "created": 1574129961,
      "upvotes": 7,
      "replies": {
        "f80jmif": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80jmif/",
          "text": "The slackers that use their sport as an excuse to make everyone else do the work are obviously being jerks. But for your second point, the thing is that to play professionally you have to play in college first for many sports. If they have plans to go pro, to them college is where they have to show their skill in the sport foremost. \n\nAnd yea coaches being payed more than professors isn't fair imo, but it's all cuz of the money that sports bring in to a uni.",
          "author": null,
          "created": 1574130622,
          "upvotes": 5,
          "replies": {
            "f80lbov": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80lbov/",
              "text": "I'm honestly just so glad I found a school where the sports teams are pretty much nonexistent (not even a cheerleading team or band)... yet then people literally diss on my college for us not having enough \"pride\" like um? We have pride in our peers going to academic conferences, presenting independent research, supporting professors who publish papers and books, cheering on each other getting into grad school, spreading our college's name while studying abroad... But bc we don't have strong sports we don't have \"pride\"? smh   \n\n\nIt's bullshit that college is where one has to \"go pro\" tho. Same for high school. Sports really have no place in academic institutions beyond offering PE/gym opportunities, and extracurricular teams in the form of student orgs.",
              "author": "hecaete47",
              "created": 1574131791,
              "upvotes": 7,
              "replies": {
                "f80ojd1": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ojd1/",
                  "text": "I feel it’s just how we are as humans that we feel way more pride watching ones own school win a big game right before your eyes with thousands of your fellow students compared to hearing about an academic conference or a peer reviewed paper. And those are certainly impressive and schools with teams have all that too, but I think it’s obvious why we feel more pride in our teams for winning. And even if u feel otherwise, you just gotta accept that sports are a part of the college system for the most part, they make way too much money to ever go anywhere, just is how it is.",
                  "author": "BylvieBalvez",
                  "created": 1574134091,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "f80kmrn": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80kmrn/",
              "text": ">And yea coaches being payed more than coaches isn't fair imo,\n\nWhat do you mean by this",
              "author": "Firefighter82",
              "created": 1574131310,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f81of52": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81of52/",
          "text": ">Or how there’s been tons of cases of (especially football) athletes just whining to their prof that a bad grade will mean they can’t be on the team & suddenly they have a perfect grade.\n\nI have to say, might you be overstating things a little here?\n\n>Professors should be paid more than coaches, period. \n\nI love this idea for a lot of reasons, but let's be realistic:  no one is lining up to give a university a TV contract to broadcast the average professor's work to millions.  No one is making plans to fly to a stadium and bu a ticket to watch a professor lecture.",
          "author": "FeatofClay",
          "created": 1574173449,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f80bqnc": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80bqnc/",
      "text": "How does it work for recruited athletes. I see a lot of kids getting into school before the ED/EA acceptances go out. So can anyone explain the recruiting steps? Thanks!",
      "author": "hybridhanna",
      "created": 1574125190,
      "upvotes": 2,
      "replies": {
        "f80l75f": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80l75f/",
          "text": "It really depends- but athletes can “commit” to attending a school if they are offered a spot. My personal experience as a football player being recruited by D3 schools is that if a coach offers you a spot, they will talk to admissions and you’ll get in. At least for the schools I’m looking at, you have to be qualified. Coaches collect transcripts and scores and send them to admissions- they then let you know if they can offer you a spot.",
          "author": "NickWHU",
          "created": 1574131704,
          "upvotes": 3,
          "replies": {}
        },
        "f80lf22": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80lf22/",
          "text": "[deleted]",
          "author": null,
          "created": 1574131856,
          "upvotes": 2,
          "replies": {
            "f80nt1r": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80nt1r/",
              "text": "Thank you all! So helpful!",
              "author": "hybridhanna",
              "created": 1574133553,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f80ovms": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80ovms/",
      "text": "My friend is one of the best volleyball players in the country and Stanford said if he wants to go there he has to get a 33+ on ACT and take 7 APs, as well as stay at an elite level which I’d assume takes at least 50 hours of practice a week. They are not taking other people’s spots, they are working very hard for their own.",
      "author": null,
      "created": 1574134340,
      "upvotes": 2,
      "replies": {
        "f80p4wi": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80p4wi/",
          "text": "This is what I meant by they still need to be solid academically, the top colleges still want their athletes to be top students. Except its probably a lot less than 50 hrs a week.",
          "author": null,
          "created": 1574134528,
          "upvotes": 1,
          "replies": {
            "f80p8ko": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80p8ko/",
              "text": "Probably less than 50 for most, but my friend told me he practices from 4-8 everyday and all day weekends so that’s where the 50 came from. He’s top 10 in his class.",
              "author": null,
              "created": 1574134605,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f81zhn8": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81zhn8/",
      "text": "It’s just jealousy honestly. These people who say their spot was “taken” just felt very entitled, when the truth is the spot was never theirs to begin with. You earn the spot, it can’t be “taken” away from you if it was never earned to begin with. It’s true many schools spend way too much money and focus on sports but still it’s not fair to say athletes were the reason you didn’t get into college. They worked as hard as everyone else did.",
      "author": null,
      "created": 1574180749,
      "upvotes": 2,
      "replies": {}
    },
    "f824o72": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f824o72/",
      "text": "As someone who was recruited D1 but had to quit because of injuries, thank you",
      "author": null,
      "created": 1574183907,
      "upvotes": 2,
      "replies": {}
    },
    "f82a2z2": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f82a2z2/",
      "text": "Those athletes are actually more hardworking than the ones who complain. It’s ironic.",
      "author": "AlternativeJoke",
      "created": 1574187150,
      "upvotes": 2,
      "replies": {}
    },
    "f80k1ot": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80k1ot/",
      "text": "very true. also, when an admissions team sets a target for how many they want in a class, the athletes are subtracted from the number so u were never competing against the athletes in the first place.",
      "author": "USMNT_COYS",
      "created": 1574130913,
      "upvotes": 3,
      "replies": {
        "f80my63": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80my63/",
          "text": "But....that means you are still competing against them in a way. If there are 2000 spots and you get placed behind 1900 of them, you get in. If 200 of those spots go to athletes, you don't get in.",
          "author": "Zeus1325",
          "created": 1574132937,
          "upvotes": 1,
          "replies": {
            "f80oqex": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80oqex/",
              "text": "im sorry i misworded it. They already take into account the athletes so they're looking for 2000 plus athletes. u would never not get accepted bc of an athlete.",
              "author": "USMNT_COYS",
              "created": 1574134236,
              "upvotes": 0,
              "replies": {
                "f80q67h": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80q67h/",
                  "text": "I'm sorry, but what? That makes no sense. They don't add extra spots just for athletes. It's 2000 minus athletes. If there were 200 athletes + 2000 regular spots, then it would be 2200 regular spots without athletes.",
                  "author": "Zeus1325",
                  "created": 1574135300,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f80l4iv": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80l4iv/",
      "text": "[deleted]",
      "author": null,
      "created": 1574131653,
      "upvotes": 3,
      "replies": {
        "f80owh0": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80owh0/",
          "text": "Really depends on the school though, cause D3 is all over the place. My cousin had an atrocious GPA and the lowest ACT I’ve ever heard of but he got recruited to a small D3 LAC. Obviously not as elite as where you’re at but still worth noting. Still think it’s important to note that he is amazing at what he does, and he’s practiced mornings at 6 am multiple times a week and after school for all of high school, so I absolutely believe he deserves his spot, despite not really caring about school.",
          "author": "BylvieBalvez",
          "created": 1574134357,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "f80pjae": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80pjae/",
      "text": "It’s not not a matter of envy but fairness as it’s not only athletes who work hard or have talent, lots of differently talented students spend equal or more time and effort on their academics and extracurriculars. They don’t get rewarded similarly. \n\nHigh school and colleges are being used as junior academies for professional players and private sports franchises. They can build their own system of breeding leagues. Academic institutions should only have recreational sports. Athletics should be treated as one of the many extracurriculars, not as a special case.",
      "author": "1bluenile",
      "created": 1574134825,
      "upvotes": 3,
      "replies": {}
    },
    "f80j5vc": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80j5vc/",
      "text": "In order for me to side with your argument, you would first have to convince me that universities should have sports teams at all, so I'm out on this one.",
      "author": "charsquatch86",
      "created": 1574130303,
      "upvotes": 2,
      "replies": {
        "f816y3c": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f816y3c/",
          "text": "That’s the problem OP doesn’t see, when an institution made for learning are giving athletes special treatment then somethings wrong. Money talks though and it’s fucked",
          "author": "Alger_Onzin",
          "created": 1574153231,
          "upvotes": 2,
          "replies": {
            "f8181gp": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8181gp/",
              "text": "Yeah, at the University I graduated from, my department (biology) had more than doubled in enrollment while I was there. The university had decided to expand the number of classrooms and remodel what was there to accommodate more people.\n\nThey had started tearing down some walls when a tornado took out the football stadium. With the insurance money they got from that, they then canceled renovations on the biology hall and diverted the funds from that to the stadium as well. It took them three years or so to start renovations on the biology department again.\n\nAnd for what? How many people get careers by playing football at a division 3 school compared to biology majors?",
              "author": "charsquatch86",
              "created": 1574154875,
              "upvotes": 3,
              "replies": {
                "f818e2r": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f818e2r/",
                  "text": "For the record, the answer is 2. There have been two athletes that went on to play professionally in the 180 year history of the school. One of them transferred to a much larger school after two years.",
                  "author": "charsquatch86",
                  "created": 1574155412,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f80p83w": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80p83w/",
      "text": "I just think that higher education/sports should be separate.",
      "author": "RavenApocalypse",
      "created": 1574134595,
      "upvotes": 2,
      "replies": {}
    },
    "f803i1t": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f803i1t/",
      "text": " I have a problem with ones that do this and still aren't competitive. Might as well give other people a chance...",
      "author": "PointAxross",
      "created": 1574120307,
      "upvotes": 2,
      "replies": {}
    },
    "f80p7tw": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80p7tw/",
      "text": "I partially agree. My friend got recruited at Duke a month or so ago. He isn’t the smartest or most talented at the sport he is playing. I just know that he was at the right place at the right time.\n\nThere are many student athletes that are far more worthy at a college team with such an amazing academic value. \n\nI have know my friend since we are 8 and yes he worked very hard for his position and I am very happy for him; however, I still believe some students will never be recognized for their potential as my friend was.",
      "author": "BTDBunch",
      "created": 1574134589,
      "upvotes": 1,
      "replies": {}
    },
    "f80pdzd": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80pdzd/",
      "text": "I agree",
      "author": "No-Raspberry",
      "created": 1574134716,
      "upvotes": 1,
      "replies": {}
    },
    "f8104h3": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8104h3/",
      "text": "I mean it is technically true that there are spots for athletes though\n\n\nr/technicallythetruth",
      "author": "Wkddmswh",
      "created": 1574144221,
      "upvotes": 1,
      "replies": {}
    },
    "f8154rl": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8154rl/",
      "text": "What about schools that aren’t D1 with amazing sports departments? My father works for a D3 school that literally hasn’t won a single football game in three years. I’m not exaggerating, literally not a single win in three years. The school literally only has a football team because the previous president liked football and wanted to create a team. So he did, and it has been a total failure ever since it’s creation.",
      "author": "UncleGael",
      "created": 1574150574,
      "upvotes": 1,
      "replies": {}
    },
    "f8156iu": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8156iu/",
      "text": "Yeah let's talk about the people who bought into college instead!",
      "author": "Cay_Mang",
      "created": 1574150641,
      "upvotes": 1,
      "replies": {
        "f81m442": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81m442/",
          "text": "At least the kids who buy themselves in are objectively providing a financial benefit to the school that can be used on educational resources, scholarships, and facilities for other students. The vast majority of athletes at D1 schools are in sports that lose money so when including the price of operating that sport and the scholarship for the athlete, they are objectively a financial detriment to their school.",
          "author": "kinglee0",
          "created": 1574171661,
          "upvotes": 0,
          "replies": {
            "f81pa9y": {
              "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81pa9y/",
              "text": "How are schools with D1 athletics not profiting monetarily off of student athletes? Thats just a simple fact check thing. Plus, buying into colleges is a practice that is unfair and crooked, and for some reason we are going to believe that an institution who accepts students unfairly will use its money fairly? That's ridiculous.",
              "author": "Cay_Mang",
              "created": 1574174082,
              "upvotes": 1,
              "replies": {
                "f81q6bz": {
                  "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81q6bz/",
                  "text": "Do you hoenstly believe sports like lacrosse or tennis or any women's sports have enough of an audience to generate a profit? There's only two \"money makers\" in college sports and that's football and basketball. I'd rather see one kid get in who pays 10 million and helps a new building get funded than have 30 kids get in who pay no tuition, cost the school money to play their sport, and don't meet the regular academic requirements of the institution.",
                  "author": "kinglee0",
                  "created": 1574174720,
                  "upvotes": 0,
                  "replies": {
                    "f821z6v": {
                      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f821z6v/",
                      "text": "Not all D1 athletes get full ride,,, make sure you fact check yourself before you make claims.",
                      "author": "Cay_Mang",
                      "created": 1574182265,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f8190sp": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8190sp/",
      "text": "They do take spots for people that want to learn.  Years ago my uncle started to teach at Notre Dame.  Alot of the football players were in His class, but they NEVER showed up to class, fo homework,  take tests because they had a football scholarship.  \n\nHe tried to fail every one that didn't do any work in the class.  The school administration told him to give all of them A's because they are on a football scholarship.  \n\nMy uncle resigned immediately.",
      "author": "KM68",
      "created": 1574156392,
      "upvotes": 1,
      "replies": {}
    },
    "f81av7g": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81av7g/",
      "text": "My university built a new stadium but the art department doesn’t have a dedicated studio space I can do my home work. The last time I needed help on a paper the academic project office/ writing lab wasn’t open that day (I’m sure because they don’t want to pay people to be there longer) . Maybe spend money on actual school resources before a sports stadium.",
      "author": "LethargicHero",
      "created": 1574159260,
      "upvotes": 1,
      "replies": {}
    },
    "f81g4mo": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81g4mo/",
      "text": "I went to St. Bonaventure where the basketball players are considered gods, even by security. I lived across from Jalen Adams and his team mates and they left a pile of rotting garbage bags in the hallway between our apartments for the entire school year. The janitor refused to clean it up and security wouldn’t take care of it. Not to mention I knew many girls who were sexually assaulted by team members, and none of their reports were taken seriously. I was also a sociology major, where most athletes go because for some reason it’s considered an “easy degree.”  I had one professor that kicked a basketball player out of an exam because he had his phone open under his desk, and she was disciplined not the basketball player. While I understand that athletics are an important way universities make money and promote unity among students , they should not be treated differently from other students because they’re athletes.",
      "author": "queenfiestypants",
      "created": 1574166183,
      "upvotes": 1,
      "replies": {}
    },
    "f81iy7i": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81iy7i/",
      "text": "Well imo, part of the problem is most sports universities run operate at a loss and other students have to subsidize them with athletic fees. If they aren’t making the university money, what’s the point? You’re just giving professional leagues free training for future players at a loss.",
      "author": null,
      "created": 1574168932,
      "upvotes": 1,
      "replies": {}
    },
    "f81pl6a": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81pl6a/",
      "text": "And besides, colleges are attracted to candidates who are involved in any other kind of extracurricular, and there is probably no extracurricular that takes up more time than a competitive sports team (except maybe a job)",
      "author": "thekyledavid",
      "created": 1574174304,
      "upvotes": 1,
      "replies": {}
    },
    "f81skgj": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81skgj/",
      "text": ">These kids worked their butts off to become top tier athletes so that they could earn a spot on a D1 or top tier university's team\n\nSorry - hard no. While there are definitely athletes who did work their butt off, there are some who didn't.\n\nOne of my classmates got a full ride to a D1 school for football. He cheated repeatedly through highschool. He cheated on a test that was based on the play *Les Miserables*. Like Jesus, just watch the movie the night before and you'd be good.",
      "author": "DM_ME_YOUR_POTATOES",
      "created": 1574176364,
      "upvotes": 1,
      "replies": {}
    },
    "f823j73": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f823j73/",
      "text": "I've been meaning to make the exact same post. Places like Harvard don't recruit dumb kids either, they recruit good athletes with good grades and scores. Additionally, many commit their junior year, so it's not like they got in over you. Their spot has been predetermined for a long time. ^^^sigh",
      "author": "MLGTommy47",
      "created": 1574183212,
      "upvotes": 1,
      "replies": {}
    },
    "f8274aq": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f8274aq/",
      "text": "The comments here are great /r/ihatesportsball material",
      "author": "legaljoker",
      "created": 1574185376,
      "upvotes": 1,
      "replies": {}
    },
    "f83vipj": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f83vipj/",
      "text": "I don’t doubt that they worked just as hard to get in, but at the end of the day, they go there to learn and get a degree just like everyone else. When some of them have never taken a relatively difficult class in their lives and struggled to get a 25, it’s hard to do well at places like Stanford. My school is #1 in football in our state and one of the best in the nation so we have lots of kids that get recruited to play at T20 schools but most of them end up just transferring back to our state school because they were dumb as rocks, not willing to put in the work academically, and some had never written a decent paper in their lives. I think instead, both academics and athletics should be considered because some people from my school had 35s on the ACT and were really good academically and put just as much work hard work into football and were pretty good but not the the best. These are the people you deserve to get into top schools the most, those who can juggle being very good both in athletics and in academics.",
      "author": "nihilismdebunked",
      "created": 1574222104,
      "upvotes": 1,
      "replies": {}
    },
    "f80fost": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80fost/",
      "text": "\\*USC sweats profusely\\*\n\nBut in all seriousness, I totally agree.",
      "author": "cajetathicc",
      "created": 1574127934,
      "upvotes": 1,
      "replies": {}
    },
    "f81av65": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81av65/",
      "text": "I think it's about how athletics aren't really related to academics; like how these are academic institutions recruiting athletes.\n\nIMO it's impossible to not feel a twinge of jealousy when the kid next to me in Calc gets recruited to Harvard and is told to get a 500+ on his subject tests and write down \"literally anything\" on his commonapp essay. But I do admit it's jealousy.",
      "author": null,
      "created": 1574159258,
      "upvotes": 1,
      "replies": {}
    },
    "f80p3un": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80p3un/",
      "text": "30% of students drop out after their FRESHMAN year. No one is taking anyone's spot because countless people go and give it up less than a year later.",
      "author": null,
      "created": 1574134506,
      "upvotes": -1,
      "replies": {}
    },
    "f80e0ae": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80e0ae/",
      "text": "i have more respect for recruited athletes than top scholars. i would argue any day that getting into a top college is exponentially more difdicult than getting in on merit. but again, thats j my opinion and ppl are free to think what they want",
      "author": "qctum",
      "created": 1574126791,
      "upvotes": -2,
      "replies": {}
    },
    "f80mcf0": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80mcf0/",
      "text": "Nerds too fat or too skinny and get jealous lol no surprise here",
      "author": null,
      "created": 1574132504,
      "upvotes": -2,
      "replies": {}
    },
    "f80s0a7": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f80s0a7/",
      "text": "Totally agree. At the end, universities are a business cooperation and they want students who can bring them money. Athletes can do that. A student pursuing academia usually can not and end up just getting a job for themselves and don’t really add anything to the university.",
      "author": "krazykoolkid09",
      "created": 1574136699,
      "upvotes": -1,
      "replies": {}
    },
    "f81kpp3": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f81kpp3/",
      "text": "Haha imagine thinking a recruited athlete deserves entrance into an institution of EDUCATION with sub par academic abilities because they can play a sport.\nThe Ivy league presents itself as a educational system for the highest achievers who pay top dollar for the most renowned professors and not where 20% of their student body has SAT scores 200+ point below the mean and gpas of 3.5 instead of 4.5. We created universities to teach people with athletics as a bonus, not the other way around. \nYou're a 🤡",
      "author": "kinglee0",
      "created": 1574170495,
      "upvotes": -1,
      "replies": {}
    },
    "f813ozf": {
      "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f813ozf/",
      "text": "[deleted]",
      "author": null,
      "created": 1574148620,
      "upvotes": -2,
      "replies": {
        "f814vlx": {
          "link": "/r/ApplyingToCollege/comments/dybazd/people_need_to_stop_saying_recruited_athletes/f814vlx/",
          "text": "No. The tickets, merchandise, and sponsorships for sports teams that do well all make a ton of money for the college. influencers provide nothing for a school.",
          "author": "BoostedBanana12",
          "created": 1574150224,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}