{
  "sid": "ri7j4i",
  "link": "/r/ApplyingToCollege/comments/ri7j4i/im_dying_inside/",
  "title:": "Im dying inside",
  "text": "All my cousins and friends are getting into ivies and their top-choices. When I got my Stanford rejection, I heard my cousin on the phone with mom, telling her that she got into Penn law.\nIt feels like all of my work over the years was invalidated. I’m so disappointed in myself. Do I bother applying to the rest of my schools or just settle for UMD. If I go to UMD, I be stuck with the fact that I could’ve done so much less and be in the same position. I think I might just be majorly burned out, but it still hurts to know that I can’t seem to do anything right. I have no motivation rn🗿🗿. Maybe I’m just being a baby, my rejection depression is still lasting a day after the decision. I don’t wanna keep thinking about college for the next couple months. I wanna live my last year at high school without stress. Is this too much to ask?",
  "author": "WumbisBombino",
  "created": 1639710584,
  "updated": 1639785693,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.85,
  "comments": {
    "hovar2x": {
      "link": "/r/ApplyingToCollege/comments/ri7j4i/im_dying_inside/hovar2x/",
      "text": "Life wants to be won— so go out there and win it. Don’t settle for less. What sets someone apart is their ability to deal with rejection.",
      "author": "royo1010",
      "created": 1639710779,
      "upvotes": 7,
      "replies": {}
    },
    "hovb4u2": {
      "link": "/r/ApplyingToCollege/comments/ri7j4i/im_dying_inside/hovb4u2/",
      "text": "hmm I'd take at least tomorrow off and not look at any college-related things (as much as you can), maybe the whole weekend if you can spare it. Spend some time doing things you like, or hang out with friends. I think you might need a reset after that tough rejection. You sound burned out to me, which happens! But it means you should take a bit of a break.\n\nAnd then when you come back, ask yourself again if you want to keep applying or if you're satisfied with UMD",
      "author": "Lil-pants",
      "created": 1639710954,
      "upvotes": 3,
      "replies": {}
    },
    "hovjec2": {
      "link": "/r/ApplyingToCollege/comments/ri7j4i/im_dying_inside/hovjec2/",
      "text": "I'm sorry you feel this way, college process sucks. continue to apply, you may get a full ride somewhere? who knows. my friend got didn't get accepted to Columbia or Yale last year but got accepted to Harvard. \n\n&#x200B;\n\nhowever- I would go wherever you are happier / financially good for u :) good luck wherever you go, im sure you will do great things!",
      "author": "yrollins",
      "created": 1639714697,
      "upvotes": 2,
      "replies": {}
    }
  }
}