{
  "sid": "g37nsu",
  "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/",
  "title:": "My personal system for easily creating fun, original essay topics. Introducing: \"Half-Ideas\"",
  "text": " In my experience, the majority of problems students run into with their application essays are based upon picking a bad topic. By \"bad\" I generally mean the topic falls into two categories:\n\n1) Done to death\n\n2) Too weird for its own good\n\nThe first one I can easily provide samples for: probably my most common one is running track. A lot of students run track and want to write about their experiences. That's great except that a lot of other students also run track and have similar things to say. There are only so many ways to write about track - see if you recognize any of these classics:\n\n\\- I joined track and was bad at it, but then I tried harder and now I'm good\n\n\\- I'm really good at track and here is a list of my accomplishments you already saw on my EC that prove how good I am\n\n\\- I'm just ok at track, but through the team, I have gained other skills like leadership that are important to me\n\n\\- I loved running track until something made it so I couldn’t anymore. But then I got better and now I can again\n\n\\- I loved running track until something made it so I couldn’t anymore. And I still can’t. But it’s ok I figured it out\n\n\\- I don't actually like track, but in being forced to do it, I learned some valuable lessons\n\n\\- Here is a live recap of me running the anchor on the 400 relay, with every student I pass symbolizing an obstacle I have conquered in life to get where I am\n\nThat last one is a bit of a joke. But it's indicative of the problem that I think drives elite students to get so...creative in the framing devices on their essays. You students know track isn't that special, but it is something important to you, and you want to talk about it. The end result is...well…\n\n[https://www.reddit.com/r/ApplyingToCollege/comments/fy37s9/i\\_think\\_modern\\_elite\\_essays\\_are\\_terrible\\_and/](https://www.reddit.com/r/ApplyingToCollege/comments/fy37s9/i_think_modern_elite_essays_are_terrible_and/)\n\nAnd then the other problem is with \"le quirky teen\" essays. These never seem to work out as well as anyone wants. That penguin collection may be as important to you as you write about, but without anything more substantial to link those interests to, the essay falls apart.\n\nSo, what do we do about all this? How do we manage to write about what matters to us, but in a way that's still fun and original? \n\nThe answer is *half-ideas*.\n\n\"I like track because it taught me responsibility\" is a half idea. So is \"I have trouble sleeping when I'm nervous. So is \"I collect stuffed penguins.\" So is \"I like making people laugh and try to lighten the mood when things are hard.\" A half idea is anything about you or your world that you think colleges should know about. What makes half-ideas different from normal ideas is that we want to come up with these ideas with the full intention of *combining those ideas together to create an original topic.*\n\nSome people stumble upon combining half ideas by accident. I did! I wrote an essay ten years ago that perfectly encapsulated how easy and powerful combing two ideas can be. My two half ideas for the topic were:\n\n1. I have ADHD\n2. I like to run \n\nEither of these topics could be converted into a competent, if unexciting, essay on their own. I guarantee AOs will read hundreds of similar essays this year.  But luck would have it, I combined those two half ideas into a full idea that worked a lot better. All I had to do was look at those two topics and try to find a connection between them. I've found that the best connections will pop out to you. Mine did:\n\n**How running helps me deal with my ADHD by giving me a way to quiet my mind and think clearly** \n\nThe hardest part of my ADHD is getting my brain to stop moving so fast. As quickly as I start to think about something important, that thought gets batted away by garbage. I like running because I find when I get tired enough, my brain will quiet down, and I can think about things that are important or bothering me. I get most of my best thinking done six miles into a run. That's my essay. \n\nI guarantee there aren't many students writing that essay. By combing two ideas into a single one, I make the topic much more personal and unique. I also build myself a natural narrative structure by both presenting a challenge and a way I conquer that challenge. \"How X helps me with Y\" is a great way to frame an essay  Cool, right!\n\nSo let's get practical. The first step is to build as many half-ideas as possible. Just start posting as many ideas as you can. Don't worry about how you'll match them or if they're even worth matching. You've likely heard similar \"just write; it doesn't matter what!\" advice before, but I think that advice kind of sucks because it DOES matter what you write. With half-ideas, you should feel more comfortable posting weird factoids about yourself because you'll no longer have to worry about turning those ideas into a full essay. Just write them. Here are some sample list groups you can start with, along with as many personal half ideas I can think of for each.\n\n**Cool stuff you've done that would make a traditional essay**\n\n4 years Cross Country\n\n3 Years Track\n\n2 Years School Newspaper\n\n4 years Parli Debate\n\nHosted a school zombie tag game\n\nActive non-fiction writer\n\nStarted my own College Consulting business and made a sweet website, nbd (CollegeWithMattie.com)\n\n**Obstacles you've overcome** \n\nADHD\n\nI suffered through chronic illness in my 20s\n\nColorblind\n\n**Weird \"quirky\" facts about you**\n\nI love cats and have one named Penny\n\nI love football and refuse to work on Sunday\n\nI taught myself piano using a video game\n\n**Positive Personality Traits**\n\nMy mom says I'm funny\n\nI'm easy to talk to and once won a bet by speaking about my cat and college admissions for 3 hours straight\n\nI think differently and often come up with solutions for problems no one else has (like this one!)\n\nI see patterns well and am always looking for a more efficient way to do things\n\n**Goals/Passions/Proof of those passions**\n\nWant to be a private college admissions consultant\n\nFinishing UC Berkeley certification on topic\n\nWorked past three years as a counselor with company\n\n10 years of writing experience\n\nThat's just a short selection. Locate any \"idea suggestion\" posts and you will find more topics to think about. \n\nNow that I have my list, it's time for me to look for connections between the two. Often the best value for this method comes when one of the half ideas is from the \"challenges/hardships\" section. This is especially true for URM or any other student with a background hook. You want to present that background but do it in a way that's more tasteful than \"I grew up X, and here's why it was hard.\" Combine that half idea with another interest of yours, so the topic becomes \"How Y helped me overcome my Childhood as X\". Yay half ideas!\n\nWhen looking at my list, two ideas that come to mind are my history of illness + that I taught myself piano. I decided to teach myself piano two years ago as a way of signifying that my life was going to be different now that I was better. It turned out that way, and now I celebrate my piano playing as a symbol of the fact that life doesn't take things from me anymore; I gain from it.\n\nPretty good topic, ya? Seeing these topics all out in front of me made it easy to compare them to one another and see what kind of connections I could identify. \n\nHere are some bonus tips as you develop your half-idea stable:\n\n**Your ideas don't have to share 50/50 content.** \n\nSometimes one topic is just more interesting than the other. Don't be afraid for a single idea to encompass 80%+ of an essay, with another idea coming in as support. Maybe you write about charity work and realize that every time you read to a kid in the hospital you leave him with one of your stuffed penguins. That's exactly why you want to introduce those penguins earlier so you can add it to your experience.\n\n**You can even have third ideas. Whatever**\n\nGoing back to my illness/piano essay, I'd probably also want to add my wish to be a counselor in near the end. Just as I gained piano in my life, I also want to obtain success in counseling. Seeeee? It's so fun and eaaaaaasy!\n\n**Focus on the interaction between the ideas as much as or more than the ideas themselves**\n\nSomewhere out there is another essay involving both a love of swimming and a keen interest in robotics. Simply having two half-ideas existing in an essay is not necessarily going to make it work. Instead, I find it’s the way those ideas intertwine -the connection itself- that is most interesting. I think it’s because that connection entirely relies on you and how you view the world. That’s where the magic happens. \n\n\n**Keep every half-idea about you**\n\nThis goes into advice for another blog post, but keep the focus of your essays on you. Your friends, family, famous people, politicians, and everyone else can cameo in your story, but the vast majority of content needs to be about you. The easiest way to ensure this is to keep all half-ideas that way from the start.\n\n**You can think of half-ideas retroactively**\n\nWrite something and just feel like it's missing something? Think hard about other aspects of your life that may fit into the essay you've already written. Maybe you wrote about a big camping trip. You can bring up the fact that you're always the one who tries to keep the group calm, so when things were rough, you took it upon yourself to provide moral support. The goal is writing an essay that showcases what happens when different aspects of your life come together.\n\n**Try to form your full topics in the form of a narrative**\n\nUtilizing \"how\" is a great way to do this. How my love for paper airplanes made me a better engineer. How my daily NYT crossword puzzle influences my taste in authors. Get both topics in there and try to present one as having a causal effect on the other.\n\n**Don't go insane**\n\nYou may have a topic or two that are awesome and don't need tinking with. Don't! This may be advice for essays 2-27 you'll be writing. Keep the list of half-ideas handy and constantly be adding to it. You never know when you'll be inspired by it.\n\n\\-\n\nHot damn you kids like this one. \n\nI’ve heard a lot of people mention this piece is how you found me. If that’s you right now, hi! My name’s Mattie. I run a private college consulting service in the Bay Area. Thanks to posts like these, I’ve been able to transfer into offering my services to students around the globe via Zoom. \n\nIf you’re interested, check out my website at CollegeWithMattie.com. All my other blog posts are on there (they’re also all here if you just check my profile). Also on the site is a list of services I offer to students looking for 1-on-1 help applying to schools. It’s a good time. \n\nReal life Redditors have already messaged me, set up consultations, and are now signed on with me to work this summer and fall. I’d love to work with you, too. \n\n- Mattie",
  "author": "CollegeWithMattie",
  "created": 1587148294,
  "updated": 1634075954,
  "over_18": false,
  "upvotes": 2289,
  "upvote_ratio": 0.99,
  "comments": {
    "fnq239l": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnq239l/",
      "text": "Great post OP. Upvoted.",
      "author": "PoseidonDrip",
      "created": 1587156219,
      "upvotes": 125,
      "replies": {
        "fnq2okm": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnq2okm/",
          "text": ":D",
          "author": "CollegeWithMattie",
          "created": 1587156537,
          "upvotes": 50,
          "replies": {}
        }
      }
    },
    "fnqh9gx": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqh9gx/",
      "text": "Can we flair this “Best of A2C”?",
      "author": "mmcarthy89",
      "created": 1587164574,
      "upvotes": 106,
      "replies": {
        "fnriswu": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnriswu/",
          "text": "Seconded\n\nu/admissionsmom\nu/ParadoxicalCabbage",
          "author": "ShantanuPSinha",
          "created": 1587190272,
          "upvotes": 13,
          "replies": {
            "fnrrbjx": {
              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnrrbjx/",
              "text": "Done",
              "author": "ParadoxicalCabbage",
              "created": 1587198630,
              "upvotes": 13,
              "replies": {
                "fnruwdl": {
                  "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnruwdl/",
                  "text": "Very cool. Thank you.",
                  "author": "CollegeWithMattie",
                  "created": 1587202492,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fnq3ipc": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnq3ipc/",
      "text": "Mattie strikes again!  An absolutely amazing post, and I highly recommend this advice for juniors right now.  The tips in this post helped me a lot when I was making essays!  \n\nHave a nice day!",
      "author": "eccentricgalaxy",
      "created": 1587156987,
      "upvotes": 87,
      "replies": {
        "fnqiod1": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqiod1/",
          "text": "[deleted]",
          "author": null,
          "created": 1587165384,
          "upvotes": 15,
          "replies": {
            "fnqtvcl": {
              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqtvcl/",
              "text": "Thank you so much!  I am glad to hear that.\n\nHave a nice day!",
              "author": "eccentricgalaxy",
              "created": 1587172109,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "fnqnoos": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqnoos/",
          "text": ":)))) Mattie is awesome!",
          "author": "UnknownAdmissions",
          "created": 1587168288,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fnq9uom": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnq9uom/",
      "text": "I did a similar thing where I combined a disorder that I had with my passion for football. I don’t necesarrily know if my essay was the factor that got me into my top choice school but my counsellors were very impressed with the essay.",
      "author": "rlevi2001",
      "created": 1587160476,
      "upvotes": 28,
      "replies": {
        "fnqanhr": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqanhr/",
          "text": "That’s how I end up with systems like this. After enough essays, I really got good at reading one and going “this is good” “this is amazing” or “this is trash”. \n\nMy brain can’t be satisfied with that. I have to know WHY I feel that way. I wrote about bad essays last time. This one came from trying to decipher what made the good ones good. Or, more specifically, what series of events took place that led to a student and I coming up with a good topic together.",
          "author": "CollegeWithMattie",
          "created": 1587160922,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "fnqbtso": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqbtso/",
      "text": "I gotta ask the important questions...which video game?",
      "author": null,
      "created": 1587161575,
      "upvotes": 14,
      "replies": {
        "fnqi67s": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqi67s/",
          "text": "It’s called Synthesia, and I literally can’t in good conscience recommend anyone else try to learn that way. \n\nMy deal is I’m a life-long rhythm game player. DDR back in early 2000s, and more recently I cracked the top 200 players in Beat Saber. Beat Saber rules. \n\nI get that method of learning at a high level, so I took to piano via it rather quickly. The problem is I can’t actually play piano. I reached a (shockingly high) plateu where I can read the notes just fine, and my fingers are ready, but I physically don’t know how to maneuver them to be in position for the next ones. \n\nI’m on a break now. But once I can have people in my house again I’m looking to hire a traditional coach and learn the “real way”.",
          "author": "CollegeWithMattie",
          "created": 1587165097,
          "upvotes": 27,
          "replies": {
            "fnqo5ht": {
              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqo5ht/",
              "text": "Oh man I do love beat saber, and running also makes my racing thoughts slow down.\n\nCool",
              "author": "Panvictorcakes",
              "created": 1587168563,
              "upvotes": 8,
              "replies": {
                "fnqpnl4": {
                  "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqpnl4/",
                  "text": "I haven’t played in a while but when I last did my favorite song was “hold on”. It was brilliant in that it shifted the ultra-hard meta from “HIT MORE NOTES” to “Hit these notes that are farther away from one another than you’re used to”. It’s my hope that the meta has shifted further that direction. I’m so sick of under-hook over-hook loops. \n\nMy friend is a big OSU guy and it’s been fun having him explain how the Beat Saber meta is mirroring how the OSU meta evolved almost step by step.\n\nYOOOOO. It’s on Youtube!\n\nhttps://youtu.be/--76oDxzhlE\n\nThis is now a Beat Saber thread.",
                  "author": "CollegeWithMattie",
                  "created": 1587169485,
                  "upvotes": 6,
                  "replies": {
                    "fnsk1kz": {
                      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnsk1kz/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1587223227,
                      "upvotes": 3,
                      "replies": {
                        "fnt8ys3": {
                          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnt8ys3/",
                          "text": "That’s good. It was getting rough. Like, I beat Freedom Dive. I get it. I don’t need your unique spin on “flail your arms like you’re swinging weighted ropes in a cross-fit class”.",
                          "author": "CollegeWithMattie",
                          "created": 1587236919,
                          "upvotes": 2,
                          "replies": {
                            "fntbr30": {
                              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fntbr30/",
                              "text": "I just watched the first 90 seconds of freedom dive and I didn't see a single cross-over note. That looks like... well, an exceedingly boring song to clear.",
                              "author": null,
                              "created": 1587238489,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fnt7u2o": {
                      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnt7u2o/",
                      "text": "That does look really fun! I know what you mean and can definitely appreciate a shift in the challenge from more notes to far notes\n\nAnd Lol the beat saber meta",
                      "author": "Panvictorcakes",
                      "created": 1587236288,
                      "upvotes": 1,
                      "replies": {
                        "fnt92nr": {
                          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnt92nr/",
                          "text": "There totally is one! Remember the first year when people didn’t understand how scoring worked so they’d put long lines of dot blocks for drum sections that made it impossible to score better than a B?",
                          "author": "CollegeWithMattie",
                          "created": 1587236980,
                          "upvotes": 1,
                          "replies": {
                            "fntc1f7": {
                              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fntc1f7/",
                              "text": "No I haven't been into it that long haha, I can expert+ every dlc and default level. But when I recently did some custom levels I was disappointed that most of the fun songs weren't that difficult.",
                              "author": "Panvictorcakes",
                              "created": 1587238652,
                              "upvotes": 1,
                              "replies": {
                                "fntl8mz": {
                                  "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fntl8mz/",
                                  "text": "You def need to know how to use search tools to find the gems. Lot of trash out there.",
                                  "author": "CollegeWithMattie",
                                  "created": 1587243906,
                                  "upvotes": 2,
                                  "replies": {
                                    "fnuqd9j": {
                                      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnuqd9j/",
                                      "text": "👍🏻",
                                      "author": "Panvictorcakes",
                                      "created": 1587268386,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fnqainb": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqainb/",
      "text": "I love this! I did something similar without even noticing—I wrote an essay about my social anxiety and how I enjoy busking with my flute. It became an essay about how I was able to overcome my social anxiety to be able to perform comfortably in public, and the valuable lessons I learned from busking.",
      "author": "charlottecunningham",
      "created": 1587160846,
      "upvotes": 13,
      "replies": {
        "fnqidet": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqidet/",
          "text": "I imagine a lot of students will go “I did that!” My hope is by showcasing how often it’s done by accident but still works that it will become apparent how easy and effective it is to use.",
          "author": "CollegeWithMattie",
          "created": 1587165212,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "fnqb8s8": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqb8s8/",
      "text": "This is great advice. I did this in my common app essay, and while my three topics were all pretty cliché, the way I connected them together helped me tell a story that hopefully didn’t suck.",
      "author": "in_THIS_economyy",
      "created": 1587161253,
      "upvotes": 13,
      "replies": {
        "fnqkz3i": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqkz3i/",
          "text": "That’s the big take away. 10,000 people will write about one half idea. Another 10,000 the other. Hell, like 15 may very well write about both of those topics in the same essay just like you did. But only you will have those two topics and the specific life experience that connects them.",
          "author": "CollegeWithMattie",
          "created": 1587166701,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fnq38jd": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnq38jd/",
      "text": "Thanks for the advice :)",
      "author": "Full_Eyes",
      "created": 1587156836,
      "upvotes": 11,
      "replies": {}
    },
    "fnqe1a8": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqe1a8/",
      "text": "How can I write about growing up with a teen mom and a dad in the military and make it sound interesting and not like a sob story?",
      "author": "selenagabriella",
      "created": 1587162769,
      "upvotes": 7,
      "replies": {
        "fnqes7r": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqes7r/",
          "text": "Well, short of the idea posed here, sometimes I recommend students in your scenario think about how your childhood was *different* as opposed to worse. I imagine there were things about your childhood that were quirky or even enjoyable that “traditional” families never experiences. Make a list of those differences and see if any narratives pop out to you. \n\nThen combine it with your love of stuffed penguins.",
          "author": "CollegeWithMattie",
          "created": 1587163179,
          "upvotes": 24,
          "replies": {
            "fnqfhcw": {
              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqfhcw/",
              "text": "Will do. Thank you so much!!!",
              "author": "selenagabriella",
              "created": 1587163573,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "fnqfj44": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqfj44/",
      "text": "I believe you mean collegewithmattie.com",
      "author": null,
      "created": 1587163601,
      "upvotes": 8,
      "replies": {
        "fnqhg9h": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqhg9h/",
          "text": "Man. That’s the most me mistake ever. I spent like 5 hours editing this thing and lol w/e the promotional part. \n\nThank you. Sincerely.",
          "author": "CollegeWithMattie",
          "created": 1587164683,
          "upvotes": 18,
          "replies": {
            "fnqu67o": {
              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqu67o/",
              "text": "You're welcome :D.\n\nThanks for all you're doing!",
              "author": null,
              "created": 1587172304,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fnqd2wn": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqd2wn/",
      "text": "So I didn’t read the full post because I wanted to ask this question before it slipped, but I think, from what I read, I get the basic idea.\n\nI wanted to ask for opinions on my situation. I’m currently a sophomore though, so it’s a bit sparse, but what I was thinking was combining my musical activities with my passion for nature.\n\nSpecifically, I was thinking I could write about how music has helped me combat issues like existential dread and depression and has allowed me to find, in myself, the will to pursue actions and activities because I want to or because they feel right, not because of monetary gain or popularity. As a result, I found that I am at my best when working with animals and pondering a reality in which nature and man is more mutualistic. Could this work or is it too far out?",
      "author": "EmperorElephant",
      "created": 1587162246,
      "upvotes": 6,
      "replies": {
        "fnrcosd": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnrcosd/",
          "text": "Seems fine to me. I don’t think you need to bring up depression. “Hard times in my life” is reason enough, then get into what you do about it.",
          "author": "CollegeWithMattie",
          "created": 1587185089,
          "upvotes": 1,
          "replies": {
            "fnrcuf3": {
              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnrcuf3/",
              "text": "I guess I use depression synonymously with like, evaluating current existential states and coming to terms with certain ideas. Feeling a lack of purpose or meaning to life and overcoming that.\n\nMaybe instead I could bring up family hardships and how music taught me to stay grounded in my passions and how I hope to take that lesson into the future with my intended career?",
              "author": "EmperorElephant",
              "created": 1587185213,
              "upvotes": 1,
              "replies": {
                "fnrf9dr": {
                  "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnrf9dr/",
                  "text": "I think my next blog is going to be about “red flag” topics and why I don’t recommend them. The risks wildly outweigh the benefits.",
                  "author": "CollegeWithMattie",
                  "created": 1587187189,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fnqk5um": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqk5um/",
      "text": "Great post! After reading the “flowery text” one and this one I’m finally able to put my advice into words. I was accepted to multiple T20 and one T5 school (I have no idea who ranks them and why lmao) so lower classmen and juniors saw me as this lord of college advice figure. Truth is I had no idea what I did in my essays to get accepted; I was just honest with what I’ve accomplished and why I’ve participated in what I have: I simply enjoyed my EC’s. I sort of used half ideas in my essays and have been trying to explain this concept for so long, but you’ve worded it perfectly! From now on I’m referring people to these posts for ideas of where to begin.",
      "author": "alexattano2",
      "created": 1587166233,
      "upvotes": 6,
      "replies": {}
    },
    "fnqynzv": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqynzv/",
      "text": "Gold.",
      "author": "icebergchick",
      "created": 1587175145,
      "upvotes": 4,
      "replies": {}
    },
    "fnqz1mq": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqz1mq/",
      "text": "this helps so much more than the all the generic essay “tips” that you get 90% of the time",
      "author": "uncoolpainter95",
      "created": 1587175392,
      "upvotes": 3,
      "replies": {}
    },
    "fnr722i": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnr722i/",
      "text": "Mattie, thank you so much for this guide. I’ve never seen this advice before and to me, someone who’s stuck on deciding what to write, this has opened up a world of possibilities! You’re awesome and you rock!",
      "author": "rant-rant-rant",
      "created": 1587180896,
      "upvotes": 3,
      "replies": {}
    },
    "fnq72k0": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnq72k0/",
      "text": "Thank you! Your post gave me some inspiration!",
      "author": "EvaW1",
      "created": 1587158927,
      "upvotes": 7,
      "replies": {}
    },
    "fnqmx0d": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqmx0d/",
      "text": "Thank you!!",
      "author": null,
      "created": 1587167841,
      "upvotes": 2,
      "replies": {}
    },
    "fnqqnda": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqqnda/",
      "text": "Good shit! Consider putting this in the Best of A2C?",
      "author": "firecomet234",
      "created": 1587170100,
      "upvotes": 2,
      "replies": {}
    },
    "fnqxuts": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqxuts/",
      "text": "Do any obstacles act as turnoffs for AOs?\n\nSo there was this time where I went to UK to live. Due to this shift I lost basically most my ability to socialize, make friends etc. Then a few years later when I made **a** friend that cared about me we immediately had to shift back to India suddenly, I lost the 1 friend I had and became completely introverted and lost a lot of my ability to socialize with new people. Then we shifted to USA where I forced myself into social situations and finally made friends, went out and actually experience what it felt like to be a teenager.\n\nThis is nowhere near my essay but I am not worrying about essays rn. My question is that does an essay that shows me as an outsider/dork/introvert for most my life (tbh I still am but not nearly as much) act to show me unfit for a university and then reduce the quality of my application?",
      "author": null,
      "created": 1587174610,
      "upvotes": 2,
      "replies": {
        "fnr2gqr": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnr2gqr/",
          "text": "An upcoming blog is basically going to be “Challenges good, difficulties/bummers depends, tragedy bad” Your story seems closer to a difficulty, and it doesn’t seem like you have a great narrative or powerful revelation to make it worth writing about.",
          "author": "CollegeWithMattie",
          "created": 1587177699,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fnr0lzo": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnr0lzo/",
      "text": "Love this. My halves were my biracial identity and love for etymology. \n\nI connected the two by talking about hybrid words, which are words formed by two completely different roots. They are ridiculed by some linguists, but they have a strange beauty to them.",
      "author": "itsflexi",
      "created": 1587176436,
      "upvotes": 2,
      "replies": {}
    },
    "fnsjt1y": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnsjt1y/",
      "text": "I'm posting this as a comment, but I might wind up expanding on my thoughts and posting my own post in the next day or two (perhaps collaboratively? :)). I agree with a lot of what you said, but there are some specific musings I would like to make. If I don't mention something in the following comment, rest assured I feel there are no musings to be made on the subject.\n\nOn the topic of half-ideas: the thing that makes an idea, or a half-idea, worth writing about is the scope of its ability to represent you. I'm going to use my commonapp essay to express what this means. Reading it will make the points that follow a lot more comprehensible. The document includes two drafts; the first page is exactly 650 words, and the second page is 714 words that I had to slim down into my final draft of 650. I only mention two specific points from my essay, but I've included them as a lot of what I discuss can be seen at several points in my essay.\n\n&nbsp;\n\nMy essay is, above all, imperfect. I spent months working on it, and I think it is reflective of as much of me as I have the skill to cram into six hundred and fifty words. I started that essay March of 2019, and continued to work on it until I submitted applications in November. I started it in March, and it went through a ridiculous number of iterations before I completed it. The only thing that stayed the same from first draft to final draft was the goal of the essay: to express as many facets of my personality that I found important as possible, without feeling like I was covering up anything about myself.\n\nWhere the part of speech might normally be placed in the definition of a word, I chose to use the word \"effeminate\"; the part of speech of a word defines how it fits into a sentence, and so I decided to use a word that expressed how I fit into a group. Effeminate sums up so many aspects of my personality; it gives the reader insight into who I choose to interact with, the way I view myself, and exactly who it is that I'm okay with being. I don't think this is a half-idea; I think that the word \"effeminate\" is an entire idea, contained within one word, that expresses an entire facet of my personality to the reader. This is where my main disagreement with you, /u/CollegeWithMattie , comes into play. I think it's somewhat disingenuous to title your concept \"half-ideas\", because it will give students and kids the wrong idea. When you say \"half-idea\", you are expressing a concept of division, of incompleteness, or of not-wholeness, and that's not really what you describe in your post. When you say \"half-idea\", I think the word \"facet\" is, in fact, much more descriptive of the idea that you are trying to express to readers - to young adults, and to students, in this case. The issue is that facet doesn't have the same ring to it, which is why I understand the decision to call them \"half-ideas\".\n\nMy other disagreement with your post comes in response to the following section:\n\n>Try to form your full topics in the form of a narrative\n\n>Utilizing \"how\" is a great way to do this. How my love for paper airplanes made me a better engineer. How my daily NYT crossword puzzle influences my taste in authors. Get both topics in there and try to present one as having a causal effect on the other.\n\nThere doesn't *need* to be anything causal about this, and I would go so far as to posit that these are not ideas that belong in the same paragraph or even a pair of paragraphs. If they are both facets of you that represent a greater part of your personality, then absolutely include both of them. However, unless your NYT crossword puzzle influencing your taste in authors actually impacted *you*, your personality, your character, or the perception people have of you, which it is unlikely to be, then I don't believe it should be included. To waste 40 words talking about how you got into Brandon Sanderson because of an NYT crossword puzzle is only worth mentioning if his writing inspired you to write a book, or make a game, or start moderating an online discussion board.\n\nThe other two points I want to pull from my essay are: the breaking of rules, and the use of transitional language. I think that the breaking of rules and the use of transitional language are what ultimately separate \"good\" essays from \"great\" essays, and \"great\" essays from \"fantastic\" essays.\n\nOn breaking rules: don't. The point of rules is to follow them.\n\nBut if you're going to break them, do it well.\n\nThe following sentence is an absolute bother to read: \"I was that annoying sort of child, the one who would ask why, and when he got an answer, he would ask why the answer was the answer, and when he got that answer, he would ask why *that* answer was the answer.\"\n\nThis is the sort of sentence that does one of two things, when found in the opening pages of a book: it will cause readers to either put down a book and swear it off forever for an annoying sentence they found on page three, or it will cause them to grip that book tighter than they've gripped a book in six years and fly through it, before rambling on on the internet on the subject of how the book is so perfectly crafted and breaks from tradition in the most clever of ways and blah blah blah.\n\nI'm not saying that my sentence is perfect, but it accomplishes the goal. It is an annoying sentence to read, in an endearing sort of way. Many people relate to this directly, either having been that kid or having known that kid, perhaps having been the older sibling to that kid. Knowing that someone is the sort of person to go down the rabbit hole of \"Why?\" is indicative of so many *other* aspects of their personality, and by mentioning *this* facet of my personality, I've saved myself potentially hundreds of words to give the reader a nearly identical understanding of the sort of person I am.\n\nThis, I know, is what the point of a half-idea is: to express personality efficiently, by presenting behaviors you have or ideas you hold close that are indicative of so much more.\n\nTransitional language is important.\n\nOr, rather, the other important thing to discuss here is transitional language.\n\nTransitional language is not just phrases such as \"Furthermore\", \"in addition to\", or \"conversely\". Transitional language is the utilization of words that allow a reader to smoothly redirect their train of thought from one point to another. It is selecting language that relates to the last sentence of the prior paragraph, but prepares the reader to turn down a new avenue of thought as it relates to your writing. I don't have much to say on this subject besides for the supposition that half-ideas are best predicated within transitional language, or at least I feel that that's the case. When you present a half-idea^^1 at the end of a transitional sentence, you then provide yourself ample room to discuss that half-idea, and then once again combine the closing of the discussion of one half-idea with the transition into the next half-idea. I'm not sure where this could have fit into the OP, but I think it's an important thing to mention.\n\n&nbsp;\n\nI find it doubtful that everyone will agree with everything, or even much of, what I have said here, but I think I'm a skilled enough writer and critical enough of the writing that I do to make my input valuable.\n\n^^1 ^I ^continue ^to ^call ^these ^facets, ^or ^half-ideas, ^or ^what-have-yous ^by ^the ^initially ^supposed ^name ^for ^the ^sake ^of ^reading, ^but ^perhaps ^I ^should ^insist ^on ^facet. ^I'm ^not ^sure ^it's ^important ^enough ^to ^be ^concerned ^about ^it.",
      "author": null,
      "created": 1587223088,
      "upvotes": 2,
      "replies": {
        "fntaquj": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fntaquj/",
          "text": "Interesting. Three thoughts. \n\nMy fun writer self-descriptor is “flamboyant”. Not Flamboyant. Lower-case F. I like it because it means attention seeking, but not in a necessarily positive or negative way. I’ve always seen myself as a “chaotic neutral”, so I dig it. \n\nFacet probably makes more sense than half-idea. But I’m glad you understand why half-idea is the name I went with. Much cooler fake name. \n\nSomething I hope was implied from my post is that there are really three aspects to the type of essay I promote here: both concepts individually and then a third which is how those concepts interact. That third part is I think the real power in creating a compelling topic. While it’s true that simply writing about fishing and your love of game shows makes your essay “unique” -in the same way a box with a candle and a peanut in it is unique - it’s only in describing the way those two concepts interact where I think the magic comes. \n\nYou give yourself a natural advantage by writing about two topics instead of one. Then you multiply that advantage by spending your precious words explaining how those two seemingly unrelated concepts only make sense together because of your perception of them.",
          "author": "CollegeWithMattie",
          "created": 1587237921,
          "upvotes": 2,
          "replies": {
            "fntbj32": {
              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fntbj32/",
              "text": ">You give yourself a natural advantage by writing about two topics instead of one. Then you multiply that advantage by spending your precious words explaining how those two seemingly unrelated concepts only make sense together because of your perception of them.\n\nI agree with the thought being expressed, but I feel that some amount of nuance was missing from the original post. I feel that the relationship between two half-ideas is only pertinent whereupon the relationship is inherently pertinent. I made an active choice to leave out several things that I could have left in, because I view these essays as a sort of snowflake (if you've ever heard of snowflake drafting before). When selecting your half-ideas and your facets, you want as many things that are as closely related as possible without overloading your reader. My approach to science, how it effects my personality, how it is pervasive in my existence, and my willingness to question expectations - both my own and those of others - are all very closely tied together and represent vast swathes of who I am. The fact that I bug hunt in just about every game I play isn't something that expresses more of my personality than anything I mentioned in my essay, I didn't feel, so even though it could be considered unique, I don't think it would have been efficient communication.\n\nThat being said, many teenagers are certainly not hobbyist writers. Many teenagers are not the copy-editor for their school's literary magazine, and many teenagers don't choose to spend huge amounts of time on r/grammar simply to embroil themselves in a learning of language, so it might be more apt to provide students with the basics of essaying - half-ideas roughly being the building blocks of the best essays - and then go into more depth with those who, on a case-by-case basis, appear to have the skill, talent, and interest as a writer to play bonsai with their writing.",
              "author": null,
              "created": 1587238365,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fnqhpxy": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqhpxy/",
      "text": "I also combined a few different passions/interests and had a pretty good essay in the end. I would definitely use this method if I had to write another. Thanks for putting out good advice on this sub!",
      "author": "itsrainingbees",
      "created": 1587164837,
      "upvotes": 1,
      "replies": {}
    },
    "fnqso59": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqso59/",
      "text": "This is definitely what I tried to do! I think the ideas were strong, but the execution wasn’t great. I don’t think I linked the two of them well enough. I wrote better supplements that were just as long, but by then, I had no time left to replace the essay and write more supplements.",
      "author": "Vorpalooti",
      "created": 1587171373,
      "upvotes": 1,
      "replies": {}
    },
    "fnqv688": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqv688/",
      "text": "Amazing. Thank you!",
      "author": "ARK4S",
      "created": 1587172927,
      "upvotes": 1,
      "replies": {}
    },
    "fnqwuqj": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqwuqj/",
      "text": "[deleted]",
      "author": null,
      "created": 1587173980,
      "upvotes": 1,
      "replies": {
        "fnr2jfn": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnr2jfn/",
          "text": "Sorry, bro. They’s classics for a reason.",
          "author": "CollegeWithMattie",
          "created": 1587177750,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fnqykbc": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqykbc/",
      "text": "Please don’t delete this post. I saved it to refer back to it later on this month.",
      "author": "phymathnerd",
      "created": 1587175077,
      "upvotes": 1,
      "replies": {
        "fnr1t68": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnr1t68/",
          "text": "Promise",
          "author": "CollegeWithMattie",
          "created": 1587177257,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fnrqqwp": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnrqqwp/",
      "text": "I can tell the ADHD one would be a VERY interesting read.",
      "author": null,
      "created": 1587198030,
      "upvotes": 1,
      "replies": {}
    },
    "fns0yer": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fns0yer/",
      "text": "I thought this was Shitpost Wednesday bc of the title (and I didn't realize it was already Saturday)",
      "author": "XIIIshafi",
      "created": 1587209044,
      "upvotes": 1,
      "replies": {}
    },
    "fnsn33h": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnsn33h/",
      "text": "This is awesome! This is exactly how my guidance counselor suggested that I write my essay....and many of the selective liberal arts colleges that I got into said that my essay helped! When I met my admissions dean on admitted students day (small school) she said that she remembered me because of my essay. It worked! \n\nIn case anyone is wondering, I wrote about failing two activities at camp that everyone else passed actually boosted my self-esteem, because everyone was cheering for me anyways and this was a big step in helping me overcome my social anxiety. Seems really cliche and un-oroginal but the essay was very well done.  I got to include a lot of imagery about the setting (a park in VA) as well as my feelings (failure, embarrasment) and how I overcame them.",
      "author": "pasinphoebee",
      "created": 1587224964,
      "upvotes": 1,
      "replies": {}
    },
    "fo1q9pa": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fo1q9pa/",
      "text": "This is crazy! My friend who's going to Princeton gave me similar advice to put together two ideas (though he said to go for interesting events/personal characteristics). Doing that got me one of the best essays I've ever written, along with acceptances to my top 3 schools!",
      "author": "ImmuneToBleach",
      "created": 1587438979,
      "upvotes": 1,
      "replies": {}
    },
    "g45u0nu": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/g45u0nu/",
      "text": "my mom says im not funny 😔",
      "author": "thenotesandi",
      "created": 1599337555,
      "upvotes": 1,
      "replies": {}
    },
    "fnqjfjr": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqjfjr/",
      "text": "i did this for my essay! my two half ideas were:\n\n1) i eat my apples weird and\n\n2) i joined cross country for the first time my senior year without ever playing a high school sport and was the worst person on the team\n\ni don’t want to get into too many specifics for personal reasons but it came out really well and helped me get into a ton of honors programs (i think).",
      "author": "bruhyouokay",
      "created": 1587165815,
      "upvotes": 1,
      "replies": {}
    },
    "fnqnlq8": {
      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqnlq8/",
      "text": "[removed]",
      "author": null,
      "created": 1587168240,
      "upvotes": 0,
      "replies": {
        "fnqrmsn": {
          "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnqrmsn/",
          "text": "Nothing like taking someone else’s IP amirite",
          "author": "chumer_ranion",
          "created": 1587170716,
          "upvotes": 1,
          "replies": {
            "fnr4vcv": {
              "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnr4vcv/",
              "text": "May I ask what the troll said? Was he saying he planned to domain snatch something from me? Worked out as it got me to go register a bunch of social media accounts including YOUTUBE ?!!",
              "author": "CollegeWithMattie",
              "created": 1587179347,
              "upvotes": 1,
              "replies": {
                "fnr755p": {
                  "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnr755p/",
                  "text": "https://www.removeddit.com/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/?utm_source=share&utm_medium=ios_app\n\nCheck out the link.  If you ever want to see what someone’s deleted on a reddit thread, copy the link of the post and change the first part of the link from “www(dot)reddit......” into “www(dot)removeddit.....”  This accesses reddit’s cache.",
                  "author": "chumer_ranion",
                  "created": 1587180958,
                  "upvotes": 1,
                  "replies": {
                    "fnr7djv": {
                      "link": "/r/ApplyingToCollege/comments/g37nsu/my_personal_system_for_easily_creating_fun/fnr7djv/",
                      "text": "Oh. I saw that. Didn’t bother me too much. I guess it’s a little stolen valor-ey but I’m OK with people sharing my stuff. I’d just prefer they don’t steal it.",
                      "author": "CollegeWithMattie",
                      "created": 1587181122,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}