{
  "sid": "qkno9m",
  "link": "/r/ApplyingToCollege/comments/qkno9m/how_to_come_off_as_the_academic_type/",
  "title:": "How to come off as 'the academic type'?",
  "text": "I realise this is probably a moot point because I submitted my UC Hicago ED application yesterday, but I have gotten very similar feedback about different parts of my applications from different people:\n\n&#x200B;\n\n'Maybe include how you're also an academic and spend a lot of time studying-- they seem like the kind of school that wants that'\n\n'Why don't you end your video profile \\[which is currently a montage of me climbing mountains and giving haircuts\\] by picking up a textbook or something?'\n\n'I'm not getting cuthroat competitive, nowhere are you talking about academic education'\n\n&#x200B;\n\nFor context, my essays are about Choose Your Own Adventure novels, hair ties, and cheering. I'm pretty confident about both my writing and the value of my ECs and honors, it's just that I think the only thing in my application that properly references me as a student is my transcript (which is pretty solid, an MYP 55/56 and IB 42/45) and maybe my LoRs (which are also actually very holistic if I go off of how my counselor described them to me).\n\n&#x200B;\n\n1. Should I be worried?\n2. Is there anything I can do now? Send in a research abstract as an update in a few weeks or something?\n3. What can I do differently if UC Hicago says no thank you and I have to apply RD somewhere else T-T\n\nI'd be happy to share my essays and documentation with anyone who'd like to take a shot at calming my nerves because I really want to be able to sleep soon.",
  "author": "OMGMadHavoc",
  "created": 1635800388,
  "updated": 1635890224,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hixnb4v": {
      "link": "/r/ApplyingToCollege/comments/qkno9m/how_to_come_off_as_the_academic_type/hixnb4v/",
      "text": "i think your grades speak for themself (themselves?) so i wouldn’t worry\n\nim also orienting my uchicago essays around more fun topics and not academic ones, so at the very least we can get rejected together 💀",
      "author": "pzychological",
      "created": 1635802506,
      "upvotes": 3,
      "replies": {}
    },
    "hiy24mo": {
      "link": "/r/ApplyingToCollege/comments/qkno9m/how_to_come_off_as_the_academic_type/hiy24mo/",
      "text": "1. No. Take it with a grain or more of salt since I’m only a college student (and a first year at that), but there are definitely people here at UChicago who didn’t write super academic essays (some of the essays I’ve read from my classmates are the wackiest shit I’ve ever read tbh, not in a bad way), and there are definitely people whose whole lives aren’t just about academics (as a matter of fact, I think the majority of UChicago students would agree that’s pretty depressing). I get the feeling the people you got feedback from have a very wrong stereotype of UChicago students (which is fair, because to some extent it’s true and we joke about it ourselves). I’d even go as far to argue showing off interesting, non-academic sides of yourself >>> coming off cutthroat competitive. College is about so much more than getting grades, and AOs want students who know that and will make the most of that. Be yourself. \n\n2. You can upload supplementary materials through your portal, including research abstracts. Do that if you *want* to, and you think it would be a positive, substantive addition to your app. If you feel pressured by the need to come off as an “all about academics” type of person, that’s an unnecessary pressure, imo. \n\n3. I’m a general fan of the idea that you should be yourself in your college apps (with certain limitations, ofc). If you do not get into UChicago, there are literally so many confounding variables and just the sheer competitiveness of the process that there’s 0 reason to assume it’s because you weren’t explicitly trying to come off as a bookworm in your essays. Perhaps other essays should not be as “quirky” as the UChicago one, but rather more direct; but that’s about as far as I would go in terms of actively making a difference in the way you approach your apps.  \n\nBest of luck with your results!",
      "author": "rainingsiberiancats",
      "created": 1635808916,
      "upvotes": 1,
      "replies": {}
    },
    "hixr6ej": {
      "link": "/r/ApplyingToCollege/comments/qkno9m/how_to_come_off_as_the_academic_type/hixr6ej/",
      "text": "Hey I could help review your essays!\n\nBut yeah dw if you're not comfortable (esp since essay plagiarism is a thing), but do know I submitted my UChicago app already (could send you proof as well)",
      "author": "PlasticContent6149",
      "created": 1635804129,
      "upvotes": -2,
      "replies": {}
    }
  }
}