{
  "sid": "r2buc4",
  "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/",
  "title:": "out of state… is it worth it?",
  "text": "so this is a bit of an odd post as i’m not actually asking for myself, but rather a friend. let me explain:\n\nso i have a group of online friends (same state, jus different city) and we’re all about to go off to college after this school year. we have one friend in the group, however, that lives actually a few states over. while i haven’t been planning to group up with any of them after i get out of highschool, a few of them are, including the out of state friend. they don’t intend on going to any crazy prestigious school, it’s just some cheap state school— that is if you’re on in state tuition. this is kind of where my issue sets in.\n\nIs going to an out of state college worth it, given the cost? as much as i want my friends to be happy, i can’t help but feel like i should intervene. the cost goes from like 14K (in state) to 40K (out of state) a year. is that really worth it? how hard would that be to pay off? \nany feedback/experience would be greatly appreciated. :)",
  "author": "klassikun",
  "created": 1637891044,
  "updated": 1638206175,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hm3sauk": {
      "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm3sauk/",
      "text": "That's a difference of about 100K over 4 years, so they need to see if they (or their family) can afford the additional expense, and also to try and think what the OOS school gives them that they won't get at their in-state school.",
      "author": "prsehgal",
      "created": 1637891312,
      "upvotes": 4,
      "replies": {
        "hm3tuuw": {
          "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm3tuuw/",
          "text": "they definitely couldn’t afford it as is, but if they got enough from grants/scholarships, they might. They wouldn’t get anything diff from this place tho, it’s just your run of the mill school. specializes in business and education",
          "author": "klassikun",
          "created": 1637892138,
          "upvotes": 1,
          "replies": {
            "hm41sgo": {
              "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm41sgo/",
              "text": "In that case, they should wait until they receive their financial aid package from the OOS school and then decide. Some public schools do give good aid to OOS students, like Pitt, Iowa State, ASU, and UArizona. Your friend can run their school's Net Price Calculator to get an estimate of what you expect.",
              "author": "prsehgal",
              "created": 1637896346,
              "upvotes": 3,
              "replies": {
                "hm6wejx": {
                  "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm6wejx/",
                  "text": "thanks!!",
                  "author": "klassikun",
                  "created": 1637957321,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm3sbf3": {
      "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm3sbf3/",
      "text": "In-state schools aren't necessarily always going to be your cheapest options. Plenty of public and private colleges (though this is more the case for top private schools) have extensive need and merit based aid available for students, and going OOS can end up being cheaper if you're low income\n\nRun the NPC for the schools you're interested in, no one can really give you any blanket answers",
      "author": "freeport_aidan",
      "created": 1637891321,
      "upvotes": 2,
      "replies": {
        "hm3t7mz": {
          "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm3t7mz/",
          "text": "i’m sorry, what does npc stand for..? you make a fair point tho, ig there really isn’t a straightforward answer.",
          "author": "klassikun",
          "created": 1637891795,
          "upvotes": 1,
          "replies": {
            "hm3tfn4": {
              "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm3tfn4/",
              "text": "Net price calculator\n\nIt's basically a financial aid calculator/simulator where you can input your family's financial info and get an estimate of what any particular college will cost",
              "author": "freeport_aidan",
              "created": 1637891915,
              "upvotes": 2,
              "replies": {
                "hm3txzw": {
                  "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm3txzw/",
                  "text": "ah i see, i’ll definitely tell them about it. i can see them getting a lot from grants n stuff if they try. thank you so much",
                  "author": "klassikun",
                  "created": 1637892183,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm46m33": {
      "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm46m33/",
      "text": "Out of state grants & scholarships are usually higher to compensate for the fact tuition is higher. Really depends on what kind of aid they can get. Full ride is the same price in or out of state, & that can be 10 different scholarships put together, not necessarily 1 giant prize. It's hard to gauge what scholarships you'll win though, so tough call unless you know you're the shit.\n\nAlthough side note, I'd never choose a college based on where my friends were going. Make sure it makes financial sense for you & you like their program.\n\nSo I'd make sure the friend really actually considers what's what & isn't joking or fantasizing.",
      "author": "Gamerz1818",
      "created": 1637898940,
      "upvotes": 1,
      "replies": {
        "hm6wayq": {
          "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm6wayq/",
          "text": "grades aren’t the best so i doubt much in scholarships would come in. but neither is their financial situation, so they could make a lot in grants potentially. based on what this thread has told me, they would definitely be able to receive proper funding if they reached out enough.\n\ni am concerned about ur side note tho. they’re definitely fantasizing rn and it just concerns me because i dont want them to be in ruin because they were too busy chasing happiness to acknowledge their future. not sure if i should step in or not, but at the same time, if money isn’t an issue (which it potentially won’t be), then i feel like it’s not really my place to comment on. idk.",
          "author": "klassikun",
          "created": 1637957274,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hm5fepm": {
      "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm5fepm/",
      "text": "I wouldn't worry about it.  When I was in high school, there were very close friends or groups that wanted to go to the same college with each other.  After the acceptances and aid offers came, all those plans went out the door when reality sets in and it time to put down the deposit.",
      "author": "catawba1",
      "created": 1637931784,
      "upvotes": 1,
      "replies": {
        "hm6vnp1": {
          "link": "/r/ApplyingToCollege/comments/r2buc4/out_of_state_is_it_worth_it/hm6vnp1/",
          "text": "i suppose, im just a little paranoid because this friend has a huge issue with fantasizing. currently is making a LOT of questionable future choices for reasons that i still don’t understand.\n\nalthough i highly doubt they’ve spoken to their parents about it, hoping that they can catch wind of it and either a.) get proper student aid, or b.) dissuade them from this. otherwise idk.",
          "author": "klassikun",
          "created": 1637956969,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}