{
  "sid": "r4feyd",
  "link": "/r/ApplyingToCollege/comments/r4feyd/unpopular_opinion_the_magic_in_your_essays_exist/",
  "title:": "Unpopular opinion: the magic in your essays exist predominantly in rough drafts",
  "text": "As we continue to revise constantly over and over, we lose the voice that gave our essays that unique spark. \n\nPeople criticized my UC essays much more than my common app essays even though my UC essays were revised much much more. This was because my UC essays barely had voice.\n\n(If truth be told, my common app essay was barely a second draft. All my stanford essays are rough drafts.)\n\nI feel that this is because people feel like they have a right to criticize something where no voice and/or personality is attached to it. \n\nThis leads me to an important point: stand out so much to the admissions officers that they feel like rejecting you is equivalent to shooting your friend. \n\nDon’t be afraid to be informal and use parentheses and such. In fact, your essays should read like this post. \n\nThen again, this is an unpopular opinion of mine.",
  "author": "diamondhandedapez",
  "created": 1638136349,
  "updated": 1638204340,
  "over_18": false,
  "upvotes": 63,
  "upvote_ratio": 0.91,
  "comments": {
    "hmgasgs": {
      "link": "/r/ApplyingToCollege/comments/r4feyd/unpopular_opinion_the_magic_in_your_essays_exist/hmgasgs/",
      "text": "As with anything, there is a balance",
      "author": "chumer_ranion",
      "created": 1638136408,
      "upvotes": 43,
      "replies": {}
    },
    "hmgc3m2": {
      "link": "/r/ApplyingToCollege/comments/r4feyd/unpopular_opinion_the_magic_in_your_essays_exist/hmgc3m2/",
      "text": "I guess this is good news for me lol. I just used the first draft for pretty much all my supplementals lmao",
      "author": "Snoo_62176",
      "created": 1638136937,
      "upvotes": 12,
      "replies": {}
    },
    "hmgt3yd": {
      "link": "/r/ApplyingToCollege/comments/r4feyd/unpopular_opinion_the_magic_in_your_essays_exist/hmgt3yd/",
      "text": "Personally, I just showed mine to people for grammatical mistakes and such, since my essay was very unique to me, I didn't want it to stray too far from my feelings. \n\nNot sure how that'll turn out, but I thought it was important to present who I am in my applications.",
      "author": "uhbububub",
      "created": 1638144129,
      "upvotes": 7,
      "replies": {}
    },
    "hmgtomz": {
      "link": "/r/ApplyingToCollege/comments/r4feyd/unpopular_opinion_the_magic_in_your_essays_exist/hmgtomz/",
      "text": "It varies- my Common App was an edited first draft while my supps have been edited and reedited and rereedited",
      "author": "sleepkeyichidema",
      "created": 1638144380,
      "upvotes": 5,
      "replies": {}
    },
    "hmhfh35": {
      "link": "/r/ApplyingToCollege/comments/r4feyd/unpopular_opinion_the_magic_in_your_essays_exist/hmhfh35/",
      "text": "Second this. I wrote my cornell essay 3 days before it was due, and revised it twice. (mostly grammar).\n\nMy friend who got into yale scrapped his entire supps the night before and rewrote them in 3 hours no revisions. \n\nWhen he reviewed his admission file, his essays were the main thing that his AO said made him stand out",
      "author": "IwantUCDtotellme1",
      "created": 1638154214,
      "upvotes": 3,
      "replies": {}
    }
  }
}