{
  "sid": "r78h62",
  "link": "/r/ApplyingToCollege/comments/r78h62/duke_pratt_engineering_vs_trinity_arts_and_science/",
  "title:": "Duke: Pratt Engineering vs Trinity Arts and Science?",
  "text": "I am an international applicant, planning to apply RD to Duke (Environmental Science). Which college would be easier to get into (acceptance rate and competition-wise)? Pratt Engineering or Trinity Arts and Sciences? Also, I want to then switch to CS, so can someone please guide me through this? Thank you! :)",
  "author": "Lower-Chard1425",
  "created": 1638454784,
  "updated": 1638477984,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmxndbe": {
      "link": "/r/ApplyingToCollege/comments/r78h62/duke_pratt_engineering_vs_trinity_arts_and_science/hmxndbe/",
      "text": "Environmental Sciences is in Trinity… so that would be the school to apply to.\n\nBut, keep in mind that Duke doesn’t accept by specific major, so you can declare CS (also in Trinity) once you’re there, regardless of what major you indicate interest in on your application.",
      "author": "Strict-Special3607",
      "created": 1638455214,
      "upvotes": 3,
      "replies": {
        "hmxoqnj": {
          "link": "/r/ApplyingToCollege/comments/r78h62/duke_pratt_engineering_vs_trinity_arts_and_science/hmxoqnj/",
          "text": "which is easier: environmental sciences in Trinity or environmental engineering in Pratt? I am open to applying to either one of these, but just wanted to know which one is easier to get into?",
          "author": "Lower-Chard1425",
          "created": 1638455830,
          "upvotes": 1,
          "replies": {
            "hmxppf4": {
              "link": "/r/ApplyingToCollege/comments/r78h62/duke_pratt_engineering_vs_trinity_arts_and_science/hmxppf4/",
              "text": "Neither is easier.",
              "author": "Strict-Special3607",
              "created": 1638456260,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmy3a2h": {
      "link": "/r/ApplyingToCollege/comments/r78h62/duke_pratt_engineering_vs_trinity_arts_and_science/hmy3a2h/",
      "text": "I’m a Duke student studying CS. Pratt and Trinity are both about equally difficult to get into (especially given you’re an international student). The general education requirements for the two schools are very different, so look up the differences between them and pick the school you think you’d enjoy more. \n\nAs for switching into CS: there’s a CS major in Trinity and an ECE major in Pratt. It’s no trouble at all to switch from a different Trinity major to CS, or from a different Pratt major to ECE (majors aren’t capped here, and you can’t even officially declare a major until your sophomore year). Switching from Pratt to Trinity or vice versa is a little more annoying — you have to make up the backlog of general education requirements for the school that you’re switching into, which takes some time — but it’s easy to get approved to do so. Hope this helps.",
      "author": "hyperioncity",
      "created": 1638461886,
      "upvotes": 2,
      "replies": {
        "hmyx62q": {
          "link": "/r/ApplyingToCollege/comments/r78h62/duke_pratt_engineering_vs_trinity_arts_and_science/hmyx62q/",
          "text": "Thank you! Yeah, it helps a lot.",
          "author": "Lower-Chard1425",
          "created": 1638473370,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}