{
  "sid": "r3s17w",
  "link": "/r/ApplyingToCollege/comments/r3s17w/do_you_think_its_a_good_idea_to_take_senior/",
  "title:": "Do you think it's a good idea to take senior english over the summer",
  "text": "I'm a junior rn in AP lang (already took the honors english classes in freshman and soph year) and I'm considering taking english over the summer so I can get my graduation requirement out of the way. However one of my main ECs is editing for lit mags and I've been doing creative writing related activities since middle school. I wanted to get my english req done asap to\n\n1. make room for multivar, since I'm pretty decent at math and am applying for STEM.\n2. avoid atrocious grading bc at my school all english classes beat the crap out of you, no matter how much you like writing and literature.\n\nIf I still show that I like writing even though I don't take a year of english would it look bad?\n\n&#x200B;\n\n&#x200B;",
  "author": "Upset_Breath_7852",
  "created": 1638061930,
  "updated": 1639812971,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmcigp2": {
      "link": "/r/ApplyingToCollege/comments/r3s17w/do_you_think_its_a_good_idea_to_take_senior/hmcigp2/",
      "text": "As a senior, I would suggest not to do that just because senior English teachers can be super helpful with college essays. Of course, it depends on the teachers at your school, but my English teacher gives us lots of free time to work on essays during class and even offers one-on-one meetings to go over them and receive feedback",
      "author": "hananadia",
      "created": 1638063817,
      "upvotes": 2,
      "replies": {
        "hmvswea": {
          "link": "/r/ApplyingToCollege/comments/r3s17w/do_you_think_its_a_good_idea_to_take_senior/hmvswea/",
          "text": "Do you know if all teachers at your school review essays or is it just a few? Bc if it's a few teachers I might as well send them my essays even if I'm not in their class.",
          "author": "Upset_Breath_7852",
          "created": 1638413363,
          "upvotes": 1,
          "replies": {
            "hmxd5jn": {
              "link": "/r/ApplyingToCollege/comments/r3s17w/do_you_think_its_a_good_idea_to_take_senior/hmxd5jn/",
              "text": "I mean if you asked any English teacher at your school I’m sure they would be willing to help",
              "author": "hananadia",
              "created": 1638450060,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmcl7kn": {
      "link": "/r/ApplyingToCollege/comments/r3s17w/do_you_think_its_a_good_idea_to_take_senior/hmcl7kn/",
      "text": "If your summer english class will end up on your transcript then go ahead. You just want to make sure you show 4 years of english because it’s a requirement for most schools. I like the idea because you’ll still be taking a ✨rigorous courseload✨, so it won’t be a red flag.",
      "author": "hard_ish",
      "created": 1638065122,
      "upvotes": 1,
      "replies": {}
    }
  }
}