{
  "sid": "retgg3",
  "link": "/r/ApplyingToCollege/comments/retgg3/tuition/",
  "title:": "tuition",
  "text": "simple question, my parents make too much money for me to qualify for much aid if any at all but won’t be able to pay my tuition. what can i do that doesn’t involve taking out 50,000 dollars in loans every year? i’ve applied to around 15 scholarships so far and have been rejected from all them, i think partly because many of them are need based and i don’t “need” anything. it’s led to me feeling really dejected about the whole process knowing that even if i get into my dream schools i likely won’t be able to go? anyone else facing a similar problem? what can i do?",
  "author": "tobasee",
  "created": 1639329368,
  "updated": 1639514793,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "ho9or4p": {
      "link": "/r/ApplyingToCollege/comments/retgg3/tuition/ho9or4p/",
      "text": ">my parents make too much money for me to qualify for much aid if any at all but won’t be able to pay my tuition\n\nAll too often, people on A2C assume that this is the case, without running NPCs and doing anything beyond FAFSA submissions. Have you actually done that, or are you just assuming that you won't get any aid\n\nIf you have done that, then your options are to\n\n1. Take out those loans (which you won't be able to do on your own, your parents would need to cosign)\n2. Go somewhere cheaper/go to CC and transfer \n3. Look into major merit scholarships from schools themselves ([https://www.reddit.com/r/ApplyingToCollege/comments/oddu24/my\\_story\\_why\\_you\\_yes\\_you\\_need\\_to\\_look\\_at\\_full/](https://www.reddit.com/r/ApplyingToCollege/comments/oddu24/my_story_why_you_yes_you_need_to_look_at_full/)) \n4. Be an Independent student (https://studentaid.gov/apply-for-aid/fafsa/filling-out/dependency)",
      "author": "freeport_aidan",
      "created": 1639329810,
      "upvotes": 10,
      "replies": {
        "ho9puj3": {
          "link": "/r/ApplyingToCollege/comments/retgg3/tuition/ho9puj3/",
          "text": "thank you for the response, i just assumed this based on the efc for my fafsa being around 55k, as for cc thankfully i have a safety which i have already gotten full tuition at maybe i should have specified that i was more worried about all my targets and reaches, and i have applied to merit scholarships at every school that offers them on my list (most of which i’ll hear back from in march) but most of which are very competitive so we’ll see how that turns out. thank you for all the advice, i’ll continue to look more into it 😅",
          "author": "tobasee",
          "created": 1639330242,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ho9odov": {
      "link": "/r/ApplyingToCollege/comments/retgg3/tuition/ho9odov/",
      "text": "1. Apply to U of Alabama, MSU, Iowa (they offer a ton of merit aid)\n2. CC for 2 years, then transfer to your State's Flagship.",
      "author": "Applying_in_2021",
      "created": 1639329664,
      "upvotes": 6,
      "replies": {}
    },
    "ho9r8zl": {
      "link": "/r/ApplyingToCollege/comments/retgg3/tuition/ho9r8zl/",
      "text": "loool im in the same situation. so many big scholarships require financial need but i cant prove it. i just keep applying and hope i get one",
      "author": "pumpkin2500",
      "created": 1639330792,
      "upvotes": 1,
      "replies": {}
    },
    "hoa4d6s": {
      "link": "/r/ApplyingToCollege/comments/retgg3/tuition/hoa4d6s/",
      "text": "1. There’s no reason to attend expensive schools and pay obscene amounts of money if you are footing the loans. Look at state schools\n2.  Merit-based scholarships are a thing, especially at certain schools!",
      "author": "PitifulClerk0",
      "created": 1639335850,
      "upvotes": 1,
      "replies": {}
    }
  }
}