{
  "sid": "r6vumu",
  "link": "/r/ApplyingToCollege/comments/r6vumu/how_should_i_go_about_having_an_inaccurate_school/",
  "title:": "How should I go about having an inaccurate school report?",
  "text": "Really confused about this, I asked my counselor for a copy of it and it seems to have a lot of misinformation in order to make the school look better than it actually is.\n\nThey omit certain restrictions on AP classes, downplay the fact we are an underserved community (Just says we are “economically diverse”), doesn’t mention we are a Title I school, and even lies about having certain AP classes that we don’t even offer. The NMSC info doesn’t have numbers, it just says that there WERE people given awards (only 2 at my school but this isn’t stated in the report) and that the class of ‘22 has finalists despite them not being announced until February. \n\nI’m not sure how to address this. I asked my counselor and didn’t get an answer. I don’t think I should contact colleges because I’m not sure if I’m supposed to acknowledge seeing the school report. Any help or advice? Am I just screwed?",
  "author": "goodjobjamie",
  "created": 1638410645,
  "updated": 1638478140,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmvo5z0": {
      "link": "/r/ApplyingToCollege/comments/r6vumu/how_should_i_go_about_having_an_inaccurate_school/hmvo5z0/",
      "text": "I feel so sorry for you, and relate so hard to this. It's so fucked up cuz they're making the colleges think you had opportunities but were lazy, while in reality it's the exact opposite. u/prsehgal if you could suggest something??",
      "author": "Concerned-gay-guy",
      "created": 1638411322,
      "upvotes": 4,
      "replies": {
        "hmvqwso": {
          "link": "/r/ApplyingToCollege/comments/r6vumu/how_should_i_go_about_having_an_inaccurate_school/hmvqwso/",
          "text": "One approach for u/goodjobjamie would be to address some of these discrepancies in the Additional Information section of their application. But ideally these should be fixed by the counselor only.",
          "author": "prsehgal",
          "created": 1638412510,
          "upvotes": 2,
          "replies": {
            "hmw0egg": {
              "link": "/r/ApplyingToCollege/comments/r6vumu/how_should_i_go_about_having_an_inaccurate_school/hmw0egg/",
              "text": "Would it look bad for me to admit to viewing the school report? I’m not sure if this is taboo for admissions officers",
              "author": "goodjobjamie",
              "created": 1638416716,
              "upvotes": 1,
              "replies": {
                "hmw0z37": {
                  "link": "/r/ApplyingToCollege/comments/r6vumu/how_should_i_go_about_having_an_inaccurate_school/hmw0z37/",
                  "text": "That should be okay - the school report is not supposed to be a confidential document like the recommendation letters.",
                  "author": "prsehgal",
                  "created": 1638416983,
                  "upvotes": 1,
                  "replies": {
                    "hmw121o": {
                      "link": "/r/ApplyingToCollege/comments/r6vumu/how_should_i_go_about_having_an_inaccurate_school/hmw121o/",
                      "text": "ok awesome. how should I go about notifying my ED school? Is it too late?",
                      "author": "goodjobjamie",
                      "created": 1638417023,
                      "upvotes": 1,
                      "replies": {
                        "hmw1byu": {
                          "link": "/r/ApplyingToCollege/comments/r6vumu/how_should_i_go_about_having_an_inaccurate_school/hmw1byu/",
                          "text": "You can email the admissions office to add it to your file.",
                          "author": "prsehgal",
                          "created": 1638417153,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}