{
  "sid": "rhz6qx",
  "link": "/r/ApplyingToCollege/comments/rhz6qx/schools_where_i_would_have_a_good_shot_at/",
  "title:": "Schools where I would have a good shot at scholarships?",
  "text": "Junior. GPA is 4.00, haven’t taken APs yet but planning on taking 6-8 before graduation. No idea on SAT, testing next spring and hoping for 1400+ or 30+ on ACT. My ECs are decent and unusual but don’t have a spike currently. \n\nWhat are some schools that give automatic scholarships based off GPA or test scores? Any schools where these stats would be competitive for merit aid or other scholarships?",
  "author": "XToralesX",
  "created": 1639685854,
  "updated": 1639786210,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "houblf5": {
      "link": "/r/ApplyingToCollege/comments/rhz6qx/schools_where_i_would_have_a_good_shot_at/houblf5/",
      "text": "You should get merit scholarships at some of the less selective members of the AAU (organization of research universities) at a minimum.  That includes schools like Oregon, Iowa, Kansas, Arizona, Missouri, Iowa State, Michigan State, and similar schools. Iowa State and Missouri both have automatic scholarships that are stat based that you can look up.\n\nAlabama, USF, and Arizona State are a few others that have automatic scholarships where they publish the amounts and required GPA/test scores, but there are a lot of options beyond those that will offer merit aid.",
      "author": "BrawnyAcolyte",
      "created": 1639695059,
      "upvotes": 4,
      "replies": {}
    },
    "hottmdb": {
      "link": "/r/ApplyingToCollege/comments/rhz6qx/schools_where_i_would_have_a_good_shot_at/hottmdb/",
      "text": "Generally speaking, the further your stats are from the median applicant the more likely you are to get money.\n\nLook for large, public schools falling roughly outside the top 80 per US News.\n\nGuaranteed merit awards will be purely based on scores/grades.  Competitive ones will be some combination of scores/grades and \"everything else\".  The big ones are often determined by \"everything else\", assuming your scores/grades put you in contention.",
      "author": "jayphoward",
      "created": 1639687846,
      "upvotes": 2,
      "replies": {}
    }
  }
}