{
  "sid": "qz9vg1",
  "link": "/r/ApplyingToCollege/comments/qz9vg1/noninstitutional_scholarships_for_international/",
  "title:": "Non-institutional scholarships for international students",
  "text": "Hi, I’m a junior (3.85UW) right now and my family is high-income, and non US-citizen. They’re willing to pay up to 25k annually for my tuition, but that won’t cover the international student cost for many universities that i would like to apply to (Cal Poly, UCSB). As an international student, how do I go about finding private/non-institutional scholarships? I’ve been searching online but can only find private scholarships for domestic students. Any amount scholarship would be great, so even if the websites you know offer only 50 dollars, please send them my way. \n\nThank you in advance, and sorry for the formatting (mobile).",
  "author": "chaddydaddy15",
  "created": 1637545104,
  "updated": 1637687831,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hllqn7b": {
      "link": "/r/ApplyingToCollege/comments/qz9vg1/noninstitutional_scholarships_for_international/hllqn7b/",
      "text": "From what I heard, scholarships and aid for international students with financial need are hard to come by -- let alone internationals without financial need. You're unfortunately in a really tough spot. Consider other countries that are cheaper (i.e. UK and Europe), or if you really want to study in the US, consider taking out a loan. You might also try less-selective private colleges that offer merit scholarships.",
      "author": "a12435",
      "created": 1637556625,
      "upvotes": 1,
      "replies": {}
    },
    "hll539k": {
      "link": "/r/ApplyingToCollege/comments/qz9vg1/noninstitutional_scholarships_for_international/hll539k/",
      "text": "High ranking Private lib arts colleges have a lot of academic scholarship money for students, always good to check to see what your eligible for",
      "author": "PrizedRadish",
      "created": 1637546008,
      "upvotes": -2,
      "replies": {}
    },
    "hllhzss": {
      "link": "/r/ApplyingToCollege/comments/qz9vg1/noninstitutional_scholarships_for_international/hllhzss/",
      "text": "You can go to so many colleges.",
      "author": "Hairy-Accountant-636",
      "created": 1637552166,
      "upvotes": -2,
      "replies": {}
    }
  }
}