{
  "sid": "quwe14",
  "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/",
  "title:": "Could anyone help out a clueless first gen with their Common App?",
  "text": "I’m a 1st gen applicant in the U.S and my parents don’t speak English. This whole process is new to me so naturally I’m lost as shit. Please explain the steps like I’m 5 if you can \n\nHere’s my current situation:\nI’m working on the Common App and some of the colleges on my list need a manual input of “course & grades.” I’ve taken one college class but it wasn’t dual enrollment. I’ve also taken some AP exams. Do I score report them now or after I’m admitted somewhere? And do I need to send my official transcripts from my HS or community college? If I do, when do I send them? Or is that my counselors job?\n\nHonestly if you could just run me down all the things I need to submit and when I need to, you would be a life saver\n\nThx infinitely",
  "author": "Brthe9876",
  "created": 1637027537,
  "updated": 1637179529,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "hksvxzp": {
      "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hksvxzp/",
      "text": "Your counselor will submit your high school transcripts. In my experience I had to submit all of my college transcripts myself but that could be different for you! As for imputing your grades you need to do that if your colleges require them",
      "author": "ostentatiousfrog",
      "created": 1637029210,
      "upvotes": 3,
      "replies": {}
    },
    "hkth60d": {
      "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkth60d/",
      "text": "hi :) \n\nok so order ur transcript from the cc and just keep it w u for now. AFTER you apply, you'll receive a login to your \"application portal\" for the school. most schools allow you to submit extra files on the portal; if you're able to do that, then upload your cc transcript there! if not, THEN email it to their admissions email. but, either way, wait until AFTER you apply and receive the application portal login.\n\nalso as far as test scores, there's a whole section on the common app titled \"testing\" to report ap scores, sat/act scores, etc! just self-report them now (basically you don't have to pay to send the scores you're just typing them in; after you get in, you'll be asked to submit official scores to make sure that you weren't like lying lol) \n\n if you need any more help please don't hesitate to reach out <3",
      "author": "starshinez05",
      "created": 1637039532,
      "upvotes": 3,
      "replies": {
        "hkthiqt": {
          "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkthiqt/",
          "text": "also, even if your counselor submit your hs transcripts (which they have to regardless), you must still submit \"courses & grades\" IF one/some of your colleges require it. personally, just 1 of the 14 colleges im applying to require them. if i wasnt applying to that one college, i would NOT have to submit c&g on my own. so double check to see if you actually need to do it",
          "author": "starshinez05",
          "created": 1637039739,
          "upvotes": 2,
          "replies": {
            "hkthtt1": {
              "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkthtt1/",
              "text": "and non-dual enrollment classes can't be reported directly in c&g but you should put the college in \"colleges & universities\" under the \"education\" section",
              "author": "starshinez05",
              "created": 1637039918,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hkthq3u": {
          "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkthq3u/",
          "text": "You sure I shouldn’t send official CC transcripts now? \n\nI took my math class last year at a local CC and I’m unable to report the class on the common app because it wasn’t “dual enrollment.” So the only way they’ll see it is through the transcript I think? Sorry I’m so confused lol",
          "author": "Brthe9876",
          "created": 1637039857,
          "upvotes": 1,
          "replies": {
            "hktjh0t": {
              "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktjh0t/",
              "text": "yeah!! if they have a space for you to upload it on the portal, then they probably DONT want u to send it on the email. (you get the portal login within like a few days after you apply which is perfectly within a good timeframe to upload that transcript.) you can, to ease your worries, write a little note in the additional info section and specify that the course that you took at your cc was XYZ101 or whatever lol. but in the education section make SURE to put the community college under colleges and universities",
              "author": "starshinez05",
              "created": 1637040886,
              "upvotes": 2,
              "replies": {
                "hktlcu4": {
                  "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktlcu4/",
                  "text": "Will I get a portal login for every single college I apply to? Even the UCs?",
                  "author": "Brthe9876",
                  "created": 1637042045,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkt2e59": {
      "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkt2e59/",
      "text": "the common app asks for self reported grades and test scores, so make sure you do that right away. if there is a college class involved, start figuring out how you can get a transcript from there because i don't think it will let you submit without it. the common app is now using Xello i think to do transcripts, so you have to add your counselor on xello so that they can submit your transcript. the sooner the better for everything!",
      "author": "fortuitous_rain515",
      "created": 1637032081,
      "upvotes": 0,
      "replies": {
        "hkt2mbp": {
          "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkt2mbp/",
          "text": "Should I submit my official college transcripts now? And will my counselor submit the HS transcript?",
          "author": "Brthe9876",
          "created": 1637032184,
          "upvotes": 1,
          "replies": {
            "hkt3rws": {
              "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkt3rws/",
              "text": "your counselor has the responsibility of submitting your hs transcript. if you can submit an official transcript on your end for the community college, then do it asap because there are processing times and everything. don't delay on important stuff like this!",
              "author": "fortuitous_rain515",
              "created": 1637032708,
              "upvotes": 1,
              "replies": {
                "hkt438n": {
                  "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkt438n/",
                  "text": "Crap. How do I send the official transcript? Do I submit it to all my UCs I’m applying to and private schools?",
                  "author": "Brthe9876",
                  "created": 1637032848,
                  "upvotes": 1,
                  "replies": {
                    "hkta682": {
                      "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hkta682/",
                      "text": "Make sure your high school counselor knows you are applying to your colleges and will submit the transcript. (Each high school has a different process, such as through Naviance or inviting the high school counselor directly from Common App.)\n\nFor the CC, usually there is a way to order a transcript on the CC website.",
                      "author": "elkrange",
                      "created": 1637035741,
                      "upvotes": 1,
                      "replies": {
                        "hktb5dz": {
                          "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktb5dz/",
                          "text": "So if I order my transcripts from my CC now and send them to the colleges I’m applying to, it won’t get lost or anything? I imagine they’ll be reviewing my app months from now, so if I send my transcript now, it won’t accidentally get lost? How will I know they got it?",
                          "author": "Brthe9876",
                          "created": 1637036239,
                          "upvotes": 1,
                          "replies": {
                            "hktc188": {
                              "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktc188/",
                              "text": "It is fine for documents to arrive at a different time from your app. The college will match up the transcript to your file. Don't worry!\n\nAP scores can be self-reported in the Testing section of the Common App. (You will send an official AP score report next summer.)\n\nMost college admission websites have an application \"checklist\" where you can make sure you completed or submitted all the elements of the application.",
                              "author": "elkrange",
                              "created": 1637036698,
                              "upvotes": 1,
                              "replies": {
                                "hktc4ri": {
                                  "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktc4ri/",
                                  "text": "Do I need to send cc transcripts to both private and UC schools?",
                                  "author": "Brthe9876",
                                  "created": 1637036750,
                                  "upvotes": 1,
                                  "replies": {
                                    "hktd3eo": {
                                      "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktd3eo/",
                                      "text": "You need to check your colleges' admission websites.\n\nI believe you don't send a transcript to UCs before admission. The school you attend will receive your final transcript.\n\n(Are you a CA resident?)\n\nMost privates will want your transcript now, but this may vary - check their websites. Schools that require the Courses and Grades section of the Common App might not want it until later, like UCs.",
                                      "author": "elkrange",
                                      "created": 1637037265,
                                      "upvotes": 1,
                                      "replies": {
                                        "hktdcoz": {
                                          "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktdcoz/",
                                          "text": "The thing is, I took my math class last year at CC and it won’t let me log it into Courses & Grades. The only way I can report it is by official transcript I think? Or is there another way?",
                                          "author": "Brthe9876",
                                          "created": 1637037403,
                                          "upvotes": 1,
                                          "replies": {
                                            "hktebc3": {
                                              "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktebc3/",
                                              "text": "I think this page will answer your this question\n\nhttps://appsupport.commonapp.org/applicantsupport/s/article/How-do-I-report-a-college-course-I-took-during-high-school-in-Courses-Grades",
                                              "author": "elkrange",
                                              "created": 1637037924,
                                              "upvotes": 1,
                                              "replies": {
                                                "hktergr": {
                                                  "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktergr/",
                                                  "text": "Thank you. \n\nIt says I don’t need to report the college class if it does not appear in my HS transcript for dual enrollment. So I guess I don’t report it, but would this mean that they won’t see it? \n\nSorry for all the questions, I’m rlly new to this",
                                                  "author": "Brthe9876",
                                                  "created": 1637038172,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hktewjx": {
                                                      "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktewjx/",
                                                      "text": "They will see it if you send the transcript, as you should do.",
                                                      "author": "elkrange",
                                                      "created": 1637038250,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hktaevr": {
          "link": "/r/ApplyingToCollege/comments/quwe14/could_anyone_help_out_a_clueless_first_gen_with/hktaevr/",
          "text": "Whether Xello is involved would depend on the high school. Every high school handles this differently. (High schools in my area do not use Xello, for example. Most in my area use Naviance.)",
          "author": "elkrange",
          "created": 1637035863,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}