{
  "sid": "r3b2ft",
  "link": "/r/ApplyingToCollege/comments/r3b2ft/will_get_my_ed_and_ea_decisions_around_my/",
  "title:": "Will get my ED and EA decisions around my birthday week",
  "text": "title\n\nthat too as an international student who got rejected from pretty much all the US Colleges last year. I am so scared because I absolutely do not want to ruin my birthday this year as well. \n\n&#x200B;\n\nAnyone else in a similar position or?",
  "author": "leena2123",
  "created": 1638009732,
  "updated": 1638205581,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hm9km0t": {
      "link": "/r/ApplyingToCollege/comments/r3b2ft/will_get_my_ed_and_ea_decisions_around_my/hm9km0t/",
      "text": "International Student Who Got Rejected From Every US College They Applied To Last Admissions Cycle So They're Currently On A Gap Year support group 🤝\n\nWishing the best for you though 💙💙 here's to hoping you get a nice surprise on your birthday!!",
      "author": "dominaxe",
      "created": 1638014028,
      "upvotes": 6,
      "replies": {
        "hma18h0": {
          "link": "/r/ApplyingToCollege/comments/r3b2ft/will_get_my_ed_and_ea_decisions_around_my/hma18h0/",
          "text": "Curious to hear how many schools you guys applied to last year. Do you have any tips for internationals applying for the first time? E.g if there was anything you could have done differently the first time, what would it have been? : )",
          "author": "RichCow4107",
          "created": 1638024498,
          "upvotes": 1,
          "replies": {
            "hma8v8q": {
              "link": "/r/ApplyingToCollege/comments/r3b2ft/will_get_my_ed_and_ea_decisions_around_my/hma8v8q/",
              "text": "I only applied to 7 schools last year, and I actually got accepted to one, but it was too expensive for me. Personal tips from my experience:\n\n1. Shotgun to as many schools as you can. Take advantage of those 20 schools for Common App, use Coalition if you have time. Apply to schools without essays if you don't think you can write too many essays\n\n2. Ask for LoRs early!! Teachers r super busy especially during the holidays\n\n3. Start essays as early as you can, even if it's just writing bullet points or word vomits\n\n4. Do early rounds!!!!! Literal game-changer imo\n\n5. Fill out your finaid documents EARLY and BEFORE the deadline. (This is why early rounds are a game-changer, it forces you to have everything ready at an earlier time)",
              "author": "dominaxe",
              "created": 1638028157,
              "upvotes": 3,
              "replies": {
                "hma9wgn": {
                  "link": "/r/ApplyingToCollege/comments/r3b2ft/will_get_my_ed_and_ea_decisions_around_my/hma9wgn/",
                  "text": "Thank you so much! Really appreciate the advice : ) best of luck with your apps, I’m sure you’ll do great 🙏",
                  "author": "RichCow4107",
                  "created": 1638028630,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmahlr9": {
      "link": "/r/ApplyingToCollege/comments/r3b2ft/will_get_my_ed_and_ea_decisions_around_my/hmahlr9/",
      "text": "yo im in the same position lol, my birthday is early december and decisions for gt come out around that time (some say actually on based on previous year timing?), and then ED/EA literally a week later",
      "author": "kouddo",
      "created": 1638032078,
      "upvotes": 1,
      "replies": {}
    }
  }
}