{
  "sid": "rexy8n",
  "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/",
  "title:": "How to adult?",
  "text": "So I'm going to graduate highschool in 2024 and I want to become a psychiatrist however I have no clue what I need to do in order to even become one. There's not a ton of resources that explain it all that well either.\n\nHere's my questions:\nDo you have to major in psychology to become a psychiatrist?\nEveryone seems to drop out of med school sometimes before so is it super hard and scary?\nWhat jobs have you had in med school? (if you're in med school)\nIs premed a major or is it a program that you get alongside of your major?\nHow does college majors even work?\n\nBasically pretend like I'm a stranger who knows absolutely nothing about anything after highschool (well because I am😂😭)\n\nAlso I have no clue where an appropriate reddit group to put all this so please be nice if I have it in the wrong area😭",
  "author": "Agitated_Hearing7642",
  "created": 1639342171,
  "updated": 1639514846,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hobj3qs": {
      "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobj3qs/",
      "text": "One of the best skills you can cultivate in modern life is how to use Google well.\n\nHave you googled, \"How to become a Psychiatrist\"?\n\nThere are multiple different articles in the first page of results.",
      "author": "jayphoward",
      "created": 1639356999,
      "upvotes": 3,
      "replies": {
        "hobnqw0": {
          "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobnqw0/",
          "text": "Yes I understand how to use Google, I was just coming to Reddit to see other people's experiences and advice to becoming a psychiatrist",
          "author": "Agitated_Hearing7642",
          "created": 1639359129,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hobo39m": {
      "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobo39m/",
      "text": "You don't need to major in psych to be a psychiatrist, although many do. Very few people actually drop out of med school (except at caribeen schools) but many many drop being premed. Most people don't have jobs in med school. Premed is not a major, its more of a program but you don't have to apply for it you just sort of tell your university you're premed and they'll work w you.\n\n&#x200B;\n\nYou should try to read up some more on what being premed is, there are tons of good youtube videos too",
      "author": "CH3OH-CH2CH3OH",
      "created": 1639359287,
      "upvotes": 3,
      "replies": {
        "hobq2f2": {
          "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobq2f2/",
          "text": "Thank you😊\nSo of you don't have to major in psych then what should you major in to become a psychiatrist easier? Or can you just major in whatever as long as your in premed?",
          "author": "Agitated_Hearing7642",
          "created": 1639360206,
          "upvotes": 1,
          "replies": {
            "hobq6k7": {
              "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobq6k7/",
              "text": "you can major in whatever you want as long as you're premed. Although if you like psychology enough to want to be a psychiatrist it seems natural for you to major in",
              "author": "CH3OH-CH2CH3OH",
              "created": 1639360259,
              "upvotes": 2,
              "replies": {
                "hobr7es": {
                  "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobr7es/",
                  "text": "Awesome, so when your in med school that's when you start on becoming a psychiatrist. Is getting into med school difficult?",
                  "author": "Agitated_Hearing7642",
                  "created": 1639360730,
                  "upvotes": 1,
                  "replies": {
                    "hodnq5g": {
                      "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hodnq5g/",
                      "text": "getting into med school is VERY difficult. Only 40% of all applicants get admitted every year, and it is a lot of work to be a competitive applicant. Don't let that discourage you but its a ton of work",
                      "author": "CH3OH-CH2CH3OH",
                      "created": 1639403993,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hobrpi7": {
      "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobrpi7/",
      "text": "You don't need to major is psychology. it's best if you just major in whatever you're in interested in. however, if you do major something in science, it's a lot easier to knock the prereqs out of the way since they'll be in your degree plan. before you apply to med school, you have to take the MCAT around your junior year of university. this is because you typically apply to med school a year before you actually graduate. you need to have a lot of extracurricular activities (mostly just volunteering). some things that would help boost your application would be having a leadership role and being in clubs. you also need to have clinical experience to show that you're actually interested in being a doctor, you do this by shadowing. \n\nI dropped out of premed, mostly due to covid. I was already behind on my extracurriculars activities and shadowing hours since no one was able to do them. I felt like I was at a disadvantage, so I switched over to nursing. \n\nas for college majors, it's basically the field that you'll be studying. in your first few semesters you'll be doing the university's core curriculum then after you'll get more courses dedicated to your major. \n\nhope this helps!",
      "author": "megaanutt",
      "created": 1639360961,
      "upvotes": 2,
      "replies": {
        "hobtiym": {
          "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobtiym/",
          "text": "This helps a lot, thank you😊",
          "author": "Agitated_Hearing7642",
          "created": 1639361792,
          "upvotes": 1,
          "replies": {
            "hobu8gb": {
              "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hobu8gb/",
              "text": "no problem, let me know if you have any other questions! :)",
              "author": "megaanutt",
              "created": 1639362109,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hocewb7": {
      "link": "/r/ApplyingToCollege/comments/rexy8n/how_to_adult/hocewb7/",
      "text": "Sounds like you might be looking for a \"hero license.\" AKA, if there's something cool you want to do, and you don't personally know anyone who does it, it can seem like there are insurmountable barriers to reaching this goal because you don't have clear examples of where to start.\n\nInternet research is useful! Articles like [this one](https://www.goodtherapy.org/for-professionals/personal-development/become-a-therapist/article/psychiatry-101-how-to-become-psychiatrist) and [this one](https://www.gcu.edu/blog/psychology-counseling/how-become-psychiatrist) can give you useful starting tips on what steps go into being a psychiatrist. However, if you don't know anything about becoming a doctor, then even something seemingly straightforward like \"take the MCAT\" can lead to dozens of other questions (how well do I need to do on the MCAT? What will I need to study for? How do I sign up?) Those questions are useful too, and you can search for the answers once you've broken up your big question into smaller ones. \n\nKeep in mind that pretty much any psychiatrist must start out with the same steps any aspiring doctor would—i.e., taking the required premed classes, applying and attending medical school, completing rotations in many fields of medicine, and doing a residency. Also, many psychiatrists start off interested in a different field of medicine before eventually deciding on psychiatry is a discipline (psychiatry is one of the *slightly* less well-paying medical specialties, and it can be emotionally taxing, so it'll be less competitive than trying to go into dermatology or something.)\n\nThe bigger questions on course selection and medical school can be answered by your college advisors (my first college had an advisor just for potential premeds), and what psychiatry is like can be answered by interviewing psychiatrists and some general practitioners who prescribe meds for mental illness. But since you're so early on your journey, I wouldn't recommend reaching out to random doctors and asking about their days yet necessarily—start with what's offered at your high school and future college options and go from there.\n\nAs for your other questions:\n\n\\-Do you have to major in psychology to become a psychiatrist? **A resounding no.**\n\n\\-Everyone seems to drop out of med school sometimes before so is it super hard and scary? **Med school is a lot of work, but there's an adage that \"it's harder to get in than to graduate.\"**\n\n\\-What jobs have you had in med school? (if you're in med school) **Most med students are primarily focused on their studies and will work either as lab assistants/TAs or in jobs meant to pay off their student debt. Work experience in non-medical roles is not that useful except financially.**\n\n\\-Is premed a major or is it a program that you get alongside of your major? **In the U.S., it's just a set of undergraduate courses (some bio, chem, english, math maybe 1 physics/biochem/psych class) that leave you \"qualified\" to attend most U.S. medical schools.**\n\n\\-How does college majors even work? **Premed is not a college major. \"Major\" means the subject many of your classes were centered around.**",
      "author": "self_composed",
      "created": 1639372113,
      "upvotes": 2,
      "replies": {}
    }
  }
}