{
  "sid": "rex6v6",
  "link": "/r/ApplyingToCollege/comments/rex6v6/do_you_struggle_with_maintaining_passion/",
  "title:": "Do you struggle with maintaining passion?",
  "text": "I used to love my ECs. Now? Not so much. I find them as additional nuisances, additive factors to my stress, and generally just not fun. The reason for which is combination of toxic people, poor mental health, and eagerness to try new things; I've never been one for sticking to a single activity. For instance, I've played 4 separate instruments over the span of 6 years, always finding dissatisfaction with one of them for various reasons. The hobby I genuinely love doing (watching and writing about movies) is not necessarily \\*prime\\* for college applications nor is it a \\*skill\\* for the real world. \n\nAs for my common app activities, I've lost my love for competitive debate, contribute the bare minimum to the school newspaper, and do just enough on my internship to not make my supervisor fire me lol. I'm in a passion slump. \n\nMy question is how does one maintain passion? It's simple and honestly quite stupid. But, I'm struggling with it.",
  "author": "AyaanTheIon",
  "created": 1639339945,
  "updated": 1639514369,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 1.0,
  "comments": {
    "hoakkw9": {
      "link": "/r/ApplyingToCollege/comments/rex6v6/do_you_struggle_with_maintaining_passion/hoakkw9/",
      "text": "first off, dont discredit your true hobby. i wrote one of my supp essays about a movie that impacted me so i wouldnt throw it out of the equation. also its just a hobby. it doesnt actually have to be *practical* in any way. if it makes you happy, it is fulfilling its duty. its rlly a toxic societal idea that everything we do has to be “productive” in nature. this mindset is how you get burnt out. im sure there are certain activities you actually dont enjoy but some of these are probably due to being burned out due to stress and stuff. take some time to just like. reset ur mind lol. watch some movies and relax. once youve recovered from ur burn out you will probably enjoy the ECs you once did , and if you still dont, then simply quit and devote ur time to stuff you actually wanna do like writing about movies.",
      "author": "autumnhong",
      "created": 1639342229,
      "upvotes": 7,
      "replies": {}
    },
    "hoagjua": {
      "link": "/r/ApplyingToCollege/comments/rex6v6/do_you_struggle_with_maintaining_passion/hoagjua/",
      "text": "Sometimes when you find it difficult to be passionate about something it means you're legitimately not that interested in that thing.",
      "author": "jayphoward",
      "created": 1639340617,
      "upvotes": 2,
      "replies": {
        "hoagpmz": {
          "link": "/r/ApplyingToCollege/comments/rex6v6/do_you_struggle_with_maintaining_passion/hoagpmz/",
          "text": "when is it too late to try something new?",
          "author": "AyaanTheIon",
          "created": 1639340685,
          "upvotes": 1,
          "replies": {
            "hoajyvo": {
              "link": "/r/ApplyingToCollege/comments/rex6v6/do_you_struggle_with_maintaining_passion/hoajyvo/",
              "text": "Never!\n\nHowever, for the purpose of college admissions, you generally want to demonstrate a sustained commitment to something.",
              "author": "jayphoward",
              "created": 1639341986,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hob1qd2": {
      "link": "/r/ApplyingToCollege/comments/rex6v6/do_you_struggle_with_maintaining_passion/hob1qd2/",
      "text": "I started off with my activities because I loved them. With all the outside pressure to do really good and win in the ECs, sometimes I find myself resenting my activities. But in the end I just remind myself why I started doing those activities, and that helps.",
      "author": "uhbububub",
      "created": 1639349260,
      "upvotes": 1,
      "replies": {}
    }
  }
}