{
  "sid": "qti3ie",
  "link": "/r/ApplyingToCollege/comments/qti3ie/how_many_uc_csus_should_i_apply_to_in_total/",
  "title:": "How many UC + CSUs should I apply to in total?",
  "text": "So im definitely applying to all UCs except berkeley (low admissions chance, dont really think id like it anyways, so UCLA is my only real reach school)\n\nIm just wondering, how many cal state schools should I apply to? Or are UC riverside, merced, and santa cruz good enough for safety schools? I feel like 8 + possibly San diego state, cal poly slo & pomona, + a safety cal state is too much. But I feel like I should apply to those cal state schools I mentioned just so i have better chances at being accepted into a target school rather than something like San Jose state as a safety\n\nGpa is 3.6 UW, a-g UC/CSU gpa is like 4.02, 7 ap courses taken, eh ECs\n\nMajor is Psych and alternate major is Bio",
  "author": "authenticfennec",
  "created": 1636864542,
  "updated": 1637180746,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkjs7zq": {
      "link": "/r/ApplyingToCollege/comments/qti3ie/how_many_uc_csus_should_i_apply_to_in_total/hkjs7zq/",
      "text": "Is money a problem? Because I would see if you get the fee wavier then make the decision. \nIf money is not a problem I would only apply to schools you really want to go to. Research the schools and the programs. Do you like what they have to offer? Do you like the area? Would you be willing to move there? \n\nHonestly if you’re going to be paying that much you might as well like it or love the major/program. \n\nCollege advising is what I do for work right now so if you want more specifics message me and I can help. \nGood luck!!",
      "author": "aplumptomato",
      "created": 1636865290,
      "upvotes": 1,
      "replies": {
        "hkk0w4i": {
          "link": "/r/ApplyingToCollege/comments/qti3ie/how_many_uc_csus_should_i_apply_to_in_total/hkk0w4i/",
          "text": "For UC schools i cannot get a fee waiver. I have a part time job that i make a decent amount from for only working 20-30 hours, but father makes a lot of money so despite him not living with me nor supporting me financially for college apps it doesnt matter to the UC system. Idk how it works for Cal state",
          "author": "authenticfennec",
          "created": 1636869981,
          "upvotes": 2,
          "replies": {
            "hktstib": {
              "link": "/r/ApplyingToCollege/comments/qti3ie/how_many_uc_csus_should_i_apply_to_in_total/hktstib/",
              "text": "It’s similar for cal state so if you won’t get it for one you probably won’t for the other. \nAre you willing to spend $2000ish on applications? Because that sounds about what the estimate would be from the schools you listed. If you are then cool, I just like to let people know it adds up quick.",
              "author": "aplumptomato",
              "created": 1637047179,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkju06b": {
      "link": "/r/ApplyingToCollege/comments/qti3ie/how_many_uc_csus_should_i_apply_to_in_total/hkju06b/",
      "text": "1.  Is money for app fees an issue?  If not, it opens up more opportunities for you. \n2.  If you got in, would you actually go to these schools?\n\nUC admissions is so mercurial and unpredictable. Last year kids I thought would get into certain schools did not. Our school valedictorian was rejected from CSU San Jose while others got in. \n\nIf you are ok with the location and think you can thrive there and if money isn’t an issue, I would cast your net wide.",
      "author": "TwoSuns168",
      "created": 1636866179,
      "upvotes": 1,
      "replies": {
        "hkk168c": {
          "link": "/r/ApplyingToCollege/comments/qti3ie/how_many_uc_csus_should_i_apply_to_in_total/hkk168c/",
          "text": "I have saved up money from my job specifically to pay for 8 school fees, and could technically afford to pay more although it just wouldn't be very ideal. Cant get a fee waver for UC but idk how fee wavers differ for the CSU apps. And thank you for the advice",
          "author": "authenticfennec",
          "created": 1636870152,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkjvar3": {
      "link": "/r/ApplyingToCollege/comments/qti3ie/how_many_uc_csus_should_i_apply_to_in_total/hkjvar3/",
      "text": "Major?",
      "author": "toyota2003",
      "created": 1636866838,
      "upvotes": 1,
      "replies": {
        "hkk0kk2": {
          "link": "/r/ApplyingToCollege/comments/qti3ie/how_many_uc_csus_should_i_apply_to_in_total/hkk0kk2/",
          "text": "Psych and my alternate major is bio",
          "author": "authenticfennec",
          "created": 1636869794,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}