{
  "sid": "q6iqzo",
  "link": "/r/ApplyingToCollege/comments/q6iqzo/rant_but_i_beg_for_advice_should_i_explain_my/",
  "title:": "[Rant, but I beg for advice!] should i explain my teacher's divergent grading system through commonapp??",
  "text": "My school has an IB program and most of the teachers solely use questions from past IB exams on their tests. The grade boundaries for the official IB exams come out and, for many of the classes, a 65% tends to be at least a 5 out of 7 (good score). Almost all of the teachers curve our raw test scores to reflect our rough equivalent if it were the IB exam by using the grade boundaries posted, but one teacher (ironically, a stats teacher) refuses. All the students have understood that it's his class so we shouldn't be rude since he's chosen his own methods, but, after explaining our confusion, he wouldn't change. \n\nThe most recent grade boundaries for his specific class showed a 42% being a 4/7 (roughly \"passing\") and 71% being 6/7 (GREAT score) yet getting a 71% on his quarter exams, made completely from past IB exam questions (he said this directly), results in a C final score since the only other assignments worth comparable amount of points are other tests. So, why is there a C in the gradebook if i'd get a near perfect score on the actual exam (and possible college credit). Im just worried about my transcript and how it will look to colleges since I feel as though i'll end with all A's and a C in this semester of senior year.... \n\nI understand every school is different and this may be the norm in other schools so im not saying anyone is flat out wrong but its something that his students and I feel resulted in a disjointed transcript and are worried about. Anyone have ideas?? I'll probably just put up with it but idk I wanted to rant in case anyone else thinks this is odd. thank you!",
  "author": "jinsmangoricbe",
  "created": 1634032849,
  "updated": 1634072791,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgce8ct": {
      "link": "/r/ApplyingToCollege/comments/q6iqzo/rant_but_i_beg_for_advice_should_i_explain_my/hgce8ct/",
      "text": "You could explain it, but colleges will look at the stats for that course in your school and see what the grades for the class usually look like, which will clue them in that something is different about this course because everyone is getting Cs.",
      "author": "A2CSimp69420",
      "created": 1634039612,
      "upvotes": 5,
      "replies": {
        "hgdze52": {
          "link": "/r/ApplyingToCollege/comments/q6iqzo/rant_but_i_beg_for_advice_should_i_explain_my/hgdze52/",
          "text": "tysm!!",
          "author": "jinsmangoricbe",
          "created": 1634065132,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}