{
  "sid": "qwcu6q",
  "link": "/r/ApplyingToCollege/comments/qwcu6q/how_much_and_when_can_i_reasonably_let_my_grades/",
  "title:": "How much and when can I reasonably let my grades drop?",
  "text": "I finished quarter 1 pretty much on par with my 3.97 (all As and two A-s). Im applying to like two schools RD that I actually want to get into. Will they know what I got for 2nd quarter too? Will my EA schools know what I got 2nd quarter too? Will any school know what grades I get for 3rd and 4th quarter? If they do see anything beyond this how much can I let them slip? Hardest schools to get into are Middlebury, Colorado College, and Colby. Others are Boulder, UVM, and UMASS, which I may end up going to even if I get into my reaches. Any gage for how much I can let my grades drop based on school selectivity?",
  "author": "skinnnyjimmmy",
  "created": 1637194507,
  "updated": 1637353599,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl24vb6": {
      "link": "/r/ApplyingToCollege/comments/qwcu6q/how_much_and_when_can_i_reasonably_let_my_grades/hl24vb6/",
      "text": "RD colleges and EA colleges that defer you to RD will receive midyear transcripts, which presumably include Q1 and Q2 grades for you. Try to keep those grades as similar to your previous grades as possible. Only the college you commit to will receive final transcripts that include Q3 and Q4 grades, and those can be low enough to just avoid being rescinded. Common wisdom is to avoid more than one C and avoid any Ds for top colleges.",
      "author": "rainingsiberiancats",
      "created": 1637195751,
      "upvotes": 2,
      "replies": {}
    },
    "hl272bq": {
      "link": "/r/ApplyingToCollege/comments/qwcu6q/how_much_and_when_can_i_reasonably_let_my_grades/hl272bq/",
      "text": "Everyone will eventually  “know” if you enroll. Every school requires a final transcript. A D, or a string of Cs, might be an issue after accepting an offer.\n\nED/EA decisions will be based on Junior year grades, plus first quarter/trimester if requested/sent.\n\nRD will be include through mid-year, based on the mid-year update, usually 1 semester, 2 quarters, or two trimesters if early enough.",
      "author": "RichInPitt",
      "created": 1637196766,
      "upvotes": 1,
      "replies": {}
    }
  }
}