{
  "sid": "qhn38f",
  "link": "/r/ApplyingToCollege/comments/qhn38f/need_some_help_for_the_why_gettysburg/",
  "title:": "Need some help for the \"Why Gettysburg\" supplemental essay!",
  "text": "&#x200B;\n\nthe deadline is v near and i need some solid points i can include in the essay, like impressive professors, totally distinctive programs, or sth like that. any current student from burg, drop some points pls.",
  "author": "mojitto88",
  "created": 1635427780,
  "updated": 1645853296,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hidsvnr": {
      "link": "/r/ApplyingToCollege/comments/qhn38f/need_some_help_for_the_why_gettysburg/hidsvnr/",
      "text": "This is a diy situation homie",
      "author": "chumer_ranion",
      "created": 1635430475,
      "upvotes": 8,
      "replies": {
        "higrekn": {
          "link": "/r/ApplyingToCollege/comments/qhn38f/need_some_help_for_the_why_gettysburg/higrekn/",
          "text": "yikes",
          "author": "mojitto88",
          "created": 1635475365,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hidx6bg": {
      "link": "/r/ApplyingToCollege/comments/qhn38f/need_some_help_for_the_why_gettysburg/hidx6bg/",
      "text": "Why Gettysburg? Because our nation was conceived in Liberty and dedicated to the proposition that all are created equal. Because we have tested whether that nation, or any nation so conceived and so dedicated, can long endure. Because we dedicated a portion of a nearby field as a final resting place for those who gave their lives that that nation might live. Because it is altogether fitting and proper that we should do this.\n\nBut, in a larger sense, because we can not dedicate -- we can not consecrate -- we can not hallow -- that ground. The brave men, living and dead, who struggled there, have consecrated it, far above our poor power to add or detract. Because while the world will little note, nor long remember what we say here, it can never forget what they did here. Because it is for us the living, rather, to be dedicated to the unfinished work which they who fought there have thus far so nobly advanced. It is rather for us to be there dedicated to the great task remaining before us -- that from those honored dead we take increased devotion to that cause for which they gave the last full measure of devotion -- that we here highly resolve that these dead shall not have died in vain -- that this nation, under God, shall have a new birth of freedom -- and that government of the people, by the people, for the people, shall not perish from the earth.\n\nSo in summary, why NOT Gettysburg?",
      "author": "minimuminfeasibility",
      "created": 1635432277,
      "upvotes": 3,
      "replies": {
        "higrhkq": {
          "link": "/r/ApplyingToCollege/comments/qhn38f/need_some_help_for_the_why_gettysburg/higrhkq/",
          "text": "yes! thanks",
          "author": "mojitto88",
          "created": 1635475405,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hr1qxmi": {
      "link": "/r/ApplyingToCollege/comments/qhn38f/need_some_help_for_the_why_gettysburg/hr1qxmi/",
      "text": "there's a why gettysburg essay...?",
      "author": "AdMobile6985",
      "created": 1641195920,
      "upvotes": 1,
      "replies": {
        "hsp5yla": {
          "link": "/r/ApplyingToCollege/comments/qhn38f/need_some_help_for_the_why_gettysburg/hsp5yla/",
          "text": "maybe it's for ED/EA only. I didn't see one either",
          "author": "Parking-Ad-3030",
          "created": 1642204715,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}