{
  "sid": "qwyg7o",
  "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/",
  "title:": "College Application",
  "text": "I applied to the University of Houston Main Campus last month. Specifically the Cullen College of Engineering for computer engineering and electrical engineering. I got my decision letter yesterday and they have denied my acceptance. My question is, could I apply again for the same term (Fall 2022) on Apply Texas? By the way, on my previous application, I submitted my SAT test score (which I thought we be sufficient according to online searches for requirements) This time, if possible, I will go test optional. I applied using Common App before and the option to apply for regular decision at UH is available on Apply Texas. Would the application go through and still be reviewed or will it be rejected again because I sent it again, even after the previous decision? I have two sibling that got accepted into the college of engineering and not me. I just feel saddened about their decision because I know that if they holistically reviewed it, they would see that I am pretty fit for the school. I respect their decision, but I am just getting a little angry as to exactly why. They do state that my \"academic credentials did not meet the admissions requirement.\" That's what they say and nothing further. It would be helpful for a real letter saying the real reason. Just to add, they have an admissions appeal that I can do in January, but I feel like it's too late by then because I have applied to other colleges that will give me a decision later in December.",
  "author": "FireNinja743",
  "created": 1637266327,
  "updated": 1637353155,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl64lbs": {
      "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl64lbs/",
      "text": ">could I apply again for the same term (Fall 2022) on Apply Texas?\n\nNo.",
      "author": "Strict-Special3607",
      "created": 1637269671,
      "upvotes": 5,
      "replies": {}
    },
    "hl65hwq": {
      "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl65hwq/",
      "text": ">It would be helpful for a real letter saying the real reason.\n\nUnfortunately, the reason they gave you IS the real reason… you won’t get anything more detailed than that.\n\nUltimately, the way to think about it is like this: you weren‘t “rejected” per se, but rather they accepted others who were more highly qualified instead. I know that sounds semantic, but that’s the reality.\n\nSchools don‘t actually “reject” students… they accept students until they run out of spots. Then they notify everyone else that they haven’t been accepted.",
      "author": "Strict-Special3607",
      "created": 1637270039,
      "upvotes": 4,
      "replies": {
        "hl67nni": {
          "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl67nni/",
          "text": "Do you think they would give me their requirements for admission? I'm sure I was no less qualified than my siblings, but everyone is different I guess.",
          "author": "FireNinja743",
          "created": 1637270906,
          "upvotes": 1,
          "replies": {
            "hl69h7n": {
              "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl69h7n/",
              "text": "No, they won't. If they gave you the requirements for admission, then they would have to do so for everyone which defeats the purpose of the entire application process. Best of luck with the appeal process!",
              "author": "kaelrin",
              "created": 1637271634,
              "upvotes": 4,
              "replies": {
                "hl6d7i8": {
                  "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl6d7i8/",
                  "text": "Thanks!",
                  "author": "FireNinja743",
                  "created": 1637273141,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl65gr4": {
      "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl65gr4/",
      "text": "You can’t apply twice to the same school in the same admissions cycle, once you’re rejected from a school you’re rejected for this year",
      "author": "myfedoraismlg",
      "created": 1637270026,
      "upvotes": 3,
      "replies": {
        "hl67wps": {
          "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl67wps/",
          "text": "Well that's disheartening. I'll submit an admission appeal in January when it opens. Hopefully I might be the 25% of appeals that get accepted.",
          "author": "FireNinja743",
          "created": 1637271005,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hl6i6vw": {
      "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl6i6vw/",
      "text": ">\"academic credentials did not meet the admissions requirement.\"\n\nUpon further reflection, it is interesting that they stated it this way.\n\nMost schools provide an even more vague “we receive applications from many candidates and  need to make difficult decisions….” blah blah blah. With those letters, you really don’t know anything.\n\nIs is possible tnat there is actually some specific objective criteria that you don’t meet? Number of high school units in certain subjects, specific math/science course requirements for engineering. minimum high school GPA, etc? Is there anything “negative” on your application: suspension, disciplinary issues, cheating, etc?\n\nUnfortunately, the wording of the letter does not bode well for an appeal: if you ”do not meet the admissions requirements” currently… an appeal would likely only be successful if the requirements change or they specifically decide to relax them for you.",
      "author": "Strict-Special3607",
      "created": 1637275220,
      "upvotes": 3,
      "replies": {
        "hl7430z": {
          "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl7430z/",
          "text": "I agree with you on the way they worded their reason for denial. They should have expanded on that more. Seems like I completely missed the mark in their words. I quote their exact words about their decision for the majors I chose \"You were considered for *all* desired majors provided:\"  \nComputer Engr, BSCPE  \nComp Engr Tech, BS  \nExploratory Studies, DEG U\n\nThe first two were my main choices for majoring in and the third one was just there because I did not want to choose any other ones that they provided, which were education, language, history, and all those other things. I'm not even sure why they didn't even accept me for exploratory studies. Anyways, they continue to say \"after careful consideration, we regret to inform you that we are unable to offer you admission to the University of Houston. I honestly find that hard to believe but I'm not the one to decide so that just angers me a little. I wouldn't be applying to this university if I knew I didn't have a decent chance. When they say that my academic credentials did not meet the requirement, they then say that I should \"Contact the Office of Admissions for more details.\" Which I did. I contacted them yesterday and they replied more or less blandly with \"Unfortunately, I am not at liberty to discuss admissions details through email.\" I don't exactly see why an email is insecure but I guess they'd want a more person-to-person interaction. I scheduled a virtual appointment with them on December 2. To respond to your question if I had any issues with conduct or grades, I have never had any suspensions or disciplinary issues or cheated at all. And I'm pretty sure I took all my science, math, social studies, and English classes necessary for my 4 years. My grades were not good my freshman year but they shot up through my sophomore and junior year, and now my senior year. My GPA never dropped once in the semesters, only gained. So I don't see why they wouldn't like a student that is capable of improving substantially. I did not go test-optional this time even though it was an option to do so. I submitted my SAT score. I thought it was to their standards and in my opinion, I think it was a subpar score but I think it was sufficient for the application. Even then if they did not like that score, it really should not have negatively impacted the decision if they reviewed my application thoroughly. In their decision letter, they seemed to only talk about \"academic credentials.\" I can't say for sure if they just had an automatic denial letter template saying all of this or they really did carefully review my application and I did not qualify. Towards the end of the letter, they say \"If you believe there are extenuating circumstances and factors that should be considered as part of your admissions application, you may consider appealing your admissions decision.\" I am 100% making an appeal, but the appeals start all the way in January which is kind of late to me. I already applied to other universities and the decisions for those are coming within December. I feel like an appeal should just be open immediately rather than having to wait for it. At this point, I am just ranting and I just can't get this decision over my head at the moment. I will be contacting the office of admissions again and actually try and get a representative to speak with. I want answers! They said to contact them on the letter for more details, so I should be getting more details. Thanks for reading along and replying to this if you're still there. Appreciate your opinion.",
          "author": "FireNinja743",
          "created": 1637285066,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl6yf7i": {
      "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl6yf7i/",
      "text": "No, you can’t reapply to the same school for the same term, using a different application.",
      "author": "RichInPitt",
      "created": 1637282426,
      "upvotes": 2,
      "replies": {
        "hl7487d": {
          "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl7487d/",
          "text": "What happens if I do though? I looked at Apply Texas and the option to apply is still there.",
          "author": "FireNinja743",
          "created": 1637285134,
          "upvotes": 1,
          "replies": {
            "hl75oui": {
              "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl75oui/",
              "text": "They’ll probably see your name, realize that you’ve already applied, and it throw it out",
              "author": "carlyc999",
              "created": 1637285799,
              "upvotes": 2,
              "replies": {
                "hl75xmt": {
                  "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl75xmt/",
                  "text": "True. Oh well, the appeal in January will be my only hope. Otherwise, transfer in later. . .",
                  "author": "FireNinja743",
                  "created": 1637285913,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl6z1r0": {
      "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl6z1r0/",
      "text": "Houston is one of few schools that actually publish academic requirements. The “did not meet admission requirements“ is much more specific than the general wording. Did you miss the application deadline for specific items, or not meet the documented requirements? Including the specifics for the Engineering school?\n\n[https://uh.edu/undergraduate-admissions/apply/freshman/](https://uh.edu/undergraduate-admissions/apply/freshman/)",
      "author": "RichInPitt",
      "created": 1637282717,
      "upvotes": 2,
      "replies": {
        "hl75qc5": {
          "link": "/r/ApplyingToCollege/comments/qwyg7o/college_application/hl75qc5/",
          "text": "To respond to your question with the deadline and submitting documents on time, yes I did. I applied for early action and did so before the deadline. Also this link here shows the requirements for freshman admissions supposedly. I am quite sure my school does not rank and that I am not in the top 50% of my class either way (although I am by no means dumb or have bad grades - My grade is very smart, smarter than the years before). They do state that if you have no rank or are not in the top 51%, they will individually review the application and that the test score is not set in stone for a deciding factor. This applied to submitting a test score and not submitting a test score. I chose to submit a test score and I don't think it was that bad in my opinion, but it was not the greatest. For GPA, it's blank and they say individual review. I still think it's crazy that if you are in the top 10% of your class, the GPA and test score do not matter whatsoever. That's pretty unfair considering that some schools have a lot more competitive environments than others. Some schools have actual dummy grades and people can be top 10%. In my case, (I go to a private high school btw), everyone in my class is smart and pretty competitive at the top. I don't compete with the top people so the top 10% rule i ruled out for me automatically. I had below-average grades my freshman year, but in my sophomore and junior year, my grades increased so much. I'm talking 1-1.2 points higher in GPA. It stayed like that and none of the semester through my 3 years that I self-reported show my GPA dropping, only increasing. Currently, my senior year grades are looking great too. Anyways, I'm just looking for an in-depth answer here from the office of admissions, and I will have to contact them again. Thanks for sticking along if you're still following.",
          "author": "FireNinja743",
          "created": 1637285818,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}