{
  "sid": "ri6dq3",
  "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/",
  "title:": "Do you believe everything happens for a reason?",
  "text": "I was just rejected from my dream school a few days ago, and am shattered. I saw myself so immensely in that school, I loved everything about it, and am so so sad to have been rejected. My family is comforting me by saying it wasn't meant to be, but it feels so wrong, I feel like that was where I was supposed to be and I just screwed up my shot. I know that there are plenty of other schools I could be happy at, but I am more wondering if you think that everything happens for a reason, that I wasn't meant to go to that school, or if I just messed up and missed the opportunity to go to a school I would've loved. Thanks. \n\n(I acknowledge the very dramatic tone of this post, sorry, I'm still reeling from this rejection that hit me hard)",
  "author": "bisbusy",
  "created": 1639706948,
  "updated": 1639785501,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 0.95,
  "comments": {
    "hov4dyy": {
      "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/hov4dyy/",
      "text": "now I'm not religious or anything but just trust the process homie shit works out🙏",
      "author": "plsbitchjustshutup",
      "created": 1639707904,
      "upvotes": 13,
      "replies": {}
    },
    "hov6p6g": {
      "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/hov6p6g/",
      "text": "I don’t. But that doesn’t mean you messed up either. Sometimes you can do every single thing right and still not get what you wanted. So much in life, including college admissions, is not fully in our control. There are other people making decisions that impact us, environmental factors nobody could have changed, etc. The best we can do is to make the best of what we get. There have been things and people I’ve lost I’ll never get back and I don’t see a single reason why that should be “meant to be.” But if I just despair over that, I’ll never get anywhere, right? And I have other places I want to go and things I want to do, and I’m sure you do too. As painful as it is, I need to get back up and find or make those precious things in other parts of my life. Process your rejection and take your time. But you’ll be able to bounce back from this and find things you love in other places as well, I promise. Maybe it won’t be quite the same as your dream school, but that doesn’t mean it’s necessarily worse either. I hope this helps you feel a bit better, OP. Take some time off, talk with family about non-admissions things, and enjoy break. We’ve all earned it.",
      "author": "rainingsiberiancats",
      "created": 1639708945,
      "upvotes": 8,
      "replies": {}
    },
    "hov4jco": {
      "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/hov4jco/",
      "text": "It’s ok. You can always transfer to the school after going somewhere else. College isn’t all that it’s cracked up to be though— right now it is your everything but everything does happen for a reason.  Take it in stride! You will be OK!!!! :-)",
      "author": "MetaBrains",
      "created": 1639707973,
      "upvotes": 2,
      "replies": {}
    },
    "hov682g": {
      "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/hov682g/",
      "text": "Check out the post I made yesterday. I think it might help you. All love here. ♥️",
      "author": "Tarheel4lifer24",
      "created": 1639708735,
      "upvotes": 2,
      "replies": {}
    },
    "hov9lbd": {
      "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/hov9lbd/",
      "text": "Yes! Everything happens for a reason and if you’re a good person, then that reason is good. Hang in there :) it’s hard but this is coming from a person who is at the rock-bottom of their life so we’re all in this together!!",
      "author": "darkGrayAdventurer",
      "created": 1639710237,
      "upvotes": 2,
      "replies": {}
    },
    "hov4n7j": {
      "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/hov4n7j/",
      "text": "I completely understand….I was rejected from my dream school yesterday and it felt like a perfect fit for me. It’s hard, but I’m trying to tell myself that there is a reason…maybe a different college will give me access to my dream job or maybe I’ll meet my future husband there. One thing that has helped is that I asked a current student to tell me all the things she dislikes about my Ed school, and whenever I find myself thinking about it I remind myself of those things (for example there are lots of bugs and I have a phobia of them)",
      "author": "International_You275",
      "created": 1639708024,
      "upvotes": 1,
      "replies": {}
    },
    "hovk4qk": {
      "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/hovk4qk/",
      "text": "college process sucks, and I know you were worth that school. regardless- I am a firm believer of everything happens for a reason. many people get rejected from their top choice and end up loving where they go to. for any chance u dont like ur school, u can transfer there",
      "author": "yrollins",
      "created": 1639715046,
      "upvotes": 1,
      "replies": {}
    },
    "hoxqiqx": {
      "link": "/r/ApplyingToCollege/comments/ri6dq3/do_you_believe_everything_happens_for_a_reason/hoxqiqx/",
      "text": "Yes\n\nStanford told me my essays were shit so that I can hopefully go to a college in New j*rsey",
      "author": "sleepkeyichidema",
      "created": 1639759407,
      "upvotes": 1,
      "replies": {}
    }
  }
}