{
  "sid": "rhihdw",
  "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/",
  "title:": "Rejected by Harvard",
  "text": "I’ve spent my whole life preparing to get into Harvard. My parents spent thousands trying to buy out the AO but even that didn’t work. When I got the rejection letter I got so mad that I started storming around the house and breaking everything in my path. My girlfriend of 10 years started crying and begging for me to stop but I couldn’t see anything beyond my wall of tears and pure hatred. I threw a vase that said “Grandma” for some reason at her feet and it completely shattered. My whole family as been trying to get me to calm down but i can’t. It seems like my entire life melted before my eyes. Now where will I go?\n\nHow could they reject me? I literally took APUSH and got 1st place out of everyone who took the exam. I spent HOURS and HOURS on my common app essay honing it and making sure it was good grammar. \n\nDon’t waste your time going to college guys it’s useless. If I can’t get in you guys obviously can’t. Get real.",
  "author": "bobby2chains",
  "created": 1639628937,
  "updated": 1645852046,
  "over_18": false,
  "upvotes": 49,
  "upvote_ratio": 0.96,
  "comments": {
    "hoqrwl8": {
      "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/hoqrwl8/",
      "text": "should've snorted those ashes pussy. weak ass mf that's y Harvard didn't accept u smh",
      "author": "plsbitchjustshutup",
      "created": 1639630645,
      "upvotes": 19,
      "replies": {}
    },
    "horaj3s": {
      "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/horaj3s/",
      "text": "Dude if u weren't preparing to go to Harvard before you were a fetus, you have no chance. You started wayyy too late man.",
      "author": "Iambetterthan_you",
      "created": 1639642941,
      "upvotes": 8,
      "replies": {}
    },
    "hos8lf4": {
      "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/hos8lf4/",
      "text": "Shitpost wednesday went to another whole new level lol",
      "author": "bcbuilds43",
      "created": 1639665317,
      "upvotes": 4,
      "replies": {}
    },
    "hosvgu6": {
      "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/hosvgu6/",
      "text": "Why aren’t AOs like they used to be? Before you could just shoot ‘em a couple mil and you could get in no problem. Things were better in the old days smh",
      "author": "Queasy_Relief_268",
      "created": 1639674540,
      "upvotes": 3,
      "replies": {
        "hoth8gr": {
          "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/hoth8gr/",
          "text": "The classic, \"Oh the application fee isn't $300,000? That's ok you guys can just keep it ;)\"",
          "author": "DarnHecker",
          "created": 1639682996,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoqtbk9": {
      "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/hoqtbk9/",
      "text": "Dude if one college rejects you find another, go easy your life has just started or going to start it does not matter if your dream college rejects you. Even people from community college end up with high pay.",
      "author": "dev-rathod26",
      "created": 1639631423,
      "upvotes": 2,
      "replies": {
        "hoqua9n": {
          "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/hoqua9n/",
          "text": "look at the flair",
          "author": "pumpkin2500",
          "created": 1639631970,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hp1r632": {
      "link": "/r/ApplyingToCollege/comments/rhihdw/rejected_by_harvard/hp1r632/",
      "text": "you must foundered presidented 18 nonprofit organizations for various allegedly disadvantaged groups in varying combinations of alleged disadvantage. You must be president/governor/whatever of one of 13 million model UNs, you must have gone on and on about your AP courses and your class rank and your test scores...not to mention authored some \"papers\" in some obscure journals or conferences based on 5 weeks  \"research\" in some local univ...how could they deny you...",
      "author": null,
      "created": 1639836255,
      "upvotes": 1,
      "replies": {}
    }
  }
}