{
  "sid": "qgpffq",
  "link": "/r/ApplyingToCollege/comments/qgpffq/applying_to_college_at_40/",
  "title:": "Applying to college at 40",
  "text": "Hey guys! Recently my dad has been trying to go back to college but he has no idea where to start (nor do I 😔). We live in Texas and are trying to stay relatively close to that Dallas metroplex area. \n\nRegarding logistics my dad has no access to his transcripts from highschool nor other colleges he went to but didn't graduate from... so he and I are a bit lost in his next step. He is a veteran if that can help bolster his chances and he isn't looking for anything fancy just a degree!\n\nIf anyone has tips for my dad please send them my way.",
  "author": "imjustaboxtrol",
  "created": 1635312597,
  "updated": 1635456343,
  "over_18": false,
  "upvotes": 29,
  "upvote_ratio": 1.0,
  "comments": {
    "hi7rjul": {
      "link": "/r/ApplyingToCollege/comments/qgpffq/applying_to_college_at_40/hi7rjul/",
      "text": "The military connections can really help! I bet there are people both in the military and at every college willing to help. \n\nHe should look also on the website for each college to find their registrar’s instructions for applying for transcripts. A decade later I emailed the foreign college I attended as a nondegree student and it turned out I had grades they were willing to send. He might be surprised too.",
      "author": "RetiringTigerMom",
      "created": 1635314075,
      "upvotes": 15,
      "replies": {
        "hi7s6lh": {
          "link": "/r/ApplyingToCollege/comments/qgpffq/applying_to_college_at_40/hi7s6lh/",
          "text": "Thank you so much we'll look into this!",
          "author": "imjustaboxtrol",
          "created": 1635314539,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hi7qhxw": {
      "link": "/r/ApplyingToCollege/comments/qgpffq/applying_to_college_at_40/hi7qhxw/",
      "text": "Asia, community colleges are a perfect opportunity for this. He can probably transfer to UT Dallas as well. \n \nI do t know where you live, but that might give us better information",
      "author": "ScarAdvanced9562",
      "created": 1635313324,
      "upvotes": 10,
      "replies": {}
    },
    "hi8o6si": {
      "link": "/r/ApplyingToCollege/comments/qgpffq/applying_to_college_at_40/hi8o6si/",
      "text": "Not sure if it will help, but try contacting the VA. His military record may contain his transcripts. Mine does.",
      "author": "BuffsBourbon",
      "created": 1635338652,
      "upvotes": 7,
      "replies": {}
    },
    "hi8tyvx": {
      "link": "/r/ApplyingToCollege/comments/qgpffq/applying_to_college_at_40/hi8tyvx/",
      "text": "Pretty much all colleges have a Veterans Affairs office/person. A good place to start would be getting in touch with that person at your local community college.",
      "author": "shepworthismydog",
      "created": 1635341560,
      "upvotes": 7,
      "replies": {}
    },
    "hi8gn1a": {
      "link": "/r/ApplyingToCollege/comments/qgpffq/applying_to_college_at_40/hi8gn1a/",
      "text": "Wow. I'm sorry I don't have anything useful to add, but this is amazing! You and your dad are doing an absolutely fantabulous job!!! I wish you the very best of luck!",
      "author": "Team_Histone",
      "created": 1635334296,
      "upvotes": 5,
      "replies": {}
    }
  }
}