{
  "sid": "qkg2ur",
  "link": "/r/ApplyingToCollege/comments/qkg2ur/what_do_you_think_is_wiser_rea_with_test_optional/",
  "title:": "What do you think is wiser? REA with test optional or RD with a GOOD SAT score? (to a very competitive college)",
  "text": "I AM AN INTERNATIONAL STUDENT (but from a not so known country). I study in the IGCSE/A LEVEL curriculum and have all A*s so my gpa is in a good position, class rank is amongst the top 3%, ECAs are also strong imo, the essays that I wrote for that particular college are my favorite and got good reviews from teachers and counselor. I will also be applying with an art portfolio (though my major is Biochemistry). \n\nHowever, I couldn't give SAT earlier because of the limitations in test dates and centers in my country for COVID but will be giving it on December and thought of applying RD to Stanford with my SAT Score.\n\nNow, just wanna know if that was a wise decision or should I have applied REA with test optional??",
  "author": "chikkalililo",
  "created": 1635779495,
  "updated": 1635890314,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiw4i9n": {
      "link": "/r/ApplyingToCollege/comments/qkg2ur/what_do_you_think_is_wiser_rea_with_test_optional/hiw4i9n/",
      "text": "I vote RD w/score\n\n(Keep in mind that acceptance rates for internationals to top US schools tend to be around half the overall rate. So, the acceptance rate for internationals to Stanford is likely in the neighborhood of 2%.)",
      "author": "elkrange",
      "created": 1635779759,
      "upvotes": 3,
      "replies": {
        "hix0txw": {
          "link": "/r/ApplyingToCollege/comments/qkg2ur/what_do_you_think_is_wiser_rea_with_test_optional/hix0txw/",
          "text": "yeaa I was thinking the same which is why I went for RD. Thank you!!",
          "author": "chikkalililo",
          "created": 1635793366,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiw5k7l": {
      "link": "/r/ApplyingToCollege/comments/qkg2ur/what_do_you_think_is_wiser_rea_with_test_optional/hiw5k7l/",
      "text": "I’d say test optional there is a minor boost for applying early and since you do have a standardized curriculum it might help you avoid uncertainty about your credibility.",
      "author": "TritonTheCat",
      "created": 1635780227,
      "upvotes": 3,
      "replies": {
        "hix0zbn": {
          "link": "/r/ApplyingToCollege/comments/qkg2ur/what_do_you_think_is_wiser_rea_with_test_optional/hix0zbn/",
          "text": "I really wanted to apply early but ripp can't do anything now but thankss",
          "author": "chikkalililo",
          "created": 1635793427,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}