{
  "sid": "qii43l",
  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/",
  "title:": "Please DON’T Apply to WashU",
  "text": "WashU may be ranked 14th on US News and may be a T20, but I’m a sophomore who goes there and I’m sorry to say you should really weigh your decision before considering applying here or making the decision to come here. One thing I will say right off the bat is if you cannot afford to come here, please please please don’t bog yourself down with heavy loans to come here. \n\n- Social Life/Things to do in STL\n\nIf you don’t have a car and don’t want to pay Uber fees to go literally anywhere - you WILL be left out! It’s fine for the first 1.5ish warm months of fall sem because you can walk without feeling cold. But, even then there are not that many places to walk to nearby. There is the Delmar Loop, but even that gets quite stale after going a few times and everything that’s not a club/bar/drinking house seems to close quite early.\n\nAlso, if you don’t drink or go to clubs, you’re pretty SOL in terms of what you can do around town and with kids. Party culture is pretty big, non-party fun shit - not so big. The campus is in the city of STL but because STL is a very spread out city, it is NOT a convenient city to traverse. Taking public transport is definitely not as easy as people make it sound. Without being super dedicated to using public transport or having some other way to get around - you will feel pretty confined to the campus bubble.\n\n- Campus/General Vibe\n\nThere is an air of affluence and wealth around the school. People will often talk about spending “small money” on things like Ubers or food or something else, but in reality, these purchases add up and can be expensive for you. In addition, if you’re taking thousands (I mean like 100k+) of dollars in loans to come to WashU - IT isn’t worth it because nothing you get on campus is really worth the money.\n\nThe facilities on campus are terrible when compared to the kind of money you are paying and the kind of money the school has (*65% Returns on Endowment*) the gym is so small and busy most of the time that you can’t even get a bench/weights without waiting. In addition, the food prices are terrible and there is NO dining hall buffet on campus. The dining options that you do have get very repetitive and old very quick and they are simply bland and lacking in good flavor. There is variety, but even so the flavors are dull. You will also be left hungry more often than not requiring you to purchase double the food. I’ve spent around $20 in meal points (which is a lot) on single meals before because one entree often doesn’t cut it. In addition, the libraries on campus all close at 8 PM which is abysmal for any research institution and actually makes me feel more like I’m literally attending a high school more than a university - I go to class, I have lunch in between classes, and then I come back to my dorm in the evening because things are pretty much closed anyway.\n\n- People\n\nOftentimes it seems like people have drank this Kool-Aid about the school. They talk about how they knew this was the place they wanted to be and how they really enjoy the place and have no complaints or can overlook the other things. It’s to the point where even if you criticize things worth criticizing like the food or the fact that the administration makes questionable decisions regarding political views and the handling of certain events - people will simply look at you funny and wonder why you came to the school in the first place. I would say there is groupthink pressure as a whole and I have only found a handful of individuals who are willing to consider that other schools do exist and that WashU truly isn’t worth the money and is overhyped. I definitely feel pressure to behave and think a certain way if I want to fit in with groups which is really not something anyone should have to experience. People are very fake and insincere in my experience.\n\nThere are also a lot of rich people here as I mentioned earlier. IT definitely can make you wonder about your socioeconomic status and question whether or not you belong at the school both socially and financially.\n\n- Internships/Career Opportunities\n\nMany of the people who have sophomore internships at the kind of big firms that you may want to come to a T20 for are actually people who qualify for diversity programs or have connections through family. The WashU reputation has not really been anything extremely helpful in any fashion. People from my (non-private, public) high school at my (non cali, non michigan, non Virginia, non UNC, non Texas) state school have been getting better offers and more consistent internship opportunities at the same companies I have been applying to  whereas I have not even received a single interview. Our profiles are largely consistent with each other’s but people with lower GPAs and less EC involvement/work experience have still had a better time getting fortune 500 internships at my state school.\n\n- Conclusion\n\nOverall, WashU just isn’t worth it and I feel like a pretty big lemon for being drawn in by the prestige and thinking I would enjoy my time here. Me and my roommate who also feels the same way as I find ourselves in situations where our state school comes up either through a friend or something we see here on WashU’s campus and are reminded of how the experience there would have been better almost every single day. Please weigh your choices carefully and know what you’re getting into. I am happy to answer any more questions in comments or dms.\n\nEdit: For those that think I am bad at networking or hang with the wrong crowd or don’t do anything on campus, that’s not the case. I’m involved in a professional fraternity on campus and have four other clubs that are both business and non business activities. I STILL feel like it’s difficult to make lasting connections with people that go beyond club related programming or casual conversation. My big in the prof. frat hasn’t even made the effort to check-in with me despite me reaching out multiple times and stating we should do something when they’re free. People are superficial in my experience, I’m sorry to tell y’all the truth about my experience but it is what it is.",
  "author": "Familiar-Ad5781",
  "created": 1635529069,
  "updated": 1636154931,
  "over_18": false,
  "upvotes": 855,
  "upvote_ratio": 0.92,
  "comments": {
    "hik93pe": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik93pe/",
      "text": "u/ssssseabass reading this post: 👁👄👁",
      "author": "pulsar-beam",
      "created": 1635541069,
      "upvotes": 219,
      "replies": {
        "hiku65q": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiku65q/",
          "text": "I find it funny that everyone else is running out of meal points and I'm just in this $200 surplus",
          "author": "ssssseabass",
          "created": 1635550231,
          "upvotes": 137,
          "replies": {
            "hikz38j": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikz38j/",
              "text": "I'm at a $300 surplus I don't get how people have blown through the points.",
              "author": "COLUMBIAwindbreaker",
              "created": 1635552561,
              "upvotes": 51,
              "replies": {}
            },
            "hikz9kz": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikz9kz/",
              "text": "Honestly same, its probably just that I don't eat enough though 🤣",
              "author": "AbstractCuriosity",
              "created": 1635552648,
              "upvotes": 14,
              "replies": {
                "hil9mw4": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil9mw4/",
                  "text": "See you didn't have a Ed to the school.\n\n\n\n^eating ^disorder",
                  "author": "HahaStoleUrName",
                  "created": 1635557689,
                  "upvotes": 25,
                  "replies": {
                    "hileiju": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hileiju/",
                      "text": "On the contrary, my ED is what's keeping my meal point balance high",
                      "author": "ssssseabass",
                      "created": 1635560104,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "himqxbt": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/himqxbt/",
          "text": "👁👄👁",
          "author": "WashUPREPPER",
          "created": 1635593417,
          "upvotes": 4,
          "replies": {
            "hinvdz2": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinvdz2/",
              "text": "STOP LMFAOOOOOO",
              "author": "pulsar-beam",
              "created": 1635613346,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hikd44o": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikd44o/",
      "text": "I think that social media has made high schoolers feel like college is Disneyland. It is not. College can be immensely fun and is a time for evolution and growth, but it is real life. There will be ups and downs, things you like and don’t like — just like every job you will ever have and even your ‘soulmate.’ I went to two great institutions for undergrad and grad school, and decades later, I still value the experiences and would do them all over. But it wasn’t all roses, that’s for sure!",
      "author": "MoniCoff1",
      "created": 1635542731,
      "upvotes": 135,
      "replies": {}
    },
    "hijs2nz": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijs2nz/",
      "text": "Plot twist: this is a high school senior applying ED to WashU",
      "author": "Edible-pet-fish",
      "created": 1635534357,
      "upvotes": 551,
      "replies": {
        "hikmpf3": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikmpf3/",
          "text": "LMAO",
          "author": "Lonely-Conversation2",
          "created": 1635546835,
          "upvotes": 48,
          "replies": {}
        },
        "hilu927": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilu927/",
          "text": "Had the same thought, but some of it is oddly specific.  Decent FUD if it is indeed FUD.",
          "author": "jayphoward",
          "created": 1635568506,
          "upvotes": 10,
          "replies": {}
        },
        "hikxl31": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikxl31/",
          "text": "I was thinking the same thing lmao",
          "author": "Tall_Contribution_64",
          "created": 1635551836,
          "upvotes": 24,
          "replies": {}
        },
        "hijtotu": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijtotu/",
          "text": "I was about to comment this 🤣",
          "author": "OkTale4794",
          "created": 1635535007,
          "upvotes": 34,
          "replies": {}
        },
        "himp11n": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/himp11n/",
          "text": "came here to say this",
          "author": "OysterGoesToCollege",
          "created": 1635592021,
          "upvotes": 2,
          "replies": {}
        },
        "hiwlkr0": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiwlkr0/",
          "text": "Brilliant, brilliant.",
          "author": "GodDammitGrigori",
          "created": 1635787097,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hikyosq": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikyosq/",
      "text": "i just know this destroyed so many souls on here",
      "author": "Suspicious_Bobcat237",
      "created": 1635552369,
      "upvotes": 36,
      "replies": {}
    },
    "hijhsd0": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijhsd0/",
      "text": "Thanks for providing some personal insights on WashU for class of 2026, these threads are really helpful for a lot of people applying to colleges.",
      "author": "LegendaryRevolver",
      "created": 1635530297,
      "upvotes": 141,
      "replies": {}
    },
    "hiklgxd": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiklgxd/",
      "text": "My friend was obsessed with getting into a prestigious school, went to WashU and really doesn’t like it. He’s transferring to UW (our state school and where I ended up) next year. I was obsessed with getting into a prestigious school but now I’m at Madison and can’t imagine being anywhere else.",
      "author": "fckbees",
      "created": 1635546287,
      "upvotes": 28,
      "replies": {
        "hion05x": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hion05x/",
          "text": "Maybe it’s not the same level of prestige but university of Wisconsin is still IMO one of the best public schools.",
          "author": "jersey_girl660",
          "created": 1635625031,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hijx1xr": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijx1xr/",
      "text": "u/ssssseabass 's evil twin has been found",
      "author": "HahaStoleUrName",
      "created": 1635536335,
      "upvotes": 161,
      "replies": {
        "hik224n": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik224n/",
          "text": "Came into the comments looking for them",
          "author": "sofiiiiiii",
          "created": 1635538260,
          "upvotes": 47,
          "replies": {
            "hik3wxq": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik3wxq/",
              "text": "Same",
              "author": "HahaStoleUrName",
              "created": 1635538988,
              "upvotes": 10,
              "replies": {}
            }
          }
        },
        "hilsgjw": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilsgjw/",
          "text": "you mean based twin?",
          "author": "Blatantleftist",
          "created": 1635567445,
          "upvotes": 0,
          "replies": {
            "hilti25": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilti25/",
              "text": "Yesn't",
              "author": "HahaStoleUrName",
              "created": 1635568060,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hiklira": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiklira/",
          "text": "Edit:    Never mind\n\nIt sounds more like this kid is dragging WashU down rather than the opposite",
          "author": "ssssseabass",
          "created": 1635546310,
          "upvotes": -26,
          "replies": {
            "hikuqsr": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikuqsr/",
              "text": "How are you doing in your pre-med classes? How about the quality of teaching? ECs? Volunteering?",
              "author": "JJKKLL10243",
              "created": 1635550497,
              "upvotes": 17,
              "replies": {
                "hikwhgm": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikwhgm/",
                  "text": "Learning a lot, and doing perfectly well. The teachers are really amazing and most of them are so good at making class time fun.\n\nExtracurriculars and volunteering both going just fine, trying to keep it light this semester but it's easy to get involved",
                  "author": "ssssseabass",
                  "created": 1635551312,
                  "upvotes": 13,
                  "replies": {
                    "hil9etm": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil9etm/",
                      "text": "Bruh why did this entire tread get downvoted 💀\n\nPeople wanted hear your thoughts on this and when they did, they were like \n\nWRONG",
                      "author": "HahaStoleUrName",
                      "created": 1635557582,
                      "upvotes": 14,
                      "replies": {
                        "hilecwi": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilecwi/",
                          "text": "Hating on T20's is popular on this sub even though almost everybody here is trying to get into one 🤣",
                          "author": "AbstractCuriosity",
                          "created": 1635560025,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "hikxkzz": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikxkzz/",
                      "text": "Please keep us updated on your journey👍",
                      "author": "JJKKLL10243",
                      "created": 1635551835,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "hinutcm": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinutcm/",
                      "text": "how’s the raw food is it worth the 80k tuition most kids pay",
                      "author": "throwawayx666999",
                      "created": 1635613104,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hijha04": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijha04/",
      "text": "You’re probably going to get downvoted to Hell, because people don’t want to believe this is true. I was the same way when I was applying. I would occasionally hear negative things about the schools I applied to and refused to believe any of them. I was ecstatic to receive a few acceptances to prestigious universities. I’m in my final year at Cornell, and I regret enrolling here. It was nothing like I expected. I hear the same thing from my friends at other T20 institutions, too. The entitlement is rampant on campus, and I have found it difficult to meet people because they are much more concerned with themselves than they are with you. My sister just started at UCLA and has been describing the same things. I’m trying to be positive for her well-being, but I now know how toxic these environments are. Don’t let prestige blind you.",
      "author": "thatcornellbitch",
      "created": 1635530100,
      "upvotes": 148,
      "replies": {
        "hijjl7q": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijjl7q/",
          "text": "I’m sorry to hear the experience is the same at Cornell and at UCLA now as well. It’s really unfortunate how blinded we can get as high school seniors who think that all the work put in over four years must culminate in this “beautiful and amazing” T20 experience.",
          "author": "Familiar-Ad5781",
          "created": 1635530995,
          "upvotes": 64,
          "replies": {}
        },
        "hikg508": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikg508/",
          "text": "i think i can resonate with you and your sister. i’m starting UCLA as well and like u/SpamLessSodium said, the campus, food, opportunities are stellar, but i think there’s much more to your college experience than that. i think UCLA (and any college in general) is what you make out of it, but choosing the environment that you think you’ll do the best in and be happier in for the next 4 years matters too. \n\ni wish i considered more factors than prestige when making my decision for colleges. Proximity to my hometown, friends, connections, and family is definitely something I wish I had put more thought into before choosing UCLA. even though people were telling me that choosing UCLA for pre-health is the obvious choice (mostly bc of GPA and prox to hospital/labs), i felt really connected with another university that i was committed to.\n\nmy sibling also almost solely chose their school based on prestige and regrets it as well. i think we all always look at the other side, and think the grass is always greener, so please take my rant with a grain of salt. i overall do not regret choosing UCLA over other schools - i think if i went to the other university, i’d have the same thoughts of wondering what going to UCLA would have been like. \n\nin each university, there’s usually a range of personalities and diversity where you can find people with whom you feel comfortable, but a lot of universities have a certain environment that i think can really influence your experience there. \n\ni hope you and your sister is doing okay (and let her know that she’s definitely not alone at UCLA!) <3",
          "author": "clin1217",
          "created": 1635543999,
          "upvotes": 35,
          "replies": {
            "hikgolp": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikgolp/",
              "text": "Yes I definitely agree with this. There are certainly aspects of every school that are good, just personally I know a lot of people, myself included, who do not feel that the price tag was worth it, or that we could have had an equally good, if not better, experience somewhere else.",
              "author": "thatcornellbitch",
              "created": 1635544228,
              "upvotes": 4,
              "replies": {}
            },
            "hikqo2q": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikqo2q/",
              "text": "[deleted]",
              "author": null,
              "created": 1635548609,
              "upvotes": 1,
              "replies": {
                "hikvpzy": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikvpzy/",
                  "text": "In general, your university GPA matters if you are planning on pursuing further education after undergrad, especially if you are in the pre-health field. Though it’s not fair to compare the importance of GPA for undergrad admissions vs grad admissions, I think the amount of consideration towards GPA for graduate admissions is much more weighted and emphasized than undergraduate admissions. \n\nI was told by many people who have had experience with graduate school admissions that I should really consider which school (UCLA vs Berkeley) would be better for my major, overall experience, but most importantly, GPA. In other words, “which school will it be ‘less difficult‘ to get a higher GPA?”\n\nIt was made pretty apparent to me that it is very difficult, although not impossible, to get a decent GPA at Berkeley. Many students and alumni have shared their experience in that Berkeley’s lower division pre-health classes (even if you’re not a LS major, you still must take these classes as requirements for grad school) are infamous for ‘weeding’ students out and having grade deflation. I don’t know how true that is (it seems like it is though), but overall, it is *known* that Berkeley isn’t known to hand their students easy As. That is not to say that it is ‘easier’ to get As at UCLA - the classes are probably just as rigorous/difficult, but it seems like they don’t purposefully try to tank student’s GPA with deflation curves and weeder classes. **For any Berkeley or UCLA students/alumni, let me know if I am incorrect. I’m simply a freshman at UCLA, so my info may be totally misguided.**\n\nMy heart was telling me to stay committed to Berkeley (was committed for MCB in March-June then got off the waitlist to UCLA neuroscience). However, after researching so much about each school, it became pretty clear that UCLA is probably better for pre-health students. Honestly, in terms of grad school admission, they probably don’t view UCLA as that much different than UC Berkeley. Even though, AOs might know that it might be more difficult to get a high GPA at Cal than UCLA, there are so many other things to consider. Like u/ThatCornellBitch said, I wanted to ignore what others were saying about Berkeley, but ultimately, I think they were right and I’m glad I received feedback from a lot and a variety of people and resources.\n\nHonestly, there’s not much of a point in thinking about whether I made the best decision for myself. Just want to let others know to consider things that you might not think are very important when choosing where you are going to spend your next 4 years and how it can impact your experience in college and your future. \n\nSorry for the rant (again) .-. This was something I spent a lot of time thinking about especially as an overthinker.",
                  "author": "clin1217",
                  "created": 1635550951,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hik7nkq": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik7nkq/",
          "text": "tbf I go to ucla and I feel like overall it’s been pretty good- lots of things to do, decent food, decent career opportunities (depending on major), etc.",
          "author": "SpamLessSodium",
          "created": 1635540487,
          "upvotes": 11,
          "replies": {}
        },
        "hio6rzl": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hio6rzl/",
          "text": "…I literally just submitted Cornell ED 🙂",
          "author": "slimesoevil",
          "created": 1635618090,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hijgkj4": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijgkj4/",
      "text": "Thanks for sharing. It is nice to have a reality check sometimes that these top colleges have their own share of shitty stuff.\n\nWhich of the problems you discussed do you believe are common to T20s in general, and which do you think are just WashU in particular?",
      "author": "i_stan_t_cells",
      "created": 1635529828,
      "upvotes": 57,
      "replies": {
        "hijhls9": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijhls9/",
          "text": "From what I know after talking to other people from my HS, I hear Rice and Vanderbilt can be similar. I think other T20s may be better based on the location, but in reality I’m sure some of the issues I’ve mentioned are probably prevalent at other T20s too.",
          "author": "Familiar-Ad5781",
          "created": 1635530226,
          "upvotes": 29,
          "replies": {
            "hing730": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hing730/",
              "text": "Vanderbilt isn’t really similar at all. The school is in the heart of Nashville and you can get just about anywhere relevant by walking. The facilities are very good but yes campus dining is ass. In terms of career outcomes I haven’t experienced what you’re saying at all.(but then again don’t know what industry you’re in ) . If you’re talking about finance internships yea it’s difficult to get before junior year outside of the diversity programs or family connections, but this is at any school. In Tech this definitely isn’t true. Basically every strong CS student I know in my year has big name/ unicorn/ HFT Tech internships lined up for the summer already. If your friends are making it past resume screens and you’re not the simple truth is that you have a weaker resume. If you are making it past resume screens and not getting offers then tou need to work on your interviewing skills. Getting internships/jobs is a grind even for people going to T5/T10 lol no employer is just handing these out to someone because of the name of their school. What I dislike about Vandy is just Nashville itself. If you’re not white / not a country music fan it probably won’t be that fun for you. There’s also no real dance club scene , just bars. But Black Vandy parties are really fun and there’s HBCUs in Nashville that also throw parties that are more my vibe.",
              "author": "pianoloverkid123456",
              "created": 1635606920,
              "upvotes": 6,
              "replies": {}
            },
            "hik74xm": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik74xm/",
              "text": "Rice!?",
              "author": "-limabeans-",
              "created": 1635540276,
              "upvotes": 19,
              "replies": {
                "hikt4rf": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikt4rf/",
                  "text": "That’s what I’m saying, what’s wrong with rice?",
                  "author": "CodeZero22",
                  "created": 1635549749,
                  "upvotes": 2,
                  "replies": {
                    "hin7qdw": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hin7qdw/",
                      "text": "It’s in Houston 🤒 🤢 🤮 \n\nFr though the administration is pretty disliked for making bad decisions, search for make me hate rice posts",
                      "author": "Fonbire",
                      "created": 1635602985,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hilg8px": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilg8px/",
              "text": "One thing *a lot of people* don't understand until they go to college is that the biggest determiner for where you end up living after college and where you find a job, is where you went to college. \n\nSchools like Vanderbilt, Duke, etc. are all fantastic schools but their location will always hamper them since the economic centres of the country are East Coast and West Coast. In a world where networking is king (which it will always be), the relative \"prestige\" of your school or how highly it is ranked is far less important than the people who are willing to talk to you in high places and a lot of people depend on college for that. \n\nI work at a unicorn rn and during our summer internship, it was interesting seeing how most kids came from T30s and T20s but the highest concentration of students there were those from the \"local\" schools. \n\nThis is also why when people ask about two different schools, if they're in very different locations, I often just suggest going with the one where they want to live. UT Austin is king in Texas, no school outside of TX will come close to how their alumni are *everywhere.* If you know you want to live in Texas for the rest of my life, it would make perfect sense to me to choose UT Austin over something like Dartmouth or UChicago even though one is obviously less prestigious than the others.",
              "author": "doneanddead",
              "created": 1635560975,
              "upvotes": 16,
              "replies": {
                "hilm3q0": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilm3q0/",
                  "text": "Duke is in the east coast, and is right by RTP, a fast growing tech hub.",
                  "author": "Careless-Pay9337",
                  "created": 1635563948,
                  "upvotes": 6,
                  "replies": {
                    "hilnpmd": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilnpmd/",
                      "text": "Okay true, I should specify I guess that I meant the Northeast Megalopolis when saying East Coast (similar to how West Coast does include Oregon but when talking about economic centres, that is not including Oregon.) In which Duke is not included. \n\nNC does have its own tech sector but it's absolutely dwarfed by SV. It's like how Charlotte has some financial services and IB going on but is not comparable to NYC's financial sector. While I am aware that Durham and the surrounding area gets a lot of funding for its size, it's a bit like talking about how the Netherlands wins a lot of Nobel Prizes per capita. Yes, but it's also just not that much in absolute numbers. [See here](https://www.smartcitiesdive.com/ex/sustainablecitiescollective/top-20-cities-venture-capital-investment/1144451/). Durham is not within the Top 20 cities (worldwide tbf) in terms of VC investment, and cities like Austn, Philly, and Phoenix get more VC investment. You will note that Durham is 4th per capita, but that just highlights that the tech scene going on in Durham, while being lucrative and obviously very attractive, is very small. [If you look](https://www.bloomberg.com/news/articles/2017-10-03/the-geographic-concentration-of-venture-capital) here, you'll see that Durham is the 20th most invested in city in the US for VC, putting it behind places like SLC, Denver, and practically every other major metro in America. Which makes sense, because it's not a major area.",
                      "author": "doneanddead",
                      "created": 1635564795,
                      "upvotes": 4,
                      "replies": {
                        "hin8vts": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hin8vts/",
                          "text": "You perhaps don't realize this but it's not just Durham you should look at for the Triangle tech area, it's Durham, Raleigh, and Chapel Hill. The entire large area is called the 'Triangle' and is growing rapidly. Not that it outscales NE (which again is not east coast but you clarified that), but if you only look at Durham you are getting a very poor picture of the tech opportunities near Duke (and UNC/NC State too). Plus back to outcomes your anecdotal stories about companies taking people near them don't match the stats: much higher percentages of Duke students will go on to better outcomes than non T20 schools (especially large public schools).",
                          "author": "askpat13",
                          "created": 1635603537,
                          "upvotes": 3,
                          "replies": {
                            "hioe2ry": {
                              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hioe2ry/",
                              "text": "> You perhaps don't realize this but it's not just Durham you should look at for the Triangle tech area, it's Durham, Raleigh, and Chapel Hill. \n\nThis is not unique to Durham. The link I sent for bloomberg which puts Durham at 20th is based on Durham-Chapel Hill, it's looking at *metropolitan areas* which is why Newark and Jersey City are also included in NYC and Oakland is included with SF. \n\nThe simple reality is that North Carolina is not the tech epicentre in the United States. There's nothing wrong with that, let's just be real here. \n\n> but if you only look at Durham you are getting a very poor picture of the tech opportunities near Duke (and UNC/NC State too)\n\nAnd even if they weren't included, in my other source, Chapel Hill and Raleigh would be so miniscule they don't even register. Point is, the North Carolina tech scene might be big for North Carolina but it's peanuts compared to the overall tech scene in America. \n\n> Plus back to outcomes your anecdotal stories about companies taking people near them don't match the stats: much higher percentages of Duke students will go on to better outcomes than non T20 schools (especially large public schools).\n\nI don't get what you mean here tbh.\n\nWhat I meant for *this context* is that if you know you want to work in North Carolina at a North Carolina tech company, you're better off going to NCSU for CS or UNC-Charlotte or something over a school like UCSB even if one is nominally far more prestigious than the other. \n\nThe issue is most people don't really want to live in NC or dream of working in the NC tech scene.",
                              "author": "doneanddead",
                              "created": 1635621116,
                              "upvotes": 1,
                              "replies": {
                                "hior4xz": {
                                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hior4xz/",
                                  "text": ">Schools like Vanderbilt, Duke, etc. are all fantastic schools but their location will always hamper them since the economic centres of the country are East Coast and West Coast. In a world where networking is king (which it will always be), the relative \"prestige\" of your school or how highly it is ranked is far less important than the people who are willing to talk to you in high places and a lot of people depend on college for that.\n\nI mainly take issue with this chunk of your original comment; not what you say, but that you imply location is the impetus of networking. It's not location, but alumni that drive networking. Duke's alumni network is global and student outcomes match the top 20 \"prestige\", but I'll return to that.\n\n1. I know it's not unique to Durham, you just can't call the NE a \"Megalopolis\" without acknowledging the same linked effect takes place in the Triangle. Plus, your first link has Durham top 4 in venture capital per capita (worldwide). I know you downplay this, saying absolute numbers matter more, but for individuals coming out of college that's less competition for more funding than all but 3 other cities. Why would you not want that? Why would most funding matter if you are competing heavily for every opportunity? Now, is Durham the tech epicentre? No, of course not. But [the Research Triangle](https://www.researchtriangle.org/the-triangle/) area really is a growing tech center that is enticing companies like [Apple](https://www.forbes.com/sites/korihale/2021/05/06/apples-1-billion-north-carolina-building-could-spur-corporate-diversity/?sh=15dd9c804073) to move there, and I just think you are underselling it.\n2. I know Chapel Hill, Durham, and Raleigh all wouldn't make many top twenty lists alone, especially if you ignore per capita, but combined they are an up-and-coming tech center, see above. But sure, alone they don't move the needle.\n3. I 100% agree. I come from florida, and yes if you go to UF or FSU (or UCF, etc.) that can be huge in helping you get a job there. This is where I'll bring back up your original comment at the top, I think some schools, and I'll say Duke because that's the one I know for sure, have such geographically diverse alumni-base paired with such high national recognition that it overrides the local effect. A Duke degree can help you get a job anywhere in the US- not just NC. A UCF degree doesn't hold nearly as much weight outside FL as inside. Another point, you act like everyone knows where they want to live as a high school senior when the reality is people change their minds. College is a transformative period, directing people away from schools that could get them a job anywhere because they're in a poor location, is just bad advice. This is not true for all universities, but between alumni locations and national prestige there are universities that have that ability.\n\nNow back to the original point, location doesn't hamper any top school that has a de-centralized alumni base. I know Duke has widespread alumni so I'm making them my example, but other \"prestigious\" schools may fit the bill too. As you say, networking is king, not location.\n\n[http://cuberis.github.io/duke-alumni-infosite/](http://cuberis.github.io/duke-alumni-infosite/) \n\n[https://alumni.duke.edu/groups?groups\\_filter=regional](https://alumni.duke.edu/groups?groups_filter=regional) \n\n[https://www.collegefactual.com/colleges/duke-university/student-life/diversity/chart-geographic-breakdown.html](https://www.collegefactual.com/colleges/duke-university/student-life/diversity/chart-geographic-breakdown.html) \n\n[https://studentaffairs.duke.edu/career/about-us/career-center-stats](https://studentaffairs.duke.edu/career/about-us/career-center-stats)",
                                  "author": "askpat13",
                                  "created": 1635626884,
                                  "upvotes": 2,
                                  "replies": {
                                    "hiovkan": {
                                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiovkan/",
                                      "text": ">  It's not location, but alumni that drive networking. \n\nWhich is highly location based. Your links literally make that clear. North Carolina is small af but is the largest centre of alums in America for Duke. Great if you want to live in NC, otherwise, those are all alums that, if it were Columbia for example, would be in NYC. Now think about going to NYC as a Columbia alum vs. as a Duke alum. Who is more likely to have friends or opportunities in high places? \n\n>  Duke's alumni network is global and student outcomes match the top 20 \"prestige\", but I'll return to that.\n\nI never made this claim? I said that these schools are harmed by their location, not that they aren't T20s. You seem to have come to a conclusion I never made. \n\n>  I know you downplay this, saying absolute numbers matter more, but for individuals coming out of college that's less competition for more funding than all but 3 other cities.\n\nI downplay it because it's peanuts. Going back, it's the Netherlands example all over again. The Netherlands produces a disproportionate number of Nobel Laureates, specifically in physics, but that does not mean it's a better place to go to than traditional physics powerhouses. Per capita ignores that scaling doesn't really work like that. To give another example, Iceland published a ridiculous number of books per capita. I'm gonna take a big guess and say that as a general publisher though, you probably don't think that Iceland is actually a better market to be in than say the US or even Canada. \n\nI'm gonna be real with you, you seem to be taking this personally for some reason and I'm not quite sure why. I literally said that Duke was a fantastic school, just that its location harms it if you want to work in the *traditional economic centres* of the country. In other words, what I am arguing is that ceteris paribus, Duke does worse because of its location in NC for West coast tech recruiting than it would if it were located in California. I don't think this should be controversial. \n\n> But the Research Triangle area really is a growing tech center that is enticing companies like Apple to move there, and I just think you are underselling it.\n\nI'm not underselling it, I just think you don't understand just how much of an economic powerhouse the US is. If the same amount of research and tech output happening in Raleigh were to happen somewhere else like Jakarta, it would indeed very notable and perhaps make Jakarta a regional tech centre but in the context of America, it's miniscule. \n\n> I know Chapel Hill, Durham, and Raleigh all wouldn't make many top twenty lists alone, especially if you ignore per capita, but combined they are an up-and-coming tech center, see above. But sure, alone they don't move the needle.\n\n*Together* they don't move the needles. \n\n> Now back to the original point, location doesn't hamper any top school that has a de-centralized alumni base. \n\nIt certainly does if you want to work in a certain industry. You seem to be considering this as a binary, but it isn't. It's on a gradient. I'm arguing that ceteris paribus, even Harvard would do better in tech if it were located in California instead of Cambridge. This is certainly not unique to Duke. The reason why I brought up the traditional Southern elites like Vandy and Duke is because they have a specific issue that's hard to overcome, which is that they are not too close to any of the traditional economic centres of the country. They have a \"power base\" within their home state and what that means is they do very well within that region, but they don't have as much influence and as many alumni as they would otherwise had they had a different location. This is not a baffling or controversial concept. \n\nMy point is that unless you want to live in NC, if you got into Duke and a comparable school that was located in an area you want to live in, you should probably go with said comparable school. My point wasn't to choose only based on location; my point was that location has a *huge* impact on where you end up working and living so you should strongly consider that (which most college students dont. They often treat college as a 4 year vacation away from somewhere before they plan to move back or move away.)",
                                      "author": "doneanddead",
                                      "created": 1635628870,
                                      "upvotes": 1,
                                      "replies": {
                                        "hip62pp": {
                                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hip62pp/",
                                          "text": "\"My point is that unless you want to live in NC, if you got into Duke and a comparable school that was located in an area you want to live in, you should probably go with said comparable school. \"\n\nGotcha, I agree. I may have misunderstood, but in my mind your original comment read like you thought location overrode alumni-base- i.e. a non-comparable school becomes comparable because of location.",
                                          "author": "askpat13",
                                          "created": 1635633765,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hinfh8m": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinfh8m/",
                  "text": "I think for someone who works in Tech picking a school based off location is a very bad idea. At the end of the day your resume (things you’ve built / past internships) is the most important for getting interviews and you  passing interviews is on you . This can be done with more or less the same difficulty from just about any recognizable school",
                  "author": "pianoloverkid123456",
                  "created": 1635606591,
                  "upvotes": 1,
                  "replies": {
                    "hinm7tv": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinm7tv/",
                      "text": "I work in tech rn at a unicorn. Location is very much still one of the most beneficial things. Kids at SJSU and SDSU place incredibly well into tech vs. their relative prestige and it has much to do with their location. The power of top schools doesn't come from their insane placements (there just aren't enough students from there), but from their flexibility. The top students at Harvard have a network that is much more nationwide than a student from UNC for example. \n\n> At the end of the day your resume (things you’ve built / past internships) is the most important for getting interviews and you passing interviews is on you \n\nI respectfully disagree. Getting your first round is the hardest part of the interview process, but it's hardly based on just the resume. Networking is king. Especially as an entry level grad, most don't have much experience and very little to differentiate from the competition. Google APM for example gets 8000 applications for <50 spots; the number of people applying who have FAANG internships on their resume for this entry level role already exceed the number of spots there are so if you think you're solely getting in on just a resume basis I think you're being optimistic. \n\nThere's this weird idea going around that tech is super-meritocratic (I get it, I fell for it too), but the reality is that hiring is done by humans and humans are not meritocratic at all. They hire from the same schools they know and are familiar with, from those within their network and who share similarities to them, etc. just like any other industry. Something like 40-50% of Google's SWEs come from the Top 25 CS schools (as defined by US News) for a supposedly meritocratic institution. For comparison, the [Top 10](https://www.wallstreetoasis.com/forums/comprehensive-list-of-target-schools-for-investment-banking) schools in terms of numbers of students sent to banks produce just 22% of the overall class at investment banks (tbf they don't do a good job of distinguishing roles and stuff and I'm sure the number in IB specific functions is way higher). The point is, Google's hiring is very asymmetrical and decidedly not a meritocracy. \n\n> This can be done with more or less the same difficulty from just about any recognizable school\n\nHaving alums in key positions is always better than just coming from a \"recognisable\" school. If you want to work where tech is popping, a school like SJSU or Cal Poly Pomona is honestly better than many schools considered more prestigious. I wouldn't choose them over national level schools, but I would probably choose SJSU over Case Western if I knew I wanted to go into West Coast tech for example. \n\n****\n\nLocation is king. The reason why so many West Coast schools are known as CS power houses has little to do with the intrinsic technical capabilities of those in the West, and entirely to do with the tech industry around them. Similar reason as to why East Coast schools are finance power houses. There's a reason why schools like UCLA, USC, etc. despite being fantastic schools aren't considered targets and a large part of it is distance from where finance happens.",
                      "author": "doneanddead",
                      "created": 1635609506,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "hit3xd2": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hit3xd2/",
                  "text": "I agree with this 1000%.  I'm a director at a VERY large tech company and do plenty of hiring.  The one thing I tell my kids is to think about where they want to work.  Guess where Microsoft and Amazon does a ton of recruiting?  UW-Seattle.  Guess where a large chunk of the Silicon Valley resumes I see come from?  San Jose State.  Want to work in Austin?  Go to UT-Austin.  Want to work in the Twin Cities, go to the University of Minnesota.   Want to work in Phoenix?  Guess what?  You can save a lot of money and go to ASU.  \n\nThe point is, the large public schools have an outsized reputation in their home markets.  Large local companies always recruit at their local universities because it's just easier.\n\nThere are lots of \"national brands\", but Washington University isn't necessarily one of them.  Certainly not in any high tech field.",
                  "author": "smugbedbug24",
                  "created": 1635713357,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hiktizm": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiktizm/",
              "text": "No NW right? 🥳",
              "author": "HahaStoleUrName",
              "created": 1635549933,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiky3um": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiky3um/",
      "text": "This is the main school I was trying to get into and the price is fucking ridiculous even for instate. I was thinking of buying a car midway through but I guess that ideas thrown out the window now. Honestly no clue what else to do for in state unis since Missouri is pretty shit.",
      "author": "NarutoDragon732",
      "created": 1635552089,
      "upvotes": 16,
      "replies": {
        "hiogdz0": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiogdz0/",
          "text": "WashU is a private school so there is no in state tuition.",
          "author": "maxavier10",
          "created": 1635622128,
          "upvotes": 5,
          "replies": {}
        },
        "hin4pkg": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hin4pkg/",
          "text": "Other states. ASU will reduce to like $35k by sat score, apply to other colleges that are not as highly ranked but have everything that you want and will give money. If I crawl through some saved posts from awhile ago I might be able to find other good examples.\n\nedit: wow that took awhile. Obviously look at your program, campus, and tailor your list accordingly but /u/prsehgal and his son made a good college list, and they got merit from a lot of the schools he applied to.\n\nhttps://www.reddit.com/r/ApplyingToCollege/comments/n2h6z2/so_my_son_finally_committed/",
          "author": "robmak3",
          "created": 1635601517,
          "upvotes": 3,
          "replies": {
            "hinq9jf": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinq9jf/",
              "text": "That's just the thing I kinda wanna go test optional 😅",
              "author": "NarutoDragon732",
              "created": 1635611222,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hilk7vi": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilk7vi/",
          "text": "FA is really good (and I think WashU is needblind for in-state). Also, I'm a senior and I've really liked my experience here.",
          "author": "friendshipinator",
          "created": 1635562991,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hijpn5t": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijpn5t/",
      "text": "shit man. I’m thinking about transferring to washu from Michigan. Would you say that’s a big mistake?",
      "author": "Mr_Cuddlesz",
      "created": 1635533391,
      "upvotes": 51,
      "replies": {
        "hijr2pa": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijr2pa/",
          "text": "Well consider why you want to transfer first. Is it for career ops? Because then yes, it is a mistake. It depends on why, but even overall I’d say you’re probably fine at Mich and wouldn’t be much better off at WashU",
          "author": "Familiar-Ad5781",
          "created": 1635533961,
          "upvotes": 70,
          "replies": {
            "hik34nb": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik34nb/",
              "text": "Yea mostly prestige and career reasons.",
              "author": "Mr_Cuddlesz",
              "created": 1635538679,
              "upvotes": 11,
              "replies": {
                "hikenm0": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikenm0/",
                  "text": "I thought UMich was very prestigious?",
                  "author": "um___ok",
                  "created": 1635543377,
                  "upvotes": 65,
                  "replies": {
                    "hikluty": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikluty/",
                      "text": "it’s better than washu in my opinion",
                      "author": "astrothunder818",
                      "created": 1635546459,
                      "upvotes": 45,
                      "replies": {}
                    }
                  }
                },
                "hik46f2": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik46f2/",
                  "text": "I think you UM is just as highly regarded and maybe even more so. I wouldn’t pay more to attend even an Ivy. It’s a really good school in most fields.",
                  "author": "RetiringTigerMom",
                  "created": 1635539091,
                  "upvotes": 110,
                  "replies": {
                    "him9w3o": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him9w3o/",
                      "text": "Thank you. Thats very kind of you to say",
                      "author": "Mr_Cuddlesz",
                      "created": 1635579793,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                },
                "hikr9kz": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikr9kz/",
                  "text": "You want to go to WashU... from UMich... for prestige? What?",
                  "author": "sevaiper",
                  "created": 1635548881,
                  "upvotes": 91,
                  "replies": {}
                },
                "hilckrq": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilckrq/",
                  "text": "UMich is by far the better school than WashU. Honestly, it’s not even a question. I’m baffled as to why you’d want to switch.",
                  "author": "Hardlymd",
                  "created": 1635559135,
                  "upvotes": 31,
                  "replies": {
                    "him4rjl": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him4rjl/",
                      "text": "Honestly I feel like the biggest advantage WashU has over UMichigan is the size. Applying to UMichigan is legit kind of scary with the prospect of being lost in the crowd and being unable to make connections because of the sheer size. Sure this is entirely subjective, but I feel like WashU’s undergrad body-size makes it better, at least for me, in prospect.",
                      "author": "fro5torm",
                      "created": 1635575752,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "hima0ai": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hima0ai/",
                      "text": "Yeah like the other person said, part of my decision is influenced by size as well.",
                      "author": "Mr_Cuddlesz",
                      "created": 1635579883,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "hil4i3c": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil4i3c/",
                  "text": "Michigan has a much bigger alumni network than WashU.",
                  "author": "CitizenSnips199",
                  "created": 1635555168,
                  "upvotes": 24,
                  "replies": {}
                },
                "hilfoxn": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilfoxn/",
                  "text": "Michigan has more name recognition than WashU at least IMO. It loses out to WashU in this specific ranking but it wins in other types of rankings. [For Times Reputation for example it's 16 vs. WashU at 81-90](https://www.timeshighereducation.com/world-university-rankings/2021/reputation-ranking#!/page/0/length/25/sort_by/rank/sort_order/asc/cols/stats). That's international though. \n\nFor [QS](https://www.topuniversities.com/university-rankings/usa-rankings/2021) however, it's 18 vs. 25 for WashU. \n\nAnd in a lot of the \"traditional prestige\" fields, Michigan is stronger. It's a target vs. semi-target (for finance/consulting), it's a top CS program whereas WashU isn't well-known for CS, etc.. \n\nThere are some benefits to attending WashU and it's certainly not a bad school but at the cost difference, transferring just because you view it as more prestigious is not a good idea.",
                  "author": "doneanddead",
                  "created": 1635560698,
                  "upvotes": 20,
                  "replies": {}
                },
                "hilg463": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilg463/",
                  "text": "What are you in Umich for? Umich and WashU are ranked the same in almost everything",
                  "author": "pointlessarguments3",
                  "created": 1635560913,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "hiks9fd": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiks9fd/",
          "text": "What degree are you getting?",
          "author": "cjpeltz",
          "created": 1635549344,
          "upvotes": 2,
          "replies": {
            "hikvo6r": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikvo6r/",
              "text": "CS and Biochem",
              "author": "Mr_Cuddlesz",
              "created": 1635550928,
              "upvotes": 3,
              "replies": {
                "hil3w0h": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil3w0h/",
                  "text": "CS? Stay at Mich 100%.",
                  "author": "Anacrisis",
                  "created": 1635554866,
                  "upvotes": 44,
                  "replies": {
                    "hils2a9": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hils2a9/",
                      "text": "Absolutely agree with that. I don't see any benefit of transferring. My oldest graduated from there this May and has a nice cushy job working for a financial software company. As a Michigan grad myself though I may be a bit biased. But unless you just don't like it in AA, you are taking a step down IMO.",
                      "author": "cjpeltz",
                      "created": 1635567211,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "himhtkj": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/himhtkj/",
                  "text": "As a Michigan grad and grad student (so I'm biased), there are probably only 5 schools I'd consider transferring to based on prestige, and WashU isn't one of them.",
                  "author": "ggadget6",
                  "created": 1635586334,
                  "upvotes": 2,
                  "replies": {
                    "himqb13": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/himqb13/",
                      "text": "it’s just not worth it to transfer somewhere if you’re already at a top tier school tbh. and it’s harder for you to get in because the university is going to need a really good reason you decided your T20 wasn’t enough",
                      "author": "Anacrisis",
                      "created": 1635592966,
                      "upvotes": 4,
                      "replies": {
                        "himyj8l": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/himyj8l/",
                          "text": "Yeah I agree, that's why I stayed.",
                          "author": "ggadget6",
                          "created": 1635598268,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "hinwfpo": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinwfpo/",
                      "text": "What would be those 5?",
                      "author": "Mr_Cuddlesz",
                      "created": 1635613783,
                      "upvotes": 1,
                      "replies": {
                        "hip38ux": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hip38ux/",
                          "text": "The best CS schools. Stanford, CMU, MIT, Berkeley. I said 5 just in case there's one I can't think of.",
                          "author": "ggadget6",
                          "created": 1635632422,
                          "upvotes": 1,
                          "replies": {
                            "hj1crqi": {
                              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hj1crqi/",
                              "text": "Berkeley 😏",
                              "author": "openingdoorz",
                              "created": 1635875120,
                              "upvotes": 2,
                              "replies": {
                                "hj1isw7": {
                                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hj1isw7/",
                                  "text": "Wdym",
                                  "author": "ggadget6",
                                  "created": 1635877488,
                                  "upvotes": 1,
                                  "replies": {
                                    "hj76h1f": {
                                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hj76h1f/",
                                      "text": "Go bears",
                                      "author": "openingdoorz",
                                      "created": 1635973167,
                                      "upvotes": 1,
                                      "replies": {
                                        "hj79h7h": {
                                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hj79h7h/",
                                          "text": "I'm still confused lol, I already said that Berkeley was one of the schools I'd consider to be more prestigious",
                                          "author": "ggadget6",
                                          "created": 1635974357,
                                          "upvotes": 1,
                                          "replies": {
                                            "hj8cwcr": {
                                              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hj8cwcr/",
                                              "text": "Im going to Berkeley I see that Berkeley was mentioned so I’m saying go bears Berkeley woo",
                                              "author": "openingdoorz",
                                              "created": 1635991315,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hikjmzd": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikjmzd/",
      "text": "another day another post exposing a college on my list does anyone actually like their college aha 😐🥲",
      "author": "Time-Tested",
      "created": 1635545484,
      "upvotes": 30,
      "replies": {
        "hilj7gd": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilj7gd/",
          "text": "It’s literally two days before Ed ddl and here I am reading posts one after another wanting to cross out every single college on my list WHERE AM I SUPPOSED TO GO???????😩😩😩",
          "author": "alegnA_L",
          "created": 1635562475,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hijhgfp": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijhgfp/",
      "text": "But how are the temperpedic matresses 👀",
      "author": "Fubb1",
      "created": 1635530169,
      "upvotes": 40,
      "replies": {
        "hikpude": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikpude/",
          "text": "They fit two people very well ;)",
          "author": "mjspark",
          "created": 1635548228,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hiktsxj": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiktsxj/",
      "text": "Where can I find more reviews on colleges like this",
      "author": "thecoolan",
      "created": 1635550062,
      "upvotes": 22,
      "replies": {}
    },
    "hiju7r3": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiju7r3/",
      "text": "Applied ED to WashU yesterday😐😅",
      "author": "HistoryIsDaBest123",
      "created": 1635535216,
      "upvotes": 44,
      "replies": {
        "hiju8vx": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiju8vx/",
          "text": "Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 329,388,874 comments, and only 72,877 of them were in alphabetical order.",
          "author": "alphabet_order_bot",
          "created": 1635535229,
          "upvotes": 75,
          "replies": {
            "hik74xu": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik74xu/",
              "text": "good bot",
              "author": "LegendaryRevolver",
              "created": 1635540276,
              "upvotes": 17,
              "replies": {
                "hik767b": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik767b/",
                  "text": "Thank you, LegendaryRevolver, for voting on alphabet_order_bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                  "author": "B0tRank",
                  "created": 1635540290,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            },
            "hik7pfp": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik7pfp/",
              "text": "Did they ask?",
              "author": "SteixXx",
              "created": 1635540507,
              "upvotes": -21,
              "replies": {}
            }
          }
        },
        "hil19op": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil19op/",
          "text": "I don’t think you should be regretting your decision right now. OP’s opinion is just one of many, and I for one have been really enjoying my time at WashU so far",
          "author": "Batkays",
          "created": 1635553608,
          "upvotes": 19,
          "replies": {
            "him53mx": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him53mx/",
              "text": "Lmao I'm not, but I thought it was funny. Hope to see you there next year :))",
              "author": "HistoryIsDaBest123",
              "created": 1635576008,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "him7hjg": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him7hjg/",
          "text": "Take OP's opinion with a grain of salt. I am from STL and have a few friends that went to WashU and they loved it. The city is spread out, that's true, but there is a plethora of fun things to do.\n\nThe winter does suck though, I won't lie.",
          "author": "was_stl_oak",
          "created": 1635577851,
          "upvotes": 3,
          "replies": {}
        },
        "hilk1az": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilk1az/",
          "text": "Fear not - I'm pretty happy here :))",
          "author": "friendshipinator",
          "created": 1635562896,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hikf3ba": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikf3ba/",
      "text": "LOL I thought you were talking about UWash and were calling Seattle “STL”.\n\nThat was a rollercoaster.",
      "author": "Voldemort57",
      "created": 1635543560,
      "upvotes": 20,
      "replies": {
        "hillygo": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hillygo/",
          "text": "same I was heartbroken I really wanna go there but im glad you clairfied this for me",
          "author": "Loud-War-8054",
          "created": 1635563871,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hildp63": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hildp63/",
      "text": "The way you describe it, it literally does sound like highschool. Or at the very least, a very heavy commuter school.",
      "author": "smartymarty1234",
      "created": 1635559690,
      "upvotes": 8,
      "replies": {
        "hilkaxt": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilkaxt/",
          "text": "I think covid might be coloring this person's experience - the library used to be 24/7 for example.",
          "author": "friendshipinator",
          "created": 1635563032,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hilhngj": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilhngj/",
      "text": "You just described UCLA!",
      "author": "fightonbruins",
      "created": 1635561685,
      "upvotes": 7,
      "replies": {}
    },
    "him4xie": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him4xie/",
      "text": "I have to say, some of these are just problems with most colleges near the top. I feel like people have drank kool aid about college in general. it's not \"life-changing,\" and people should disabuse themselves of the notion that getting into their dream college will be a \"dream come true.\" \n\nThe rich people problem is especially the case at every top college basically, and even non-top colleges. Food almost always sucks for one reason or another. I don't disagree though, these things might just be worse at WashU than others—heck I transferred (not from WashU), so I know what it means when ppl say a school is bad.\n\nBUT, just remember that the people who come on here to post are most likely those most disaffected. I don't doubt any of this isn't true, but let me also just put a few things out there that I actually happened to like about WashU when I was looking at colleges:\n\n1. it has a really nice campus vibe and look. idk about the gyms though.\n2. the dorms are wild\n3. they have a lot of libraries, though what OP said about them closing makes this a lot less cool\n4. they're definitely closer to downtown than other schools that are sometimes associated with cities, like UChicago, Northwestern, CMU, Pitt. For context, WashU to The Arch in Saint Louis is about the same distance as Columbia is to the One World Trade Center. Arguably though, NYC has way better public transportation.",
      "author": "copydex1",
      "created": 1635575878,
      "upvotes": 6,
      "replies": {}
    },
    "hiljnbj": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiljnbj/",
      "text": "Senior at WashU - I've had great career experiences and have an awesome job offer (a few actually) lined up. Social stuff has been a bit rockier, but that's life for you, and I'm pretty happy about where I'm at right now (and I'm not a partier - I love climbing, game nights, random events through the gym and student life, etc). I think the socioeconomic stuff is fair, but when you get off campus (which you can do after freshman year), St. Louis is actually one of the best bang for buck cities out there. There are people here who hate it, as is the case with any other school, but I love this place and I'm so grateful for the opportunities I've gotten here and the person it's made me.\n\nI think entering during COVID was an L for your experience (library used to be 24/7) and I'm sorry about that.",
      "author": "friendshipinator",
      "created": 1635562698,
      "upvotes": 15,
      "replies": {}
    },
    "hijiwph": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijiwph/",
      "text": "WashU is just a slightly better NYU.  Same rich kids’ school.",
      "author": "BSC56",
      "created": 1635530731,
      "upvotes": 19,
      "replies": {
        "hijwvtj": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijwvtj/",
          "text": "Better than usc?",
          "author": "HahaStoleUrName",
          "created": 1635536268,
          "upvotes": 4,
          "replies": {
            "hiklvws": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiklvws/",
              "text": "better than usc but not like good good",
              "author": "astrothunder818",
              "created": 1635546472,
              "upvotes": 6,
              "replies": {
                "him7n4x": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him7n4x/",
                  "text": "How can a school be a T20, better than USC and \"not good good?\" This sub is actually ridiculous.",
                  "author": "was_stl_oak",
                  "created": 1635577977,
                  "upvotes": 5,
                  "replies": {}
                },
                "hikuhhw": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikuhhw/",
                  "text": "Calling any school in the T30 \"not good good\" is just lunacy",
                  "author": "ssssseabass",
                  "created": 1635550379,
                  "upvotes": 9,
                  "replies": {
                    "hilag3v": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilag3v/",
                      "text": "Bruh A2C is wild",
                      "author": "AbstractCuriosity",
                      "created": 1635558090,
                      "upvotes": 12,
                      "replies": {
                        "hilpz5b": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilpz5b/",
                          "text": "A2C is this weird blend of toxic positivity, high schooler drama and dangerous stress culture depending on what time of the year you look at it but yeah there’s literal hundreds if not thousands of universities in the US so T30 is definitely not something to sneeze at lmfao",
                          "author": "MundyyyT",
                          "created": 1635566012,
                          "upvotes": 13,
                          "replies": {}
                        }
                      }
                    },
                    "hilajdb": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilajdb/",
                      "text": "People are allowed to have standards that differ from yours",
                      "author": "plainbread11",
                      "created": 1635558134,
                      "upvotes": 5,
                      "replies": {
                        "hilemil": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilemil/",
                          "text": "Yeah but thinking that only T5's are \"good\" is a hella unhealthy and toxic standard that should be called out",
                          "author": "AbstractCuriosity",
                          "created": 1635560159,
                          "upvotes": 12,
                          "replies": {}
                        },
                        "hilgs0a": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilgs0a/",
                          "text": "This is like if someone said any BMI over 14 was overweight and your response was \"people are allowed to have standards that differ from yours.\"\n\nObjectively speaking, going to a T30 or a T50 is already fantastic. And the vast majority of students at any of these schools end up in comparable positions to one another across these schools. The average business student at WashU ends up in the same functions as the average Wharton student and the former isn't even a target. \n\nPeople really love to focus on the margins like they're going to be the 2-3% (read: 12-20 kids) who get into a top PE firm out of undergrad instead of what they're realistically going to be: yet another kid who works at a reputable finance or consulting firm. In general, all the people trying to emphasise the vast differences between one top school and another top school in terms of quality are trying to create distinctions out of on a macroscale, very small differences. It doesn't mean they don't exist, just that for the vast majority of people going to these schools, they don't matter.",
                          "author": "doneanddead",
                          "created": 1635561242,
                          "upvotes": 5,
                          "replies": {}
                        },
                        "him7or0": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him7or0/",
                          "text": "That does not apply here where statistical standards exist lmfao",
                          "author": "was_stl_oak",
                          "created": 1635578010,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "him7jw8": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him7jw8/",
          "text": "I can't find a single area in which washu has an edge over NYU except for usnews rankings. Average departmental rankings, QS rankings, THE rankings, you name it, in all other ranking systems NYU outperforms washu. IMO its just an overhyped school at best.",
          "author": "jinuoh",
          "created": 1635577905,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hikfoh4": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikfoh4/",
      "text": "Can I honestly say, I get why people share things like this so that they can warn future applicants but I always feel like this just makes matriculants and current students feel like shit.\n\n I don't disagree with some of the points you are making but as a current WashU student I still feel like most people (myself included) worked their ass off to get here and are happy to be here so its a really sucky feeling to see people shit on my school. \n\nAgain, no hate to you or to any of the arguments you made, I am just expressing myself about something I see on this sub every once in a while.",
      "author": "AbstractCuriosity",
      "created": 1635543808,
      "upvotes": 27,
      "replies": {
        "hikrvzp": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikrvzp/",
          "text": "Listen man as someone who’s a junior and also doesn’t like the school as much as people think I do there’s far worse things that could happen to you. Having swung so far back and forth on the “love” and “hate” scale IMO WashU is a really good school whose major (and justified) point of pain for most people is how much it costs, and that is where I am at. I’m grateful that I have the chance to get educated and meet people at a top university even if I have my reservations about many of the things which happen here\n\nIf you’re going and enjoying your time at WashU without any major complications then who am I to judge? It is not as if this school is a diploma mill. And FWIW even though my home department (ESE) is super small and barely T50 there are still a lot of great outcomes from our graduates; half of our graduating class is going to T10 MS &/or PhD programs in their major, being surrounded by people that smart is inspiring. \n\nYou’re pre-med and the opportunities speak for themselves in that regard, that’s WashU’s entire shtick. If you have the means then go for it man, you aren’t making a wrong choice and it will get you where you want to be for sure",
          "author": "MundyyyT",
          "created": 1635549173,
          "upvotes": 9,
          "replies": {
            "hiktqnh": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiktqnh/",
              "text": "Eyy you're one of the r/washu mods, aren't you? I didn't know you were ESE, that's cool. I am actually CSE right now.",
              "author": "AbstractCuriosity",
              "created": 1635550033,
              "upvotes": 4,
              "replies": {
                "hikwx2y": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikwx2y/",
                  "text": "The only one at this point ahah but yeah, I’m ESE. There are dozens of us\n\nReally good department, I’m on basically a first name basis with some of the professors. Super supportive people too",
                  "author": "MundyyyT",
                  "created": 1635551517,
                  "upvotes": 1,
                  "replies": {
                    "hikzlfn": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikzlfn/",
                      "text": "Awesome, that's great to hear! Also what happened with all the mods? I didn't realize you were the only one.",
                      "author": "AbstractCuriosity",
                      "created": 1635552805,
                      "upvotes": 1,
                      "replies": {
                        "hikzo71": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikzo71/",
                          "text": "I’m also confused. Toasty was the only other active mod but his account got straight up smited",
                          "author": "MundyyyT",
                          "created": 1635552842,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hilfzcd": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilfzcd/",
      "text": "If you decide on a college by reading one persons experience you will never find your college. Believe me at at Ivy League, Public University, liberal arts college, etc people will have bad experiences. You need to find the college that works for you and will make you a confident and successful student. Clearly this person did not find the right place in Wash U. I did find the right place in Wash U and I’m succeeding in my classes, friendships, clubs and much more. So stay open minded and find your place. Everyone’s experience is different. I think whoever wrote this should transfer and keep their sad experience to themselves and let others find out what works for them. Stop looking for people to commiserate with you and look at yourself and make a change.",
      "author": "One-Concentrate-3406",
      "created": 1635560843,
      "upvotes": 16,
      "replies": {
        "hilgh3z": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilgh3z/",
          "text": "See, way to discount my experience lol. I have nothing against people who succeed at WashU - by your metrics I am successful at WashU too. I'm just finding it difficult to be *happy* and justify the *value* of the university.",
          "author": "Familiar-Ad5781",
          "created": 1635561091,
          "upvotes": -7,
          "replies": {}
        }
      }
    },
    "hikphm0": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikphm0/",
      "text": "As a low-income first-year student at WashU, I disagree with most of this\n\nFor example, WashU offered me more financial aid than both of my state’s public flagships (Purdue and Indiana University)\n\nAlso, the party scene is very healthy. Literally nobody cares if you don’t drink or smoke as long as you don’t criticize the people who do. Additionally, enough first-years here have cars for you to easily find friends who can take you places\n\nMost importantly, according to both the upperclassmen I’ve talked to and public statistics, the school definitely has great opportunities for resume building\n\nI think this post was written by someone either very unlucky or very bad at networking. I’m loving WashU and most of the people here, but I also chose my suite mates carefully and knew that I loved how the campus is near the city without being in the center \n\nI’m happy to answer questions. Best wishes!",
      "author": "mjspark",
      "created": 1635548068,
      "upvotes": 30,
      "replies": {
        "hikzebe": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikzebe/",
          "text": "Same I’m a freshman and honestly I think OP is just hanging with the wrong crowds. They also start last year though when everything was online. I’ve enjoyed my time, have never had to spend $20 on a meal (most are around $10), and I think the internship complaints depend on the person… your college isn’t holding you back especially when it’s a school like WashU. The social scene here seems balanced too.",
          "author": "jamnic",
          "created": 1635552710,
          "upvotes": 10,
          "replies": {}
        },
        "hil01ke": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil01ke/",
          "text": "I graduated a couple of years ago from WashU and agree with everything you’re saying. OP doesn’t like WashU or his college experience, and he’s sharing his personal opinions like they’re facts. Part of it is probably that COVID has impacted things from the dining experience to the social life. It also seems like he didn’t have a good financial match with Wash U in terms of financial aid.\n\nAnyway, I think that OP is sharing just what his experience has been like, and it’s very different from my experience too. I wasn’t into drinking or partying or anything, and I still found things to do for entertainment. I didn’t have a car and took the bus or metro.\n\nThe library seems like it could have been another casualty of COVID because it definitely did not close at 8 when I was a student. It was open 24 hours, so you could be there super late working on a group project.\n\nI didn’t have any business connections or network, but I got internships during my rising junior summer and rising senior summer through the career center (so Wash U’s connections). I also am involved in recruiting for the company I work for and we have recruiting events at Wash U and a bunch of different colleges both public and private.\n\nThere were things I didn’t like about my college experience, but I really would have felt the same way at any college.\n\nBut this should be a reminder to research your college. If you want to be in a city, don’t go to a school like Wash U that’s really in a suburb.",
          "author": "feartherex",
          "created": 1635553023,
          "upvotes": 12,
          "replies": {
            "hillwo2": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hillwo2/",
              "text": "+1 to this (also recent grad)",
              "author": "gobears58",
              "created": 1635563846,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hiliux4": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiliux4/",
          "text": "Do you think it's a good idea for a comp science kid to go there? I don't give a shit about the education I just want a competitive environment with good networking, any thoughts?",
          "author": "NarutoDragon732",
          "created": 1635562295,
          "upvotes": 2,
          "replies": {
            "hinhcts": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinhcts/",
              "text": "If you have the option I’d always pick a CS powerhouse over Wash U . That being said it won’t hold you back in anyway. They have alumni working at all the Big name tech companies and if you adjust for student body size have one of the highest Google / Facebook percentages Nationally. Tech is one of this industries where you as an individual matter much more than the school you went to.",
              "author": "pianoloverkid123456",
              "created": 1635607437,
              "upvotes": 4,
              "replies": {}
            },
            "hilqc1k": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilqc1k/",
              "text": "I don't go to WashU, but I did decide not to go there and go to a public school that has a better CS program (at least in terms of reputation). WashU is a great school, but if you're doing CS, there are arguably better choices.",
              "author": "gargar070402",
              "created": 1635566215,
              "upvotes": 3,
              "replies": {
                "hilqk3c": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilqk3c/",
                  "text": "Like I said, don't really care for the degree or education itself. I'm gonna be self taught in my area regardless, just going for the competitive aspect and connections.",
                  "author": "NarutoDragon732",
                  "created": 1635566345,
                  "upvotes": 1,
                  "replies": {
                    "hilqq8s": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilqq8s/",
                      "text": "When I say good CS programs, I also mean that in terms of prestige, networking, and career prospects. Multiple public schools (UIUC, UMich, Georgia Tech) have better career connections for CS than WashU despite WashU being ranked higher overall.",
                      "author": "gargar070402",
                      "created": 1635566444,
                      "upvotes": 1,
                      "replies": {
                        "hilsdtd": {
                          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilsdtd/",
                          "text": "Good point. I'll definitely be on the look out for those schools if I get admitted.",
                          "author": "NarutoDragon732",
                          "created": 1635567400,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "him8cfy": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him8cfy/",
              "text": "I’m a compsci student, and I can assure you that WashU is a great place to be competitive against *yourself*\n\nBoth the classes and student body as a whole are very collaborative, but you can push yourself as far as you want \n\nFor example, I’m working on a MedTech software startup with a team of grad students. Your goal at any cs program should be creating meaningful projects outside of class\n\nNonetheless, nobody would consider WashU’s program a cakewalk either. The professors purposefully challenge students, but the environment is completely different (and subjectively better) than most schools\n\nIf you want a great student life on top of endless opportunities to network and build your resume, WashU is perfect \n\nIf you want a program that’s known for weeding out a significant amount of cs majors while offering a relatively awful student life… why?",
              "author": "mjspark",
              "created": 1635578527,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hil8lgb": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil8lgb/",
      "text": "Washu alum here. They're not entirely wrong.",
      "author": "White_Knights",
      "created": 1635557185,
      "upvotes": 8,
      "replies": {}
    },
    "hijuxsy": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijuxsy/",
      "text": "Earlier this year when someone boasted that  \"[UChicago had a 2% acceptance rate for RD this cycle](https://www.reddit.com/r/ApplyingToCollege/comments/ma3n0f/uchicago_had_a_2_acceptance_rate_for_rd_this_cycle/)\", I pointed out that schools like UChicago has a very low RD yield. Early applicants make up roughly 60% of the incoming class of Washington University in St. Louis and an estimated 80% of that of the University of Chicago. You've to ask why some \"prestigious\" schools need to use ED2 to lock in students. If those reasons for the low RD yield apply to you, don't fall into the trap of prestige.",
      "author": "JJKKLL10243",
      "created": 1635535507,
      "upvotes": 14,
      "replies": {
        "hijw6d5": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijw6d5/",
          "text": "Lmao they let like 70% of my students in RD last year anyway. None went.",
          "author": "CollegeWithMattie",
          "created": 1635535993,
          "upvotes": 9,
          "replies": {}
        },
        "hilkuif": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilkuif/",
          "text": "> You've to ask why some \"prestigious\" schools need to use ED2 to lock in students.\n\nYour argument seems a bit nonsensical to me. UChicago is undoubtedly prestigious. As are schools like Vanderbilt. Different schools have different tactics in order to draw more students and build the reputation of their schools, and choosing to laser focus on this one point is a bit meaningless. \n\nWe've become so desensitised to low acceptance rates that we've seemed to forgotten that even acceptance rates that would feel high today for a top school (say 30-40%) still means that roughly half or more of students who are *perfectly qualified* to attend a school and would be predicted to succeed at said school, are getting rejected. \n\n All of the Ivies who do ED accept 40%+ through ED and many (like Penn) do over half their class through ED. This ignores that schools like Penn were early adopters to ED because they were specifically afraid of losing talent to the T5 and being seen as second choice schools. UChicago doing 80% from early is certainly abnormally high, but don't they also have EA?\n\nWhich brings up the question: does that mean Penn, an Ivy, was not prestigious back then. Or that we should put prestigious in quotes. Even back then, Penn was a T10. If so, then we're really restricting prestige to refer to like 2-3 schools in which case it's basically meaningless. \n\nAlso, I think people always try to find some way to measure prestige in a simple and easy to reference number and that is always going to fail. Yield doesn't mean much. BYU has one of the highest yields in the country on account of Mormonism for example. Yield results can also be a reflection of financial aid and the packages that UChicago is giving, as much as it is a reflection of prestige. \n\nAlso, yield rate falling for ED is common. I don't think any of the ED Ivies break 50% for RD yield rate IIRC. Do we actually know what UChicago's RD yield rate is? For example, if they accept a very low number from ED but still maintain something between a 40-50% RD yield rate, then that means that they are still competitively vying for students who are admitted at other T10s (if you assume that there are cross admits) since as I stated before, <50% is where the RD yield for schools like Columbia and Penn are. Northwestern an Ivy+, admitted 3654 students in total and 1901 attended. Of those 1105 were admitted under ED. Which means 796 students attended through RD. That gives us an RD yield rate of 31% vs. an overall yield rate of 52%!!! UChicago doesn't publish CDS so I can't check but keep in mind Northwestern is an Ivy+ that is regularly T10 and always T15. \n\nAccording to this, UChicago's yield rate was 73.6% for co24. They accepted 2511 in total and 1848 chose to attend. If 80% of those who attended were ED, then that means 370 students were accepted RD and attended. Since 1478 students were ED/EA, then that means their RD yield rate is (370/ (2511 - 1478) which gives us a yield rate of 35.8% through RD yield. That still places them firmly above what Northwestern got. Also, do you remember where you saw that UChicago's ED acceptance was that high? I think it'd be ridiculous for the ED to be 80%, which makes me think at least part of it would be through EA. In which case UChicago's yield would obviously go higher. If we ran a simple scenario where 70% were through ED and the rest were EA/RD, you'd reach 42% EA/RD yield rate which is much closer to the Ivy Ballpark. \n \n****\n\nAnd going back to my point about tools used to lower acceptance rates and other things, let's think about just how many different tactics are used in order to draw more students and raise the prestige of a school:\n\n- ED: As you've mentioned, ED is an obvious one as is ED2. \n\n- REA: REA is also used similarly. There isn't any inherent need to have an early round and schools like USC do not have REA or ED. USC could almost certainly drop its acceptance rate a few percentage points by implementing an ED but they don't.\n\n- Likely letters: Likely letters are a way to also lower acceptance rates and increase yield rate, and get students. Why use it? Does a school like Princeton really need to give out likely letters? Are they really prestigious if they have to resort to doing so? \n\n- Common App adoption: Use of the common app (and also getting rid of supplements in order to get more applications and such) is a great way to increase your application pool and many schools have done so and seen acceptance rates get halved or more. Schools like Georgetown have resisted though on the premise that you get a lot more students who'll apply but who aren't committed and Georgetown would prefer students who actually want to go there. Are schools like Harvard really prestigious if they need to be on the common app to keep their acceptance rates so low? \n\n- Marketing: All of the marketing you've seen such as flyers, emails, free gifts, etc. are all just ways for colleges to convince you to apply and give them an opportunity to reject you. Is MIT really that good if they're having to send you an email to try and convince you to apply?\n\nI'm obviously being facetious here but my base point is that ED strategy is only one tactic and a lot of schools do things in order to try to improve their status. Harvard is Harvard, but part of the way it stays Harvard and not just another school among the mix is by cultivating its reputation and working hard to stay ahead of the game. Prestige is a finnicky thing in that it is sticky but also very malleable. The rise of schools like Northeastern is a great example of this. People tend to hold the biases they have for schools that they developed when they themselves were in schools. Case in point: a lot of old people in NYC tend to have a very underwhelming view of NYU because they remember the times when NYU almost went bankrupt and when it was treated as a safety school. But the new generation tends to have a very different view for obvious reasons and even in 20 years if NYU becomes worse, they'll probably still have a similar perception of NYU being a very good school even if it objectively isn't.",
          "author": "doneanddead",
          "created": 1635563299,
          "upvotes": 2,
          "replies": {
            "hilv047": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilv047/",
              "text": ">UChicago doesn't publish CDS so I can't check but keep in mind Northwestern is an Ivy+ that is regularly T10 and always T15.\n\nT10? T15? Do you say that in real life?  LMAO. You seem to be a faithful reader of U.S. News & World Report and take its content as facts. Many people don't blindly trust information on a magazine and like to do their own research. They find that UChicago doesn't  publish either CDS or admission statistics. Some people like it this way, some don't. People also observe that UChicago itself chose to join  ED2 league (like Northeastern University, Case Western Reserve University, Boston University, Tufts University, NYU, Emory University, Vanderbilt University, WashU, etc.). They form their own opinions about how attractive a school views itself. Most people who need FA think SCEA schools >= ED schools >= ED2 schools. Also someone [posted](https://www.reddit.com/r/ApplyingToCollege/comments/pap3a2/if_you_need_any_financial_aid_dont_apply_to/) here recently that UChicago front-loaded financial aid packages. Middle-class will be turned off by such information.",
              "author": "JJKKLL10243",
              "created": 1635568962,
              "upvotes": 7,
              "replies": {
                "himd1vt": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/himd1vt/",
                  "text": "Totally agree with u. I have always found UChicago's ed plan/ed statistics weird (a bit uncomfortable lol). it seems like (more like 95+%) they LOVE admitting people in the early rounds so that they could...lock up the $? our school counselor has always said that if we want to go to UChicago, applying ED/EDII is the only shot lol. I've also met plenty of Uchicago students who had trouble with their FA after their freshman year. I don't have a problem with schools that have a large ED crowd but Uchicago just radiates a weird energy :)",
                  "author": "Last-Ad7706",
                  "created": 1635582358,
                  "upvotes": 2,
                  "replies": {}
                },
                "himd01y": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/himd01y/",
                  "text": "Totally agree with u. I have always found UChicago's ed plan/ed statistics weird (a bit uncomfortable lol). it seems like (more like 95+%) they LOVE admitting people in the early rounds so that they could...lock up the $? our school counselor has always said that if we want to go to UChicago, applying ED/EDII is the only shot lol. I've also met plenty of Uchicago students who had trouble with their FA after their freshman year. I don't have a problem with schools that have a large ED crowd but Uchicago just radiates a weird energy :)",
                  "author": "Last-Ad7706",
                  "created": 1635582316,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hijyq5d": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijyq5d/",
      "text": "As a parent I want those who may have applied to not get too worried. Every campus has people who don't have good experiences. If its right for you then go for it.",
      "author": "mbrown2626",
      "created": 1635536978,
      "upvotes": 19,
      "replies": {
        "hik0j9q": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik0j9q/",
          "text": "See this is fine, but the point is a lot of high school seniors, myself included when I was a senior, get blinded by prestige or some other notion of what college should be like. This post provides a look from the inside so people can make a better decision.",
          "author": "Familiar-Ad5781",
          "created": 1635537670,
          "upvotes": 22,
          "replies": {
            "hik5e8s": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik5e8s/",
              "text": "100%. You have to do more that just look at a schools ranking. Just because it's T20 doesn't mean you are going to like it. IMO the school ranking should never be a deciding factor.",
              "author": "mbrown2626",
              "created": 1635539577,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "hik8dqi": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik8dqi/",
          "text": "This is true, but it definitely feels like a disproportionate amount at elite institutions. At least that is the general feeling I have gathered from speaking to people from a wide variety of schools.",
          "author": "thatcornellbitch",
          "created": 1635540780,
          "upvotes": 3,
          "replies": {
            "hik9g8x": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hik9g8x/",
              "text": "So I went to a big state non T20. Had a blast and loved every minute of it. But then I was never going to be a T20 school student. There are people who hate the state university scene as well. I have relatives who went T20 and loved it. So it’s really finding the right fit for you. But again, school ranking should not be your deciding factor. You have to look at the entire experience you will be having.\n\nThis summer I took my son to some of the T20 campuses. Some he loved and some he hated.",
              "author": "mbrown2626",
              "created": 1635541209,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hils1u4": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hils1u4/",
      "text": "I’m not a recent graduate, but this does not match my experience. It also does not match the experiences of recent grads I do know. \n\nI see a lot of “vaguely specific” issues here that could very easily apply to a long lost of “prestigious” schools. NU, Duke, Vandy, Cornell, Brown, Rice, Tufts, Emory, and so on. Just off the top of my head. Are these schools expensive?  If you’re not someone who will receive some of their very generous merit assistance, then yea they are. $80,000 per year isn’t cheap. Are they expensive compared to the 65,000/yr people would shell out to (insert non-tippy top Catholic university here)?  No they’re a total bargain compared to those schools. And for many public universities, it really does depend. \n\nBut these criticisms aren’t things I hear from recent grads...and I am connected with many of them. But I’m not qualified to answer/refute anything here because it’s been too long for me. \n\nA couple of things that a couple decades since college has taught me:\n\n1-don’t pick a school based upon how you think others will perceive it or an idealized version of what you think college will be.  You’re picking for the wrong reasons and you’ll be disappointed. \n\n2-there will always be people who complain about the X. I knew a minority of folks at my time at WashU who loved to complain about the school. I keep in touch with a couple as distant Facebook friends. Know what they do now?  They complain about their jobs, the city they live in, the high school their kids got into, restaurants, etc. This isn’t to say there can’t be valid complaints about something that many people find to be “good” or enjoyable. But when someone goes on a “don’t go to x” rant about something other “consumers of x” are happy with, it raises some interesting questions.",
      "author": "ChampionshipPerfect5",
      "created": 1635567204,
      "upvotes": 6,
      "replies": {}
    },
    "hil7wzu": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil7wzu/",
      "text": "are you freaking serious i just submitted my ed 1 application",
      "author": "Nice-Scholar-3137",
      "created": 1635556855,
      "upvotes": 5,
      "replies": {
        "hinlsuu": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinlsuu/",
          "text": "literally me right now i'm gonna scream",
          "author": "Rate_International",
          "created": 1635609330,
          "upvotes": 2,
          "replies": {}
        },
        "hiwbn5y": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiwbn5y/",
          "text": "Don’t worry; this is a subjective experience and I promise that this is not the consensus of student experiences on campus.",
          "author": "born2bewilder",
          "created": 1635782894,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hilklkv": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilklkv/",
      "text": "If you look at the transfer subreddits, there are always so many students trying to leave WashU... Not surprised.",
      "author": "FlaminFatHippo",
      "created": 1635563175,
      "upvotes": 4,
      "replies": {}
    },
    "hinnfr1": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinnfr1/",
      "text": "WashU sophomore here. I’m just gonna throw my hat into the ring here. I get that OPs experience is theirs, but mine has been drastically different. \n\nRight out of the gate, the price tag is a lot. Scholarships help, but it’s still expensive. \n\n- Social Life\n\nAs far as social life, we started college during covid, and WashU was pretty strict at the beginning of last year. I can see how people struggled to socialize. Personally, I made a lot of really good friends, and now that Covid restrictions have been eased, I’m making more. \n\nAdditionally, I don’t drink, but I haven’t had any issues with others. If I’m not drinking at a party, that’s just more for those who do. \n\nThe criticism of the loop as stale is understandable, but also flavored by covid. There are restaurants, a movie theater, and a concert venue, all of which are more active now. Outside of the loop, there are still a lot of things to do. We have a top-tier Botanical Garden, a nice art museum, a zoo, and forest park, which is absurdly awesome. \n\nI really take issue with OPs comments about commuting. Sure, a car would be nice, but a bike is significantly cheaper, and St. Louis is a very bike-friendly city. Last year, I commuted year-round, and I think there were about 2 weeks that I didn’t bike (heavy snow). In those situations, the public transportation was a completely functional replacement. \n\nI come from Chicagoland, so Metra/CTA has definitely spoiled me, but the STL system isn’t terrible. The buses/trains run frequently enough, and are FREE for students. There are some parts of the city the trains don’t cover, but a bike+train or a bus can get you there easily enough. \n\nI will say that a lot of my peers don’t have experience with public transportation, but the Metro is fairly easy to learn.  \n\n- Campus + Vibe\n\nThe air of wealth is tangible. I do not understand how some people budget, but I suppose the wealthy don’t need to.\n\nThe gym is small, and you still have to reserve pool times (covid), but you can find times when it isn’t too crowded. \n\nDining services is laden with issues, especially since I’m vegetarian and health-conscious (I’m not going to eat pizza and fries every night). The food is mediocre and overpriced, and there is no buffet. That said, this is mostly due to covid/supply shortages/labor shortages, which are not choices made by dining services. I compensate by buying groceries+cooking or ordering out (usually once a week). Food is by far my biggest expense, but my campus-job more than covers it. \n\nThe libraries closing is also something that irritates me. However, it is due to staffing shortages, which is technically beyond the university’s control. \n\n- People\n\nThis is my favorite thing about WashU - the people are generally nice. I have randomly reached out to strangers in my classes with questions or to form study groups, and they have been very receptive. You can walk into a public space and easily chat someone up about general classes. For the most part, professors have been pretty nice people, too. \n\n- Career Opportunities\n\nI’m premed, and covid has staunched many clinical volunteering/shadowing opportunities. However, research here is fantastic. I reached out to a few labs last year, chose one, and have had a wonderful experience. Everyone is supportive and ready to help me understand things, and I get to do work that interests me. \n\nSorry for the essay. \n\ntl;dr:\n\nCons: \n\n- Lack of healthy, vegetarian options (COVID influenced)\n\n- Library hours are short (COVID influenced)\n\n- Expensive\n\n- Sometimes, St. Louis\n\nPros: \n\n- Nice people\n\n- Good opportunities\n\n- interesting and engaging classes\n\n- solid academic support system (for most classes, writing, presentations, and developing healthy study skills)\n\n- St. Louis, sometimes \n\nFeel free to DM if y’all have any questions.",
      "author": "Patelved1738",
      "created": 1635610018,
      "upvotes": 6,
      "replies": {}
    },
    "hilq6pj": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilq6pj/",
      "text": "I was thinking to apply as a transfer from UCI in CS. Welp, UCI apparently is much better",
      "author": "Zarqus99",
      "created": 1635566131,
      "upvotes": 2,
      "replies": {}
    },
    "hingmf3": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hingmf3/",
      "text": "Mods, can you get proof that this person is actually a student at WashU?",
      "author": "StonkToro",
      "created": 1635607111,
      "upvotes": 2,
      "replies": {}
    },
    "hinmnbc": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinmnbc/",
      "text": "I'm from STL and there's actually a lot of really fun and cool stuff to do.. While you're there be sure to take advantage of all the cool places to eat. I think someone who says there's nothing to do is just boring in themself or depend on other people to have fun with them. Also, there's not just the winter, there's fall, spring, and summer. STL weather can surprise you.",
      "author": "CoochConnoiseur",
      "created": 1635609685,
      "upvotes": 2,
      "replies": {}
    },
    "hintgfj": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hintgfj/",
      "text": "To be fair the same can really be said about any top school lol",
      "author": "bourgewonsie",
      "created": 1635612542,
      "upvotes": 2,
      "replies": {}
    },
    "hinuczo": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinuczo/",
      "text": "good thing I’m applying to uw 😜",
      "author": "dragonfruitcoin",
      "created": 1635612919,
      "upvotes": 2,
      "replies": {}
    },
    "hijvzkf": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hijvzkf/",
      "text": "Does the term “$300,000 parking lot” match your experience?",
      "author": "CollegeWithMattie",
      "created": 1635535921,
      "upvotes": 13,
      "replies": {
        "hikytrk": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikytrk/",
          "text": "Must be pennies in the eyes of the spoiled kids you take on",
          "author": "ssssseabass",
          "created": 1635552434,
          "upvotes": -2,
          "replies": {
            "him7gkq": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him7gkq/",
              "text": "lol",
              "author": "Evan__S",
              "created": 1635577831,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "him2dg4": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him2dg4/",
      "text": "I'm a current junior at washu and I feel like there are some valuable points here. If you aren't pre-med or business, the career connections won't come to you, rather you have to go to them. I agree with OPs sentiment that friends at state schools have secured better internships simply because their school was better known. Also St Louis is horribly difficult to get around. You need a car or to know multiple people with one. Also the library thing is true, but due to the absurd way money is structured for our budget.\n\nOP also has some questionable complaints tbh, and this might be somewhat due to covid. The food is def better than average at a college. The gym is fine, it's just a public gym. And the education is really good (at least for my major in the engineering school). Sure it's missing some classes you would have at a bigger school, but you can easily meet your professors, engage in research and enjoy what you are learning, and it's not impossibly difficult (unless you want to do chem). I would take OPs comments seriously, but also look into them yourself. Everyone's experience differs.",
      "author": "jwspenc",
      "created": 1635573964,
      "upvotes": 4,
      "replies": {}
    },
    "hikp179": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikp179/",
      "text": "lol wtf i go to washu and most of this stuff is just straight false.",
      "author": "Bradmund",
      "created": 1635547865,
      "upvotes": 8,
      "replies": {
        "hiktihz": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiktihz/",
          "text": "I definitely disagreed with a lot of things they implied about the environment, things like food and cost do hold some truth though.",
          "author": "AbstractCuriosity",
          "created": 1635549926,
          "upvotes": 8,
          "replies": {
            "hip4r8s": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hip4r8s/",
              "text": "The cost argument is the same argument you could make for roughly 30 of the most selective private national universities and another 30 or so of their LAC counterparts. They’re all about 80,000 all in per year, right?",
              "author": "ChampionshipPerfect5",
              "created": 1635633139,
              "upvotes": 2,
              "replies": {
                "hip4zxv": {
                  "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hip4zxv/",
                  "text": "Yeah I don't know why Washu gets singled out for cost when its the same issue at a number of T30 universities. Its most likely because they weren't need blind but that is not the case anymore.",
                  "author": "AbstractCuriosity",
                  "created": 1635633254,
                  "upvotes": 2,
                  "replies": {
                    "hip6oft": {
                      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hip6oft/",
                      "text": "Funny thing about when they weren’t need blind:  aid per total FT student was actually already higher than many of their T30 counterparts. Better than CMU, Emory, Notre Dame, Georgetown. Better than NYU (doesn’t meet full. need), USC, etc. If I made a table of % FT undergrads getting need based aid, $ per recipient, and $ per FT undergrad, people here couldn’t pick the school out without looking at common data set. Remove the best aid (HYPSM), take the next 25 private universities and they were already middle of the road.",
                      "author": "ChampionshipPerfect5",
                      "created": 1635634059,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hikt9wj": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikt9wj/",
          "text": "Hmmmmm",
          "author": "HahaStoleUrName",
          "created": 1635549816,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hike1j1": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hike1j1/",
      "text": "You make a lot of fair points but it seems like you also just have a general negative vibe for WashU. Keep in mind I am a junior currently at WashU so feel free to take my opinion with a grain of salt.\n\nThe school is NOT in the city and in the suburbs, yes you will need a car or uber to visit places, but a lot of main places like the mall or the city are accessible THROUGH THE METRO which we get for free.\n\nThe endowment is not only for the campus, which WashU is still trying to expand and goes to paying for student scholarships as well as multiple student programs (where do you think all the event and SU funding come from). As far as the gym goes, it's a bit more crowded this year because of COVID as well, my freshmen year the S40 gym was open so everyone was more dispersed. \n\nThe food opinion I agree with you, I dislike the meal point system and wish we had swipes because I blow all my meal points quickly, however I promise you the food was better in previous years + if everyone had swipes it wouldn't be fair to the students who just eat less but pay for the students who eat more, which is why WashU has different meal plans. \n\nSocial scene at WashU is literally fine. Not everyone is a fratbro nor will you miss out if you don't want to party, there are a lot of open people here and you just have to find the ones that you vibe with. There are always student events going on each week, and forrest park and the loop provide decent entertainment, there's also sporting events in the city, so I wouldn't stay there's nothing to do, keeping in mind that we're still students and work increases exponentially each year (at least for MechEs).\n\nOverall college is what you make of it. I wanted to transfer out because of social situations but I have never had anytbing against WashU because the education is amazing and the teachers genuinely care about your learning if you reach out. Also the Weston Career Center does a helluva job prepping you for interviews.\n\nPM if anyone wants more details, I try to be unbiased",
      "author": "thejman8695",
      "created": 1635543117,
      "upvotes": 3,
      "replies": {
        "him7szu": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him7szu/",
          "text": "Calling WashU \"in the suburbs\" is a bit of a misnomer. It's not in Midtown like SLU, but it is right next to Forest Park, Delmar, and the Central West End. It's not like it's in Creve Coeur or something. Other than that, though, you're right.",
          "author": "was_stl_oak",
          "created": 1635578100,
          "upvotes": 1,
          "replies": {
            "hip5wq0": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hip5wq0/",
              "text": "Correct. It’s an inner ring, pre-auto streetcar suburb. Much more urban and walkable than areas within the boundaries of many cities. There are even 10-20 story condos and apartments right down the street on Skinker. Calling the campus suburban is kind of like calling Evanston or Oak Park suburban. Not what most 18 year olds think of when you say suburban.",
              "author": "ChampionshipPerfect5",
              "created": 1635633687,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hikvym3": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikvym3/",
      "text": "I just submitted my washu ED application like an hour ago….. I thought washu’s pre-med and psych are pretty nice",
      "author": "wwhhwhhwww",
      "created": 1635551064,
      "upvotes": 2,
      "replies": {
        "hilkdja": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilkdja/",
          "text": "Yeah, worry not. I'm really happy to be at WashU.",
          "author": "friendshipinator",
          "created": 1635563067,
          "upvotes": 3,
          "replies": {}
        },
        "hil4ccg": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil4ccg/",
          "text": "They are, don't worry",
          "author": "ssssseabass",
          "created": 1635555088,
          "upvotes": 1,
          "replies": {}
        },
        "hilq31a": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilq31a/",
          "text": "They are, the school is just expensive",
          "author": "MundyyyT",
          "created": 1635566073,
          "upvotes": 1,
          "replies": {}
        },
        "him7xqk": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him7xqk/",
          "text": "They are.",
          "author": "was_stl_oak",
          "created": 1635578201,
          "upvotes": 1,
          "replies": {}
        },
        "hiwc0kj": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hiwc0kj/",
          "text": "As a former pre-med with psych minor, this is an incredible school to go to. Had an amazing experience that I wouldn’t have found anywhere else.",
          "author": "born2bewilder",
          "created": 1635783057,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hikzoo2": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikzoo2/",
      "text": "Welp I have been going back and forth on ED or RD to WashU and I guess this is the final sign I should RD",
      "author": "International-Dot-94",
      "created": 1635552849,
      "upvotes": 2,
      "replies": {
        "him7ydu": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him7ydu/",
          "text": "Do not base your decision on a Reddit post.",
          "author": "was_stl_oak",
          "created": 1635578215,
          "upvotes": 7,
          "replies": {
            "hinkabg": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinkabg/",
              "text": "Deciding to apply early days before the deadline is not a good idea anyway",
              "author": "International-Dot-94",
              "created": 1635608696,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hil4axr": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hil4axr/",
          "text": "If you go to WashUs subreddit you'll see almost everyone disagree with this person",
          "author": "ssssseabass",
          "created": 1635555069,
          "upvotes": 7,
          "replies": {
            "himsaav": {
              "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/himsaav/",
              "text": "they're drunk on the kool-aid unfortunately",
              "author": "wustlbear24",
              "created": 1635594375,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hilljwh": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilljwh/",
      "text": "thank you for your sacrifice. i will not be applying",
      "author": "runningmanez",
      "created": 1635563661,
      "upvotes": 0,
      "replies": {}
    },
    "him95rn": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/him95rn/",
      "text": "we need more people like this ngl",
      "author": "pottytrainedniqqer",
      "created": 1635579200,
      "upvotes": 1,
      "replies": {}
    },
    "hilxnox": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hilxnox/",
      "text": "Wait is this the one that is in Seattle?",
      "author": "hjdaboss123",
      "created": 1635570661,
      "upvotes": -1,
      "replies": {}
    },
    "hin5xyt": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hin5xyt/",
      "text": "thank you for posting.  It's really helpful to have insights from people have different kinds of experiences rather.",
      "author": "lad-Ad3411",
      "created": 1635602130,
      "upvotes": 1,
      "replies": {}
    },
    "hin859f": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hin859f/",
      "text": "Endowment returns are abnormally high for all colleges rn, that's not really a good way to judge size.",
      "author": "askpat13",
      "created": 1635603180,
      "upvotes": 1,
      "replies": {}
    },
    "hinmjai": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinmjai/",
      "text": "I'm from STL and there's actually a lot of really fun and cool stuff to do.. While you're there be sure to take advantage of all the cool places to eat. I think someone who says there's nothing to do is just boring in themself or depend on other people to have fun with them. Also, there's not just the winter, there's fall, spring, and summer. STL weather can surprise you.",
      "author": "CoochConnoiseur",
      "created": 1635609639,
      "upvotes": 1,
      "replies": {}
    },
    "hipbcxv": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hipbcxv/",
      "text": "Current WashU student - I disagree with most of this. One fair point is the price. It is very expensive for what you get, but besides that, I think the school is awesome.\n\nFor the people, sure, there are insincere people who I don't want to be around, but those people are everywhere, all around the world and at every school. I find the vast majority of my interactions with people from my classes to be enjoyable.\n\nI think it is easy to feel left out of things like ubering to the clubs and whatnot. However, when you actually get down to it and talk to most people on campus - most people, especially freshmen, don't engage in that kind of stuff. It's a smaller but very loud percentage who consistently do. Just like any other school, you can find plenty of people like yourself who do things that you like and that make you happy.\n\nThe food situation is tough right now, but that is largely due to COVID related stuff and labor shortage. While I definitely want better right now, I have been impressed with their responsiveness to student and parent complaints (albeit a little slowly) with implementations such as expanded dining hours and bringing food trucks to campus.\n\nAs for things you didn't mention, I have had a great academic experience. One thing that I have found that differentiates the experience from friends I have at state schools is the support structure and availability of classes. Just like any other school, there will be classes that are hard to get into but I have largely found that I can get a spot in most classes I want,  usually at a time that works for me. Almost all of my professors have been amazing , but all of them have been incredibly supportive and have a genuine interest in helping their students succeed. The same goes for my counselors - my 'assigned' counselors are available and helpful and I have found it easy to arrange meetings with counselors not assigned to me who specialize in different areas. It is pretty easy to get support on whatever I need. Another thing that I think is worth mentioning is the campus - it's absolutely beautiful :).\n\nOverall, as you pay more for school you definitely start to reach a point of diminishing returns, and, admittedly, I think WashU is a little past that point. This would surely be something important to consider for someone considering taking out a good amount of loans. However, I think the school itself is a wonderful environment that allows different students to thrive and enjoy their time.\n\nEdit: A few more things I forgot to mention after scrolling through a few comments:\n\n\\- St. Louis is dangerous, but not near campus. The majority of the dorms aren't even in St. Louis, they're in Clayton - a much more affluent area. \n\n\\- Public transportation exists and is decent (not NYC or Boston). There are metro stops (lightrail) right off of campus that can take you all over St. Louis. You do want to make sure to get off in time though, they will take you into the parts of St. Louis where you probably don't want to be. WashU also runs busses to a popular eating spot, around campus, and to other WashU locations nearby. There are public busses, but I haven't used those much. WashU students get free transportation on all those busses and the metro.\n\n\\- The dorms are mostly very nice. Even a pretty standard living situation puts you in a room with one roommate and then you share a bathroom with another two. The rooms are big enough where I have never felt cramped and have no problem storing all my stuff. We also get AC and heat control. One thing I will mention is there is a small percentage of the dorms that do not enjoy these same features.",
      "author": "throwaway13957838",
      "created": 1635636379,
      "upvotes": 1,
      "replies": {}
    },
    "hipkn95": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hipkn95/",
      "text": "If you don’t like it, why don’t you transfer?",
      "author": "maxavier10",
      "created": 1635641054,
      "upvotes": 1,
      "replies": {}
    },
    "hit775s": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hit775s/",
      "text": "[deleted]",
      "author": null,
      "created": 1635714835,
      "upvotes": 1,
      "replies": {}
    },
    "hikkf1l": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikkf1l/",
      "text": "[removed]",
      "author": null,
      "created": 1635545823,
      "upvotes": -16,
      "replies": {
        "hikl83v": {
          "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hikl83v/",
          "text": "Brotha?",
          "author": "Acemoney52",
          "created": 1635546180,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hinesuc": {
      "link": "/r/ApplyingToCollege/comments/qii43l/please_dont_apply_to_washu/hinesuc/",
      "text": "Is this University of Washington Seattle ?",
      "author": "flashingthisearth",
      "created": 1635606285,
      "upvotes": -1,
      "replies": {}
    }
  }
}