{
  "sid": "r03qkt",
  "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/",
  "title:": "I feel generic",
  "text": "Does anyone feel super freaking average after reading everything on a2c and chanceme? It's a huge demotivator for me and I keep feeling like I won't get in anywhere bc the competition is so intense. \n\nAnyway, that's the stress talking. Everyone have a great day :D",
  "author": "volcanicpiano",
  "created": 1637638113,
  "updated": 1639808421,
  "over_18": false,
  "upvotes": 58,
  "upvote_ratio": 0.94,
  "comments": {
    "hlq4zyr": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlq4zyr/",
      "text": "Depends where you're aiming. If you understand that you don't need to go to Harvard to succeed then you'll be fine. Frankly, this sub is full of overachievers that seek validation; don't worry about it, this sub is not representative of the average high schooler.",
      "author": "Accomplished-Mix-312",
      "created": 1637638334,
      "upvotes": 31,
      "replies": {}
    },
    "hlq64c3": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlq64c3/",
      "text": "A2C and chanceme by no means represent applicants that are even close to average, so feeling comparatively unaccomplished doesn’t make you average. People on this sub have a tendency of saying “I’m scared I won’t get in anywhere” with “anywhere” literally only referring to T20s. You will get in somewhere for sure (with the possible exception of intls asking for lots of aid), although it may not be a T20. And that’s fine. T20s reject plenty of applicants far above average each year, and a rejection from them is not an indicator of your future potential unless you choose to let it be. \n\n(Personal rant incoming)\n\nAnd maybe it’s A2C, maybe it’s wider culture as a whole, but people really seem to have something against being “average.” You do not need to be exceptional in every field, or even just one field. The majority of people aren’t and aren’t as miserable as some people here are over feeling “average.” Being average is fine. You can be average and be happy. You can be average and find personal success. By hating the notion of being “average,” and assuming one can never be happy or satisfied if they’re “average,” you lock away more possibilities for yourself, if anything. Normalize accepting being average.",
      "author": "rainingsiberiancats",
      "created": 1637638887,
      "upvotes": 16,
      "replies": {}
    },
    "hlqae7o": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlqae7o/",
      "text": "You’ll be fine as long as you apply to a range of colleges with at least some with reasonable (50%+) admit rates. The posts here in this sub are not representative of college applicants overall.",
      "author": "jjhoster",
      "created": 1637641076,
      "upvotes": 7,
      "replies": {}
    },
    "hlqal28": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlqal28/",
      "text": "This subreddit is full of overachievers, it’s natural to feel average or even below average on this subreddit.\n\nThe people here are also ridiculously smart. I’m pretty sure we had an unofficial subreddit census by poll and the majority have scored 33+/1500+. That shows the kind of environment we’re in.\n\nIf this subreddit is seeming too stressful for you you shouldn’t bother hanging out here as it will just affect your mental health. Focus on you and you will be impressed by your own results.",
      "author": "Berkeley_Simp",
      "created": 1637641179,
      "upvotes": 7,
      "replies": {}
    },
    "hlq58pk": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlq58pk/",
      "text": "I know plenty of people who are very successful and their undergraduate school had nothing to really do with it.  Find your people and it will be the best 4 years of your life.",
      "author": "GOTfangirl",
      "created": 1637638451,
      "upvotes": 5,
      "replies": {}
    },
    "hlqq8py": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlqq8py/",
      "text": "I feel below average since schools with 50%+ acceptance rates are reaches for me lol",
      "author": "Striking_Stand_157",
      "created": 1637651125,
      "upvotes": 4,
      "replies": {}
    },
    "hlqoc94": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlqoc94/",
      "text": "Chill dude. That's practically everybody on this sub (including me) from what i've seen. Whether your application is average, great, or not so great, other people's apps will always look better",
      "author": "Team_Histone",
      "created": 1637649733,
      "upvotes": 3,
      "replies": {}
    },
    "hlrgjqi": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlrgjqi/",
      "text": "Yeah, being in A2C literally makes everyone feel average, and I also had that feeling. But hey, it's A2C, where 3.9 UW is a low GPA, and being average among a shit ton of overachievers kinda translate to being better than average in the whole population.",
      "author": "Katsura_Do",
      "created": 1637672174,
      "upvotes": 3,
      "replies": {}
    },
    "hlrogi8": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlrogi8/",
      "text": "People are more than their test scores and GPA, and colleges know that too. It's good to let this sub help you better your process for applying and then don't compare yourself. You are special and the right college for you will know that!",
      "author": "mommacat94",
      "created": 1637676433,
      "upvotes": 3,
      "replies": {}
    },
    "hls31gx": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hls31gx/",
      "text": "This subreddit is useless unless you’re one of the weirdos that put your entire self worth into what college you get into. Frankly, a lot of kids in here need to find something that fulfills and validates them beside academics because the pathetic “my 1540 won’t get me into Harvard” crying meltdowns posted here every day show y’all have some issues.",
      "author": "SkellySkeletor",
      "created": 1637682828,
      "upvotes": 3,
      "replies": {
        "hlsdyc6": {
          "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlsdyc6/",
          "text": "[kids shaking and crying rn](https://www.reddit.com/r/ApplyingToCollege/comments/pcozu6/should_i_retake_a_1530/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
          "author": "HuskyMouse",
          "created": 1637687196,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hlrlb0g": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlrlb0g/",
      "text": "To be fair, most people are average.",
      "author": "thr0wsabrina96",
      "created": 1637674821,
      "upvotes": 2,
      "replies": {}
    },
    "hlt8ckf": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hlt8ckf/",
      "text": "it happens so often in the digital age-- not just in college admissions but in just about everything we do. Just take a deep breath sometimes-- college admissions aren't the end of the world, and everyone is spicing up their application to make themselves sound good annyway :)\n\n&#x200B;\n\nIf you want a look at the other side of the tunnel, try [https://uportal.io](https://uportal.io) . I found it when helping my nephew with her app. It's just posts from college students--helped her de-stress :P",
      "author": "dliu1",
      "created": 1637699007,
      "upvotes": 1,
      "replies": {}
    },
    "hltbcsg": {
      "link": "/r/ApplyingToCollege/comments/r03qkt/i_feel_generic/hltbcsg/",
      "text": "Hi because the only people who post their stats are usually ones with really great ones,",
      "author": "ThoughtSafe9928",
      "created": 1637700185,
      "upvotes": 1,
      "replies": {}
    }
  }
}