{
  "sid": "q72tra",
  "link": "/r/ApplyingToCollege/comments/q72tra/high_ranked_university_and_my_sufferings/",
  "title:": "High Ranked university and my sufferings",
  "text": "hello guys please me fight my situation.\nI am an international student(asian) with good grades in O and A levels. I had all A*s and few country highest. I was never informed that my parents will send me to the US for UG studies. I am applying to usa for fall'22 with 1 gap year. The thing is i know my profile maybe i have the grades but when it comes to ECAs it feels nothing special. When i see my profile and compare it with other students i feel no top universities will accept me. It was actually shocking for me because working so hard for so many years is worth nothing. Still i made myself up and listed all low ranked universities with good amount of scholarships. I said to myself i will complete my undergrad from a low ranked uni but hopefully masters from top ranked uni.\nIk ranking doesn't matter in one sense if one works hard he can become successful in life from any position but still i don't know why i am overthinking.\n\nPlease help me guys I have 19days left for my ED application i do want to feel discouraged anymore.",
  "author": "Posh_Rich",
  "created": 1634096756,
  "updated": 1634167130,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgg2bm6": {
      "link": "/r/ApplyingToCollege/comments/q72tra/high_ranked_university_and_my_sufferings/hgg2bm6/",
      "text": "I’m sorry but if you don’t feel they your EC’s are strong, then it may be a good indicator to apply to schools that weigh grades more, like in the Uk or Canada",
      "author": "Additional-Ad5553",
      "created": 1634099097,
      "upvotes": 1,
      "replies": {
        "hgg2mkd": {
          "link": "/r/ApplyingToCollege/comments/q72tra/high_ranked_university_and_my_sufferings/hgg2mkd/",
          "text": "uk and canada are both expensive for me\ni have ecas but not strong what i feel.\nthere are some universities in the us who will take me with decent scholarship.",
          "author": "Posh_Rich",
          "created": 1634099271,
          "upvotes": 2,
          "replies": {
            "hgg8a7e": {
              "link": "/r/ApplyingToCollege/comments/q72tra/high_ranked_university_and_my_sufferings/hgg8a7e/",
              "text": "Which universities were you thinking of?",
              "author": "Additional-Ad5553",
              "created": 1634102744,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}