{
  "sid": "qbx1mg",
  "link": "/r/ApplyingToCollege/comments/qbx1mg/i_messed_up_my_lors/",
  "title:": "i messed up my LoRs",
  "text": "so ive asked my teachers for LoRs around mid September (my first deadlines are early December since I am not applying early action) and ive told them that I will send an email with my resume, a questionnaire my school had us do and all relevant information. it has been like 3 weeks and I still haven't sent that email. Did I mess up rly bad? Do they think I am irresponsible/ bad at time management? I want to be able to submit those emails ASAP but the questionnaire is just taking too long to answer and ive just recently completely finalized my colleges i want to apply to and that's one of the things i wanted to send. can someone tell me how badly am I being perceived by my teachers rn and whether they'd have enough time if I send in all of my info by the end of this week?",
  "author": "Popular_Chemist_4644",
  "created": 1634722601,
  "updated": 1634749597,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhccn97": {
      "link": "/r/ApplyingToCollege/comments/qbx1mg/i_messed_up_my_lors/hhccn97/",
      "text": "You did not mess up that bad. You can just explain the teacher you situation through email and also do not forget to attach whatever document your school has given you to fill. Do it asap as teachers also sometimes take time to write lors and they have to write for multiple students and not just one",
      "author": "dev-rathod26",
      "created": 1634722870,
      "upvotes": 3,
      "replies": {}
    },
    "hhdg5rn": {
      "link": "/r/ApplyingToCollege/comments/qbx1mg/i_messed_up_my_lors/hhdg5rn/",
      "text": "Why don't you break this task into smaller parts? Fill out the questionnaire tonight (or whenever is reasonable?) and DO THAT ONLY. No looking at prospective schools (you can add later if critical). Check your questionnaire for spelling mistakes; any additions/subtractions? Great you are done...except for email and send. Do that by Friday. Then you are done with the task that is the most pressing. Your weekend could even be free time...decorate for Halloween, football games, take a Fall walk. Just step away from the Process for a day. It will wait for you and you have accomplished the most time-sensitive piece. WOOHOO! (PS Although your teachers do need time and you do need to respect that, I'm guessing they are not thinking negatively of you. They can just start on other LOR's...but get the questionnaire done for everyone's peace!)",
      "author": "Radiant-Chipmunk-987",
      "created": 1634744496,
      "upvotes": 1,
      "replies": {}
    }
  }
}