{
  "sid": "fhgumf",
  "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/",
  "title:": "How Coronavirus Might Impact Admissions: a post by a former UChicago/Berkeley admissions reader",
  "text": "Many of you might *not* know me, as life circumstances led me to being pretty dormant on Reddit this past admissions cycle (sorry about that). But I'm Marcella (also known as Novembrr), a former admissions reader at UChicago and Berkeley's Management, Entrepreneurship, and Technology program, and a college admissions consultant.\n\nNaturally, I think many of you are worrying about how coronavirus might impact college admissions. I don't know for certain, as nothing is known for certain right now, but here are some of my thoughts.\n\n[Here's a list](https://docs.google.com/spreadsheets/d/19wJZekxpewDQmApULkvZRBpBwcnd5gZlZF2SEU2WQD8/htmlview) of all universities closed at the moment. \n\n**For high school seniors and other applicants awaiting decisions:**\n\n* Early to mid March is the season for admissions committee meetings. With universities closing their doors, it is probable that some universities' committee meetings were impacted, and I imagine many continued to work online. It is possible that some universities will be late in releasing admissions decisions this year. I am part of numerous online channels for admissions professionals, and have heard no official word regarding postponed decision dates. Be prepared for them to happen, however; if they do, I imagine the May 1st deposit date could get pushed back. Note: See comments for more opinions/details.\n\n* As you all know, admitted student days are being cancelled or taken online. You can also find virtual tours on [CampusReel](https://www.campusreel.org/). If you do not have access to the internet at home, and thereby cannot make an educated decision about where you will attend college, consider reaching out to the co-leaders of the National Association for College Admission Counseling's [rural and small town special interest group](https://www.nacacnet.org/about/SIGs/rural-and-small-town/). Andrew Moe of Swarthmore is leading an initiative to share information with students offline. Even if you aren't from a rural area but are otherwise impacted by a lack of internet access, please contact Andrew. You could alternatively reach out to the leaders of the [special interest group](https://www.nacacnet.org/about/SIGs/) with which you most closely align to ask for help. I also know the irony of telling you to email someone about your lack of internet access :/\n\n* If your family cannot afford to make a deposit to a university due to economic strain as a result of Covid-19 (or any other reason, for that matter), email the university to outline your family's circumstances and ask for an extension on the deposit deadline or reduction in deposit amount. \n\n* If your grades suffer during this time (because of illness, financial instability, stress, etc.) and you are worried about being rescinded, write an email to the universities to which you're considering depositing (after you've been admitted) and provide them with context into your situation. No, this is not my permission to slack off, but don't overly stress about a situation that is outside your control.\n\n* AP exams might be cancelled, which can unfortunately impact course credit in college. If your exam is cancelled, consider a) asking for a refund on any $ paid to College Board to register for those exams, and b) reaching out to the university at which you enroll to see if your grade in the class will confer any credit, in lieu of the AP exam score. \n\n**For younger students:**\n\n* You can check for SAT test site cancellations [here](https://collegereadiness.collegeboard.org/sat/register/test-center-closings). This list is slow to update, so please check individually with your test center. \n\n* Do not panic if your SAT is cancelled; my hunch is more and more schools will go test optional in the year or two to come to accommodate for students impacted by Covid-19 test cancellations. At the very least, you can write an additional information statement on your college apps that outline how your test results were impacted by Covid-19. \n\n* As a safeguard, I recommend that juniors (without test scores OR with test scores lower than their goal) investigate [this list of test optional universities](https://www.fairtest.org/university/optional) and add at least one to their college lists.\n\n* Do not stress about visiting colleges to demonstrate interest. You can investigate whether a university even considers demonstrated interest in the admissions process by looking at their [common data set](https://www.reddit.com/r/chanceme/wiki/common_data_sets). Once you're in a university's common data set, control + F for \"Level of applicant’s interest\" and you'll have your answer as to whether or not they even factor it into admissions decisions. Keep in mind, too, that there are other ways to demonstrate interest! Some colleagues at College Coach wrote this [helpful guide](https://blog.getintocollege.com/coronavirus-and-college-admissions-demonstrating-interest-without-visiting-campus/). At the very least, you can write an additional information statement for the university in question, describing how your plans to visit campus had to be cancelled. \n\n* You can check out the aforementioned CampusReel for campus tours, but many universities have announced that they are working on recording their own virtual tours and information sessions online, so check universities' admissions websites regularly for those resources. I've also heard that some universities are doing regular Zoom/Facebook Live info session/Q&As, so consider registering for something virtual. \n\n* Be prepared for summer programs to be cancelled. If they are, if you remain quarantined through the summer, or if you cannot or will not pay for expensive summer programs, consider taking free online courses through Coursera, EdX, MIT's OpenCourseware and other online sources. Reading, tinkering with electronics, perfecting a hobby, etc. are all reasonable summer activities. \n\n* If you were selected to compete in some prestigious competition or attend some special program or event, and can no longer do so, you can include in your honors/awards section on college apps that you were selected/nominated for the award/competition/event, and/or provide that information in an additional information statement. \n\n* AP exams might be cancelled. If they are, and aren't rescheduled for a later date this calendar year, consider signing up to take the exam *next* year. Like mentioned above, when you ultimately deposit to attend a university, you can also contact them to see if your grade in the AP class can confer credit. Would also be worth mentioning in your additional info statement in college applications that you were unable to take the official exam but practice exams had you scoring XYZ.\n\n* For international applicants, the TOEFL might be headed [online, at home](https://www.insidehighered.com/quicktakes/2020/03/10/ets-plans-toefl-home-coronavirus-affected-countries).\n\n* Unfortunately, colleges might take massive hits to their budgets and could rebound by seeking to fill incoming classes with more full-pay applicants. If you can pay in full, great. If you can't, consider broadening your list to include need blind institutions and universities with higher acceptance rates at which you will qualify for large scholarships. My colleague over at My Kid's College Choice sells a [list of merit-based scholarships](https://www.mykidscollegechoice.com/full-scholarship-list/) at universities. I don't know her personally, but I've seen the list and it's fantastic.\n\n**And for students in college/transfer applicants:**\n\n* If classes are cancelled, dorms are closed, and you are unable to go home (you are an international student, you cannot afford to return home, home is not a safe place for you, etc.), please consider reaching out to your alumni association. Many alumni are rallying around current students to offer temporary housing, rides, food, storage, etc.\n\n* If you applied to transfer and your mid-term grade reports are impacted by college closings, please contact the institutions to which you applied to ask for extensions/alternate options. If you have to return abroad, your timezone conflicts with the timezone in which your classes are offered online, and your grades suffer as a result, write a short extenuating circumstances essay and share that with those institutions, as well. On my online channels, I've seen multiple institutions pledge to accommodate transfer applicants.\n\n* Updated to add: I just heard that the U.S. Student and Exchange Visitor Program has determined that, for students on F-1 visas, having to head home due to your university's closure will not be considered a violation of your F-1 visa. When the university resumes face-to-face classes, all F-1 students will be expected to return to classes. Please double check that information, as it's new to me!\n\n**Final thoughts**:\n\nI will try to update this post as I see more information come in regarding how Covid-19 will impact applicants and colleges. If I find any of this information to be outdated or incorrect, I'll delete those instances. \n\nAt the end of the day, I want you to stay safe and healthy; avoid situations that will put you, your family, friends or neighbors in harm's way; and avoid stressing about situations out of your control. As the parent of a medically-fragile kid, I worry about what's to come for our families and my heart aches for those already impacted. If all you brilliant pre-med kids can become epidemiologists, that would be great!",
  "author": "novembrr",
  "created": 1584021976,
  "updated": 1634076516,
  "over_18": false,
  "upvotes": 1920,
  "upvote_ratio": 0.99,
  "comments": {
    "fkb0l5t": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb0l5t/",
      "text": "Additionally, the economy is not looking great right now. Many of your parents are at risk of losing jobs, taking losses on investments, receiving high medical bills, or generally not being able to afford what they thought they could afford even a month ago.\n\nWhen you get your acceptances, discuss the financial aid packages with your parents. Ask them to be realistic. Be kind to them even if the results of your conversations are disappointing. You can file financial aid appeals, but not every college will be able to adjust.\n\nIt would be a good idea to look into community college as a backup option and see if it is right for you. I encourage everyone without a full ride to do that no matter what state the economy is in.",
      "author": "visvya",
      "created": 1584023634,
      "upvotes": 450,
      "replies": {
        "fkb0rb7": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb0rb7/",
          "text": "Excellent advice. Gap years are an option, too.",
          "author": "novembrr",
          "created": 1584023737,
          "upvotes": 126,
          "replies": {
            "fkb33m0": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb33m0/",
              "text": "[deleted]",
              "author": null,
              "created": 1584025139,
              "upvotes": 45,
              "replies": {
                "fkb4a2l": {
                  "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb4a2l/",
                  "text": "Double check if your university allows students to take gap years. If they don't, they might change their policy for this upcoming year. You can also withdraw your deposit, if you need to change your college plans, or talk to the university's financial aid office to submit new information about your family's financial situation.",
                  "author": "novembrr",
                  "created": 1584025821,
                  "upvotes": 61,
                  "replies": {
                    "fkb4pwq": {
                      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb4pwq/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1584026075,
                      "upvotes": 23,
                      "replies": {
                        "fkb567i": {
                          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb567i/",
                          "text": "ED agreements existed in a world without a pandemic. Obviously they should be taken seriously, but if your life circumstances have drastically changed, don't sign up for a lifetime of debt. Reach out to your ED institution and share your concerns.",
                          "author": "novembrr",
                          "created": 1584026334,
                          "upvotes": 59,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fkcgurr": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcgurr/",
          "text": "> receiving high medical bills\n\nnote: uniquely american problem.",
          "author": "Takiatlarge",
          "created": 1584052801,
          "upvotes": 20,
          "replies": {
            "fkch0zx": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkch0zx/",
              "text": "Sadly true. Funeral costs, prescription drug costs and other associated costs could rack up in other countries though.",
              "author": "visvya",
              "created": 1584052905,
              "upvotes": 5,
              "replies": {}
            },
            "fkco6ds": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkco6ds/",
              "text": "Ah, if only there was a major American politician who appealed to young people and included reformation of the American healthcare system as a core ideal...",
              "author": "HaliTheGreat",
              "created": 1584057332,
              "upvotes": 11,
              "replies": {
                "fkcq62b": {
                  "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcq62b/",
                  "text": "Elizabeth Warren?\n\nEDIT: I know who you're talking about btw this is a joke",
                  "author": "Rin-Tohsaka-is-hot",
                  "created": 1584058619,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "fklsycr": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fklsycr/",
              "text": "At least you aren’t forced to use government run healthcare",
              "author": "BroiledBoatmanship",
              "created": 1584313901,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fkd49b7": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkd49b7/",
          "text": "How will this affect the financial aid of universities? I can't imagine their endowments being too well during this time.",
          "author": "whitelife123",
          "created": 1584067997,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fkaz9wv": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkaz9wv/",
      "text": "THANK YOU SO MUCH THIS IS SO HELPFUL I WOULD GIVE YOU AN AWARD IF I COULD",
      "author": "scaredaboutcollege",
      "created": 1584022835,
      "upvotes": 88,
      "replies": {}
    },
    "fkb34js": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb34js/",
      "text": "Ahhh. You’re the legendary Novembrr I’ve heard about. Thanks for the tips! Is it okay if I contact you via PM if I have questions anytime going into the future?\n\nRegards,\nAn international junior!",
      "author": "rant-rant-rant",
      "created": 1584025154,
      "upvotes": 70,
      "replies": {
        "fkb506u": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb506u/",
          "text": "*blush*\n\nFeel free to reach out! I've unfortunately not been as active on Reddit as I've wanted to be, so if I don't respond to messages please do not take it personally. I will do my best to respond when I can!",
          "author": "novembrr",
          "created": 1584026240,
          "upvotes": 62,
          "replies": {}
        }
      }
    },
    "fkaygz4": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkaygz4/",
      "text": "[deleted]",
      "author": null,
      "created": 1584022338,
      "upvotes": 34,
      "replies": {
        "fkb0ie0": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb0ie0/",
          "text": "> Do you think the May 1st deposit deadline will be extended for all schools? Like what if one school extends but another doesn’t?\n\nMy guess is that colleges will want to be good citizens on this.  If one of them does, other might follow.\n\nThat said, colleges will want to know as best they can, as early as they can, what next Fall's class will look like.  They would want to know if they need to go to the waitlist as soon as possible, but if the deposit deadline is changed the uncertainty will be huge. All this to say, they would need a good rationale for extending the deadline.  \n\nAre there rationales?  Sure!\n\nThe fact that students may be missing admit day programs and other chances to visit before making a decision is difficult.  However, only time will tell if extending the deadline would change that.  \n\nMost colleges still have functional operations for processing financial aid and the like, so students should not be awaiting decisions on that.  \n\nInternational students may have the most questions about travel restrictions and general safety, plus complications around being able to get visas processed.  They may the group who most needs more time.",
          "author": "FeatofClay",
          "created": 1584023586,
          "upvotes": 37,
          "replies": {
            "fkb1i56": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb1i56/",
              "text": "Absolutely agreed.",
              "author": "novembrr",
              "created": 1584024190,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "fkb03rc": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb03rc/",
          "text": "Good question. I wondered that, too. I didn't want to add it to my post, as I think colleges are hustling to make final decisions all online to make the April 1st decision deadline (and thus won't have to push back deposit deadlines). If some universities do have to push back dates and others don't, I'd reach out to the universities who haven't pushed back dates to ask for extensions, if that impacts where you might deposit. It's also okay to deposit to one school, get into another, and email the original school to withdraw your spot if you need to do so. In that instance, definitely withdraw your original spot, and understand that you might lose the $ you deposited.",
          "author": "novembrr",
          "created": 1584023341,
          "upvotes": 14,
          "replies": {
            "fkbdv3k": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbdv3k/",
              "text": "What effect do you think may have on waitlisted students?",
              "author": "pepper1789",
              "created": 1584031181,
              "upvotes": 5,
              "replies": {
                "fkcxxwm": {
                  "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcxxwm/",
                  "text": "Hard to say for sure; universities might have to go more to the waitlist, and they might seek more paying students from the waitlist. But that's all just conjecture. We will have to wait and see.",
                  "author": "novembrr",
                  "created": 1584063726,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fkb1rio": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb1rio/",
      "text": "Question regarding the impact on international student visas: In the event that the US imposes a travel ban on our country, will we be given the option to enroll later when the ban is lifted?",
      "author": "FartherCoram",
      "created": 1584024347,
      "upvotes": 25,
      "replies": {
        "fkb2m6o": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb2m6o/",
          "text": "Excellent question. I think that answer is TBD, both as a result of the disease's spread and the TBD identity of the U.S.'s next president and their policies. As we don't have a crystal ball, my best recommendation is not to worry too much. If it's not too late, throw in an application to another college in your home country just in case.",
          "author": "novembrr",
          "created": 1584024853,
          "upvotes": 22,
          "replies": {
            "fkb45oj": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb45oj/",
              "text": "It, unfortunately, is too late, at least for this year. I'd already pretty much packed my bags after getting into one of my dream schools EA. Panic attack in 3...2... :/",
              "author": "FartherCoram",
              "created": 1584025751,
              "upvotes": 11,
              "replies": {
                "fkdiv0y": {
                  "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkdiv0y/",
                  "text": "I can totally relate. Although I singed up for the college admissions examinations in my country as a back-up plan, I'm totally unprepared and I don't think I can to go through transfer applications again next year. My plan is to take a gap year if worst comes to worst. Here's hoping things get better in a couple months.",
                  "author": "Haphazard_tennisball",
                  "created": 1584080458,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fkc2sgt": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkc2sgt/",
      "text": "I currently have a conditional offer to Cambridge (my top choice) which requires me to get a 5 on AP Macroeconomics. If AP Tests get canceled, what the hell am I supposed to do?",
      "author": null,
      "created": 1584044671,
      "upvotes": 16,
      "replies": {
        "fkcy125": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcy125/",
          "text": "Email them. Don't panic without first getting direct feedback from Cambridge over what to do in that situation. And keep in mind that we don't know AP tests will be cancelled; they could be taken online or postponed, etc.",
          "author": "novembrr",
          "created": 1584063784,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fkaz5kd": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkaz5kd/",
      "text": "You are a complete star!",
      "author": "NCUK4005",
      "created": 1584022762,
      "upvotes": 14,
      "replies": {}
    },
    "fkbexg1": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbexg1/",
      "text": "Great tips, thanks so much!\n\nWould colleges actually still give credit if aps are cancelled but we had a good grade in the class?",
      "author": "maximus284284",
      "created": 1584031760,
      "upvotes": 10,
      "replies": {
        "fkcy2ii": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcy2ii/",
          "text": "In a world before this pandemic, almost certainly not; with countless students in the same boat, perhaps.",
          "author": "novembrr",
          "created": 1584063811,
          "upvotes": 6,
          "replies": {}
        },
        "fklt6ql": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fklt6ql/",
          "text": "The issue with this is that there are many schools that inflate their grading heavily. I know of several schools where students get A’s in AP classes, but get a 1 on the exam.",
          "author": "BroiledBoatmanship",
          "created": 1584314049,
          "upvotes": 1,
          "replies": {
            "fkm3f9c": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkm3f9c/",
              "text": "yes that's true but i guess you could base it on the schools though\n\ni heard somewhere that colleges often know which schools heavily inflate or not",
              "author": "maximus284284",
              "created": 1584320253,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fkbro6c": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbro6c/",
      "text": "But how might it affect prospective international applicants? Would they view accepting some as a safety risk to the school community?",
      "author": "Sharingan123412",
      "created": 1584038560,
      "upvotes": 9,
      "replies": {
        "fkcy4w5": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcy4w5/",
          "text": "I certainly hope not. That would be a really sad world.",
          "author": "novembrr",
          "created": 1584063854,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fkc5gsz": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkc5gsz/",
      "text": "Do you think international acceptances will change in light of corona?",
      "author": "IcySupport1",
      "created": 1584046160,
      "upvotes": 8,
      "replies": {
        "fkcy6xi": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcy6xi/",
          "text": "Perhaps due to travel/visa restrictions? Hard to say under this administration...",
          "author": "novembrr",
          "created": 1584063891,
          "upvotes": 3,
          "replies": {
            "fkcyrfi": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcyrfi/",
              "text": "Thanks!\n\nI would like to clarify: do you think schools will take less people from badly-hit areas like China & S. Korea this year?",
              "author": "IcySupport1",
              "created": 1584064272,
              "upvotes": 2,
              "replies": {
                "fkfenme": {
                  "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkfenme/",
                  "text": "Unclear, but I certainly hope not. I'd personally consider that xenophobia, and that's definitely not okay.",
                  "author": "novembrr",
                  "created": 1584132729,
                  "upvotes": 6,
                  "replies": {
                    "fkfepkf": {
                      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkfepkf/",
                      "text": "I see. Thank you!",
                      "author": "IcySupport1",
                      "created": 1584132762,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fkc9of5": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkc9of5/",
      "text": "Bruh if they cancel ap exams I’m gonna be so pissed",
      "author": "RR003",
      "created": 1584048567,
      "upvotes": 9,
      "replies": {}
    },
    "fkb2r98": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb2r98/",
      "text": "Question for writing an email to our colleges on stress related grades, how would someone write it? I really don’t want to seem like a whiny child but my family and I have a chance of being infected and getting hit with it harder than most.",
      "author": "LordSaproling",
      "created": 1584024936,
      "upvotes": 17,
      "replies": {
        "fkb4uq0": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb4uq0/",
          "text": "High schools might have to be more lenient with exams/homework/grades, and they might institute a curve or bump final grades, etc. So talk to your teachers and explain the situation. See if, especially in the coming weeks if/when things get worse, they show compassion re: student performance.\n\nIf your grades do indeed suffer, reach out to your top one or two colleges to very clearly outline the disease's impact on your family, how it impacted your school, and how those impacts in turn impacted your academic performance. Then express how this dip in grades is not indicative of your overall academic ability, and politely ask that they take this into consideration when evaluating final transcripts.",
          "author": "novembrr",
          "created": 1584026153,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "fkbg4mb": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbg4mb/",
      "text": "This is really thoughtful and informative, thanks. I am wondering if more students will enroll locally next year in case of a resurgence in the fall, and if that might be taken into account during admissions yield predicting.\n\nCase in point, I applied to several schools really far away, and not that overly easy to travel to from here. My friends and I were ok with not going for admit days (for those that already got in), but our parents are also going to be like oh no, you need to stay closer if that's an option - in case you get sick, or schools close again, etc.  We are just guessing but it could be a factor.",
      "author": "LoudSoup8",
      "created": 1584032371,
      "upvotes": 7,
      "replies": {
        "fkcyg65": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcyg65/",
          "text": "Totally valid concern by your parents. I heard on NPR how many US citizens abroad are scrambling to get back to the US before they get stranded abroad, so it's possible that we'll be in a situation bad enough that cross-state travel will be prohibited.",
          "author": "novembrr",
          "created": 1584064064,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fkbfdl0": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbfdl0/",
      "text": "thank you for your help! do you think admissions would be rushed and unable to review applicants they deem \"on the fence\" because of this?",
      "author": "crazysetter",
      "created": 1584031993,
      "upvotes": 6,
      "replies": {
        "fkcyask": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcyask/",
          "text": "I don't think any admissions office would make a final decision on an applicant without feeling they had reviewed that application thoroughly. At least not in my experience...",
          "author": "novembrr",
          "created": 1584063964,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fkbycbm": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbycbm/",
      "text": "I will flip if I have to wait a single second past April 1",
      "author": "Taiwanese-Tofu",
      "created": 1584042228,
      "upvotes": 7,
      "replies": {}
    },
    "fkbsg4c": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbsg4c/",
      "text": "ask for a refund from College Board? lol",
      "author": "TheLordNermal",
      "created": 1584038984,
      "upvotes": 6,
      "replies": {
        "fkc109i": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkc109i/",
          "text": "I had the same initial response, but there's a chance that these circumstances would change their long-held policies.  I just had a hotel chain email me and say that any non-refundable bookings could now be refunded, and I never thought they would do that, especially with how they must be hurting for business with the travel bans and such.",
          "author": "ScholarGrade",
          "created": 1584043689,
          "upvotes": 7,
          "replies": {
            "fkcypsg": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcypsg/",
              "text": "Exactly! I mean, the NBA regular season was cancelled... this is a strange time.",
              "author": "novembrr",
              "created": 1584064241,
              "upvotes": 6,
              "replies": {}
            },
            "fkcchni": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcchni/",
              "text": "That's shocking! I assumed everyone was giving credit toward future purchases, not total refunds.",
              "author": "visvya",
              "created": 1584050189,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fkbs6ah": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbs6ah/",
      "text": "[deleted]",
      "author": null,
      "created": 1584038835,
      "upvotes": 6,
      "replies": {
        "fkda5hb": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkda5hb/",
          "text": "Yeah I clutched out and one-and-doned it in October. Really nervous about subject tests though",
          "author": "miniraise",
          "created": 1584072345,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fkbfomy": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbfomy/",
      "text": "I totally think that UC admissions have been delayed because of COVD-19. This is insane there will be mass panic relatively soon.",
      "author": "italianpeaches",
      "created": 1584032149,
      "upvotes": 9,
      "replies": {
        "fkcynjm": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcynjm/",
          "text": "The UCs employ a ton of admissions readers, so hopefully if some people are unable to continue to evaluate apps as usual, someone else will step in to help. Likely most U.S. universities are nearing the finish line for admissions decisions, as well.",
          "author": "novembrr",
          "created": 1584064201,
          "upvotes": 3,
          "replies": {
            "fkih9yy": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkih9yy/",
              "text": "How about for transfers though?",
              "author": "imasleep78",
              "created": 1584219971,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkc7irw": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkc7irw/",
      "text": "A few things:\n\n1) Stephen F Austin State university just announced through email that they’re closing campus\n\n2) What can you do if Ap exams are cancelled but your a senior? you mentioned to retake it next year or to ask if the current grades are acceptable. I just want to make sure as a “next year” option may be invalid for some if they do not want to re-study",
      "author": "YellowBlackFlowers",
      "created": 1584047327,
      "upvotes": 3,
      "replies": {
        "fkcytqa": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcytqa/",
          "text": "If the university to which you matriculate accepts scores for credit, I'd email them (closer to May) and ask them what their new policy is going to be. Perhaps they'll give credit according to grades, or perhaps they'll offer their own exams to determine credit, or something else entirely.",
          "author": "novembrr",
          "created": 1584064313,
          "upvotes": 3,
          "replies": {
            "fkltli5": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkltli5/",
              "text": "The credit based on class averages will screw over those of us who are at difficult magnet schools",
              "author": "BroiledBoatmanship",
              "created": 1584314310,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkbmc63": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbmc63/",
      "text": "It’s extremely saddening that our futures can become negatively impacted because of the pandemic. But I guess the most important thing to do is to stay safe and keep going!",
      "author": "ALT_button",
      "created": 1584035659,
      "upvotes": 3,
      "replies": {}
    },
    "fkc82l5": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkc82l5/",
      "text": "If I’ve been promised a full ride somewhere could the economy hit change that?",
      "author": "but-not-from-you",
      "created": 1584047640,
      "upvotes": 3,
      "replies": {
        "fkczc8m": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkczc8m/",
          "text": "Wow, great question. I hope not! For universities that have large endowments, you should be fine; for universities with tight finances... I'm not sure. Don't stress now, though—just hang in there!",
          "author": "novembrr",
          "created": 1584064655,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fkcawru": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcawru/",
      "text": "College Board is likely to add many more dates to the calendar in the summer months and in the fall. Please dont rely on schools going test optional as that is likely not going to happen. Continue to Study for the exam.",
      "author": "91210toATL",
      "created": 1584049272,
      "upvotes": 3,
      "replies": {
        "fkcz54v": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcz54v/",
          "text": "I've actually heard quite a few schools mention they're discussing the test optional pathway, but you're absolutely right that students can't bank on it. I agree with your assessment that more dates might be added later on this year, or maybe the SAT/ACT will go online and remote. Hard to say!",
          "author": "novembrr",
          "created": 1584064524,
          "upvotes": 3,
          "replies": {
            "fkd2fg3": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkd2fg3/",
              "text": "Those schools were already considering it probably. Long term solutions to short term problems doesn't sound correct. They'll likely just extend deadlines.",
              "author": "91210toATL",
              "created": 1584066721,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fkcbqoz": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcbqoz/",
      "text": "So I have never heard of Coursera or edX or MIT OpenCourseWare. I'm looking at Coursera right now, and there seems to be a lot of free online classes by prestigious universities. It seems a little too good to be true. Is there a benefit to these classes just from taking it? Some seem to take a few months to complete and I'm wondering if its worth it to just take some right now seeing that school might go online and my sports are cancelled.",
      "author": "apfng19",
      "created": 1584049760,
      "upvotes": 3,
      "replies": {
        "fkcnajv": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcnajv/",
          "text": "Take a class that interests you. Most courses on these platforms do not provide credit, but may be mentionable in your interview or essay, and may give you a leg up on similar courses once you are on campus.",
          "author": "theotherkeith",
          "created": 1584056774,
          "upvotes": 2,
          "replies": {
            "fkczdpq": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkczdpq/",
              "text": "Agreed. They can also demonstrate intellectual curiosity.",
              "author": "novembrr",
              "created": 1584064683,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkbrovo": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbrovo/",
      "text": "[deleted]",
      "author": null,
      "created": 1584038570,
      "upvotes": 5,
      "replies": {
        "fkcyjrl": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcyjrl/",
          "text": "I wouldn't use Covid-19 as a convenient excuse when you have the means to take the SAT. But if you don't want to take the exam, consider test optional or test flexible (where you can submit subject tests, IB or AP results in lieu of ACT and SAT) colleges. There are tons of great schools counted in that list!",
          "author": "novembrr",
          "created": 1584064131,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fkbc4h3": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbc4h3/",
      "text": "This was so helpful thank you so much! Do you think that the admissions committee would have less time to review applications that are on the fence because of colleges shutting down?",
      "author": "collegenerd1234",
      "created": 1584030234,
      "upvotes": 2,
      "replies": {
        "fkcyv6l": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcyv6l/",
          "text": "> I don't think any admissions office would make a final decision on an applicant without feeling they had reviewed that application thoroughly. At least not in my experience...",
          "author": "novembrr",
          "created": 1584064340,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fkbupfb": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbupfb/",
      "text": "[removed]",
      "author": null,
      "created": 1584040238,
      "upvotes": 2,
      "replies": {
        "fkcz15o": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcz15o/",
          "text": "International students are really in limbo, aren't they? Unfortunately I'm not sure how this process is going to affect you kids. I heard on NPR that some college students are frustrated by online classes because their homes are halfway across the world and in different timezones that mean they're up at all hours of the night to catch their classes. I also heard that F-1 visas will be honored... for now. Hard to say what the future holds. Hang in there!",
          "author": "novembrr",
          "created": 1584064451,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fkctjxt": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkctjxt/",
      "text": "As a junior, your bit for younger students is making me worry a lot more than I was before, so I’ll just take what you said with a grain of salt for my mental health rn.",
      "author": "Niboos",
      "created": 1584060823,
      "upvotes": 2,
      "replies": {
        "fkczoxs": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkczoxs/",
          "text": "Sorry to hurt your mental health! This is a really stressful time for tons of people for tons of different reasons. Hang in there and realize that accommodations/changes are being made in industries I never thought would change (the NBA regular season was cancelled—what!?), and AOs are human (there has to be compassionate changes to admissions policies to come).",
          "author": "novembrr",
          "created": 1584064887,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fkcucoa": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcucoa/",
      "text": "And as always, email the admissions offices.  We are working from home starting very soon but will still be working.  Many of us are thinking of creative ways to handle problems or complications that may come up so virtual meetings, more emails, websites, etc are being worked on.\n\nShit is crazy but just stay calm and things will work out in the end and we are here for you, wherever that may be (and that'll be on my couch or the kitchen table, maybe the golf course when it gets nice out)",
      "author": "RoleModelFailure",
      "created": 1584061343,
      "upvotes": 2,
      "replies": {
        "fkczsv5": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkczsv5/",
          "text": "For sure. With Slate, I imagine most admissions offices already do tons of work remotely online. Sure, committees might be moved virtual vs in person, but that shouldn't be too difficult to do, right?",
          "author": "novembrr",
          "created": 1584064960,
          "upvotes": 2,
          "replies": {
            "fke3i60": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fke3i60/",
              "text": "We do a lot of meetings in person with people video conferencing in because they are traveling or work somewhere else on campus.  Easier to do a video chat with somebody in Engineering rather than having them spend 20 minutes trekking across campus sometimes, especially when it is cold/snowy/rainy/pandemic.  So moving to all video conferencing wouldn't be hard at all.",
              "author": "RoleModelFailure",
              "created": 1584104197,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkd1p3x": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkd1p3x/",
      "text": "[deleted]",
      "author": null,
      "created": 1584066227,
      "upvotes": 2,
      "replies": {
        "fkltxet": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkltxet/",
          "text": "This would be awesome but not awesome at the same time",
          "author": "BroiledBoatmanship",
          "created": 1584314517,
          "upvotes": 2,
          "replies": {
            "fklukro": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fklukro/",
              "text": "[deleted]",
              "author": null,
              "created": 1584314925,
              "upvotes": 2,
              "replies": {
                "fklyqdk": {
                  "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fklyqdk/",
                  "text": "It’s very difficult to describe. Who would take away some stress but it would probably ultimately devastate a bunch of people.",
                  "author": "BroiledBoatmanship",
                  "created": 1584317497,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fkdowhb": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkdowhb/",
      "text": "“Ap exams might be cancelled” nah son, Ik  I didn’t just take 4 Ap classes for the first time for no reason. They better give me my credit.",
      "author": "Ajbksfinest",
      "created": 1584088112,
      "upvotes": 2,
      "replies": {}
    },
    "fkeboid": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkeboid/",
      "text": "Thank you so much for taking the time to do this. Amazing resources. I’ve been on a road trip and had Reddit put away for the last week and was just about to sit down and write some of this up, but as usual you’ve nailed all the details. I’ll add here as I see or hear things from the admissions community too.",
      "author": "admissionsmom",
      "created": 1584109763,
      "upvotes": 2,
      "replies": {}
    },
    "fktb2sg": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fktb2sg/",
      "text": "Resources to make sure your online admission processes and online courses are fully accessible to those with disabilities: [https://www.rev.com/blog/e-learning-courses-the-coronavirus-how-educators-can-improve-accessibility](https://www.rev.com/blog/e-learning-courses-the-coronavirus-how-educators-can-improve-accessibility)",
      "author": "RevTranscription",
      "created": 1584512279,
      "upvotes": 2,
      "replies": {}
    },
    "fkb74jk": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb74jk/",
      "text": "Do you know if the UCs will come out on schedule? Thanks for all the great info.",
      "author": "cooldude_127",
      "created": 1584027449,
      "upvotes": 4,
      "replies": {
        "fkcz7r8": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcz7r8/",
          "text": "I don't personally know, but I suggest you check [Ms. Sun's blog](https://askmssun.com/)—she has a lot of good insight into the UCs.",
          "author": "novembrr",
          "created": 1584064572,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fkbqdj3": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbqdj3/",
      "text": "This is really helpful in a sea of panic, worry, and sometimes misinformation. Thanks for making this :)",
      "author": null,
      "created": 1584037851,
      "upvotes": 1,
      "replies": {}
    },
    "fkbwkcx": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbwkcx/",
      "text": "Thank you!!",
      "author": "INEEDTOSTUDYYY",
      "created": 1584041255,
      "upvotes": 1,
      "replies": {}
    },
    "fkbxgwh": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkbxgwh/",
      "text": "So does that mean instead of expecting my transfer descion letter on April 14th I will have to wait longer?",
      "author": "AsianThrowAway24",
      "created": 1584041753,
      "upvotes": 1,
      "replies": {
        "fkcz9b7": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcz9b7/",
          "text": "Not sure, but be prepared for some delays and hope for the best.",
          "author": "novembrr",
          "created": 1584064600,
          "upvotes": 2,
          "replies": {
            "fkd3t8c": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkd3t8c/",
              "text": "Okay thanks dam took a gap year this year, just found a job 2 weeks ago and now I’m not sure where \nMy job stands currently since my job at community college cannot be done remotely. Was really looking forward to transfer from community college to university this fall 2020 but looks like that might not happened with the current situation.",
              "author": "AsianThrowAway24",
              "created": 1584067682,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkcbma5": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcbma5/",
      "text": "This is all super helpful, thanks for sharing.",
      "author": "BlueLightSpcl",
      "created": 1584049688,
      "upvotes": 1,
      "replies": {}
    },
    "fkchgna": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkchgna/",
      "text": "I just got my financial aid offer from the school I want to go to! Is it possible that they'll revise it due to budget cuts (I had one of my other offers change slightly, but only like 3K changed from subsidized loan to unsubsidized loan)? And if I commit before they send me an updated package, am I now obligated to pay the new amount?",
      "author": "kdencor112",
      "created": 1584053164,
      "upvotes": 1,
      "replies": {
        "fkcq16r": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcq16r/",
          "text": "[deleted]",
          "author": null,
          "created": 1584058532,
          "upvotes": 1,
          "replies": {
            "fkczfem": {
              "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkczfem/",
              "text": "Agreed.",
              "author": "novembrr",
              "created": 1584064714,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fkcobs3": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcobs3/",
      "text": "How about effects on transfer students?",
      "author": "theeternalsunshine",
      "created": 1584057428,
      "upvotes": 1,
      "replies": {
        "fkczh3m": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkczh3m/",
          "text": "All I've heard is that universities want to be accommodating to students who faced cancellations/have disruptions to second semester grades...",
          "author": "novembrr",
          "created": 1584064745,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fkcteo5": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkcteo5/",
      "text": "Do you guys think this will affect the international student rate of acceptance???",
      "author": "averagetaiwanese",
      "created": 1584060729,
      "upvotes": 1,
      "replies": {
        "fkczirl": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkczirl/",
          "text": "Hard to say for sure. I hope that universities won't retroactively change acceptances to waitlists or denials; I have no indication that would be true.",
          "author": "novembrr",
          "created": 1584064774,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fki3cxl": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fki3cxl/",
      "text": "question about transfer apps: how do you think this will impact our decisions? if some schools had a planned decision date should we stick to that or expect a delay?",
      "author": "moderatelyrichandsad",
      "created": 1584211153,
      "upvotes": 1,
      "replies": {}
    },
    "fkocdco": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkocdco/",
      "text": "This is great, thank you!",
      "author": null,
      "created": 1584384388,
      "upvotes": 1,
      "replies": {}
    },
    "fkrw7gv": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkrw7gv/",
      "text": "In terms of college decision dates, some schools are pushing the decision deadline to June 1st, giving more students a chance to make an informed choice! More schools need to get on board, but haven’t yet.\n\nMy friend has actually made and published a petition for this and will be personally reaching out to as many colleges and universities as possible, telling them to follow the lead of other schools and push their date to June 1st too. But she needs more support to be taken seriously and get a valid response. \n\nIf you have time, PLEASE sign and share with as many people as possible. We can make a change if we collectively voice our opinions, and we’ll provide a basis for my friend to properly communicate with these schools.\n\nhttps://www.change.org/p/u-s-colleges-universities-postpone-college-decision-day-because-of-the-coronavirus-pandemic/dashboard",
      "author": "bellza17",
      "created": 1584477264,
      "upvotes": 1,
      "replies": {}
    },
    "fl4a4ro": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fl4a4ro/",
      "text": "Will 11th grade 2nd semester GPA be likely reviewed? I hope they still look at this 11th grade semester’s GPA.",
      "author": "usopsong",
      "created": 1584809218,
      "upvotes": 1,
      "replies": {
        "ftluu2t": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/ftluu2t/",
          "text": "If your school reports it, I think so!",
          "author": "novembrr",
          "created": 1591811653,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "flpmdfd": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/flpmdfd/",
      "text": "Do you think that next year international students applying for much financial aid will be at a disadvantage compared to others? My family can only spare 15k per year but I want to attend a top tier school.",
      "author": "maihoaigiang74",
      "created": 1585363003,
      "upvotes": 1,
      "replies": {
        "ftlt93n": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/ftlt93n/",
          "text": "To be determined, so have a balanced list of schools. I sincerely hope low-income families won't be locked out of attending awesome schools.",
          "author": "novembrr",
          "created": 1591810931,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "flueuyt": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/flueuyt/",
      "text": "[deleted]",
      "author": null,
      "created": 1585501205,
      "upvotes": 1,
      "replies": {
        "ftlt4ot": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/ftlt4ot/",
          "text": "Send me a link to your podcast and I'll do some more research and see if I have the time to participate. I think your initiative sounds great!",
          "author": "novembrr",
          "created": 1591810876,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fmirpv7": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fmirpv7/",
      "text": "How are you looking at GPA?",
      "author": null,
      "created": 1586115565,
      "upvotes": 1,
      "replies": {}
    },
    "fmlbfcs": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fmlbfcs/",
      "text": "What if I already ED'd there?",
      "author": "throwaway770476",
      "created": 1586182983,
      "upvotes": 1,
      "replies": {}
    },
    "fqa5n7r": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fqa5n7r/",
      "text": "Do you think that colleges will negatively look at opting for pass/fail in 1 course while the rest are good letter grades? For the 2021 cycle",
      "author": "RussianBlue18",
      "created": 1589213253,
      "upvotes": 1,
      "replies": {
        "ftlrao7": {
          "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/ftlrao7/",
          "text": "Check out my latest post, where I include a note on pass/fail!",
          "author": "novembrr",
          "created": 1591810067,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fwf9tp2": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fwf9tp2/",
      "text": "Can you create an updated version of this for rising seniors using all the new information we know?",
      "author": null,
      "created": 1593475743,
      "upvotes": 1,
      "replies": {}
    },
    "fkb6ugs": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb6ugs/",
      "text": "This was so helpful. Thank you so much!",
      "author": "disconhaze",
      "created": 1584027290,
      "upvotes": 1,
      "replies": {}
    },
    "fkb4vjp": {
      "link": "/r/ApplyingToCollege/comments/fhgumf/how_coronavirus_might_impact_admissions_a_post_by/fkb4vjp/",
      "text": "UC Hicago",
      "author": "HelpfulStorm138",
      "created": 1584026166,
      "upvotes": -5,
      "replies": {}
    }
  }
}