{
  "sid": "r704pb",
  "link": "/r/ApplyingToCollege/comments/r704pb/my_budget_is_only_5k10k_to_study_abroad_in_the_us/",
  "title:": "My budget is only 5k-10k to study abroad in the US but that isn't enough.. what should I do??",
  "text": "Hi. My name is Shadi. I am 17 years old and after a couple of months, I'll be 18 years old soon. I am from Egypt. As starters, I do not fit in Egypt. I hate this place, and I hate the people here. I simply do not fit in here whatsoever, so making new friends is hard. Also, Egypt has very poor education here and low paying jobs. So as a student, It has been my priority to study abroad in USA for a better life, better education, better jobs and much better people.  \n\n\nI am currently in grade 12, an American System School. In grade 9, my gpa was 3.4, a mix of A(s) and B(s), in grade 10, my gpa was 4.0, grade 11 was also 4.0 and grade 12 so far is going to also be a 4.0. I have improved a lot since grade 9, so my overall GPA should be 3.85 or 3.9.   \n\n\nRecently, me and my friends joined a study abroad program called Unipal. They help students travel abroad in the United States. They only require your GPA, no SAT or ACT. I was really happy to hear that.  And after a week or so with me and my friends planning and choosing the colleges Unipal has partnered with.   \n\n\nWe all chose our colleges and our majors. And two of my friends applied through Unipal and they all got accepted into the colleges they wanted to get in. (Mind you my grades are better than theirs so I had high hopes of me also getting in).  \n\n\nWhat Unipal offers: You pay $175 and they help you apply to three of the colleges you've chosen. They also help set up interview for scholarships and accommodations and more.    \n\n\nHowever.. scholarships weren't like something big. For example, I chose University of Utah. Their full tuition is $33k but after scholarship, It's $21k.   \n\n\nAnyways, I told my parents I wanted to apply but they told me that the US is way too expensive. And that my budget is only $5-10k max. I was really sad because I literally have the opportunity to secure a seat right now and do an early decision but because of my low budget, my parents cannot afford to let me study in the US.  \n\n\nInstead they want me to study in Germany or Hungary because colleges there are \"free\" and I don't know how to feel about studying in a country I DONT speak their language. Instead, I know English. Why should I study a whole new language? I have the grades to get into college, but money is the problem. And scholarships don't remove that much.   \n\n\nPlease help me out here. I really want to study in the US or the UK. I really have no interest in studying German or Hungary and struggle with communicating with people.",
  "author": "TbhFlamez",
  "created": 1638423702,
  "updated": 1638478069,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hmwtapr": {
      "link": "/r/ApplyingToCollege/comments/r704pb/my_budget_is_only_5k10k_to_study_abroad_in_the_us/hmwtapr/",
      "text": "Look for [full-ride/full-tuition scholarships](https://pdfhost.io/v/S0pTMmSXV_Internationals_Scholarship_Masterlistpdf.pdf) and [colleges that offer need-based aid to international students](https://www.reddit.com/r/ApplyingToCollege/comments/bh9yh9/list_of_us_universities_providing_full/). Links from the r/intltousa Discord - check it out if you haven't yet.",
      "author": "dominaxe",
      "created": 1638434973,
      "upvotes": 3,
      "replies": {}
    },
    "hmwj94i": {
      "link": "/r/ApplyingToCollege/comments/r704pb/my_budget_is_only_5k10k_to_study_abroad_in_the_us/hmwj94i/",
      "text": "listen i’m just gonna tell you what i know as someone who’s lived in the US almost all their life and is attending a college here as well. it’s really really expensive to go to schools here, the only way people mitigate the cost (before financial aid and scholarships) is by going to school in-state. the problem that presents itself for international students wishing to study here, is that they are offered very little scholarships and no financial aid.  the us is an amazing place to study if you are able to pay full tuition(which very little people can do). i know germany has universities that offer courses in english and i really do think it’s something you should look into. it’s a beautiful country with amazing low cost education, i almost went there for university (i’m a german citizen so it was a very open door for me) but had to stay in the usa because of health issues. but you really should look into a) german universities with english courses b) private scholarships if you really wish to study in the us",
      "author": "neptuneestates",
      "created": 1638427234,
      "upvotes": 6,
      "replies": {}
    },
    "hmyhtng": {
      "link": "/r/ApplyingToCollege/comments/r704pb/my_budget_is_only_5k10k_to_study_abroad_in_the_us/hmyhtng/",
      "text": "I'm applying to USA, but I have some friends applying to Italy, and that is just so much easier. Public schools max out at 5k tuition a year, and it's incredibly easy to make it into the top universities. You get a blue diploma and can find jobs everywhere in the EU. \n\nImo US is much worse than EU countries to apply to. If your priority is escaping your country, I'd advise that.",
      "author": "ChiliManNOMNOM",
      "created": 1638467469,
      "upvotes": 1,
      "replies": {}
    }
  }
}