{
  "sid": "q6pefg",
  "link": "/r/ApplyingToCollege/comments/q6pefg/how_do_i_build_up_extracurriculars_for_t20/",
  "title:": "How do I build up extracurriculars for T20 colleges in just 1 year?",
  "text": "17/M studying A levels first year in Pakistan. I have always had straight A grades, I got 8A\\* in O levels, and will strive to get A\\* in A levels as well. I'm taking physics, computer science, maths, and further maths at the moment. However, I have no extracurricular activities. Like 0. I've been somewhat socially reclusive and haven't bothered to participate in ECs. Due to this, I've only considered British universities like Oxbridge and Imperial since they only focus on academic ability and not ECs. I also have British nationality, which makes the UK more convenient. However, I would like to go to study in the US, particularly at Stanford or MIT for opportunities in Silicon Valley, and general interest in the more open US academic curriculum (no electives in UK education).\n\nWhat must I do to become a competitive applicant? I've been taking courses on CS and intend to get into freelance working on fiver/Upwork. I'll also strive for summer school in the US for extra opportunities relating to CS. I realize that these EC goals are very underwhelming, but I haven't an idea of what else I could participate in. I do not intend to do anything that isn't in my general interest like Instagram nonprofits or do volunteer work in the Congo or Vietnam because 1. that feels fake as hell, and 2. I'm pretty sure that admissions officers see right through that bullshit.\n\nI can give some personality descriptions for you guys to work with, suggest some ECs.\n\n1. I'm a decent student, but I'm no prodigy that's won any olympiads or done any research. My IQ is about 125, (I know that IQ is superficial just illustrating a rough image here), and I am willing to go through great mental stress to improve my knowledge, perspective, and thinking.\n2. I am a casual debator and have written decent argumentative essays in English class. Bear in mind I have no professional experience like MUNs, competitions, or Toastmaster clubs.\n3. My best subjects are Maths and Computer Science. I'm alright at the more tangible sciences like physics or chemistry. I casually write essays and debates in English. I'm interested in history but currently at a very casual level, like yt channel level casual.\n4. I'm not the most social of people but am willing to get out of my comfort zone to participate in activities involving other people.\n\nI solved a SAT practice exam with zero preparation and scored 1290. My target SAT is 1550 - 1600, and target ACT is 34-36.",
  "author": "Hamza_T42",
  "created": 1634054441,
  "updated": 1634072790,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hgdc8hg": {
      "link": "/r/ApplyingToCollege/comments/q6pefg/how_do_i_build_up_extracurriculars_for_t20/hgdc8hg/",
      "text": "Find something that you like and can get tangible results, whether it’s becoming an Eagle Scout, winning senate tournaments, etc",
      "author": "moonriver252",
      "created": 1634055634,
      "upvotes": 2,
      "replies": {}
    },
    "hgdg3lo": {
      "link": "/r/ApplyingToCollege/comments/q6pefg/how_do_i_build_up_extracurriculars_for_t20/hgdg3lo/",
      "text": "Unpopular opinion--1 year is more than enough time to build up incredible extracurriculars. Reach out to as many people as you can.\n\nMake sure to raise your SAT score, though.",
      "author": "this-dilemma",
      "created": 1634057203,
      "upvotes": 1,
      "replies": {
        "hged93q": {
          "link": "/r/ApplyingToCollege/comments/q6pefg/how_do_i_build_up_extracurriculars_for_t20/hged93q/",
          "text": "Fax. One year is more than enough",
          "author": "ggezre",
          "created": 1634070769,
          "upvotes": 1,
          "replies": {
            "hgeeljz": {
              "link": "/r/ApplyingToCollege/comments/q6pefg/how_do_i_build_up_extracurriculars_for_t20/hgeeljz/",
              "text": "Yes BUT colleges want to see long term commitment to some activities of at least 2 years",
              "author": "ssssseabass",
              "created": 1634071317,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}