{
  "sid": "qb0dbf",
  "link": "/r/ApplyingToCollege/comments/qb0dbf/college_students_please_tell_me_about_your/",
  "title:": "College students, please tell me about your college/university!",
  "text": "Hi college students on this subreddit! Please comment your school and all the niche things about it that just can’t be understood from college websites or virtual info sessions. I feel as though I am missing out on getting the vibe of universities that I haven’t been able to visit. Here are a few things I’m particularly interested in:\n\n1. School name and your field of study\n2. What’s unique about the classrooms at your school (class size, lecture halls, tables, desks, etc.)?\n3. What are the professors like? Do you feel like you can make a connection with them? What’s the general teaching and testing style?\n4. What are the students like in the classroom? Are they more collaborative or individual workers?\n5. What are the students like outside of the classroom? Are they friendly? What’s the average friend group like?\n6. On a side note, what are the extracurriculars, sports, party life, and Greek life like? \n7. What is the campus like? Is it a lot of walking? Do students spend time outdoors? What are indoor study and chill spaces like?\n8. How are the dorms and bathrooms? Are they clean or dirty, cramped or spacious, and new or old?\n9. What are your favorite and least favorite things about the school?\n10. What made you choose your school? Are you happy with your decision?\n\nIf you know of a similar thread or another platform with all this info, please point me to it! Thank you for sharing about your college :) and I think your responses will help me find what I’m looking for in schools.",
  "author": "kohinoor0607",
  "created": 1634605179,
  "updated": 1636160380,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh6fwpi": {
      "link": "/r/ApplyingToCollege/comments/qb0dbf/college_students_please_tell_me_about_your/hh6fwpi/",
      "text": "You might also spend some time reading the subreddits of the colleges on your list.",
      "author": "elkrange",
      "created": 1634605463,
      "upvotes": 3,
      "replies": {}
    },
    "hh6sh9i": {
      "link": "/r/ApplyingToCollege/comments/qb0dbf/college_students_please_tell_me_about_your/hh6sh9i/",
      "text": "northeastern - criminal justice and political science major \nif you’re actually interested in nu then i’ll go into detail lol",
      "author": "Witty-Evidence6463",
      "created": 1634611592,
      "upvotes": 2,
      "replies": {
        "hh6vpqe": {
          "link": "/r/ApplyingToCollege/comments/qb0dbf/college_students_please_tell_me_about_your/hh6vpqe/",
          "text": "Yes, I am interested in Northeastern!",
          "author": "kohinoor0607",
          "created": 1634613256,
          "upvotes": 1,
          "replies": {
            "hh975mg": {
              "link": "/r/ApplyingToCollege/comments/qb0dbf/college_students_please_tell_me_about_your/hh975mg/",
              "text": "okay cool!\n2. average class size is 24 and the vast majority are discussion based so its not all lectures \n3. really highly qualified, One of my professors was the former chief justice of the Massachusetts Supreme Court, another one worked for the FBI! all the professors seem to have actually worked in the fields that they’re teaching, so they’re not just academics. I personally don’t have any close relationships with professors, but I also haven’t really tried\n4. very collaborative\n5. some of those friendly people I’ve ever met, very diverse interests, everyone is very interesting & has cool stories\n6. frat parties every weekend, tons to do in Boston, you can definitely have a good party life, but you definitely don’t need to. Sports aren’t super big, but hockey is really fun to go to\n7. campus is only 73 acres, so you can get from one side to the other in around 15 minutes. The campus is actually classified as an arboretum because it’s very green, but also still right in Boston. some super cool buildings like ÍSEC\n8. I lived in a traditional freshman dorm, really enjoyed it. It was old but well-maintained and also very clean.\n9. favorite thing is the co-op program, also lots of good clubs to choose from, and some really fun traditions. Least favorite things is that it’s expensive, sometimes administration can be really annoying and not listen to students\n10. campus/location, coop, academic flexibility, study abroad options. super happy!!",
              "author": "Witty-Evidence6463",
              "created": 1634663911,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hh7ahee": {
      "link": "/r/ApplyingToCollege/comments/qb0dbf/college_students_please_tell_me_about_your/hh7ahee/",
      "text": "Denison- Physics and Phil.\n\nLemme know if you're interested.",
      "author": "DiarrheaASMR28",
      "created": 1634622693,
      "upvotes": 1,
      "replies": {}
    }
  }
}