{
  "sid": "r5vrt5",
  "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/",
  "title:": "I’m going to be graduating from high school in a few months, and here are my regrets and mistakes you should avoid in high school…",
  "text": "1. Make friends, genuine friends, and remember, quality comes over quantity: Perhaps one of the most important tips I’d love to give to high school students is to make friends, because that’s something I’ve never put effort into. Hence, I’m technically going to graduate with almost no friends, and those who I have friendships with are the type of friendships that aren’t long lasting and formal. Remember, try to keep your social circle small, having a few friends who are loyal beyond limits is vastly superior than having innumerable friends who are also enemies under disguise and will stab you in the back whenever they fulfill the benefits of befriending you. The relationships you’re going to build during high school are going to be eternal; They will last forever. Therefore, don’t sell yourself short like I did and MAKE SOME FRIENDS. \n\n2.  Take care of your mental health: If you’re as ambitious as I am, chances are that you’ll suffer during high school and depression is going to INVADE you. Hence, unlike me, do take care of your mental health and seek help from teachers and peers whenever you feel demotivated. I always strived for the highest marks possible because I am a competitive person, but that is something I regret, because it effected my mental health tremendously. The question that may come in your mind is that did I actually get the marks I worked hard and sacrificed my mental health and social life for? The answer is NO. That is because there is a fine line of differentiation between working hard and working smart, there are numerous high school students who will be graduating with grades immensely higher than mine without the need of sacrificing their social lives and mental health. Thus, don’t be stupid like your older Brother here who committed every type of blunder while in high school. \n\n3. Failing a test isn’t the end of the world: I can’t stress enough on this point.. do you know that whatever your marks are when you graduate, as long as you graduate, you’re guaranteed a place at a university in whatever major you want (except Medicine) in many European countries? That is because getting lower marks than expected or failing a test isn’t the end of the world, by this, I don’t mean that you shouldn’t work smart and hard, please work hard and smart, but if you get lower/sub-par marks, that’s not an issue! Worst case scenario, you’ll repeat the year but if you’ve read this article up to this point, that means that you’re a great student who cares about school  and you’ll do more than excellent during high school, just make sure that you have the right mentality and work ethic, again, unlike your stupid older brother Musa who completely screwed up when it came to the work ethic. I didn’t get the marks that I worked hard for, but I’m still thriving and doing well and I also got accepted at some of the top 50 colleges in the world! \n\n4. You are a HUMAN, not a ROBOT: Don’t spend nights and days cramming for an upcoming exam because you’ll burnout and lose the will and passion to study, please take breaks, hangout with your friends, parents and Family, or go for a walk! For 4 years that I spent in high school, what I basically did was to cram for tests and it Screwed me up real good. I would almost always end up with unsatisfactory marks. We’re humans, we’re not perfect, and most importantly, we are equipped with HEARTS. So, don’t be a robot and enjoy life, even in the most stressful times of your journey in high school. If you know what you want to do after graduation and you’re set on a career, try, for example, joining clubs or initiatives related to that field and enjoy yourself! Don’t be like me, MARKS ARE NOT EVERYTHING. \n\n5. Don’t be over sensitive: Friends and teachers are going to make fun of you, girls are going to laugh at you for no reason (it happened with me) and you’ll get ghosted by many friends who won’t invite you to parties, study sessions and hangouts. This happened UNCOUNTABLE times with me, but I slowly learnt that that’s how life is, nobody can be trusted, not even you’re closest friend, trust me when I say that (the irony lol). If one of those things happens to you, just try to avoid that person or people and stop seeing them, because they’re toxic people who strive to ruin your life. \n\nFinal advice: Enjoy school and make the best out of it, these are tips I would give to my younger self, and I promised myself to never repeat these mistakes in College. Trust me when I say it, you’ll miss high school when it ends, and this is coming from a senior who has not graduated yet, there are a lot of mistakes that I wish to travel in a time machine to fix, but unfortunately, that is not an option. I am looking forward to what the future holds for me and I believe that if I avoid these mistakes during college, I’m going to live the best days of my life these. Sure, I’ve had some great memories and moments from high school, but they weren’t as much as to dwell in the ocean of my memory for an eternity. Dear self, I promise to not let you down during and after college, and I am deeply apologetic for all the bad days we went through, but I guess that’s life, isn’t it? We learn through trial and error and we NEVER repeat mistakes we once committed…",
  "author": "fxi2",
  "created": 1638301968,
  "updated": 1638478656,
  "over_18": false,
  "upvotes": 85,
  "upvote_ratio": 0.93,
  "comments": {
    "hmqhtvl": {
      "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/hmqhtvl/",
      "text": "\\>The relationships you’re going to build during high school are going to be eternal; They will last forever.   \n\n\noh you sweet summer child..",
      "author": "Peter_Lobster",
      "created": 1638320008,
      "upvotes": 33,
      "replies": {}
    },
    "hmqehkf": {
      "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/hmqehkf/",
      "text": "Good advice, but for many people college is a great place to make lifelong friends. Good luck!",
      "author": "CaraMorrow",
      "created": 1638318510,
      "upvotes": 12,
      "replies": {}
    },
    "hmphwmt": {
      "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/hmphwmt/",
      "text": "this is very good advice, i like how much thought you put into this. i agree with everything you said, for current and future seniors, don't forget to take care of yourself, personal days are nothing to feel guilty about :-) good luck everyone <3",
      "author": "neonheadache",
      "created": 1638304802,
      "upvotes": 8,
      "replies": {
        "hmpi1a8": {
          "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/hmpi1a8/",
          "text": "Thank you sweetheart, you’re truly the good side of the internet :) <3",
          "author": "fxi2",
          "created": 1638304853,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmr4gry": {
      "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/hmr4gry/",
      "text": "friendships/relationships in high school are definitely not eternal or going to last forever lol, college maybe. other than that I agree",
      "author": "blahblahblah_random",
      "created": 1638330253,
      "upvotes": 5,
      "replies": {
        "hmrglpz": {
          "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/hmrglpz/",
          "text": "thought that at first too, but i think genuine friendships do. lots of adults i know are still very close with their hs best friends and i imagine i will be too",
          "author": "pauliticks",
          "created": 1638336457,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmrficx": {
      "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/hmrficx/",
      "text": "Pro tip to you (and everyone else): remember these advice when you go through college. They are actually more important than ever because you don't have parents watching over you.",
      "author": "idkname999",
      "created": 1638335866,
      "upvotes": 4,
      "replies": {}
    },
    "hmspvem": {
      "link": "/r/ApplyingToCollege/comments/r5vrt5/im_going_to_be_graduating_from_high_school_in_a/hmspvem/",
      "text": "Point 1 definitely checks out. I have two (literally two) good friends from high-school, but I'd trust them with almost anything and they've confided some pretty private stuff with me too.",
      "author": "eccentric-Orange",
      "created": 1638368035,
      "upvotes": 1,
      "replies": {}
    }
  }
}