{
  "sid": "qcicxo",
  "link": "/r/ApplyingToCollege/comments/qcicxo/any_good_universities_for_my_subject/",
  "title:": "Any good universities for my subject?",
  "text": "Hi, I've been applying biochemistry programs for the past couple of months for the spring term but now I'm feeling like biomedical engineering is a better program for me. do you guys know about any universities that offer it? also do you think its a good major for a premed student?",
  "author": "Glittering_Map648",
  "created": 1634786560,
  "updated": 1634848734,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhg7zub": {
      "link": "/r/ApplyingToCollege/comments/qcicxo/any_good_universities_for_my_subject/hhg7zub/",
      "text": "Plenty of schools offer BME; Google is your friend.\n\nContent-wise, it’s a good major for pre-med. From a med-school application standpoint, however, it can be a GPA killer.",
      "author": "Strict-Special3607",
      "created": 1634787246,
      "upvotes": 4,
      "replies": {}
    },
    "hhg8wf3": {
      "link": "/r/ApplyingToCollege/comments/qcicxo/any_good_universities_for_my_subject/hhg8wf3/",
      "text": "I did BME as a pre-med and I'm applying to med schools now. It's fantastic training. But like u/strict-special3607 said, it ain't easy. I had double lab most quarters to be able to complete pre-med and engineering on time. I didn't have a stellar GPA after undergrad, but I made up ground with my MCAT. That said, I wouldn't change it for anything. You'll be a better problem solver and you'll see medicine differently than traditional pre-meds.\n\nI did BME at Dartmouth, which also adds the element of liberal arts to BME and pre-med. Again, I think liberal arts is another good component of pre-med training. What you want to study (e.g. tissue engineering, biomaterials, design, etc) will help determine what makes a school good for you. Duke, Vanderbilt, UMich, Georgia Institute of Tech, and WashU also all have really strong BME, to name a few",
      "author": "leadbunny",
      "created": 1634787729,
      "upvotes": 2,
      "replies": {
        "hhh004y": {
          "link": "/r/ApplyingToCollege/comments/qcicxo/any_good_universities_for_my_subject/hhh004y/",
          "text": "thanks for your reply. the universities you mentioned are indeed prestigious but I must mention that I'm an international student with my grades usually being around Bss and a few A's. that might decrease my chances of being admitted to one of those unis since they requires really high grades if Im not wrong.",
          "author": "Glittering_Map648",
          "created": 1634808778,
          "upvotes": 1,
          "replies": {
            "hhhix49": {
              "link": "/r/ApplyingToCollege/comments/qcicxo/any_good_universities_for_my_subject/hhhix49/",
              "text": "Sorry, I can't really speak to their international admissions standards. You'd have to reach out to their admissions offices",
              "author": "leadbunny",
              "created": 1634821689,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhga21t": {
      "link": "/r/ApplyingToCollege/comments/qcicxo/any_good_universities_for_my_subject/hhga21t/",
      "text": "These schools have very employable Bio-E: https://collegescorecard.ed.gov/search/?cip4=1405&cip4_degree=b&fos_salary=70000..150000&page=0&sort=completion_rate:desc&toggle=fos   I have heard good things for it being pre-med with some tracts allowing you to take med-school classes as an undergrad in addition to being pre-med. It has the additional benefit of providing an option outside of medicine if you graduate and don’t want to become doctor.",
      "author": "TritonTheCat",
      "created": 1634788375,
      "upvotes": 2,
      "replies": {}
    }
  }
}