{
  "sid": "qms7tl",
  "link": "/r/ApplyingToCollege/comments/qms7tl/admission_stress_rn_is_srsly/",
  "title:": "admission stress rn is srsly 📈",
  "text": "im just sitting here having already submitted 23/25 schools (pretty much all of them i did EA for if they let me, otherwise i just early submitted my RD and now ive gotta finish UCs and USC) but now that we are a few days into november im chewing my nails and refreshing my emails every hour in anticipation lmfao\n\nive already got admitted to my safety (rolling @ columbia college chic.) but my friend who applyed to UO literally last week got accepted 2 days ago… i still havent recieved a decision and i applied near a month ago 🤡 \n\nanyway im relieved knowing that whatever happens i am going to college no matter what but not knowing when so many of these colleges are coming out is killing me. just knowing that the specific reason my anxiety is eating me alive is that within the next few months the entire course of my next four years will be decided for me and im just… habsjsbe\n\nsorry for the rant lmao, but i guess this also serves as a You Are Not Alone message to everyone else obsessively stalking A2C. We all feel each other’s pain on here and every once in awhile I think we just need a reminder :)",
  "author": "chaysi",
  "created": 1636053460,
  "updated": 1636135741,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hjdllbs": {
      "link": "/r/ApplyingToCollege/comments/qms7tl/admission_stress_rn_is_srsly/hjdllbs/",
      "text": "hey I'm not sure if this helps or not but I (a college freshman) was poking around my transcript the other day and saw the exact day my ED1 school admitted me. I applied in mid-October, I got my decision on December 15th, and they accepted me on the 7th. A lot of my ED1 friends had similar days. A lot of colleges accept people in rounds and probably won't have a decision for you until very close to the deadline, so if it's stressing you out thinking about the decision just remember one probably hasn't been made yet. Try to put things in perspective and maybe that will help you mentally downplay things?",
      "author": "clifbaraddict",
      "created": 1636086112,
      "upvotes": 3,
      "replies": {}
    },
    "hjd57u6": {
      "link": "/r/ApplyingToCollege/comments/qms7tl/admission_stress_rn_is_srsly/hjd57u6/",
      "text": "Well think about it. If they’re going in order, they’re looking at the ones that are at the top of the list, AKA the newest ones. That’s the ironic part of applying first is it means your application may be sitting at the bottom of an electronic barrel.",
      "author": "meo6",
      "created": 1636077740,
      "upvotes": 2,
      "replies": {}
    }
  }
}