{
  "sid": "r2euob",
  "link": "/r/ApplyingToCollege/comments/r2euob/best_universities_in_us_with_scholarship_or/",
  "title:": "Best universities in U.S with scholarship or on-campus work",
  "text": "I'm aiming to become a international student with a penchant for physics and economics. But I think that I won't be able to pay $20 000 or more after finance aid. So, what universities I can apply that give 100% covering or a possibility of working while studying?",
  "author": "Dmitry_Tech",
  "created": 1637901186,
  "updated": 1638206232,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hm4crby": {
      "link": "/r/ApplyingToCollege/comments/r2euob/best_universities_in_us_with_scholarship_or/hm4crby/",
      "text": "Just to clarify, are you saying your EFC is 20K? Do you know how much need-based aid you will be eligible for? If you’re eligible for full finaid based on need, work-study may be included in that package. \n\nI doubt on-campus work will be enough to cover a significant portion of the COA, unless you get a hefty scholarship as well. Most on-campus jobs pay around $15/hr. During the school year, intls can only work 20 hr/week at max. During breaks you can work for more hours, but finding either an on-campus job during break or finding an internship are both scenarios you can hardly bet on. Even so, I don’t think the total could come even close to covering the COA. But these considerations are moot depending on how much financial aid you’re eligible for, which I’m confused on based on your wording.",
      "author": "rainingsiberiancats",
      "created": 1637902483,
      "upvotes": 2,
      "replies": {}
    },
    "hm4cys3": {
      "link": "/r/ApplyingToCollege/comments/r2euob/best_universities_in_us_with_scholarship_or/hm4cys3/",
      "text": "Grinnell college is an amazing place with a unique style of academics. They also cover 100% of cost of attendance after expected family contribution & work study for domestic students. I think it applies to international students as well but you would have to check.\n\nYou wouldn't make a ton of money working while studying either, a couple k at most, I'd think",
      "author": "Gamerz1818",
      "created": 1637902608,
      "upvotes": 2,
      "replies": {}
    }
  }
}