{
  "sid": "rdrrer",
  "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/",
  "title:": "Please don't pressure your friends!",
  "text": "Sorry for the incoming rant ☹️ It's probably an overreaction but I just want to vent a bit right now.\n\nOne of my friends has been asking me every day about when my decisions are coming out and saying \"I KNOW you will get in\" really loudly when we're in front of other kids/teachers/etc. She also frequently talks about how we can cry and be depressed for the rest of the year together💀 if we both get rejected (She actually exclaimed this very loudly in orchestra this morning 💀).\n\nTo be honest, it's really embarrassing and I regret telling her where I applied. I never initiate conversation about college apps but she always brings it up and forces us to talk about it when she sees me - to the point where it feels like she is far more invested in my application than I am myself (extremely uncomfortable). \n\nI actually don't even care that much about my EA school (absolutely not to the extent that I'd be depressed or cry over it) and I sort of suspect she's projecting her own college stress onto me... maybe she's using my application as a talking point to distract and destress from her own apps? I don't think there's malicious intent (I don't even know if she's aware of how much pressure she's creating). \n\nBasically what I'm saying is I feel bad asking her to stop talking about college things, but also I'm getting REALLY irritated by the lack of self-awareness. We may be friends, but my college apps are not her business. 😭 I really want to be left alone because she is just worsening the pressure right now.",
  "author": "crispyboot",
  "created": 1639197679,
  "updated": 1639515349,
  "over_18": false,
  "upvotes": 62,
  "upvote_ratio": 0.96,
  "comments": {
    "ho302fb": {
      "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho302fb/",
      "text": "f i hate when people do that..😭😭\nLike if I get rejected it feels like brought them down",
      "author": "mirinijuice",
      "created": 1639197745,
      "upvotes": 28,
      "replies": {
        "ho31tbz": {
          "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho31tbz/",
          "text": "😭Yeah it's super awkward...",
          "author": "crispyboot",
          "created": 1639198679,
          "upvotes": 3,
          "replies": {}
        },
        "ho4tzit": {
          "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho4tzit/",
          "text": "sameeee 😭 everyone thinks imma get into my early school and when i dont it's gonna be super embarrassing to tell everyone and let them down",
          "author": "Ok_Place2147",
          "created": 1639239021,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ho34yw3": {
      "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho34yw3/",
      "text": "I set boundaries with my friend group about college stuff and it has worked really well",
      "author": "Round-Corner8371",
      "created": 1639200428,
      "upvotes": 10,
      "replies": {
        "ho3s5n3": {
          "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho3s5n3/",
          "text": "I did this too! We actually discussed and decided that we would openly share where we got accepted/rejected, even if someone else in the group applied to the same place. This helped alleviate so much stress because I knew they would be there for me no matter what.",
          "author": "reesespieces610",
          "created": 1639217044,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho31kc0": {
      "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho31kc0/",
      "text": "You know, she is not a mind reader. Tell her how this makes you feel.",
      "author": "CodyGamz",
      "created": 1639198544,
      "upvotes": 22,
      "replies": {
        "ho31rni": {
          "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho31rni/",
          "text": "True! 😢Not great at communication but I will try to talk to her about it on Monday.",
          "author": "crispyboot",
          "created": 1639198653,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "ho35dtx": {
      "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho35dtx/",
      "text": "Definitely set some boundaries. But try to assure her that she'll be fine, whether or not she and/or you get in—like you said, she might just be feeling a lot of stress. Good luck to the two of you!",
      "author": "dominaxe",
      "created": 1639200667,
      "upvotes": 6,
      "replies": {}
    },
    "ho3cn0v": {
      "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho3cn0v/",
      "text": "This happened to me as well. I didn't really want anyone from my school to know I'm applying abroad but then my counselor told my teachers and one of them brought it up in class. And now everyone's telling me how I'll get in and asking me about it, even though they know nothing about the process and the colleges. I just try to nod and move on, so hang in there op and don't stress too much. Some people just like to project their insecurities onto others and there's nothing you can do about it.",
      "author": "noothingnew",
      "created": 1639205150,
      "upvotes": 5,
      "replies": {
        "ho3d8li": {
          "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho3d8li/",
          "text": "OMG SAME...SAME SAME. my headteacher even let everyone in my class know my SAT/English proficiency test scores :(((( even tho I tried so hard to keep my application process a secret at school and after that, all the teachers were asking me about it and commenting on literally everything. I'm the only person planning on studying abroad as well. It's so freaking uncomfortable.",
          "author": "InitialIdea923",
          "created": 1639205552,
          "upvotes": 5,
          "replies": {
            "ho3egb7": {
              "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho3egb7/",
              "text": "Same here. In my school only like 1 or 2 people per year apply abroad and they are usually geniuses with international awards while I am mostly average, perhaps slightly above average. And then I have my counselor tell me everyone she ever worked with got into a prestigious school abroad and how I hopefully won't break her streak... It's so pressuring. If no one knew I'd just move on from my rejections, but I can't stand everyone cheering over my failures (happened a lot of times before) or looking at me as if I let them down personally. I don't care much about what others think about me, but that kind of environment is so toxic and isn't helping my anxiety at all.",
              "author": "noothingnew",
              "created": 1639206402,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ho3fpj1": {
          "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho3fpj1/",
          "text": "NO omg why is this such a universal experience. That sounds quite uncomfortable  😞",
          "author": "crispyboot",
          "created": 1639207349,
          "upvotes": 2,
          "replies": {}
        },
        "ho3sa7c": {
          "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho3sa7c/",
          "text": "I deflected for as long as I could until I eventually told my grade I was applying somewhere else altogether. Now results are coming out and people are asking me if I got into the other school (which tbh doesn’t hurt much because I never even applied)",
          "author": "reesespieces610",
          "created": 1639217141,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ho3kutr": {
      "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho3kutr/",
      "text": "I told my 'friend' I didn't get into Rice and he's been mockingly telling everyone how I didn't get in. Guess I have one less friend now.",
      "author": "Disastrous-Ad-1328",
      "created": 1639211250,
      "upvotes": 3,
      "replies": {}
    },
    "ho37sxo": {
      "link": "/r/ApplyingToCollege/comments/rdrrer/please_dont_pressure_your_friends/ho37sxo/",
      "text": "Please I did this someone but apologized because eww. But just remember she trying to help and talk to her.",
      "author": "thequeen777",
      "created": 1639202084,
      "upvotes": 2,
      "replies": {}
    }
  }
}