{
  "sid": "q5zkmp",
  "link": "/r/ApplyingToCollege/comments/q5zkmp/recommendation_letter_and_grades/",
  "title:": "Recommendation letter and grades",
  "text": "hey everyone😭 so I asked my math teacher for a recommendation letter and he agreed, however, I'll most likely get a B on his subjects (algebra+geometry) at the end of the first quarter. we have a nice relationship and I was getting all As in previous years - it's just that I was preparing for SAT and also the subject curricula is pretty tough in the final year so I am a little behind... what AOs will think about that? will they find it weird to read a rec letter from a teacher in whose class I got Bs? 😫",
  "author": "skibidvapaaa",
  "created": 1633969434,
  "updated": 1634072921,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hg8u2n9": {
      "link": "/r/ApplyingToCollege/comments/q5zkmp/recommendation_letter_and_grades/hg8u2n9/",
      "text": "I’m also getting a letter of rec from my math teacher and it’s actually the class I’m performing  the worst in. However, getting a letter from that teacher may show the unis that I’m still engaged and interested in the class, which may be worth more than getting a letter from another teacher. Nevertheless, I could be very wrong. Hard to say.",
      "author": "Impossible-Value5352",
      "created": 1633969821,
      "upvotes": 5,
      "replies": {
        "hg8uq7c": {
          "link": "/r/ApplyingToCollege/comments/q5zkmp/recommendation_letter_and_grades/hg8uq7c/",
          "text": "I see.. welp I hope everything will be ok😭",
          "author": "skibidvapaaa",
          "created": 1633970090,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hg9vruf": {
      "link": "/r/ApplyingToCollege/comments/q5zkmp/recommendation_letter_and_grades/hg9vruf/",
      "text": "nah, it’s not weird. it’s good that you asked him because you have a nice relationship, i think that’s what’s most important",
      "author": "rapsodiya",
      "created": 1633985823,
      "upvotes": 3,
      "replies": {}
    }
  }
}