{
  "sid": "q6pv7g",
  "link": "/r/ApplyingToCollege/comments/q6pv7g/does_it_look_bad_if_i_drop_spanish_as_a_junior/",
  "title:": "does it look bad if i drop spanish as a junior?",
  "text": "i'm not great at spanish at all. my average is bad so far and it most likely will be in the 80s during the year. last year my average was also in the 80s for spanish. this year's spanish class is pre-AP (above honors). the rest of my subjects are advanced (4 APs + 1 dual enrollment class). if i drop spanish for this semester, i'd take another class for the second semester during that class period (most likely dual-enrollment).\n\nmy ECs are very good by most people's standards and my grades last yr were good (94 UW, 99 W GPA). i'm scoring well on practice ACTs so far and think i can get my score up to a 33+. my AP scores from last yr were all 4s (on WHAP, CSP, & Seminar).\n\nspanish will also stress me out a lot and give me more to study for. ive already been struggling a lot w the transition to in-person learning, and have a chronic illness exacerbated by stress.\n\nif i drop spanish now, will it 1) show on my transcript (i'll ask my counselor to be sure) and **2) will this look bad for an AO?** ik that in the grand scheme of my application it should be fine but was curious to hear what y'all think.\n\nfyi, my major is design/cognitive science so i dont think i need spanish",
  "author": "pulsar-beam",
  "created": 1634055730,
  "updated": 1634572632,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgdcxlh": {
      "link": "/r/ApplyingToCollege/comments/q6pv7g/does_it_look_bad_if_i_drop_spanish_as_a_junior/hgdcxlh/",
      "text": "Honestly, whether it appears on your transcript ends up answering both questions. Your AO won't know if you drop a class, a HS one, unless it's listed on your transcript\n\nEven then, you already look to have a rigorous coursework so you should be good either way",
      "author": "IndividualBeliefs",
      "created": 1634055915,
      "upvotes": 2,
      "replies": {
        "hgdec1s": {
          "link": "/r/ApplyingToCollege/comments/q6pv7g/does_it_look_bad_if_i_drop_spanish_as_a_junior/hgdec1s/",
          "text": "thank you for the help!! i’m concerned that it will look a little bad that i dropped the class (if they can see that). if they can’t see it, i’m worried that it’ll look bad that i didn’t take 4 years of foreign lang :( tbh i think my ECs and other courseload evens it out tho",
          "author": "pulsar-beam",
          "created": 1634056484,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgeeswj": {
      "link": "/r/ApplyingToCollege/comments/q6pv7g/does_it_look_bad_if_i_drop_spanish_as_a_junior/hgeeswj/",
      "text": "How many years of Spanish have you completed. It will likely only affect you at schools where you don’t meet the recommendation.",
      "author": "RichInPitt",
      "created": 1634071399,
      "upvotes": 1,
      "replies": {
        "hgeiwot": {
          "link": "/r/ApplyingToCollege/comments/q6pv7g/does_it_look_bad_if_i_drop_spanish_as_a_junior/hgeiwot/",
          "text": "one year in middle school and two full years in high school. this year would be my fourth year taking spanish",
          "author": "pulsar-beam",
          "created": 1634073067,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}