{
  "sid": "qwc722",
  "link": "/r/ApplyingToCollege/comments/qwc722/hello_everyone_i_need_your_advice_please/",
  "title:": "Hello everyone, I need your advice please",
  "text": "I have been thinking about working for 1 or 2 years then attending community college and then going to college or a music conservatory (this is because I want to study music with a concentration in voice/opera) for 2 or 3 years (depending on how my credits transfer) and going on to get my masters, the problem is that my dad said if I go to community college he wouldn’t pay for books, other fees etc. and I’m scared that people will judge me later on for going to school later in life. Any advice? Also, mind you this is just something I’m currently thinking about, this isn’t set in stone or anything",
  "author": "The_Tamers_Tamed_",
  "created": 1637192585,
  "updated": 1637353581,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hl1ygod": {
      "link": "/r/ApplyingToCollege/comments/qwc722/hello_everyone_i_need_your_advice_please/hl1ygod/",
      "text": "I got pressured into going to school instead of community college and j regret it. I’ll tell you this I thought everyone would judge for doing community college but when u finally get to college NOBODY CARES they are all trying to find their way same as you but it’s so much easier for ur schedule and health to simply\nDo community college. Don’t feel scared of what others think it’s really just HS’ers that seem to judge until they grow up and realize it isn’t like the movies 😂 go with your heart and your wallet",
      "author": "Plane_Flan_1591",
      "created": 1637192807,
      "upvotes": 3,
      "replies": {
        "hl1yju2": {
          "link": "/r/ApplyingToCollege/comments/qwc722/hello_everyone_i_need_your_advice_please/hl1yju2/",
          "text": "Thank you!",
          "author": "The_Tamers_Tamed_",
          "created": 1637192847,
          "upvotes": 1,
          "replies": {
            "hl1yoix": {
              "link": "/r/ApplyingToCollege/comments/qwc722/hello_everyone_i_need_your_advice_please/hl1yoix/",
              "text": "Yeah also when u spend time in community college u get to earn money which you end up spending a lot of up here. Finally it does help to take time and find what you want because I changed my major three times which I spent more time exploring. Anyways good luck!",
              "author": "Plane_Flan_1591",
              "created": 1637192906,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}