{
  "sid": "qbn6sk",
  "link": "/r/ApplyingToCollege/comments/qbn6sk/i_accidentally_sent_my_highest_composite_to_some/",
  "title:": "I accidentally sent my highest composite to some colleges that superscore",
  "text": "I made a dumb mistake of sending some of the colleges that I am applying to my highest composite instead of my superscore. Is there anything I can do or will they just look at my composite?\n\nThanks in advance!",
  "author": "dragtherag",
  "created": 1634684136,
  "updated": 1634749746,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhancyp": {
      "link": "/r/ApplyingToCollege/comments/qbn6sk/i_accidentally_sent_my_highest_composite_to_some/hhancyp/",
      "text": "Check each college's website to see what score reporting methods they accept. Colleges that accept self-reported scores often have an option in the portal to update scores. For colleges that require an official score report prior to admission, you would need to order an official report with the scores you forgot to report earlier.",
      "author": "elkrange",
      "created": 1634685380,
      "upvotes": 2,
      "replies": {
        "hhao258": {
          "link": "/r/ApplyingToCollege/comments/qbn6sk/i_accidentally_sent_my_highest_composite_to_some/hhao258/",
          "text": "Thank you for the response. All of them accept self-reporting and they say that they need an official score after being admitted. So does that mean that they won't look at the official score from ACT and they will look at the scores I put in the common app when applying? Sorry if it's confusing.",
          "author": "dragtherag",
          "created": 1634685704,
          "upvotes": 1,
          "replies": {
            "hhazkg8": {
              "link": "/r/ApplyingToCollege/comments/qbn6sk/i_accidentally_sent_my_highest_composite_to_some/hhazkg8/",
              "text": "They will look at whatever scores you have given them in any manner. If you didn't report all the scores you had intended to, then see if you can add them in the portal.\n\nAfter you are admitted and decide to enroll, you would need to make sure they have official reports proving all the scores you had self-reported.",
              "author": "elkrange",
              "created": 1634691123,
              "upvotes": 2,
              "replies": {}
            },
            "hhbciar": {
              "link": "/r/ApplyingToCollege/comments/qbn6sk/i_accidentally_sent_my_highest_composite_to_some/hhbciar/",
              "text": "I’d resend the complete scores just to avoid confusion.",
              "author": "RichInPitt",
              "created": 1634697189,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}