{
  "sid": "qf090d",
  "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/",
  "title:": "Seeing my golden friend makes me doubt I'll even graduate high school lol",
  "text": "Background: Former gifted kid here. I guess everything was sort of handed to me without me work, plus I am an undiagnosed ADHD kid, so yeah it all goes downhill from there. I was one of those kids who peaked in elementary school.  Over the past few years I've completely fallen off-from top student to failing a semester, not doing anything with my life, and losing hope. I am uninvolved, don' really do any sports, and have no hobby except for writing. I don't even think I'll graduate high school due to my bad grades last year. \n\nAnd then I met this girl. \n\nWe had met a few years prior, and we were both at the same stage of life, but the problem is everything has just gone downhill for me while everything has gone uphill for her. We both work the same job, and although she only started a bit earlier than me she seems to be much more favored for her go-getter personality. She is part of all these exclusive clubs an groups within the school district and is heavily involved. Our teachers love her. Our manager loves her. Harvard even chose her to be part of this committee thing. She knows every event that goes on, has an impeccable work ethic- and on top of that she works out at, like 5am. So basically, I'm jealous of somebody who deserves everything they've got. Do you see the problem here?\n\nLook, I know not everything is at it seems on the surface level, but as a person who can't even do more tan one important task a day, I feel like shit. I know its wrong to be jealous, but I can't help but feel the envy bubble up inside of me.  But most importantly, she is like this messed up symbol of who I could've been if I had just made better choices in the past.  You know when people are like, \"Yeah I was depressed and anxious but I pushed through an won a Noble Peace Prize at the age of sixteen.\" ? If I wasn't so lazy, so clueless, so socially anxious- I could've been Golden Girl. If only I wasn't so stupid. The frustration just wraps itself around me to the point where I literally hate her sometimes.  . It's like Im fighting with myself, too. This evil demon side, the green eyed monster, and then the more understanding you know better\" side. \n\nyeah maybe I need therapy again",
  "author": "DifferenceWorldly939",
  "created": 1635106694,
  "updated": 1635182378,
  "over_18": false,
  "upvotes": 40,
  "upvote_ratio": 0.86,
  "comments": {
    "hhwnxcs": {
      "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhwnxcs/",
      "text": "Well I could go on and on about the risks of comparing yourself to other people, but it sounds like you’ve already learned about those. \n\nLook: nobody “peaks in elementary school”, and being undiagnosed for ADHD doesn’t mean that you are incapable of giving a damn or getting engaged with things you might enjoy doing.  You’re only like sixteen years old, there is an almost unbelievable amount of time to get things turned around.",
      "author": "chumer_ranion",
      "created": 1635108394,
      "upvotes": 33,
      "replies": {}
    },
    "hhxh0mi": {
      "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhxh0mi/",
      "text": "Throwing yourself a pity party on Reddit instead of taking steps to become that person is regression\n\nEdit: by this I mean you know what you have to do, no one else can do it for you besides yourself. You're the only person you will always have in your world and if even you don't serve your own self, youll find that life will get even harder to get through for yourself. And yeah, making the right decisions is hard. But in this life, we choose our hard. Choose the right one",
      "author": "amreim",
      "created": 1635121992,
      "upvotes": 17,
      "replies": {}
    },
    "hhwn3xq": {
      "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhwn3xq/",
      "text": "I'm proud of you okay? Everyone is different and handles stuff differently and I'm so proud of you for putting up with everything. Jealousy is a natural human emotion which can get the best of you but this isn't a marathon, it doesn't matter if XYZ person is doing better than you or not. You're the main character of your life and what you're doing is what matters more. Sending hugs, take care <3",
      "author": "anuxietys",
      "created": 1635108059,
      "upvotes": 14,
      "replies": {}
    },
    "hhxju01": {
      "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhxju01/",
      "text": "sending so much love from another undiagnosed adhd kid ❤️",
      "author": "hannahnotmontana16",
      "created": 1635123402,
      "upvotes": 6,
      "replies": {}
    },
    "hhxnjo1": {
      "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhxnjo1/",
      "text": "Get a formal evaluation from a neuropsychologist, or ask your parents to get you one if your not 18 yet. College and universities can accommodate documented disabilities and even take them into consideration when you apply, if you make them aware you have one.",
      "author": "juleeff",
      "created": 1635125278,
      "upvotes": 3,
      "replies": {}
    },
    "hhxshpb": {
      "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhxshpb/",
      "text": "It’s fantasy jealousy — you want the outcome but not the means. If you truly wanted her life you’d be up at 5am too. \n\nYou need to come out of fantasy world into real life. Yours specifically. \n\nYou can do this. It may be your way, on your timeline, not someone else’s way, but that’s okay.\n\nAnd remember: 1) you can’t control the past (so let it go), and 2) things can always get worse (be grateful for what you have).",
      "author": "E513",
      "created": 1635127795,
      "upvotes": 1,
      "replies": {}
    },
    "hhxus96": {
      "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhxus96/",
      "text": "The best time for you to reach your true potential was in the past, you can't control that. The second best time is now. Don't make the same mistakes that you'll continue to regret in the future.",
      "author": "DeForrest_A_Shun",
      "created": 1635128981,
      "upvotes": 1,
      "replies": {}
    },
    "hhwvoza": {
      "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhwvoza/",
      "text": "I applaud you for admitting this. You will get a lot of downvotes, because believe it or not, jealousy is the most stigmatized emotion, even more than pedophilia or sociopathy.\n\nI felt the same way. I started of the same as a kid I know, but he is now a USACO Camper. I felt like shit. I mean I have a patent and news coverage, but nothing on his level. By the way, we are bay area Asian males, so the bar is extra extra high for us. We were both on the same level in middle school. Worst thing is was that I too had the same emotions regarding him as you did for that girl. I stalked numerous LinkedIn profiles which made me feel even more jealous and resentful.\n\nI recently got over this. You have to get this in your head: If you heard the quote, comparison is the thief of joy, do not take it as face value. Comparison is actually the thief of success, which comes from joy. I internalized this after reading a medium article by a Harvard/Oxford graduate that outlined the negative impacts on your life if you compare yourself against other people. Spoiler: It is not only happiness that is affected, it is your ability to get success. So whenever you get those thoughts, repeat the thought that \"I am destroying my life\"",
      "author": "ApprehensiveHeron147",
      "created": 1635111721,
      "upvotes": -6,
      "replies": {
        "hhx24nd": {
          "link": "/r/ApplyingToCollege/comments/qf090d/seeing_my_golden_friend_makes_me_doubt_ill_even/hhx24nd/",
          "text": "article link?",
          "author": "pabshe",
          "created": 1635114642,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}