{
  "sid": "qx49rr",
  "link": "/r/ApplyingToCollege/comments/qx49rr/will_my_admission_be_revoked/",
  "title:": "Will my admission be revoked...?",
  "text": "So I got accepted into early admission for a university. Woo! In my acceptance letter it says \"your admission is offered on the condition that you successfully complete your current studies.\" Here's the issue: I am in a very hard math course right now that I am definitely no questions asked going to fail. It would destroy my average so I think I'm going to drop the class getting an \"incomplete\" on my transcript. Would my admission be revoked for this?\n\nEdit: I am doing arts and not pursuing anything math related so I don't need the course for admission. I only took it because I've always been pretty solid in math and 3 of my friends were in the class. Lesson learned, don't pick courses based on friends",
  "author": "Hey-its-me-5",
  "created": 1637283300,
  "updated": 1637353104,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hl756nb": {
      "link": "/r/ApplyingToCollege/comments/qx49rr/will_my_admission_be_revoked/hl756nb/",
      "text": "It could be since they admit you on the basis of your planned courses senior year. I would send them a note to tell them what you would like to do asap and see what they say.",
      "author": "TwoSuns168",
      "created": 1637285572,
      "upvotes": 2,
      "replies": {}
    },
    "hl7fyng": {
      "link": "/r/ApplyingToCollege/comments/qx49rr/will_my_admission_be_revoked/hl7fyng/",
      "text": "Possible. You should inform them and discuss, to get out in front of it.",
      "author": "RichInPitt",
      "created": 1637290500,
      "upvotes": 1,
      "replies": {}
    },
    "hl81y2m": {
      "link": "/r/ApplyingToCollege/comments/qx49rr/will_my_admission_be_revoked/hl81y2m/",
      "text": "You’re probably fine if the class isn’t needed for graduation or to fulfill a admission requirement of your college. Definitely email admissions asap to let them know you’re not doing well in the math class, so you want to withdraw, and ask if that will affect your offer of admission. Keeping admissions in the loop for something significant like dropping a class or a bad grade is important.\n\nMost admissions people will work with you. The offers are conditional because without that, a lot of seniors would write off the rest of senior year completely if they knew college was in the bag. \n\nThere are some exceptions to this, and hopefully your EA school isn’t one of them!",
      "author": "pixelatedpix",
      "created": 1637301941,
      "upvotes": 1,
      "replies": {}
    }
  }
}