{
  "sid": "rit4ih",
  "link": "/r/ApplyingToCollege/comments/rit4ih/im_the_biggest_idiot_advice_about_recommendation/",
  "title:": "I'm the biggest idiot - advice about recommendation letters",
  "text": "I just started filling out the MIT application today and I forgot that recommendation letters don't get uploaded automatically like they do with Naviance and the Common App, but I'm so stupid and I forgot to tell my dean and my teachers. Our winter break started today and we won't get back until Jan. 3, while the deadline is Jan 6. The bigger problem though is that one of my teachers went out on paternity leave literally today and probably won't be back for a couple months. It feels so incredibly rude to be emailing him when his wife is literally probably giving birth to a child today, but I also don't want to email him in January and only give him a couple days notice. The other two recommendations I'm not as worried about but this one is stressing me out so much. What should I do?",
  "author": "Existing_Ad574",
  "created": 1639781872,
  "updated": 1639785397,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hozg9ll": {
      "link": "/r/ApplyingToCollege/comments/rit4ih/im_the_biggest_idiot_advice_about_recommendation/hozg9ll/",
      "text": "just email him, my teachers told me they appreciate the time. Start the email out with an apology, and tell him what u need. He should understand",
      "author": "ImprovementOk1498",
      "created": 1639784047,
      "upvotes": 1,
      "replies": {}
    },
    "hozgdkr": {
      "link": "/r/ApplyingToCollege/comments/rit4ih/im_the_biggest_idiot_advice_about_recommendation/hozgdkr/",
      "text": "hi, I applied to mit ea and my letters and ssr were still submitted on naviance and just sent over by my school without me saying anything. The mit portal still asks you to send emails but I just told my teachers that they didn’t have to take any additional action and it was just for the portal, but you should check with your counselor to make sure everything is sent from naviance to mit hope this helped!",
      "author": "uselesswindow",
      "created": 1639784093,
      "upvotes": 1,
      "replies": {
        "hozii4j": {
          "link": "/r/ApplyingToCollege/comments/rit4ih/im_the_biggest_idiot_advice_about_recommendation/hozii4j/",
          "text": "Oh really? Thank you so much, that really helped! Good luck tomorrow!",
          "author": "Existing_Ad574",
          "created": 1639785078,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}