{
  "sid": "r732i7",
  "link": "/r/ApplyingToCollege/comments/r732i7/being_an_introvert/",
  "title:": "Being an introvert",
  "text": "I am an introvert so I feel very exhausted after meeting ppl, although I act like an extrovert at school and I talk a lot at school bc I have a lot of friends. And I am more extroverted around extroverts and fit in, and enjoy talking at the moment. But once I meet ppl and get home, I feel tired. School kind of energy consuming for me. I like to spend my own time and do my own stuff. Anyone feel the same? I wonder how this will last in college… I feel like sometimes just meeting ppl is kinda useless and I would more like to focus on my own work and life. And I feel like colleges and jobs prefer more extroverted ppl.",
  "author": "Firm-Radish-7666",
  "created": 1638434814,
  "updated": 1638478079,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmx85hx": {
      "link": "/r/ApplyingToCollege/comments/r732i7/being_an_introvert/hmx85hx/",
      "text": "College can be exhausting for introverts — because of the dorm socializing time and the class discussions and the regular socializing.  Make sure you take time to be alone and recharge your batteries, but don’t allow yourself to hide in your room to avoid social interaction. You’ll have to be working on the balance. Have you read Quiet?",
      "author": "admissionsmom",
      "created": 1638446974,
      "upvotes": 2,
      "replies": {}
    },
    "hmx5eqt": {
      "link": "/r/ApplyingToCollege/comments/r732i7/being_an_introvert/hmx5eqt/",
      "text": "All sorts of environments (colleges and jobs included) have a diverse group of people. There are plenty of both introverts and extroverts who are successful in their respective fields!",
      "author": "dominaxe",
      "created": 1638445027,
      "upvotes": 1,
      "replies": {}
    },
    "hmxdy7u": {
      "link": "/r/ApplyingToCollege/comments/r732i7/being_an_introvert/hmxdy7u/",
      "text": "You basically defined what it means to be an introvert. But just know that in college, just like high school, you’ll end up with your core group of friends and it won’t be draining. Starting off, yes, for a little bit. But not he entire time.",
      "author": "BuffsBourbon",
      "created": 1638450506,
      "upvotes": 1,
      "replies": {}
    },
    "hmxffp7": {
      "link": "/r/ApplyingToCollege/comments/r732i7/being_an_introvert/hmxffp7/",
      "text": ">And I feel like colleges and jobs prefer more extroverted ppl.\n\nAs a group, there's research to indicate extroverts do actually earn more.  But, clearly, you can also be wildly successful as an introvert.",
      "author": "jayphoward",
      "created": 1638451320,
      "upvotes": 1,
      "replies": {}
    }
  }
}