{
  "sid": "rf3p15",
  "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/",
  "title:": "Scared I wont get into ED School",
  "text": "im so terrified I wont get into my ED school and I've been rereading my essays over and over and I'm like omg why did I submit this like I hate them now. As a first generation college student my parent have put so much pressure on me to get into a good school and decisions come out in a few days and I don't know what to do. I really do not think I have a chance of getting in even though I worked so hard. I literally do not know what I'm going to do i feel like its actually gonna break me",
  "author": "Specialist-Look2142",
  "created": 1639359113,
  "updated": 1639514288,
  "over_18": false,
  "upvotes": 26,
  "upvote_ratio": 0.97,
  "comments": {
    "hobr70o": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hobr70o/",
      "text": "If you applied to a reach then (by definition) you should probably *expect* not to get in.",
      "author": "jayphoward",
      "created": 1639360725,
      "upvotes": 14,
      "replies": {
        "hocnm2x": {
          "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hocnm2x/",
          "text": "Why??",
          "author": "rawnakk",
          "created": 1639377628,
          "upvotes": 0,
          "replies": {
            "hodaoz5": {
              "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hodaoz5/",
              "text": "Because they only accept 5-10% of applicants and 90% of those applicants are as competitive as you if not a little more or less",
              "author": "Hash1237",
              "created": 1639396271,
              "upvotes": 2,
              "replies": {}
            },
            "hodewrb": {
              "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hodewrb/",
              "text": "Because that’s the definition of a reach: a school you have less than even odds of being admitted to. If you had a good chance of being admitted then it wouldn't be a reach.",
              "author": "jayphoward",
              "created": 1639399112,
              "upvotes": 1,
              "replies": {
                "hoe1mwk": {
                  "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hoe1mwk/",
                  "text": "target*",
                  "author": "KingHootII",
                  "created": 1639410210,
                  "upvotes": 1,
                  "replies": {
                    "hoe3wb3": {
                      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hoe3wb3/",
                      "text": "Missed the \"n't\" at the end of \"would\".  Will edit and correct.",
                      "author": "jayphoward",
                      "created": 1639411144,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hobqsex": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hobqsex/",
      "text": "Your anxiety is getting the best of you. Flaws you think you’re finding in your essays will not be what get you accepted or rejected.",
      "author": "ApplyingToCollege21",
      "created": 1639360537,
      "upvotes": 4,
      "replies": {}
    },
    "hobsnk6": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hobsnk6/",
      "text": "I'm in the same boat; as a first-gen student with a sister who is going to a really good school, i feel like I have to measure up. I try to remember that my EA isn't everything and I have a lot of other schools on my list, but it's tough because I've wanted to go to the same school since 8th grade. My friend gave me this piece of advice on how to not let rejection consume you after she got rejected from her dream school \"I let myself take one day to mourn and feel really upset, then I move on because theres so much more to the world.\" I think it's important to not get bogged down on one school right now because we are right in the middle of application season; there will be bigger and brighter things in your future. Hope this helped (if nothing else, you know you aren't alone; misery loves company right?) and best of luck with your decision!",
      "author": "fortuitous_rain515",
      "created": 1639361390,
      "upvotes": 3,
      "replies": {
        "hoc36a3": {
          "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hoc36a3/",
          "text": "sounds like we are in this together lol. thank u sm for the advice and I really hope u get in too <3",
          "author": "Specialist-Look2142",
          "created": 1639366197,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hobuh3x": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hobuh3x/",
      "text": "Thats exactly why I havent looked at my common app since my ED applications, I do not want to be aware of my mistakes",
      "author": "TacoManTheFirst_",
      "created": 1639362215,
      "upvotes": 3,
      "replies": {}
    },
    "hoc0sco": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hoc0sco/",
      "text": "remember that you are your harshest critc, you're also the only one who has had to read your essay like 50 times lol. College acceptances are no indicator of your personal worth or capability, you'll do great wherever you end up going!",
      "author": "greenresonance",
      "created": 1639365084,
      "upvotes": 3,
      "replies": {
        "hoc2w43": {
          "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hoc2w43/",
          "text": "thank u sm this actually really helped",
          "author": "Specialist-Look2142",
          "created": 1639366064,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoc9ije": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hoc9ije/",
      "text": "Looked at my ED essays awhile ago after submitting them and had mixed feelings. In retrospect though it was mostly nerves driving that reaction, and if I were to edit my essays much more they wouldn’t sound authentic. At a certain point it’s important to recognize that we are all human, we have strengths but we also have limits. Instead of focusing on the one or two things you feel like you didn’t do, focus on the dozens of things you successfully accomplished.\n\nWhat’s more, undergraduate schools don’t have much sway in dictating where you’ll go in your life. It’s ultimately all up to you, some schools can offer more connections and abroad opportunities but if you look you’ll find them regardless of where you are. Hell, if you end up somewhere less “selective” or “prestigious” and work to find opportunities you’ll likely be a stronger prospect for hiring out of undergrad. Stop putting so much pressure on yourself, you’ve done loads of successful work and limitless opportunities await wherever you go.",
      "author": "MemeSustenance",
      "created": 1639369234,
      "upvotes": 2,
      "replies": {}
    },
    "hocy14m": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hocy14m/",
      "text": "if you don’t get in, you’ll get into a school that’ll be better for you in the end. whatever happens will happen and it’s now up to the fates. your worth isn’t dependent on what college you get into and everything will work out in the end.",
      "author": "PeculiarMicrowave",
      "created": 1639385808,
      "upvotes": 2,
      "replies": {}
    },
    "hobp2g3": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hobp2g3/",
      "text": "Same for me with Wharton of all schools. I feel as if my essays were very lackluster and generic. I think my application was overall ok, but at a school like that every component counts 😞",
      "author": "Rickyyfits",
      "created": 1639359742,
      "upvotes": 1,
      "replies": {
        "hoc2ygm": {
          "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hoc2ygm/",
          "text": "wishing the best for u!",
          "author": "Specialist-Look2142",
          "created": 1639366095,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hobs67k": {
      "link": "/r/ApplyingToCollege/comments/rf3p15/scared_i_wont_get_into_ed_school/hobs67k/",
      "text": "also both of my best friends already got in with a full ride so when i don't get in its going to hurt even worse.",
      "author": "Specialist-Look2142",
      "created": 1639361167,
      "upvotes": 1,
      "replies": {}
    }
  }
}