{
  "sid": "r282ip",
  "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/",
  "title:": "How impressive is eagle scout for admissions?",
  "text": "I don’t know what to make of this because I’ve been told it’s a big accomplishment and one of the most respected ecs but at the same time others have told me that it really isn’t too big of a deal. Thoughts?",
  "author": "MinoKillz",
  "created": 1637878998,
  "updated": 1639825126,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 0.87,
  "comments": {
    "hm35gmh": {
      "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm35gmh/",
      "text": "I know one GS equivalent kid and they are at a T5. Obv an anecdote, but that & one other EC were their main ECs. AOs will know it’s a lot of work.",
      "author": "pixelatedpix",
      "created": 1637879554,
      "upvotes": 26,
      "replies": {}
    },
    "hm34n9k": {
      "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm34n9k/",
      "text": "That's a significant accomplishment of which you should be justifiably proud. Ignore the haters.",
      "author": "skieurope12",
      "created": 1637879158,
      "upvotes": 46,
      "replies": {}
    },
    "hm47mw0": {
      "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm47mw0/",
      "text": "Large accomplishment because it really does take a lot of work and time on your part to achieve!",
      "author": "Apprehensive_Ad_7249",
      "created": 1637899500,
      "upvotes": 10,
      "replies": {}
    },
    "hm3k2ah": {
      "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm3k2ah/",
      "text": "It’s a big accomplishment. Make sure it’s noted on your application.",
      "author": "jjhoster",
      "created": 1637886989,
      "upvotes": 29,
      "replies": {}
    },
    "hm36nyq": {
      "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm36nyq/",
      "text": "It is very impressive(PERIOD).",
      "author": "Live-Cryptographer89",
      "created": 1637880147,
      "upvotes": 14,
      "replies": {}
    },
    "hm6zqi7": {
      "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm6zqi7/",
      "text": "Don't listen to what some people say.\n\nTo get Eagle Scout, most people spend about 7 years and 100s of hours doing something that has many benefits from being part of a community to helping others to learning real world skills.\n\nHow could it not be an awesome activity?!",
      "author": "uhbububub",
      "created": 1637958911,
      "upvotes": 3,
      "replies": {}
    },
    "hm5zfkn": {
      "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm5zfkn/",
      "text": "it’s a huge accomplishment my guy. i’m trying to get eagle scout but i know how important it is for a college application. put that down on it and ignore people who say it isn’t much",
      "author": "kylepierce722",
      "created": 1637942429,
      "upvotes": 2,
      "replies": {}
    },
    "hm3x558": {
      "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm3x558/",
      "text": "I hear it is considered a big accomplishment by admissions officers, but I have to say as an employer, it is not something I view favorably. It is an organization that prides itself on teaching values, yet one of its \"values\" is to discriminate. I would view someone putting this on their resume as either a homophobe or someone without enough integrity to leave an organization that dehumanizes a class of people.",
      "author": "Snoo_20029",
      "created": 1637893886,
      "upvotes": -32,
      "replies": {
        "hm4sfba": {
          "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm4sfba/",
          "text": "As a person who has dedicated much of the last decade of his life to scouting and is an eagle scout, I can promise NONE of our values include discrimination, homophobia, or anything similar to that. The primary focus of scouting is to develop youth into better leaders and better people while also serving the needs of the community. In fact, having good morals is one of our most important principles, which is very contradictory to discrimination.",
          "author": "rverts",
          "created": 1637913069,
          "upvotes": 12,
          "replies": {}
        },
        "hm4jwy5": {
          "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm4jwy5/",
          "text": "Honestly those people who you rejected dodged a bullet",
          "author": "Flat_Relative5546",
          "created": 1637906977,
          "upvotes": 13,
          "replies": {}
        },
        "hm5zmv0": {
          "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm5zmv0/",
          "text": "yea let’s ignore how they also help the community in a lot of ways, let teenagers develop key leadership roles, and make a well-rounded person why don’t we?",
          "author": "kylepierce722",
          "created": 1637942521,
          "upvotes": 4,
          "replies": {}
        },
        "hm4d86y": {
          "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm4d86y/",
          "text": "Oh fuck off",
          "author": "Thunderbird23",
          "created": 1637902766,
          "upvotes": 13,
          "replies": {
            "hojg57w": {
              "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hojg57w/",
              "text": "Gg",
              "author": "Vast-Ad-6761",
              "created": 1639505737,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hm41ob6": {
          "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm41ob6/",
          "text": "This is ridiculous. By this same logic everyone in america is racist, homophobic etc due to some institutions being racist homophobic etc. your discriminating against people even though they as individuals did nothing wrong.",
          "author": "ejkensjskwnsnsks",
          "created": 1637896284,
          "upvotes": 2,
          "replies": {}
        },
        "hm6tjeg": {
          "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm6tjeg/",
          "text": "You’re an idiot then, mate",
          "author": "chumer_ranion",
          "created": 1637955973,
          "upvotes": 2,
          "replies": {
            "hm7421s": {
              "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm7421s/",
              "text": "Lol! You don’t have to like or agree with my comment. It is what I think, and I am not the only one in a hiring position who thinks this way. Would you be proud of being part of an organization that bans leaders who are not white? Why would you be proud of being a member of a group that bans people on the basis of their sexuality? As far as how much good Boy Scouts do for their community, one can do just as much good without being a member of a group that teaches hate. Before you dismiss my comment, just be aware that not everyone has a rosy colored view of the Boy Scouts.",
              "author": "Snoo_20029",
              "created": 1637960913,
              "upvotes": -2,
              "replies": {
                "hm788kk": {
                  "link": "/r/ApplyingToCollege/comments/r282ip/how_impressive_is_eagle_scout_for_admissions/hm788kk/",
                  "text": "You know it’s funny that you should say that you’re “not the only one in a hiring position who thinks this way”—because I have yet to meet a single person in real life who agrees with you.  And in all my time as an autonomous person, my being an Eagle Scout has only ever been an asset—that includes my admission to Reed College, one of the most liberal colleges in the country, where I was, you guessed it, surrounded by other Eagle Scouts. \n\nThere is no doubt that the Boy Scouts, now the Scouts, has had a long tradition of homophobia, which manifested itself in the banning of gay people from holding adult leadership positions.  But there has never been a ban on leaders who aren’t white, and the Scouts changed its policy on gay troop leaders in 2015.\n\nYou have a fundamental misunderstanding of what Scouts is if you think its only redeeming value is community service.  And I don’t see the point in trying to explain the role it has had in the social development of otherwise bullied or mistreated children to someone so obviously bigoted; nor do I see the purpose in explaining that individual Troops, including mine, have fought the BSA’s regressive policies at the district level for years.\n\nYou *are* an idiot, and being “in a hiring position”, or finding that other people share your idiotic views, is not evidence to the contrary.",
                  "author": "chumer_ranion",
                  "created": 1637962849,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}