{
  "sid": "qj8jt5",
  "link": "/r/ApplyingToCollege/comments/qj8jt5/international_student_needing_help_with/",
  "title:": "International student needing help with extracurriculars",
  "text": "Hello to everyone reading this post. I need help figuring out what counts as an extracurricular and what does not. I don't have any school extracurricular in one hand due to covid, on the other hand due to my high school not caring too much about that sort of stuff.\n\nI am from small Eastern European country called Serbia, I am currently in 4th year, graduating in June 2022. I did a Duolingo English Test and I got 135/160 which is around high C1 level. My dream goal is getting into Tufts, mostly because they give financial aid to internationals. My realistic goal is at least getting into CC. I am doing the SAT test in December. Also, are subject tests important for 4 year universities, since I barely have time for SAT since I didn't even plan on getting into 4year uni until recently. I am plan to work part-time and to go to college. I have a sibling living in Boston, so she would also help me with tuition etc since average salary in my country is around 400 euros.\n\nAnyways, here is all extracurriculars I do/did until recently:\n\n1. Improving my English skills.\n2.  Partial caretaker of my grandfather.\n3. Part-time hobby/job repairing and maintaining PCs mostly for my neighbors, friends, family, acquaintances.\n4. I did football (soccer) for 8 years, position goalkeeper. Stopped training football because because I don't have a lot of time for it anymore since I am commuting to high school since I live in a smaller town (\\~2.5 hours of driving to hs and back)\n5. Reading books in my free time (mostly fantasy novels, but recently I started reading books in English rather than in my native language)\n6. Learning how to cook\n7. Going to gym 3 times a week\n8. Organizing holiday events in my hometown with friends (Christmas eve, Easter, special football occasions etc.)\n9. Helping my parents in gardening (planting crops, harvesting). We have a medium sized garden so there are a bunch of different crops being cultivated, mostly because it is more healthy and cheaper.\n10. Also helping parents with little livestock we have (one goat, a few sheep and two pigs)\n11. I recorded and edited Youtube videos for my personal Youtube channel (Stopped posting because I am not gaming that much anymore, channel has 500 subscribers and around 70k views)\n12. Watching history documentaries, reading history articles as a hobby, mostly European history. (Went to history tournaments in middle school)\n13. Went to a advanced C programming course that was organized by my school.\n14. Helped my sibling with collecting money for students getting scholarships in Kosovo and Metohija.\n15. Working at a farm during summer (working full-time)\n16. Playing basketball or football with my friends on weekends\n17. Following football competitions, going to matches of my local club, started learning more about football formations, tactics, player roles etc.\n\nThat is all, I could probably sugar coat some of these extracurriculars if needed. All feedback is greatly appriciated. Ask me if you need any questions.",
  "author": "Kavinter",
  "created": 1635621726,
  "updated": 1635778746,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}