{
  "sid": "qwd4rg",
  "link": "/r/ApplyingToCollege/comments/qwd4rg/data_science_or_computer_science/",
  "title:": "Data Science or Computer Science?",
  "text": "Hey everyone,\n\nI am an international student studying in the US. My main goal is to get internships during university and get into the job market ASAP after graduating?\n\n***Which major should I choose between them?***",
  "author": "Actual-Mix1712",
  "created": 1637195388,
  "updated": 1637353252,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.84,
  "comments": {
    "hl2pyen": {
      "link": "/r/ApplyingToCollege/comments/qwd4rg/data_science_or_computer_science/hl2pyen/",
      "text": "If you like data science, do data science. Both fields have an *incredible* predicted job growth, and you will not struggle to find jobs in either field. Plus, data science as an undergraduate major is… just beginning. Many colleges don’t even have data science majors, and if that’s the case for your schools, computer science or statistics is the way to go. \n\nYou will probably need a masters or PhD for a DS career. 88% of data scientists have a masters, 38% have a PhD. So whether your undergrad degree is data science or computer science (or math, statistics, etc.) really doesn’t matter that much. \n\nhttps://www.cabrini.edu/graduate-degrees/programs/data-science/why-employers-are-looking-for-applicants-with-a-masters-in-data-science\n\nhttps://www.stitchdata.com/resources/the-state-of-data-science/",
      "author": "Voldemort57",
      "created": 1637205364,
      "upvotes": 7,
      "replies": {}
    },
    "hl26ko9": {
      "link": "/r/ApplyingToCollege/comments/qwd4rg/data_science_or_computer_science/hl26ko9/",
      "text": "Which do you prefer?",
      "author": "RichInPitt",
      "created": 1637196543,
      "upvotes": 5,
      "replies": {
        "hl29qwz": {
          "link": "/r/ApplyingToCollege/comments/qwd4rg/data_science_or_computer_science/hl29qwz/",
          "text": "Data Science but I am afraid it might be more difficult to get into job market compared to CS major",
          "author": "Actual-Mix1712",
          "created": 1637197999,
          "upvotes": 2,
          "replies": {
            "hl34w8y": {
              "link": "/r/ApplyingToCollege/comments/qwd4rg/data_science_or_computer_science/hl34w8y/",
              "text": "I have never seen a statistics major or an operations research/industrial engineering/management science major end up without multiple high-paying job offers before graduation. Never -- in over a decade in academia. I have seen CS majors who got low-paying offers though only a few times did a CS major graduate without a job.\n\nI think the reason for the difference is one of supply: there are far more CS majors than stats and OR/IE/MS majors.",
              "author": "minimuminfeasibility",
              "created": 1637213172,
              "upvotes": 4,
              "replies": {}
            },
            "hl2ke8a": {
              "link": "/r/ApplyingToCollege/comments/qwd4rg/data_science_or_computer_science/hl2ke8a/",
              "text": "[deleted]",
              "author": null,
              "created": 1637202784,
              "upvotes": -1,
              "replies": {}
            }
          }
        }
      }
    },
    "hl3pffp": {
      "link": "/r/ApplyingToCollege/comments/qwd4rg/data_science_or_computer_science/hl3pffp/",
      "text": "if you want to job market asap, then it's easier to get a job in cs industry than ds just because more proportion of ds jobs prefer applicants who have graduate school degrees at least as of now. you will have access to internships in both majors, cs has more oppurtunities but it also has way more applicants\n\nalso, i would heavily look at amount of math, cs, and stats taught by the major at the school for data science. if there is a good amount of each, and the program is strong, you can probably have access to not only data science jobs (that includes data analysis, data engineering, machine learning) but also in software engineering, research, operations, and financial engineering/quantitative finance, business analytics, etc. math and stats major are heavily versatile and allow unlocking into most major industries, and having good amount of cs classes as a side skill helps. also, remember, big tech companies dont restrict themselves to just cs majors, and if u do have the most basic upper level division classes (usually only algorithms, data structures and i think one more like operating systems), then you should be able to be ready for software engineering interviews. so, you should be able to get a job as a person in data science. you just need to make sure you cast a wide enough net and not automatically narrow down choices to things like machine learning at a big company, where it would be competitive for most people to get in. also, i've heard that many finance and tech companies will pay a lot of money if an individual is good at math and developing math/stats-based models for their work, and math also helps a lot with graduate school. data science majors are still mostly new, so i would look more carefully into the coursework and see if it is well balanced.\n\nlastly, i'd also say to look into similar majors as data science. some schools have majors like cs + math, computational math, applied math, statistics, math + statistics, systems engineering, etc, which can be of your interest too.",
      "author": "moreandmorefiesta",
      "created": 1637228457,
      "upvotes": 3,
      "replies": {}
    }
  }
}