{
  "sid": "q9k0d7",
  "link": "/r/ApplyingToCollege/comments/q9k0d7/unweighted_gpa_of_above_40_even_though_i_have/",
  "title:": "Unweighted GPA of Above 4.0, even though I have multiple B+'s",
  "text": "So I need to calculate my unweighted GPA. I consulted my school counselor regarding this, and she instructed me to use the grading scale provided on the side of my transcript (disregarding columns for AP and Dual Enrollment, obviously). Issue is, even unweighted, the scale counts an honors A+ as a 4.5, and I took all honors, and got a fair few A+'s. So, my calculated unwighted GPA comes out to 4.2, even though I have three B+'s on my transcript. Intuitively, this seems wrong, but I'm also unsure of whether I could even use another method of calculation. My school is a bit of an odd-ball with its grading, and there is no - (like A- or B-) in the grading system at all. \n\nNot sure where to go from here. I don't want to be inflating my GPA or lying if I put 4.0 down for scholarship applications and the like.",
  "author": "misstepsforward",
  "created": 1634416414,
  "updated": 1634571555,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgwhdnn": {
      "link": "/r/ApplyingToCollege/comments/q9k0d7/unweighted_gpa_of_above_40_even_though_i_have/hgwhdnn/",
      "text": "Enter on your app the GPA that is on your transcript. Colleges will receive the grading scale.",
      "author": "elkrange",
      "created": 1634416492,
      "upvotes": 2,
      "replies": {
        "hgwhpzf": {
          "link": "/r/ApplyingToCollege/comments/q9k0d7/unweighted_gpa_of_above_40_even_though_i_have/hgwhpzf/",
          "text": "I am already doing that, this is more regarding separate scholarship apps that specifically ask for unweighted GPA",
          "author": "misstepsforward",
          "created": 1634416643,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgws5dg": {
      "link": "/r/ApplyingToCollege/comments/q9k0d7/unweighted_gpa_of_above_40_even_though_i_have/hgws5dg/",
      "text": "Not really a response to your question, but rather another question\n\nYou say that an A+ in an honors class would be a 4.5, what about an A in an honors class? An A+ in a regular class? An A in a regular class?",
      "author": "freeport_aidan",
      "created": 1634421273,
      "upvotes": 1,
      "replies": {
        "hgx6lt3": {
          "link": "/r/ApplyingToCollege/comments/q9k0d7/unweighted_gpa_of_above_40_even_though_i_have/hgx6lt3/",
          "text": "A in an honors class is 4.0. my school only offers honors (it's a special app type high school), so idk about non-honors. collegeboard has a GPA conversion ( [https://pages.collegeboard.org/how-to-convert-gpa-4.0-scale](https://pages.collegeboard.org/how-to-convert-gpa-4.0-scale) ) that I decided to use instead, regardless of what my counselor told me.",
          "author": "misstepsforward",
          "created": 1634427944,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgwsxwh": {
      "link": "/r/ApplyingToCollege/comments/q9k0d7/unweighted_gpa_of_above_40_even_though_i_have/hgwsxwh/",
      "text": "it doesn’t matter too much on the common app because colleges will see your transcript anyway. also every school calculates differently so they don’t weight the number itself too hard",
      "author": "abrookee",
      "created": 1634421636,
      "upvotes": 1,
      "replies": {}
    },
    "hgx6vp7": {
      "link": "/r/ApplyingToCollege/comments/q9k0d7/unweighted_gpa_of_above_40_even_though_i_have/hgx6vp7/",
      "text": "well this is for anyone struggling with gpa calculations: i'm using this scale from collegeboard bc idk this bloodsucking \"nonprofit\" organization has convinced me it's a reliable source \n\n[https://pages.collegeboard.org/how-to-convert-gpa-4.0-scale](https://pages.collegeboard.org/how-to-convert-gpa-4.0-scale)",
      "author": "misstepsforward",
      "created": 1634428072,
      "upvotes": 1,
      "replies": {}
    }
  }
}