{
  "sid": "q4p586",
  "link": "/r/ApplyingToCollege/comments/q4p586/help_with_my_schedule/",
  "title:": "help with my schedule!!!",
  "text": "okay so i'm currently a junior and my school requires two years of arts in order to graduate. i took these two arts my freshman and sophomore years. \ni planned to take 4 years of arts but i couldn't fit it into my schedule because i wanted to take AP CSA as my elective. \n\nsenior year, i plan to take 4 classes (AP STATS, AP GOV/ECON, AP PHYSICS I, AP LIT) and take some CS classes at my local community college and work.\n\n i'm kinda worried that my schedule might come off as lazy to college admissions officers and shows no interest beyond major-related subjects since i only took the required amount of arts and i also plan on only doing the recommended 3 years of language (french).\n\n should i pick up my arts classes again and/or take AP French to show me going above and beyond in subjects outside of my major interest? or do college admissions not care?",
  "author": "cayennedisaster",
  "created": 1633798371,
  "updated": 1634074084,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hg0admr": {
      "link": "/r/ApplyingToCollege/comments/q4p586/help_with_my_schedule/hg0admr/",
      "text": "Before I say anything, I'm a senior so not anyone with an official college perspective, just a random internet stranger. I'd also like to say that I only took 3 years of French, and am currently taking 4 AP's and a \"college in the high school\" English course, so I'm basically in your planned scenario.\n\nThat being said, I don't think colleges are going to get mad at you for doing what's required and not any further if those classes aren't what you're passionate about. You're showing a lot of interest in computer science through your schedule, so if that's what you're interested in then go for it! Colleges shouldn't expect you to take all the levels of all the classes ever, and if they do that's probably a kinda toxic environment to put yourself in. Besides, you are showing variety even though you have a clear interest; doing the bare minimum would be only taking advanced comp sci classes and maybe science and math, and everything else at the most regular level. If 4 AP classes, some college courses, and work looks lazy to anyone, they're not someone that's trying to help you learn or grow as a person, they're just a jerk.\n\nDo what you wanna do at the level you wanna do it. If you want a college admissions officer's perspective on it, the \"Inside the Yale Admissions Office\" podcast has some great episodes about stressors in the application process like this. In their \"Senior Year Questions\" episode, they even talked about scheduling problems blocking you from taking all the classes you want. It's helped me destress about the college process a lot.\n\nTLDR; do what you wanna do, you'll end up where you're supposed to be. :)",
      "author": "Secretlyanartkid",
      "created": 1633803018,
      "upvotes": 2,
      "replies": {
        "hg21api": {
          "link": "/r/ApplyingToCollege/comments/q4p586/help_with_my_schedule/hg21api/",
          "text": "thank you!!!! your perspective and logic is super insightful i think you're probably right even if you don't have any admissions experience",
          "author": "cayennedisaster",
          "created": 1633832495,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg1npqm": {
      "link": "/r/ApplyingToCollege/comments/q4p586/help_with_my_schedule/hg1npqm/",
      "text": "Don’t take any classes for the purpose of trying to impress college admissions committees. Do what you like and what will best prepare you for the major you want to pursue. To that point, can you share what math you’re taking as a junior? If you’re in precalc now, I think it would be better to take Calc as a senior (instead of stats) if you plan to be a CS major.",
      "author": "jjhoster",
      "created": 1633825703,
      "upvotes": 2,
      "replies": {
        "hg20sax": {
          "link": "/r/ApplyingToCollege/comments/q4p586/help_with_my_schedule/hg20sax/",
          "text": "im in calc rn!! thank you this is super insightful especially from the pov of an admissions officer",
          "author": "cayennedisaster",
          "created": 1633832231,
          "upvotes": 2,
          "replies": {
            "hg21jcb": {
              "link": "/r/ApplyingToCollege/comments/q4p586/help_with_my_schedule/hg21jcb/",
              "text": "Sounds good and you’re welcome",
              "author": "jjhoster",
              "created": 1633832615,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}