{
  "sid": "rhszey",
  "link": "/r/ApplyingToCollege/comments/rhszey/im_exhausted/",
  "title:": "i'm exhausted",
  "text": "cornell was my dream school. My sister studied there and I fell in love with it as I saw her grow there. naturally, I applied ED there and was pretty confident too, until I got a rejection letter when I opened my decision. that rejection letter hit me hard. am I useless? I had legacy at Cornell, but I still got a straight up rejection letter, which means I didnt even convince them a little bit that I was worth cornell. It's been 3 days and I haven't been able to get on with other RD applications. i have no will to do this anymore.",
  "author": "pogchamp3749",
  "created": 1639668260,
  "updated": 1639785967,
  "over_18": false,
  "upvotes": 50,
  "upvote_ratio": 0.94,
  "comments": {
    "hoshqix": {
      "link": "/r/ApplyingToCollege/comments/rhszey/im_exhausted/hoshqix/",
      "text": "If it was just your sister that went there then that doesn't \"count\" as legacy status.\n\nGetting into a school of that caliber as an international is insanely hard.  Don't beat yourself up about it.",
      "author": "jayphoward",
      "created": 1639669163,
      "upvotes": 39,
      "replies": {}
    },
    "hosgqs5": {
      "link": "/r/ApplyingToCollege/comments/rhszey/im_exhausted/hosgqs5/",
      "text": "Don't worry, you'll succeed during the regular round 100%. Also, Cornell doesn't count sibling legacy as legacy - more parental as legacy (normally for the whole ivy league). Besides, just consider the rejection as Cornell fucking up big time, and trust me, other great schools will be lucky to have you. I got rejected from my early as well and it took days to process but trust me, you'll have a great school accept you during regular and you'll be happy there. Besides what's to like about Cornell? It's a COVID hotspot with uncaring administrators and in the middle of nowhere. Good luck for the regular round!",
      "author": "collegenewbie123",
      "created": 1639668760,
      "upvotes": 13,
      "replies": {
        "hosxry9": {
          "link": "/r/ApplyingToCollege/comments/rhszey/im_exhausted/hosxry9/",
          "text": "COVID cases rising like shitt....",
          "author": "its_Ashu_04",
          "created": 1639675420,
          "upvotes": 2,
          "replies": {}
        },
        "hoy6ft2": {
          "link": "/r/ApplyingToCollege/comments/rhszey/im_exhausted/hoy6ft2/",
          "text": "thank you so much for this :)",
          "author": "pogchamp3749",
          "created": 1639765455,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}