{
  "sid": "qcewyx",
  "link": "/r/ApplyingToCollege/comments/qcewyx/transferring_from_boston_u_to_nyu_advice/",
  "title:": "Transferring from Boston U to NYU, advice.",
  "text": "Hey everyone! Got a fairly simple question, with a slight back story. \n\nI am currently a freshman at Boston U, in their CGS program. I love Boston, and I am sure I’ll love the school, but NYU has been my dream school forever and I am considering transferring after the first year. I was rejected from NYU ED last year, but a few things have changed since then. \n\nDuring my gap semester, I worked full time at a private equity firm, run by a very well known business/political figure. I developed some great relationships and connections, and have received some incredible cover letters, recommendations, and resume boosts from this opportunity. I have a very well fleshed out resume, with a few internships as well as a number of solid EC from high school. I have a solid portfolio of freelance work (in photography and video), and am currently launching my marketing startup with my best friend. \n\nWith all of these things in mind, and me transferring from a comparable college, do I have any chance at say… stern? Or will my previous rejection hold me back?",
  "author": "Longjumping_Use8194",
  "created": 1634775471,
  "updated": 1634848765,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhfztw9": {
      "link": "/r/ApplyingToCollege/comments/qcewyx/transferring_from_boston_u_to_nyu_advice/hhfztw9/",
      "text": "To be totally candid: attempting a transfer just because you didn’t get into your dream school is a very questionable decision.  \n\nIn life, we rarely get everything we want—and learning to accept rejection is a valuable skill.  Notice that in spite of your earlier rejection, you’ve been able to thrive anyway.  Why change what’s already working well? \n\nThe answer to your question is yes, you would be a strong transfer applicant.  But uprooting your life just to go someplace that you can go to get your MBA (and make more money subsequently) is silly.",
      "author": "chumer_ranion",
      "created": 1634783151,
      "upvotes": 5,
      "replies": {
        "hhg8rhy": {
          "link": "/r/ApplyingToCollege/comments/qcewyx/transferring_from_boston_u_to_nyu_advice/hhg8rhy/",
          "text": "> To be totally candid: attempting a transfer just because you didn’t get into your dream school is a very questionable decision.\n\nI'd agree normally. However, there is a significant difference between coming out of BU vs. NYU Stern. BU is a non-target for finance. The fact that he's a freshman who has experience in PE is awesome but this is one of those scenarios where Stern could genuinely help him get further along his career whereas if he comes out of BU, he'll be battling non-target stigma and have a harder hole to climb out of. \n\nWhether that's worth transferring is a personal decision but I think transferring could be a good decision. \n\n@OP You would definitely be a competitive transfer applicant at Stern and I would say if the finances work out, you might as well apply. Doesn't hurt to have the option.",
          "author": "doneanddead",
          "created": 1634787654,
          "upvotes": 1,
          "replies": {
            "hhg96rw": {
              "link": "/r/ApplyingToCollege/comments/qcewyx/transferring_from_boston_u_to_nyu_advice/hhg96rw/",
              "text": "I’m not equating Boston U and NYU’s undergraduate business programs.  I’m saying that OP would be better off with an MBA in either case, so they may as well just go to Stern for grad school. \n\nTransferring to NYU may also be a bad proposition in terms of affordability (not to take the standard pot shot at your school); I assure you my position, as a transfer student, was carefully considered lol.",
              "author": "chumer_ranion",
              "created": 1634787888,
              "upvotes": 1,
              "replies": {
                "hhgcmu5": {
                  "link": "/r/ApplyingToCollege/comments/qcewyx/transferring_from_boston_u_to_nyu_advice/hhgcmu5/",
                  "text": "> I’m saying that OP would be better off with an MBA in either case, so they may as well just go to Stern for grad school.\n\nMost undergrad business students don't pursue an MBA. If you talk to the ones that do, they'll tell you that a lot of material is repeated and that what distinguishes a BBA from an MBA tends to be the type of students in each program rather than the raw material. \n\nOutside of that, an MBA has a 2 year opportunity cost not including the cost of tuition which is generally insane. Let's say you want to move into IB. If you go your standard route, you'll do your 3 years as an analyst and then 3 years as an associate. Now let's say you did an MBA. Firstly, almost no M7 or T15 MBA is going to accept you without any work experience so you'd need work experience (average is 4-5 years). But let's assume you do one of the early deferral ones and take a 2 year break. Then you do 2 years for an MBA. And then you break in as an associate in IB. It took you 4 years to do that which would put you behind the kid who just went into IB directly, and that's not even including the issue that you spent 2 years not working while they made ~$150k-200 a year during that time AND you had to pay tuition. \n\nThe primary reasons one goes for an MBA are because a) they're looking to switch careers, b) they need it for their specific career (such as PE). You can see at elite schools like HBS that [business undergrads](https://www.hbs.edu/mba/admissions/class-profile/Pages/default.aspx) do not form a large percentage of students. Engineering is the most common, and business sits at 21%. At places like [Sloan](https://mitsloan.mit.edu/mba/admissions/class-2023-profile) or [Stanford](https://www.gsb.stanford.edu/programs/mba/admission/class-profile), it's even less business focused. While it's certainly an option (I plan to opt for an MBA for example), it's certainly not the most common route and most people who go into prestige business functions either have an undergrad business degree or have an MBA. It's certainly not as common as one might think to have both. No super hard stats but see [here](https://www.efinancialcareers.com/news/2015/11/heres-who-makes-md-at-goldman-sachs) for example. The average MD at GS doesn't have an MBA. \n\n> Transferring to NYU may also be a bad proposition in terms of affordability (not to take the standard pot shot at your school);\n\nI definitely agree with this one though I do think people mention it way too much as a way to ignore engaging with the actual conversation at hand. However, I'm also gonna be real here. The likelihood that someone has a decent PE internship as a gap semester intern suggests that they're probably not doing poorly. It's possible they cold called their way into it but the vast majority of people who do stuff like that do it through existing familial connections (no shade at all, anyone IK who had family connections used them lol.)\n\nAlso, another reason why I'd be cautious about BU is bc BU is famous for their whole grade deflation issues and as a non-target, that means you need a really high GPA in order to have a good chance for IB.",
                  "author": "doneanddead",
                  "created": 1634789905,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhgeo8s": {
              "link": "/r/ApplyingToCollege/comments/qcewyx/transferring_from_boston_u_to_nyu_advice/hhgeo8s/",
              "text": "Yeah, the only way I’ll go to NYU is IF I get into stern, besides that there is no point. I now have a good amount of connections in banking, which is usually the root taken to get into PE, and that will require a move to NYC anyways. However, I have also gotten opportunities to continue my internship at an asset management firm in Boston (who we work with at my current firm), and that seems like a valuable opportunity if I decide to pursue it. However I would defiantly take my education over another internship, because if I do both, one will suffer. I am blessed to have no financial restraint from my parents, and am full pay at either school.",
              "author": "Longjumping_Use8194",
              "created": 1634791156,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhfjo20": {
      "link": "/r/ApplyingToCollege/comments/qcewyx/transferring_from_boston_u_to_nyu_advice/hhfjo20/",
      "text": "If it matters, my current act is a 30 or a 31 superscore, and my HS gpa was around a 3.7 weighted with a hard course load. I am hoping to do better GPA wise at BU, as the courses I am taking actually interest me.",
      "author": "Longjumping_Use8194",
      "created": 1634775701,
      "upvotes": 0,
      "replies": {}
    }
  }
}