{
  "sid": "qa3rzo",
  "link": "/r/ApplyingToCollege/comments/qa3rzo/why_major_essay_for_rice/",
  "title:": "why major essay for rice",
  "text": "for the why major essay for rice, i mainly talk about the classes there and the programs and what i would achieve with them. is this wrong? i don’t really mention why exactly i fell in love with this major. \n\nthey also have a why rice essay. i used this one to mention things outside of academics.",
  "author": "throwawayx666999",
  "created": 1634493078,
  "updated": 1634653784,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh0i6hk": {
      "link": "/r/ApplyingToCollege/comments/qa3rzo/why_major_essay_for_rice/hh0i6hk/",
      "text": "It sounds like you're trying to answer \"Why Rice?\" instead of \"Why major?\"\n\n\"Why major?\", IMO, really means \"Why career?\"",
      "author": "jayphoward",
      "created": 1634495323,
      "upvotes": 3,
      "replies": {
        "hh0k5j1": {
          "link": "/r/ApplyingToCollege/comments/qa3rzo/why_major_essay_for_rice/hh0k5j1/",
          "text": "ahh i see. so would it be better to talk about an activity i have already done and how it motivated me to pick this major?",
          "author": "throwawayx666999",
          "created": 1634496122,
          "upvotes": 1,
          "replies": {
            "hh0nkow": {
              "link": "/r/ApplyingToCollege/comments/qa3rzo/why_major_essay_for_rice/hh0nkow/",
              "text": "If it were me, I'd approach it from the perspective of, \"Because of X, Y and Z I want to be a {career}, and {major} is the course of study I feel will best prepare me to achieve that goal.\"",
              "author": "jayphoward",
              "created": 1634497543,
              "upvotes": 1,
              "replies": {
                "hh0q4a1": {
                  "link": "/r/ApplyingToCollege/comments/qa3rzo/why_major_essay_for_rice/hh0q4a1/",
                  "text": "so use that as an opening line and then start listing courses and opportunities at the school?",
                  "author": "throwawayx666999",
                  "created": 1634498596,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh0s2tv": {
      "link": "/r/ApplyingToCollege/comments/qa3rzo/why_major_essay_for_rice/hh0s2tv/",
      "text": "It probably depends on your application. The why major essay is only 150 words, so I tried to cram in as many ideas into as few words as possible. While at first I wanted to delve into how exactly I \"fell in love\" with a major, I didn't have room. Instead, I mainly used it as a \"why major at Rice\" prompt where I talked about the different opportunities Rice had for my fields of interest. In my common app essay, I dove in a little bit on some of my interests, so I felt that it would be repetitive to discuss again, so this shows how the essay content can be dependent on the content of the other essays you've written.\n\nWhile it's good to talk about what opportunities are at Rice as it shows your research, be sure to also include why Rice should choose you. A sentence or two talking about what connects you to that major would do (I think the part about what you would achieve with the classes and programs may suffice). There are many ways to approach this prompt and while this is one of them, there are other ways that focus more specifically on how you decided to choose that specific major. Do whatever works for you.",
      "author": "wontonsayshi",
      "created": 1634499402,
      "upvotes": 1,
      "replies": {
        "hh0slyk": {
          "link": "/r/ApplyingToCollege/comments/qa3rzo/why_major_essay_for_rice/hh0slyk/",
          "text": "thank you! this is great feedback! is there any way i could pm you with some more specific questions about my essay?",
          "author": "throwawayx666999",
          "created": 1634499626,
          "upvotes": 1,
          "replies": {
            "hh0ucs8": {
              "link": "/r/ApplyingToCollege/comments/qa3rzo/why_major_essay_for_rice/hh0ucs8/",
              "text": "Sure, you can pm me",
              "author": "wontonsayshi",
              "created": 1634500345,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}