{
  "sid": "qthfj1",
  "link": "/r/ApplyingToCollege/comments/qthfj1/css_profile_late_nov_15/",
  "title:": "css profile late nov 15",
  "text": "my deadline for css is nov 15th and i JUSTTT  submitted today bc i didnt even know if my guardian was my actual legal guardian here in the united states so we had to go and clear up paperwork all these months and now i uploaded some documents but i also had to request instead of 1099 a bank statement thing and it said it takes 3-5 business days so am i screwed???1!2!2 im sorry im rambling im just so NERVOUS GOD i dont want it to screw up my ED",
  "author": "radicalpisces",
  "created": 1636862095,
  "updated": 1637180752,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkjr7pq": {
      "link": "/r/ApplyingToCollege/comments/qthfj1/css_profile_late_nov_15/hkjr7pq/",
      "text": "Hi! Answering here so others can see it too - your deadline is your deadline. It’s fine that CSS doesn’t process for 3-5 days. Colleges understand this completely. CSS and IDOC are absolutely inundated with files right now, understandably, but as long as *you* submitted your info by the deadline, you are fine. Good luck!",
      "author": "Thirdtimesacharm4me",
      "created": 1636864785,
      "upvotes": 2,
      "replies": {
        "hkjrduz": {
          "link": "/r/ApplyingToCollege/comments/qthfj1/css_profile_late_nov_15/hkjrduz/",
          "text": "okay thank you! and if theyd have troubles with the documents after the deadline they would still help right? does that impact my ed chances at all?",
          "author": "radicalpisces",
          "created": 1636864871,
          "upvotes": 2,
          "replies": {
            "hkk4m9h": {
              "link": "/r/ApplyingToCollege/comments/qthfj1/css_profile_late_nov_15/hkk4m9h/",
              "text": "If they need more documents from you, it will show up in your CSS portal and you will likely also receive an email. This happens a lot.\n\nThis will absolutely not affect your ED admissions decision/chances as long as you are applying to a need-blind school. The admissions office will not be coordinating with the financial aid office if your school is need-blind.",
              "author": "Thirdtimesacharm4me",
              "created": 1636872302,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}