{
  "sid": "r318w1",
  "link": "/r/ApplyingToCollege/comments/r318w1/would_it_be_possible_to_go_to_college_outside_of/",
  "title:": "Would it be possible to go to college outside of the USA to avoid paying the insane debt?",
  "text": "If I go to college in the USA I know I will never be able to pay 100% of my debt, so if I were to a college in a different country I theoretically only have to pay \"regular\" college prices, not the insane amount in the USA. Does anyone know if this is possible, and what are the logistics of this, and what countries would be a good choice. This sounds a little incoherent so if you need me to elaborate just ask!",
  "author": "watchingboi",
  "created": 1637974370,
  "updated": 1638205638,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hm81tcl": {
      "link": "/r/ApplyingToCollege/comments/r318w1/would_it_be_possible_to_go_to_college_outside_of/hm81tcl/",
      "text": "Go to CC and then transfer to a good in-state uni. CC is cheap as hell and you’ll get in-state afterwards. Very cheap and efficient way to go to college.",
      "author": "maora34",
      "created": 1637977340,
      "upvotes": 8,
      "replies": {}
    },
    "hm7ycu1": {
      "link": "/r/ApplyingToCollege/comments/r318w1/would_it_be_possible_to_go_to_college_outside_of/hm7ycu1/",
      "text": "If you apply to, and are accepted to, a college outside of the US, then yes, you would pay the amount that this college charges, not the amount of a US college.",
      "author": "RichInPitt",
      "created": 1637975589,
      "upvotes": 6,
      "replies": {}
    },
    "hm820ye": {
      "link": "/r/ApplyingToCollege/comments/r318w1/would_it_be_possible_to_go_to_college_outside_of/hm820ye/",
      "text": "You would want to be fluent in the language classes are taught in.\n\nAlso consider whether the university would be remotely familiar to employers in whatever field you are considering.\n\nSome general thoughts on paying for college (at US schools):\n\nFirst see whether you are eligible for any *need-based financial aid*. Run the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. (Sometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions.)\n\nFederal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. Larger loans require a parent signature and are usually not reasonable amounts to borrow.\n\nIf the need-based estimate does not make the college affordable for your family, then look for *merit scholarships*. ***Often, the best merit scholarships are offered by the colleges themselves.*** Look for colleges that offer competitive merit scholarships according to their websites, where your scores and grades are over the 75th percentile for that college.\n\nAlso look for colleges that offer big automatic merit scholarships to out-of-state students for your level of stats. Usually there will be a chart on their website with the levels of stats and scholarship amounts. Example: [https://scholarships.ua.edu/freshman/out-of-state/](https://scholarships.ua.edu/freshman/out-of-state/); see also UAH, U Maine, U Kentucky, U Mississippi, U Arizona, Arizona State, Wyoming, UTD, etc. Then compare the scholarship amount to the out-of-state cost of attendance to see whether the scholarship would make the college affordable for your family.",
      "author": "elkrange",
      "created": 1637977446,
      "upvotes": 3,
      "replies": {}
    },
    "hm865z7": {
      "link": "/r/ApplyingToCollege/comments/r318w1/would_it_be_possible_to_go_to_college_outside_of/hm865z7/",
      "text": "it depends on what country. i’ve read that going to school in germany is really inexpensive in comparison to the usa however that might not be the case everywhere. just do your research and compare the prices to the schools in your state",
      "author": "glossyducky",
      "created": 1637979538,
      "upvotes": 3,
      "replies": {}
    },
    "hmbrh1o": {
      "link": "/r/ApplyingToCollege/comments/r318w1/would_it_be_possible_to_go_to_college_outside_of/hmbrh1o/",
      "text": "You'll have to consider (assuming you're an American citizen): \n1) The different education system and how your high school courses meet their requirements \n2) Most non-US schools don't have as much of an emphasis on EC's and care much more about grades, so the grade cutoff can be quite high and considerably stricter, and stellar EC's won't help you very much\n3) Unless you speak another language well enough to take college classes in it, your options in non-English speaking countries are severely limited. Most of the free or nearly-free college countries in Europe that you keep hearing about are not English-speaking. \n4) You may be at a disadvantage in employment after graduation if American employers aren't familiar with your school or would prefer to hire someone from an American college which they know better \n5) While college is much cheaper than the US or even free in many countries, some places may charge a much higher tuition for internationals. Once you consider that American colleges will probably offer much more financial aid, you might not actually be saving all that much for your trouble (there's also higher travel costs and stuff like that)\n6) Unless you want to study in Canada (which isn't really worth it anyway if your goal is saving money, international tuition can be nearly as high as your in-state state school), you will need to apply for a visa which can be complex and take away considerably from your post-decisions part of senior year on top of all the other stuff you need to do. This is probably at the bottom of your list of considerations but still something to keep in mind\n\nThere are a number of ways to substantially bring down the cost of attending a US college as an American. The other replies already talk about this so I won't go too far into it. If you really want to study in another country that's fine, but if you're mainly doing it to save money then it's not quite as cut and dry as it seems.",
      "author": "EconomicSeahorse",
      "created": 1638051481,
      "upvotes": 1,
      "replies": {}
    }
  }
}