{
  "sid": "r5o7ot",
  "link": "/r/ApplyingToCollege/comments/r5o7ot/do_colleges_care_about_this/",
  "title:": "Do colleges care about this?",
  "text": "I am an international student living in the Middle East, however unlike in America or other areas of the world, options for volunteering, competition, and any other extracurricular activity are extremely restricted. That is, there were a few already, but due to the pandemic that began here in March 2020, it is now nearly non-existent. Do colleges care about the country from where each applicant comes and are they aware of the vast inequalities in access to such things?",
  "author": "Ihateapbio",
  "created": 1638281783,
  "updated": 1638479261,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hmnykvq": {
      "link": "/r/ApplyingToCollege/comments/r5o7ot/do_colleges_care_about_this/hmnykvq/",
      "text": "Yes, they are aware of such things, but if others from your region were able to create such opportunities by themselves, then they would have an upper hand over your application.",
      "author": "prsehgal",
      "created": 1638282434,
      "upvotes": 6,
      "replies": {}
    },
    "hmoc5x3": {
      "link": "/r/ApplyingToCollege/comments/r5o7ot/do_colleges_care_about_this/hmoc5x3/",
      "text": "admissions counselors are assigned to a specific geographical location so this way they know what is available and what isn’t to people from different areas. They admissions officer might not know the exact town youre from but even just knowing the country plays a huge roll so they will not penalize you for not doing something if u never had the opportunity to do it",
      "author": "mercymainaf",
      "created": 1638288294,
      "upvotes": 2,
      "replies": {}
    },
    "hmnxsoo": {
      "link": "/r/ApplyingToCollege/comments/r5o7ot/do_colleges_care_about_this/hmnxsoo/",
      "text": "I am in a similar situation as you though probably not as extreme",
      "author": "AAAAAAAAAAAEdmfow",
      "created": 1638282061,
      "upvotes": 1,
      "replies": {}
    }
  }
}