{
  "sid": "r4lihk",
  "link": "/r/ApplyingToCollege/comments/r4lihk/csu_is_giving_me_a_higher_gpa_than_i_have/",
  "title:": "CSU is giving me a higher GPA than I have",
  "text": "All my classes are right so I don't know what the deal is. I don't have and APs but I do have like 3 honours and one college class. Is that what's affecting it? Also, should I be scared?",
  "author": "hueyyjrr",
  "created": 1638154218,
  "updated": 1638204474,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hmhnrar": {
      "link": "/r/ApplyingToCollege/comments/r4lihk/csu_is_giving_me_a_higher_gpa_than_i_have/hmhnrar/",
      "text": "Have you looked at their calculator?  Lots of reasons it could be different than the one on your transcript - both having honors and the college class, and not including your first year classes are probably different than what your high school does. \n\n[https://www.calstate.edu/apply/gpa-calculator](https://www.calstate.edu/apply/gpa-calculator)",
      "author": "BrawnyAcolyte",
      "created": 1638158037,
      "upvotes": 4,
      "replies": {
        "hmhrn92": {
          "link": "/r/ApplyingToCollege/comments/r4lihk/csu_is_giving_me_a_higher_gpa_than_i_have/hmhrn92/",
          "text": "It's just such a drastic change. My GPA is a 2.6 but went to a 3.4. I didn't think I did that great in my sophomore and junior year.",
          "author": "hueyyjrr",
          "created": 1638159929,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmhnyyy": {
      "link": "/r/ApplyingToCollege/comments/r4lihk/csu_is_giving_me_a_higher_gpa_than_i_have/hmhnyyy/",
      "text": "I think CSU has their own way of calculating GPA from your school so that may be it. But I have to ask: did you manually change course type when you chose your classes? For example, if you had honors world history, you chose it in the course title drop-down, and then manually changed the course type from none to honors? As far as I know (from my counselor) you do not touch that section. If it is what CSU considers an honors it will automatically change the course type. If CSU does not accept your honors class as an honors, you leave it alone as none. Just to be sure please check with your counselor if your GPA change is normal.",
      "author": "Chemical-Flatworm487",
      "created": 1638158137,
      "upvotes": 2,
      "replies": {
        "hmhsnna": {
          "link": "/r/ApplyingToCollege/comments/r4lihk/csu_is_giving_me_a_higher_gpa_than_i_have/hmhsnna/",
          "text": "Nah, I did everything right I'm pretty sure",
          "author": "hueyyjrr",
          "created": 1638160444,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}