{
  "sid": "qsco4j",
  "link": "/r/ApplyingToCollege/comments/qsco4j/how_will_my_degree_be_viewed_from_the_usa/",
  "title:": "How Will My Degree Be Viewed From The USA?",
  "text": "Please bear with me with this stupid question:\n\nAnyways, I am choosing a college next year. But being in the US, I don’t want to be in debt my entire life. I come from European parents and am the first to be born in the US. They always tell me how American degrees from any US uni, especially top 50 ranked schools, would be viewed more respectably (prestigious) than most European universities if I were to move to Europe. Is this true?\n\nWould I actually get a higher look of prestige in Europe by going to Fordham, Boston College, or any other top 50 American colleges, as opposed to lets say, Kings College London or a Dutch University?\n\nAlso, are degrees in Europe recognizable in any European country? So, if I move to Sweden for example after graduating from UCL, would my degree not be recognized?",
  "author": "Nova-Sila",
  "created": 1636728281,
  "updated": 1636745322,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkca5d7": {
      "link": "/r/ApplyingToCollege/comments/qsco4j/how_will_my_degree_be_viewed_from_the_usa/hkca5d7/",
      "text": "Agree w/jayp that you need to ask in another forum.\n\nIt does make sense to consider how the degree would be viewed in the country you are hoping to settle in. (Notice the large # of international students in this subreddit, new ones every single day, who want to study in the US, many hoping to remain here.)\n\nWhen you are comparing costs of European universities, note that they might not include living expenses (room and board) whereas US universities typically include an estimate for that in the cost of attendance. Make sure you are comparing apples to apples.\n\n>But being in the US, I don’t want to be in debt my entire life.\n\nAre you referring to the cost of college? There are a variety of ways to pay for college that do not involve substantial debt.  Federal student loan limits of 5500 for freshman year, totaling 27k over four years, are often reasonable amounts to borrow. Larger loans require a parent signature and are usually not reasonable amounts to borrow. \n\nA copy and paste, some general thoughts on paying for college:\r  \nPublic universities tend to offer little to no need-based financial aid to out-of-state students and charge them more.\r  \nSome public universities offer large merit scholarships to out-of-state students.\r  \nSome private universities offer generous need-based financial aid; privates do not differentiate between in-state and out-of-state.\r  \nFirst see whether you are eligible for any need-based financial aid. Run the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. (Sometimes NPCs are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions.)\r  \nIf the *need-based* estimate does not make the college affordable for your family, then look for *merit scholarships*. ***Often, the best merit scholarships are offered by the colleges themselves.*** Look for colleges that offer competitive merit scholarships according to their websites, where your scores and grades are over the 75th percentile for that college.\r  \nAlso look for colleges that offer big automatic merit scholarships to out-of-state students for your level of stats. Usually there will be a chart on their website with the levels of stats and scholarship amounts. Example: https://scholarships.ua.edu/freshman/out-of-state/; see also UAH, U Maine, U Kentucky, U Mississippi, U Arizona, Arizona State, Wyoming, UTD, etc. Then compare the scholarship amount to the out-of-state cost of attendance to see whether the scholarship would make the college affordable for your family.",
      "author": "elkrange",
      "created": 1636730333,
      "upvotes": 3,
      "replies": {}
    },
    "hkc6rp7": {
      "link": "/r/ApplyingToCollege/comments/qsco4j/how_will_my_degree_be_viewed_from_the_usa/hkc6rp7/",
      "text": "You likely want to be asking these questions to people located in Europe.  My sense of the A2C community is that most posters are either American or are internationals located outside Europe.",
      "author": "jayphoward",
      "created": 1636728862,
      "upvotes": 1,
      "replies": {}
    }
  }
}