{
  "sid": "qgep28",
  "link": "/r/ApplyingToCollege/comments/qgep28/question_about_reapplying_to_uc_schools_as_a/",
  "title:": "Question about reapplying to UC schools as a transfer",
  "text": "***Just some background information*** I applied last year to a few of the UC schools as a transfer (from a California CC) and got rejected from damn near all of them. I found this a bit strange as I have a 3.9 GPA and my major, Art History, isn't the most competitive major to transfer into. When I asked my counsellor about it she quickly found that I was 2 credits off from the minimum transfer credit amount to be considered...fuck\n\nAnyway, my ***main question*** is do I have to rewrite my essays for my UC application this year or can I use the same essays from last year? I worked really hard on those essays from last year and since it wasn't the quality of the essays I wrote that got me denied I don't see why this should be a problem. No matter what, I will obviously make some changes to them but is it bad to resubmit the general core or is that some sort of self-plagiarism that will automatically show up once I hit submit on the application.",
  "author": "InfernityKing",
  "created": 1635278075,
  "updated": 1635301686,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi69s2f": {
      "link": "/r/ApplyingToCollege/comments/qgep28/question_about_reapplying_to_uc_schools_as_a/hi69s2f/",
      "text": "It’s my understanding that only UCLA and Berkeley and maybe SD really read the essays for admissions. The others go by stats unless there’s a weird tie with another applicant and use them only for scholarships. And there are thousands of applicants so I doubts they really check. Even if they did you would be using your own essays, right? Maybe not super creative but nothing wrong if they are good.\n\nHowever, just to know, somewhere on the UC transfer application it says that admissions officers can check your previous transfer applications, that they are linked in the system (but apparently freshman applications are not linked). I got the impression it was warning you not to suddenly make dramatic changes, like I worked 45 hours a week both years instead of 15 hours a week one year, or to say something super inconsistent. \n\nI would rewrite 1-2 essays to reflect what you have done this year and maybe tweak the others.",
      "author": "RetiringTigerMom",
      "created": 1635287317,
      "upvotes": 1,
      "replies": {}
    }
  }
}