{
  "sid": "qypxm7",
  "link": "/r/ApplyingToCollege/comments/qypxm7/political_science_vs_public_policy_major/",
  "title:": "Political Science vs Public Policy Major",
  "text": "What is the difference between the political science and public policy majors? Both are offered at several schools, so it's not a matter of a naming scheme by institutions. Additionally, which would be better for somebody who wants to be a politician/lawmaker?",
  "author": "JayTechTVPonyGod",
  "created": 1637480220,
  "updated": 1637687991,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlhl9ol": {
      "link": "/r/ApplyingToCollege/comments/qypxm7/political_science_vs_public_policy_major/hlhl9ol/",
      "text": "May be slightly different at each college, but public policy usually has a greater focus on creating and applying policy whereas political science focuses more on political theory and the study of politics. Public policy at my college requires a basic stats class and an econ for public policy class, so there’s more quantitative skills involved than the political science major, although it’s still not much. \n\nFor being a lawmaker, probably public policy. Or going to law school. For being a politician, there’s a big difference between becoming senator vs local politician, and it can depend on the state/city you’re running in. A lot of local politicians don’t have a degree related to politics at all. Some haven’t gone to a four year college at all. And running in Nebraska vs New York will be different. But honestly if you want to pursue politics at a high level you very well may have to go to grad school, and your grad school degree will matter much more than your undergrad.",
      "author": "rainingsiberiancats",
      "created": 1637483325,
      "upvotes": 5,
      "replies": {}
    },
    "hlirdlw": {
      "link": "/r/ApplyingToCollege/comments/qypxm7/political_science_vs_public_policy_major/hlirdlw/",
      "text": "just look up the differences in course requirements for both programs, that will give you a much better idea of how they differ at specific schools\n\nAnd the difference will not matter for law school or getting into politics",
      "author": "freeport_aidan",
      "created": 1637509917,
      "upvotes": 2,
      "replies": {}
    }
  }
}