{
  "sid": "qj7pas",
  "link": "/r/ApplyingToCollege/comments/qj7pas/submitted_low_sat_but_high_act/",
  "title:": "submitted low SAT but high ACT",
  "text": "Hello, I'm freaking out a little, please help me out if you have any info:\n\nI took the SAT in 11th grade and got a 1430 (700 R, 730 M) --it's a **very good** score but not a great score. I took the ACT in 12th grade and got a 35 (35 M, 33 S, 35 E, 36 R) --it's a **great** score.\n\nThe problem is that I sent SAT score reports to all the T20 schools I was interested in. I didn't know at the time that I should have waited to submit scores until I knew what they were. Now these colleges are going to have both my submitted 1430 SAT and self-reported 35 ACT in my application files.\n\nPlease let me know what you think: does my SAT score hurt me for T20s or will admissions only look at my high ACT score? I know that there's not much I can do about it now -- or maybe there is? Could I contact admissions officers and ask for the SAT to be ignored?\n\nAlso, I only self-reported my ACT score and I didn’t mention my SAT score on the common app at all. Is it possible that colleges won’t consider scores not in the common app? (I hope so)\n\nThank you so much! (I'm about to submit my early decision application to my T10 dream school and I'm hoping my low SAT won't doom my application!)",
  "author": "International-Ant803",
  "created": 1635619239,
  "updated": 1635778761,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hipi66y": {
      "link": "/r/ApplyingToCollege/comments/qj7pas/submitted_low_sat_but_high_act/hipi66y/",
      "text": "I would email the schools you're applying to, asking them to remove the SAT score from their records. Also check if any of them require you to send in official scores for your ACT.",
      "author": "prsehgal",
      "created": 1635639827,
      "upvotes": 2,
      "replies": {}
    },
    "hioglfv": {
      "link": "/r/ApplyingToCollege/comments/qj7pas/submitted_low_sat_but_high_act/hioglfv/",
      "text": "Most schools consider your highest score. So I think you'll be okay...",
      "author": "none_oya",
      "created": 1635622218,
      "upvotes": 1,
      "replies": {}
    },
    "hipkigy": {
      "link": "/r/ApplyingToCollege/comments/qj7pas/submitted_low_sat_but_high_act/hipkigy/",
      "text": "Schools will use your ACT and ignore your SAT.\n\nUnless they require official reports for Admissions.",
      "author": "RichInPitt",
      "created": 1635640988,
      "upvotes": 1,
      "replies": {
        "hipktah": {
          "link": "/r/ApplyingToCollege/comments/qj7pas/submitted_low_sat_but_high_act/hipktah/",
          "text": "Dear Rich in Pitt, thank you for your response and thank you also for all the helpful PSAT and National Merit Semifinalist info I got from your posts over the last year!",
          "author": "International-Ant803",
          "created": 1635641141,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}