{
  "sid": "qkubad",
  "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/",
  "title:": "I've read through a couple posts saying don't write \"sob story\" essays; how far does this go? Is it just something I should avoid entirely or is there a use?",
  "text": "I've seen a lot of like don't write about that stuff in your essays, but I feel like it is an important piece of my life. I've had a few medical issues that over the past year have impacted my academics, and even just my life as a whole. I've struggled with frequent headaches since I was about 8 (honestly doesn't have too much of an effect - as bad as it is - as I've learned to cope with it), and I've experienced some degree of trauma from an ex. This has lead to daily stomachaches/panic attacks for the past year and for a time it really killed my energy to do anything. I managed to get fine grades, but I didn't really do anything with my time and was constantly in my own head and just generally unhappy, mostly playing games or hanging out with friends to escape.\n\nI don't want anyone to feel sorry for me, and I've come to terms with it. I don't want it to seem like I'm trying to get pity or anything, because I don't need it. Because of that, should I not bother with any of it in my essays, or is there a way I can encorporate it meaningfully?\n\nThanks in advance for any replies :)",
  "author": "Accomplished-Pay-749",
  "created": 1635820267,
  "updated": 1635889862,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiys169": {
      "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiys169/",
      "text": "Sob stories are fine if they are legitimate/don’t take up your whole essay. You should write about how you overcame adversity and how it shaped you as a person. Ultimately, the goal is for AOs to understand you as a person, not just what you achieved/experienced/suffered through.",
      "author": "RandomWilly",
      "created": 1635820649,
      "upvotes": 6,
      "replies": {
        "hiysqpp": {
          "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiysqpp/",
          "text": "Yeah that makes sense. Connect it to other aspects of my life and what the effect of it was, rather than the event itself?",
          "author": "Accomplished-Pay-749",
          "created": 1635820992,
          "upvotes": 2,
          "replies": {
            "hiyt1xj": {
              "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiyt1xj/",
              "text": "Exactly, show how it made you a stronger person in some way and show them you deserve to get in :)",
              "author": "RandomWilly",
              "created": 1635821146,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiyt6yt": {
      "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiyt6yt/",
      "text": "[deleted]",
      "author": null,
      "created": 1635821213,
      "upvotes": 1,
      "replies": {
        "hiyu9h9": {
          "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiyu9h9/",
          "text": "Yeah I think I get that now. Thanks for the help :)",
          "author": "Accomplished-Pay-749",
          "created": 1635821734,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiyzi08": {
      "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiyzi08/",
      "text": "For the personal essay, you should be zeroing in on a very very specific event. Could be something that only last 5-30 min and writing about that in great detail and then showing how it impacted you.",
      "author": "CodyGamz",
      "created": 1635824422,
      "upvotes": 1,
      "replies": {
        "hiz0sfn": {
          "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiz0sfn/",
          "text": "Honestly I find that difficult. There aren’t too many moments that have defined who I am, as it’s mostly holistic experiences. \n\nActually, maybe I’m thinking about it wrong. Is it more like picking a moment from that time span that best captures the essence of the situation?",
          "author": "Accomplished-Pay-749",
          "created": 1635825149,
          "upvotes": 1,
          "replies": {
            "hiz11k1": {
              "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiz11k1/",
              "text": "It can be. Just make sure it's a specific moment",
              "author": "CodyGamz",
              "created": 1635825297,
              "upvotes": 1,
              "replies": {
                "hiz5510": {
                  "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hiz5510/",
                  "text": "Why’s it so important to have a specific moment as opposed to a period of time?",
                  "author": "Accomplished-Pay-749",
                  "created": 1635827819,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hj07n91": {
      "link": "/r/ApplyingToCollege/comments/qkubad/ive_read_through_a_couple_posts_saying_dont_write/hj07n91/",
      "text": "I’m writing about my chronic illness. It’s really hard to write about. \n\nThere is a line between sob story and inspirational. Try to pick some event and describe how you used it to overcome your thing.\n\nIf you haven’t overcome it or managed to deal with it in some way, you shouldn’t write about it. Because you’ll come off as a liability instead.",
      "author": "Outherepoor",
      "created": 1635857640,
      "upvotes": 1,
      "replies": {}
    }
  }
}