{
  "sid": "qe9sv7",
  "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/",
  "title:": "I recently transferred from a T10 LAC to a large research university. Here are some things I wish I knew before choosing a LAC. (I highly recommend reading this if you are a POC and non-athlete)",
  "text": "The Liberal Arts Colleges (LACs) are being seen now as hidden gems -- relatively less known schools that have a great education rivaling large T20 schools. However, I think it's important to stress some of the downsides of going to these small schools in rural America that I feel don't get nearly the attention it deserves: underhanded racism, isolated feeling, poor social scene, heavy athlete culture, limited course offerings, etc. I also recognize that every LAC is different, but I've talked to many friends (both POC and otherwise) across almost all the LACs and will try to distill the general commonalities/themes here. \n\nSince this is going to be a mostly negative post, I'd like to highlight that my experience wasn't all bad and there are some huge positives to these schools, such as: \n\n1. Professors truly are fantastic, sweet, approachable, and always open to making friends with students. It is not uncommon to get meals with your professors regularly and even befriend them. \n2. Small class sizes (in tandem with the quality of professors) make for very intimate and formative learning experiences. \n3. Beautiful campuses and great food \n4. Great transfer/grad school prospects\n5. You will always see people you know (both a pro and a con, more on this later). \n6. Relatively non-competitive classroom and extracurricular environments, meaning you will not have to apply and compete for most clubs, and everyone is very open to being collaborative with work. \n\nI just want to stress that some people come here and really love it, and it's really for them. However, there are also many downsides that I believe are important to consider before going: \n\n1.The nature of going to a small school in a rural setting \n\nMost of these schools are tiny and in the middle of nowhere. Often the town pretty much revolves around the college (I.E Williams and Williamstown). What this means is that there is not really a life outside of college life. It is easy to feel like you are stuck in this bubble of college life rather than in a real living and breathing environment like in a city or suburb setting where there are multiple colleges and things to do outside of typical college life. Because of this, when college life isn't going well for you (especially socially) it can feel very isolating. Nothing in town will be open past 10 pm or so, and most of these schools only have a handful of bars that students conglomerate to, where you will see the same faces every single week. \n\n2. The prep school/high school parallels \n\nAs a result of a small town and small class sizes, these schools in many ways feel like an extension of high school/prep school (it also doesn't help that many students do hail from preparatory/boarding schools). People create very tight cliques. Since you see the same people every day, your \"reputation\" ends up MATTERING and you will be forced to act a certain way if you want to be invited to places and included in parties. Privacy is hard to come by, everyone talks about everyone because after a while everyone at the school will know at least one person that you know. All the parties are private since there are limited bars/clubs, this means that you have to know people to get into parties, so you are sort of forced to involve yourself with the cliquey/group high school culture if you do want to attend parties regularly on the weekends. \n\nA major downside to this is that you simply cannot get away from problematic people. For example, I have a friend who was raped by a guy on a summer program and ended up being put in the same building as him. Or there are people around campus who are known to have raped or harassed others, and if you are one of these victims you will see them around every day -- you may even have a large number of close mutual friends with them. I've seen people defend sexual predators because they simply had too many mutual friends to cut them off. Yes these are extreme cases, but the point is that you will meet racist, predatory, bigotted, or simply unpleasant people and you can never really get away from them because, when there are like 2 hang out spots and 5 house parties that the whole school frequents, you will inevitably see them around. \n\n3. Homogeneity, lack of diversity, and racism \n\nThis is probably the biggest issue I have with LACs and a big reason why I cannot recommend them in good heart to any POCs (people of color). Put bluntly, these schools are incredibly white. There is one bar open in town for us, and when you go you can count the POCs on your fingers in a room of over 100 people. It is like this at parties too. Yes, these schools have made a huge effort to increase diversity numbers and provide support, however, it is a circular issue -- because these schools are not known for diversity they don't attract people who are diverse. Especially in majors that aren't known to attract a lot of POCs, be prepared to be the only POC in a class or 15 or 20, and get asked weird questions from your peers like \"what do you think about X given that you are Black, Chinese, Indian, etc?\" There are even professors (often with tenure) who are known to be openly racist. During a cultural club orientation, we were given a list of professors (mostly humanities ones) who were have been just known to give POC students a hard time, or just unacceptable racial comments (more on this later). \n\nThere isn't too much blatant racism (although there are several cases and I've had many happen to me). The bigger issue is the underhanded and subconscious racism that happens at these schools. Not only are these schools very white, but most people come from the same 5 or so states, and often have very similar (usually suburban) upbringings that breed similar world views. In other words, it's a lack of cultural diversity, perspective, and world views that can create small differences which exaggerate over time. A lot of POCs I have talked to have shared some feelings of not being welcome in social settings where they are the only POC, being given less respect/attention when approaching groups or people. I've been in friend groups where I was the only POC and I never had any blatant problematic racist remarks thrown at me, but the issue has more to do with small differences in behavior and world views that really add up over time. For example, cultural differences in table etiquette or general manners that don't get talked about for a year of being friends, but become an issue when you share a house, or share a living situation. \n\nThe POCs who do thrive here socially are either 1. athletes 2. very confident in their \"whiteness,\" usually people who have come from similar settings and are used to being the only POC in a white space, or 3. simply stick to other POCs almost exclusively. I myself am part-caucasian and still had a similarly difficult time integrating into white athlete friend groups, of which I was a part of several. I would also like to just add that i came into the school very skeptical of the racial divides (growing up in a relatively open and welcoming community) -- I sort of came with the attitude that you can and should be able to make friends with anyone, regardless of cultural, perspective, socioeconomic differences. I still believe that is possible at these schools but it does take a ton of trial and error, and putting up with a lot of both overhanded and underhanded rascism/cultural intolerance, until you finally find the \"right\" people. \n\n4. Course selection \n\nWhile the academics are amazing, the small nature of these schools also means that course offerings are heavily limited. Some departments are so small they simply don't have enough professors to teach all the intro classes or cover all the topics. In my freshmen year, I completed every class in the specific field that I planned to write my thesis on within my major. There was another major I was considering, but their intro course was full before I even got to register and the next intro course was not offered for another year. Meaning sometimes you can just get unlucky and then be a year late on your major. In other words, if you want to do something specific within a field, I.E a specific time period in history, there is a possibility the school will not offer a single class in that. \n\nMoreover, back to the point about racist professors, you have many majors that require a specific class taught, and that class may only happen to be taught by one professor. If that professor also happens to be openly rascist, then you're simply screwed as a POC. I actually dropped out of a double major for this exact reason -- there was a singular course requirement taught by a known-to-be rascist professor that I simply did not want to subject myself to, so I turned the double into a minor. Again, these cases are unlucky and rare, but they do happen if you are unlucky. \n\n5. Athlete culture \n\nBecause these schools are small, as high as 40% of some LACs may be made up of athletes. Most of my closest friends are athletes and I don't believe in attributing any negative stigma to them. However, there is certainly a sense of elitism you get from certain sports teams that make it difficult to be friends. Some LACs I know have terms for non-athletes. In purely pragmatic terms: they have different schedules, are often busier, and there is a sense of camaraderie that comes with being a part of a team that you will simply never be a part of. \n\nAdditionally, athletes come in after recruiting trips and have a sports team that basically doubles as a friend group. This means that some of them (not all) have no interest in making friends outside their sport and become very cliquey. You could be friends with an entire sports team and still never be invited to anything because you're simply not \"one of them.\" At larger schools, this isn't an issue. When half your student population is athletes, it means that there will be a large portion of the student population socially unavailable to you simply because you don't do their sport. Again, not every athlete acts like this but given that they are such a high portion of the school, you simply have a higher chance of running into these type of people. \n\n&#x200B;\n\nConclusion/TLDR: Every LAC is different and I don't mean to generalize and paint them all in a bad light. However, talking to a lot of friends and POCs, both at my school and other LACs, I have just found a shared experience of feeling some kind of cultural disconnect, ostracism, and underhanded racism/feeling of not belonging. Yes, you can feel this anywhere and moving to a bigger school is not an instant fix. However, its very easy to feel isolated due to the small school and rural setting. What bigger schools offer is an escape from people and BS when you need to, and a life outside of your immediate social periphery, and (in cities) an environment that feels lived-in where you can feel like there is a life beyond college -- this is especially important for POCs that are used to diverse environments and struggling to fit in. \n\nIn other words, the small, intimate and tight-knit communities at LACs exacerbate any problems you encounter socially, racially, culturally, etc. Every single POC/international student I’ve talked to has at one point transferred, considered transferring, felt isolated, felt out of touch, felt ostracised, or encountered some social issue related to rascism/cultural differences. I even had a white friend transfer because she didn’t want to be a part of the narrow and homogenous culture that these schools sometimes breed.\n\nIf you are one of these categories, you will have a higher chance of really finding your place at an LAC:\n\n1. Athlete \n2. White/Non-POC\n3. At college for and only for the education/academics\n4. Used to small rural settings and/or just really love being in nature and the outdoors \n\nHowever, if you are a POC, especially if you are not an athlete, I highly suggest you reconsider whether you want to spend 4 years in a predominantly homogenous bubble, where it is easy to feel isolated and out of touch if you don't fit the typical profile that these schools attract.",
  "author": "Suntzie",
  "created": 1635011585,
  "updated": 1635182738,
  "over_18": false,
  "upvotes": 248,
  "upvote_ratio": 0.96,
  "comments": {
    "hhrxohn": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhrxohn/",
      "text": "Thank you.  I truly appreciated your honest assessment of LACs, or even any smaller, more suburban school.  You brought up some excellent points that many kids and adults would never have considered.  To your point about athletes, I do agree that it's a real thing.  My kid is being recruited to my own alma mater for a sport, and after speaking with another athlete, casually used a term that I hadn't heard of before.  I asked what that was, and the reply was 'oh, that's what they call the non-athletes there'.  I thought that was interesting, as I'd spent 4+ years there, had athlete-friends, and had never heard that term.   Why have a specific term for non-athletes, when they're the vast majority of the school?  There's already a term for...well...athletes.",
      "author": "the3twins",
      "created": 1635018446,
      "upvotes": 57,
      "replies": {}
    },
    "hhs3uci": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhs3uci/",
      "text": "Thank you for this, I'm a non-athlete POC planning on applying to some LACs and this is an important perspective I hadn't heard before",
      "author": "charbroiledburgrking",
      "created": 1635021170,
      "upvotes": 38,
      "replies": {}
    },
    "hhsfnfe": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsfnfe/",
      "text": "I would add \"affluent\" to your list.  LACS often have great FA, but I've sent kids there that really struggled as the \"poor kid\" in a community where people flew to Europe for Spring Break. Even if everyone is trying really hard to be nice, it can be really lonely to be surrounded by people who never knew anyone who shopped at Walmart.",
      "author": "FoolishConsistency17",
      "created": 1635026601,
      "upvotes": 23,
      "replies": {
        "hhtt0bg": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhtt0bg/",
          "text": "This is also a major issue at need-aware universities. I received a very generous aid package at a need-aware school, and the prevalence of wealth was *intense*. Most of the kids who self-identified as 'poor' I eventually came to find out were actually upper-middle class, and just used to being the poorest person in extremely privileged spaces.\n\nI spent two and a half years there, and only met one other person who had an upbringing similar to mine (we're still good friends). Overall, it was often isolating and I regularly dealt with very ignorant opinions about poverty and frequent racist microaggressions. And there were a few people who were hostile and nasty to me (and only me) upon first meeting. I can't say for *certain* it was racism, but I'd be hardpressed to come up with a more convincing explanation.\n\nI still made friends and had lots of incredible experiences that I could never have afforded otherwise. It was basically a crash course in socializing with the upper classes and leveraging the benefits of affluent spaces. But I do wish I'd understood what I was getting into beforehand.",
          "author": "elastricity",
          "created": 1635051282,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hhsch5d": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsch5d/",
      "text": "I realize that while my words and a sorry will never be able to illuminate how difficult it must have been to go through what you went through, I still wanted to say that I'm so sorry to hear about what you and many of your friends went through because it is so, so, so hard, and what you went through and what you felt is so valid.  I also want to thank you for writing this post because this info is incredibly valuable.\n\nAs a non-athlete POC (although I was an athlete prior to college) who also attended a LAC before transferring to a research university, I wanted to comment to first off say that there definitely are issues like these at many LACs without a doubt, and it's really horrible.\n\nI also would like to agree that course selection is one of the biggest downsides of attending a LAC.  It definitely is a huge problem and also why I transferred out of my LAC.  To anyone who is interested in studying something that is niche (especially in the arts, a world language, or a sect of STEM such as data science) there's a very high possibility a LAC will not have your department or the classes needed to get on track for these fields.\n\nHowever, I did want to comment just to provide another perspective as someone who was not any of the 4 categories outlined in this post before going to my former LAC and that in spite of this, I actually found my former LAC to be the first truly accepting place for me.  For sure, there is no doubt that there were issues with the school.  Attending the school for a year, I noticed that the admin was extremely problematic and without a doubt, I believe it is one of the school's biggest cons.\n\nAnd it's also true that I did run into issues while I was there from time to time.  However, I think what made me ultimately felt like I belonged was that when I joined a lot of clubs and started to recognize people who were in my classes or lived in the dorms with me, I started to get familiar faces and because the school was so small, it meant that it was very easy to set up plans with them and get to know them better.  For most of my life, I felt really out of place everywhere I went and coming from a life with trauma, I was hoping that college would be my ticket potentially out of it, and for me, at least, I found out it to be really helpful to have people I could recognize despite being in a new environment.\n\nI really hope this comment does not detract from what you wrote in your post, OP, because you said a lot of very true points, and I also am so sorry you went through what you did during your time at a LAC.  I just wanted to leave this here as a potential other perspective in case.\n\nI hope you're really loving your time at your new school and that things are looking up for you.  My very best wishes to you, and it's always so awesome to meet other transfer students.\n\nHave a nice day!",
      "author": "eccentricgalaxy",
      "created": 1635025149,
      "upvotes": 41,
      "replies": {}
    },
    "hhsffvq": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsffvq/",
      "text": "As a parent of a kid that fits criteria 3 only (there for academics only) this post confirms her suspicions that an LAC is likely not a good fit. Hated small private school due to cliques and bullying and inability to escape problematic kids. I didn’t realize same issues in LACs! Thanks so much.",
      "author": "Marie-Curie-",
      "created": 1635026504,
      "upvotes": 12,
      "replies": {}
    },
    "hhswdcp": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhswdcp/",
      "text": "Thank you!!! I read this crying in my dorm room at an LAC BECAUSE of these issues. LACs look pretty in pictures and theory. The reality can be a very different experience. I don’t have anything to add to your post but i can stress again, choose your schools wisely! And I guess i can also add myself to the list of international students that are considering (read: are pretty set on) transferring.",
      "author": "iced_coffeelatte",
      "created": 1635034468,
      "upvotes": 11,
      "replies": {
        "hhsy0p2": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsy0p2/",
          "text": "I vibe. I’m not transferring, because I’m a junior who just wants to finish college, but damn, it’s draining",
          "author": "IncompetentYoungster",
          "created": 1635035231,
          "upvotes": 6,
          "replies": {
            "hht0pbc": {
              "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hht0pbc/",
              "text": "How did you keep going for so long? I’m so drained after just 2 months. Literally any advice would be appreciated bc i cant fucking wait for thanksgiving when i can leave this place for a few days (the isolation is wearing me down lmao)",
              "author": "iced_coffeelatte",
              "created": 1635036465,
              "upvotes": 5,
              "replies": {
                "hht2lto": {
                  "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hht2lto/",
                  "text": "The fact I was in therapy and receiving support from every possible administrative avenue, since I was failing classes,was helpful, but part of it was just that like... a lot of crying. Also the emotional support animal that I hid from staff for four months until I managed to get him registered",
                  "author": "IncompetentYoungster",
                  "created": 1635037383,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hht624y": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hht624y/",
      "text": "We toured a few well-rated LACs in the northeast.  My opinion:\n\nThe schools we toured had lovely campuses and the staff appeared to be passionate about the quality of their education.  However, it was quite obvious that these schools catered to wealthy white students who were cis- and hetero-.  Like, the entire school (in multiple cases) was a stereotype.\n\nA couple examples:\n\nAt one school, after the introductory speech, the families were given the option of 5 student tour guides.  Around half of the families chose the white, male your guide who looked like your typical Greek Bro.  Maybe 5 percent of the families (including us) chose the Asian female tour guide.  \n\nAt another LAC your, I saw more young teen men wearing sweater vests than I've ever seen in one place.  This was our last tour in a week of college tour so we're tired and wearing tshirts and shorts.  But maybe 80% of the other families were dressed up like they were attending Easter Mass (like, seriously, suit jackets and sweater vests for a group college tour).  \n\nA good tip:. If you're on a college tour and look around and don't think you would fit in with the college students you see walking around or with any of the potential applicants touring, then it probably won't be a good social fit for you.",
      "author": "teresajs",
      "created": 1635039065,
      "upvotes": 11,
      "replies": {
        "hhva1wy": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhva1wy/",
          "text": "If you know what you’re looking at, you can learn a lot about school from paying attention to how students dress.",
          "author": "IntheSarlaccsbelly",
          "created": 1635088003,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhs1893": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhs1893/",
      "text": "I'm a parent of a POC (biracial, black and white) senior who is interested in some LACs. Two of the schools on her list are Pomona College and Harvey Mudd college. They aren't in rural areas, neither school is overwhelmingly white, they are part of the Claremont Consortium so you can take classes at the other colleges, and, as far as I know, there isn't a huge athlete culture on campus. \n\nDo you feel like these same rules apply to places like Pomona or Harvey Mudd? My wife and I both attended large public colleges so we don't have personal experience with LACs but my senior believes they might be a good fit but has non LACs on her list too.",
      "author": "Mannings4head",
      "created": 1635020015,
      "upvotes": 24,
      "replies": {
        "hhsuc42": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsuc42/",
          "text": "I know you’re asking the OP, but since my wife is a non-athlete POC and an alumn of another of the Consortium schools, I may be qualified to offer some perspective. \n\nIn her words:  no. A few things. \n\n1) There are only two different varsity sports programs shared between the 5 schools. The athlete percentage is therefore lower than many LACs. \n\n2) bigger feel with the 5Cs. It still felt a bit like a fish bowl, but not as much as standalone LACs. It’s something between a normal LAC and the typical 7,000 or so undergrad private university experience. \n\n3) the 5Cs are much more diverse than your average very selective  LAC. \n\n4) it’s just outside of LA so it isn’t as isolating. The area is not just a college town.",
          "author": "ChampionshipPerfect5",
          "created": 1635033506,
          "upvotes": 16,
          "replies": {}
        },
        "hhtn816": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhtn816/",
          "text": "I don’t go to the consortium schools and was mostly talking about the Northeastern cluster of LACs, so I’m not going to pretend to have an answer. One of my POC friends is there now and he says it’s lot better diversity and culturally than the situation I described.",
          "author": "Suntzie",
          "created": 1635047798,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "hhsf0nd": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsf0nd/",
      "text": "Also worth pointing out that a lot of LACs have a lot of entrenched ableism, and are VERY set in their ways, no matter how they may appear. \n\nI go to Colby. I honestly would not suggest Colby to people who aren’t ok being tokenized, or being lonely because there aren’t a lot of POC, disabled, or queer students. I love my professors and by God do they take care of me and have my back (barring a few who have bought into the institutionalized ableism in their department), but administration neglects their marginalized students and basically just expects us to be ok with having our needs met halfway, and giving us the Pugh center and saying “look you have a safe space, now shut up”",
      "author": "IncompetentYoungster",
      "created": 1635026308,
      "upvotes": 25,
      "replies": {
        "hhsghh6": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsghh6/",
          "text": "I realize a sorry will never ever illuminate what you and your classmates are going through because what's going on at Colby should never ever be happening in the first place, and it is so, so awful.  However, I still wanted to say that I'm so sorry to hear about what's going on over there.  That's so horrible, and I really hope things get better and that there's systematic change in the future in those regards.\n\nHave a nice day!",
          "author": "eccentricgalaxy",
          "created": 1635026992,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hhs7ot9": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhs7ot9/",
      "text": "Thank you for sharing! Would you be willing to say which LAC? I’m a non athlete POC who is applying to some LACs and I’m curious if the one you went to is on my list",
      "author": "International_You275",
      "created": 1635022935,
      "upvotes": 9,
      "replies": {
        "hhsgmbj": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsgmbj/",
          "text": "Yeah PM me",
          "author": "Suntzie",
          "created": 1635027055,
          "upvotes": 2,
          "replies": {
            "hhsphvw": {
              "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsphvw/",
              "text": "Could you pm me as well? I'm applying to some LACs on the east coast",
              "author": "Boardstill",
              "created": 1635031201,
              "upvotes": 2,
              "replies": {}
            },
            "hhswwn1": {
              "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhswwn1/",
              "text": "If you could PM me too? I’m not applying, I just want to commiserate with other students from LACs",
              "author": "IncompetentYoungster",
              "created": 1635034718,
              "upvotes": 2,
              "replies": {}
            },
            "hhtuvps": {
              "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhtuvps/",
              "text": "Could u pm me too? I was thinking of applying to lacs- ty!",
              "author": "Anotherperson6812",
              "created": 1635052525,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhrwb1c": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhrwb1c/",
      "text": "Thank you for this.",
      "author": "hoodfellathrowaway",
      "created": 1635017821,
      "upvotes": 3,
      "replies": {}
    },
    "hhs3y56": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhs3y56/",
      "text": "this is very dependent on the type of LAC you’re going to tbh. i’m going to Hampshire currently and i don’t think any of these critiques really, besides the high school parallels, which you’re bound to get at any small school. there’s a very sizable POC student population here and concentrated efforts by the administration to bring more in/make them more comfortable. athletics pretty much aren’t a thing at all. course selection is fantastic, especially considering how small we are. not doubting most of this is true for lots, maybe even most LACs but there’s places you can go that maintain the upsides you mentioned while minimizing the downsides.",
      "author": "wormperson",
      "created": 1635021219,
      "upvotes": 11,
      "replies": {
        "hhsekpw": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhsekpw/",
          "text": "I'm really glad you're enjoying your time at Hampshire!  That's awesome.\n\nHave a nice day!",
          "author": "eccentricgalaxy",
          "created": 1635026106,
          "upvotes": 2,
          "replies": {}
        },
        "hhva9e7": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhva9e7/",
          "text": "You already know this, but very little at Hampshire fits the mold of other LACs. :)",
          "author": "IntheSarlaccsbelly",
          "created": 1635088098,
          "upvotes": 1,
          "replies": {
            "hhwzgcu": {
              "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhwzgcu/",
              "text": "true, but my point is that there are options out there for a student that wants to go to a LAC while minimizing what the OP is talking about. Hampshire is one. i imagine Evergreen and Reed are much the same.",
              "author": "wormperson",
              "created": 1635113405,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhspub4": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhspub4/",
      "text": "Is it the same at HWCs? I know those are LACs but obv would have a slightly diff vibe considering they're well \\~all female/nb\\~ bc most of the LACs I'm applying to are HWCs but I'm also curious as to what school you transferred from (you don't have to say for privacy reasons haha)",
      "author": "zealkana",
      "created": 1635031362,
      "upvotes": 3,
      "replies": {
        "hht25ie": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hht25ie/",
          "text": "Can only speak to Wellesley (and I can't even speak to Wellesley because I'm still a senior), but I checked up on them pretty closely, and it looks to me like some of the things OP talks about wouldn't apply there. It's only 36% white, and (another commenter mentioned LGBTQ inclusion) it's kind of known for having a lot of queer students, although I can't find stats. Wellesley, MA isn't huge, but there a couple other colleges there and it's a suburb of Boston. Don't know about the rest, though.",
          "author": "Pistachio625",
          "created": 1635037164,
          "upvotes": 5,
          "replies": {
            "hhtdcrc": {
              "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhtdcrc/",
              "text": "Barnard is in Manhattan, so that’s another more diverse city area. I think it’d probably vary from school to school, though",
              "author": "exhausted-caprid",
              "created": 1635042627,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hht6o4j": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hht6o4j/",
      "text": "Definitely good considerations, even if you're not a POC but want to attend a school that offers an inclusive environment. Thank you for sharing.",
      "author": "Calvin-Snoopy",
      "created": 1635039358,
      "upvotes": 3,
      "replies": {}
    },
    "hhss1m3": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhss1m3/",
      "text": "This is why my multiracial queer kid is applying to zero LACs. Their high school was unfortunately like this (small, suburban, mostly white), and the noped out of LACs and small schools immediately when we started compiling a list. Being tokenized sucks.",
      "author": "chickenfightyourmom",
      "created": 1635032407,
      "upvotes": 4,
      "replies": {}
    },
    "hhv733f": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhv733f/",
      "text": "Here are stats for the % of white students at several of the better-known NE and MW LACS vs. some well-regarded large/public/research universities in roughly the same geographical areas.  Also, note that the % of the U.S. population as a whole that is white is 76.3%, so *every one* of these schools is \"less white\" than the U.S. population.  Lists are in descending order by US News rank.  Stats for the public schools include graduate students.\n\nWilliams: 48.9%  \n\nAmherst: 43.3%\n\nSwarthmore: 37.5%\n\nWellesley: 34.8%\n\nBowdoin: 59.3%\n\nCarleton: 57.5%\n\nMiddlebury: 61.6%\n\nGrinnell: 50.1%\n\nHamilton: 63.8%\n\nHaverford: 52.5%\n\nBarnard: 49.6%\n\nColby: 60.5%\n\nColgate: 65.2%\n\nSmith: 50.9%\n\nWesleyan: 53.2%\n\nVassar: 54.8%\n\nBates: 67.1%\n\nMacalester: 56.5%\n\nBryn Mawr: 46.5%\n\nKenyon: 70.5%\n\nMount Holyoke: 47.8%\n\nOberlin: 60.4%\n\nAnd here are some well-regarded large/public/research universities in those same areas:\n\nMichigan: 52.2%\n\nWisconsin: 65.1%\n\nIllinois: 41.2%\n\nOhio State: 63.5%\n\nPurdue: 58.4%\n\nPitt: 65.3%\n\nPenn State: 63.4%\n\nRutgers: 37.5%\n\nUConn: 53.0%\n\nIndiana: 65.6%\n\nUMass: 57.9%\n\nMinnesota: 60.2%\n\nMichigan State: 66.0%\n\nIowa: 71.5%\n\nWhile Rutgers and Illinois are less white than most of the LACs in that list, the others are roughly in-line if not *more* white.  9 out of 22 LACs have a higher % of PoC than Michigan, which is not (AFAIK) often criticized for a lack of diversity.",
      "author": "jayphoward",
      "created": 1635086658,
      "upvotes": 5,
      "replies": {
        "hhvilu9": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhvilu9/",
          "text": "I honestly don’t understand the relevance of these stats. Ive been to some of these schools, and I’m telling you about an experience I’ve had which has nothing to do with stats — an experience of constant underhanded rascism and a small school experience which abets thats. I’ve had numerous friends share a similar experience, and numerous comments and private messages share a similar experience too. You can’t cherry pick a bunch of stats and claim that our experiences are invalid, that is honestly incredibly condescending and ableist. \n\nAlso, these large research schools your listing are not known for diversity. The school I go to now is roughly 30% white, half of most schools you listed. No POC/international/queer student is saying “yeah Rutgers is where the diversity is at.”",
          "author": "Suntzie",
          "created": 1635091766,
          "upvotes": 3,
          "replies": {
            "hhvkkw4": {
              "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhvkkw4/",
              "text": ">I honestly don’t understand the relevance of these stats.\n\nThe claim was that there are fewer PoC at NE/MW LACs vs. large research universities.  So I pulled stats to compare.  That doesn't that seem relevant to the question of how many PoC there are at each?\n\n>I've been to some of these schools\n\nAnd I've been to a large research university and seen the same.\n\n>You can’t cherry pick a bunch of stats and claim that our experiences are invalid\n\nI didn't post those stats to challenge you claim that of having experienced racism was invalid.  I'm sure it happened.  I posted the stats to challenge your claim that there are comparatively fewer PoC on those campuses.  I suppose I might also be challenging the claim that your experience of racism at a LAC *is especially bad at LACs*.\n\n>Also, these large research schools your listing are not known for diversity.\n\nAgreed.  But the set of LACs you mentioned *is also not known for diversity* whereas other LACs *may be*.  Maybe the issue is with schools *in general* located in areas w/o many PoC, and not so much LACs specifically?",
              "author": "jayphoward",
              "created": 1635092554,
              "upvotes": 1,
              "replies": {
                "hhxl3fz": {
                  "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhxl3fz/",
                  "text": "The stats don't paint the full picture. Like I said in the post, its not just the fact that there is a high % of white people, but that there is a homogeneity in worldview and perspective. A city school my have a higher percentage of white people, but it is often in their nature to attract a larger variety of world views. Not every \"white\" person is the same and thats where I find your stats incredibly misleading. This is obviously a broad generalization, but the white people I've met at larger research universities tend to have a much greater appreciation and respect for other cultures, diversity, and points of view. That is the crux of what is missing from these smaller LACs. I know entire sports teams and friend groups that come from the same subrburn area in the North East. \n\nAlso my post was never about how there's simply not enough POCs at these LACs. If the issue was that easy, then the school would simply just admit more POCs and there problem solved. The central issue, as I have explained many times, is that when you do run into problems (both racially and otherwise, I did give a lot of examples regarding sexual assault-related cases) you simply cannot get away from these people. \n\nMoreover, its the type of POCs that these LACs attract. A good portion of the POCs coming to these LACs are either on sports teams or very confident in their whiteness and blend seamlessly into white environments -- this doesn't solve the issue. Look up internalized racism, the idea that, for example, an Asian person in a group of all white people can actually be racist to asian people outside that group. This is a real thing, and its part of the issues at LACs too. Which is why I keep telling you these stats don't paint the full picture. Rutgers and Williams (for example, may not be accurate) can have the same amount of POCs, but how many of those POCs at Williams verses Rutgers are practicing internalized racism? This is my point. \n\nLike I get what you're trying to say about how this is a problem at other places to. And my advice to a POC in my situation a year ago is obviously not to go to Rutgers, but to a T20 schools where the diversity numbers are way way higher. The heart of the issue that I keep trying to stress is that the TYPE of people these northeastern LACs attract are what feeds into a system of underhanded/subconscious racism.",
                  "author": "Suntzie",
                  "created": 1635124031,
                  "upvotes": 1,
                  "replies": {
                    "hi04flb": {
                      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hi04flb/",
                      "text": "I certainly \"get\" that small, expensive LACs tend to attract a certain \"type\" of white person, and that not all white people are the same.   And for sure it is a problem endemic to all LACs that their small size makes it hard to avoid someone.  But I'd also point out that there are a variety of large research universities.  You've got Berkeley, and then you've got Texas A&M.\n\nOr, if we want to stick to the midwest, you've got Indiana and Purdue.  Indiana has a decent sized Greek scene.  How likely is the average IU frat boy to be more progressive and culturally sensitive than the median white guy at Oberlin or Kenyon?  Or, if not frat boy, the median student who grew up in a small rural town that was super-white and super-conservative  (of which you will find many at a large public school in a state w/ a sizeable % of rural residents)?\n\nAlso, I really wonder whether the type of white person who chooses a small northeastern LAC is \\*that\\* different from the sort of white person who chooses to attend, say, Dartmouth, Penn, Wake Forest, Duke, Vanderbilt, Wash U, etc.",
                      "author": "jayphoward",
                      "created": 1635179877,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhtpy15": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhtpy15/",
      "text": "i have a general question and i'm really not trying to start anything, just genuinely asking, but if you encourage POC to steer clear of LACs, how will they ever make progress to integrate said students? and can those institutions inherently be faulted for not attracting a larger POC audience by which to become more diverse (the circular issue)? i've had this concern about my top choice school, a very white LAC in a very white state, and i'm curious about what the solution to create a more heterogenous student body there would be if it isn't telling POC to look into applying.",
      "author": "henlynch",
      "created": 1635049396,
      "upvotes": 2,
      "replies": {
        "hhv67j3": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhv67j3/",
          "text": "I would say what those institutions need to do is make their environment more inclusive by for instance firing the profs that are known to be racist, teaching students about privilege, race, and class issues, and making it a generally more welcoming place for people who aren't rich and white. Then it's justified to try to get more diverse applicants. \n\nRight now they're encouraging POCs to apply so they can boost their \"diversity stats\" whilst doing little to support those people once they're at the institution. In effect, POC are treated as tools to make the college look more diverse rather than as people who deserve dignity and respect on campus.",
          "author": "Cellular_tuesday",
          "created": 1635086257,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhv1vne": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhv1vne/",
      "text": "You talk about not wanting to generalize to all LACs, but the overall gist of this post...kinda does. For instance, not every LAC is in the Midwest, not every LAC is rural, not every LAC has a disproportionately small % of PoC.\n\nAlso:  LACs certainly don't have a monopoly on casual racism.  I'm not even sure I buy that it's more prevalent at LACs, but maybe.  I'm sure it depends on the school.\n\nI resonate with the criticism about the small size resulting in one \"knowing everybody\".  If anything, that's probably what I would find most annoying.",
      "author": "jayphoward",
      "created": 1635084174,
      "upvotes": 2,
      "replies": {
        "hhvjl8s": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhvjl8s/",
          "text": "I’ve had friends at almost all the NESCAC schools who have shared a similar experience. Also, someone commented asking about the consortium schools and I literally said my experiences probably don’t apply to those. You’re right, they don’t. I think casual rascism is embedded in the culture here. My point is that the small schools abet that culture by attracting a crowd with limited cultural perspective, and a small school\nEnvironment that makes it impossible to get away from people who are both rascist and predatory. I had friends that were sexually assaulted and stalked, guess what they literally had to share a floor with that person, and see them around 24/7 because the school is small. They had mutual friends with their assaulter not want to take sides because it’s a small school and no one wants to be on anyone’s bad side. This is the problem, you clearly missed most of what I was saying, especially the part where I said moving to a larger school is not an instant fix but the larger setting gives you an escape. \n\nYou’re right they don’t have a monopoly on rascism and It definitely does differ from school to school. But at least a rascist who goes to a larger school with a greater diversity in world view and perspective has a higher chance of their behaviour being corrected. Because it is often the people who claim not to be rascist who are the most culturally insensitive.",
          "author": "Suntzie",
          "created": 1635092172,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhtvc95": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhtvc95/",
      "text": "They're also usually expensive",
      "author": "jtmoseley",
      "created": 1635052845,
      "upvotes": 1,
      "replies": {}
    },
    "hhvrr4t": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhvrr4t/",
      "text": "ye as a brown dude theres no way in hell im going to college in rural new england with a few hundred white people lmfao",
      "author": "UrethraPlethora",
      "created": 1635095454,
      "upvotes": 1,
      "replies": {}
    },
    "hhwcfsb": {
      "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhwcfsb/",
      "text": "Hello, also part of the \"transferred from an LAC to a research university\" club. There's surprisingly more of us here than I thought. Maybe we should start a band.\n\n**Sports**\n\nI think your points are really important. However, every LAC is different, and there are certainly factors that will affect the strength of these effects. For example, I have not found the athlete culture to be particularly strong at most LACs—many of them lack NCAA sports. My LAC was HUGE on frisbee, but it was more \"most people play a little and a few are insanely good\" than a clique thing. And student athletes having a different sort of schedule and social life applies at most colleges, I think.\n\n**Racial inequality**\n\nI'm also half-white and haven't found the racial vibes to be different at either of the schools I've gone to. People who came from smaller ethnic minorities were less likely to be able to find others on campus from those minorities (for example, there was only one Mongolian on campus), but my LAC for the most part was extremely \"woke\" and I didn't ever feel racially discriminated against. I believe it happened to some at my school, but not to anyone I knew personally. Honestly, a lot of prestigious liberal arts colleges have high levels of racial/national diversity these days, especially the ones outside of the \"historic New England\" bubble. But I would agree that if someone is a POC and considering a liberal arts school, looking up whether it's one of the 97% white ones and making sure they're okay with that is worth doing.\n\nPS: There *was* a lot of racial tension around BLM (partly because the school was INSANELY liberal and any professor who expressed earlier than 2020s-views on had petitions against them.) But I am unsure how much of that was political and how much was genuine upset with how students were being treated.\n\n**Need to value education most**\n\nHonestly, if you want to go to college at all, you should be invested in academics. It doesn't need to be your whole life of course, but seeing it as completely unimportant and just going for the social experience is kind of a waste of money. But it's true that compared to the intimate, accessible academic/research communities, LAC towns and extracurriculars tend not to have as many draws to them. On the plus side, LACs also tend to have some zany ways students entertain themselves (for example, I spent one evening making Taiwanese food and boba with some students and our assistant TA and we went out for drinks after at this tiny pub. Someone else I know went hunting for an ATM that showed up on Google Maps as in the middle of a huge forest. An RA had to stop students from doing things such as \"throwing pumpkins off the roof of the dorm\" or \"breaking into the tunnel systems to explore them,\" etc.)\n\n**Cliquiness**\n\nHonestly, I was nowhere close to popular or well-known at my LAC, so I didn't really experience cliquiness. I think in the first few weeks at my new school, already more people know my name and basic stuff about me than my entire time at my LAC. However, this was mostly due to me being shy before and working hard to overcome it, as well as due to COVID restrictions. Don't have much to say about cliques, mostly because I don't think I'd be the right person to talk about them.\n\n**Course selection**\n\nCourse selection can be a *big* problem many places, especially with popular or very small majors, and I do wish this was mentioned more. However, you're less likely to run into it at LACs that allow you to cross-register classes elsewhere or at the Claremonts, so people who are worried about that should look into those. Also, make sure to ask current students about ease of getting involved with programs you're interested in.\n\n**Being in the middle of nowhere**\n\nBeing in the middle of nowhere can also be demoralizing, which is why I made a list of small schools that are in relatively sizable cities and towns: [https://www.reddit.com/r/ApplyingToCollege/comments/p7lycq/liberal\\_arts\\_colleges\\_that\\_arent\\_in\\_the\\_middle\\_of/](https://www.reddit.com/r/ApplyingToCollege/comments/p7lycq/liberal_arts_colleges_that_arent_in_the_middle_of/)\n\n**Conclusion!**\n\nYou're right: liberal arts schools aren't academic utopias. But I would not describe them as worse for non-athletes, POC, or city-lovers as a whole. Maybe individual schools have this sort of culture, but I have not personally observed this to be true about most liberal arts colleges I've been to/researched/talked with friends about.\n\nI'm glad that you've transferred to a place where you're happier now. I hope you've found it to suit you better.",
      "author": "self_composed",
      "created": 1635103727,
      "upvotes": 1,
      "replies": {
        "hhxjf7h": {
          "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhxjf7h/",
          "text": "I agree with most of what was said. I think my post came off a bit more negative than intended. I think a lot of it depends on luck -- some people find the right guys right away, others have to put up with some insensitivity. My point is that if you are one of those unlucky people who do encounter problematic people (doesn't only have to be race related), then because of the small school nature there is simply no escape and you can't cut them out of your lives the same way you can at a larger school. That was my main point. And it certainly depends on the school, I agree. One thing I am noticing is that the school I went to is probably a bit worse off than others in terms of racial diversity and relations. So there's that too.\n\nI also find your experience with cliqueness to be in the minority. Even people on this thread who disagree with some of the other stuff have admitted that cliqueness is a big problem at these schools. It sounds like you either just got really lucky, or didn't put yourself out there enough to experience the cliqueness. The only real way to avoid it is to just have individual friendships and compartmentalize all of your friends, as I know some of mine have done to avoid this. It solves the issue but not in the most ideal way. \n\nI'm also just curious why you transferred because it sounds like you had a very positive experience at the LACs. Like I said, its not for everyone but some people really find their place there and it sounds like you did.",
          "author": "Suntzie",
          "created": 1635123194,
          "upvotes": 1,
          "replies": {
            "hhxpibw": {
              "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhxpibw/",
              "text": "<3\n\nYeah that's fair; honestly I have basically 0 people I still talk to from my old school, so I probably missed out on a lot of the drama. That was the main reason why I  transferred, incidentally (social vibe just didn't jive for some reason; basically had no close friends. Wasn't a problem with the school as far as I was aware, because I knew plenty of people there who *adored* their friend groups.)\n\nBut in my application to transfer, the reasons I highlighted were: increased opportunities to take classes I'd want (I couldn't get into a single class in my intended major until winter quarter of sophomore year at the LAC), better access to labs (at least based on the people I interviewed before applying,) and more opportunities thanks to the school being in a city. Also one of my best friends goes here, so I knew that even if I epic failed socially twice, she'd be there for me. My old school was a great fit on paper, it seemed like the sort of place I would love, but I just wasn't particularly happy there (academically, extracurricularly, or socially. And I did try.)\n\nLuckily, social stuff has been much better the 2nd time around. Fewer online classes and extracurriculars does a lot to help with that. Just knowing that I have someone to fall back on has probably also made me more comfortable/risk-taking when I talk to people and less desperate to reach out immediately.",
              "author": "self_composed",
              "created": 1635126270,
              "upvotes": 1,
              "replies": {
                "hhxq411": {
                  "link": "/r/ApplyingToCollege/comments/qe9sv7/i_recently_transferred_from_a_t10_lac_to_a_large/hhxq411/",
                  "text": "That makes a ton of sense and its great to see you're doing better. Honestly the main reasons for me too were just the rural location, lack of opportunities/course select, and also one of my friend does to go to the school I'm going to now. So I totally feel that desire to have a sort of social back up where you're going. i wrote this post mainly because I've just dealt with and seen lots of BS around the school (both with sexual predators and racists) and I just wanted to create more awareness and make sure these issues are talked about, especially given how much this sub sometimes idolizes the LACs as the bastion of value undergraduate programs. \n\nAnyways, I think at the end of the day we agree on the main points. If you don't mind sharing, which school did you transfer to and from? Feel free to reply on PM if that is too private to share here.",
                  "author": "Suntzie",
                  "created": 1635126574,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}