{
  "sid": "qetw46",
  "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/",
  "title:": "Did some research and I think I have a good idea of where I want to go, and advice before the EA/ED deadline?",
  "text": "Heyo, r/A2C.\n\n\nGoing through the search of colleges has really sobered me up to where I stood a bit. Not like I thought I was elite academically, but I was hoping for a lot of things that didn’t come to fruition. Freshman year being a weird adjustment, alongside online schooling hitting me a bit hard in some parts did do its thing, and my scores kinda hurt for it. It’s not like I didn’t do alright, I’m still in the top 35% or so in my class, but there’s a lot to reflect on now that I didn’t think about then. Still think I’m not out for the count on the places that I was looking at prior but, It’ll probably be better for me to pursue transferring if that is where I want to be.\n\nAnyways, I’d love to get some input on whether my range of colleges is about around where I stand, alongside some other recommendations.\n\n\nBackground / Stats:\n\nNationality: Black / African-American\nPlace of Residence: Connecticut\n\nMajor: Computer Science\nMinor: Something Business Related\n\nCumulative GPA (on the 4.0 weighted scale): 3.85, 3.5 Unweighted\n\nEach Year (4.0 Weighted): \n\nFreshman Year - 3.62\n\nSophmore Year - 3.94\n\nJunior Year - 3.91\n\nTerm 1 Senior Year (2 weeks left): 4.55 (I don’t know how much it counts for anything, but I put in a lot of work this quarter)\n\n\nCourseload: Mainly Honors / AP \n\nNot Including Senior Year: (5 Regular (3 Half Credit, 1 Full Credit, 1 Quarter Credit Pass / Fail ) 17 L3 (16 Full Credit, 1 Half Credit) 2 AP (All Full Credit))\n\nIncluding Senior Year: (5 Regular (3 Half Credit, 1 Full Credit, 1 Quarter Credit Pass / Fail ) 19 L3 (16 Full Credit, 3 Half Credit) 6 AP (All Full Credit))\n\n\nStuff probably worth noting:\nI’ve taken every CS class that has been offered by the school I go to (so the two aps and the python course)\nI’m currently taking AP Calculus, AP Government, AP CSA, and AP Psychology (took AP US History and AP CSP last year) - Have an A or higher in all of the ones I’m taking this year.\nEnglish is not my best subject, usually have around a B- there (though it’s alight this year). Math was pretty good outside of Junior year where it was eh. \nMy essay seems to be good, reviewed with around 4 teachers.\n\nSAT: 1280 (640 Reading and Writing  / 640 Math)\n\nAlright ECs: (50 Hours of Community Service, Summer Internship at my school (had to apply, do an interview, was paid a wage), Music Honors Society (Tri-M), Summer Religious Leadership Program a town over I did after I graduated from HS, Public Github of around 5-8 small-moderate sized python projects, some article work for some websites)\n\n\nCollege Preferences:\n\nModerately Sized - Big School around where I am (Connecticut), preferably somewhere where I can get internships with regards to my major for experience reasons and the possibility of transferring later on.\n\n\nCost: Not too worried about it but not anything obscenely priced.\n\n\nMy list - Places I have been looking at or am planning to apply to:\n\n\nI have hardly any Chance / Parents Want me to Apply Here, Their Money / Demonstrated Interest in Transfer Tier:\n\nYale University, Columbia University, Stanford University, Cornell University, Carnegie Mellon University\n\nHard Reaches - Probably will apply, but I doubt I have any chance:\n\nGeorgia Tech, University of California (San Diego), NYU (probably too expensive anyway), Northeastern University\n\nModerate Reaches - Possibility of getting in, but it’s less likely than not:\n\nRensselaer Polytechnic Institute, Boston University, University of California (Santa Barbra), UIUC (unsure if this can be moved down)\n\nTargets - Schools I’ve done pretty good research on and I’ll probably apply to all of them:\n\nUniversity of Connecticut (this feels like a perfect match lmao), University of Massachusetts - Amherst, Stony Brook University, Rochester Institute of Technology, Worcester Polytechnic Institute, University of Pittsburgh, Syracuse University, University of California (Irvine)\n\nSafeties:\nQuinnipiac University, Fairfield University (probably could use some more here)\n\n\nThings I probably have to work on / would love some input on:\nMy list of safeties\nRecommendations on slight reach colleges that are good for my major\nWhether my placements are good for my stats, also if these schools that I just started looking at (PennState, Fordham) are worth a good look\nAdvice for transferring as I want to keep that an option later on\nHow much my Senior Year has impact on my resume of admissions\n\n\nAs always, thank you for reading, and have a nice day.",
  "author": "Mubs21",
  "created": 1635087772,
  "updated": 1635182778,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhvb57y": {
      "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhvb57y/",
      "text": "Lots of schools on your list. I would start by eliminating the ones you cannot afford - the time to figure that out is now.\n\n>Cost: Not too worried about it but not anything obscenely priced.\n\nWhat's your actual budget? Most top privates have a cost not much different from NYU, although many privates offer better need-based aid than NYU.\n\nPSA, **public** universities tend to offer little to no *need-based* financial aid to out-of-state students and charge them more. Out of state students pay 65-70k per year to attend UCs, no need-based aid - can you do 70k/yr? If not, cross them off the list. (Not a great value regardless. At that price, you could attend top privates.)\n\nRun the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a *need-based* financial aid estimate before you apply.\n\nYou would need to apply test optional to your reaches. Look closely at the published score ranges for your targets as well.",
      "author": "elkrange",
      "created": 1635088506,
      "upvotes": 4,
      "replies": {
        "hhveyh1": {
          "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhveyh1/",
          "text": "Thank you! Out of curiosity, which schools should I apply test-optional?",
          "author": "Mubs21",
          "created": 1635090210,
          "upvotes": 1,
          "replies": {
            "hhvf9hf": {
              "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhvf9hf/",
              "text": "Look up their reported score ranges [https://nces.ed.gov/collegenavigator/](https://nces.ed.gov/collegenavigator/). Do not report if your score is below the college's 25th percentile.",
              "author": "elkrange",
              "created": 1635090338,
              "upvotes": 1,
              "replies": {
                "hhviqqf": {
                  "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhviqqf/",
                  "text": "Given OP is looking at CS, I would  think hard about submitting to any school where their math score is below the school’s 50th percentile for math scores… with the assumption that CS scores will be higher than the school‘s overall median.",
                  "author": "Strict-Special3607",
                  "created": 1635091821,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhvi2ga": {
              "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhvi2ga/",
              "text": ">which schools should I apply test-optional?\n\nFrankly, for CS, nearly every single school you’ve listed other than your safeties. A 640 math score for a prospective CS major is not a good look.",
              "author": "Strict-Special3607",
              "created": 1635091544,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhvcryy": {
      "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhvcryy/",
      "text": "UIUC needs to be moved UP, not down. (ie - it’s a hard reach for CS for you.)\n\nIn all candor, you should really consider scrapping your entire top-tier. Your grades are not really competitive for these schools, and your SAT score is about 250 points too low to submit for CS to any of those schools. Applying to Yale, Columbia, Stanford, Cornell, and CMU would be a complete waste of time, money, and mental anguish. Time wasted on those applications would be better spent on other applications.",
      "author": "Strict-Special3607",
      "created": 1635089251,
      "upvotes": 3,
      "replies": {
        "hhvef3l": {
          "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhvef3l/",
          "text": "I completely agree with that, i put them there belieivng that to be the case, but my parental situation makes me have to do otherwise. I'm already mostly done with everything else, though",
          "author": "Mubs21",
          "created": 1635089974,
          "upvotes": 2,
          "replies": {
            "hhvhk5d": {
              "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhvhk5d/",
              "text": "Serious question: would you actually be applying to any of those top schools if we weren’t in a “test-optional” application cycle?",
              "author": "Strict-Special3607",
              "created": 1635091326,
              "upvotes": 1,
              "replies": {
                "hhvjaqr": {
                  "link": "/r/ApplyingToCollege/comments/qetw46/did_some_research_and_i_think_i_have_a_good_idea/hhvjaqr/",
                  "text": "Outside of like Yale, probably not. I'm only looking at them currently and will likely only apply to like 1 or 2 others.",
                  "author": "Mubs21",
                  "created": 1635092048,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}