{
  "sid": "ria37r",
  "link": "/r/ApplyingToCollege/comments/ria37r/am_i_being_too_well_rounded/",
  "title:": "Am I being too well rounded?",
  "text": "I know that top schools generally don’t like well rounded people.\n\nMy main ECs are trumpet in the marching band/concert band, robotics, soccer, president of a STEM related club, and STEM related volunteering.\n\nFor soccer, I’m just the regular player who isn’t the kind that will get recruited. JV 2 years and varsity for 2. \n\nBut for my other activities I have been good enough to get a leadership position in band (responsible for ~20) and I am the lead for software in robotics. As president of the club I grew it to 20 active members. I also have 200 hours so far in volunteering.\n\nSo basically I am not insanely talented in any of my activities, but good enough to get leadership and regional awards in my many activities. Does this still count as being well rounded?",
  "author": "blueballer20",
  "created": 1639718996,
  "updated": 1645834558,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "howzdf5": {
      "link": "/r/ApplyingToCollege/comments/ria37r/am_i_being_too_well_rounded/howzdf5/",
      "text": "i think ur good. u seem well rounded w a spike if you have heard that term before lol. especially if ur pursuing STEM, and idk if you checked yes for pursuing activities such as band in college but they will like seeing ur effort in band if you checked that.",
      "author": "autumnhong",
      "created": 1639748166,
      "upvotes": 1,
      "replies": {}
    },
    "hox91n7": {
      "link": "/r/ApplyingToCollege/comments/ria37r/am_i_being_too_well_rounded/hox91n7/",
      "text": ">Am I being too well rounded?\n\nNo such thing.\n\n>I know that top schools generally don’t like well rounded people.\n\nThis is not true.",
      "author": "jayphoward",
      "created": 1639752533,
      "upvotes": 1,
      "replies": {
        "hp9moiu": {
          "link": "/r/ApplyingToCollege/comments/ria37r/am_i_being_too_well_rounded/hp9moiu/",
          "text": "i heard somewhere that they are looking for well rounded classes, not well rounded individuals",
          "author": "blueballer20",
          "created": 1639982044,
          "upvotes": 1,
          "replies": {
            "hpaomi2": {
              "link": "/r/ApplyingToCollege/comments/ria37r/am_i_being_too_well_rounded/hpaomi2/",
              "text": "They certainly do place value on a student having committed themselves to something and achieved at a high level, but nobody gets rejected for being \"too well rounded\".\n\nLike, no AO has ever said, \"I would admit this guy if he just weren't so well-rounded.\"\n\nNow, they might say, \"I would admit this guy, except he doesn't seem to really be interested in anything in particular.  He's got good grades and scores, but what really excites him?  I can't tell.\"",
              "author": "jayphoward",
              "created": 1640009746,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}