{
  "sid": "qtune9",
  "link": "/r/ApplyingToCollege/comments/qtune9/what_is_the_process_of_becoming_a_surgeon_in/",
  "title:": "What is the process of becoming a surgeon in Canada?",
  "text": "I asked my guidance councillor but they did not seem to know. I want achieve a career path in med. What is the process if you are in High school?",
  "author": "UnknQQ",
  "created": 1636910776,
  "updated": 1637180238,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hkmftl7": {
      "link": "/r/ApplyingToCollege/comments/qtune9/what_is_the_process_of_becoming_a_surgeon_in/hkmftl7/",
      "text": "In both the US and Canada, the general path is high school --> 4 years of undergrad studying biology or a related subject --> 4 years of medical school --> clerkship/residency/etc. The difficult factors in your instance are that (1) med school admissions are extremely competitive in Canada, with only about 1 in 5 applicants being accepted anywhere, and (2) surgery is an extremely competitive and demanding specialty.\n\nTake it one step at a time. Your goal now should be to maintain high grades in order to attend a Canadian university and participate in activities that give you experience in the medical field like volunteering at your local hospital.",
      "author": "i_stan_t_cells",
      "created": 1636917358,
      "upvotes": 3,
      "replies": {
        "hknkzca": {
          "link": "/r/ApplyingToCollege/comments/qtune9/what_is_the_process_of_becoming_a_surgeon_in/hknkzca/",
          "text": "Thank you very much for the information! I also have another question. Should I also take math and all three sciences?",
          "author": "UnknQQ",
          "created": 1636933771,
          "upvotes": 2,
          "replies": {
            "hknwovl": {
              "link": "/r/ApplyingToCollege/comments/qtune9/what_is_the_process_of_becoming_a_surgeon_in/hknwovl/",
              "text": "In high school, you should definitely take four years of math and (ideally) four years of science including at least biology, chemistry, and physics.\n\nIf you can maintain high grades throughout high school, you'll likely be able to attend any university of your choice in Canada. Fortunately, undergraduate admissions are not as competitive in Canada as they are in the US. Once at college, you'll have plenty of opportunities and resources to better discern your path forward before the process begins to get more challenging with med school admissions.",
              "author": "i_stan_t_cells",
              "created": 1636939132,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}