{
  "sid": "qv2ubm",
  "link": "/r/ApplyingToCollege/comments/qv2ubm/i_cant_w_my_parents/",
  "title:": "i cant w my parents -_-",
  "text": "so my parents will ONLY let me apply to hypsm out of state. (plus one more college that i get a discount at due to a parent's workplace lol.) yes, seriously.\n\n(also before you go about how rankings dont matter um ill elaborate)\n\nit's pissing me off because im a student who - w good essays - would have a great chance at some t30s and maybe even get scholarships at some t50s. my in-state colleges are: two t10s (i applied ofc but not exactly \"guaranteed\" lmaoooo), one t50 that im not allowed to go to because it's \"too far,\" and the rest are just normal colleges.\n\nobv, ranking is NOT a huge deal, and i have a safety that i really like and is my like \"realistic school that id be happy going to\"!!! but i've worked really hard in high school... and if i can get access to a nice like alumni network, some level of prestige to help me out in grad school stuff and internship opportunities and employment later in life, and a small student to teacher ratio and stuff..... why not? if i worked hard on those applications and then didnt get in, then, like... aw man, sucks. no biggie. if i was picking between my normal college safety for <5k per year and a full price t30... then, hm, id have to think about that one and likely would stick w my safety. but the fact is that even if i DID get in and secure some type of scholarship, my parents wouldnt let me go. \n\nyes, i know it's early rn to be all defeatist, but it's just, like... if i DIDN'T get in to my reaches and \"low reaches,\" sure, i'd be SAD, but i would make peace with it because i'd know that i gave it my all with the resources and knowledge that i had (i didnt really find out about anything to do w college admissions until junior year bc my parents didnt attend college in the us). if i got in somehow but couldnt afford, i wld be quite devastated ngl but, still, it's OUT OF MY HANDS at that point. but not being able to apply because theres 0 way ill be allowed to attend?? like, i HAVE the grades and scores and leadership positions and community service and writing skills and lors and an internship .......... not stellar enough to be standout to a t10, and im obviously perfectly fine w that! but i do have what it takes to get into other colleges that still would really be such an amazing opportunity!!!!!",
  "author": "starshinez05",
  "created": 1637049759,
  "updated": 1637179184,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "hkuygbf": {
      "link": "/r/ApplyingToCollege/comments/qv2ubm/i_cant_w_my_parents/hkuygbf/",
      "text": "I just left this comment on another post. While they’re story is different from yours, my response would be mostly the same: \n\nThis sounds confusing and frustrating.\n\nHere’s what I suggest.\n\nTry to think about  this from their perspective so that you can easily respond to their worries and hesitations. Sometimes we parents can get confused on our own and nearly always our actions come from a place of love and fear. So if you can understand their perspective if can’t help. Now that doesn’t mean you have to agree with it. You hold your own thoughts and views in your head and they can be completely separate from your parents. Remember that.\n\nFirst step is to sit down and talk with your parents. At this stage it’s really important to listen to what they’re saying and for them to know you are listening. Ask them questions. Don’t argue. Repeat back what they’re saying so they know you heard them. Things like - I hear you saying …. It sounds like you feel like …. Will let them know you’re listening.\n\nThen take some time to respond at a later date. Think about their concerns and address them one by one. Sometimes students make a presentation for this so they can have statistics and information easily available and it demonstrates to your parents that you’re serious and can handle these next big steps moving forward in your life.\n\nAlso be sure to think about reasons your parents might not be comfortable talking to you about — like financial concerns. Maybe they know they can’t afford to have two kids in college at the same time but don’t want to share that info with you so be sure to address cost in your presentation if you think it might be an issue.  Look for schools with lots of merit aid or where you could qualify for lots of need based aid possibly. And be ready to talk about and consider the options your parents are presenting to you too. Show them the courtesy you’d like them to show you.\n\nGrowing up is hard for you and hard for your parents. You’re entering the next stage of your lives and the transition can be really hard. Listening and respecting the others perspective is essential— even while holding onto your sense of self and who you are as it begins to blossom and bloom.\n\nYou got this. Good luck!",
      "author": "admissionsmom",
      "created": 1637074807,
      "upvotes": 5,
      "replies": {
        "hkwbl3o": {
          "link": "/r/ApplyingToCollege/comments/qv2ubm/i_cant_w_my_parents/hkwbl3o/",
          "text": "thank you!\n\nyeah, i have talked to them. it's a few things: that i'm the oldest, that i'm a girl, and that culturally it's not very like... \"acceptable\" (ig?) to have any child to live away from home.. but ESPECIALLY a girl. theyre okay with hypsm because that \"justifies it\"; at least ill be going to some super amazing school which would override the horrors of a their oldest daughter living oos. even though i obviously completely disagree, i do UNDERSTAND where they're coming from. \n\ninitially i had many oos schools that gave merit scholarships, but they told me to narrow it down it just hypsm (im not applying to all of them, of course, bc i dont actually \"like\" all of them lmao). \n\nthey also are paying for my college, so they obviously have the last say financially speaking - even though they do respect my wishes and stuff in terms of \"college they approve of A vs college they approve of B.\"",
          "author": "starshinez05",
          "created": 1637094303,
          "upvotes": 3,
          "replies": {
            "hkxpp29": {
              "link": "/r/ApplyingToCollege/comments/qv2ubm/i_cant_w_my_parents/hkxpp29/",
              "text": "I view college as a transformative process where you learn to be an adult. If you lose your opportunity to live on your own now, you're disadvantaging yourself for the future, unless you plan to live with your parents for the rest of your life. Try telling your parents that.",
              "author": "Hour-Direction-5535",
              "created": 1637115384,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkuzxg5": {
      "link": "/r/ApplyingToCollege/comments/qv2ubm/i_cant_w_my_parents/hkuzxg5/",
      "text": "Do you live in Illinois?",
      "author": "tuliwuli",
      "created": 1637075443,
      "upvotes": 3,
      "replies": {
        "hkwaquk": {
          "link": "/r/ApplyingToCollege/comments/qv2ubm/i_cant_w_my_parents/hkwaquk/",
          "text": "yup :) lol",
          "author": "starshinez05",
          "created": 1637093971,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkunruf": {
      "link": "/r/ApplyingToCollege/comments/qv2ubm/i_cant_w_my_parents/hkunruf/",
      "text": ">so my parents will ONLY let me apply to hypsm out of state\n\nCan they stop you?",
      "author": "jayphoward",
      "created": 1637069822,
      "upvotes": 4,
      "replies": {
        "hkwbolw": {
          "link": "/r/ApplyingToCollege/comments/qv2ubm/i_cant_w_my_parents/hkwbolw/",
          "text": "not technically, but they can stop me from going, and theyve told me not to apply to those places",
          "author": "starshinez05",
          "created": 1637094341,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}