{
  "sid": "rhb42y",
  "link": "/r/ApplyingToCollege/comments/rhb42y/are_there_any_schools_that_only_look_at/",
  "title:": "are there any schools that only look at biological parent financial information?",
  "text": "I’m in that weird divorced parents financial situation where both my custodial and non custodial biological parents are low-income aka would make me qualify for max aid (EFC of 0 for both)\n\nbut my non-custodial parent remarried and that step-parent has a very high income so schools that look at his income would ask them to pay the full sticker price :( however, he has refused to contribute \n\nim already applying to schools that only use FAFSA (since they’d only look at custodial parents income) and some of the only “””top”” schools that don’t look at non-custodial parents income (Georgia tech, vanderbilt, Uchicago). \n\ni was wondering if there are any schools that use css profile (including non-custodial profile) but don’t look at step-parents Aka only look at biological parents? or any schools that specifically don’t look at the step-parent if they remarried the non-custodial parent? \n\nim not sure if this makes any sense but i figured I’d ask just in case",
  "author": "basil_pasta",
  "created": 1639606985,
  "updated": 1639786851,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hophnhh": {
      "link": "/r/ApplyingToCollege/comments/rhb42y/are_there_any_schools_that_only_look_at/hophnhh/",
      "text": "Barnard has disregarded step-parent income before.  I think possibly one of the Boston colleges does (BC maybe?) University of California schools are FAFSA. You are on the right track with your list, and this IS a thing, you just need to dig deeply to find out.",
      "author": "Royal-Championship-2",
      "created": 1639609459,
      "upvotes": 2,
      "replies": {
        "hopiqyc": {
          "link": "/r/ApplyingToCollege/comments/rhb42y/are_there_any_schools_that_only_look_at/hopiqyc/",
          "text": "thank you so much for your response,, i really appreciate it! i will definitely look into these schools :)",
          "author": "basil_pasta",
          "created": 1639609927,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hopc6t2": {
      "link": "/r/ApplyingToCollege/comments/rhb42y/are_there_any_schools_that_only_look_at/hopc6t2/",
      "text": "maybe a related question could be: is it worth it applying to top schools that will likely see his income with the hope that i can talk to their financial aid office about my situation? or is this a pretty common situation that kids of divorced parents just kinda have to work with",
      "author": "basil_pasta",
      "created": 1639607188,
      "upvotes": 1,
      "replies": {}
    }
  }
}