{
  "sid": "qh9ack",
  "link": "/r/ApplyingToCollege/comments/qh9ack/european_colleges_would_it_be_cheaper_or_even/",
  "title:": "european colleges -- would it be cheaper? or even worth it?",
  "text": "hi folks,\n\ni'm a high school senior from a rural school and a border-poverty-line family. i've been looking at colleges in the us, and they're all just so. expensive. it's making me want to vomit just thinking about it.\n\ni looked into canadian schools, which somehow seem to be about the same, but i've noticed that european countries seem to (generalizing here) have better handle on costs.\n\ndoes anyone have any tips applying to eu colleges? or was it a dumb idea from the get-go?",
  "author": "introspection--",
  "created": 1635376664,
  "updated": 1635455995,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hib9fby": {
      "link": "/r/ApplyingToCollege/comments/qh9ack/european_colleges_would_it_be_cheaper_or_even/hib9fby/",
      "text": "Honestly, at that low of an income level, I'd say it's not worth it; most US schools give out plenty of need-based and/or merit-based financial aid which you could qualify for.",
      "author": "Stq1616",
      "created": 1635376906,
      "upvotes": 2,
      "replies": {}
    },
    "hibf64g": {
      "link": "/r/ApplyingToCollege/comments/qh9ack/european_colleges_would_it_be_cheaper_or_even/hibf64g/",
      "text": "Are you from the US?  It's important to keep in mind that the listed cost for a school is very likely not your cost in your situation.  Need based financial aid is likely going to make some domestic options less expensive than schools outside the US.\n\nLook at the net price calculator for schools that interest you.  Public colleges and universities in your state as well as private universities and colleges can do a good job of providing aid.  Out of state public universities aren't usually good for need based aid.",
      "author": "BrawnyAcolyte",
      "created": 1635379498,
      "upvotes": 1,
      "replies": {}
    }
  }
}