{
  "sid": "qlknea",
  "link": "/r/ApplyingToCollege/comments/qlknea/low_rigor/",
  "title:": "Low rigor",
  "text": "How bad does my transcript look? I have a 4.0 GPA, but took only 1 ap class each year in 10th and 11th, being Ap psych and APUSH. I am currently taking AP Calc BC, AP Bio, and AP Comp Sci. My school offers relatively few AP's but I've  seen everyone else in my class taking at least two AP's a year. In tenth, the available APs were Comp Sci, Psych, Human Geo (can't take both Human geo and psych), and Lang. I took no honors classes. In 11th, AP Lang, Comp Sci, and Chem were offered. I took all honors classes this year, the highest level math class for 11th grade, and APUSH.",
  "author": "Wumbofet",
  "created": 1635906470,
  "updated": 1636136825,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj3k5vm": {
      "link": "/r/ApplyingToCollege/comments/qlknea/low_rigor/hj3k5vm/",
      "text": "I wouldn’t call this low rigor.  Also, what happened to calc AB?",
      "author": "chumer_ranion",
      "created": 1635906861,
      "upvotes": 3,
      "replies": {
        "hj3kdju": {
          "link": "/r/ApplyingToCollege/comments/qlknea/low_rigor/hj3kdju/",
          "text": "You have to take either AB or BC or no math in senior year at my school. Ab isn't offered junior year. To take BC, you have to do the math class I did and end with an A.",
          "author": "Wumbofet",
          "created": 1635906952,
          "upvotes": 3,
          "replies": {}
        },
        "hj3kkb3": {
          "link": "/r/ApplyingToCollege/comments/qlknea/low_rigor/hj3kkb3/",
          "text": "Also, you think my sophomore year isnt low rigor? I feel like it is the weakest part of my transcript. Only one AP and no honors class.",
          "author": "Wumbofet",
          "created": 1635907033,
          "upvotes": 1,
          "replies": {
            "hj3leph": {
              "link": "/r/ApplyingToCollege/comments/qlknea/low_rigor/hj3leph/",
              "text": "At my high school they didn’t even *let* us take APs until junior year.  All things considered (including that you have essentially completed a calc AB equivalent) I would consider your rigor to be solid for T30’s.",
              "author": "chumer_ranion",
              "created": 1635907389,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hj53yof": {
      "link": "/r/ApplyingToCollege/comments/qlknea/low_rigor/hj53yof/",
      "text": "its really only a red flag if you take maybe 3 AP’s out of 15 that are offered",
      "author": "Witty-Evidence6463",
      "created": 1635943781,
      "upvotes": 2,
      "replies": {}
    }
  }
}