{
  "sid": "q8w6lt",
  "link": "/r/ApplyingToCollege/comments/q8w6lt/few_questions_on_applying_twice_early_admissions/",
  "title:": "Few questions on applying twice, early admissions, other stuff.",
  "text": "My target school is Michigan State University.\n\nFor some background, I went from 990 to 1070 on my SAT, I might retake it again this December if I need to. I have 1 AP which I got an A in but didn't take the test. I have no extracurriculars other than 2-3ish years of band (quit when covid hit) and intensive language learning on my own but I have no proof for it. And as a last bit I think I could write a pretty damn good essay but would still appreciate some pointers for that. \n\nNow I understand that I can apply now after taking some time on my essay, and get a decision earlier. However, I think this means I won't get to apply again after the December SAT. Is this true? And if so, wouldn't it be better to wait until after the December SAT to submit my application? \n\nAdding onto my confusion is rolling admissions, how do these work? Does it mean I can submit after regular admission deadline and still get into MSU for 2022-2023? \n\n&#x200B;\n\nTL;DR: Is my SAT good for MSU? Can I submit to the same college for early admissions, and then again for regular admissions, and then maybe again for rolling admissions assuming that's how they work?",
  "author": "SignificantAd8465",
  "created": 1634327900,
  "updated": 1634577351,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgs2l7a": {
      "link": "/r/ApplyingToCollege/comments/q8w6lt/few_questions_on_applying_twice_early_admissions/hgs2l7a/",
      "text": "You can’t apply twice in the same year.",
      "author": "Strict-Special3607",
      "created": 1634328014,
      "upvotes": 1,
      "replies": {
        "hgs2q3b": {
          "link": "/r/ApplyingToCollege/comments/q8w6lt/few_questions_on_applying_twice_early_admissions/hgs2q3b/",
          "text": "Should I apply for regular or early admission then? Doesn't early give a better chance?",
          "author": "SignificantAd8465",
          "created": 1634328072,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgttj01": {
      "link": "/r/ApplyingToCollege/comments/q8w6lt/few_questions_on_applying_twice_early_admissions/hgttj01/",
      "text": "Michigan State doesn't provide any benefit for early action, other than finding out whether you are admitted earlier.  At MSU, rolling means they will accept students on a space available basis after the normal application deadline.  \n\nOther schools can use those terms in different ways which can be confusing when you are reading general guidance - Pitt rolling admissions means they assess applicants in the order they apply, and Purdue early action does matter for scholarships and some majors.\n\n1070 would be in the bottom 25% at MSU -- I would take another shot at it if you have time.  Average for MSU is around 1200.   They are test optional this year so if you don't get a score that you think reflects your ability as well as your grades do, just don't send one.",
      "author": "BrawnyAcolyte",
      "created": 1634360806,
      "upvotes": 1,
      "replies": {
        "hgtxdl4": {
          "link": "/r/ApplyingToCollege/comments/q8w6lt/few_questions_on_applying_twice_early_admissions/hgtxdl4/",
          "text": "I plan on taking the December SAT, also wouldn't it be better to send in a 1070 than no SAT at all?",
          "author": "SignificantAd8465",
          "created": 1634363589,
          "upvotes": 1,
          "replies": {
            "hgv11zc": {
              "link": "/r/ApplyingToCollege/comments/q8w6lt/few_questions_on_applying_twice_early_admissions/hgv11zc/",
              "text": "No - if your SAT is below the 25% mark I don't think it will help you at all, and could potentially hurt.",
              "author": "BrawnyAcolyte",
              "created": 1634393325,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}