{
  "sid": "ri5rc4",
  "link": "/r/ApplyingToCollege/comments/ri5rc4/upenn_deferral_question/",
  "title:": "UPenn deferral question",
  "text": "Hello everyone!\n\nI was just deferred from UPenn ED, and wanted to know if this is a good thing or not. In other words, is there any correlation between being deferred and an increase in RD chances? Or will my application be read again by a different AO from scratch?\n\nThanks in advance and congrats to the ED admits!",
  "author": "davidszt2",
  "created": 1639705031,
  "updated": 1639786060,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hovayca": {
      "link": "/r/ApplyingToCollege/comments/ri5rc4/upenn_deferral_question/hovayca/",
      "text": "It depends on the school. For schools like Stanford, they defer very few REA candidates. For schools like Harvard, they defer almost everyone who is not accepted. I would Google and see if Penn posts any stats. In terms of acceptance rates, it’s all relative to the strength of the RD pool.  Your app might not have stood out as an immediate acceptance to them during the ED round, given the extremely tough competition, but in the framework of the RD pool, you might be an easier choice for them. On the other hand, you could become a lesser choice for them. You cannot really control how they perceive your application at this point, besides sending a LOCI. Given this information, I would try not to worry about chances. Your decision will be your decision. :)",
      "author": "Tarheel4lifer24",
      "created": 1639710874,
      "upvotes": 4,
      "replies": {
        "hoyh85l": {
          "link": "/r/ApplyingToCollege/comments/ri5rc4/upenn_deferral_question/hoyh85l/",
          "text": "Thank you so much! I tried looking up some stats, only thing I found is that they accepted 9.5% of deferred applicants last year. But yes, you’re right, it’s beyond me at this point. Cheers!",
          "author": "davidszt2",
          "created": 1639769652,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hov9s1w": {
      "link": "/r/ApplyingToCollege/comments/ri5rc4/upenn_deferral_question/hov9s1w/",
      "text": "commenting bc I’m also curious",
      "author": "FlamingoPale",
      "created": 1639710323,
      "upvotes": 2,
      "replies": {}
    }
  }
}