{
  "sid": "qvbzdr",
  "link": "/r/ApplyingToCollege/comments/qvbzdr/need_advice_as_a_homeschooler/",
  "title:": "Need advice as a homeschooler",
  "text": "So I am technically homeschooled but I take/have taken most of my highschool classes at basically an unofficial school campus with like a counselor and real teachers. My counselor filled out the report and submitted a transcript that included all the classes I’ve taken and the grades I’ve gotten, even just the ones I’ve done at home. \n\nHowever, after I submitted my application on Sunday, almost every school I applied to is saying I need to submit additional transcripts, some even while acknowledging the one I have submitted. One school that was doing this corrected itself but the others have not. \n\nIt’s basically saying\n“Yes we have received [unofficial school name] transcript but we need your homeschool transcript” even though they’re the same thing. (I listed myself as homeschooled on the common app like I was told to)\nSome schools are even like “we need a [My Name] transcript.”\n\nThis is a really unique situation I’m guessing so I don’t expect y’all to have the answers but I’m very stressed about it and my counselor says she’s never seen this happen before",
  "author": "purpletwinkapple",
  "created": 1637080976,
  "updated": 1637179312,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkvdyky": {
      "link": "/r/ApplyingToCollege/comments/qvbzdr/need_advice_as_a_homeschooler/hkvdyky/",
      "text": "This makes sense if the \"school\" you attend is not accredited. The official transcript would come from your homeschool, usually your parent as administrator.\n\nI would recommend this forum for homeschool college app questions: https://forums.welltrainedmind.com/forum/17-the-college-board/",
      "author": "elkrange",
      "created": 1637081140,
      "upvotes": 1,
      "replies": {
        "hkveoy0": {
          "link": "/r/ApplyingToCollege/comments/qvbzdr/need_advice_as_a_homeschooler/hkveoy0/",
          "text": "The “school” I attend is part of my homeschooling, I just had the counselor do the part that my parent would otherwise do",
          "author": "purpletwinkapple",
          "created": 1637081426,
          "upvotes": 1,
          "replies": {
            "hkvff24": {
              "link": "/r/ApplyingToCollege/comments/qvbzdr/need_advice_as_a_homeschooler/hkvff24/",
              "text": "I understand. The transcript needs to be official. My guess is that the colleges are expecting the official homeschool transcript to come from your homeschool, not an unaccredited (subcontracted) third party. (This could be as simple as some sort of signed and sealed paper attaching the other transcript.)\n\nI would strongly encourage you to ask in the forum I linked, as those folks will help you sort out what you need to do, exactly, to satisfy the colleges.",
              "author": "elkrange",
              "created": 1637081709,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}