{
  "sid": "qwh4r2",
  "link": "/r/ApplyingToCollege/comments/qwh4r2/how_bad_is_dropping_down_a_math_class/",
  "title:": "How bad is dropping down a math class?",
  "text": "I'm quite literally consistently getting 50s on my math tests. I'm in BC Calc and expected it to be hard but not absolutely impossible, and I made the mistake of not just signing up for AB Calc at the beginning of the year. I think I can handle AB Calc (though idk is there a big difference?), so would it be better for me to drop down to AB Calc in the middle of the year and save myself from getting a C on my transcript? Or do colleges really not like seeing someone drop down?",
  "author": "aitternhh",
  "created": 1637208014,
  "updated": 1637353312,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hl2y0k8": {
      "link": "/r/ApplyingToCollege/comments/qwh4r2/how_bad_is_dropping_down_a_math_class/hl2y0k8/",
      "text": "Best to check with the how school sees someone having a C ( or a D for that matter) and if possible to retake classes if you're into it\n\nIm doing a bachelor in math and it usually takes 3 years to complete\n\nIm in my 3rd year and only half way through so dont rush it if you can",
      "author": "Hungry-Masterpiece90",
      "created": 1637209363,
      "upvotes": 3,
      "replies": {}
    },
    "hl344ck": {
      "link": "/r/ApplyingToCollege/comments/qwh4r2/how_bad_is_dropping_down_a_math_class/hl344ck/",
      "text": "At my school at least, there wasn’t a big difference between AB and BC. If you can drop, then I suggest you do unless you can find out why you are failing. Silly mistakes? Not understanding concepts? I heard stats was generally easier",
      "author": "leaf1598",
      "created": 1637212718,
      "upvotes": 1,
      "replies": {}
    },
    "hl3i515": {
      "link": "/r/ApplyingToCollege/comments/qwh4r2/how_bad_is_dropping_down_a_math_class/hl3i515/",
      "text": "maybe ask the AB teacher to make sure it would be easier enough to at least get a B",
      "author": "Sorgair",
      "created": 1637222390,
      "upvotes": 1,
      "replies": {}
    },
    "hl4mzfk": {
      "link": "/r/ApplyingToCollege/comments/qwh4r2/how_bad_is_dropping_down_a_math_class/hl4mzfk/",
      "text": "Yes. Your grade is more important. Drop down to AB or even regular level\nWould be my suggestion.  You don’t want a C on your senior transcript if you can avoid it.",
      "author": "admissionsmom",
      "created": 1637248481,
      "upvotes": 1,
      "replies": {}
    }
  }
}