{
  "sid": "r70n75",
  "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/",
  "title:": "I pressed done on the Apply Texas application and everything was deleted.",
  "text": "All my supplemental essays were deleted. Now i’m late. I’m pretty sure the deadline is 11:59 CT and it’s 9 minutes past that. Does UT accept late applications?",
  "author": "idieoekrnfh",
  "created": 1638425447,
  "updated": 1638478036,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hmwhb93": {
      "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwhb93/",
      "text": "I think UT has a hard deadline for that part of the application since they're listed as part of the required materials.\n\nI wouldn't know if they allow late applications, if you can submit it, go ahead. If it's locked out, email them.\n\nBut, a possible work around, UT says the deadline is \"Dec 1st\" for that part of the application, whereas they specify \"Dec 8th 11:59pm Central\" for supporting materials. ([https://admissions.utexas.edu/apply/freshman-admission](https://admissions.utexas.edu/apply/freshman-admission)) Its possible the application doesn't lock out until Dec 2nd YOUR time zone, in which case, you could try a VPN and see if it lets you submit the application.\n\nIt works for CommonApp, doesn't work for Coalition App, I'm not sure for ApplyTexas. If so, this might give you a couple of hours.\n\nEdit: Also possible they just didn't clarify CST on their page for that portion.. but worth a shot?",
      "author": "DrDrago-4",
      "created": 1638425948,
      "upvotes": 1,
      "replies": {
        "hmwibpl": {
          "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwibpl/",
          "text": "it still let me pay and submit the application? i’m confused. will they just not count it then? i’d don’t use a vpn",
          "author": "idieoekrnfh",
          "created": 1638426613,
          "upvotes": 2,
          "replies": {
            "hmwklpc": {
              "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwklpc/",
              "text": "1. did it let you submit it without supplementals? (ie. it deleted them, then you submitted anyways without any supplementals)\n\n2. or you submitted it, then it looked like it deleted your supplementals afterwards?\n\n3. or did you submit it late with supplementals? (having rewritten them after they got deleted)\n\nif the first, I'd write the supplementals asap and email admissions stating the error, your app details, and your essays to be added. Also say you'll upload them as soon as you get access to your account. Stress that applytexas had an error, and no place to submit them.\n\nif the second, I'm inclined to believe it's just Applytexas being wonky like it is..  email them if you wanna be safe\n\nif the 3rd, they probably have an application grace period, in which case I wouldnt worry about it and I'd assume your app will be counted\n\nEdit: possible 4th option you might mean: Submitted late without any supplementals (since they got deleted you said)\nif so, assume itll be counted with a grace period, but follow #1's steps.",
              "author": "DrDrago-4",
              "created": 1638428167,
              "upvotes": 1,
              "replies": {
                "hmwkv2i": {
                  "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwkv2i/",
                  "text": "This",
                  "author": "RetiringTigerMom",
                  "created": 1638428356,
                  "upvotes": 2,
                  "replies": {}
                },
                "hmwlha9": {
                  "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwlha9/",
                  "text": "It was the third. I rewrote the supplemental and i submitted 20 minutes after and everything was fine. I’ll contact my counselor tomorrow and ask their policy. Should i still contact them and ask?",
                  "author": "idieoekrnfh",
                  "created": 1638428798,
                  "upvotes": 1,
                  "replies": {
                    "hmwnqnw": {
                      "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwnqnw/",
                      "text": "I would say it cant hurt to email and ask, but I have no idea if it possibly could\n\nIf it let you submit normally.. I'd be inclined to just assume there was a grace period, and wait a few days and see if you receive application portal login details, personally.\n\nedit: especially since itll probably take a couple days for them to respond anyways.. maybe give it 2 days and see if you get login details \n\nbut maybe someone else knows? I dont think it would hurt to email.. but ? not an AO so",
                      "author": "DrDrago-4",
                      "created": 1638430500,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hmwjfc7": {
          "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwjfc7/",
          "text": "They clarify it in the admission portal, which you know, is after you’ve already submitted the application\n\nyea kind of dumb ngl",
          "author": "Xymes",
          "created": 1638427354,
          "upvotes": 2,
          "replies": {
            "hmwk4vx": {
              "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwk4vx/",
              "text": "damn that's scuffed, his only bet is probably to email them then?\n\nI was just recently freaking out about their transcript deadline since the format is so scuffed on that page, theres barely any hint that they consider transcripts as supporting materials (Dec 8th deadline)",
              "author": "DrDrago-4",
              "created": 1638427840,
              "upvotes": 1,
              "replies": {
                "hmwlabh": {
                  "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwlabh/",
                  "text": "Yea I think so on the email. And I had the same thought process on the supporting materials. The UT process so far is just so unclear, but I mean once you get the stuff done it should be smooth sailing.\n\nAlso I technically already got admission because I rank at least top 6% in Texas, so there’s that at least lol (but it’s not the correct major, so)",
                  "author": "Xymes",
                  "created": 1638428660,
                  "upvotes": 1,
                  "replies": {
                    "hmwlme0": {
                      "link": "/r/ApplyingToCollege/comments/r70n75/i_pressed_done_on_the_apply_texas_application_and/hmwlme0/",
                      "text": "The entire process has been unclear for me lol, I hate Naviance so much. Its basically made all my Jan 1 deadlines Dec 8th instead (::: gotta love transcript request deadlines.. because who uses automated processes in 2021 ?\n\nUT's process is just downright cryptic, but yeah, hopefully smooth sailing once it's done\n\nI'm in the top 7.5% ahh, so close yet so far from that auto admission\n\nedit: from his last comment it sounds like there might be a grace period of some sort",
                      "author": "DrDrago-4",
                      "created": 1638428900,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}