{
  "sid": "fz6nx9",
  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/",
  "title:": "they lied to me",
  "text": "we all worked SO HARD in high school, always to be told to take the sidelines at rewarding events because “you’ll get your chance when you’re a senior” and “your time will come.” Obviously no one could’ve predicted this but I still feel lied to and cheated nonetheless. We’ve had to watch every single class above ours get rewarded in so many ways and it sucks that we get nothing. \n\nClass of 2020, we deserve everything that was planned for us and more. We won’t even get to say goodbye to our classmates or get our yearbooks signed or walk across the stage that we worked 12 years to get to. Fuck this #RIPClassof2020\n\nEDIT: i didn’t expect this to blow up so much so i wanna clarify some stuff. this isn’t anyone’s fault and i’m NOT saying we should bring these events back. i am gladly staying home because it needs to be done. i also acknowledge that this is a first world problem and i am privileged that this my biggest worry and nothing worse. it is what it is, i am just saying it for those of us who are sad that it’s ok to be sad.",
  "author": "hazardmilk",
  "created": 1586616288,
  "updated": 1634075994,
  "over_18": false,
  "upvotes": 2196,
  "upvote_ratio": 0.94,
  "comments": {
    "fn3z1vc": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3z1vc/",
      "text": "[deleted]",
      "author": null,
      "created": 1586630741,
      "upvotes": 282,
      "replies": {
        "fn44ak2": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44ak2/",
          "text": "Would be even shittier since you’d probably still pay the same fees for just online classes",
          "author": "WackQuack420",
          "created": 1586633766,
          "upvotes": 113,
          "replies": {
            "fn4fa2j": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4fa2j/",
              "text": "i stg we miss our senior year spring semester AND our fall semester of our college freshman year. that would 100% be the absolute shittiest thing to happen. Period.",
              "author": "S-tuFFs",
              "created": 1586640191,
              "upvotes": 68,
              "replies": {
                "fn4h5t0": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4h5t0/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1586641295,
                  "upvotes": -19,
                  "replies": {
                    "fn4htai": {
                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4htai/",
                      "text": "Lol the US is already looking at opening stuff back up by May 1st. Federal social distancing guidelines will most likely not be renewed past April 30th. Fall semester will definitely happen, country can’t be closed down any longer.",
                      "author": "Arbiter604",
                      "created": 1586641673,
                      "upvotes": 18,
                      "replies": {
                        "fn4iky0": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4iky0/",
                          "text": "In California, our shelter at home order was pushed forward till mid May with a high likelihood of it being extended further. Only if the federal government could force all states into a shelter at home order..",
                          "author": "Voldemort57",
                          "created": 1586642118,
                          "upvotes": 5,
                          "replies": {
                            "fn4ipqw": {
                              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4ipqw/",
                              "text": "What do you mean your last sentence? You want the federal gov to extend it nationwide?",
                              "author": "Arbiter604",
                              "created": 1586642197,
                              "upvotes": 1,
                              "replies": {
                                "fn4l7sa": {
                                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4l7sa/",
                                  "text": "The federal government should be handling the pandemic, instead of having states bidding against each other for supplies, and some states even ignoring recommendations to shut down businesses and isolate.",
                                  "author": "Voldemort57",
                                  "created": 1586643666,
                                  "upvotes": 10,
                                  "replies": {
                                    "fn4mri6": {
                                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4mri6/",
                                      "text": "Oh yea I agree with that 100%. It was very mismanaged",
                                      "author": "Arbiter604",
                                      "created": 1586644593,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "fn4m8ij": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4m8ij/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1586644285,
                          "upvotes": 1,
                          "replies": {
                            "fn4n0es": {
                              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4n0es/",
                              "text": "“Inside the White House, there is little expectation the federal guidelines on social distancing will be reissued as they currently stand when they expire on April 30, though officials close to the situation cautioned that could change.”\n\nhttps://www.cnn.com/2020/04/11/politics/donald-trump-coronavirus-economy-testing/index.html",
                              "author": "Arbiter604",
                              "created": 1586644731,
                              "upvotes": 5,
                              "replies": {
                                "fn4peme": {
                                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4peme/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1586646125,
                                  "upvotes": -2,
                                  "replies": {
                                    "fn4tzc5": {
                                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4tzc5/",
                                      "text": "The Whitehouse literally controls whether or not those guidelines I talked about are extended on a federal level? Wtf are you on ablut lmao. I’d much rather cite the President than your half baked opinions",
                                      "author": "Arbiter604",
                                      "created": 1586648928,
                                      "upvotes": 2,
                                      "replies": {
                                        "fn5rx2f": {
                                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5rx2f/",
                                          "text": "You can cite the President on something, and then 3 days later he claims he never said that, and then 1 week later he calls those that mention his denial as giving \"fake news\", and then 2 weeks later he goes back to the first stance he had in the first place, without any explanation\n\nThis pandemic wouldn't have been that huge of an issue if Trump hadn't disbanded the NSC's health security office, which was BUILT for stuff like this ([and which he has denied even knowing about](https://www.usatoday.com/story/news/world/2020/03/18/coronavirus-did-president-trumps-decision-disband-global-pandemic-office-hinder-response/5064881002/))\n\nHe gained my lack of trust before he was even elected. I don't know too much about politics and I wouldn't be able to tell you who I wanted instead of him, but even putting aside his hate of minorities (especially Mexicans ^(which includes me)), he simply can't be held accountable for his actions. And I don't find that an admirable quality in the effective leader of the free world. Do you?",
                                          "author": "DJ_Saidez",
                                          "created": 1586673809,
                                          "upvotes": 0,
                                          "replies": {
                                            "fn5v77y": {
                                              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5v77y/",
                                              "text": "Oh trust me I don’t like him much at all. Completely agree with what you said. But at the same time I don’t blindly hate him for every single action he takes like so many people do.",
                                              "author": "Arbiter604",
                                              "created": 1586677040,
                                              "upvotes": 2,
                                              "replies": {
                                                "fn5vc0b": {
                                                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5vc0b/",
                                                  "text": "My mistake, I had assumed you were an ignorant supporter, because that's how toxic and easily triggered I am...I'm really not helping the situation, am I?\n\nGood point",
                                                  "author": "DJ_Saidez",
                                                  "created": 1586677175,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "fn81kkw": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn81kkw/",
                          "text": "I'm willing to bet it won't open. This is just belief perservence and optimism fueling you. Ireland which has far less cases than the US are expected to open pubs back up in Winter. The Italian Football League is expected to open up around Janurary 2021, no one is expecting any sort of big groups and parties until the end of the year, let alone opening a college or university. I wish university could happen in fall, but this is such a false belief to carry and you are only going to get yourself disappointed.",
                          "author": "blacksaphir99",
                          "created": 1586731984,
                          "upvotes": 1,
                          "replies": {
                            "fn81y4m": {
                              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn81y4m/",
                              "text": "I understand your point but trust me, the attitude in the US by both the gov and the people is completely different from those countries you mentioned. The worlds largest economy doesn’t just shut down for a whole year. People here are already missing rent payments and struggling to buy food and it’s been about a month.",
                              "author": "Arbiter604",
                              "created": 1586732203,
                              "upvotes": 1,
                              "replies": {
                                "fn9p1dl": {
                                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn9p1dl/",
                                  "text": "One the universities main source of income is international students. And these international students will not be able to come if COVID-19 is still a problem, therefore most universities will find it difficult to run, and would opt for online courses for a cost effective option, and to retain those international students going elsewhere. If this pandemic continues till September, I doubt univeristy will start again until we have successfully contained it? Who knows this might happen earlier than we expect, but the way things are now, September looks unlikely. You know what would hurt your economy more, if you open up everything too soon, the second wave will hit you just as hard as the first. I just hope there's more green around the corner, but the way politicians are talking about it and giving us no clear date or they keep extending the deadlines, they know it's going to be a while, and they are afraid if we know this, we will riot.",
                                  "author": "blacksaphir99",
                                  "created": 1586780724,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fn4jh13": {
                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4jh13/",
                      "text": "i find this hard to believe. not questioning the company you work for, just personally with what info i’ve heard. most places seem to be peaking within the next 4-6 weeks, and assuming the come down is as fast as the come up, we should be mostly fine by august. that’s my personal timeline, and I hope that’s true because I REALLY want to start college in person lol. I don’t think those individuals r gonna shape the course for an entire university as majority i believe have followed the social distancing orders, but then again it only takes a few people to fuck everything up.",
                      "author": "S-tuFFs",
                      "created": 1586642637,
                      "upvotes": 8,
                      "replies": {
                        "fn4noie": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4noie/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1586645108,
                          "upvotes": -5,
                          "replies": {
                            "fn4smeo": {
                              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4smeo/",
                              "text": "ok i legit don’t no if this guy has no clue what he’s talking about or if he’s just trolling. covid19.healthdata.org is the website a lot of people r referencing for peak days. sites and organizations are reporting that TOMORROW, SUNDAY, is going to be the peak amount of deaths in the US. However, since that is not indicative of the full situation, i gave it an extra 4-6 weeks (personal judgment) before things fully start to die down. according to that website, conditions should be back to how they were at the start of march during the first week of june. buddy cmon.",
                              "author": "S-tuFFs",
                              "created": 1586648078,
                              "upvotes": 4,
                              "replies": {
                                "fn4uhik": {
                                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4uhik/",
                                  "text": "That model is fucked.",
                                  "author": "fatkidlolz",
                                  "created": 1586649242,
                                  "upvotes": -1,
                                  "replies": {
                                    "fn4v2os": {
                                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4v2os/",
                                      "text": "what other models are you looking at? i’m just wondering and trying to gather more info",
                                      "author": "S-tuFFs",
                                      "created": 1586649612,
                                      "upvotes": 1,
                                      "replies": {
                                        "fn4v6jm": {
                                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4v6jm/",
                                          "text": "I'm trying to look at as many as possible and individual state data to compare it to. My problem with that modem is it was just adjusted to be lowered and almost every state is well above the predicted levels.",
                                          "author": "fatkidlolz",
                                          "created": 1586649680,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "fn51kuh": {
                              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn51kuh/",
                              "text": "What are you on lmao",
                              "author": "rpm3c",
                              "created": 1586653755,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fn59ipe": {
                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn59ipe/",
                      "text": "Sorry everybody downvoted you, this is useful info to know, as sad as it is. I’m hopeful but at the same time I know that people are starting get restless, extending this thing even longer :(",
                      "author": "AntivaxxersGonnaDie",
                      "created": 1586659200,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fn4iebt": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4iebt/",
          "text": "This is the only thing I'm worried about. Missing prom and other stuff I don't mind cause wasn't gonna go anyways. But it's just weird to not be able to attend the first day",
          "author": "Ifyoucantexplainit",
          "created": 1586642014,
          "upvotes": 14,
          "replies": {}
        },
        "fn4joqt": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4joqt/",
          "text": "What would suck, but on a certain level it’s better than having to be torn away from college. Either way I don’t think that that will happen.",
          "author": "Johngrindal",
          "created": 1586642762,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fn3yj2n": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3yj2n/",
      "text": "[deleted]",
      "author": null,
      "created": 1586630442,
      "upvotes": 470,
      "replies": {
        "fn3ykv2": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3ykv2/",
          "text": "this is very true",
          "author": "hazardmilk",
          "created": 1586630471,
          "upvotes": 148,
          "replies": {}
        },
        "fn45637": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn45637/",
          "text": "Yeah could you explain this? I've seen this being said a lot and don't really understand why.",
          "author": "US3TEHF0rks",
          "created": 1586634274,
          "upvotes": 78,
          "replies": {
            "fn46ijh": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn46ijh/",
              "text": "A lot of accepted International Students would not be able to attend due to Quarantine and Visa and Passport issues. A lot of parents (mine included) also feel uncomfortable sending their children to the US and are looking for ways to defer admissions to the Spring Semester.\n\nLastly, the prevalent expectation is that school will not open in September. Covid is yet to peak in US and it's a very real possibility that Fall 2020 classes will be held online. And a lot of students will also look to defer because let's be honest, no one wants to start University online.\n\n\nAll these factors will likely lead to a lot of people rejecting acceptances or asking for deferrals, which means waitlist acceptances would increase\n\n\nEdit: As a lot of people have pointed out, Dr. Fauci has stated that he expects the virus to die down by summer. This would mean that schools would likely be open in fall. Obviously, he is an expert and it'll be great for everybody for this virus to disappear as soon as possible, but in my humble opinion, I believe he is being extremely optimistic. Conservatively speaking, I personally (and again, I may be wrong) don't see schools opening in September. \n\nI would say expect the worst. That way, you can be pleasantly surprised instead of hoping for the best and being disappointed.",
              "author": "ShantanuPSinha",
              "created": 1586635055,
              "upvotes": 262,
              "replies": {
                "fn4akq6": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4akq6/",
                  "text": "I sincerely do not want to start Uni online, you’re right",
                  "author": "iseekkarmaa",
                  "created": 1586637429,
                  "upvotes": 90,
                  "replies": {
                    "fn4wvzp": {
                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4wvzp/",
                      "text": "Ha\n\nHa\n\nHa",
                      "author": "lifeismeanttodie",
                      "created": 1586650745,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                },
                "fn4k7du": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4k7du/",
                  "text": "> Covid is yet to peak in US and it's a very real possibility that Fall 2020 classes will be held online.\n\nI've seen projections and heard Dr. Anthony Fauci say that it's likely that by September we'd at a point of semi-normality. While we'd still need to take extra precautions, and there'd be alternating periods of lifting and imposing restrictions, there's a good chance that Fall 2020 won't necessarily be online. So I wouldn't bank on (or use such strong language as \"prevalent expectation\" or \"real possibility\" in reference to) school being online or enrolment decisions being severely affected.",
                  "author": "JustSkipThatQuestion",
                  "created": 1586643062,
                  "upvotes": 52,
                  "replies": {}
                },
                "fn47kwn": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn47kwn/",
                  "text": "Ah, thank you for such an in-depth answer!",
                  "author": "US3TEHF0rks",
                  "created": 1586635677,
                  "upvotes": 20,
                  "replies": {}
                },
                "fn4od10": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4od10/",
                  "text": "Do you think most colleges will allow students to defer for the next semester? I already committed  and made my deposit to a school but I dont want to begin college online",
                  "author": "Santiago1106",
                  "created": 1586645514,
                  "upvotes": 8,
                  "replies": {}
                },
                "fn58uth": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn58uth/",
                  "text": "hasn’t fauci said we are peaking like, this week and he’s anticipating a fairly normal summer? lots of univ of washington models predict that it will be pretty much done by june too. fauci also said that he fully anticipates schools to open in the fall.",
                  "author": "kamba246",
                  "created": 1586658739,
                  "upvotes": 6,
                  "replies": {}
                },
                "fn4w1cy": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4w1cy/",
                  "text": "It’s supposed to peak for Los Angeles county this week and next week",
                  "author": null,
                  "created": 1586650206,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fn44w9a": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44w9a/",
          "text": "What’s the reasoning behind this?",
          "author": "01AboveAll",
          "created": 1586634117,
          "upvotes": 33,
          "replies": {}
        },
        "fn4h7u4": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4h7u4/",
          "text": "Theoretically it would be true but if you look more closely at the numbers it seems that colleges have adjusted to it in acceptance rates. \n\nTake a school like brown: The international population of the incoming class is typically 140 students. However this year they increased their acceptance rate by .3%. By doing some math they accepted around 135 extra students to compensate for the expected drop in international attendance. \n\nOr Dartmouth which increased their RD acceptance rate by 1.1% which allowed for another 150 students to be offered admission. They’re international population per class is around ~120. \n\nAlso more people are going to get waitlisted this year because we just don’t know what’s going to happen. Yes more people may get pulled from the waitlist but the rate can stay the same because they increased the waitlist offers.",
          "author": "anonymoususer762",
          "created": 1586641328,
          "upvotes": 21,
          "replies": {}
        },
        "fn4foeo": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4foeo/",
          "text": "in my opinion that doesn’t make up for the situation we are in",
          "author": "supremeboxlogoz",
          "created": 1586640428,
          "upvotes": 7,
          "replies": {
            "fn4gg0j": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4gg0j/",
              "text": "[deleted]",
              "author": null,
              "created": 1586640876,
              "upvotes": 19,
              "replies": {
                "fn4h5xj": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4h5xj/",
                  "text": "well i’m sure there are many people who aren’t on a wait list or aren’t even depending on their wait lists right now",
                  "author": "supremeboxlogoz",
                  "created": 1586641297,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fn4yhc3": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4yhc3/",
          "text": "Too bad I got outright rejected from my top three choices and accepted everywhere else. :(",
          "author": null,
          "created": 1586651754,
          "upvotes": 4,
          "replies": {}
        },
        "fn45w6v": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn45w6v/",
          "text": "Not really. Colleges probably waitlisted more people due to the circumstances and even if they take more people off the waitlist the percentage of accepted would remain the same. Also it’s kind of a bummer to get off of a waitlist only to have to start college online and miss all the cool stuff in the beginning. :/",
          "author": "budgie1202",
          "created": 1586634693,
          "upvotes": 7,
          "replies": {
            "fn4f88w": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4f88w/",
              "text": "But the circumstances didn't take place until after decisions, also why would they waitlist more people because of Corona???",
              "author": "Panvictorcakes",
              "created": 1586640161,
              "upvotes": 5,
              "replies": {
                "fn4gr4h": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4gr4h/",
                  "text": "If they know they’re going to need to pull more people off of the waitlist, they’re definitely going to waitlist more. The virus actually started in December 2019 and although it didn’t get serious or was downplayed by the media until mid-feb, most colleges had not yet finalized decisions.",
                  "author": "budgie1202",
                  "created": 1586641058,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "fn44nlr": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44nlr/",
          "text": "Why?",
          "author": null,
          "created": 1586633977,
          "upvotes": 4,
          "replies": {}
        },
        "fn5mvxj": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5mvxj/",
          "text": "Although at some of the T20 schools, the waitlist really is just a courtesy",
          "author": "Cambamarooneyiizuka",
          "created": 1586669309,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fn44xhd": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44xhd/",
      "text": "Imagine ur last graduation having been your elementary school one xD",
      "author": "mocha_latte7",
      "created": 1586634136,
      "upvotes": 65,
      "replies": {
        "fn50ylg": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn50ylg/",
          "text": "[deleted]",
          "author": null,
          "created": 1586653357,
          "upvotes": 30,
          "replies": {
            "fn5179s": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5179s/",
              "text": "Lol we didn't have a middle school graduation",
              "author": "mocha_latte7",
              "created": 1586653514,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "fn3cyti": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3cyti/",
      "text": "I feel you. I’ve had a terrible attitude regarding coronavirus and I need to turn it around and stop being so negative, but I do too feel like we’ve been cheated, and I saved all fun events for senior spring and now am going to leave HS without having made the connections w my friends that I’d hoped. But there’s nothing we can do, and speaking for myself I’m in a privileged position in that I don’t have corona, have food to eat and a roof over my head. But still.....I get where you’re coming from 10000%",
      "author": null,
      "created": 1586618155,
      "upvotes": 332,
      "replies": {
        "fn495br": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn495br/",
          "text": "I didnt go to junior prom because it was expensive, so I saved it for senior year. I just wanted to have my classic teenage princess moment :(",
          "author": "Tenebrose",
          "created": 1586636592,
          "upvotes": 42,
          "replies": {
            "fn4f07t": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4f07t/",
              "text": "Me too! I was going to go but decided to go home after dinner at the last minute, thinking I'd just go next year...rip",
              "author": "citieskylines",
              "created": 1586640032,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "fn3dfkn": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3dfkn/",
          "text": "also i feel like people are trying to minimize this because of the big picture, and nobody is saying that this is the biggest concern, but we’re losing A LOT, like we worked our entire lives for this and in any other context this would be a huge deal. there are clearly more important things but we’re losing a lot here and it still matters",
          "author": "hazardmilk",
          "created": 1586618441,
          "upvotes": 140,
          "replies": {
            "fn3e0lg": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3e0lg/",
              "text": "I agree!!!! My school has not made an effort to make up for everything we’re losing and it rly annoys me. And corona cancellations also affect seniors’ mental health as well which I feel like no one realizes. What makes me the most upset is that I literally did not go to a single homecoming, pep rally, party etc bc of work and extracurriculars (which in retrospect was a dumb idea but I was in a very intense mindset lol) and now I feel like I’m not going to leave HS having any super close friends. I’d planned on hanging out w ppl a lot during senior spring and making up for everything I’d missed before. Now w corona I feel like a clown for not taking advantage of all the earlier social opportunities and I’m mad at myself for not having a biiit more fun. Even after I got into college early in December I still made myself grind until after spring break in April. Ugh :( glad to know there’s someone else who gets my vibe haha",
              "author": null,
              "created": 1586618795,
              "upvotes": 70,
              "replies": {
                "fn43qe9": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn43qe9/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1586633443,
                  "upvotes": 18,
                  "replies": {
                    "fn4e7xx": {
                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4e7xx/",
                      "text": "Tehe I made this reddit specifically for college apps and am too lazy to log out",
                      "author": null,
                      "created": 1586639566,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fn3x047": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3x047/",
          "text": "yeah literally me, I worked my ass off for most of high school and was planning on doing all the fun stuff this semester... rip",
          "author": "kingboo9911",
          "created": 1586629574,
          "upvotes": 18,
          "replies": {}
        },
        "fn4065a": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4065a/",
          "text": "I totally agree, but all I can say is we gotta make the most of this. I’ve just been dming people I didn’t talk to much, but wanted to talk to more. Normally (like so far everyone), they are completely open to talk and while it sucks that we can’t do it irl. Just gotta find some other method, tho ngl my mental health has deteriorated DRAMATICALLY since COVID came in.",
          "author": "leokek",
          "created": 1586631382,
          "upvotes": 13,
          "replies": {}
        },
        "fn3d7dc": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3d7dc/",
          "text": "thank you, that’s exactly how i feel!! on a logistical level, i understand that this needs to be done and i’m grateful that my biggest problem is my senior year being cancelled and not my health. but we still lost our senior year and it sucks!",
          "author": "hazardmilk",
          "created": 1586618301,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "fn4iisq": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4iisq/",
      "text": "Feel so bad for all you high school seniors. I just went through the blood, sweat, and tears of 5 years of engineering. Sacrificed years worth of parties, events, etc. And had my graduation cancelled as well. So heartbreaking.",
      "author": "TheOriginalNo2",
      "created": 1586642085,
      "upvotes": 37,
      "replies": {}
    },
    "fn3zqg1": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3zqg1/",
      "text": "I came in with the expectation senior year was never gonna be fun in the first place and even then I still got cheated",
      "author": "xXGunner989Xx",
      "created": 1586631131,
      "upvotes": 61,
      "replies": {}
    },
    "fn4ae7j": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4ae7j/",
      "text": "Yeah dude, I feel you. For like the past 3 years it’s all just been preparing for SATs, ACTs APs, PSATs, researching colleges, visiting colleges, etc etc. I had everything planned out for second semester: our prank, formal, graduation, and even summer activities with friends before we all went separate ways. For the first few weeks I could actually feel a weight lifted off my shoulders. And then this whole pandemic thing happened. I guess it was too good to be true\n\nSorry for the rant",
      "author": "pensative-egg",
      "created": 1586637324,
      "upvotes": 28,
      "replies": {
        "fn5sd1a": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5sd1a/",
          "text": "No need to apologize, this whole situation is extremely unfair, and you deserved all those activities",
          "author": "DJ_Saidez",
          "created": 1586674237,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fn3wpkj": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3wpkj/",
      "text": "It izzzz what it izzzz. Am I disappointed? Fuck Yee I am but not like we can do anything about it. Our class always gets fucked over. While the class of ‘19 always got lucky. At the end of the day it is what it is",
      "author": "RapiDMillionairE",
      "created": 1586629406,
      "upvotes": 85,
      "replies": {
        "fn46xxr": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn46xxr/",
          "text": "I feel this, and I'm not even in America",
          "author": "69yoan69",
          "created": 1586635302,
          "upvotes": 11,
          "replies": {}
        },
        "fn4p5kq": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4p5kq/",
          "text": "This summed it up perfectly , my school officially got closed till the end of the year and this made me think a lot better about the situation",
          "author": "stayinschoolchirren",
          "created": 1586645974,
          "upvotes": 6,
          "replies": {
            "fn4q0zv": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4q0zv/",
              "text": "Glad I could help lmao",
              "author": "RapiDMillionairE",
              "created": 1586646505,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fn49niq": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn49niq/",
          "text": "Same with ours lol.",
          "author": "Natalie_vel",
          "created": 1586636890,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fn45jny": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn45jny/",
      "text": "People need to calm down and stop hating on OP. It’s really not that serious. I know you guys think OP should just “grow up” or whatever but he’s already admitted that he’s grateful for what he has and that he just wants a bit more, and that’s completely fine. Everyone has the right to their own opinions and feelings. The reality is that you guys should grow up by not hating on OP and keeping your negative comments to yourself. It’s “really” not that serious to hate on OP. He’s sharing his thoughts and that’s completely fine. Not to say that I personally agree or disagree, but just be a little more cautious and chill. As I said, it’s really not that serious to be hating, we need to grow up and be more mature.",
      "author": "BeSmoothBro",
      "created": 1586634492,
      "upvotes": 59,
      "replies": {
        "fn45xd8": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn45xd8/",
          "text": "thank you. also i’m a girl lol but thank u for saying all of this",
          "author": "hazardmilk",
          "created": 1586634713,
          "upvotes": 18,
          "replies": {
            "fn46f29": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn46f29/",
              "text": "Lol my bad, hope the point still gets across tho 👍🏼",
              "author": "BeSmoothBro",
              "created": 1586634999,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "fn4c7o7": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4c7o7/",
      "text": "[deleted]",
      "author": null,
      "created": 1586638384,
      "upvotes": 31,
      "replies": {
        "fn53gdo": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn53gdo/",
          "text": "This is exactly what I needed to hear. Thank you",
          "author": "Darth_Kronis",
          "created": 1586655016,
          "upvotes": 2,
          "replies": {}
        },
        "fn5tsmk": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5tsmk/",
          "text": "This made me want to hug something nice and tight and tearfully tell it that everything is gonna be OK. Where are my siblings, I'm gonna go hug them...\n\nI don't know how to express it, but your comment....everyone should see this. You are so right. I admire you and how you've persevered through all these hardships. I can relate, to a much lesser extent (I have autism and a chronic stutter, bio-father left the picture as a toddler, and my mom and I essentially squatted all around the CDMX area fighting for survival and trying to make ends meet for 3 years before risking everything and crossing the border into the U.S., and I've reached the point where I was accepted to take summer courses at UCLA, which were cancelled). I wanted to say that \"I'm surprised you don't have more upvotes\" or \"if I could give you an award I would\", but that seemed too superficial to me. Too quick and easy. This was deep. This was genuine. This doesn't deserve that kind of disrespect. And I don't know how to properly respond to this. I'm young, I was born and raised into the era of technology, the era of social media, the era of likes and reposts and followers and instant gratification and competitions for attention. And so I'm innately better at superficial recognition typical of generic attention-seeking posts and promoting this kind of behavior instead of dealing with thought-provoking material that actually matters, and I hate that that defines my generation. I applaud you, and I wish the best for all of you, considering the circumstances. You all deserved those rewarding experiences, and I fully agree with your message to not bottle your emotions in. In times like this, that can be more dangerous and damaging than the virus itself. Now more than ever, we need to take care of ourselves and be there for each other, because while our exact circumstances may vary widely, while some (such as myself) are much more well off than others, we all are dealing with emotions and feelings that are legitimate and cannot be ignored or denied. More people need to see this. Thank you so much for sharing this.",
          "author": "DJ_Saidez",
          "created": 1586675630,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fn4f3de": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4f3de/",
      "text": "At my school barely any of the seniors went to prom last year because we were like “oh I’ll just go next year, it’s senior prom that really matters” 🤡🤡",
      "author": "officialkodos",
      "created": 1586640082,
      "upvotes": 19,
      "replies": {}
    },
    "fn49uhr": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn49uhr/",
      "text": "If a lot of students take a gap freshman year, acceptance rates next year will be terrible given they owe spots to this year's kids.",
      "author": null,
      "created": 1586637000,
      "upvotes": 8,
      "replies": {
        "fn5o4d8": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5o4d8/",
          "text": "As a junior, I’m happy that prom is still on for us but god damn... we‘re about to be slaughtered by these international students",
          "author": "throw_away0120",
          "created": 1586670349,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fn46ziw": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn46ziw/",
      "text": "It does suck. But hopefully things are normal enough by the time you start freshman year at college that you’re in person and you just live it up then. Honestly, college can be way more fun than high school for most people. And as the years pass by, other memories become just as or more important than things like senior year. It’s an unfortunate situation, but use it as motivation to branch out, make friends, take advantage of activities and opportunities when you do get to college.",
      "author": "niftygeeky",
      "created": 1586635327,
      "upvotes": 9,
      "replies": {}
    },
    "fn48kyl": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn48kyl/",
      "text": "No upper/underclassmen even understand how much this sucks because they aren’t the ones who had literally EVERYTHING coming around the corner for it all to be cancelled overnight.  We just fucking became second semester seniors which was supposed to be the best time in our entire education and get rewarded for all the good things that we’ve done for the past 4 years while we shut the fuck up and watched everyone else get to experience seniority.  Fuck this shit",
      "author": "_eatingstars",
      "created": 1586636262,
      "upvotes": 25,
      "replies": {}
    },
    "fn420da": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn420da/",
      "text": "i feel you...",
      "author": "sniperzwulf",
      "created": 1586632445,
      "upvotes": 7,
      "replies": {}
    },
    "fn4qc4k": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4qc4k/",
      "text": "I cant imagine what this must feel like. I graduated HS a while ago, it was a great experience, and I feel for the seniors this year.  My cousin wrote a poem about this. She is a senior this year, but I thought she gave a good perspective on this situation. \n\nhttps://www.deseret.com/opinion/2020/4/6/21209649/coronavirus-high-school-graduation-stay-at-home-pandemic\n\nGood luck, and I hope you get to have these senior experiences after all is done.",
      "author": "braxton303",
      "created": 1586646694,
      "upvotes": 8,
      "replies": {
        "fn5ugf3": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5ugf3/",
          "text": "That was touching...",
          "author": "DJ_Saidez",
          "created": 1586676289,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fn42b87": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn42b87/",
      "text": "bru",
      "author": "theabhster",
      "created": 1586632620,
      "upvotes": 7,
      "replies": {}
    },
    "fn4qii0": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4qii0/",
      "text": "Eh im just pisses my summer plans with my friends are ruined",
      "author": "RonKosova",
      "created": 1586646800,
      "upvotes": 7,
      "replies": {}
    },
    "fn426gv": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn426gv/",
      "text": "those bastards lied to me",
      "author": "uncletomzcab",
      "created": 1586632543,
      "upvotes": 11,
      "replies": {
        "fn4609t": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4609t/",
          "text": "lmao",
          "author": "water_bottle12345",
          "created": 1586634760,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fn4b15t": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4b15t/",
      "text": "I fully relate, but I’m a transfer. I graduated high school early and went to homecoming once during freshman year and no other school functions. Because I had the goal of graduating early, going to a CC, then transferring by 18. My community college graduation was going to be my time to finally shine. Plus this semester I kind of had the same things going on as a high school senior, finally being able to chill with friends, having a finally solid friend group, parties, etc. all that was ripped away and it kind of hurts more because I’m not getting to celebrate it for the second time in a row. \n\nYou absolutely have the right to feel the way you do.",
      "author": "Dovey2501",
      "created": 1586637696,
      "upvotes": 5,
      "replies": {
        "fn5uala": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5uala/",
          "text": "This is kinda unrelated but, you graduated at 16? That's impressive!\n\nAnd yes, I agree with that",
          "author": "DJ_Saidez",
          "created": 1586676127,
          "upvotes": 1,
          "replies": {
            "fn7xsjh": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn7xsjh/",
              "text": "Yeah I did, thanks! Fingers crossed they hold some sort of event for all seniors/graduating classes after this situation goes away perhaps.",
              "author": "Dovey2501",
              "created": 1586729783,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fn4exz8": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4exz8/",
      "text": "I feel you!! I was so sad since I kept telling myself I would have so much fun second semester and I would finally have the time to do all of the senior year things. Then this happened and second semester never came :( on the bright side, it’s been nice to just relax.",
      "author": "happysupersushi",
      "created": 1586639996,
      "upvotes": 4,
      "replies": {}
    },
    "fn45n6i": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn45n6i/",
      "text": "nothing makes this scenario worse than the stupid fucking memes I see that are like \"haha post pics that the class of 2020 wouldn't understand\" and it's like pictures of grad caps and diplomas and whatever the fuck else like sure I get it it can be a funny joke but when I'm finally proud of myself for fucking doing something and not only does it get ripped away from me but I GET MADE FUN OF FOR IT makes my blood boil and I hate all of this. what makes it even worse is when the people posting it are also people that graduated last year or will graduate next year like wow you really couldn't give less of a shit about us could you",
      "author": "JYFNHG",
      "created": 1586634549,
      "upvotes": 16,
      "replies": {
        "fn5ujga": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5ujga/",
          "text": "Either A) This is their coping mechanism and they're trying to laugh away their worries\n\nor B) They're either vile or simply ~~stupid~~ ignorant. Much of our generation is notorious for that, and I feel sorry for that\n\nNot ruling out a C, I'd like to hear it",
          "author": "DJ_Saidez",
          "created": 1586676376,
          "upvotes": 2,
          "replies": {
            "fn5us9s": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5us9s/",
              "text": "I genuinely hope it's A but my heart and experience with the world know it's probably B and that's what stings the most.",
              "author": "JYFNHG",
              "created": 1586676624,
              "upvotes": 2,
              "replies": {
                "fn5uxrx": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5uxrx/",
                  "text": "I feel you, it's tragic\n\nAnd I play along and partake in this exact same behavior in other topics and contexts, even though stuff like this can definitely happen and I rarely think about it\n\nWhat have I become",
                  "author": "DJ_Saidez",
                  "created": 1586676778,
                  "upvotes": 1,
                  "replies": {
                    "fn5v7al": {
                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5v7al/",
                      "text": "I mean, I can't imagine you've \"become\" anything too bad if you're recognizing that this behavior is kinda fucked up. Let me tell you that doing shit just because you see other people doing it is so common. I can't even begin to tell you how many dumb things I've seen and heard simply because people see one person do it and then decide it's something they can do too. it's not always out of malice. sometimes, it's just being dumb and not realizing in the moment what you're doing.",
                      "author": "JYFNHG",
                      "created": 1586677043,
                      "upvotes": 1,
                      "replies": {
                        "fn5vn1o": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5vn1o/",
                          "text": "Honestly, that's so relatable, I do that all the time\n\nI take a slightly unhealthy pride in being above average in several concepts, and I thought I was above this kind of behavior that stereotypes us, but I've realized I'm more like them than I think. And that it's not right to look down on others like this, for several reasons. I'm human, after all. ~~^((unless being a semi-furry makes me non-human)~~~~)~~ And I'm young, I'm learning. And monkey see, monkey do.",
                          "author": "DJ_Saidez",
                          "created": 1586677487,
                          "upvotes": 1,
                          "replies": {
                            "fn5vttc": {
                              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5vttc/",
                              "text": "it's good that you're learning though. its amazing actually because I've come to discover that not a lot of people my age have the mental awareness to understand mistakes and behavior such as this. understand that if you continue to see your behaviors in the way you do now, recognize that you're doing something you maybe shouldn't, and stop yourself, it'll get much easier to continue to do that. I'm so very grateful that you know what you're doing and even to an extent understand why because that's the start to stopping that behavior.",
                              "author": "JYFNHG",
                              "created": 1586677678,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fn4h2y4": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4h2y4/",
      "text": "Yea I'm pissed i wanted to end senior year with some normalcy....\n\nIdk there ain't nothing we can do tho although it would be nice if people stayed indoors in order to mitigate the spread of the virus.",
      "author": "hughlyhuge",
      "created": 1586641250,
      "upvotes": 3,
      "replies": {}
    },
    "fn4m7yk": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4m7yk/",
      "text": "I feel this :( missing Spring sports hurts the most.",
      "author": "Xrt3",
      "created": 1586644276,
      "upvotes": 5,
      "replies": {}
    },
    "fn5w5ru": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5w5ru/",
      "text": "I feel you.  This entire thing sucks. I had just bought my prom dress the day before everything went to shit. Right before everyone went into this mass hysteria.  This entire situation has me falling back into a depression that I went through not even a year ago.  I fought my entire junior year through court visits to press charges after being sexually abused my sophomore year. I was sure that this year was going to be my redemption year. That after all the pain and suffering my family went through, that we were on the path to healing.  \n\nThe beginning of senior year was ironic and crazy. We had a fire drill every Tuesday or  Thursday and a power outage every Wednesday or Friday. Sometimes we had both on the same day. That was our first six weeks. Thought it was hilarious how cursed our class was. That the school would fall apart after our class graduated.Haha. \n\nWe had it all. But now we are all stuck at home. Bored out of my mind. I, a procrastinator, am so bored that I finish my work days before it is due. Then I sleep and cry. I know that what is happening today is horrible and scary. That people are dying. I don’t like feeling sorry for myself. But I can’t help it. \n\nI was so excited to go to my first and last high-school dance. I would have my first dance with my bf. Just the fact that I would be able to experience prom with my best friends. We even had plans to hit up Taco Bell afterwards since we are all too poor to want to go anywhere else. To walk the stage and see my family and friends there. \n\nAfter graduation I was supposed to spend a year in Japan (While taking online classes) with my father. I was looking forward to hiking Mt.Fuji, visiting shrines/ temples, going to the clear white sandy beaches, experience an entirely different culture, bullet trains, and most of all the cherry blossoms. I was born in Okinawa but we left before I was 4 and I wanted to go back to see Japan since I hear it’s so lovely. \n\nI’m sorry I just whined about all my first world problems. But I really don’t care. It just feels good to get this off my chest so I can focus on scholarships and trying to find something to do so I don’t get sad every time someone mentions “senior year”. I hope everyone is holding up okay.  I’m sorry for all our losses, what ever that maybe be, and I hope the in the coming months we find ways to ease our minds.",
      "author": "OaxacaRana",
      "created": 1586678018,
      "upvotes": 4,
      "replies": {}
    },
    "fn4blxa": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4blxa/",
      "text": "I know how you feel. Although I’m happy to be less stressed about my schoolwork, I’m finding I lowkey miss school and I especially miss my classes and friends and extracurriculars.😔",
      "author": "eikeo",
      "created": 1586638033,
      "upvotes": 3,
      "replies": {}
    },
    "fn4cwok": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4cwok/",
      "text": "I mean they didn’t really lie to you tbf and like you said it was unexpected. I’m not in class of 2020 but it really sucks that you had to miss this. Think on the bright side though, someone in the comments said that waitlists were higher. Maybe long term things will end up better.",
      "author": "Epic-Gamer-69420",
      "created": 1586638790,
      "upvotes": 3,
      "replies": {}
    },
    "fn4gqfu": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4gqfu/",
      "text": "Nah man, the feelings are mutual don’t be ashamed. I’m glad at least some people are being mature about this. A few of my friends and co workers are acting like nothing is happening and are being totally ignorant to the situation at hand. Sure it sucks but it’s happening to everyone so like support each other? Idk has anyone else had any experiences with this?",
      "author": "ZorvaxEcho",
      "created": 1586641046,
      "upvotes": 3,
      "replies": {}
    },
    "fn4q8p1": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4q8p1/",
      "text": "it really sucks. i go to a boarding school, so i had to say goodbye to all of my friends that ive lived with for the past three years super suddenly, and i likely won't get to see most of them before we leave for college since they live all over the state. senior spring is a really big deal for my school since we live together and there's <100 in our class, so id worked hard all this time in anticipation of this payoff and a proper sendoff to my friends, teachers, and the school itself.\n\ni hear all of the people saying that high school doesn't matter later in life, but for me it was literally my home and my family for three years lol, so i think this disappointment will stay with me for a while :( but i feel guilty expressing it because of the larger scope of this situation",
      "author": "lalonro",
      "created": 1586646636,
      "upvotes": 3,
      "replies": {}
    },
    "fn4rthp": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4rthp/",
      "text": "This is so true fuck",
      "author": null,
      "created": 1586647588,
      "upvotes": 3,
      "replies": {}
    },
    "fn4w2jk": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4w2jk/",
      "text": "Honestly, I'm just worried about if we're even going to get to go to college this year.  I don't know about ya'll, but I'm sure as hell not paying upwards of 25,000 dollars to go to online classes.",
      "author": null,
      "created": 1586650227,
      "upvotes": 3,
      "replies": {}
    },
    "fn558dw": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn558dw/",
      "text": "I feel for all the seniors going through this. You're not being selfish for being pissed. You're allowed to feel this way, because it sucks. Senior year was the one year I finally felt like a teenager because I made friends and went to prom and actually enjoyed highschool. The years before had been difficult personally and graduation made me feel like I had really accomplished something, getting through all that. If that was taken away from me, I would have been devastated.",
      "author": null,
      "created": 1586656224,
      "upvotes": 3,
      "replies": {}
    },
    "fn5pgc5": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5pgc5/",
      "text": "The class of 2021 loves you and hopes that this is only a minor setback in the journey of your life. We’ve all lost things (I lost prom, summer program, work, etc) but I would be devastated to lose graduation. You 100% are justified in feeling sad about this. Your class has suffered a loss, and I hope things get better",
      "author": null,
      "created": 1586671523,
      "upvotes": 3,
      "replies": {}
    },
    "fn3yv5h": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3yv5h/",
      "text": "r/firstworldproblems",
      "author": "phymass",
      "created": 1586630635,
      "upvotes": 17,
      "replies": {
        "fn47yv3": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn47yv3/",
          "text": "people are allowed to be mad at what they like. rather than being patronizing, scroll on.",
          "author": "CornEater64",
          "created": 1586635905,
          "upvotes": 16,
          "replies": {}
        },
        "fn3z2mb": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3z2mb/",
          "text": "i agree lol",
          "author": "hazardmilk",
          "created": 1586630753,
          "upvotes": 23,
          "replies": {}
        }
      }
    },
    "fn48cbn": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn48cbn/",
      "text": "I’m kinda in the boat that what happens happens. Like yeah sports, prom, and even graduation being cancelled sucks, but I’m looking at the bright side of all this. I’ve had a “bucket list” of stuff to do around my house and for self-improvement and this quarantine is just what I needed. I feel like we’re gonna come out of this as better people tbh",
      "author": null,
      "created": 1586636124,
      "upvotes": 5,
      "replies": {
        "fn48eys": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn48eys/",
          "text": "100% agreed",
          "author": "hazardmilk",
          "created": 1586636166,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fn3xnm0": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3xnm0/",
      "text": "[deleted]",
      "author": null,
      "created": 1586629943,
      "upvotes": 9,
      "replies": {
        "fn3xyiq": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3xyiq/",
          "text": "damn ouch. obviously i know there are more important things and i’m privileged to be worrying about high school and not my health, but i still have the right to be upset wtf",
          "author": "hazardmilk",
          "created": 1586630116,
          "upvotes": 6,
          "replies": {}
        },
        "fn3z5af": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3z5af/",
          "text": "This isn't the suffering olympics, we have the right to be sad that everything we worked so hard for is being taken from us.",
          "author": "spacieaero",
          "created": 1586630794,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fn54aop": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn54aop/",
      "text": "For what it's worth, I'm older now and I don't know many people that give a damn about anything that happened in high school and the people that do aren't the sort of people you'd envy.",
      "author": null,
      "created": 1586655584,
      "upvotes": 2,
      "replies": {}
    },
    "fn56qo4": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn56qo4/",
      "text": "i feel this too hard. i was waiting for this year to have a fun true hs experience and it was taken away :((",
      "author": "ScreamingC0lors",
      "created": 1586657268,
      "upvotes": 2,
      "replies": {}
    },
    "fn57j06": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn57j06/",
      "text": "d r a m a t i c",
      "author": "RareLemons",
      "created": 1586657810,
      "upvotes": 2,
      "replies": {}
    },
    "fn5dcuc": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5dcuc/",
      "text": "I spent years waiting to do the school play. I was busy with other stuff, but I got everything together and finally had Time. I even got as close as the play got to the lead role(it was a collection of twilight zone vignettes, I was Rod Serling). I helped make the commercial, I helped plan out stuff, I made new friends, I was so excited. I worked hard, and got nowhere. And there's no anime conventions to really relax at. I've got a lot of emotional buildup and not a lot of release right now. I look forward to new opportunities at college, because that's all I can do.",
      "author": null,
      "created": 1586661931,
      "upvotes": 2,
      "replies": {}
    },
    "fn7zxyb": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn7zxyb/",
      "text": "You are completely entitled to feel the way that you're feeling, OP. I just wanted to pop on here and just say that I am so, so sorry that this happened to the world and that you have to lose such an important experience because of it. I am two years out of undergrad, but I would have been absolutely crushed if I had lost on the opportunity to walk at graduation/commencement. Wishing you all the very best.",
      "author": "nhanmunni",
      "created": 1586731032,
      "upvotes": 2,
      "replies": {}
    },
    "fn40s1u": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn40s1u/",
      "text": "A lie is knowing the truth and not sharing it. No one knew that this pandemic would take place. If we knew, we’d have all sold all of our stocks in January and hoarded toilet paper and hand sanitizer. \n\nNo one lied to you. I get that you’re disappointed - we all are. But people are dying, losing their livelihood, and are isolated from each other. Think about those things before you complain about senior awards getting cancelled.",
      "author": "bzss7x",
      "created": 1586631730,
      "upvotes": 15,
      "replies": {
        "fn44q8w": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44q8w/",
          "text": "I agree with you for the most part, but I disagree with the last point. It sounds like, “don’t complain about the minor problems affecting you when major problems are affecting others”. \n\nI’ll draw a parallel using this argument by applying it to extreme circumstances to see whether it maintains its validity: “African Americans in the north during the 1850’s shouldn’t care about experiencing discrimination because southern African-Americans in the 1850’s are experiencing slavery. Think about those things before you complain about experiencing discrimination”. Of course, this is going to sound like I am comparing senior award cancellation to racial discrimination, HOWEVER I am actually demonstrating how the idea that one should ignore comparatively minor issues because others experience major issues is a seriously flawed argument and should not be applied in our case.\n\nWe shouldn’t pretend like we’re the only ones with problems, yes, but we shouldn’t ignore our problems just because others are experiencing more hardship than us - we still have the right to be upset.",
          "author": "ContrabandParagon",
          "created": 1586634019,
          "upvotes": 23,
          "replies": {}
        },
        "fn45b0h": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn45b0h/",
          "text": "We have the right to be upset. Just because other people are going through worse things, that doesn’t mean we should just shut up about how we feel. This is a big fucking deal.",
          "author": "007Kryptonian",
          "created": 1586634352,
          "upvotes": 14,
          "replies": {}
        },
        "fn49vjn": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn49vjn/",
          "text": "@ the senators who knew in january and sold their stock privately, whilst telling everyone publicly that it was no big deal",
          "author": "petergarbanzobeans",
          "created": 1586637018,
          "upvotes": 6,
          "replies": {}
        },
        "fn41v9d": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn41v9d/",
          "text": "that’s a fair point. also i realize i’m privileged to have these problems and not worse ones, but that doesn’t affect my right to be sad",
          "author": "hazardmilk",
          "created": 1586632364,
          "upvotes": 9,
          "replies": {
            "fn452bu": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn452bu/",
              "text": "You have a right to be sad but to be loudly complaining about it when there’s actual people dying horrific deaths.  It comes off as immensely entitled.  “We deserve prom and a piece of paper blah blah blah”.  Meanwhile there’s people fighting for their right to LIVE.",
              "author": "throwawayacc293749",
              "created": 1586634214,
              "upvotes": -15,
              "replies": {
                "fn46cra": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn46cra/",
                  "text": "Then when CAN you complain? When all the kids in Africa gets their water? When all tyrannies are overthrown? When terrorism stops existing? Where is the point where complaining is allowed without sounding entitled.",
                  "author": "Fenc58531",
                  "created": 1586634962,
                  "upvotes": 15,
                  "replies": {
                    "fn46tz2": {
                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn46tz2/",
                      "text": "The thing is when people bring up starving kids in Africa it’s out of the blue whenever there’s any suffering.  The thing with this is that there’s a very obvious thing to compare it to.  Let’s put it this way: would you rather be in quarantine and miss out on prom/graduation/etc but save countless lives, or have it but potentially lose lots of people close to you on top of the thousands of other lives that would be lost?  It’s a no brainer",
                      "author": "throwawayacc293749",
                      "created": 1586635238,
                      "upvotes": -14,
                      "replies": {
                        "fn4a434": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4a434/",
                          "text": "You’re missing the point. Nobody wants to intentionally put people in danger of course but we can complain about how much it fucking sucks that we worked for 12 years to not even get prom or graduation or anything because of this stupid virus. There is absolutely nothing wrong with that and I’m sick of people acting like you can’t lament shit you’ve worked over a decade for because other people are having a worse time. Other people are always having a worse time. And that sucks. I’m sorry. But that doesn’t mean I can’t complain .",
                          "author": "007Kryptonian",
                          "created": 1586637157,
                          "upvotes": 10,
                          "replies": {}
                        },
                        "fn4cyav": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4cyav/",
                          "text": "Well that’s a strawman. People aren’t saying they deserve to have prom or graduation now, just that they have a right to complain about. Most people would want one but know that it is not the right call. But that doesn’t take away from someone’s right to say it is still unfair. And the “starving African children“ is a very good argument against people like you saying “people have it worse so you can’t complain” point. You still haven’t refuted it. There are still kids in Africa that have it worse than some patients, that will die of malnutrition and not even experience a life as long as yours. What gives you the right to complain about people suffering from the virus when one can say that the majority suffering are elderly that have lived long lives, or that a lot of resources are being diverted away?",
                          "author": "NiceAesthetics",
                          "created": 1586638817,
                          "upvotes": 5,
                          "replies": {
                            "fn4ecwt": {
                              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4ecwt/",
                              "text": "Damn, you’re spitting facts lol",
                              "author": "007Kryptonian",
                              "created": 1586639649,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fn4hnnv": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4hnnv/",
                  "text": "“Loudly” complaining? This is a meaningless post on the internet and honestly probably a healthy outlet instead of doing something irl... \n\nDon’t compare pain, there is always someone suffering more, that doesn’t invalidate feelings.",
                  "author": null,
                  "created": 1586641583,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "fn4dg6n": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4dg6n/",
          "text": "You sound like an awfully ignorant p.o.s. if you ask me. We know people are dying and falling ill and we’re all locked in our houses but the “other people have it worse than you” attitude is so closed-minded and neurotypical.\n\nI’m allowed to be sad that I poured my heart and soul and my sacrificed my mental health into school for 12 fucking years and am reaping 0% of the rewards. I’m going to be going five, six figures into debt in a couple months to go to online Zoom classes. Just because I don’t have the coronavirus myself doesn’t mean I’m not allowed to have problems.",
          "author": "NitronicFury",
          "created": 1586639109,
          "upvotes": 10,
          "replies": {}
        },
        "fn4i369": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4i369/",
          "text": "You could make that BS comparison about everything. Why were you enjoying your meal when kids in Africa are starving? Please stfu, OP can have his/her personal opinions without ur moral judgement",
          "author": "Arbiter604",
          "created": 1586641832,
          "upvotes": 3,
          "replies": {
            "fn4it6g": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4it6g/",
              "text": "Sorry if I offended you, but trying to intimidate me isn’t going to work.",
              "author": "bzss7x",
              "created": 1586642253,
              "upvotes": -5,
              "replies": {
                "fn4ivk3": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4ivk3/",
                  "text": "Lol why would I care about trying to intimidate you? You can have ur opinions",
                  "author": "Arbiter604",
                  "created": 1586642291,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fn5efjo": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5efjo/",
          "text": "now is not the time to hold a dick-measuring contest over who has it the worst in this covid-19 situation, we are all stressed by it in different ways\n\nas long as we are able to acknowledge that yes, people are dying, I really don't see a problem with someone venting over all of the idealized hs senior events being taken away from them",
          "author": "wheres-the-avocados",
          "created": 1586662715,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fn4n1zk": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4n1zk/",
      "text": "In many ways, the class of 21' might have it worse. They don't get to do the extra circulars that some relied on to boost their applications, they can't visit schools, and standardized testing is getting screwed up.",
      "author": "dbattack",
      "created": 1586644757,
      "upvotes": 4,
      "replies": {
        "fn4vrdd": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4vrdd/",
          "text": "My school doesn't have extracurriculars and I'm not just crying for the senior class but also the junior class (and even underclassmen who needed the practice).\n\nNeither got many weeks to showcase their abilities to scouts or develop ec's to add to their application. Let's not forget the Juniors who couldn't take the SAT or ACT and aren't applying to test-optional schools.\nI'm just hoping this is over next year and we don't have a repeat. \n\nI somewhat agree that we may have it worse but if University's stopped caring and adjust their requirements with this situation in mind, then maybe we might get the better end of the stick. Tbh, if anyone has it \"bad\", it's probably the seniors who haven't gotten their stuff together and only had this semester to get scouted.\n\nHonestly don't be ashamed to be angry or frustrated about an inconvenience due to this virus, because it sucks for everyone.\n\nEdit: The comment above brings up a good point.",
          "author": "N2O_Cobalt",
          "created": 1586650034,
          "upvotes": 3,
          "replies": {}
        },
        "fn4vlob": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4vlob/",
          "text": "i’m sure colleges will be understanding of that",
          "author": "yeetsandyams",
          "created": 1586649937,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fn4cmm1": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4cmm1/",
      "text": "C'mon people, there shouldn't be a need for OP to add an edit/explanation to his post :/",
      "author": "Bhawin-PewdsFan",
      "created": 1586638626,
      "upvotes": 2,
      "replies": {}
    },
    "fn47glw": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn47glw/",
      "text": "Yo, I feel that but what High School movie did you watch before spring this lol? Senior year isn't all fairy tales lol. I never said goodbye to my friend, I still talk to them. I come back every winter, spring, and summer break. What was awkward and shit was breaking up with your significant other, having to leave your school and so many other things.",
      "author": "lordsmobile6969",
      "created": 1586635606,
      "upvotes": 2,
      "replies": {}
    },
    "fn4iomq": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4iomq/",
      "text": "Not gonna lie, as someone who doesn’t show much school spirit or care to attend school events, quarantine greatly improved my senior year. Second semester classes are a joke, I have more time to play games with my friends, I can work on my hobbies, AP tests will be easier, and I can in general embrace senioritis with little to no repercussions.",
      "author": "ArkComet",
      "created": 1586642179,
      "upvotes": 2,
      "replies": {
        "fn4kw0d": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4kw0d/",
          "text": "Same here",
          "author": "Evasion-Official",
          "created": 1586643471,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fn4i7cf": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4i7cf/",
      "text": "If it makes you feel better, none of it will matter ever down the road. The speeches at graduation, the pictures, the accolades- nobody will mention it again and you’ll be judged forever by how well you do in college, in your internship, your house, your family, your vacations, your car, your career for the rest of your life. I get that you feel robbed of something that’s glowingly portrayed in teen movies, but peps who peak in high school will be just that. Take solace that you have your health and prepare yourself for the future. And get used to being lied to- when you see your investments fall a million points because nobody took care of the disruption in the supply chain or the Fed printing money- the government shirking its duty, your partner gambling your money, life can be full of disappointments, so here’s your first lesson, a rude awakening to the real world. If you’re smart and lucky, you’ll traverse the obstacles with little issue.",
      "author": "petitchat2",
      "created": 1586641900,
      "upvotes": 2,
      "replies": {
        "fn4ic4h": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4ic4h/",
          "text": "very true, life isn’t fair",
          "author": "hazardmilk",
          "created": 1586641978,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fn3b7i6": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3b7i6/",
      "text": "What's your solution? Cancel coronavirus?",
      "author": "LRFE",
      "created": 1586617070,
      "upvotes": -20,
      "replies": {
        "fn3bft0": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3bft0/",
          "text": "[removed]",
          "author": null,
          "created": 1586617213,
          "upvotes": 21,
          "replies": {
            "fn3wych": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3wych/",
              "text": "My county is looking into having graduation in July. Others might do the same.",
              "author": "Vikeah",
              "created": 1586629546,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fn3digl": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3digl/",
          "text": "He/she has a right to be upset. Chill.",
          "author": "CriticalGraveSerious",
          "created": 1586618489,
          "upvotes": 41,
          "replies": {
            "fn3e686": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3e686/",
              "text": "I was more addressing the fact that OP was implying that he wanted to somehow get the events running again",
              "author": "LRFE",
              "created": 1586618891,
              "upvotes": -25,
              "replies": {
                "fn3ehp4": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3ehp4/",
                  "text": "that’s not what i meant lol i’m just sad. saying we deserve everything isn’t the same thing as saying we should actually throw the events",
                  "author": "hazardmilk",
                  "created": 1586619083,
                  "upvotes": 28,
                  "replies": {}
                }
              }
            }
          }
        },
        "fn3z4gi": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn3z4gi/",
          "text": "lmaoooooo",
          "author": "MLGTommy47",
          "created": 1586630781,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fn44rjg": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44rjg/",
      "text": "It sucks but it is what it is",
      "author": null,
      "created": 1586634040,
      "upvotes": 1,
      "replies": {}
    },
    "fn5ihdu": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5ihdu/",
      "text": "I don’t really care lmao, HS sucked, I’m glad to have an extended summer",
      "author": null,
      "created": 1586665760,
      "upvotes": 1,
      "replies": {}
    },
    "fn42y2y": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn42y2y/",
      "text": "I literally have no idea what youre talking about. What opportunities are you missing out on second half of senior year? Prom? Walking across a stage to get a diploma? Stop pitying yourself bro",
      "author": "northernmostroasts",
      "created": 1586632992,
      "upvotes": -5,
      "replies": {}
    },
    "fn4cqs4": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4cqs4/",
      "text": "I don't get it. What are you whining about?",
      "author": "NeoLiberaI",
      "created": 1586638694,
      "upvotes": -3,
      "replies": {}
    },
    "fn44n0k": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44n0k/",
      "text": "It’s not the school’s fault. I get that it’s super sad for seniors and terrible that you have to miss out on events. But stop acting like the victim. Everyone is going through harsh things that are even worse than your situation like dying family members.",
      "author": "osotdktsotskt",
      "created": 1586633968,
      "upvotes": -3,
      "replies": {
        "fn44uq5": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44uq5/",
          "text": "i agree i’m not saying i have it worst at all, i’m privileged to have these problems and not worse. i think everyone should get to be sad tho lol",
          "author": "hazardmilk",
          "created": 1586634092,
          "upvotes": 5,
          "replies": {
            "fn7l3n8": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn7l3n8/",
              "text": "Your title of your post blames it on the school, as if it is their fault. Maybe choose your wording better",
              "author": "osotdktsotskt",
              "created": 1586722488,
              "upvotes": 0,
              "replies": {
                "fn7n4xr": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn7n4xr/",
                  "text": "I never mention the school. “they” is not referring to the school. And I’ve already said that there’s no one to blame.",
                  "author": "hazardmilk",
                  "created": 1586723649,
                  "upvotes": 1,
                  "replies": {
                    "fn82llk": {
                      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn82llk/",
                      "text": "Then who lied to you? In the rest of your post, you complained about how the school mentioned all these things so it led me to believe you meant the school.",
                      "author": "osotdktsotskt",
                      "created": 1586732586,
                      "upvotes": 1,
                      "replies": {
                        "fn82wek": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn82wek/",
                          "text": "i’m just saying that we are told by society growing up that these are the things that will come in our second semester of senior year so not getting them after being promised them our whole lives feels like we’re being lied to. lol also i also didn’t say that the school mentioned these things, it’s not like i expected a graduation because the school told me “you’re going to have a graduation” like it’s just an expectation we all have",
                          "author": "hazardmilk",
                          "created": 1586732764,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "fn82zgp": {
                          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn82zgp/",
                          "text": "i also just never said that the school said these things. i said “we were told” i literally don’t say anything about the school administration at all",
                          "author": "hazardmilk",
                          "created": 1586732813,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fn4vjgu": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4vjgu/",
          "text": "ah right i forgot we lose the right to complain and be sad when people have it worse than us as if we don’t already know. thank you so much, you are so helpful",
          "author": "yeetsandyams",
          "created": 1586649900,
          "upvotes": -1,
          "replies": {
            "fn54e51": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn54e51/",
              "text": "I’m not saying it to you, I’m saying it to the OP’s title of their post. The title is misleading",
              "author": "osotdktsotskt",
              "created": 1586655649,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fn41uj5": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn41uj5/",
      "text": "You're taking this way too seriously.",
      "author": "Lord_Thanos",
      "created": 1586632351,
      "upvotes": -18,
      "replies": {
        "fn421zj": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn421zj/",
          "text": "sorry, but i worked my ass off and took school itself extremely seriously. it’s understandable to be upset when i’ve put so much of myself into high school. if you don’t care thats cool, but personally i do.",
          "author": "hazardmilk",
          "created": 1586632471,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "fn4fuhk": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4fuhk/",
      "text": "To be fair, working your ass off in high school is a cake walk compared to the rest of your life. High school itself is easy. When you really work your ass off and have to provide for yourself and a family and be responsible to a career that is far more competitive than any high school AP class, you’ll understand what that really feels like. Honestly, it is a shitty situation, but life happens.",
      "author": "SumDaysAreGood",
      "created": 1586640526,
      "upvotes": -3,
      "replies": {}
    },
    "fn55tb0": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn55tb0/",
      "text": "HAHAHA YALL ARE SUCH SPOILED LITTLE ENTITLED BRATS.",
      "author": "cerebral-thunders",
      "created": 1586656624,
      "upvotes": -1,
      "replies": {
        "fn5jbcn": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn5jbcn/",
          "text": "LOL",
          "author": "moonlight2024",
          "created": 1586666406,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fn42plw": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn42plw/",
      "text": "Imma get a lot of hate for this one but how about you grow a pair for gods sake. You completed high school and you want a reward for it. This is  something that millions of people do every year. It’s not noteworthy, it’s not special, you’re walking across a stage for something that should be a baseline human duty. If you’re sad about prom or whatever i guess that one is more understandable, but even that is just a dance",
      "author": "Evasion-Official",
      "created": 1586632854,
      "upvotes": -17,
      "replies": {
        "fn431is": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn431is/",
          "text": "i don’t think i did anything special bro chill but it’s fair to want a graduation, which those millions of people receive every year, when i’ve put so much of myself into high school. for me, graduation was more important than prom. idk why it’s so crazy to care about that",
          "author": "hazardmilk",
          "created": 1586633047,
          "upvotes": 14,
          "replies": {
            "fn47rc5": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn47rc5/",
              "text": "I dont know maybe I’m just weird or sum. I worked my ass off in high school but it wasn’t for a graduation, it’s just a meaningless ceremony to me. I worked hard because that‘s how you become successful. I guess it’s fair to want a graduation, but the way you made your post just sounded really whiney when to me this is just a complete nonissue",
              "author": "Evasion-Official",
              "created": 1586635782,
              "upvotes": -8,
              "replies": {
                "fn485q9": {
                  "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn485q9/",
                  "text": "to me it’s not a non-issue, but i see where you’re coming from and i definitely sounded more obnoxious than i meant to. it’s also not seeing my hs friends again that bothers me more than graduation and prom, but i definitely cared about those too",
                  "author": "hazardmilk",
                  "created": 1586636017,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fn43dlk": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn43dlk/",
      "text": "Class of 2019 Master Race.",
      "author": "ThrowawyCO2019MR",
      "created": 1586633241,
      "upvotes": -6,
      "replies": {}
    },
    "fn58tb2": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn58tb2/",
      "text": "okay this is like really sad i know but can the seniors SHUT UP. like we get it we know, the juniors are fucked over too in terms college visits, college fairs, college counselor meetings, summer programs etc.",
      "author": "nanobot11",
      "created": 1586658710,
      "upvotes": -1,
      "replies": {
        "fn8ru9u": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn8ru9u/",
          "text": "Yeah, we’re just missing our prom, grad, stuff we’ve waited a long time for no biggie /s",
          "author": "stayinschoolchirren",
          "created": 1586748617,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fn4fic1": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4fic1/",
      "text": "You have the rest of your life to realize how meaningless high school is and was...life doesn’t even start for another half decade to decade. None of high school really matters. By finding out now, you’ve been given a blessing to realize how trivial all this is and what really matters in life will come a bit later anyway. Accept it and move on. There are far more important things than this.",
      "author": "SumDaysAreGood",
      "created": 1586640326,
      "upvotes": -4,
      "replies": {
        "fn6nzg4": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn6nzg4/",
          "text": "Yeah but that doesn’t really help the situation at hand. Several years down the road we’ll probably have this mindset and would agree with you, but right now in the moment it sucks. All we’ve known for the past 12 years is school and being told it would all pay off in the end, only to get the satisfaction of graduation and prom ripped away. It feels like this chapter of our lives isn’t being closed. Yes, it’s trivial in the long run, but for now it hurts and we just want to get it out.",
          "author": "xLittleDragonx",
          "created": 1586703776,
          "upvotes": 2,
          "replies": {
            "fn6yult": {
              "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn6yult/",
              "text": "I get it and I hear you. Of course will get downvoted in a HS Senior thread and it does hurt, but every generation faces some unusual circumstances that drastically affect life. 9/11 was an event that changed and shaped our country and affected home/travel/school life. Your great grandparents faced a decade of the Great Depression and many never fully recovered mentally from that those days. If you were in the poorer side, it drastically affected ones ability to enjoy life and many of them spent the remaining days “enduring” life, waiting for the next negative event, instead of enjoying it. Hard times build tough people.  Others grew hardened to life and developed a strong sense of self and perseverance.  You as seniors will grow tougher knowing how unfair and cruel life can be now to develop that identity. You will appreciate special events even more. You know how many seniors and 8th graders take for granted ceremonies that they joke and roll their eyes at all the speeches? Heck, even college students do that. Now, you have a chance to grow a new appreciation for your school life, awards, and the people that helped you get there. \n\nIn the grand scheme of things, this will be a minor blip in your life that you can turn into a positive. It can still hurt, but you can make this into something great. \n\nOk, downvote away.",
              "author": "SumDaysAreGood",
              "created": 1586710021,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fn44ufh": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn44ufh/",
      "text": "People are dying because of corona and this is your chance to help people live, by sacrificing a few rituals for the sake of thousands of lives.  Grow a pair damn.  So selfish.  This is coming from someone in the class of 2020",
      "author": "throwawayacc293749",
      "created": 1586634087,
      "upvotes": -20,
      "replies": {
        "fn4dnao": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4dnao/",
          "text": "Look, everyone has a right to be angry or upset about  something even if it doesn’t seem to match up to a grand scale. \n\nWhat you literally just said compares to someone saying “oh you shouldn’t be complaining about your broken leg because millions of people are dying of cancer and are going through worse” or even downgrading the impact of a mass shootout because more people die from something like car accidents or  just the common cold. Just plain insensitive, rude, and pathetic.\n\nIt’s downright stupid that ignorant people like you are forcing others to keep their emotions in check by the claims of “selfishness.” We all have a right to convey how we feel, and you shouldn’t twist people’s words. Clearly OP isn’t saying she wants to do said things, she is simply upset that a lot of the events we looked forward to all of our lives have dissipated into dust.\n\nMaybe you should grow a pair.",
          "author": "huskyratz",
          "created": 1586639228,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fn4n39c": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4n39c/",
      "text": "Putting in work in HS for awards is a terrible reason. You need to do it for yourself.",
      "author": "ranch-me-brotendo311",
      "created": 1586644779,
      "upvotes": -5,
      "replies": {}
    },
    "fn4ysho": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4ysho/",
      "text": "Was gonna say don’t take this shit personally, we’re all going through the exact same thing collectively. There really is no reason be sad but you’re allowed to be",
      "author": "MaskedXRaider",
      "created": 1586651952,
      "upvotes": -4,
      "replies": {
        "fn51i3p": {
          "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn51i3p/",
          "text": "just cause we’re all going through it tg doesn’t mean there’s no reason to be sad. after grinding for four years straight for SATs, APs, college apps, extracurriculars, and classes every day, i think most seniors were looking forward to their semester of fun and the fact that we’re all in the same boat doesn’t make that less unfortunate",
          "author": "hazardmilk",
          "created": 1586653706,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fn4s956": {
      "link": "/r/ApplyingToCollege/comments/fz6nx9/they_lied_to_me/fn4s956/",
      "text": "what does this have to do with college applications.... this post is better off in r/teenagers or smth",
      "author": "sadsushisketches",
      "created": 1586647852,
      "upvotes": -5,
      "replies": {}
    }
  }
}