{
  "sid": "r2vpbw",
  "link": "/r/ApplyingToCollege/comments/r2vpbw/how_bad_is_it_that_i_have_not_applied_to_any/",
  "title:": "How bad is it that I have not applied to any schools yet?",
  "text": "I’m aware that this is not an ideal spot, and while my schools don’t have a deadline until mid January, it puts me at a disadvantage applying later than sooner. I’m applying to 6 schools, only 1 of them being rolling admissions. The Common App is done for them all, but I just haven’t finished my essay and am waiting for my teacher to finish her recommendation. Keep in mind, i’m not a genius so i’m not applying to Harvard or Yale, but the list includes Virginia Tech, JMU, NC State, Appalachian State, Binghamton, and UNC. I want to get them in, but I just haven’t finalized my essay, and would rather take an extra week to get an amazing essay versus rushing the app with a boring essay. \n\nThanks",
  "author": "MrSidelineSwap",
  "created": 1637957443,
  "updated": 1638205685,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.84,
  "comments": {
    "hm6zq9b": {
      "link": "/r/ApplyingToCollege/comments/r2vpbw/how_bad_is_it_that_i_have_not_applied_to_any/hm6zq9b/",
      "text": "Not a VA resident, but  think that Virginia tech fills most seats in popular majors in the EA round. JMU should be OK. As long as you are a reasonable applicant, App St and NC state should be ok. Note that Engineering at NC state is substantially harder admission-wise than A&S, if you are going in that direction. UNC you won’t be at a disadvantage, but you need to be a strong candidate to get in. I don’t know enough about the admissions process at Binghamton to comment.",
      "author": "Perplexed-Owl",
      "created": 1637958908,
      "upvotes": 9,
      "replies": {}
    },
    "hm75xwg": {
      "link": "/r/ApplyingToCollege/comments/r2vpbw/how_bad_is_it_that_i_have_not_applied_to_any/hm75xwg/",
      "text": "You’re fine; a lot of people are in your boat too.\n\nFor Virginia Tech - really try to get that in by their Early Action deadline of December 1st. (might be 2nd, I can’t remember.) They fill up almost all of their slots with EA applicants, and their regular decision acceptance rate is shockingly low; roughly 14 percent, compared to their early action acceptance rate of like 60 percent.\n\nhttps://www.google.com/amp/s/roanoke.com/news/local/more-have-applied-to-virginia-tech-so-far-than-all-of-last-year/article_0bf9f574-3677-11eb-b632-db22eeadc33b.amp.html\n\nBest of luck. :) 🦃",
      "author": "toyota2003",
      "created": 1637961792,
      "upvotes": 7,
      "replies": {}
    },
    "hm6z4bg": {
      "link": "/r/ApplyingToCollege/comments/r2vpbw/how_bad_is_it_that_i_have_not_applied_to_any/hm6z4bg/",
      "text": "aside from rolling schools, there's no benefit to applying earlier rather than later for rd. you're fine, dw!",
      "author": "tteasis",
      "created": 1637958624,
      "upvotes": 2,
      "replies": {}
    },
    "hmf7t95": {
      "link": "/r/ApplyingToCollege/comments/r2vpbw/how_bad_is_it_that_i_have_not_applied_to_any/hmf7t95/",
      "text": " What schools do you need the recommendation for? \n\n\nSubmit VT asap before December 1, and they don’t consider recommendations and common app essays if that helps.",
      "author": "Possible_Hokie_CO26",
      "created": 1638120875,
      "upvotes": 1,
      "replies": {
        "hmfb5jr": {
          "link": "/r/ApplyingToCollege/comments/r2vpbw/how_bad_is_it_that_i_have_not_applied_to_any/hmfb5jr/",
          "text": "VT, JMU, NC State, Appalachian State, Bing.",
          "author": "MrSidelineSwap",
          "created": 1638122219,
          "upvotes": 1,
          "replies": {
            "hmfc7lh": {
              "link": "/r/ApplyingToCollege/comments/r2vpbw/how_bad_is_it_that_i_have_not_applied_to_any/hmfc7lh/",
              "text": "VT doesn’t consider recommendations at all and JMU only considers 1, so if you have one already just submit it.",
              "author": "Possible_Hokie_CO26",
              "created": 1638122655,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}