{
  "sid": "r6w27o",
  "link": "/r/ApplyingToCollege/comments/r6w27o/not_a_shitpost_i_tried_my_best_to_feel_happy_for/",
  "title:": "(NOT A SHITPOST) I tried my best to feel happy for him but I just can't",
  "text": "Someone in my school got a full-ride scholarship at Stanford, and everybody knows it now bc I believe it's the first decision letter in our grade. He is a very nice dude and a good friend of mine but I just can't fucking feel happy for him. Like I cannot do it genuinely from the bottom of my heart, and I despise myself because of that. Of course I said congratulations and stuff but now I'm just gonna feel like a failure whenever I see him in the hallways. I literally just got out of a depressive episode bc the stress of writing UC essays and loneliness were wearing me out, now this. Does anyone know how to get out of this kind of mindset? My ED decision is gonna come out by Dec. 15 and I definitely cannot live two more weeks feeling like this.",
  "author": "kumokiri2000",
  "created": 1638411263,
  "updated": 1638478179,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hmvqjup": {
      "link": "/r/ApplyingToCollege/comments/r6w27o/not_a_shitpost_i_tried_my_best_to_feel_happy_for/hmvqjup/",
      "text": "You don’t have to be happy for him. Your emotions are your emotions. If you got a depressive episode for writing a UC essay maybe you need to re-evaluate your control over your emotions in a different way. Because especially during college decision season. You will face many ups and downs. Although it is a mindset many disapprove of. I find that it works to just sit down, and think what forces are making your emotions. And think of the privileges of having those emotions you have on the subject at hand. Many people say “comparing yourself to someone with a worse life is bad” but when you really deeply think about it. You begin appreciate all that you have. Including your ability to control your future and emotions. Prestige isn’t everything-",
      "author": "Iilguat",
      "created": 1638412356,
      "upvotes": 11,
      "replies": {}
    },
    "hmvqvhq": {
      "link": "/r/ApplyingToCollege/comments/r6w27o/not_a_shitpost_i_tried_my_best_to_feel_happy_for/hmvqvhq/",
      "text": "I'm sorry, that sucks. Congrats to your friend.\n\nOne thing I'd caution against is trying to force yourself to be happy scrappy about this.You might only make your negative thoughts worse if you keep trying to pretend they aren't there. Instead, acknowledge your feelings, know that it's normal and fine to be frustrated, envious, mad, sad, and blue WHILE ALSO faking a smile for your friend.\n\nTell your brain it's OK to be angry, but to put a lid on it in the presence of others, and that you'll treat it to a chocolate sundae and a pillow-punching session later.",
      "author": "LadyMjolnir",
      "created": 1638412495,
      "upvotes": 3,
      "replies": {}
    },
    "hmx6x64": {
      "link": "/r/ApplyingToCollege/comments/r6w27o/not_a_shitpost_i_tried_my_best_to_feel_happy_for/hmx6x64/",
      "text": "decisions are out??",
      "author": "hedgehoggerrr",
      "created": 1638446120,
      "upvotes": 1,
      "replies": {
        "hmy3817": {
          "link": "/r/ApplyingToCollege/comments/r6w27o/not_a_shitpost_i_tried_my_best_to_feel_happy_for/hmy3817/",
          "text": "It’s probably for Questbridge",
          "author": "issiissi",
          "created": 1638461863,
          "upvotes": 1,
          "replies": {}
        },
        "hmxihca": {
          "link": "/r/ApplyingToCollege/comments/r6w27o/not_a_shitpost_i_tried_my_best_to_feel_happy_for/hmxihca/",
          "text": "u/kumokiri???",
          "author": "kira_ve_1",
          "created": 1638452889,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}