{
  "sid": "r6bxx1",
  "link": "/r/ApplyingToCollege/comments/r6bxx1/is_it_possible_for_me_to_do_enough_to_earn_good/",
  "title:": "Is it possible for me to do enough to earn good merit aid from school if I did nothing until junior year.",
  "text": "I was told by my parents that all I needed was good grades and strong test scores to get into college. I wasn’t allowed to do activities because they were always busy and extremely frugal. I got a job recently and I started doing piano lessons and speech but I know that’s nothing compared to other kids. Should I just give up now and stop worrying about this? If not, what are some ways to earn merit aid. I have no leadership ecs, I have no long term commitment activities (started and paid for all my activities this year) and I need to rely on my own income.",
  "author": "New_Actuary_6656",
  "created": 1638355109,
  "updated": 1638478756,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hms69r6": {
      "link": "/r/ApplyingToCollege/comments/r6bxx1/is_it_possible_for_me_to_do_enough_to_earn_good/hms69r6/",
      "text": "It is never too late and you’ve done more than you realize. Be able to reflect on your life and have a general idea of where you want to go after university will set yourself up better than check-the-box activities. Do your research, though, and start looking at the specifics of what is required versus what is recommended for the schools you’re interested in attending.",
      "author": "MotoPineapple",
      "created": 1638355839,
      "upvotes": 2,
      "replies": {}
    },
    "hms6x91": {
      "link": "/r/ApplyingToCollege/comments/r6bxx1/is_it_possible_for_me_to_do_enough_to_earn_good/hms6x91/",
      "text": "Winning competitive merit scholarships without much to speak of outside class will be tough unless you go far enough down the selectivity ladder that you find some that are winnable on stats alone.\n\nOn the other hand, there are schools with guaranteed awards you can definitely qualify for based solely on your stats.",
      "author": "jayphoward",
      "created": 1638356379,
      "upvotes": 2,
      "replies": {}
    },
    "hms9pm4": {
      "link": "/r/ApplyingToCollege/comments/r6bxx1/is_it_possible_for_me_to_do_enough_to_earn_good/hms9pm4/",
      "text": "For anyone else reading this, you don’t need money to do many ECs-volunteer!",
      "author": "T123369",
      "created": 1638358534,
      "upvotes": 1,
      "replies": {}
    },
    "hmsjhoj": {
      "link": "/r/ApplyingToCollege/comments/r6bxx1/is_it_possible_for_me_to_do_enough_to_earn_good/hmsjhoj/",
      "text": "If you have a very strong GPA and SAT/ACT, several schools will give you enormous merit scholarships. If you're a national merit semifinalist (if you took the PSAT you'll find out your result this month), even better.\n\nSome schools that do this are ASU and UAlabama Birmingham. Look into more.",
      "author": "FuriousGeorge1435",
      "created": 1638364770,
      "upvotes": 1,
      "replies": {}
    }
  }
}