{
  "sid": "qf1ijg",
  "link": "/r/ApplyingToCollege/comments/qf1ijg/can_i_apply_as_a_political_science_major_and/",
  "title:": "Can I Apply as a Political Science major and Change it to Computer Science if I get in?",
  "text": "Apparently majors with significantly higher amounts of applicants have a tougher time getting in than others. For example, as an Asian Male, I would probably have an easier time getting in if I applied as a communications major than as a Computer Science major. \n\nI have done Model UN in my freshman year and am doing it again this year so I imagine I have the ec needed to back it up but it seems like it would be difficult to explain the switch from that to computer science.\n\nIf it helps I'm mainy looking at Rutgers because I live in NJ, Penn State and Purdue. I also don't particulary care for computer science, and would not mind actually doing political science but it's incredibly hard to get a work visa on that after I grow out of my parent's visa.",
  "author": "Huldmer",
  "created": 1635110455,
  "updated": 1635182774,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhwtcaq": {
      "link": "/r/ApplyingToCollege/comments/qf1ijg/can_i_apply_as_a_political_science_major_and/hhwtcaq/",
      "text": "You’re not the first person to think of this, and schools are on the lookout for this.\n\nTransferring INTO CS ranges from “not a problem“ to “not ever gonna happen.”\n\nAt Purdue, ain’t never gonna happen. Changing majors into CS is not permitted.\n\nAt Penn State, I believe CS is in the school of engineering, so you’d need to apply to transfer schools within the university.\n\nRutgers, I believe, has CS in Arts & Sciences so you wouldn‘t need to transfer schools… but I have no idea about process or ease of switching into CS.",
      "author": "Strict-Special3607",
      "created": 1635110682,
      "upvotes": 7,
      "replies": {}
    },
    "hhwtbbw": {
      "link": "/r/ApplyingToCollege/comments/qf1ijg/can_i_apply_as_a_political_science_major_and/hhwtbbw/",
      "text": "Is there any particular downside to applying as \"undecided\"? It might be the easiest way to do it but I plan on asking my computer science teacher for a LOR and that would probably tip them off",
      "author": "Huldmer",
      "created": 1635110670,
      "upvotes": 4,
      "replies": {
        "hhx2xut": {
          "link": "/r/ApplyingToCollege/comments/qf1ijg/can_i_apply_as_a_political_science_major_and/hhx2xut/",
          "text": "No, unless you apply to a school where CS isn’t impacted, declaring CS as a major later will involve the same hoops. If you want CS, apply as CS, and if you’re worried about acceptance rates, have a couple of safeties that you like and wouldn’t be crushed to attend.",
          "author": "pixelatedpix",
          "created": 1635115025,
          "upvotes": 1,
          "replies": {
            "hhx3b3p": {
              "link": "/r/ApplyingToCollege/comments/qf1ijg/can_i_apply_as_a_political_science_major_and/hhx3b3p/",
              "text": "Rutgers and Penn State were my safeties but I might have to reconsider that if it really is as hard as people say it is",
              "author": "Huldmer",
              "created": 1635115196,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhwula8": {
      "link": "/r/ApplyingToCollege/comments/qf1ijg/can_i_apply_as_a_political_science_major_and/hhwula8/",
      "text": "The answer to your question varies a lot from college to college. But it also doesn’t sound like you’re interested in CS so it may not matter.",
      "author": "jjhoster",
      "created": 1635111230,
      "upvotes": 2,
      "replies": {}
    },
    "hhwti5e": {
      "link": "/r/ApplyingToCollege/comments/qf1ijg/can_i_apply_as_a_political_science_major_and/hhwti5e/",
      "text": "To change to CS, you’ll not only need to change your declared major but also your college, which can be very difficult at public universities or colleges with strong stem programs. You might be able to pull this off at Rutgers but it’s less likely at psu and purdue",
      "author": "Good-Charity653",
      "created": 1635110753,
      "upvotes": 1,
      "replies": {}
    },
    "hhxc249": {
      "link": "/r/ApplyingToCollege/comments/qf1ijg/can_i_apply_as_a_political_science_major_and/hhxc249/",
      "text": "Research your school and how easy transferring majors is. \n\nIf it’s not easy at all don’t even try this.\n\nIf it’s easy make sure you have good ECs that relate to Political Science and your application doesn’t just scream CS.",
      "author": "Berkeley_Simp",
      "created": 1635119463,
      "upvotes": 1,
      "replies": {}
    }
  }
}