{
  "sid": "qtjgwv",
  "link": "/r/ApplyingToCollege/comments/qtjgwv/trigger_warning_for_a_supplemental/",
  "title:": "Trigger warning for a supplemental?",
  "text": "So I wanted to give a trigger warning for one of my essays since it mentions sexual violence and the death penalty, (not graphic in any way, it's in the context of protests and the academics surrounding it. I just wanna be safe in case any of the AOs would prefer one) but I'm not sure how to do it. Should I create a front page with my name, common app ID, and the trigger warning?",
  "author": "Nahrah",
  "created": 1636869882,
  "updated": 1637180360,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hkk9u1f": {
      "link": "/r/ApplyingToCollege/comments/qtjgwv/trigger_warning_for_a_supplemental/hkk9u1f/",
      "text": "Considering that the majority of AOs are 40+ and wouldn't know what a tw is or care about it for that matter, it is not needed. That being said, there could be more of a problem with the topic rather than the significance of a tw in this case. Not sure of the context but, do you need to talk about such a political/sensitive topic for an essay?\n\nSource: https://www.zippia.com/admissions-officer-jobs/demographics/",
      "author": "U_of_SOL",
      "created": 1636875983,
      "upvotes": 11,
      "replies": {
        "hkksd1w": {
          "link": "/r/ApplyingToCollege/comments/qtjgwv/trigger_warning_for_a_supplemental/hkksd1w/",
          "text": "Yes it’s a bit of a risk but the fact that the issue is polarising is the point for this particular essay. The issue is discussed in an academic context and it’s carefully worded. Thanks for the insight!",
          "author": "Nahrah",
          "created": 1636889780,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hkk19gc": {
      "link": "/r/ApplyingToCollege/comments/qtjgwv/trigger_warning_for_a_supplemental/hkk19gc/",
      "text": "No, it's not necessary. And plus AOs aren't really going to be disgusted or anything. They read multiple essays that are graphic. Plus, what is your warning going to do? There are already mentally prepared for anything. So you should be fine. But, if you don't like my answer, please email the AO of the school you're applying to.",
      "author": "KingKautow",
      "created": 1636870206,
      "upvotes": 7,
      "replies": {
        "hkk1g4l": {
          "link": "/r/ApplyingToCollege/comments/qtjgwv/trigger_warning_for_a_supplemental/hkk1g4l/",
          "text": "I definitely get this. Thanks for your insight!",
          "author": "Nahrah",
          "created": 1636870320,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkmagax": {
      "link": "/r/ApplyingToCollege/comments/qtjgwv/trigger_warning_for_a_supplemental/hkmagax/",
      "text": "As long as it isn't graphic, there's no reason for you to give a warning. \n\nAnd if it's graphic enough where you would need to give a legitimate warning, then you should rewrite it.",
      "author": "did_i_inquire",
      "created": 1636915398,
      "upvotes": 2,
      "replies": {}
    }
  }
}