{
  "sid": "rfaehv",
  "link": "/r/ApplyingToCollege/comments/rfaehv/should_i_make_a_css_profile/",
  "title:": "should i make a css profile",
  "text": "i only have like 4 privates- all RD (usc, cornell, nyu, emory) that “require” css profile (for institutional aid) but idk if i should make one bc i dont qualify for a fee waiver so thatd be $73 ($25+16+16+16). and i dont think id get into cornell or nyu so idk if its worth it to even make a css profile. and usc is so expensive already so idk if id even go there (i dont think id get the institutional aid/merit scholarships tbh) so is it worth making a css account? what if i just made one for 1 or 2 schools? should i just use it for all 4? thoughts/advice/opinions??",
  "author": "FunBarracuda5838",
  "created": 1639381568,
  "updated": 1639514350,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hocu8gm": {
      "link": "/r/ApplyingToCollege/comments/rfaehv/should_i_make_a_css_profile/hocu8gm/",
      "text": "It is not an optional thing that you may or may not do - if you apply to any of these schools which \"require\" a CSS Profile, then you're supposed to submit it if you need financial aid.",
      "author": "prsehgal",
      "created": 1639382635,
      "upvotes": 2,
      "replies": {
        "hocx1gd": {
          "link": "/r/ApplyingToCollege/comments/rfaehv/should_i_make_a_css_profile/hocx1gd/",
          "text": "ohh okk, just for a quick clarification, even if i applied to usc (and completed fafsa) but most probably wouldnt go there (so technically it wouldnt matter how much financial aid i do get), i would still have to complete css?",
          "author": "FunBarracuda5838",
          "created": 1639384970,
          "upvotes": 1,
          "replies": {
            "hocx9xl": {
              "link": "/r/ApplyingToCollege/comments/rfaehv/should_i_make_a_css_profile/hocx9xl/",
              "text": "If you're sure that you won't attend it, you can just mail them and ask them not to consider you for financial aid.",
              "author": "prsehgal",
              "created": 1639385167,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}