{
  "sid": "qyrr2v",
  "link": "/r/ApplyingToCollege/comments/qyrr2v/comparing_public_colleges_for_a_herper_in/",
  "title:": "Comparing public colleges for a herper in California",
  "text": "Hello, I’m hoping this is an appropriate place to ask your opinion. \n\nMy son has been accepted to Humboldt State for 2022 (Zoology) but he has yet to hear from Cal Poly SLO or the UC Davis or UCSC where he would major in Evolutionary Biology/ Ecology. ( is that the major you would recommend for a future herpetologist, with plans for grad school?) \n\nWe visited all the schools and I believe that HSU’s campus, culture, class sizes and the Zoology major are the best fit for him. He is a herpetology (reptiles and amphibians) fanatic, and loves the climate of Humboldt, nature and fishing. \n\nHe is hoping for UC Davis, UCSC or Cal Poly SLO because he wants to study abroad and thinks if he is lucky enough to get into one of these options he should go for those opportunities, as they would look better for grad school and his future career. \n\nAny thoughts or advice for us? \n\nI just want him to be happy and not as stressed as he has been these last two years of high school. He is a 4.0 student, always doing homework when not herping or doing internships.",
  "author": "Playful_Butterfly290",
  "created": 1637488216,
  "updated": 1637688264,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlingil": {
      "link": "/r/ApplyingToCollege/comments/qyrr2v/comparing_public_colleges_for_a_herper_in/hlingil/",
      "text": "If they like Humboldt State it will probably be great for them, and as long as they seek out opportunities there they should be fine for grad school.  Don't worry about the name of the school, but do look at the opportunities available - are there research opportunities available at Humboldt State for undergrads, and how they compare to the UCs for example.\n\nAll those majors seem like fine options for undergrad, but I would encourage them reach out to faculty at the schools who do research in the field that interests them - a major like Conservation Biology could be a good option too.",
      "author": "BrawnyAcolyte",
      "created": 1637508272,
      "upvotes": 2,
      "replies": {}
    },
    "hljexn7": {
      "link": "/r/ApplyingToCollege/comments/qyrr2v/comparing_public_colleges_for_a_herper_in/hljexn7/",
      "text": "Humboldt just got approved to become the third Cal Poly so I’d actually argue he has a better chance to access opportunities at Humboldt State. It’s a smaller campus and not every kid is trying to become a vet. HSU has a big emphasis on hands-on learning and the major map for Zoology is flexible enough to allow him to really specialize if he wants to. \n\nIt’s a great school for him to be able to build up a resume. Grad programs don’t really care about the name of the undergraduate program; they want to see a student’s resume, academic history, letters of rec, fit for the grad program, and accomplishments. Your son is more likely to get research opportunities, mentoring, and publishing/authorship credits at a place like HSU.",
      "author": "the-wild-rumpus-star",
      "created": 1637519518,
      "upvotes": 2,
      "replies": {}
    }
  }
}