{
  "sid": "qxiv1n",
  "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/",
  "title:": "Which state is most safe/dangerous for international students.",
  "text": "Soooooo, I am an Asian girl who don't live in US, therefore i can learn about universities from different websites ( which probably  have false info). And im quite scared about all of these news about discrimination to Asians, street fights and crimes against of minorities. Can you tell me those states/universities from which i should avoid?\nP.S. really sorry for my English if there is any mistakes, i'm going to improve it",
  "author": "theysaidicantchange",
  "created": 1637336494,
  "updated": 1639827462,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hla025g": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hla025g/",
      "text": "You need to consider that “states” in the US (with a few exceptions in the northeast) are fairly large geographically and, more often than not, vary extensively in terms of “safety” within each state. So it’s hard to generalize about the safety of “states” in general. You’d need to look at specific cities. And even there, you’d need to look at specific neighborhoods within those cities.\n\nAlso, there aren’t really any specific states that would be more or less safe because you are international in general, or Asian specifically.\n\nYes, there are “unsafe” places in the US. But those places are almost certainly unsafe for ANYONE who finds themself there.",
      "author": "Strict-Special3607",
      "created": 1637342567,
      "upvotes": 7,
      "replies": {}
    },
    "hla01l4": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hla01l4/",
      "text": "probably states with existing Asian communities like California, Massachusetts, Texas would be better. I'm also Asian and my city in Rhode Island has felt very safe with a higher international student population. Besides the UCs and private unis, UT Dallas has a very high international Asian student population if that's something that is important to you.",
      "author": "yuzucchan",
      "created": 1637342561,
      "upvotes": 2,
      "replies": {
        "hla0k0t": {
          "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hla0k0t/",
          "text": "Thank you !!",
          "author": "theysaidicantchange",
          "created": 1637342764,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hla4fc6": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hla4fc6/",
      "text": "None, all states are relatively equal in safety in terms of hate crimes.\n\nYou may feel uncomfortable in very white states, but you shouldn't run into any safety concerns that you wouldn't see in more diverse states",
      "author": "ssssseabass",
      "created": 1637344261,
      "upvotes": 0,
      "replies": {}
    },
    "hlajgdn": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hlajgdn/",
      "text": "Hi! I'm a fellow Asian, personally I've found that most major cities in the US are pretty safe for minorities. If you go down south or to some rural regions people might be more conservative/ you're more likely to run into racists, but ethnic hate crimes are pretty uncommon everywhere. \n\nOne way to see whether a college is safe is to check their percentage of international/Asian students on their websites. A larger minority population generally means that the school will be safer, or at least have more protections into place.",
      "author": "Ok-Outlandishness799",
      "created": 1637349846,
      "upvotes": 3,
      "replies": {}
    },
    "hlb6ox4": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hlb6ox4/",
      "text": "Instead of looking by states, looking at specific colleges would be a better idea as how safety level varies drastically within every state. For example, while both Northwestern and UChicago are in Illinois, one is way safer than the other, same applies to Cornell and NYU. Personally I would suggest you avoid unis in big cities where more or less crime is an issue. A college town with <1h train ride away from a fairly large city would be ideal because you neither run into safety concerns that often nor put yourself in a solitary confinement by being in the middle of nowhere.",
      "author": "Katsura_Do",
      "created": 1637358838,
      "upvotes": 1,
      "replies": {}
    },
    "hlbhim6": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hlbhim6/",
      "text": "Look for suburbs of major cities. A lot of cities like NYC might have the impression of being very international friendly but I think maybe because of the sheer density and population, it can be overwhelming and potentially dangerous especially if you are unfamilar with these cities. IMO you should look the the nicer suburbs or outskirts of these cities. Schools like Princeton, Emory, Rutgers, Swathmore, Tufts, Boston College, Claremon McKenna Consortium, Villanova, Stanford are some I can think of. These areas have a lot of diversity in terms of families as here in NJ, lots of Chinese and Indian families have parents who commute to NYC for work. Rural schools are generally also pretty safe especially state flagship schools in college towns or competitive schools. As a Asian American, hate crimes are a big problem especially now but they are not extreme like the media pictures it. Otherwise, schools like NYU, Columbia, and UChicago would not be as popular as they are now among international students.",
      "author": "amazing_donuts",
      "created": 1637363339,
      "upvotes": 1,
      "replies": {}
    },
    "hlbp9df": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hlbp9df/",
      "text": "It’s not really states, it’s individual schools. Look for schools that have low crime rates or that have a A or B niche safety ranking. \n\nAs long as you avoid sundown towns in the South, you should be fine.\n\nOfc, this is assuming you are “smart” enough. By this I mean:\n\n* if you see a car/van pulling up near a sidewalk you are walking on, don’t go near it. Run away, go in the opposite direction, go in a store, etc. \n* Don’t walk at night alone. Many campus police offer escort services and the police will escort you safely to your car or dorm. \n* If you do walk at night, stay in well-lit areas. \n* Always be aware of your surroundings. \n\nEtc. Just be smart about your safety. \n\nIf you really want to feel safer, consider schools that DONT have campus carry.\n\nCampus carry is a rule that allows people with a concealed carry license to have a gun on campus. A concealed carry license means they can have the gun on them (like on a holster on their torso). They do not have to tell you that they have a gun. I’m in Georgia (a state with campus carry). I sat next to many people who carried gun with them in the classroom. \n\nNow for the most part, I’m okay with campus carry. Usually gun owners are trained and responsible. But it’s something to consider if it makes you feel safer or unsafe.",
      "author": "Outherepoor",
      "created": 1637366658,
      "upvotes": 2,
      "replies": {}
    },
    "hlcgcz1": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hlcgcz1/",
      "text": "The USA is massive; people sometimes don't realize that.\n\nIn terms of geographic size, California is larger than Japan; Texas is larger than Thailand; and Nebraska is larger than Syria.\n\nIn every state, there's hundreds of cities. In larger cities, there's many neighborhoods (occasionally called districts/wards depending on the city) that differ in culture, wealth, safety, and many other factos.\n\nMy point is... there's not specific *states* that are safer to live in, rather there's specific cities within states that are safer to live in. (\"Safe\" referring to violence, crime, quality of schools, etc, not racism. That's a more complex issue & other commenters summed it up well.)",
      "author": "toyota2003",
      "created": 1637379598,
      "upvotes": 1,
      "replies": {}
    },
    "hlhalqx": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hlhalqx/",
      "text": "States are rather large and all big cities come with some inherent danger though I don’t know that any college in specific will be more or less dangerous. \n\nThe danger is more so when you look at specific blocks or small areas of the city will large amounts of gang activity and just generally not quite as nice of an area.\n\nWhile the campus is likely pretty safe common sense still applies of course. Minimize staying out after it’s dark and try not to be out after 11:00 at the latest. Avoid notoriously dangerous areas and always be observant and on high alert. If you do this odds are you will be fine.",
      "author": "Pattywackist",
      "created": 1637475524,
      "upvotes": 1,
      "replies": {}
    },
    "hlbw3hf": {
      "link": "/r/ApplyingToCollege/comments/qxiv1n/which_state_is_most_safedangerous_for/hlbw3hf/",
      "text": "just make the sure the state ur going into is very diverse like Virginia, pennslyvania, New Jersey",
      "author": "Honeydewbobaddict",
      "created": 1637369721,
      "upvotes": 0,
      "replies": {}
    }
  }
}