{
  "sid": "r6jq63",
  "link": "/r/ApplyingToCollege/comments/r6jq63/why_do_you_actually_need_to_give_test_after/",
  "title:": "Why do you actually need to give test after completing high school to get admission?",
  "text": "I was just wondering on why is it even necessary to give SAT, ACT, and IELTS for international students,   \nwhy isn't just normal school exams useful, in any of the ways you are going to forget that shit after you pass out college , cause only a few actually do a job related to their major and with a shit ton debt to pay before you die.",
  "author": "GumBeats20",
  "created": 1638378821,
  "updated": 1638478632,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hmtgmfl": {
      "link": "/r/ApplyingToCollege/comments/r6jq63/why_do_you_actually_need_to_give_test_after/hmtgmfl/",
      "text": "Because schools need to have some common metric to evaluate you against the rest of the applicant pool",
      "author": "freeport_aidan",
      "created": 1638379212,
      "upvotes": 6,
      "replies": {}
    },
    "hmti7ww": {
      "link": "/r/ApplyingToCollege/comments/r6jq63/why_do_you_actually_need_to_give_test_after/hmti7ww/",
      "text": "bc those exams are standardized. all intl kids are taking the same sat so its a good way of comparing them to one another. \n\ngpas can get highly inflated and aos have no way of knowing what was specifically on your school exam so they need a reliable measure of your academic ability\n\nielts is just english proficiency and i think its pretty obvious why it's necessary",
      "author": "cherry_acorn",
      "created": 1638379839,
      "upvotes": 5,
      "replies": {}
    },
    "hmwe7iw": {
      "link": "/r/ApplyingToCollege/comments/r6jq63/why_do_you_actually_need_to_give_test_after/hmwe7iw/",
      "text": "Well I guess that's fair enough. But comparing creates inferiority among students, and this is just a dumb way of testing students.  \n\n\nif gpas get highly inflated even SAT and ACT  marks are high and in many cases full as well.The point is why take that extra exams when a kid has been giving exams ever since he/she has been admitted to the school. As far as AOs are concerned they should know in depth about what specially a school is being teaching or even better let the student tell it him/her self.  \n\n\nBut anyways don't want to start an argument in here. thenks !",
      "author": "GumBeats20",
      "created": 1638424011,
      "upvotes": 1,
      "replies": {}
    }
  }
}