{
  "sid": "qjg898",
  "link": "/r/ApplyingToCollege/comments/qjg898/what_to_put_in_subject_in_common_app_transcript/",
  "title:": "What to put in 'Subject' in Common App Transcript if I took Integrated Math?",
  "text": "Working on the transcript in the Common App rn, and I'm a bit uncertain of what to do. In my highschool, we take Integrated Math 1, Integrated Math 2, Integrated Math 3, then Pre-Calculus, then there's also Calculus if you managed to skip a course. \n\nBut when I click on the drop-down menu for math options, there's only Algebra, Geometry, Trigonometry, Pre-Calculus and Calculus. Which one do I list Integrated Math under? Especially since Integrated Math combines all three. I don't really wanna list it as the 'Math - Other' option because idk... it just looks bad. \n\nAnother question I have is for the 'Final Grade.' My school does grades in semesters. So I have a grade to insert for first and second semester, but there's no final grade. Do I leave this blank even though they list it as a required field? Or should I put 'No Grade,' even though that looks kinda bad. \n\nHelpppp lmaoooo",
  "author": "randompeeps1",
  "created": 1635647482,
  "updated": 1635778582,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiq1im8": {
      "link": "/r/ApplyingToCollege/comments/qjg898/what_to_put_in_subject_in_common_app_transcript/hiq1im8/",
      "text": "Oh hey same. And I know what you mean. Integrated math isn't restricted to a certain topic so it's confusing. I think I put in what majority of the course is about. So I took Integrated Math 2 freshman year which is mostly about geometry (tho as you know it had stuff outside of geometry and iirc geometry was only second semester) and for Integrated math 3 I believe I put in trig cause a lot of it is about end behavior, trig, and borderline precalc. I don't remember too well what I put in but I know for sure I didn't say it was precalc cause my school has a separate precalc course (though if you took Integrated math 3 you could do AB right after). Also is this a california school lmao? I haven't heard of integrated math outside of california cause most (even some californian) schools do math by topic. \n\nAnd for grades, I believe I left the final grade blank. Does it show an error if you leave it blank? It's been a month since I did it so I don't remember anymore. If it does show an error, put in no grade. And I don't think that would look bad. Because you have semester grades already and I think AOs will understand cause most schools I know of and been to don't have a final grade listed on the transcript.",
      "author": "i-believe-in-magic1",
      "created": 1635649782,
      "upvotes": 1,
      "replies": {
        "hiq1oov": {
          "link": "/r/ApplyingToCollege/comments/qjg898/what_to_put_in_subject_in_common_app_transcript/hiq1oov/",
          "text": "lmaoo that’s actually what i did. Integrated I put algebra, then Integrated 2 Geometry, then Integrated 3 Trigonometry. I also left the fields blank and it accepts it, yay. Thanks for confirming :)",
          "author": "randompeeps1",
          "created": 1635649876,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}