{
  "sid": "re6fua",
  "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/",
  "title:": "Just finished my first quarter at UCLA - AMA",
  "text": "Ask me anything about the school and student life! I can try and help with admissions since I’ve seen part of my file but no guarantees.\n\nShout out to u/h25-throwaway for the idea.",
  "author": "dispose1212",
  "created": 1639249586,
  "updated": 1645835829,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.93,
  "comments": {
    "ho5pe2t": {
      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5pe2t/",
      "text": "Are you in college or engineering? Was your high school from CA? Your stats? Thanks",
      "author": "svday",
      "created": 1639252278,
      "upvotes": 3,
      "replies": {
        "ho5rqfr": {
          "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5rqfr/",
          "text": "I’m in the college, but my major is CS focused. I am in state and had about a 4.4 UC GPA weighted, and a 3.9 unweighted.",
          "author": "dispose1212",
          "created": 1639253309,
          "upvotes": 2,
          "replies": {
            "ho6yakr": {
              "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho6yakr/",
              "text": "What’s your major?",
              "author": "mortizmajer",
              "created": 1639272760,
              "upvotes": 2,
              "replies": {}
            },
            "ho5v9jj": {
              "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5v9jj/",
              "text": "Thanks, UCLA freshman profile stats include # of honors courses taken during high school. How many APs, DE and UC recognized school honors courses did you have ?",
              "author": "svday",
              "created": 1639254876,
              "upvotes": 1,
              "replies": {
                "ho5wu38": {
                  "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5wu38/",
                  "text": "0 APs, 14 DEs, and 6? recognized honors classes. \n\nNote that the UCLA freshman profile on the UCLA website is from 2020, and the one on the UC website is from 2021. The admitted GPA among other things dramatically changed.",
                  "author": "dispose1212",
                  "created": 1639255582,
                  "upvotes": 2,
                  "replies": {
                    "ho5xihu": {
                      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5xihu/",
                      "text": "Great! so you were nearing CC Associate Degree credit requirements. Yes, they do not have 2021 UCLA freshman profile yet - UC site uses Capped GPA and UCLA uses fully weighted GPA.",
                      "author": "svday",
                      "created": 1639255880,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "ho622s8": {
                      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho622s8/",
                      "text": "Does this include DE classes during your senior year also or just till end of junior (including summer after that) ? Your DE classes were in computer science area ? Thanks",
                      "author": "svday",
                      "created": 1639257909,
                      "upvotes": 1,
                      "replies": {
                        "ho6i74y": {
                          "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho6i74y/",
                          "text": "including senior year. only two of my DEs were related to CS, and one was in fall of senior year",
                          "author": "dispose1212",
                          "created": 1639265156,
                          "upvotes": 2,
                          "replies": {
                            "ho70370": {
                              "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho70370/",
                              "text": "Thanks for all your time!",
                              "author": "svday",
                              "created": 1639273656,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho5plv8": {
      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5plv8/",
      "text": "Anything interesting you saw on your file? I've heard from my friend's counselor who used to be an AO at a UC that UCs read applications really quickly and only up to 3 people read your application, so I imagine they don't really have time to make comments. Also how hard was it to enroll in classes? I heard some people ask their upperclassmen friends to save spots for them enrolling and then dropping.",
      "author": "International-Dot-94",
      "created": 1639252373,
      "upvotes": 3,
      "replies": {
        "ho5rl47": {
          "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5rl47/",
          "text": "Not particularly, UC’s don’t give you much information from your file. With anecdotes from a friend in the admissions office at a private T20, I can tell you that even with very high ratings, you can still get denied. It’s just a crapshoot. It is largely based on essays and scores at this institution though.\n\nYeah, that happens a lot for enrollment. I haven’t had any issue since I have junior enrollment standing due to my dual enrollment classes, so my experience isn’t really normal. That being said, it’s great to have upperclassman friends for that reason. Classes fill up super fast: the whole political science department fills up during first pass (earlier, max 10 units of enrollment) and the easiest writing requirement class fills up during regents / senior pass, for reference. But I’ve had no problem getting into all my classes.",
          "author": "dispose1212",
          "created": 1639253244,
          "upvotes": 1,
          "replies": {
            "hpui38k": {
              "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/hpui38k/",
              "text": "How is junior enrollment determined? I have a lot of DE credits but I’m not sure if it would count toward my standing.",
              "author": "International-Dot-94",
              "created": 1640378375,
              "upvotes": 2,
              "replies": {
                "hpuiqmg": {
                  "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/hpuiqmg/",
                  "text": "for me, semester credits * 1.5 > 90\n45 units for sophomore, 90 for junior, 135 for senior, 180 for senior+",
                  "author": "dispose1212",
                  "created": 1640378694,
                  "upvotes": 2,
                  "replies": {
                    "hpupk2t": {
                      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/hpupk2t/",
                      "text": "Are those credits DE units or credit your high school gives you? (ex 3 DE unit = 10 HS credits)",
                      "author": "International-Dot-94",
                      "created": 1640382068,
                      "upvotes": 2,
                      "replies": {
                        "hpuq3k1": {
                          "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/hpuq3k1/",
                          "text": "DE units",
                          "author": "dispose1212",
                          "created": 1640382337,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho5pii8": {
      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5pii8/",
      "text": "How do you compare your college course work at UCLA with say, dual enrollment or AP classes?",
      "author": "svday",
      "created": 1639252331,
      "upvotes": 2,
      "replies": {
        "ho5r11s": {
          "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5r11s/",
          "text": "I personally think that it depends on your classes. I definitely spend a lot more time actually studying versus doing homework, but my quarter this quarter was pretty light. If you procrastinate and don’t get the material down as you learn it, you’ll definitely spend a lot of time studying - I spend about 3-5 hours a day studying before midterms. That being said, I do think dual enrollment prepared me well. My only note is that grading is a lot more harsh compared to dual enrollment.",
          "author": "dispose1212",
          "created": 1639253001,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ho5qfda": {
      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5qfda/",
      "text": "How competitive is the environment? People always talk about how they go to UCLA (and other top schools) and end up being a small fish in a big pond because everyone there is so good. How did you adjust? (mindset, etc.)",
      "author": "mayz8",
      "created": 1639252739,
      "upvotes": 1,
      "replies": {
        "ho5skdk": {
          "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5skdk/",
          "text": "To be honest, being from the Bay Area put me in a pretty good position where I feel like I’m right about average. However, most people don’t talk about their accomplishments - it really takes getting to know someone to figure out more about them academically. I never have felt pressured to pick up more activities on anything other than my own volition. When I talked about college apps with my friends, everyone was more or less unsurprised at what everyone said: even though some of us didn’t have test scores, it’s clear that everyone admitted deserves to be there. \n\nThat being said: When I was interviewing for the extremely competitive management consulting clubs (~200-300 applicants, 10 taken at most), I definitely noticed the competitiveness of the environment in group settings where you’re basically meant to brag. I remember there was this girl that had worked with Steven Spielberg on a documentary, and just decided to throw that out there during the group interview. So definitely in that sense, some people do some crazy things.\n\nPersonally, college has made me enjoy life a lot more, and I’ve been a lot more socially oriented than academically. It also helps that I’m not necessarily in a major where GPA matters a lot: since I’m in CS, I’m only aiming for a 3.5 since anything past that is (tbh) a waste of time: the time is better spent working on projects. So I care a lot less about my grades than my premed friends for example. \n\nLet me know if there’s anything I didn’t answer or if you have any other question!",
          "author": "dispose1212",
          "created": 1639253675,
          "upvotes": 1,
          "replies": {
            "hockim0": {
              "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/hockim0/",
              "text": "thank you so much for your detailed answer!!",
              "author": "mayz8",
              "created": 1639375550,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho5shbx": {
      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5shbx/",
      "text": "Is the food really as good as it is hyped up to be at UCLA?",
      "author": "vikcash",
      "created": 1639253638,
      "upvotes": 1,
      "replies": {
        "ho5te36": {
          "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho5te36/",
          "text": "Let me preface this by saying that it’s still dining hall food. I feel like new students expect it to be a fine dining restaurant. \n\nThat being said, compared to what my friends have at other institutions, it’s great. In attending, I picked up pretty quickly what’s consistently good and what’s not, but I’m a “foodie” so I’m probably a lot more  picky than others. A few things are always great:\n1) Seafood, anywhere. They prepare their seafood so well: seafood pasta, seared tuna, cooked salmon and trout, etc \n2) Steak: The brisket/tri tip is always good, and so is the normal steak. I’ve never had it extremely over cooked or undercooked.\n3) Tofu: They cook their tofu super well, and the sauces are great. \n4) Pasta: 8 times out of 10, (and 10 times out of 10 at a specific dining hall, Epicuria/Covel), the pasta is great. Absolutely no complaints: reminds me of restaurant quality pasta. \n5) THE DESSERTS: they’re absolutely godly. I’m still mad that the shittiest (imo) dining hall has the best desserts.",
          "author": "dispose1212",
          "created": 1639254037,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho7rmew": {
      "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho7rmew/",
      "text": "hi, thanks for doing this AMA!\n\n1. in your opinion, do you think going to a UC is worth California's astronomical living costs and the crazy traffic (I realize this may be an issue with most major cities; UCLA is one of my top choices though, which is why I'm especially interested)\n2. is there anything that surprised you about UCLA, the community or the campus in general after moving in?\n3. as a STEM major, how easy is it to take humanities electives?\n\nthank you!",
      "author": "AmateurGenius04",
      "created": 1639287896,
      "upvotes": 1,
      "replies": {
        "ho7sqf1": {
          "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho7sqf1/",
          "text": "thanks for your questions!\n1) personally yes. all my expenses are around $25k per year which is still astronomically less then a private institution of the same caliber. dorms and apartments off campus are a similar price as well, and ucla’s tuition being so low really does make up for it. for me and my financial situation, a UC is the only T20 I’d be able to attend. So again, yes. \n\n\n2) it really surprised me how normal everyone is. sometimes you can tell someone’s academic accomplishment based on their instagram if they decide to post that, but largely, everyone’s normal. for example, my roommate is exceedingly normal - it wasn’t until i got to know him well that it was kind of explained how he got into ucla and ucsd with the shores scholarship, among other places. another one of my friends got into penn, usc iya, and a few other places. but everyone is really happy to be where they are and there doesn’t seem to be any resentment about ending up where they did, even if they got into a “better” institution. nobody really talks about academic accomplishments; everyone’s just there to have a good time and not stress out too much about their classes and schoolwork (at least the ppl ik). also the traditions–undie run, midnight yell, roebling block party–are all super fun and add to the student life (which is highly ranked for a reason). most of my friends were like ehhh i have work to do i don’t really want to go but eventually if they go they’re always like “damn this is so much fun.” the campus is also pretty split into the residential portion and actual campus, so nobody wants to go between them if you don’t need to. as such, there’s a lot of walking: we’re called the university of calves, legs, and ass for a reason. \n\n\n3) Super easy, as long as you have course space. You can take basically whatever you want and minor / double major in whatever you want.",
          "author": "dispose1212",
          "created": 1639288537,
          "upvotes": 0,
          "replies": {
            "ho838oj": {
              "link": "/r/ApplyingToCollege/comments/re6fua/just_finished_my_first_quarter_at_ucla_ama/ho838oj/",
              "text": "this is great, thank you so much!",
              "author": "AmateurGenius04",
              "created": 1639296039,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}