{
  "sid": "reeoyg",
  "link": "/r/ApplyingToCollege/comments/reeoyg/yall_confuse_me/",
  "title:": "yall confuse me",
  "text": "im sorry but there will literally be a post that's like \" I got my first award in my 9th grade schools newspaper club for most proactive member \" and everyone in the comments will be like CONGRATS IM SO PROUD OF U !!!!!! but then there's a post that's like \"I missed my deadline for _____ what can I do \" or \" I don't like my ED school\" and yall will be like \"yeah you fucked up should've thought ahead...\" or \"that's so irresponsible why didn't you do prior research\" publicly SHAMING these people who have come on this sub for help while hyping up worthless achievements I actually dont understand lmfao why not be that nice to everyone?",
  "author": "NewProtection5517",
  "created": 1639275368,
  "updated": 1639515409,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.29,
  "comments": {
    "ho78nb3": {
      "link": "/r/ApplyingToCollege/comments/reeoyg/yall_confuse_me/ho78nb3/",
      "text": "how do you preach about being nice while calling some awards worthless achievements 😭?\n\nhow do these connect, and what do you want someone to say when someone misses their deadline? congrats? of course you should try to be kind, but there’s no way to help someone who knew the deadline probably months before or didn’t research enough about the college they applied ED at.",
      "author": "enlargedeyes",
      "created": 1639277863,
      "upvotes": 32,
      "replies": {}
    },
    "ho79taa": {
      "link": "/r/ApplyingToCollege/comments/reeoyg/yall_confuse_me/ho79taa/",
      "text": ">and yall will be like…  \n>  \n>…why not be that nice to everyone?\n\nTwo different groups of responders.\n\n😎",
      "author": "Strict-Special3607",
      "created": 1639278450,
      "upvotes": 7,
      "replies": {
        "ho7g56c": {
          "link": "/r/ApplyingToCollege/comments/reeoyg/yall_confuse_me/ho7g56c/",
          "text": "why do you always use that emoji",
          "author": "pumpkin2500",
          "created": 1639281640,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}