{
  "sid": "q6q6mn",
  "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/",
  "title:": "Pre Med School Acceptance",
  "text": " Hello!  I want to join a university for premed in the US. I want to join a university that allows for higher GPA and has prospects for high MCAT Scores and it can be either public or private. I have good extracurriculars and overall I want to get into a good medical school.",
  "author": "YouthMedicalInitga",
  "created": 1634056607,
  "updated": 1634576228,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgdfbom": {
      "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hgdfbom/",
      "text": "Usually much cheaper to attend med school in your own country.\n\nAlso note that acceptance rates for internationals to US med schools are very low.",
      "author": "elkrange",
      "created": 1634056884,
      "upvotes": 3,
      "replies": {
        "hgg9i28": {
          "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hgg9i28/",
          "text": "I am in the US",
          "author": "YouthMedicalInitga",
          "created": 1634103594,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgdx5ch": {
      "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hgdx5ch/",
      "text": "You're working off some faulty thinking here. Yes, you need hours, a high MCAT, ECs, and strong grades in pre-reqs classes to be competitive to med school. But an undergraduate school doesn't and can't guarantee any of that. They simply offer the pre-req classes; you have to do everything else outside of class time. So pick a school that has the pre-reqs (so, practically any), that's AFFORDABLE, and that has a pre-health advising center. The rest of your success is based on you, not the school.",
      "author": "renebeca",
      "created": 1634064219,
      "upvotes": 1,
      "replies": {
        "hgnfj4d": {
          "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hgnfj4d/",
          "text": "Seconding this. No school can \"allow\" you a higher GPA. And your undergrad has essentially no bearing on your MCAT, that's entirely on you. Premed is a slog no matter where you go, so find a school where you're happy and fit the culture well because you as well be in a good environment while you're grinding",
          "author": "leadbunny",
          "created": 1634240895,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hged0o2": {
      "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hged0o2/",
      "text": "Pre med isn’t really a thing in the US, just attend a school that one, has a biology and chemistry department lol, and two is the cheapest option.",
      "author": "PrincipleSpecial4759",
      "created": 1634070674,
      "upvotes": 1,
      "replies": {}
    },
    "hgeuzcu": {
      "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hgeuzcu/",
      "text": "U will not get in to a US med school if u are international lol. Unless u win some Nobel prize. US med schools usually only accept domestic students since it takes a lot of resources to educate physicians. Nearly a million dollars for each med school student. Even those ones that claim they do accept international students rarely do so, maybe if u get a near perfect MCAT maybe it could work, but highly highly unlikely. Sorry, but that’s reality. Better off if u go to med school in ur own country, take the USMLE and come to the US as a licensed physician.",
      "author": "GrassComfortable6626",
      "created": 1634078220,
      "upvotes": 0,
      "replies": {
        "hgfjcqk": {
          "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hgfjcqk/",
          "text": "IMGs and FMGs are absolutely fucked because Step 1 is going P/F now lmao. Their only hope is Step 2 and even then the damage has been done",
          "author": "MundyyyT",
          "created": 1634089462,
          "upvotes": 1,
          "replies": {
            "hgfmsqe": {
              "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hgfmsqe/",
              "text": "Yeah, I mean I don’t know why internationals are coming over here to become doctors anyways… like why??? They probably need more doctors in the countries they came from.",
              "author": "GrassComfortable6626",
              "created": 1634091065,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hgg9jlx": {
          "link": "/r/ApplyingToCollege/comments/q6q6mn/pre_med_school_acceptance/hgg9jlx/",
          "text": "I am in the USA",
          "author": "YouthMedicalInitga",
          "created": 1634103623,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}