{
  "sid": "rfzpx5",
  "link": "/r/ApplyingToCollege/comments/rfzpx5/will_someone_with_higher_test_scores_and_more_ap/",
  "title:": "Will someone with higher test scores and more AP classes in my grade at my highschool going for the same colleges as I, void my applications to those colleges?",
  "text": "Title may be a little confusing and the question may seem silly, let me explain.\n\nThere is this guy (we will call him Bob) that I have had a couple of classes with in the past that has a perfect ACT score and he takes many AP classes (I'm pretty sure at least, haven't seen him in the ones I have taken) and although I am not 100% certain, there is a good chance that he is going into the same field I am going in to (as the classes I have taken with him are specific to this career path.) I have a solid history when it comes to highschool, I maintained a 4.0, was part of -I believe- around 5 clubs throughout my time here, volunteered, etc. but it isn't anything spectacular. I was trying for some top schools for my major just to give it a shot, but if Bob is indeed in my major, no way they are going to pass up applying to some of these top schools as well. \n\n&#x200B;\n\nIf an admissions officer assigned to my district looks at both of our applications and sees we went to the same school, had the same opportunities, but Bob has a perfect ACT score and possibly much more AP classes than I (I have taken 4 at the moment, may be able to get a 5th) They are obviously going to pick Bob and throw mine to the waste side.\n\n&#x200B;\n\nNow, obviously it isn't all about the grades. Colleges look at applications holistically. I just doubt that small things such as me being in National Honor Society while Bob isn't will make much of a difference. Not looking for consoling necessarily or comfort, just want to know if I should even try for these schools, thanks for any and all help.",
  "author": "I-already-redd-it-",
  "created": 1639457986,
  "updated": 1639513852,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hoh4mq5": {
      "link": "/r/ApplyingToCollege/comments/rfzpx5/will_someone_with_higher_test_scores_and_more_ap/hoh4mq5/",
      "text": "Maybe you write better essays, are more natural, have a more compelling story of why college x or major y. The scores get you in front of the AO but you don’t know what is really going to grab their attention.",
      "author": "WorriedTurnip6458",
      "created": 1639458258,
      "upvotes": 5,
      "replies": {
        "hoh4wje": {
          "link": "/r/ApplyingToCollege/comments/rfzpx5/will_someone_with_higher_test_scores_and_more_ap/hoh4wje/",
          "text": "Absolutely, good point. I’m spending a lot of time on my essays so hopefully it pays off haha. Thanks!",
          "author": "I-already-redd-it-",
          "created": 1639458408,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hoh4k18": {
      "link": "/r/ApplyingToCollege/comments/rfzpx5/will_someone_with_higher_test_scores_and_more_ap/hoh4k18/",
      "text": "colleges don't have cap per school so you can both get admitted if they deem you fit",
      "author": "MSBCity",
      "created": 1639458217,
      "upvotes": 1,
      "replies": {
        "hoh4t1m": {
          "link": "/r/ApplyingToCollege/comments/rfzpx5/will_someone_with_higher_test_scores_and_more_ap/hoh4t1m/",
          "text": "Good to know, that relieves some of the stress haha, but simply the fact that they are at my school and “took more advantage of the opportunities” will put a dent in my application will it not?",
          "author": "I-already-redd-it-",
          "created": 1639458354,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hohmwws": {
      "link": "/r/ApplyingToCollege/comments/rfzpx5/will_someone_with_higher_test_scores_and_more_ap/hohmwws/",
      "text": "Him applying or not applying doesn't change how your class difficulty impacts your application. For school profiles they submit AP offered, max someone took, and that persons GPA. Two kids from my school applied to Vanderbilt. We offered 15 APs. One took the max anyone took at 11 and the other took 9. They both got in.",
      "author": "mari512",
      "created": 1639470780,
      "upvotes": 1,
      "replies": {}
    }
  }
}