{
  "sid": "qkvbe6",
  "link": "/r/ApplyingToCollege/comments/qkvbe6/nervous_about_sending_sat_scores/",
  "title:": "Nervous About Sending SAT Scores",
  "text": "Hi all,\n\nI'm just curious if anyone can shed some light on my situation because I'm currently freaking out a bit. EA deadline for most schools was today and I was only able to send my SAT scores in TODAY. That means 1-2 weeks I'm guessing? Can't even rush them now, I had no idea they would take that long. Will this negatively affect anything or am I just overthinking it?",
  "author": "notuma",
  "created": 1635823630,
  "updated": 1635889788,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiyyk3z": {
      "link": "/r/ApplyingToCollege/comments/qkvbe6/nervous_about_sending_sat_scores/hiyyk3z/",
      "text": "For some schools, they will need all their document by the EA deadline today, and that’s include your official test score. If your test score is not there today, your application for EA is not complete, and you would be moved to the RD pile.\n\nFor some schools, they have some grace period, all different though, you will need to contact the admission of each school to find out.",
      "author": "poohland",
      "created": 1635823911,
      "upvotes": 2,
      "replies": {}
    },
    "hiyz8ja": {
      "link": "/r/ApplyingToCollege/comments/qkvbe6/nervous_about_sending_sat_scores/hiyz8ja/",
      "text": "Important: check each of your colleges' websites to see what score reporting methods they accept. Many colleges now accept scores self-reported in the app *(or portal)*, for free, to be followed by an official report only if you later enroll – self-reporting is faster. \n\nOther colleges still require official score reports sent directly from the testing agency prior to admission. Many (but not all) colleges will accept score reports that are a bit late.",
      "author": "elkrange",
      "created": 1635824276,
      "upvotes": 2,
      "replies": {}
    }
  }
}