{
  "sid": "q5e2ka",
  "link": "/r/ApplyingToCollege/comments/q5e2ka/help_me_decide_my_edea/",
  "title:": "Help me decide my ED/EA!",
  "text": "Hey, everyone! Hope everyone is having a good day. I need some advice on where to apply early, being divided between Princeton and Columbia. **THIS IS NOT A CHANCE ME POST, I JUST NEED TO KNOW WHERE I'D FIT IN BETTER!!** \n\n*Demographics* \n\n- International Student, Brazilian citizen\n- Black/Afrolatino\n- Trans male (he/him)\n\n\n*Intended major* \n\nPhysics, Political Science\n\n\n*ECs/Honors* \n\nTeam captain at the national Young Physicists' Tournament (10-12th), ranked 1st. Currently writing/publishing an article on Optics about something I've studied on the tournament \n\nMUN (10th-12th): Chair and Head Delegate, got a Honorable Mention in HarvardMUN (2nd highest award ever achieved in my country) \n\nScouting (9th-12th): Got the national correspondent to Eagle Scout, member of the National Diversity Team (100k+ impacted people) \n\nFundraised 15000k of my currency (~3k dollars, a big deal here) for an educational project \n\nTons of other stuff related to volunteering and national olympiad medals \n\n*GPA* \n\nMy school is really tough with grades but I'm on top10/20 out of 650\n\n\n*Testing* \n\nCurrently have a 1440 SAT (680R&W, 760M), retook in October.\n\n110 TOEFL\n\n\nMy LORs will be really good and I heard from 2/3 people my Common App is one of the best essays they've ever read, if that counts by any chance\n\n\nPrinceton \n\n*Pros* \n\n- Two kids from my school with an EC/honors profile really close to mine got in for the CO24, one of them through SCEA \n\n- They have *amazing* research programs for Physics and are really undergrad-focused, and I can name countless professors I admire who teach there \n\n- The campus is really nice! \n\n- Need-blind\n\n\n*Cons* \n\n- No one from my country got in for the CO25 \n\n- A fencing champion and international olympiad medalist from my school will be SCEA-ing there too \n\n- It's not my first choice, even though I'd be very happy to go there \n\n- Only one major :(\n\n\n\nColumbia \n\n*Pros* \n\n- My dream school! \n\n- A girl being mentored by the same organization as me got in RD \n\n- I know exactly where I'd fit in and what I'd do in there \n\n- Core Curriculum!\n\n\n*Cons* \n\n- Girl from my school is attending their fly-in program \n\n- ED is binding (not really a con but fine) \n\n- Need-aware\n\n\n\nI love both schools, but need to make a choice. I'm currently writing essays for both of them, just in case I decide last minute. What do you guys think I should do? Thanks for your time and for reading :)\n\nEdit: formatting",
  "author": "oliversolives",
  "created": 1633891611,
  "updated": 1634073514,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hg4vd5m": {
      "link": "/r/ApplyingToCollege/comments/q5e2ka/help_me_decide_my_edea/hg4vd5m/",
      "text": ">Columbia \n\n>Pros \n\n>My dream school! \n\nED to Columbia.",
      "author": "FuriousGeorge1435",
      "created": 1633891869,
      "upvotes": 8,
      "replies": {
        "hg4vn7w": {
          "link": "/r/ApplyingToCollege/comments/q5e2ka/help_me_decide_my_edea/hg4vn7w/",
          "text": "Yeah, I totally get that – but considering my background with a pretty low EFC (not above 3k) and with Columbia being need-aware, I don't know whether being straight up rejected would be a good idea... especially with Princeton having accepted people like me before",
          "author": "oliversolives",
          "created": 1633891988,
          "upvotes": 2,
          "replies": {
            "hg4w7lv": {
              "link": "/r/ApplyingToCollege/comments/q5e2ka/help_me_decide_my_edea/hg4w7lv/",
              "text": "You can still apply RD to Princeton if you don't get in to Columbia. Unless you really don't want to apply anywhere else EA, I would ED to Columbia. If you are 100% sure that you want this to be your only early application, only then would I consider Princeton SCEA.",
              "author": "FuriousGeorge1435",
              "created": 1633892222,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg535yg": {
      "link": "/r/ApplyingToCollege/comments/q5e2ka/help_me_decide_my_edea/hg535yg/",
      "text": "Columbia. If financial needs doesn't match I think you can decide not to join the university even with the binding.",
      "author": "ConsistentVoice2227",
      "created": 1633895087,
      "upvotes": 3,
      "replies": {}
    }
  }
}