{
  "sid": "rhdwtm",
  "link": "/r/ApplyingToCollege/comments/rhdwtm/i_am_so_stressed_over_my_grades_rn/",
  "title:": "I am so stressed over my grades rn",
  "text": "I am a junior right now and I am taking three APs (APUSH, AP Chem, AP Comp Sci A). I am also taking precalc honors and I literally don’t get trig. I got my quiz over graphing trig functions back today and I got another C. It’s the fifth C in a row. I have a B- rn in the class overall. I also took the math chapter test today and I didn’t get the last problem. But I think I did okay. But I keep thinking I did okay on the tests and I get a C so idk anymore. I also want to go into computer science so my math grade is kinda important. \n\nThis year has been such a struggle for me so far. I had all As in 9th and 10th grade but this year, the only solid A I have is in English. Even my extracurriculars are overwhelming me rn. For example, I am part of a research lab rn and I got assigned a task to get a part of a project done. And it’s a lot of work and takes a lot of time/effort. On top of all that, I have been dealing with some health issues. I just feel so drained and stressed.",
  "author": "leaf0829",
  "created": 1639614811,
  "updated": 1639786711,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "hoputl8": {
      "link": "/r/ApplyingToCollege/comments/rhdwtm/i_am_so_stressed_over_my_grades_rn/hoputl8/",
      "text": "I don't know if this will be any consolation but I was terrible at pre calc. I didn't understand tri at all. I failed almost everything and have no idea how I got a B in that class. Calculus was way better for me. I got a 4.",
      "author": "mari512",
      "created": 1639615294,
      "upvotes": 3,
      "replies": {
        "hoqhz5k": {
          "link": "/r/ApplyingToCollege/comments/rhdwtm/i_am_so_stressed_over_my_grades_rn/hoqhz5k/",
          "text": "I was so scared for calculus but ur comment reassured me. Thank you!",
          "author": "leaf0829",
          "created": 1639625658,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoqa6fx": {
      "link": "/r/ApplyingToCollege/comments/rhdwtm/i_am_so_stressed_over_my_grades_rn/hoqa6fx/",
      "text": "Sorry to hear everyone is going through this. Please consider one of the best ways to try to turn things around is sidling up to your teacher. Ask for help. Ask for after-class sessions, for extra examples. Anything to develop a relationship with your teacher. This is crucial not only now but when you get to college. One of the best relationships you can nurture.",
      "author": "pupuphlatter",
      "created": 1639622175,
      "upvotes": 3,
      "replies": {
        "hoqhs7x": {
          "link": "/r/ApplyingToCollege/comments/rhdwtm/i_am_so_stressed_over_my_grades_rn/hoqhs7x/",
          "text": "I asked to meet her during lunch last week and I went through my past test with her. She explained it but I still didn't understand it that well. But then I nodded along like I did understand lol 💀💀",
          "author": "leaf0829",
          "created": 1639625571,
          "upvotes": 1,
          "replies": {
            "hoqidhz": {
              "link": "/r/ApplyingToCollege/comments/rhdwtm/i_am_so_stressed_over_my_grades_rn/hoqidhz/",
              "text": "But don’t, you’re short-changing yourself. And she won’t be happy if you spent that time nodding vs really figuring it out. The back-and forth (asking questions, reiterating to confirm understanding) is the gold.",
              "author": "pupuphlatter",
              "created": 1639625846,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hopv7j8": {
      "link": "/r/ApplyingToCollege/comments/rhdwtm/i_am_so_stressed_over_my_grades_rn/hopv7j8/",
      "text": "Fellow hs junior here - I feel you. I’m taking full IB atm and I’m getting the worst grades I’ve gotten in my life. They’re slipping and idk how to get back on track. My ECs take up so much time ta I could be using to improve my grades and idk. In 9th and 10th grade, I was a perfect top student lmao. I’ve been told to break everything down and focus on one issue at a time, and to use my holidays wisely. I hope that advice can help you. Wishing you the best!",
      "author": "Akira0615",
      "created": 1639615471,
      "upvotes": 2,
      "replies": {
        "hoqhvyn": {
          "link": "/r/ApplyingToCollege/comments/rhdwtm/i_am_so_stressed_over_my_grades_rn/hoqhvyn/",
          "text": "Thanks! I plan on getting a head start on the new chapter during winter break.",
          "author": "leaf0829",
          "created": 1639625617,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}