{
  "sid": "q7oa5u",
  "link": "/r/ApplyingToCollege/comments/q7oa5u/does_same_high_school_affect_acceptance/",
  "title:": "Does same high school affect acceptance?",
  "text": "I know someone else in my high school that’s applying early to the same college, and it’s pretty much a guarantee that they will get in. Does that mean I will have a lower chance? Sorry if this is a dumb question 😬",
  "author": "jumpupenguin",
  "created": 1634170839,
  "updated": 1634251664,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjzlib": {
      "link": "/r/ApplyingToCollege/comments/q7oa5u/does_same_high_school_affect_acceptance/hgjzlib/",
      "text": "Yea unfortunately",
      "author": "UpbeatAd2524",
      "created": 1634172526,
      "upvotes": 7,
      "replies": {}
    },
    "hgl3jhz": {
      "link": "/r/ApplyingToCollege/comments/q7oa5u/does_same_high_school_affect_acceptance/hgl3jhz/",
      "text": "Yes and no. I’ve heard stories of certain schools who tend to get N number of students into Y college yearly. Everyone sweats whether they’re in the top N. In reality these numbers aren’t set in stone (they increased at my HS, I know a private school where these numbers halved). \n\nDon’t forget: There can be a luck factor among highly qualified applicants. Maybe college C needs a certain number of students likely to participate in X and one of your ECs is X. Also, don’t underestimate the power of incredible essays to give yourself a potential edge over other highly qualified applicants.",
      "author": "E513",
      "created": 1634196239,
      "upvotes": 3,
      "replies": {}
    },
    "hgkf3ww": {
      "link": "/r/ApplyingToCollege/comments/q7oa5u/does_same_high_school_affect_acceptance/hgkf3ww/",
      "text": "Hi, I’m a high school college counselor. I can tell you that we provide colleges with what’s called a school report. It lays out what courses are available at your school. What colleges do is they compare your transcript to what is on the school report.\n\nIn other words, if you took more difficult courses or showed signs of growth in your transcript schools will notice that. \n\nAdditionally, it wouldn’t hurt to see if the college you’re considering offers interviews to prospective students.",
      "author": "Stunning_Culture_560",
      "created": 1634180057,
      "upvotes": 2,
      "replies": {}
    },
    "hgk09vn": {
      "link": "/r/ApplyingToCollege/comments/q7oa5u/does_same_high_school_affect_acceptance/hgk09vn/",
      "text": "Not necessarily. There is no min/max per HS. You may get in. You may not. But if you don't, it won't be because someone from the same HS applied.",
      "author": "skieurope12",
      "created": 1634172843,
      "upvotes": 0,
      "replies": {}
    },
    "hgkducn": {
      "link": "/r/ApplyingToCollege/comments/q7oa5u/does_same_high_school_affect_acceptance/hgkducn/",
      "text": "No, not really.  You're competing with the other applicants, not just those from your school.",
      "author": "RichInPitt",
      "created": 1634179438,
      "upvotes": 0,
      "replies": {}
    }
  }
}