{
  "sid": "qn0ca0",
  "link": "/r/ApplyingToCollege/comments/qn0ca0/advice_for_a_junior/",
  "title:": "advice for a junior?",
  "text": "I am currently a junior in highschool doing a decent job but nothing exceptional. My highschool is considered one of the top in the state and possibly the country, and i have a relatively competitive gpa (3.7ish unweighted). I am in the IB diploma program, with HL in english, econ, and history, as well as AP calc AB. I also got a 34 on my act. My targets are top flight state schools like UMich, UNC, and GT. I feel like these are reasonable goals for my stats, but a lot of the people here have me questioning that. My main concern is my noticeable lack of ECs. Do you guys have any advice on what i should do to improve my chances?",
  "author": "69pooman",
  "created": 1636076550,
  "updated": 1636135732,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hjd5msp": {
      "link": "/r/ApplyingToCollege/comments/qn0ca0/advice_for_a_junior/hjd5msp/",
      "text": "Find a passion and pursue it, colleges will want to know that you are a curious and driven person. That might mean joining clubs, volunteering (this is good regardless), jobs, internships, personal projects. Maybe you like computer science, so you teach yourself to code and make your own app or website. Maybe you like math so you find an internship/mentorship and write a paper on dynamical billiards. Whatever you do, it doesn't have to be \"curing cancer\" just explore your curiosity, find a passion, doing anything is better than nothing. Good luck!",
      "author": "Blue_Jay89",
      "created": 1636077933,
      "upvotes": 3,
      "replies": {
        "hjdsdas": {
          "link": "/r/ApplyingToCollege/comments/qn0ca0/advice_for_a_junior/hjdsdas/",
          "text": "Should the paper be under a professor?",
          "author": "fd430dfgjpogd3gfd2ds",
          "created": 1636090586,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}