{
  "sid": "qjgx5p",
  "link": "/r/ApplyingToCollege/comments/qjgx5p/honest_opinions_tamu_vs_ut_austin/",
  "title:": "honest opinions: TAMU vs UT Austin",
  "text": "As the title states, just looking for objective (and also subjective) comparisons between UT Austin and Texas A&M. I've been accepted to both colleges based on class rank (woo top 6%) and don't think I will have problems getting into my desired major at UT. That being said, I'm trying to weigh the pros and cons of each school. Here is some background info to help along with my own pros/cons. Thanks in advance!\n\nProposed Major: Bio/Biochem, planning on pursuing admission to med school\n\nUT  \nPros: more \"prestigious\" school, close to home (rrtx), Austin>Cstat in terms of prettiness, lots of stuff to do in austin, more diverse \n\nCons: dorms r meh, campus itself is pretty but I found it to be too \"busy\", realistically will be more expensive with cost of living factored in\n\n&#x200B;\n\nTAMU\n\nPros: older brother attends (same general plan in terms of career path so he can advise me as well as help me adjust), new city, better dorm options, realistically will be cheaper\n\nCons: less prestigious, racism? (I think this will be much less of a problem than I have been told by some people but the thought still lingers), farther from home, older brother attends (both a pro and a con lol)",
  "author": "hisokaseveredarm",
  "created": 1635650093,
  "updated": 1639813100,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiq6mup": {
      "link": "/r/ApplyingToCollege/comments/qjgx5p/honest_opinions_tamu_vs_ut_austin/hiq6mup/",
      "text": "I think the biggest con for me is that I’m probably going to see a lot of my classmates if I go to TAMU",
      "author": "ScarAdvanced9562",
      "created": 1635652738,
      "upvotes": 1,
      "replies": {
        "hiq71wv": {
          "link": "/r/ApplyingToCollege/comments/qjgx5p/honest_opinions_tamu_vs_ut_austin/hiq71wv/",
          "text": "I agree to an extent.  A majority of my friend group is gonna be going to TAMU, but at the same time, its a huge school. If you don't want to see them, you won't, if that makes sense. I still want to keep my old friends but I definitely want to branch out and meet new people as well:)",
          "author": "hisokaseveredarm",
          "created": 1635652989,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiq6n9w": {
      "link": "/r/ApplyingToCollege/comments/qjgx5p/honest_opinions_tamu_vs_ut_austin/hiq6n9w/",
      "text": "UT Austin",
      "author": "svday",
      "created": 1635652745,
      "upvotes": 1,
      "replies": {
        "hiq732v": {
          "link": "/r/ApplyingToCollege/comments/qjgx5p/honest_opinions_tamu_vs_ut_austin/hiq732v/",
          "text": "any specific reasons why?",
          "author": "hisokaseveredarm",
          "created": 1635653009,
          "upvotes": 1,
          "replies": {
            "hiqatfj": {
              "link": "/r/ApplyingToCollege/comments/qjgx5p/honest_opinions_tamu_vs_ut_austin/hiqatfj/",
              "text": "As you mentioned, you will get a richer, diverse experience. Studying in college where your brother is - more con than pro",
              "author": "svday",
              "created": 1635655424,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiu82cl": {
      "link": "/r/ApplyingToCollege/comments/qjgx5p/honest_opinions_tamu_vs_ut_austin/hiu82cl/",
      "text": "I’m at A&M and I have not seen any racism occur since being down here. \n\nI would attend UT though. Only way you should come here is if finances can be an issue, as living in CStat is cheaper than Austin.",
      "author": "NakedWalmartShopper",
      "created": 1635733280,
      "upvotes": 1,
      "replies": {}
    },
    "hm0ejs9": {
      "link": "/r/ApplyingToCollege/comments/qjgx5p/honest_opinions_tamu_vs_ut_austin/hm0ejs9/",
      "text": "currently a freshman biochem major who's also premed at UT & and i do not regret my decision choosing UT at all :) i suggest choosing the best financial option for you tbh but if you can afford it, UT is a great school !",
      "author": "nylleve",
      "created": 1637826327,
      "upvotes": 1,
      "replies": {}
    }
  }
}