{
  "sid": "reu650",
  "link": "/r/ApplyingToCollege/comments/reu650/shane_hummus_on_youtube/",
  "title:": "Shane Hummus on Youtube",
  "text": "What do y'all think of him, fellow A2Cers? Personally I think he throws way too much of an emphasis on degrees that will make you money, rather than passions. It seems like almost every video he bashes the idea of majoring in something like history or other social sciences/humanities. \n\nAnother thing that irks me since I'm considering a psych degree, and my masters, is that he really dismisses the idea that some undergrad degress ARE stepping off points for grad school, which is why his hyperfocus just on undergrad dismisses some of these fields. I'm concerned that some of his videos will push people who aren't passionate about certain STEM areas (specifically his focus on engineering and compsci) to just go for the major because he's said they can make a bunch of money. \n\n\n\nTl;dr Shane Hummus' major/college advice annoys me",
  "author": "gouverneurmroosevelt",
  "created": 1639331423,
  "updated": 1639514812,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hoa50zd": {
      "link": "/r/ApplyingToCollege/comments/reu650/shane_hummus_on_youtube/hoa50zd/",
      "text": "Guy is a tool",
      "author": "chumer_ranion",
      "created": 1639336094,
      "upvotes": 2,
      "replies": {}
    },
    "ho9w5uc": {
      "link": "/r/ApplyingToCollege/comments/reu650/shane_hummus_on_youtube/ho9w5uc/",
      "text": "From looking at his website, this Shane guy is probably easy to dismiss out of hand. Same would go for the vast majority of people marketing stuff on YouTube :).",
      "author": "deportedtwo",
      "created": 1639332707,
      "upvotes": 2,
      "replies": {
        "ho9y0sy": {
          "link": "/r/ApplyingToCollege/comments/reu650/shane_hummus_on_youtube/ho9y0sy/",
          "text": "I didn't even know he had a website. Yeah it looks even worse than his Youtube.",
          "author": "gouverneurmroosevelt",
          "created": 1639333423,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ho9zgm3": {
      "link": "/r/ApplyingToCollege/comments/reu650/shane_hummus_on_youtube/ho9zgm3/",
      "text": "If you can be swayed to go for a different major (and stick to that major throughout college), your passion wasn’t that passionate to begin with. \n\nI think it’s a fair point, the one about degrees being stepping stones (general bio majors says whaaat).  That said, graduate school is an additional financial dedication, and it requires more planning and long-term commitment than I expect from the typical (atleast American) teenager.",
      "author": "SupermarketWild3834",
      "created": 1639333981,
      "upvotes": 2,
      "replies": {}
    }
  }
}