{
  "sid": "q68mol",
  "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/",
  "title:": "Fasfa assets and income?",
  "text": "My mother only works and she making around less than 26k a year. She has me n other sibling, would this be considered low income for Fasfa? I have 11k saved in my account because of buying a car? What should I do? To lower the efc or get more Aid bc I feel like this sucks when i know if I go 4 years it’s going to cost 10s of thousands. Advice on what I should do? Should I just submit it with all the info or should I buy a car first then submit it? Would it be too late if I submit it in late October or November?",
  "author": "asianforlife-79",
  "created": 1633994668,
  "updated": 1634072957,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgahhle": {
      "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgahhle/",
      "text": "Run the ***Net Price Calculator*** on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based estimate before you apply. You can run the calculator with different scenarios to see if your results are any different.\n\nSometimes Net Price Calculators are inaccurate for complicated family finances such as divorce or owning a business/rental property/farm if the NPC fails to ask. Students with more complex situations should consider calling the financial aid office with questions.\n\nKeep in mind that many colleges require other financial aid forms in addition to FAFSA, such as the CSS Profile. Many colleges also require info on noncustodial parent income and assets.",
      "author": "elkrange",
      "created": 1633996271,
      "upvotes": 2,
      "replies": {
        "hgaj355": {
          "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgaj355/",
          "text": "Ok thank you I’ll try that",
          "author": "asianforlife-79",
          "created": 1633997058,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgai8qb": {
      "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgai8qb/",
      "text": "Check if you even need to provide your account balance  -- at that kind of income you are probably going to qualify for the simplified needs test and they won't require your savings balance in many states.\n\n[https://studentaid.gov/help/simplified-needs-test](https://studentaid.gov/help/simplified-needs-test)\n\nFor most kinds of aid late October or November is going to be fine. The only kind of aid where I'd expect waiting until November to matter would be state grants for in-state public schools - it's probably still fine but that's the kind of aid that usually runs out first.",
      "author": "BrawnyAcolyte",
      "created": 1633996649,
      "upvotes": 1,
      "replies": {
        "hgc3gcx": {
          "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgc3gcx/",
          "text": " Is it advised to skip the assets if I can? Will that affect me more on my aid? Because I re enter the application and it said “do you want to skip the remaining question about your parents assets”.",
          "author": "asianforlife-79",
          "created": 1634031388,
          "upvotes": 1,
          "replies": {
            "hgcgvtj": {
              "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgcgvtj/",
              "text": "I would skip it unless some school you are applying to says you can't.\n\nThat option only comes up when you qualify for the simplified needs formula, so when it calculates your EFC that info doesn't get used even if you do fill it in (that's explained on the link I put in above).",
              "author": "BrawnyAcolyte",
              "created": 1634041259,
              "upvotes": 2,
              "replies": {
                "hgd3oku": {
                  "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgd3oku/",
                  "text": "Oh ok, where do you find if they require the assets part of the section?  Thank you for clarification of the Fasfa.",
                  "author": "asianforlife-79",
                  "created": 1634052145,
                  "upvotes": 1,
                  "replies": {
                    "hgdauf4": {
                      "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgdauf4/",
                      "text": "You can just email their financial aid office.  \n\nI think most schools that would want that info are probably going to require the CSS profile anyway - the whole point of the simplified needs test for FAFSA is that it's obvious you have significant need (usually EFC of zero) and they don't need extra data to make that determination.",
                      "author": "BrawnyAcolyte",
                      "created": 1634055053,
                      "upvotes": 2,
                      "replies": {
                        "hgdd8m5": {
                          "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgdd8m5/",
                          "text": "Thank you very much for the assistance.",
                          "author": "asianforlife-79",
                          "created": 1634056038,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgba7nw": {
      "link": "/r/ApplyingToCollege/comments/q68mol/fasfa_assets_and_income/hgba7nw/",
      "text": "Buy the car before you apply for aid. They want you, the student, to spend your savings before they give you free money.",
      "author": "SpacerCat",
      "created": 1634009583,
      "upvotes": 1,
      "replies": {}
    }
  }
}