{
  "sid": "quluga",
  "link": "/r/ApplyingToCollege/comments/quluga/colleges_who_have_high_emphasis_on_essays_and/",
  "title:": "Colleges who have high emphasis on essays, and less so on ECs?",
  "text": "This is more pointed towards T20s; which obviously place a huge emphasis on both given the competitive pool. But I’ve definitely seen people who have gotten into schools like Stanford with average ECs and really genuine essays (ofc great academics), so i was wondering if there were any similar cases.\n\n(I know it’s obviously a holistic application and those cases are the exceptions and probably 1 in thousands)",
  "author": "mochanight",
  "created": 1636997948,
  "updated": 1637179645,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hkqt1s4": {
      "link": "/r/ApplyingToCollege/comments/quluga/colleges_who_have_high_emphasis_on_essays_and/hkqt1s4/",
      "text": "This post raises so many interesting questions because it’s been cited so often that certain T20s do emphasize portions of the application more than other T20s.\n\nMy question is what does emphasizes? I want to here third party perspectives on this school in particular.",
      "author": "Confident_Dust799",
      "created": 1636998277,
      "upvotes": 3,
      "replies": {}
    },
    "hkqy64u": {
      "link": "/r/ApplyingToCollege/comments/quluga/colleges_who_have_high_emphasis_on_essays_and/hkqy64u/",
      "text": "if you look up “____ common data set” for any school you’ll find a pdf w a checklist of what they prioritize on their app",
      "author": "chobaniflipcup",
      "created": 1637000301,
      "upvotes": 3,
      "replies": {}
    },
    "hks6pdu": {
      "link": "/r/ApplyingToCollege/comments/quluga/colleges_who_have_high_emphasis_on_essays_and/hks6pdu/",
      "text": "reed college is not a t20 but is comparative to a t20 when it comes to getting students into grad school, and cares a lot about essays",
      "author": "blueb1rb",
      "created": 1637018026,
      "upvotes": 1,
      "replies": {}
    },
    "hkrnjvu": {
      "link": "/r/ApplyingToCollege/comments/quluga/colleges_who_have_high_emphasis_on_essays_and/hkrnjvu/",
      "text": "i would say uchicago and stanford come to mind? but ofc this is 100% just from my head lol. i wld also say harvard if you have genuinely AMAAAAAAAAAAZZZZZZIIIIIIIIINNNG essays, good grades and test scores, and a couple leadership positions in clubs ur in",
      "author": "starshinez05",
      "created": 1637010288,
      "upvotes": 0,
      "replies": {}
    }
  }
}