{
  "sid": "qw8sj4",
  "link": "/r/ApplyingToCollege/comments/qw8sj4/id_really_appreciate_some_help_on_this/",
  "title:": "I'd REALLY appreciate some help on this",
  "text": "Hi.\n\nI just passed out of High School, and did IB for about 5 years (8-12). I had very good grades and used to be one of the top students in my class, until online school started which completely blew me off the track. I also had a lot of other stuff going on at school which made me depressed and I probably should have done something about it. I couldn't deal with it and my grades started slipping in the last year of my high school. I wanted to go to a good Canadian university, such as University of Toronto or UBC but I didn't have the predicted grades to apply for them. I instead ended up getting an conditional offer to University of Waterloo (Honours Arts & Business), which I was pretty content about.\n\nFast forward 2 months, because of Covid, final exams didn't happen. All my final grades were loosely based on my predicteds and due to not having great IAs, my grade went down. My Waterloo offer ended up going away and I had no idea what to do. I felt heartbroken.\n\nI kinda feel useless right now as I missed the Fall Intake and I still have no idea what to do. I did, however, receive an alternate offer from Wilfrid Laurier University for a BA Global Studies course but I don't like the course all that much and I REALLY want to study Business/Economics. I thought that my best bet would be to get very good grades in the First year, even though I don't like the course, and then transfer afterwards. I really want to hear another persons opinion on this as I am really lost and don't know what to do.\n\nI really feel that if I was given another chance at redeeming myself I would take it in a heartbeat, as getting rejected from universities is probably the worst feeling ever.",
  "author": "Aggravating-Fly7648",
  "created": 1637182605,
  "updated": 1637353586,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hl1zu32": {
      "link": "/r/ApplyingToCollege/comments/qw8sj4/id_really_appreciate_some_help_on_this/hl1zu32/",
      "text": "Laurier is actually a pretty good university, but I'm not sure how the transfer process works in Canada - since you're going in for a program that you don't like as much, I would find out more about the likelihood of changing your program and/or your university later on before going ahead with it.",
      "author": "prsehgal",
      "created": 1637193424,
      "upvotes": 1,
      "replies": {}
    }
  }
}