{
  "sid": "qgt1e7",
  "link": "/r/ApplyingToCollege/comments/qgt1e7/i_messed_up_on_my_csu_application/",
  "title:": "I messed up on my CSU application…",
  "text": " Completely my fault for submitting an application at two in the morning. I’m not even sure how to go about this, but I made two minor errors on my application. I said my parent was a permanent resident of California since birth when they are not. I also selected that I wasn’t apart of a educational program when I was. I didn’t know that it went by a different name. Now I can’t make any changes AT ALL. I’m stressed. What do I do? These are my safeties. Did I ruin my chances of going to college? I’ve only submitted to one school so far.",
  "author": "OkDoughnut994",
  "created": 1635328287,
  "updated": 1635456489,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi8eskz": {
      "link": "/r/ApplyingToCollege/comments/qgt1e7/i_messed_up_on_my_csu_application/hi8eskz/",
      "text": "The only way to edit those things is to email the admissions offices for each school directly. Should you? Well it won’t hurt you if you do. They don’t admit based on impressions. This is their advice: https://help.liaisonedu.com/Cal_State_Apply_Applicant_Help_Center/Starting_Your_Cal_State_Apply_Application/1_Getting_Started_with_Your_Cal_State_Application/00_Cal_State_Apply_Quick_Start_Guide\n\nThe only CSU that I know uses something like participated in Avid as part of their admissions is Cal Poly, but things did change with test scores out the window. See if you can find out how admissions scores are calculated for the schools you applied to. For example this is SJSU: https://www.sjsu.edu/admissions/impaction/index.php. If the schools you applied to don’t give points for that educational program, just leave it be.\n\nHas your parent been a California resident for the past 3 years? If so that’s not worth fixing either. If your parent is not a resident or has only been a resident for a year, that might affect your residency status. Is your other parent not a resident? If so, better contact your campuses.if it’s not going to change your residency I doubt it’s a big deal but you can contact the campus just so you don’t stress over it. \n\nI think you might be able to edit it for schools you havent submitted to the way you can the common app but I’m not sure. You could try contacting their tech support team if you plan to apply to a few more. \n\nYou should definitely check the points needed for your major on that SJSU site and calculate yours. If you fall above the range there then these schools are probably ok as safeties. But it can be easier for some people to get into a UC in a major like CS or engineering because they consider life stories and extracurriculars. Every spring there are shocked students who were so sure SDSU was a safety that get rejected and don’t understand why people with lower stats got in. It’s all about the major you put down. \n\nPersonally I think the better safety is community college because with the TAG program you can have guaranteed admission to Davis, UCSB or UCI in most majors. And if you have a bunch of AP or dual enrollment credits you can transfer after just a year. https://admission.universityofcalifornia.edu/admission-requirements/transfer-requirements/uc-transfer-programs/transfer-admission-guarantee-tag.html\nTransfer admission saves you some money and acceptance rates are a bit higher. https://www.universityofcalifornia.edu/infocenter/transfers-major",
      "author": "RetiringTigerMom",
      "created": 1635333060,
      "upvotes": 1,
      "replies": {}
    }
  }
}