{
  "sid": "r56293",
  "link": "/r/ApplyingToCollege/comments/r56293/will_a_twoyear_high_school_to_college_gap_hurt_my/",
  "title:": "Will a two-year high school to college gap hurt my chances at admission to an Ivy League or any scholarship/college? (Read Desc. for more details)",
  "text": "So I have the opportunity to take a $110,000 research and development grant after I graduate high school to pursue building a business with a product line already being developed by me, and I feel I could have a very successful startup due to the finances from the grant and the connections that come with it. I have been excelling at academics, taking various AP classes and having a personalized curriculum due to my advancements, and having amazing extracurriculars like doing advanced robotics/AI development, teaching a class in Computer Science at my high school, and just doing some great work with my projects in the STEM field.\n\nI wanted to see if taking this two-year gap before applying to an Ivy League like MIT part-time while running my company would hurt my chances, even though I am doing some great work with that time.\n\nIf it would not hurt my chances, do you have any advice on how to manage this college gap? Are there specific processes I should go through, or just apply after the two-year gap is over?\n\nThanks for your time.",
  "author": "blevlabs",
  "created": 1638221039,
  "updated": 1638479361,
  "over_18": false,
  "upvotes": 18,
  "upvote_ratio": 0.91,
  "comments": {
    "hml8241": {
      "link": "/r/ApplyingToCollege/comments/r56293/will_a_twoyear_high_school_to_college_gap_hurt_my/hml8241/",
      "text": "I would say that what you’re doing would be a great hook for a school to take you on.\n \nWould it be worth speaking to an Admissions Officer? Who knows what could become of that discussion. Or find the head of a department in which you’d be studying and shoot that person an email asking for guidance. \n\nI feel like instead of staying completely out, a connection could be made to bridge that gap and stay connected somehow. If at the end of two years nothing happens would that reflect poorly if you haven’t had a connection the whole time… idk?\n\nBtw, MIT isn’t an Ivy. And where is the grant coming from?",
      "author": "pupuphlatter",
      "created": 1638225689,
      "upvotes": 15,
      "replies": {
        "hml9xal": {
          "link": "/r/ApplyingToCollege/comments/r56293/will_a_twoyear_high_school_to_college_gap_hurt_my/hml9xal/",
          "text": "Thank you for your insights! I feel that would be a good route to take. I have contacted MiT in the past to no avail, but that was a very long time ago. I am currently working on getting some connections with MIT staff right now which would likely help my ability to contact head of departments or admission staff at the college.",
          "author": "blevlabs",
          "created": 1638226476,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmle8b9": {
      "link": "/r/ApplyingToCollege/comments/r56293/will_a_twoyear_high_school_to_college_gap_hurt_my/hmle8b9/",
      "text": "As long as you throughly explain what you were doing during your gap year, you’ll be fine! Especially if it’s a good opportunity",
      "author": "vickycoco___",
      "created": 1638228354,
      "upvotes": 6,
      "replies": {
        "hmlehez": {
          "link": "/r/ApplyingToCollege/comments/r56293/will_a_twoyear_high_school_to_college_gap_hurt_my/hmlehez/",
          "text": "Thanks! I appreciate your response. That seems the most logical and appropriate response to my case but I just want to be sure.",
          "author": "blevlabs",
          "created": 1638228467,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}