{
  "sid": "quiml0",
  "link": "/r/ApplyingToCollege/comments/quiml0/best_schools_for_environmental_science_major_with/",
  "title:": "Best schools for environmental science major (with possible end goal of restoration ecology)?",
  "text": "Class of 2023 here, so it's not urgent, but I'd like to have an idea as to which schools I should apply next year. \n\nI'm thinking of going into an environmental science related field, and would love to eventually become a restoration ecologist. Currently, I have 12 schools on my CollegeVine list, ranging from state schools to tech schools to West Point.\n\nFirstly, do these schools and this career goal seem feasible for a student like myself? I have a 4.0 GPA so far (praying it holds up), and took 5 honors classes between 9th and 10th grade, but will have only taken 4 APs as of the end of this year (planning on 7-8 total). Currently, my main target schools are West Point and Rensselaer Polytechnic. Backups include Virginia Tech, UNC Pembroke, William and Mary, Old Dominion and UCONN.\n\nDo my plans look realistic? Are there any other schools you might recommend for environmental science and/or restoration ecology? Keep in mind that I can't afford Ivy League--in costs both monetary and in terms of workload stress.",
  "author": "Romansesque_grouse",
  "created": 1636989253,
  "updated": 1637179724,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hkqa4e0": {
      "link": "/r/ApplyingToCollege/comments/quiml0/best_schools_for_environmental_science_major_with/hkqa4e0/",
      "text": "the UHawaii system or UMiami are something to look into, especially if you’re interested in aquatic ecology restoration!",
      "author": "pakeena",
      "created": 1636990639,
      "upvotes": 2,
      "replies": {}
    },
    "hkqr4wy": {
      "link": "/r/ApplyingToCollege/comments/quiml0/best_schools_for_environmental_science_major_with/hkqr4wy/",
      "text": "UC Davis, maybe?",
      "author": "starconifer",
      "created": 1636997526,
      "upvotes": 1,
      "replies": {}
    },
    "hkqr7ec": {
      "link": "/r/ApplyingToCollege/comments/quiml0/best_schools_for_environmental_science_major_with/hkqr7ec/",
      "text": "Those schools seem like a reasonable mix, assuming you are accounting for costs and lack of aid at those out of state public schools.  Are you looking at doing ROTC as an alternative to West Point?\n\nSchools that have strong forestry programs can be really good for ecology and are worth a look.  SUNY ESF is the one that comes to mind for the region of the country your options are in.  Oregon State, Humboldt State, and Colorado State are good programs in the western US.",
      "author": "BrawnyAcolyte",
      "created": 1636997552,
      "upvotes": 1,
      "replies": {}
    }
  }
}