{
  "sid": "r4pagt",
  "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/",
  "title:": "part-time job vs volunteering",
  "text": "hello! i'm currently a junior and i'm deciding between more volunteering hours or a part-time tutor/retail/barista job. assuming that both will be the same time commitment, which one should i choose?\n\ni've listed some of my reasoning below but i still can't choose. i'm not in a tight spot with money, but i spare cash on hand would be appreciated. i have satisfactory stats, but extremely lacking in ECs. i'm aiming for T20s and morally speaking it's a little shitty that i'll be basing my decision off of how it looks to colleges, but yeah...\n\npros for volunteering:  \n\\-community engagement  \n\\-more meaningful to colleges ig \n\ncons for volunteering:  \n\\-i don't have volunteer opportunities planned out yet  \n\\-would not be something major like thousands raised for charity\n\npros for work:  \n\\-$$$ (california min wage 😍 )  \n\\-real life experience  \n\\-already have a few offers\n\ncons for work:  \n\\-weak story to build around this EC  \n\\-might be temp/seasonal positions",
  "author": "garlicpowders",
  "created": 1638166629,
  "updated": 1638204520,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hmi6xxv": {
      "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmi6xxv/",
      "text": "Personally I’d go for the part time job. Ideally something that won’t be too short, even if it’s temporary. Actual job experience is a good place to get a lot of experiences that can come in handy when writing essays and answering interview questions imo. If you’re concerned about how colleges will see it, many top colleges will like seeing an actual job on your application. Spare money is a nice bonus and the fact that once you’re in college, if you’re interested in applying for on-campus jobs, I’ve seen multiple (at least at my college) that require/strongly desire previous job experience of some sort, often related to customer service.",
      "author": "rainingsiberiancats",
      "created": 1638169163,
      "upvotes": 6,
      "replies": {
        "hmi7phg": {
          "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmi7phg/",
          "text": "right, i think another pro i should add to the job list is that it guarantees interaction with customers and i kind of want to force myself into more social situations if that makes sense. thank you!",
          "author": "garlicpowders",
          "created": 1638169722,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmi6egs": {
      "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmi6egs/",
      "text": "I’d recommend a part-time job, but that’s just me",
      "author": "ScarAdvanced9562",
      "created": 1638168766,
      "upvotes": 3,
      "replies": {
        "hmi7m89": {
          "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmi7m89/",
          "text": "thank you! any reasoning or just a feeling?",
          "author": "garlicpowders",
          "created": 1638169656,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmi9a80": {
      "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmi9a80/",
      "text": "if ur lacking in ECs it definitely sucks but go for volunteering… i went for the job option and now i am majorly regretting it. check what the schools you are aiming for value — but T20s will prob want proof of lots of community engagement. try going for something related to what u want to major in, like volunteering at a representative’s office if ur into politics.",
      "author": "Hot-Captain-7941",
      "created": 1638170912,
      "upvotes": 3,
      "replies": {
        "hmif6sm": {
          "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmif6sm/",
          "text": "i'm interested in english and econ so one of the cons for volunteering is that there just isn't that many opportunities catered to those specific interests. but community engagement is def key so i will have to keep that in mind, thank you!",
          "author": "garlicpowders",
          "created": 1638175637,
          "upvotes": 1,
          "replies": {
            "hmifqnd": {
              "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmifqnd/",
              "text": "np! maybe volunteer at a local library or with little kids reading books or writing or something for english :) gl !!",
              "author": "Hot-Captain-7941",
              "created": 1638176100,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hmid87k": {
      "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmid87k/",
      "text": "Part time job. You’d be getting the same people experience and money is kind of a big pro in my opinion if you’re a good saver",
      "author": "meo6",
      "created": 1638174019,
      "upvotes": 3,
      "replies": {
        "hmif9xx": {
          "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmif9xx/",
          "text": "however for volunteering there's more of a philanthropist angle and imo it sounds more appealing for personal development. but lmao yes money",
          "author": "garlicpowders",
          "created": 1638175710,
          "upvotes": 1,
          "replies": {
            "hmjmdsw": {
              "link": "/r/ApplyingToCollege/comments/r4pagt/parttime_job_vs_volunteering/hmjmdsw/",
              "text": "I don't know this, so take it with a grain of salt. Volunteering to me always reeks of 'well off teenager who is pushed to dabble in something because it will look good to colleges.' It doesn't require the commitment and hours that a job does.",
              "author": "Lupus76",
              "created": 1638202395,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}