{
  "sid": "qgyzxc",
  "link": "/r/ApplyingToCollege/comments/qgyzxc/what_are_the_easiest_majors_to_apply_with_and_is/",
  "title:": "What Are The Easiest Majors To Apply With? And Is Choosing A Different Major For Application Then Switching When Accepted A Good Idea?",
  "text": "You could have a 4.0 with a 1600 and still get rejected because your major is computer science. I don't want to study cs, I'd like to get a degree in business administration but that's super popular as well. I was wondering if I should apply with a different major then switch if I'm accepted. If it means anything, I live in California and will only be applying to UCs and CSUs for financial reasons.",
  "author": "SebastianDeJesus",
  "created": 1635347757,
  "updated": 1635456445,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hi99m0q": {
      "link": "/r/ApplyingToCollege/comments/qgyzxc/what_are_the_easiest_majors_to_apply_with_and_is/hi99m0q/",
      "text": "Chances are that whatever major you think you’re going to “switch into” will be harder to switch into than it would have been to get accepted into in the first place. Especially CS, engineering, business, and nursing.  At many schools switching into these majors is specifically prohibited... for just this reason.",
      "author": "Strict-Special3607",
      "created": 1635348253,
      "upvotes": 3,
      "replies": {}
    },
    "hi99qsx": {
      "link": "/r/ApplyingToCollege/comments/qgyzxc/what_are_the_easiest_majors_to_apply_with_and_is/hi99qsx/",
      "text": "Apply to the major you want to study. \n\nSwitching into business later may have its own challenges and is not guaranteed. You can find information about transferring into business on the colleges' websites.",
      "author": "elkrange",
      "created": 1635348307,
      "upvotes": 2,
      "replies": {}
    },
    "hi9dsv0": {
      "link": "/r/ApplyingToCollege/comments/qgyzxc/what_are_the_easiest_majors_to_apply_with_and_is/hi9dsv0/",
      "text": "Agreed 100 percent what the others are saying. Apply for the major you want — especially if it’s one of the impacted majors like cs, engineering, or business and you won’t be happy in any other majors. Don’t apply expecting to transfer majors. It’s often more difficult than transferring colleges. \n\nBut if the college is more important than the major, spend some time looking at the unimpacted majors and come up with some that interest you and that you think you’d like and can see a future in.  Just don’t expect to be able to transfer into the impacted majors",
      "author": "admissionsmom",
      "created": 1635349966,
      "upvotes": 2,
      "replies": {}
    },
    "hi992v4": {
      "link": "/r/ApplyingToCollege/comments/qgyzxc/what_are_the_easiest_majors_to_apply_with_and_is/hi992v4/",
      "text": "Apply with your major, switching is not recommended unless its a direct similar branch , computer science or computer engineering. You will end up taking classes that are not required for your major and wasting time and most importantly, money.",
      "author": "Jncaffeine",
      "created": 1635348040,
      "upvotes": 1,
      "replies": {}
    },
    "hi9fz5h": {
      "link": "/r/ApplyingToCollege/comments/qgyzxc/what_are_the_easiest_majors_to_apply_with_and_is/hi9fz5h/",
      "text": "You are not the first one to think of that nor the last one. University knows past records of similar pattern. They will also check if your background supports your indicated major. It will only hurt your case if university feels you are gaming them.",
      "author": "svday",
      "created": 1635350842,
      "upvotes": 1,
      "replies": {}
    },
    "hiartaw": {
      "link": "/r/ApplyingToCollege/comments/qgyzxc/what_are_the_easiest_majors_to_apply_with_and_is/hiartaw/",
      "text": "Schools with difficult CS admission also have very difficult CS transfer. This is true of most high demand majors. “Backdoor” applications are generally a bad idea. Apply where you want to be.\n\nUW says it the most clearly, but this is true elsewhere.\n\n>If you’re not admitted directly as a freshman, it’s unlikely you’ll be admitted to either computer science or computer engineering as a UW student.",
      "author": "RichInPitt",
      "created": 1635369446,
      "upvotes": 1,
      "replies": {}
    }
  }
}