{
  "sid": "q86nhy",
  "link": "/r/ApplyingToCollege/comments/q86nhy/urgent_submitting_test_scores/",
  "title:": "Urgent: Submitting Test Scores",
  "text": "Hello A2C, I have to submit an application today however I have not gotten my SAT test results back yet. However I do want to report them later on when they come. What do I do in the Common App Testing Section? Do I just leave it as I do not want to report, or that I do want to report? When I do click report the test scores, it tells me to input the amount of scores I want to report, If I click any number more than 0 it requires me to specify my sat sub scores.",
  "author": "Longjumping-Tank5602",
  "created": 1634238997,
  "updated": 1634251531,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgney02": {
      "link": "/r/ApplyingToCollege/comments/q86nhy/urgent_submitting_test_scores/hgney02/",
      "text": "Check each of your colleges' websites to see what score reporting methods they accept. Many colleges now accept scores self-reported in the app (or portal), for free, to be followed by an official report only if you later enroll. Other colleges still require official score reports sent directly from the testing agency prior to admission",
      "author": "elkrange",
      "created": 1634240655,
      "upvotes": 1,
      "replies": {}
    },
    "hgnf3ld": {
      "link": "/r/ApplyingToCollege/comments/q86nhy/urgent_submitting_test_scores/hgnf3ld/",
      "text": "First, check to see if the school you're applying to accepts scores after the application deadline. \n\nMost do, but if your school doesn't, you're probably SOL\n\nIf they do, you should probably just leave the testing section blank and either report the score on the college's specific portal once they send it to you after you apply, or email the school an application update after submitting and getting your score (or both, or whatever process they list on their website to send them updates)",
      "author": "freeport_aidan",
      "created": 1634240719,
      "upvotes": 1,
      "replies": {}
    },
    "hgnq8q7": {
      "link": "/r/ApplyingToCollege/comments/q86nhy/urgent_submitting_test_scores/hgnq8q7/",
      "text": "You have no score to report, but have one coming? Seems to me you would answer 0 for “past SAT scores” and 1 for “number of future SAT sittings”. Am I missing something?\n\nAfter you submit, the portal you are provided by the school will almost certainly provide a place to report scores when they arrive.\n\nI assume this is GT or another 10/15 due date? Otherwise, just wait for scores.\n\n(if it is GT, there’s a big “View and Self-Report Test Scores” button on the main application status page.)",
      "author": "RichInPitt",
      "created": 1634245323,
      "upvotes": 1,
      "replies": {}
    }
  }
}