{
  "sid": "qhmfx6",
  "link": "/r/ApplyingToCollege/comments/qhmfx6/uva_loco_parentis_section/",
  "title:": "UVA loco parentis section",
  "text": "Hi! I’m a bit confused with the uva app and have a question for any Virginia resident doing the loco parentis thing, what do I put for the loco parentis section? I don’t have anyone acting in loco parentis but it also says if you don’t complete this section then you’ll be reviewed as non-Virginian.. so what should I do?",
  "author": "Syrus3800",
  "created": 1635425837,
  "updated": 1635455860,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hidk1v8": {
      "link": "/r/ApplyingToCollege/comments/qhmfx6/uva_loco_parentis_section/hidk1v8/",
      "text": "I'm obviously at UVA and have my test student account open. The language is for people who have a guardian claiming them as a dependent (as opposed to a parent) to be considered VA residents. \n\n>1. Do you believe you qualify for in-state privileges?\\*  \n>  \n>2. Do you believe you qualify for in-state privileges based upon the Virginia domicile of your parent, spouse or legal guardian?\\*  \n>  \n>3. Do you believe you qualify for in-state privileges based upon the Virginia domicile of a person with whom you lived during the past year who is acting in loco parentis?\\*\n\nFWIW, you should just call schools directly with questions this specific to get a correct answer. I just happened to see this question, but most colleges don't have anyone on reddit.",
      "author": "UVaDeanj",
      "created": 1635426438,
      "upvotes": 2,
      "replies": {
        "hidnyku": {
          "link": "/r/ApplyingToCollege/comments/qhmfx6/uva_loco_parentis_section/hidnyku/",
          "text": "Ah ok that makes sense, and thank you! I will make sure to do that in the future if I have questions",
          "author": "Syrus3800",
          "created": 1635428290,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}