{
  "sid": "rfpb0m",
  "link": "/r/ApplyingToCollege/comments/rfpb0m/importance_of_sports/",
  "title:": "Importance of Sports",
  "text": "I’m currently a freshman in high school, and I was wondering how important sports are to get into schools like Ivies, MIT, Caltech, etc. I’m being told I should do a sport, but I’m worried I won’t:\na) enjoy it\nb) or it’ll take up too much of my time\nDo schools really look at sports? I know it’s a bit early to think about college but I don’t want to risk missing out on something",
  "author": "Horror-Interaction23",
  "created": 1639427471,
  "updated": 1639514222,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hofafic": {
      "link": "/r/ApplyingToCollege/comments/rfpb0m/importance_of_sports/hofafic/",
      "text": "Unless you're getting recruited, it's just going to be another EC\n\nAdmissions aside, I think there's personal value to be had in terms of being on a team and having something you can focus on, especially physical activity, but \"oh wow this kid was a JV soccer benchwarmer!\" isn't something anyone's going to care about",
      "author": "freeport_aidan",
      "created": 1639428162,
      "upvotes": 5,
      "replies": {
        "hofhufv": {
          "link": "/r/ApplyingToCollege/comments/rfpb0m/importance_of_sports/hofhufv/",
          "text": "Would being a track sprinting captain be considered just another EC too?",
          "author": "AgitatedApartment533",
          "created": 1639431222,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hogtao6": {
      "link": "/r/ApplyingToCollege/comments/rfpb0m/importance_of_sports/hogtao6/",
      "text": "Do it because you want to do it, not because someone told you it would impress a college.",
      "author": "jjhoster",
      "created": 1639452629,
      "upvotes": 1,
      "replies": {}
    },
    "hofc3kp": {
      "link": "/r/ApplyingToCollege/comments/rfpb0m/importance_of_sports/hofc3kp/",
      "text": "It’s not important at all (unless you’re tryna get recruited)",
      "author": "Ok_Place2147",
      "created": 1639428880,
      "upvotes": 0,
      "replies": {
        "hog4nz8": {
          "link": "/r/ApplyingToCollege/comments/rfpb0m/importance_of_sports/hog4nz8/",
          "text": "Not true. They can show commitment and time management, and if you've seen Harvard's released admission files getting a \"1\" or a \"2\" can help greatly, with a \"1\" being almost guaranteed acceptance.\n\n1 is for recruited athletes, but 2 is for 'Strong secondary school contribution in one or more areas; possible leadership role(s)'. Considering that getting an athletic rating of 1 boosts admissions chances to 88%, and getting 3 2's and 1 3 (in your academic, athletic, extracurricular, and personal rating) boosts admissions chances to 43%, they can be very important.",
          "author": "StonkToro",
          "created": 1639441372,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}