{
  "sid": "g8qo8i",
  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/",
  "title:": "Does reading this subreddit make anyone else want to shoot themselves?",
  "text": "In high school, I was an excellent student. 9 AP classes, a 4.3 GPA, and a top 1 percent SAT. I visited a state school with a 1400 average SAT and loved the campus. I felt great. I picked a major, Business/Finance, because I felt that’s what I felt was the best fit for me and my ECs.\n\nI come here and start reading. And reading. And reading. I see both my school and major get shit on with no opportunity to succeed to life. I understand that this is an elitist subreddit but jesus christ it makes me feel like I have no hope for the future and no path that will ever make me successful. \n\nI should probably stop reading but I keep on coming back here to validate myself and my major but I realize how dumb that is and how it is futile. I keep on second guessing my school and my major even though I should be thrilled to have the opportunity to study and develop there.\n\nI am sure that some of y’all share the same sentiment and occasionally some of the judgement may be true but damn does it hurt.",
  "author": "abbabaahdd",
  "created": 1587949761,
  "updated": 1634078198,
  "over_18": false,
  "upvotes": 1573,
  "upvote_ratio": 0.98,
  "comments": {
    "fop2rwf": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop2rwf/",
      "text": "The thing with this subreddit is that a lot of people have high aspirations and they assume everyone else does too. They're shooting for T20+ and they'll trash any school outside that because for them it would be a failure so they assume the same for others. Same with business/finance majors. They're shooting for Wall Street, investment banking, Goldman Sachs, etc. And yeah for those things you might need a T20 education. But you can get a business degree from a state school and have a great career and a great life. I just ignore any opinion expressed on here unless it's a current student talking about school culture or from someone flared as a professional. Do your own research, make your own decisions, and find your own value.",
      "author": "cpshaken",
      "created": 1587951811,
      "upvotes": 700,
      "replies": {
        "fopgu5y": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopgu5y/",
          "text": "Yeah. Everyone here is either a nerd or big time money/clout chaser. I don't go to a competitive school so finding this sub was like finding a whole new culture. I'm lucky in that I found it pretty early in my hs career so I was able to benefit from the competitive nature and strove to get myself into an elite school.",
          "author": "Salman_Abbas_",
          "created": 1587961134,
          "upvotes": 232,
          "replies": {
            "fopub7x": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopub7x/",
              "text": "Hey can I ask what grade you found it in?",
              "author": "ritznae",
              "created": 1587972377,
              "upvotes": 16,
              "replies": {
                "fopyi6h": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopyi6h/",
                  "text": "Summer between Sophmore and junior year",
                  "author": "Salman_Abbas_",
                  "created": 1587976473,
                  "upvotes": 16,
                  "replies": {
                    "foqffiq": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqffiq/",
                      "text": "so you started preparing for college after you found out about this sub?",
                      "author": "FinalsAside",
                      "created": 1587992279,
                      "upvotes": 2,
                      "replies": {
                        "forhgle": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forhgle/",
                          "text": "Before I prepped as much as an average student. Just not to the extent I needed to get into a pretty good school.",
                          "author": "Salman_Abbas_",
                          "created": 1588012299,
                          "upvotes": 5,
                          "replies": {
                            "fors5wz": {
                              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fors5wz/",
                              "text": "Damn :/\nI'm currently in that same \"transition\" you're talking about (from sophomore to junior), I really hope that I have enough time to prepare for elite schools, what do you think?",
                              "author": "FinalsAside",
                              "created": 1588017569,
                              "upvotes": 3,
                              "replies": {
                                "forv1ta": {
                                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forv1ta/",
                                  "text": "I think you can do. It's gonna be a hard uphill battle but you should be able to pull off. Just remember to be yourself and push yourself to do things you never could have imagined doing. I literally had no meaningful extra curriculars other than average hs stuff like being in clubs, but I did as much as I possibly could and I pulled it off.",
                                  "author": "Salman_Abbas_",
                                  "created": 1588019010,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "foqeuzk": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqeuzk/",
          "text": "Agreed. People don’t seem to understand that you can get to the same end goal no matter what school you’re in. You’re high-achieving, you’re high-achieving. The school doesn’t define you; you define yourself. \n\nPeople think ivy can get you an open doorway to Wall Street automatically. I’m way outside an ivy, and it’s been an easy entry for me. Even at my first big corporate internship, people initially remembered my coworker (intern) who went to UCLA and not me. She was also the chief counsel’s family friend. But in the long run, I still stood out in the whole pack of T20 interns, wealthy families, family friends, family employees, continuing interns, grad interns, w/e. \n\nI’m in no way high-achieving academically anymore. Back in high school, I’d easily identify with some of these reddit posters. When college started, I prioritized having a life than being valedictorian, national hero, etc. This decision  helped my future more than anything.",
          "author": "throwaway59423",
          "created": 1587991881,
          "upvotes": 35,
          "replies": {
            "fori66o": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fori66o/",
              "text": "Do you have any tips on how to stand out? I hate getting shit on in this thread because I'm not Ivy and since finance and banking is \"client-facing\" I won't get anywhere.",
              "author": "Silky-love",
              "created": 1588012645,
              "upvotes": 3,
              "replies": {
                "forkwsb": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forkwsb/",
                  "text": "I’ll DM (or is it PM?) you in a little bit. It’s a long answer. \n\nAre you trying to go specifically in finance & banking? One of the bulge brackets? What year are you in? Is getting into PE or HF part of the goal too?",
                  "author": "throwaway59423",
                  "created": 1588013957,
                  "upvotes": 1,
                  "replies": {
                    "forpro7": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forpro7/",
                      "text": "Okay anything would help :) I switched from Econ to finance. I do want to go into finance and was thinking of HF, I haven't looked into fundamental that much but it could be an option",
                      "author": "Silky-love",
                      "created": 1588016354,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "fot4pup": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fot4pup/",
                      "text": "If it’s okay with you, could you PM me too?",
                      "author": "Critical500",
                      "created": 1588044598,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fopmwmd": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopmwmd/",
          "text": "Literally my thoughts exactly. One more thing I'd like to add in is how seriously people take this stuff. People on this sub are literally having panic attacks and mental breakdowns over not getting into some super elite university and are all depressed when they have to go to a state school. 9/10 it doesn't matter what school they go to since most of them are just normal majors where you don't need the elite school. I've seen posts and comments on here where people are genuinely upset at going to a safety. This sub is definitely too high pressure and for no reason at all",
          "author": "Dutch_Windmill",
          "created": 1587965856,
          "upvotes": 89,
          "replies": {
            "foq8wai": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq8wai/",
              "text": "[deleted]",
              "author": null,
              "created": 1587987037,
              "upvotes": 37,
              "replies": {
                "foqrrxu": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqrrxu/",
                  "text": "no idiot, if they don’t get into cornell for a fucking undergrad career literally any employer will tell them to fuck off. That is all people care about, whether you went to college or not. \n\n/s",
                  "author": "identifyasawalnut",
                  "created": 1587999641,
                  "upvotes": 27,
                  "replies": {}
                },
                "for6qpz": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for6qpz/",
                  "text": "ay why the hate for my boy hickville",
                  "author": "Fyreblaze_",
                  "created": 1588007117,
                  "upvotes": 6,
                  "replies": {}
                },
                "foqsbkm": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqsbkm/",
                  "text": "This isn’t true lol, a lot of most competitive jobs only require an undergrad degree. Think mbb consulting, ibd, quant/swe at trading firms, swe at elite but not huge firms. All of these have a decent benefit from going to a top school, and the first three have a massive benefit.",
                  "author": "nyan_cats4all",
                  "created": 1587999927,
                  "upvotes": 7,
                  "replies": {
                    "forext0": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forext0/",
                      "text": "Only one where you really, really need prestige is mbb consulting but can't imagine why you would want to work in mbb consulting. IB pays way better.",
                      "author": "InvestmentBanker19",
                      "created": 1588011075,
                      "upvotes": 2,
                      "replies": {
                        "forio4s": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forio4s/",
                          "text": "Consulting isn’t exactly low hours but it’s not the same as IB. Pretty different work and exit ops as wrll\n\nI agree that mbb is the only place where it’s essentially required but it’s still definitely a benefit for the others.",
                          "author": "nyan_cats4all",
                          "created": 1588012886,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ford1tn": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/ford1tn/",
                  "text": "The only part I'd object to is the presumption that everyone wants to go to grad school. It's incredibly different from undergrad (academically and socially), and I can understand if someone doesn't want to waste their college experience at a community college. At a state school, meh.",
                  "author": "JustAGrump1",
                  "created": 1588010160,
                  "upvotes": 3,
                  "replies": {}
                },
                "foqn9vf": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqn9vf/",
                  "text": "Big facts",
                  "author": "Dutch_Windmill",
                  "created": 1587997198,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "foqyes1": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqyes1/",
              "text": "Bro wtf is your profile pic",
              "author": null,
              "created": 1588003001,
              "upvotes": 1,
              "replies": {
                "for1i53": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for1i53/",
                  "text": "Flag of the navy of the German empire",
                  "author": "Dutch_Windmill",
                  "created": 1588004555,
                  "upvotes": 1,
                  "replies": {
                    "for47tq": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for47tq/",
                      "text": "...why",
                      "author": "LeBron_Universe",
                      "created": 1588005892,
                      "upvotes": 0,
                      "replies": {
                        "for5pqp": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for5pqp/",
                          "text": "Some people like historical relics and pieces of history. The Germans were something else before they were Nazis, you know.",
                          "author": "StankyMcSpanky",
                          "created": 1588006619,
                          "upvotes": 4,
                          "replies": {
                            "for6r56": {
                              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for6r56/",
                              "text": "I didn’t say anything about nazis",
                              "author": "LeBron_Universe",
                              "created": 1588007123,
                              "upvotes": -1,
                              "replies": {
                                "forbzu4": {
                                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forbzu4/",
                                  "text": "You’re right. I made an assumption that your intention was to chastise this person for liking a historical German flag because people often associate any piece of German history with Nazis or as the ‘bad guys.’ If it wasn’t your intention, then I’m sorry.",
                                  "author": "StankyMcSpanky",
                                  "created": 1588009658,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "for5ee1": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for5ee1/",
                          "text": "It's cool",
                          "author": "Dutch_Windmill",
                          "created": 1588006468,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "foqmhg8": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqmhg8/",
          "text": "I think that last part is important. Every comment made about how good a school is or how far you can go in life that is made by a high schooler is based solely on speculation or other people’s opinions. Don’t let HS junior tell you you won’t succeed if you don’t go to HYPMS. The only valid comments based on experiences made on this sub are like you said, from current students or people who’ve already graduated. Not to say high schoolers can’t have opinions but it’s just a different level of knowledge having never been to college, gotten internships, taken courses, etc.",
          "author": "neonsymphony",
          "created": 1587996748,
          "upvotes": 7,
          "replies": {}
        },
        "fopyawq": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopyawq/",
          "text": "I mean, I wouldn't say you need a T20 education to get into the big Wall Street hedge funds. It's more about your connections, and if you don't have them already, the fastest way in is applying to be a junior manager after already having managed a successful portfolio for a number of years.\n\nOr plan B is to hit up the bars after after-hours trading ends, and the floor brokers all go out drinking. That's how my grandpa got in the Chicago exchange anyway, not sure it still works that way lol",
          "author": "Rin-Tohsaka-is-hot",
          "created": 1587976267,
          "upvotes": 17,
          "replies": {
            "foq9ji9": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq9ji9/",
              "text": "That's pretty misleading as mentioned but also:\n\nJust don't sell your soul and be a Wall Street sellout. :)",
              "author": "DarkSkyKnight",
              "created": 1587987623,
              "upvotes": 6,
              "replies": {}
            },
            "foq08x2": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq08x2/",
              "text": "[deleted]",
              "author": null,
              "created": 1587978257,
              "upvotes": 9,
              "replies": {
                "foq17n0": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq17n0/",
                  "text": "It's a combo of both. You need the prestige name-brand school to have a chance at these schools. Resume readers sometimes skim through focusing on the name and numbers.\nConnections and school go hand in hand. Going to a prestigious school gives you network connections with people on Wall Street.\n\nIt's going to be hard to go to a t100 school and land a T3 gig even with super good connections",
                  "author": "SirBubbles_alot",
                  "created": 1587979251,
                  "upvotes": 5,
                  "replies": {
                    "foq5dgt": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq5dgt/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1587983599,
                      "upvotes": 2,
                      "replies": {
                        "form0ub": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/form0ub/",
                          "text": "this pretty much only applies to wall street and the fact that people think this applies to CS, engineering, etc. in any amount is the thing that people are up in arms about",
                          "author": null,
                          "created": 1588014500,
                          "upvotes": 1,
                          "replies": {
                            "fov9owp": {
                              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fov9owp/",
                              "text": "Tech companies wipe their ass with the university you went to. Doesn't mean shit - skill and connections take precedence any day in tech",
                              "author": "TheMightyZulf",
                              "created": 1588097692,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "for4bse": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for4bse/",
                  "text": "anyone who works for wall street is a cunt anyways",
                  "author": "LeBron_Universe",
                  "created": 1588005946,
                  "upvotes": 1,
                  "replies": {
                    "forf27r": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forf27r/",
                      "text": "I'm an IBD analyst. I wouldn't say that about myself ;)",
                      "author": "InvestmentBanker19",
                      "created": 1588011135,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "forjlir": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forjlir/",
                      "text": "Why?",
                      "author": "Master_Liberaster",
                      "created": 1588013326,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "fos1cxk": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fos1cxk/",
                  "text": "Can you link that post ?",
                  "author": "ten98765432one",
                  "created": 1588022194,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "forjht8": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forjht8/",
              "text": "Where can you actually read about getting on Wall Street as a non-T20 student?",
              "author": "Master_Liberaster",
              "created": 1588013278,
              "upvotes": 1,
              "replies": {
                "fork7lz": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fork7lz/",
                  "text": "Roughly 10% went to Ivy league, can't find stats on T-20s in general though.\n\nOf course they're going to have a larger representation, simply because they are comprised of a larger concentration of capable and driven people.\n\nHowever, anybody can apply to internships at Goldman Sachs, or wherever really. I know a handful of people who went to UIUC (where I'm going) and now work on Wall Street. One of them majored in stats (or data processing, whatever the major is called, all I know is he took a shit ton of stats courses), the rest business management.",
                  "author": "Rin-Tohsaka-is-hot",
                  "created": 1588013618,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "forj7ds": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forj7ds/",
          "text": "So- I can still get to investment banking while not being a student at T20?   \n\n\n(plz don't bully me I said that unironically only bc I am an international and have no actual knowledge of how the U.S. works)",
          "author": "Master_Liberaster",
          "created": 1588013141,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fop0pot": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop0pot/",
      "text": "Yes, indeed. I usually avoid reading this subreddit unless I am looking for information. Otherwise, it usually destroys your happy thoughts and feelings about yourself and your future.",
      "author": "dasein-t",
      "created": 1587950519,
      "upvotes": 231,
      "replies": {
        "fop24a6": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop24a6/",
          "text": "Same with chance me at times",
          "author": null,
          "created": 1587951401,
          "upvotes": 42,
          "replies": {
            "fop2qeg": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop2qeg/",
              "text": "I believe chance me is worse",
              "author": "dasein-t",
              "created": 1587951784,
              "upvotes": 101,
              "replies": {
                "fopiq8p": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopiq8p/",
                  "text": "a lot of people fake their resumes on chance me for external validation",
                  "author": null,
                  "created": 1587962544,
                  "upvotes": 35,
                  "replies": {}
                },
                "fopexih": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopexih/",
                  "text": "wait how so?",
                  "author": "witchfromthemoon",
                  "created": 1587959757,
                  "upvotes": 4,
                  "replies": {
                    "fopgwot": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopgwot/",
                      "text": "almost no one there is actually qualified so they just bring anyone and everyone down",
                      "author": "DJ_Saidez",
                      "created": 1587961187,
                      "upvotes": 39,
                      "replies": {
                        "foqbb2e": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqbb2e/",
                          "text": "Unless you say you are a URM. Then they'll tell you that you can get in anywhere. I was told that because of my ethnic background I could get into almost any school in the country other than maybe CalTech. Got that fat rejection from UPenn and Duke.",
                          "author": null,
                          "created": 1587989125,
                          "upvotes": 21,
                          "replies": {
                            "fos15ep": {
                              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fos15ep/",
                              "text": "Well I'm a bilingual Latino with autism who wants to be a physician, immigrated at age 8 to escape an impoverished community, and juggles 4 AP classes ^(this year), cross-country, youth soccer refereeing, Japanese (3rd language) and electronic music production at the same time (and scored in the 99th percentile in the PSAT)\n\nSo they were nice enough to me regarding my chances at UCLA (in-state) :p\n\nBut because they can't read your essays (usually only get a self-given score) and have no way of knowing the admissions situation at that school at that year, it's a lot of guesswork",
                              "author": "DJ_Saidez",
                              "created": 1588022086,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        },
                        "foq1bvt": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq1bvt/",
                          "text": "The one benefit is that the super tryhard profiles give me a \"reality check\" and stop me from being too arrogant of my own chances.\n\nYou can't be let down on decision day if you never had high hopes to begin with.",
                          "author": "SirBubbles_alot",
                          "created": 1587979378,
                          "upvotes": 13,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "foqmyje": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqmyje/",
              "text": "exactly, I think A2C is actually much more supportive than ChanceMe and even if it is intense and competitive, I think people can still find a lot of support and validation on here if they end up choosing/going to a non-T20 school. There are always going to be assholes who diminish the accomplishments of going to less prestigious schools, but I would honestly say they’re in the minority here, they just maybe speak louder.",
              "author": "hazardmilk",
              "created": 1587997021,
              "upvotes": 5,
              "replies": {}
            },
            "forbuc9": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forbuc9/",
              "text": "Except you can’t even find occasionally correct information on chance me lmao",
              "author": "mcmichaelwave",
              "created": 1588009585,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "forefhr": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forefhr/",
          "text": "I mostly go on this subreddit for shitpost Wednesdays because at least those people aren't being outright elitist",
          "author": "AriesGirl101",
          "created": 1588010827,
          "upvotes": 2,
          "replies": {}
        },
        "foq210c": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq210c/",
          "text": "UT Austin doesn’t have that much prestige but their accounting program is ranked #1 in the US, and their finance program is ranked #4 in the nation. If I studied finance from UT Austin, would I have a good shot at Wall Street?",
          "author": "retuksatik",
          "created": 1587980105,
          "upvotes": 2,
          "replies": {
            "foq3b3f": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq3b3f/",
              "text": "UT Austin has a lot of prestige, especially in business. You would be very well set up.",
              "author": "Hubris_sb",
              "created": 1587981458,
              "upvotes": 22,
              "replies": {
                "foq631v": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq631v/",
                  "text": "I told my parents that’s where I wanna go and study finance, and they are extremely disappointed. How can I convince them that I don’t have to be a doctor or lawyer with a Stanford degree to be successful in life?",
                  "author": "retuksatik",
                  "created": 1587984331,
                  "upvotes": 7,
                  "replies": {
                    "forr9t4": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forr9t4/",
                      "text": "Idk maybe show them that UT Austin is an incredible school for finance? Like us news rankings and things like that. Not to mention people on Wall Street are often make more money than lawyers",
                      "author": "Hubris_sb",
                      "created": 1588017121,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "for4gzh": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for4gzh/",
              "text": "> UT Austin doesn’t have that much prestige \n\nAbsolutely not true",
              "author": "LeBron_Universe",
              "created": 1588006016,
              "upvotes": 9,
              "replies": {}
            },
            "foqxbom": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqxbom/",
              "text": "> UT Austin doesn’t have that much prestige\n\nThis is exactly what the post is talking about. Holy crap.",
              "author": "gargar070402",
              "created": 1588002466,
              "upvotes": 13,
              "replies": {}
            },
            "for1aci": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for1aci/",
              "text": "UT has the highest endowment at about $23billion ranked after Harvard and Yale",
              "author": "calinternational",
              "created": 1588004446,
              "upvotes": 5,
              "replies": {}
            },
            "foqnzcf": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqnzcf/",
              "text": "“doesn’t have that much prestige” lmao how these ppl talk about schools based on US News rankings",
              "author": "bruno-vr",
              "created": 1587997593,
              "upvotes": 7,
              "replies": {}
            },
            "for9er7": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for9er7/",
              "text": "You would have a good shot depending on how driven you are and the internships you can get out of there. That's a big thing people tend to miss here, internships make or break your competitive advantage once you graduate. It doesn't matter what school they went to if their entire job experience is a server at Applebees in HS and nothing else.",
              "author": null,
              "created": 1588008412,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fop6ma3": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop6ma3/",
          "text": "Does it though?",
          "author": "CaptainCerealCanada",
          "created": 1587954237,
          "upvotes": -11,
          "replies": {
            "foqh8w7": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqh8w7/",
              "text": "i mean, here's the thing. most people have different perspectives in life, and that's okay. but if you go to the far extremes (the top 1% shitting on the bottom 99% or the bottom 1% shitting on the top 99%) on the internet, typically you'll find people just yelling at everything and anything you'll do, which is... unsettling, to say the least.",
              "author": null,
              "created": 1587993517,
              "upvotes": 1,
              "replies": {}
            },
            "foqo6wa": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqo6wa/",
              "text": "Mate I bet if you applied you would get a straight rejection.",
              "author": "ramos_sergio",
              "created": 1587997709,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fop6g86": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop6g86/",
      "text": "You have to take this sub with a grain of salt. There’s good information but it definitely skews elitist. Be the best YOU at any school you seem fit for YOU.",
      "author": "Ncs2000",
      "created": 1587954130,
      "upvotes": 105,
      "replies": {
        "fopthsa": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopthsa/",
          "text": "And honestly, any college experience is probably most affected by the effort you put into it. Someone who goes to an elite school and exhibits no intellectual curiosity and doesn’t take advantage of the educational offerings of the institution is going to receive a much worse college education than someone who goes to an average state school but visits and has meaningful conversations with their professors, and who explores related subjects and schools of thought.\n\nCollege surrounds you with educated and experienced people who are dedicating themselves to teaching you what they know. It’s up to you, no matter where you go, to listen and learn.",
          "author": "Calan_adan",
          "created": 1587971607,
          "upvotes": 33,
          "replies": {
            "foqu8iq": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqu8iq/",
              "text": "Exactly!",
              "author": "Ncs2000",
              "created": 1588000924,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fopcyvk": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopcyvk/",
      "text": "Yesterday I was assailed in person by a friend who said \"I heard that economics is one of the most useless majors...\" after I told him I want to study economics. Firstly, there are tons of employment and graduate school options that you can pursue with almost any major if you have a good skillset and GPA to back it up, buddy. Law school, Consulting, Academia, Foreign service, etc., all sorts of things I'm interested in. Secondly, economics is actually a common pathway to a lot of those careers. Thirdly, imagine having the AUDACITY to tell someone to their face that they're pursuing a useless major when you don't know what goals or motivations they have and what contingency plans they might have. My friend who said this is somewhat influenced by another friend I have who is very assertive in all things, including his conception of academic fields roughly as follows: Applied Sciences > Pure/Abstract sciences > Social Sciences & Humanities. On a related note, I don't know how realistic this is for most students but some people give advice that you can always double major in your passion and a more \"practical\" field that you might have some interest in or aptitude for. What are your thoughts on this suggestion, A2C?",
      "author": "Poketatolord",
      "created": 1587958398,
      "upvotes": 69,
      "replies": {
        "fopt7ck": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopt7ck/",
          "text": "Hell yeah, economics is an awesome major with a lot of different career paths you can take. Don't let anyone tell you otherwise.",
          "author": "Chris023",
          "created": 1587971333,
          "upvotes": 19,
          "replies": {}
        },
        "foraz41": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foraz41/",
          "text": "How stunted are your social skills if you hear someone's major and you immediately say \"wow that's a waste of time\"",
          "author": "NightCor3",
          "created": 1588009167,
          "upvotes": 7,
          "replies": {
            "fosqe5d": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fosqe5d/",
              "text": "Some people really have no filter for the verbal garbage that comes out of their mouth",
              "author": "Poketatolord",
              "created": 1588035891,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "for5h4t": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for5h4t/",
          "text": "Tbf, economics does seem like an applied science once you apply it to something. It’s a science. And you apply it to things. What more could you want?",
          "author": "uglypenguin5",
          "created": 1588006505,
          "upvotes": 6,
          "replies": {}
        },
        "fopeye0": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopeye0/",
          "text": "Why not create a separate post?",
          "author": "Carerx",
          "created": 1587959774,
          "upvotes": -10,
          "replies": {
            "fopfbsi": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopfbsi/",
              "text": "I just found a [post](https://www.reddit.com/r/ApplyingToCollege/comments/g8iu3r/is_abandoning_your_passion_for_the_sake_of_money/) similar to the question I pose but I just appended it to my comment because I feel like it is somewhat relevant to OP's thoughts.",
              "author": "Poketatolord",
              "created": 1587960036,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fopnski": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopnski/",
      "text": "It made me learn about a ton of things I’d never even heard of or considered for ECs. The one that sticks out is the science and math Olympiads. So many people on this sub have talked about it and I have never heard about it outside of reddit and am still not quite sure what it is, and doubt I would’ve been able to do it if it needs to be a school team or something. I’m thankful I was still able to go to a really good school for my major, but my ECs are so lacking compared to this sub lmao",
      "author": "pokexchespin",
      "created": 1587966587,
      "upvotes": 37,
      "replies": {
        "fopt8mo": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopt8mo/",
          "text": "lmaoo same I still have no clue what an Olympiad is but I sure don’t think I would’ve wanted to do it either",
          "author": "sharpiedog10",
          "created": 1587971365,
          "upvotes": 11,
          "replies": {}
        },
        "foqd318": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqd318/",
          "text": "that’s so weird to me? we did math olympiad when i was in elementary school in the g&t classes. i did them a few times in middle school but never after that",
          "author": "tis_i_bri",
          "created": 1587990558,
          "upvotes": 2,
          "replies": {
            "for7il9": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for7il9/",
              "text": "See? That’s the thing! I’ve gone to a rural school so all these Olympiad ECs and wild activities like science fairs and competitions are all completely foreign to me. Between urban, suburban, and rural educations, you get a huge difference in quality of experiences.",
              "author": "StankyMcSpanky",
              "created": 1588007496,
              "upvotes": 3,
              "replies": {
                "fordfae": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fordfae/",
                  "text": "Same here. I’m graduating from a suburban high school in a very low income (Title I) area. How do people have the money to do all these extracurriculars? My school had a couple of inactive honor societies and that’s about it. Anything else I had was volunteer work. Anything outside of school was either hundreds of dollars or hours away. Made me nervous since I didn’t have the “competitive” background that a lot of applicants here do but I’m happy with the school I ended up with so it’s all good.",
                  "author": "officialkodos",
                  "created": 1588010339,
                  "upvotes": 5,
                  "replies": {
                    "forhhtd": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forhhtd/",
                      "text": "Yeah, Junior here. Honestly, I would be happy just to get to one of my state schools without a mountain of debt. That’s my main goal. I might apply to some higher tier stuff but I don’t expect much of anything out of that.",
                      "author": "StankyMcSpanky",
                      "created": 1588012316,
                      "upvotes": 2,
                      "replies": {
                        "forj6ke": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forj6ke/",
                          "text": "I feel you. If I didn’t get out of the south for college I would’ve committed not-alive so I’ve just accepted a mountain of debt as an inevitability lol. Quick tip: living in a dorm is a great way to make friends and establish yourself as part of a community, but if debt is a concern and living off campus is an option, look into it. I’ll be saving about $6,000 (a little less once you factor in groceries, but there’s tons of subs dedicated to grocery budgeting) per year by living like two minutes away in a university-sponsored apartment as opposed to dorming. Takes about $20k off my total estimated debt once I graduate. Just a suggestion.",
                          "author": "officialkodos",
                          "created": 1588013130,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "fori2z2": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fori2z2/",
                          "text": "that’s what i’m hoping for !!",
                          "author": "tis_i_bri",
                          "created": 1588012603,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "foprac2": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foprac2/",
      "text": "What's your major? I'm looking towards a state school as my dream school, this sub is NOT GOOD FOR ANYONE SEEKING VALIDATION OF THEIR SCORES OR GPA. Use Niche or the Princeton Review for that if you really care. The only thing this sub is good for is essay tips and m a y b e SAT and ACT tips tbh, and that's the rare occurrence a post goes up. I'm a 3.68 UC gpa with a 1190 but I bust my ass off 10x more than the regular person in extra curriculars. You aren't a statistic, you are a person with aspirations and it's not luck of the draw. Show that damn school what you've got and what they'll miss out on if they don't except you. Everyone has a place. All majors are valuable and provide knowledge for some aspect of the world because the outside world is not just Business and Engineering.",
      "author": "selenagabriella",
      "created": 1587969599,
      "upvotes": 24,
      "replies": {
        "fopurbp": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopurbp/",
          "text": "well worded.",
          "author": "bandsandstories",
          "created": 1587972800,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "foozzn3": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foozzn3/",
      "text": "Iv'e never seen anyone on here shit on business/finance, besides STEM that's what most people on here want to do",
      "author": "Davy257",
      "created": 1587950070,
      "upvotes": 74,
      "replies": {
        "fop0psk": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop0psk/",
          "text": "People say that unless you go to a T10, going into business/finance is a complete waste of money. It’s a pretty common sentiment here.",
          "author": "edxothers",
          "created": 1587950521,
          "upvotes": 84,
          "replies": {
            "fopcb16": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopcb16/",
              "text": "I feel like I'm gonna get downvoted, but this is something many successful buisness people would agree with. According to articles I've read, many say a college degree is not worth the time and money investment as the time and money can be used to develop something meaningful like a buisness - ex. buisness men like Graghan Stephan, Casey Neistat, Steve Jobs, Bill Gates, & all the millionaires on r/wallstreetbets - and give an exception to elite schools due to the alumni networking.",
              "author": "Salman_Abbas_",
              "created": 1587957950,
              "upvotes": 26,
              "replies": {
                "fopfrd2": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopfrd2/",
                  "text": "I disagree. Mark Cuban famously told a young entrepreneur on Shark Tank to go to college to study finance/business, and refused to give him a deal because of the boys willingness to abandon college to pursue his business. I don't remember him specifying a college either.",
                  "author": "Arrowood17",
                  "created": 1587960345,
                  "upvotes": 29,
                  "replies": {
                    "fopg74p": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopg74p/",
                      "text": "Tbh. I think the arguments of both sides has some truth to it. At the end of the day it's an opinion and there are many people who studied finance/businesses in state schools who are probably doing better than their peers at elite schools. At the same time, many of the top buisness people have elite degrees. I'm of the belief that no matter where someone goes to school, their success depends on the amount of work they put in, but success in these fields will also be much easier to achieve via an elite school.",
                      "author": "Salman_Abbas_",
                      "created": 1587960661,
                      "upvotes": 12,
                      "replies": {
                        "fopgjjc": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopgjjc/",
                          "text": "I agree. This goes with the argument, does name recognition matter in general, and to a point, it does. But a degree in business is better than no degree at all I believe.",
                          "author": "Arrowood17",
                          "created": 1587960917,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fopn8ha": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopn8ha/",
                  "text": "Definitely not true. Whenever I look at job postings in my area for finance or business I see lots of jobs, and I live in a state with a weaker economy. The main thing these postings looks for other than a degree is experience, which you can get through internships. Once you get the starting level job you can work hard and work your way up, living a comfortable middle class life",
                  "author": "Dutch_Windmill",
                  "created": 1587966123,
                  "upvotes": 4,
                  "replies": {
                    "fopnnfi": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopnnfi/",
                      "text": "I agree with you. If you go down through the common thread I further elaborated my thoughts.",
                      "author": "Salman_Abbas_",
                      "created": 1587966468,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fop1ocs": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop1ocs/",
          "text": "theyre not shitting on business theyre shitting on going to lower-ranked schools for business",
          "author": "uvata",
          "created": 1587951121,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "foqbi66": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqbi66/",
      "text": "If you’ll accept a comment from someone who has worked in law, business and academia, please don’t let A2C bring you down.  I was like you, a great high school student (valedictorian, NMS) who accepted a full-ride at a state flagship university. I did great there, won a national scholarship, and used those funds to pay my tuition at a T10 law school.  Worked as an attorney at a very highly regarded DC firm with Fortune 100 clients.  And guess what?  The great majority of my colleagues and highly-successful clients went to state schools.  You can succeed from absolutely anywhere.  And just as some individuals see an Ivy League degree and say “wow,” other hiring partners and state school alumni seek out the stellar students from Penn State, Virginia Tech, Clemson, Arizona or The University of Washington, finding them to be more relatable, well-rounded, client-friendly and ambitious.  And then there’s the fact that once you are working in your field, employers and colleagues care only about the quality of your work; no one cares one whit about where you did your undergraduate work.\n\nAnd depending on your interests and the school you selected, you may have a far more amazing undergraduate experience at the state school you selected than some private T20.  My undergraduate university had amazing D1 sports and I had season tickets to everything.  Spent many great weekends traveling with friends to away games and tournaments.  I also loved to hike and I was within a few hours drive to several national parks and spent many hours with our outdoors club hiking, climbing and tubing.  And as for academics, I had terrific professors who hooked me up with research in my field, won the aforementioned scholarship, and got into five T12 law schools.  \n\nAs for business, there are many state schools with amazing programs that are highly recruited both nationally (Michigan, UVA, Indiana) and regionally (ASU, OSU, Minnesota).  \n\nReally, it’s the student, not the school.  If your state school was a great fit for you, don’t look back.  Have an amazing time, make some spectacular memories, get to know your professors, try some new things (clubs, intramurals, organizations), and achieve.  It’s what makes you happy, not some random A2C kids who think life begins and ends at Harvard.  (And I like Harvard.  My husband went there.  But I wouldn’t trade my state college experiences for his.).",
      "author": "HappyCava",
      "created": 1587989288,
      "upvotes": 19,
      "replies": {
        "foqoqtd": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqoqtd/",
          "text": "Girl I don’t know if you attended UofA but all what you’ve said are the reasons why I’m choosing it over my dream school. Tuition Scholarship, AMAZING outdoor opportunities, D1 sports with free tickets, good weather, food, and a tight-knit department where I’ll get more attention for research and academics, and tons of saved money for grad school!\n\nI used to hate this school. But then I did my research and it’s a perfect match to me. I already forgot about my other schools (although reading this sub sometimes makes me question my decision haha), I’m so excited!",
          "author": "bruno-vr",
          "created": 1587998014,
          "upvotes": 5,
          "replies": {
            "for3epz": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for3epz/",
              "text": "Hi!  Yes, it was U of A.  I absolutely loved it there.  I remember waking up the morning of my first home football game as a freshman and seeing the lawns and parking lots just completely covered by happy tailgaters — families, grandparents, recent graduate, just all ages. And everyone kept offering me food from their grills, complete strangers sharing breakfast burritos just because they were so excited about the game that they wanted to share with fellow Wildcats.  And, yep, I had basketball tickets all four years and was beyond thrilled when they won the championship.  Also loved the hiking, the Southwest culture, the arts district, the food, the clubs — just a terrific time.\n\nAnd just as you said, as a very strong student I received tons of attention from my professors, who were just a generally wonderful crew, and had no trouble transitioning to an “elite” law school and making law review there. But there are “elite” opportunities at every state flagship university.  You just have to do well, attend office hours, and get to know the professors in your area(s) of interest.  (Which in my case meant joining a few professors and similarly-inclined students for wings on Friday afternoons.).  I was also in the Honors Program and made some strong connections in honors seminars (though most of my classes at Arizona had fewer than 40 students).  \n\nGood luck!  I hope there’s sufficient progress on the Covid-19 front that you can all start safely on campus in the fall.   Go, ‘Cats!",
              "author": "HappyCava",
              "created": 1588005498,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "foqvrfg": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqvrfg/",
          "text": "I'm planning on taking a very similar path to you. Really, pretty much the exact same path. Do you have any advice for me?",
          "author": "OfficialCicisPizza",
          "created": 1588001692,
          "upvotes": 1,
          "replies": {
            "for6u8w": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for6u8w/",
              "text": "Take classes you genuinely enjoy that offer a solid amount of writing and analysis — whether you work in law, business, consulting, academia or think tanks, you need to show grad schools and/or employers that you can process, analyze and derive conclusions from the information you are given and then explain those conclusions in a clear and thoughtful manner.  But you can find that kind of coursework in nearly every field of study — English, history, economics, political science, etc.   So take the courses that interest you, making sure you have a couple of quantitative courses in the mix — like Econ, accounting, logic, or programming — as well as coursework that helps you become a better writer.   But if “The Philosophy of Breaking Bad” or “Environmental Politics and The Avengers” speaks to you, feel free to enjoy. \n\nGet to know the professors you find interesting.  Go to office hours if you have a question or want suggestions for other good courses in the major. Find other students who enjoy the class and take the instructor out for coffee or lunch (many schools have “take your professor to lunch” programs that will even reimburse you, though most instructors won’t let you pay).  Getting to know your professors is important for research and internship opportunities and recommendations, and also is just hugely rewarding in terms of learning about the field and perhaps acquiring a mentor and friend. \n\nFinally, get involved in any club or activity that you enjoy or have always wanted to try.  Now’s the time before you get caught up in a career, relationship, kids, carpools and lawn care.  Golf?  Improv?  Writing for the school paper?  Knitting?  Intramural dodgeball?  Do it now.  Making friends, supporting your school’s athletics, getting involved in clubs and intramurals, and just putting yourself out there is what makes for a great college experience.   Best of luck!!",
              "author": "HappyCava",
              "created": 1588007165,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "foqk7mh": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqk7mh/",
      "text": "Business and finance are great majors.  I almost majored in finance at a state school myself.  Stop comparing yourself to other people or letting them define success.  You can define that for yourself and there are many ways to get there.\n\nA couple of cases to consider:\n\n1.  I have a friend to *barely* managed a 3.0 GPA at a state college.  He got fired or laid off from his first three jobs out of college, one of which was as a truck driver because he couldn't find anything else.  There's literally no one on this sub who would call that success.  Failure, right?  When he lost his third job he decided to start his own business and after a really rough first three years, it really took off.  My friend just retired a couple years ago with a beach house and a lake house.  He put all of his kids through college with cash and hasn't had a mortgage in years. \n\n2.  I have another friend who was in remedial math classes in 7th grade.  He attended one of the worst public high schools in his state.  His college choices included mostly schools no one on this sub has ever heard of that aren't in anyone's rankings.  He managed a ~3.8 GPA in college and applied to 9 of the top 11 grad schools for mechanical engineering.  He got into all 9.  He attended #2, got a really prestigious post-doc, and is now a professor at an Ivy.  **If this sub looked at his life at any point before grad school results came out, they would have laughed at him.  Now you're all tripping over yourselves for the chance to have him teach you.**\n\nMy point is that life is really long and there are many ways to get what you want out of it.  A few setbacks or failures don't define you.  You don't need to follow anyone else's paths or definitions for success.",
      "author": "ScholarGrade",
      "created": 1587995398,
      "upvotes": 17,
      "replies": {}
    },
    "fopi13l": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopi13l/",
      "text": "Most of its elitists. Even though I got good grades, AP scores and stuff I’m still choosing to go the a Community College next year.\n\nA made a post earlier on how people need to stop shaming others for making that decision.\nI really want to tell people that even if they get into a “good” school, they aren’t any better people because of it. Your the same person just paying more money and in a new place.",
      "author": "SwackHD",
      "created": 1587962021,
      "upvotes": 31,
      "replies": {}
    },
    "fopg6q6": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopg6q6/",
      "text": "I definitely feel you. On social media, I see plenty of kids I know committing to T20’s left and right and it can be upsetting. In the end though, college (and life by extension) is what YOU make of it. Ofc prestige of college helps, but it’s what YOU choose to do that ultimately matters",
      "author": "Yunzz60",
      "created": 1587960653,
      "upvotes": 10,
      "replies": {
        "foqykg9": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqykg9/",
          "text": "Fr. My ass getting waitlisted from my dream school and then my next 5 picks hurt a fuck ton, but it hurts even more seeing people who I know I worked harder than and took harder classes than commit to T30s and T30s.",
          "author": "OGSHAGGY",
          "created": 1588003080,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fop7gga": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fop7gga/",
      "text": "I would like to speak from the minority of the subreddit who’s woefully average and has no life which can be confirmed by how I scroll through this sub.\n\nI think people over estimate the toxicity of this sub just because it’s such a loud minority.\n\nBut this sub is actually super great. Everyone is  very supportive and I honestly would be so clueless without them. Just don’t look at this sub as competition just think of it as another resource to reach out to",
      "author": null,
      "created": 1587954782,
      "upvotes": 33,
      "replies": {
        "forfbe4": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forfbe4/",
          "text": "Just scrolling through your account you must go to a really competitive high school if you think you’re “woefully average”. Just from what I saw you’re looking into Ivy Leagues, internships, AP classes, and consider a 3.5UW to be low. You’ll be just fine. Average where I’m from is 3.0 GPA, no ECs outside of sports, no APs and maybe a couple honors, and trade school or CC after high school. You got this.",
          "author": "officialkodos",
          "created": 1588011260,
          "upvotes": 4,
          "replies": {
            "forgd5t": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forgd5t/",
              "text": "Nooo all of this is super recent though. I was a transfer student the summer before my sophomore year from another country and did basically nothing for two years and carried around a low gpa . My junior year currently is ahah...we don’t talk about that. I only got my internships by cold emailing 40+ people and they all started during quarantine. I didn’t apply to any prestigious programs, I legit begged for organizations to make a position for me. And none of my “internships” relate to my major so is it even helping?\n\nAlso although I was looking at Ivy leagues I was really just hoping to find one Hail Mary school to ED to but now I realize I’m too broke for that ahah.\n\nI really love my state school, but my state school is fricking UVA who hasn’t accepted a student below a 3.85 WGPA at my school (Naviance scattergrams). I’d love to get in but I understand my chance are slim.\n\nI appreciate your confidence in me and I hope it does work out. But I don’t think it will 😔",
              "author": null,
              "created": 1588011770,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fopd6lp": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopd6lp/",
          "text": "Yup!",
          "author": "Carerx",
          "created": 1587958545,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fopqtsy": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopqtsy/",
      "text": "Ax an Afghan this really hurts me to read posts in this subreddit you know that here in Afghanistan even our best school lacks and we basically can’t have any of these and it made me depressed that why me ???\n\nBut I tried my best and when I read these posts it definitely has some kind of effect on me but in most cases I try to convince myself \n\nThe point is even if you are the worst student in your class you are unique and you can do things that others can’t so don’t look at these posts like that \n\nStay safe",
      "author": "armanmoh",
      "created": 1587969188,
      "upvotes": 8,
      "replies": {}
    },
    "fopgdop": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopgdop/",
      "text": "Most people don’t end up working in prestigious IB firms or sth like that. It’s really few. Disregard people saying some shit and bragging their elitist aspect. You choose what you want to study and work in the field that you want to. That’s the type of people that end up working in a field they want including finance. It’s not the t20 title that gets you a job. That’s what comes after yourself, your passion, and your desire for your goal. You will accomplish whatever you want, desire if you are willing to. The place where you are means nothing. Compare yourself from others 10 years after now. That’s the real difference between you and the others. Not just a piece of paper that shows where you go to now.",
      "author": "dhb879",
      "created": 1587960795,
      "upvotes": 6,
      "replies": {}
    },
    "fopsa6i": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopsa6i/",
      "text": "Yep lmao I frequently feel suicidal because I dread college apps so much and reading this god forsaken subreddit exacerbates it so much but it’s addicting it’s like i want to hurt myself",
      "author": "xdnshdjjskl",
      "created": 1587970491,
      "upvotes": 4,
      "replies": {
        "fosa3gp": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fosa3gp/",
          "text": "please reach out if you're ever contemplating suicide or self-harm; i hope you're exaggerating, but if you're not, don't be afraid to drop me a line if you'd like to talk",
          "author": "KS1618",
          "created": 1588026728,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fopzokf": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopzokf/",
      "text": "Don't listen to the opinions of teenagers whose lives are encompassed by the prestige of the college they go to.",
      "author": "RareLemons",
      "created": 1587977677,
      "upvotes": 5,
      "replies": {}
    },
    "foqgjpi": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqgjpi/",
      "text": "I know a top attorney at a prestigious DC law firm, he once told me that he'd rather recruit a student from Michigan State than Yale.",
      "author": null,
      "created": 1587993047,
      "upvotes": 5,
      "replies": {
        "foqzxag": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqzxag/",
          "text": "As a '90 MSU grad this post made me smile.",
          "author": "kickin_it_old_skool",
          "created": 1588003764,
          "upvotes": 3,
          "replies": {
            "for7xb8": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for7xb8/",
              "text": "I loved when he said that!",
              "author": null,
              "created": 1588007696,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fosj8cb": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fosj8cb/",
          "text": "[deleted]",
          "author": null,
          "created": 1588031778,
          "upvotes": 1,
          "replies": {
            "foui5o8": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foui5o8/",
              "text": "Are you an attorney?",
              "author": null,
              "created": 1588084502,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fopfc6y": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopfc6y/",
      "text": "Yeah whenever I’m on this subreddit I usually leave feeling worse about myself, not fun.",
      "author": "Kable12",
      "created": 1587960044,
      "upvotes": 9,
      "replies": {}
    },
    "fopv240": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopv240/",
      "text": "Agree whole heartedly with everything you said, but i would suggesting rephrasing your title as it might be triggering to some :)",
      "author": "Rianonymous",
      "created": 1587973088,
      "upvotes": 5,
      "replies": {}
    },
    "foq2tsx": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq2tsx/",
      "text": "fuck this subreddit \nfuck yall for suppressing people",
      "author": "Chanakya-69",
      "created": 1587980945,
      "upvotes": 4,
      "replies": {
        "foqko2m": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqko2m/",
          "text": "But how do all your homies feel?",
          "author": "ScholarGrade",
          "created": 1587995672,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "foqee2g": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqee2g/",
      "text": "Fine I’ll be the one to say what we’re thinking, people absolutely blow here lol",
      "author": "I-am-_god",
      "created": 1587991539,
      "upvotes": 4,
      "replies": {
        "foqkmfa": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqkmfa/",
          "text": "Everyone's thinking it, I'm just saying it... PIRATES!",
          "author": "ScholarGrade",
          "created": 1587995646,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fopss1a": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopss1a/",
      "text": "Yeah when I subbed here I thought it was to help people through the admissions process but it’s actually just nerds sitting on your face.",
      "author": "BOODOOMAN",
      "created": 1587970943,
      "upvotes": 3,
      "replies": {}
    },
    "fopfdeu": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopfdeu/",
      "text": "If you want to get into high finance you need to go to an elite school. Otherwise it is not as important. It’s unfortunate but that’s just the way it is.",
      "author": "mikenike21",
      "created": 1587960069,
      "upvotes": 13,
      "replies": {
        "fopfizy": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopfizy/",
          "text": "Is high finance all there is? Aren’t there jobs out there in finance that don’t require you to go to a t20 school?",
          "author": "abbabaahdd",
          "created": 1587960179,
          "upvotes": 6,
          "replies": {
            "foph9n1": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foph9n1/",
              "text": "Yea that’s why I said otherwise you’re fine at a state school. I just meant specifically investment banking, PE, etc sort of demands a degree from a T20.",
              "author": "mikenike21",
              "created": 1587961452,
              "upvotes": 11,
              "replies": {
                "fopsm07": {
                  "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopsm07/",
                  "text": "But can’t you do an MBA from an elite school later too?",
                  "author": "rg787",
                  "created": 1587970789,
                  "upvotes": 4,
                  "replies": {
                    "foqhvo2": {
                      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqhvo2/",
                      "text": "Not really because at first you’re not expected to have an MBA.",
                      "author": "mikenike21",
                      "created": 1587993932,
                      "upvotes": 0,
                      "replies": {
                        "foqwj3p": {
                          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqwj3p/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1588002073,
                          "upvotes": 4,
                          "replies": {
                            "foqyllb": {
                              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqyllb/",
                              "text": "I misspoke. Financial analysts are not expected to have an MBA which is the main starting point for high level careers. Are there other ways? Sure, but the traditional route is elite school, financial analyst, associate, VP, director with potential slots in between and exit opportunities. In theory, you could go to Iowa for undergrad, go to an elite grad school for an MBA to break in, its just a lot less common.",
                              "author": "mikenike21",
                              "created": 1588003095,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "foqsxbb": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqsxbb/",
              "text": "Yeah but they don’t really pay nearly as well.",
              "author": "nyan_cats4all",
              "created": 1588000243,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "fopvik7": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopvik7/",
      "text": "This sub is crazy elitist, that's why I take everyones opinion on schools here with a grain of salt, and value it a lot less than the people that I actually know. It sucks to see my dream gpa or school called low or a safety. But it still also has bunch of useful information that I wouldn't have know of if I wasn't on the sub.",
      "author": null,
      "created": 1587973524,
      "upvotes": 5,
      "replies": {}
    },
    "fopot5e": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopot5e/",
      "text": "I definitely recognize that the sentiment of \"better is good\" is present on this sub, but from what I've seen it is more implicit than anything. Literally every actual post, that gains any traction at least, that discusses the stuff you are talking about always admonishes trophy chasing, while praising people who choose state schools or whatever economic option makes the most sense to them. Individuals make comments to the contrary, but they almost always get downvoted. If a post gets a lot of upvotes then even if you don't like what it says it is probably true, and not necessarily part of the elitism you describe.\n\nAt the end of the day this is an information sub. If you want information on colleges this sub will tell you, for better or worse. If you can't place your goals in a relative context of achievement and success (however you may define it) then yeah, this sub sucks because it was never meant to help validate peoples feelings and choices. But by that logic any place where highly driven people gather and discuss will irk you. \n\nHave confidence in your decision making and stay focused on your goals, because most of what you describe seems to stem from a lack of self esteem.",
      "author": "ikmZ62T3Vs",
      "created": 1587967446,
      "upvotes": 4,
      "replies": {}
    },
    "foppi59": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foppi59/",
      "text": "I have the exact same stats as you. I went to a tiny school you’ve never heard of because I knew I’d love it and I do. You’re lucky to know where you want to go, don’t second guess yourself",
      "author": "monsieurnubs",
      "created": 1587968033,
      "upvotes": 2,
      "replies": {}
    },
    "foq21lc": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq21lc/",
      "text": "True, I had seriously thought SAT 1590-1600 was extremely rare until this subreddit caught me off guard. Now I'm ashamed of myself and demotivated and I don't even know if that word is real or not",
      "author": "RandyNewman1902",
      "created": 1587980122,
      "upvotes": 2,
      "replies": {
        "foqv7xw": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqv7xw/",
          "text": "Naw Google the percentiles. It is extremely rare.",
          "author": "OfficialCicisPizza",
          "created": 1588001417,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "foq664c": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq664c/",
      "text": "If ur happy with ur choice of school and major that’s all that matters. U don’t need anyone’s validation bro.",
      "author": "RapiDMillionairE",
      "created": 1587984420,
      "upvotes": 2,
      "replies": {}
    },
    "forgs48": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forgs48/",
      "text": "Honestly, OP, I just use this sub to see what kind of person I could have been. I'm happy with my school and my major and I'm happy as a person. So many people here are bitter and angry that they aren't going to SYMPH or T20 or whatever the next level above their top school is. Someone makes it into Georgia Tech but wanted MIT, or something along those lines. \n\nThe secret is that they're not going to get any further than me because of their school. We'll wind up in the same places because I'm just as driven as they are, and I'll be able to meet just as many people in my field from my school as the will from theirs. The difference, and the thing that I will benefit from, is that I'll ultimately be a happy person and nice to be around, instead of bitter because I didn't get accepted to the absolute top school for my major.\n\nThis comment sounds kind of elitist, but... I dunno. I feel like so many people here are going to flounder in life because they're not looking at the bigger picture. Our lives are longer than the next four years, so why are we so concerned about those next four years? There's another sixty to go.",
      "author": null,
      "created": 1588011971,
      "upvotes": 2,
      "replies": {}
    },
    "fopnhpy": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopnhpy/",
      "text": "I don't know if you need this at all but I think I should tell. I'm a sophomore in highschool right now and I'm  just getting into the harder parts of highschool. I can't even imagine how hard it's going to be to manage good grades while taking 4 AP's next year. I understand that it's so much work. But you've done it and you've done it well. I'm proud of you. You've proved yourself to be incredibly dedicated and that's commendable. I wish you the best in college and for the rest of your life.",
      "author": "l33tIsSuperpower",
      "created": 1587966335,
      "upvotes": 4,
      "replies": {}
    },
    "fopv46w": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopv46w/",
      "text": "I go to stanford and my friends who go to public universities shit on me for a major I think I wanted to do. My parents/brothers questioned wtf would happen with a major in the social sciences/humanities. At the end of it, u really have to question:how would anybody know what path a major leads to? It's soooo fucking stupid to think that you need a certain major to be successful (something like 25% of people have jobs relating to their major).",
      "author": "FinalPush",
      "created": 1587973142,
      "upvotes": 3,
      "replies": {}
    },
    "fopy56q": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fopy56q/",
      "text": "Wait who shits on finance majors in terms of salaries?... Business/finance is a money maker.",
      "author": "Rin-Tohsaka-is-hot",
      "created": 1587976110,
      "upvotes": 3,
      "replies": {}
    },
    "foptcn3": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foptcn3/",
      "text": "Take whatever these kids say with a grain of salt.\n\nA good education is great but you need a level head and not be elitist. I plan on going to CUNY Baruch, one of the best business schools in the country, and I am proud of that, but I guarantee you someone will scoff at that and think I am below them, despite it being ranked the 2nd best Public School in the U.S. according to [Money.com](https://Money.com) \n\nWhat matters is you and being proud of yourself, nothing else.",
      "author": null,
      "created": 1587971470,
      "upvotes": 1,
      "replies": {}
    },
    "foq0glh": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq0glh/",
      "text": "Figuratively, yes.\nLiterally, no.",
      "author": "RaevanBlackfyre",
      "created": 1587978479,
      "upvotes": 1,
      "replies": {}
    },
    "foq3t4g": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq3t4g/",
      "text": "Everyday\n\nBut still can't stop myself",
      "author": "GhoSteroid_306",
      "created": 1587981978,
      "upvotes": 1,
      "replies": {}
    },
    "foq7bx4": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq7bx4/",
      "text": "With you, honestly",
      "author": "oi_peiD",
      "created": 1587985572,
      "upvotes": 1,
      "replies": {}
    },
    "foq95o4": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foq95o4/",
      "text": "I read through this subreddit all the time and im a junior in highschool with a solid 2.9 gpa.  Trust me i feel you",
      "author": "emnim27",
      "created": 1587987279,
      "upvotes": 1,
      "replies": {}
    },
    "foqafmj": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqafmj/",
      "text": "I feel that but I’m real life. I overshot the school I’m going to. Chose them because they gave me the best price and I really liked the campus / community, but it isn’t really prestigious at all. Can be hard sometimes when I see my friends, close friends, going to elite schools and wearing the sweatshirt around like a trophy",
      "author": "Mentoze",
      "created": 1587988393,
      "upvotes": 1,
      "replies": {}
    },
    "foqbq8z": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqbq8z/",
      "text": "I agree man, I feel like I'm shit in this subreddit.",
      "author": "FieryBlaze21",
      "created": 1587989473,
      "upvotes": 1,
      "replies": {}
    },
    "foqglv6": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqglv6/",
      "text": "[TL;DR at the bottom] I was reading through the comments on this post and I agree completely with all that I read. Whenever someone posts something just to find out about general information about college, I as a Freshman,  about to be a Rising Sophomore, I am more than happy to answer if I know about what they're asking. Otherwise, my fellow college students and former/current Admissions Officers and Interviewers will answer. Whenever someone posts something that is along the lines of the Elitist Culture in which you are referring to, I don't even acknowledge them. Sometimes you could just tell from the title alone. For some jobs and some situations, yes the prestige will be taken into account when in the competitive job market, BUT most of the time it will not matter, what WILL matter is your skills are and work ethic and what you can show the recruiters that will put you into consideration for the job.\nLet's take my major for example, but I will not name the school just for my own privacy. I study Computer Engineering which is paired with Electrical Engineering until a certain point in the 4 years. If you sit me down with an Electrical Engineering student from Yale, for example, and ask us both about circuits. Chances are we will be able to answer most of your questions depending on the courses we have taken at this point and what we will take in the future. We are learning the same exact things its just that we are in different schools.\nAnother thing is the math. Okay this is probably an obvious one, but just to get the point further across. Most schools, if not all of them including Ivys, will use Pearson for their course materials which include textbooks. The curriculum for a class is based on the specific textbook.With that being said, yes schools will tweak it, yes schools will go more in depth than others, but at their core each curriculum is the same, because the textbook is 9/10 the same across multiple schools, again including Ivys. I just looked up a Calculus 2 syllabus from MIT. Literally they are using the same textbook my school is for Calc 1, 2, and 3. Again, learning the same things, just in different schools.\nIf people want to go to Ivys and other prestigious schools go for it, but the issue is people wanting to go to these prestigious schools thinking that they will automatically be fine in the job market just because of where they get their degree which cannot be any more unrealistic. Yea sure coworkers might have went to reputable schools for maybe their masters, but ask them where they did their undergrad. You may get a Harvard, or maybe a UC, or  even UT, but you'll most likely get a slew of different schools across the country. Professors in your very college may have even taught in less reputable colleges before their current one.\n\nTL;DR: It matters where you go to college only to a certain extent. What matters more is the skills you learn and reinforce while you're in college and how you and others regard yourself as a person.",
      "author": "sean_ramrezzi",
      "created": 1587993087,
      "upvotes": 1,
      "replies": {
        "fosklf1": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fosklf1/",
          "text": "[deleted]",
          "author": null,
          "created": 1588032552,
          "upvotes": 1,
          "replies": {
            "fosksgx": {
              "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fosksgx/",
              "text": "Very solid points",
              "author": "sean_ramrezzi",
              "created": 1588032664,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "foqqvte": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqqvte/",
      "text": "I always want to but especially when i come on here :)",
      "author": "goflyint0",
      "created": 1587999175,
      "upvotes": 1,
      "replies": {}
    },
    "foqx7ht": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqx7ht/",
      "text": "Comparing oneself to others is never a helpful exercise.  It normally breeds either jealousy or conceit...and we can all do without either of them in our lives.  I graduated long long ago and lurk here mainly for my HS students.  When I'm in board rooms pitching deals I can assure you that the resumes of my potential clients are all over the map in terms of their schools and education levels.  Keep your nose to the grindstone, do something you like with people you like, and good things will happen.",
      "author": "kickin_it_old_skool",
      "created": 1588002408,
      "upvotes": 1,
      "replies": {}
    },
    "fordytc": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fordytc/",
      "text": "Any humanities major that isn’t business is absolutely shit on here. And if it’s not shit on its cause no one cares enough about it to shit on it. Really great hearing the major I got in for (Communication), one I busted my ass for and did similar ECs to improve my chances for, one that I genuinely love, will probably lead me nowhere :).\n\nEven if it’s objectively true that we don’t make as much money on average, doesn’t mean we like hearing it.",
      "author": "belarussianchicken",
      "created": 1588010601,
      "upvotes": 1,
      "replies": {}
    },
    "forfpg8": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forfpg8/",
      "text": "Yeah, my favorite part is when people say going to a T50 state school is like you being a big fish in a small pond when the school is actually known for academics",
      "author": "AriesGirl101",
      "created": 1588011446,
      "upvotes": 1,
      "replies": {}
    },
    "forhxxv": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forhxxv/",
      "text": "Yeah me too. It's kinda hard to not be brought down as a finance major and not going to the top 3 and constantly getting shit on and told no one is going to hire me.",
      "author": "Silky-love",
      "created": 1588012536,
      "upvotes": 1,
      "replies": {}
    },
    "form09m": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/form09m/",
      "text": "My son told me about Reddit.  His anxiety about applying to college shot through the roof when he was on it. I joined so I could see what it was about. Don't shoot yourself, just walk away. There's sometimes some valuable information on here, but for the most part it is a lot of people comparing and that's never helpful. \n\nDon't seek validation through others, that will mess you up. If you know what you want to do stay focused on that and work toward it, everything else is a distraction. Listen to your instincts, they are good. \n\nFinally, read the book [Where You Go Is Not Who You'll Be: An Antidote to the College](https://www.amazon.com/Where-You-Not-Who-Youll/dp/1455532681) Admissions Mania. After perusing this for several months, I definitely see there's mania surrounding it.",
      "author": "Burgess1966",
      "created": 1588014492,
      "upvotes": 1,
      "replies": {}
    },
    "fos1ghg": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fos1ghg/",
      "text": "Honestly this sub is pretty cancer but I still can't stop myself from leaving it, I need help.",
      "author": "3SSK33T1T",
      "created": 1588022244,
      "upvotes": 1,
      "replies": {}
    },
    "fosexdl": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fosexdl/",
      "text": "ME too haha, this sub makes it seem as though it's impossible to succeed without prestige in Finance, but there are many opportunities at state schools too.",
      "author": "vanilla_haseul",
      "created": 1588029375,
      "upvotes": 1,
      "replies": {}
    },
    "foskwpk": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foskwpk/",
      "text": "I mean I’m here with like a 3.86 unw and a 1380 SAT and I always feel like I’m not good enough. It is what it is man. I still keep coming back because I have hope, which will most likely be crushed come admissions decisions next year (Hs Junior).",
      "author": "BrianMGer",
      "created": 1588032733,
      "upvotes": 1,
      "replies": {}
    },
    "fostcmd": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/fostcmd/",
      "text": "With that work ethic, you’re going to do just fine. People who assume going to an Ivy League is all they need to get ahead in life are going to have their own problems. I can’t villainize anyone, everyone’s wrong in their own sort of way, but when you stop worrying about what other people think you can focus on yourself.\n\nAlso, it’s okay to feel bad sometimes! We’re all human, just try not to dwell on it too much.",
      "author": "pikkupanda197",
      "created": 1588037635,
      "upvotes": 1,
      "replies": {}
    },
    "foqvlxp": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqvlxp/",
      "text": "[deleted]",
      "author": null,
      "created": 1588001614,
      "upvotes": 0,
      "replies": {
        "for4dq4": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for4dq4/",
          "text": "well, the general major is Business Admin and you concentrate on finance, accounting, data information systems etc. Which pretty much means your last two years you only take classes that do with the concentration.",
          "author": "abbabaahdd",
          "created": 1588005972,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "for3wz0": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for3wz0/",
      "text": "It’s not my words; it is the word of God.",
      "author": "eritrean-adonai",
      "created": 1588005746,
      "upvotes": 0,
      "replies": {}
    },
    "forio6a": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/forio6a/",
      "text": "Just do community college",
      "author": "SlipknotFan314",
      "created": 1588012887,
      "upvotes": 0,
      "replies": {}
    },
    "foqpaf0": {
      "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/foqpaf0/",
      "text": "Don’t use the Lord’s name in vain. Any utterance I f his name that is not in an exhausting manner is sin.",
      "author": "eritrean-adonai",
      "created": 1587998314,
      "upvotes": -4,
      "replies": {
        "for0cn1": {
          "link": "/r/ApplyingToCollege/comments/g8qo8i/does_reading_this_subreddit_make_anyone_else_want/for0cn1/",
          "text": "Imagine forcing your religion onto random people on the internet.",
          "author": "jre3d13",
          "created": 1588003976,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}