{
  "sid": "qjxpv2",
  "link": "/r/ApplyingToCollege/comments/qjxpv2/calling_colleges_for_fee_waivers/",
  "title:": "calling colleges for fee waivers",
  "text": "sorry if this is a dumb question, but I plan on contacting some of the universities I’m applying to and asking for an application fee waiver (I don’t qualify for them, but the cost of applying to so many isn’t something I can ignore). could someone guide me on what exactly to say? like what information to provide, how to preface the question, how to ask for the waiver, etc.? Thank you in advance. I get super nervous with phone calls ;-;",
  "author": "eskapi",
  "created": 1635711223,
  "updated": 1635777987,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hit19ff": {
      "link": "/r/ApplyingToCollege/comments/qjxpv2/calling_colleges_for_fee_waivers/hit19ff/",
      "text": "This is not something to call about. Write a polite \"template\" email, clearly and concisely explain your qualifying situation and request, then send it to the appropriate contact at each school, editing each email accordingly. Include the name of your High School and City/State too. \n\nOften, you don't even send an email. There's a form on the college's site or as part of their application. So you will need to research the correct method of request for each school.\n\nGood luck!",
      "author": "renebeca",
      "created": 1635712211,
      "upvotes": 3,
      "replies": {
        "hithfp9": {
          "link": "/r/ApplyingToCollege/comments/qjxpv2/calling_colleges_for_fee_waivers/hithfp9/",
          "text": "Thank you so much! I appreciate you",
          "author": "eskapi",
          "created": 1635719641,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hit3xrn": {
      "link": "/r/ApplyingToCollege/comments/qjxpv2/calling_colleges_for_fee_waivers/hit3xrn/",
      "text": "If you know you don’t qualify for them, then I don’t know how to conduct a call asking for something that you know you won’t/shouldn’t get.\n\nMaybe ”Hi, I know I don’t qualify for a waiver, but I don’t want to pay you, so can you just give me a waiver anyway?”",
      "author": "RichInPitt",
      "created": 1635713363,
      "upvotes": 0,
      "replies": {
        "hithmld": {
          "link": "/r/ApplyingToCollege/comments/qjxpv2/calling_colleges_for_fee_waivers/hithmld/",
          "text": "lol yeah i remember reading a post on here where someone did that successfully with multiple colleges and wanted to try my luck😭 but thank you anyways!",
          "author": "eskapi",
          "created": 1635719734,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}