{
  "sid": "qd7628",
  "link": "/r/ApplyingToCollege/comments/qd7628/im_so_done_for/",
  "title:": "Im so done for",
  "text": "I studied this whole week just to get a 68 on my ap physics test. I was so confident I did well too. Im so mentally exhausted trying to figure out the damage this will do to my gpa combined with my first test score of 65 \n\nI just want to enjoy my last year of hs\n\ngg.",
  "author": "CanadianChurro",
  "created": 1634869190,
  "updated": 1635183961,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.72,
  "comments": {
    "hhknumj": {
      "link": "/r/ApplyingToCollege/comments/qd7628/im_so_done_for/hhknumj/",
      "text": "Hang in there! Figure out what you did wrong and re-group. Did you understand the material enough? Did you study everyday or did you cramm? Could you talk to the teacher to maybe do some extra credit? Don't worry!",
      "author": "MackinacFleurs",
      "created": 1634870775,
      "upvotes": 2,
      "replies": {
        "hhkpy9r": {
          "link": "/r/ApplyingToCollege/comments/qd7628/im_so_done_for/hhkpy9r/",
          "text": "I didn’t cram and Its unfortunate bs that the question worth the most points was what i have no clue how to answer. I’ve tried to study it, solve it, ask my teacher but it just doesn’t make sense to me. On top of that, Im a horrible test taker and I just got assigned a research paper and have to revise two essays. \n\nMakes me want to just give up after I submit my college apps",
          "author": "CanadianChurro",
          "created": 1634871823,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhks8tv": {
      "link": "/r/ApplyingToCollege/comments/qd7628/im_so_done_for/hhks8tv/",
      "text": "My daughter started AP Physics like that as well.  With tutoring, she was able to pull her grade up to a B (her only non-A on her transcript) and she got a 4 on the AP test.  It's the first time she's struggled with a class and I'm glad she went through it in high school instead of college.  She spent as much time on Physics as the rest of her classes combined.\n\nYou can do this!",
      "author": "SF2023",
      "created": 1634872976,
      "upvotes": 1,
      "replies": {}
    },
    "hhnrgzm": {
      "link": "/r/ApplyingToCollege/comments/qd7628/im_so_done_for/hhnrgzm/",
      "text": "MEEEE PHYSICS C IS SO HARD GG I GOT A 67 ON MY FIRST TEST 🐸🐸",
      "author": "bearecx",
      "created": 1634931727,
      "upvotes": 1,
      "replies": {}
    }
  }
}