{
  "sid": "rian8y",
  "link": "/r/ApplyingToCollege/comments/rian8y/how_to_deal_with_ed_rejection/",
  "title:": "How to deal with ED rejection?",
  "text": "Basically the title, I got rejected from Penn ED today, and I really loved the school and programs that it offered. I know that rejection is redirection and it isn’t the place that was for me, but I can’t really shake that feeling of dread that I have and I really feel like I can’t get in anywhere other than my safeties. To add insult to injury, there are 4 people who got into Penn ED from my school and I just feel way too inadequate. Any tips to get over it and move on, or should I just soldier through with it?",
  "author": "DecisiveHypnosis",
  "created": 1639720973,
  "updated": 1639785583,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hovw8xd": {
      "link": "/r/ApplyingToCollege/comments/rian8y/how_to_deal_with_ed_rejection/hovw8xd/",
      "text": "You tried. That's the biggest thing. Accept that it happened and redirect yourself. Don't overthink it. You've come so far and one literally random decision doesn't reflect on you as a person. Keep going, life goes on. Kill it in RD.",
      "author": "mari512",
      "created": 1639721763,
      "upvotes": 4,
      "replies": {}
    },
    "how22z0": {
      "link": "/r/ApplyingToCollege/comments/rian8y/how_to_deal_with_ed_rejection/how22z0/",
      "text": "Think about this way - you don’t want to peak at 16/17/18. Trust me, college is not where you go, but what you make out of it. You’ll be successful in life if you  use  your undergrad years wisely and productively, no matter wherever college you end up going.",
      "author": "anxiousCAMom",
      "created": 1639725547,
      "upvotes": 3,
      "replies": {}
    },
    "hovvtsy": {
      "link": "/r/ApplyingToCollege/comments/rian8y/how_to_deal_with_ed_rejection/hovvtsy/",
      "text": "Could be worse. Could be a lot worse.",
      "author": "pododog",
      "created": 1639721496,
      "upvotes": 1,
      "replies": {}
    },
    "hovwi24": {
      "link": "/r/ApplyingToCollege/comments/rian8y/how_to_deal_with_ed_rejection/hovwi24/",
      "text": "Just find a few targets you like and apply to them. T20 admissions is a complete shitshow. It’s like throwing shit at a dartboard blindfolded, there’s not a lot of rhyme or reason to it. It’s not worth your time or anyone else’s to let Penn State-West Philly make you feel like shit over something you can’t control.",
      "author": "myfedoraismlg",
      "created": 1639721926,
      "upvotes": 1,
      "replies": {}
    }
  }
}