{
  "sid": "r7d8ol",
  "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/",
  "title:": "why do people think applying ED is bad?",
  "text": "i’m EDing to a top 10 school (duke)\nmy friends were shocked when i told them and asked why i would lock myself in. i overheard a lot of kids in my grade saying they would never apply early decision unless they had bad stats and it was their last resort. they are all applying regular to keep their options open for better schools. \n\nmy mom also said that if i get in ED, i should not tell anyone i got in until the regular decision results come out since my peers would assume i only got in because i applied early and think that i’m not actually smart enough to get in regular. i also have a sibling currently attending so they’ll assume the legacy+ed combo means i have no merit? she thinks it won’t even be the slightest bit impressive if i tell anyone i got in early.\n\ni know i shouldn’t care what others think, but it’s honestly so tiring — why is there such a stigma against applying early decision if i know i want to go to a certain school? anyone else have a similar experience?\n\nalso why do so many people at my school not apply early at all, like not even REA which doesn’t even force you to attend the school? is it just an ego thing, are they lying, or is it related to financial aid?",
  "author": "dddddandelion",
  "created": 1638468152,
  "updated": 1638477875,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hmyksz5": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmyksz5/",
      "text": ">my peers would assume i only got in because i applied early and think that i’m not actually smart enough to get in regular.\n\nDo your peers actually believe that Duke — or any top school — admits less-than-competitive applicants during the ED round?\n\nDuke gets something like 40,000 applications for 1,500 spots. The idea that there would be any need/value for them to lower their standards during the ED round defies logic.",
      "author": "Strict-Special3607",
      "created": 1638468617,
      "upvotes": 22,
      "replies": {}
    },
    "hmymw7t": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmymw7t/",
      "text": "The main reason to avoid applying ED is that you don’t have a top choice and would like to see what your aid packages look like before you commit.  Or, perhaps you didn’t have a chance to visit your top schools or delve deep into your majors of interest.  Applying EA gives you a chance, once application season is over, to spend a little time researching the programs at your favorite schools to see which one is the best fit for your particular interests.\n\nBut I’m writing primarily — as a parent— to tell you that I’m very sorry your mom is preemptively undermining your achievement should you get into Duke.  Anyone who has a true favorite college and can afford that college is leaving cards on the table if they don’t apply ED.  It would be foolish NOT to up your chances by applying ED — it’s simply a matter of declaring that XXX college is your top school.  It’s the ultimate demonstration of interest. Your mom’s view is akin to saying you should skip an offered interview because it might give you an advantage over an applicant who chose not to interview. That’s nuts.\n\nGetting into Duke is impressive, period.  It doesn’t matter if you applied ED, have a legacy connection, or amazed a soft-hearted admissions officer by saving a herd of wild alpacas from destruction.  Duke admissions does not conduct pity parties.  If you get in, they wanted you.  If you get in, celebrate your good fortune, tell your friends, and recognize that the college application process doesn’t always bring out the best in parents. Very best of luck to you.  Enjoy ALL your acceptances and rest assured that you’ll very likely have a terrific college experience no matter where you go.",
      "author": "HappyCava",
      "created": 1638469421,
      "upvotes": 10,
      "replies": {}
    },
    "hmyl8lw": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmyl8lw/",
      "text": "Your friends aren’t getting it. They aren’t coming from your position.  I support  your ED move.",
      "author": "T123369",
      "created": 1638468785,
      "upvotes": 7,
      "replies": {}
    },
    "hmylwru": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmylwru/",
      "text": "Ayy I also applied ed to duke, gl!",
      "author": "Zeus1027",
      "created": 1638469043,
      "upvotes": 3,
      "replies": {}
    },
    "hmyrlc9": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmyrlc9/",
      "text": "Yes I agree. Idk why everyone has a sigma against ED, ever since I knew it existed I knew I wanted to do it",
      "author": "Tiko1787",
      "created": 1638471225,
      "upvotes": 2,
      "replies": {}
    },
    "hmytky0": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmytky0/",
      "text": "People don't applying for ED only coz they haven't made up their mind.  Anyone who says applying ED means no merit is dumb, period. T10s like Duke have more qualified students than they can admit in whatever rounds, so ED isn't easier but is definitely more likely.",
      "author": "Katsura_Do",
      "created": 1638471990,
      "upvotes": 2,
      "replies": {}
    },
    "hmyv0l9": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmyv0l9/",
      "text": "The college admissions landscape is changing … and EA, ED and REA are a big part of that.\n\nIt sounds to me like you happen to be much more aware of these changes than the rest of your school.  \n\nThere is nothing to be embarrassed about if you get into Duke ED …. That is a great accomplishment and very difficult.  Good luck!",
      "author": "ChancellorGH",
      "created": 1638472543,
      "upvotes": 2,
      "replies": {}
    },
    "hmz0v96": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmz0v96/",
      "text": "I was looking for the shitpost flair lmao. Whatever those people are saying is bs and even if they think you have no merit, you got in and they didn't.",
      "author": "Valthr4x_",
      "created": 1638474807,
      "upvotes": 1,
      "replies": {}
    },
    "hmz4fhy": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmz4fhy/",
      "text": "That’s crazy, pretty much everyone I know applied ED somewhere…",
      "author": "loosebolt708",
      "created": 1638476222,
      "upvotes": 1,
      "replies": {}
    },
    "hmz8qec": {
      "link": "/r/ApplyingToCollege/comments/r7d8ol/why_do_people_think_applying_ed_is_bad/hmz8qec/",
      "text": "it’s stupid to not ED, you’re basically letting colleges know that they’re your top choice",
      "author": "proxoo39",
      "created": 1638477847,
      "upvotes": 1,
      "replies": {}
    }
  }
}