{
  "sid": "r6e60p",
  "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/",
  "title:": "How do you show colleges your interest in medicine when in high school?",
  "text": "I know that shadowing physicians is a great experience, but how do people get internships at hospitals or clinics when they're high schoolers?",
  "author": "SmoothTennisBall24",
  "created": 1638363463,
  "updated": 1638478664,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmsjd58": {
      "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/hmsjd58/",
      "text": "Suspect it's not super-necessary.  You're not majoring in medicine; you're majoring in {whatever} with the goal of becoming a physician.  If I were looking for something to signal my desire to serve people in a health-related capacity, I might consider volunteering at a hospital or other health-related venue (clinic, etc.)",
      "author": "jayphoward",
      "created": 1638364702,
      "upvotes": 5,
      "replies": {
        "hmsx87l": {
          "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/hmsx87l/",
          "text": "Oh ok I was just wondering because I've been having an a small existential crisis because I feel like I need to do more, but also I know not to do things I don't have interest in, thank you!",
          "author": "SmoothTennisBall24",
          "created": 1638371353,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmsryz0": {
      "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/hmsryz0/",
      "text": "I'm sure some people have connections to do this (let's say doctor parents), but I talked to a relative who works (high up) in a hospital, and they said there is no way they would let a teenager job shadow due to privacy and liability concerns.",
      "author": "mommacat94",
      "created": 1638369021,
      "upvotes": 3,
      "replies": {
        "hmv9w3c": {
          "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/hmv9w3c/",
          "text": "My oral surgeon let me shadow him, and I now shadow every other day at the hospital through a class I am taking at the hospital. As long as you get trained with HIPAA its not a problem.",
          "author": "Character_Society_18",
          "created": 1638405115,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmsvjm2": {
      "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/hmsvjm2/",
      "text": "Colleges don't care if you're pre-med. They know that a lot of kids are weeded out after taking the prerequisites 1st and 2nd year. As soon as you start college, though, start volunteering and maybe looking for research opportunities. Many kids don't do this till later on in college, and it limits the number of hours they record for their Med school apps. Even an hour or two per week at your local low-cost clinic will add up over 3-4 years. It's relatively easy to schedule it into a college student schedule. Same with studying for MCATs, although that's just what I've read in premed forums from the really high scorers. Good luck!",
      "author": "the3twins",
      "created": 1638370620,
      "upvotes": 3,
      "replies": {
        "hmt09y3": {
          "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/hmt09y3/",
          "text": "Thank you so much! You majorly alleviated my worries about it. I've been feeling like I'm wasting my high school experience so far because of the outlook the adults around me have, they think that spending time with friends wastes time and focus on school but i feel like I've been limited in productivity because I can't hang out with friends, thank you once again!",
          "author": "SmoothTennisBall24",
          "created": 1638372651,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmufclm": {
      "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/hmufclm/",
      "text": "In Los Angeles, Cedars has a program for HS students to shadow and do some volunteer work, maybe your local hospital has same type of program",
      "author": "Hamilton3322",
      "created": 1638392499,
      "upvotes": 1,
      "replies": {}
    },
    "hmv9hec": {
      "link": "/r/ApplyingToCollege/comments/r6e60p/how_do_you_show_colleges_your_interest_in/hmv9hec/",
      "text": "I got my EMT certification and now I volunteer every week on the ambulance! My state allows 16+ to work :)\n\nIts so much fun and a great experience if you want to be pre med. I talk to patients, take vitals, do basic care, and write the charts! Definitely recommend it!",
      "author": "Character_Society_18",
      "created": 1638404936,
      "upvotes": 1,
      "replies": {}
    }
  }
}