{
  "sid": "qqkj6d",
  "link": "/r/ApplyingToCollege/comments/qqkj6d/question_about_sending_sat_scores/",
  "title:": "Question about Sending SAT Scores",
  "text": "Hi, I'm about to apply to the University of Pittsburg, and I have pretty much set to hit submit and make the payment, but I realized that they don't accept self-reported SAT scores.\n\nSince this is the only school so far that required an official report, I was kinda confused on how the process worked. Should I first send the score report through Collegeboard to Pitt and wait until they've received the score, or should I submit the application and submit the score report (which is supposedly scheduled to arrive after 2 or so wks).\n\nThe thing is, it's rolling admissions, so I want to submit my application as soon as possible, and I'm not really sure how to proceed with the school needing SAT reports.",
  "author": "EpicGamesLauncher",
  "created": 1636513392,
  "updated": 1636653396,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk0u5kr": {
      "link": "/r/ApplyingToCollege/comments/qqkj6d/question_about_sending_sat_scores/hk0u5kr/",
      "text": "It does not matter whether the score report or the app arrive first. Get the score report ordered, because as you noted, that can take anywhere from a few days to two weeks. Submit your app whenever you're ready.",
      "author": "elkrange",
      "created": 1636513735,
      "upvotes": 3,
      "replies": {}
    },
    "hk4kb4h": {
      "link": "/r/ApplyingToCollege/comments/qqkj6d/question_about_sending_sat_scores/hk4kb4h/",
      "text": "You can send material in any order. Schools are good at matching up application components.\n\n&#x200B;\n\n>I'm about to apply to the University of Pittsburg,\n\nIt would probably be advantageous to spell the school’s name correctly.\n\nThere’s a Pittsburg State (Pitt State) in Kansas and a University of Pittsburgh (Pitt) in Pennsylvania.\n\n(And for those wondering. Perdue is a chicken, not a University)",
      "author": "RichInPitt",
      "created": 1636582773,
      "upvotes": 2,
      "replies": {}
    }
  }
}