{
  "sid": "rge80v",
  "link": "/r/ApplyingToCollege/comments/rge80v/i_got_in_but_i_need_advice/",
  "title:": "i got in!! but i need advice",
  "text": "okay so basically, the college has a facebook group and nobody’s really posted anything on it. i want to post an introduction but i don’t actually know if i’m supposed to or not. also, i don’t want people thinking i’m trying to be qUiRkY because of my introduction,, like i’m being completely honest in it but i still don’t want people thinking i’m trying too hard ig? here’s the introduction:\n\nhi everyone!!\n\nnobody’s really posted anything here so i guess i’ll start by introducing myself. here are a few things about me:\n\n- my name is [insert name here] (as seen in my profile)\n- i’m hoping to major in math or political science (or maybe both) but that could change by the time we have to choose our major\n- i’m also interested in mythology, chemistry, and astronomy/astrophysics, and art history but i’m not gonna pursue those\n- i some of my favorite things to watch are doctor who, marvel, good omens, and the umbrella academy\n- i love to listen to audiobooks and my some of favorite books are Scythe by Neal Schusterman and An Absolutely Remarkable Thing by Hank Green\n- i’m part of the academic team at my school, which is sorta like quizbowl but with different scoring\n\nalso, i don’t really use facebook— i just made it for this— so my instagram is [insert instagram] if you want to dm me or follow me. be warned: my instagram is mostly pictures of my cat.\n\nlooking forward to seeing you guys at [college]!!! (ahhhh, i’m so excited!)\n\nany notes??\n\nalso, ik this isn’t strictly admissions-related but idk where else to put this so,, heh",
  "author": "PeculiarMicrowave",
  "created": 1639507540,
  "updated": 1639835260,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hojoa30": {
      "link": "/r/ApplyingToCollege/comments/rge80v/i_got_in_but_i_need_advice/hojoa30/",
      "text": "IMO you don't need to include the part about maybe changing your major. \ncongrats!",
      "author": "lunalovegoodisales",
      "created": 1639508933,
      "upvotes": 3,
      "replies": {
        "hojoky2": {
          "link": "/r/ApplyingToCollege/comments/rge80v/i_got_in_but_i_need_advice/hojoky2/",
          "text": "we don’t choose majors until the end of sophomore year at the school i’m going to but ye, probably a good idea",
          "author": "PeculiarMicrowave",
          "created": 1639509050,
          "upvotes": 1,
          "replies": {}
        },
        "hojon6l": {
          "link": "/r/ApplyingToCollege/comments/rge80v/i_got_in_but_i_need_advice/hojon6l/",
          "text": "also, thank you!!",
          "author": "PeculiarMicrowave",
          "created": 1639509075,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hojxe41": {
      "link": "/r/ApplyingToCollege/comments/rge80v/i_got_in_but_i_need_advice/hojxe41/",
      "text": "my advice is to use this post an a way of making friends. like if you think your friends would want to know that you were in the academic team in your school, keep that, but if not then drop it.",
      "author": "Ok_Place2147",
      "created": 1639512492,
      "upvotes": 1,
      "replies": {}
    },
    "hok7qzn": {
      "link": "/r/ApplyingToCollege/comments/rge80v/i_got_in_but_i_need_advice/hok7qzn/",
      "text": "Sounds perfect to me, you might also see if the school has a subreddit that’s active",
      "author": "dalej42",
      "created": 1639516659,
      "upvotes": 2,
      "replies": {
        "holwwq8": {
          "link": "/r/ApplyingToCollege/comments/rge80v/i_got_in_but_i_need_advice/holwwq8/",
          "text": "it does not, oof-",
          "author": "PeculiarMicrowave",
          "created": 1639544471,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}