{
  "sid": "qjusv9",
  "link": "/r/ApplyingToCollege/comments/qjusv9/wondering_what_to_write_my_college_essay_on/",
  "title:": "Wondering what to write my college essay on",
  "text": "I want to write my college essay on how horrible my schooling experience was. I had ADHD coming into 1st grade and my school separated me from the other kids and this experience grew worse throughout highschool, and i ended up suffering depression which the school and my teachers did nothing about. I really want to write about the struggles i face because of this, but I’m really wondering wether or not this would look good for colleges considering that it does involve criticizing the schooling system in America.",
  "author": "MasterOTU",
  "created": 1635702783,
  "updated": 1635777557,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hisl34m": {
      "link": "/r/ApplyingToCollege/comments/qjusv9/wondering_what_to_write_my_college_essay_on/hisl34m/",
      "text": "Don’t. You’d basically be telling the college that you aren’t going to succeed. Instead focus on how you overcame it",
      "author": "anonymousclue2",
      "created": 1635705487,
      "upvotes": 7,
      "replies": {}
    },
    "histq4r": {
      "link": "/r/ApplyingToCollege/comments/qjusv9/wondering_what_to_write_my_college_essay_on/histq4r/",
      "text": "If you could talk about how you struggled but were able to do well despite these issues that could be a really good essay probably, I'm not an AO though so I could be wrong.",
      "author": "EffectiveCustard",
      "created": 1635709067,
      "upvotes": 3,
      "replies": {}
    },
    "hitjeyx": {
      "link": "/r/ApplyingToCollege/comments/qjusv9/wondering_what_to_write_my_college_essay_on/hitjeyx/",
      "text": "I suggest turning this into how you were able to succeed in the face of adhd/depression. Use a specific story for essay framework. Perhaps you have worked with or mentored/volunteered w kids so they don't suffer in the same way etc... Criticizing isn't a problem if overall you highlight you. Tell why this experience has made you stronger, wiser and motivated.\n\nGood Luck",
      "author": "Hamilton3322",
      "created": 1635720607,
      "upvotes": 1,
      "replies": {}
    }
  }
}