{
  "sid": "re5e0d",
  "link": "/r/ApplyingToCollege/comments/re5e0d/anyone_else_not_apply_ed/",
  "title:": "Anyone else not apply ED?",
  "text": "I didn’t apply ed anywhere because my parents weren’t sure about it money-wise and wanted me to compare offers. Now I’m seeing all these people already know where they’re going and it’s just so annoying. I wish I knew.\n\nI’m mostly seeing kids from my town’s high school—which is wealthier/more “elitist” than my catholic high school—get into the ivies and top LACs ED. A bunch of these kids are legacies to LACs and it’s crazy to see how much that matters. We’re talking like <10% acceptance rates and they’re getting in. Crazy…",
  "author": "skinnnyjimmmy",
  "created": 1639246505,
  "updated": 1639514941,
  "over_18": false,
  "upvotes": 31,
  "upvote_ratio": 1.0,
  "comments": {
    "ho5dmdm": {
      "link": "/r/ApplyingToCollege/comments/re5e0d/anyone_else_not_apply_ed/ho5dmdm/",
      "text": "I didn’t for a few reasons. First off, my current top choice doesn’t even offer ED as an option, but I’m not sure if I would’ve even gone ED if I could. Secondly, it feels a lot better to still have the ability to make a choice",
      "author": "ComplexCondition6615",
      "created": 1639247252,
      "upvotes": 10,
      "replies": {}
    },
    "ho5egrw": {
      "link": "/r/ApplyingToCollege/comments/re5e0d/anyone_else_not_apply_ed/ho5egrw/",
      "text": "A lot of people didn’t. You just don’t hear about them now but you will !",
      "author": "T123369",
      "created": 1639247600,
      "upvotes": 5,
      "replies": {}
    },
    "ho5h19g": {
      "link": "/r/ApplyingToCollege/comments/re5e0d/anyone_else_not_apply_ed/ho5h19g/",
      "text": "You’re fine. Actually, you’re beyond fine. The large majority of applicants to most colleges are regular decision. What you’re seeing on this sub is far from a true reflection of the college application process as a whole.",
      "author": "jjhoster",
      "created": 1639248693,
      "upvotes": 4,
      "replies": {}
    },
    "ho5rsc9": {
      "link": "/r/ApplyingToCollege/comments/re5e0d/anyone_else_not_apply_ed/ho5rsc9/",
      "text": "me neither!! Really wish I could have done ED for Uchicago because i love it and already have taken an astrophysics course there, but ultimately i need to be able to examine the financial aid offers from other schools i (may) get into in the future. I like the freedom it gives me to fall in love with other schools and I’m prone to having second thoughts about everything lmao",
      "author": "Soft-Physics-2993",
      "created": 1639253332,
      "upvotes": 2,
      "replies": {}
    },
    "ho6nath": {
      "link": "/r/ApplyingToCollege/comments/re5e0d/anyone_else_not_apply_ed/ho6nath/",
      "text": "Neither of my top 2 choices offered ED, and I think I have a shot at both of them. EA to 12 schools and am doing RD to two that didn’t have EA. Might add more RD if my top few picks don’t like me back though.",
      "author": "1107Astro",
      "created": 1639267497,
      "upvotes": 1,
      "replies": {}
    }
  }
}