{
  "sid": "qvrbdj",
  "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/",
  "title:": "I wasn't allowed to attend school but I really want to go to college- need advice",
  "text": "Sorry if this is in the wrong place- there isn't really anyone I can talk to irl, and this sub seemed like the best place.\n\nI live in a very small town in the southern part of the United States. homeschooling without regulation is perfectly legal here (not that I have anything against homeschooling but my parents have abused this law, and I pretty much have no education except what I have taught myself) \n\nTo give a quick(well not really) background on my schooling: I attended school freshman year somewhat normally and did great. However, once covid happened my parents became very fearful and scared (like believing in microchips in vaccines, Qanon, women shouldn't have an education etc). Sophmore year after my parents pulled me out of school I just decided to self-study, and using some money I made with art commissions, I took a few AP exams. My parents made no effort to teach me anything, but they didn't actively discourage it. This changed as i entered junior year, they started actively fighting me when I tried to study (I literally had to secretly do calculus in our crawl space, or else they would become aggressive). Now i am currently studying for the SAT + a test that is sort of like the SAT/GED that i need to pass in order to take duel enrollment classes (i guess they aren't technically duel enrollment? idk). I got a full score on the English section and plan to take the math one soon and i think ill do good on that one as well so i'm not particulaly worried about gaps in my actual knowledge (dont ask how i actually plan to take these classes- im still trying to figure it out) \n\nOKAY, now that thats all covered lets get to what im concerned about,, next year i would like to apply to a non CC college so i can get a bachelors in the field i want to study, I just am very conflicted on how I should go about explaining my situation... I dont want to lie, but im not exactly sure what to do...\n\n I remember reading Tara Westover's book Uneducated, and when she was in a situation similar to this she took the ACT, got a good score, and basically lied on the application that she had a great and rigorous homeschool curriculum.\n\nI dont want to lie, but im worried doing something like this would be best, that still leaves me scrambling in search of recomendation letters but at least colleges wont think I just didnt have a highschool education.\n\nIf i m honest, and explain my situation im worried colleges will think i wont be able to handle their curriculum etc\n\nalso what about my gpa? i mean i dont exactly have a traditional one-- i kinda just studied until i knew things by heart. Im not sure how i would even give myself homework or tests lol-- which i guess i could also lie about but y'know :/\n\nIf my plan to get recommendations from CC profs falls through what then? most colleges ive looked at (Even nearby state schools) need letters from 1 counseler, 1 english teacher, and 1 math teacher. My options are pretty limited especially since im not really allowed to leave the house (my parents have security systems, electric fences, cameras, lights that flash on etc so sneaking out is difficult (though i do have a few friends i am occasionally allowed to visit)\n\nOf course tuition is a concern, who will sign the loan? I think my brother possibly could but still I have no idea what im doing lol\n\n for now, i am mostly concerned with the application itself so any advice or ideas would really be appreciated \n\nalso sorry in advance if I'm not making sense or there's a lot of errors, i am not feeling well",
  "author": "annarasumanaraaaa",
  "created": 1637124571,
  "updated": 1637359172,
  "over_18": false,
  "upvotes": 233,
  "upvote_ratio": 0.99,
  "comments": {
    "hkydjln": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkydjln/",
      "text": "I would NOT lie. You probably won't need to lie, because you seem smart and more than that, you've pursued your education through adversity, which is something I believe colleges really like to see. \n\nI was homeschooled and applied to a community college based off of a portfolio of some of my work, an unofficial transcript, and SAT scores. You would probably be able to get into state schools and I would even think some higher level schools. I really, REALLY understand your situation because I've been there done that, although not to the extreme your parents are.\n\nAnd if you for some reason don't get accepted, you can always do cc for a semester or two and establish grades so colleges know you can handle college work. \n\nDo you say you took the SAT already? What's your total score if so?\n\nPlease feel free to DM me. I have lots of thoughts on this, I really believe you could get into a good college.",
      "author": "depressedstudent25",
      "created": 1637127222,
      "upvotes": 129,
      "replies": {
        "hkyi57e": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyi57e/",
          "text": "Thank you for the advice, it makes me feel more relaxed knowing other people understand and have been through similar situations!\n\nI haven’t taken the SAT just yet, but I plan to during the next opening (in spring I believe). I’ve taken 1/2 (it’s split into two parts for some reason) of a test similar to a GED and got a full score ((the test is required for my local CC to register for classes)) + I took the psat freshman year and while I don’t remember my exact score I believe it was pretty good. On SAT practice tests I’ve been getting 1500+ so I’m hoping to be able to score similarly on the actual test.",
          "author": "annarasumanaraaaa",
          "created": 1637130133,
          "upvotes": 27,
          "replies": {}
        }
      }
    },
    "hkyd35q": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyd35q/",
      "text": "You are very brave. I'm not the best one to answer these questions, but I think explaining your adversities and your struggle to universities wouldn't hurt your chances. Can you take the SAT or ACT? That would help\n\nIn terms of recommendation letters and GPA, contact the admission office via email and I believe they'll find a way for you.\n\nKeep going with your study and make sure that you are well informed by reaching out, I genuinely wish you best of luck! If you need any resource studying STEM things I will be more than glad to help!",
      "author": "PostDawn",
      "created": 1637126947,
      "upvotes": 60,
      "replies": {
        "hkyj2s9": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyj2s9/",
          "text": "I do plan on taking the SAT this spring and am hoping to do well (I’ve been studying and scoring pretty good on practice tests)\n\nI didn’t think about reaching out to admissions officers, thank you so much!",
          "author": "annarasumanaraaaa",
          "created": 1637130766,
          "upvotes": 11,
          "replies": {
            "hkzd2h7": {
              "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzd2h7/",
              "text": "That's great. Keep on fighting",
              "author": "Theone21_",
              "created": 1637153583,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkyl7n5": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyl7n5/",
      "text": "I also don’t recommend lying. \n\nLike another comment suggested, I also would email admissions to ask about how to deal with your unconventional education for application purposes. Being self taught makes you harder to assess, but a solid SAT can mitigate that. How did you do on APs? While self-study probably doesn’t add much to most kids’ apps, it does for yours since it will also be another assessment point. Also, if you sign up for “dual enrollment,” you might want to ask how that will be considered. If you have a GED type of test, you might get classified as a college student & might have to apply as a transfer student (which will have different requirements). It probably is an easier path to go CC to a 4 year (you can actually get LORs), but there may be schools you’ve overlooked that don’t need LORs.\n\nWhat would also be extremely helpful is to have your living situation documented. Your parents are very extreme, and if you can document that, you might be able to be considered as an independent for financial purposes/FAFSA (and depending on when you turn 18, consider getting emancipated), which would mean you might qualify for more financial aid. It’s rare that I think a kid has a shot at being classified as independent, but you’re an exception.\n\nIf your SAT practice tests scores hold up, you may have a shot at some competitive schools, the type that meet need based aid. You’re obviously a self-starter & determined to accomplish as much as you have on your own, and I suspect there may be unconventional paths for you for admission.\n\nETA you don’t have to be emancipated to be considered independent the FAFSA, but it could make life easier. Also, getting your living situation documented sooner vs later (emancipated or not) will help with financial aid so much & I’d urge you to start on that asap.",
      "author": "pixelatedpix",
      "created": 1637132258,
      "upvotes": 23,
      "replies": {
        "hkzpxfa": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzpxfa/",
          "text": "This is the same advice I was going to give. I’ll add that the sooner you can get your GED and enroll in community college classes, the sooner you can use the cc resources to help you apply to a 4 year school. And reach out to your state’s flagship university admissions office now and ask them for advice. They may be able to guide you into being accepted there.",
          "author": "SpacerCat",
          "created": 1637160064,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hkyq84c": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyq84c/",
      "text": "I know this is not the exact situation you are in and I have little advice, but my grandmother was Mennonite and had to hide in the same way, doing homework under her covers at night etc. she managed to start at a lower tier university with a very good scholarship and finished with a bachelors degree, then went back for her Ph.D in Chemistry a couple years later. Started from nothing and made a life for herself. Good luck!",
      "author": "anon8403",
      "created": 1637136101,
      "upvotes": 18,
      "replies": {}
    },
    "hkz4wt4": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkz4wt4/",
      "text": "I really respect your will to educate yourself despite all these challenges, it's inspiring!\n\nI would not lie, I think colleges would probably see through it anyway, and moreover, your actual story is a great one to share. Anecdotes like hiding and doing calculus in the crawl space are amazing ones, you can probably mention it in your essays also\n\n&#x200B;\n\nBest of luck! I hope things come together for you :)",
      "author": "brown_hash_brown",
      "created": 1637148278,
      "upvotes": 11,
      "replies": {}
    },
    "hkyfte3": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyfte3/",
      "text": "Your story reminds me of the book \"Uneducated\" by Tara Westover. She had a very similar situation (even more extreme perhaps) and managed to go to college. I believe she's a college professor now actually. If you get a chance to read this book (or listen to the audiobook), it might provide some inspiration!\n\nThere is a path forward for you, especially because you seem very bright and detemined! Write to the admissions officers of the schools you are interested in, and I'm sure they can be of assistance.",
      "author": "Barbarella76",
      "created": 1637128614,
      "upvotes": 14,
      "replies": {
        "hkyhhhd": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyhhhd/",
          "text": "Yup, OP mentions in her post reading Westover's book and looking to it for guidance.",
          "author": "junyl_yangide",
          "created": 1637129698,
          "upvotes": 28,
          "replies": {
            "hkz30ai": {
              "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkz30ai/",
              "text": "Oops! Didn't see that! Thanks!",
              "author": "Barbarella76",
              "created": 1637146797,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkz0fr9": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkz0fr9/",
      "text": "Colleges are going to love your story of doing calc in the crawl space etc. don’t hide it, because this would be an absolutely baller essay.",
      "author": "ihpx",
      "created": 1637144690,
      "upvotes": 13,
      "replies": {}
    },
    "hkyu2h7": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyu2h7/",
      "text": "Your college essay is about to go crazy holy shit",
      "author": "tihsir",
      "created": 1637139287,
      "upvotes": 18,
      "replies": {}
    },
    "hkzg2gw": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzg2gw/",
      "text": "I don't have much to add to this but I just want to give you all my support. HUGE kudos for your incredible efforts to make a path for yourself, but I'm so so sorry you had to go through these struggles. You're bound to do incredible things. Good luck, and I'm sure everyone here is cheering for you!",
      "author": "dominaxe",
      "created": 1637155268,
      "upvotes": 5,
      "replies": {}
    },
    "hkzbv4m": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzbv4m/",
      "text": "I think you should try to call 911 and get out of your situation. I am sure you would be removed from your home. It is abuse. If you want you may DM me. If you are concerned about the local police you may need to contact the state attorney general or child welfare services in your state. You do not indicate the state you are in.",
      "author": "bergenplace189",
      "created": 1637152886,
      "upvotes": 3,
      "replies": {}
    },
    "hl03oro": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hl03oro/",
      "text": "Honestly reading this made me guilt trip every single penny my parents have spent on my education. Man was secretly practising calculus I would secretly bunk my math tutions lmao . It’s crazy how someone on the other side of the globe could litreally make use of even 5percnet of what we have  and still outrun us by miles. Alright a great reality check. And sorry I don’t have any advice. But u got to know that ur one hell of a lad. And hope things work out for you man. Really manifesting and I’m sure the sub agrees",
      "author": "Competitive_Yam_3689",
      "created": 1637165785,
      "upvotes": 3,
      "replies": {}
    },
    "hkzaxc9": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzaxc9/",
      "text": "i liked ur efforts to study, bud ! 👍 betcha will get into some nice college and do smth great, cos the adversities uv gone thru, are just very seemingly odd yet difficult ones. best of luck again !! :)",
      "author": "Lumpy_Rough216",
      "created": 1637152330,
      "upvotes": 2,
      "replies": {}
    },
    "hkzy3m8": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzy3m8/",
      "text": "What your parents are doing is called educational neglect. While they may not have to register their homeschool plan with their county or state, no education is not legal.\n\nEducational neglect is a form of child neglect or child abuse depending on the state. \n\n[Here] (https://responsiblehomeschooling.org/research/current-policy/educational-neglect-statutes/) is a list of state laws regarding educational neglect. Find your state and see what it says. \n\nYou need to call CPS. No child should under any circumstances be subject to abuse or neglect. \n\nYou deserve a proper education like everyone else.",
      "author": "Outherepoor",
      "created": 1637163529,
      "upvotes": 2,
      "replies": {}
    },
    "hkz78lw": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkz78lw/",
      "text": "u/admissionsmom would love to see your insight!!",
      "author": "mintyquaintchair2",
      "created": 1637149943,
      "upvotes": 3,
      "replies": {
        "hkznxaz": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkznxaz/",
          "text": "Have you considered reaching out to\nTara Westover with your story? I wonder if she might have some resources to help you. \n\nMy best advice is to take the GED, enroll in community college classes, ace them, prove you can do the work, and then transfer to a university. \n\nOr find a 4 year university where you can use your ged score for entry. \n\nAlso if you’re under 18 you might want to look into what it takes to become an emancipated minor so you can move forward with financial aid without having to have your parents help. And child and social welfare should also be able to give you some resources. \n\nClearly you’re capable of doing the work and getting an education. Good for you for moving forward! You can do this but it’s going to be bumpy. Doesn’t mean impossible. \n\nTake care. Reach out if you have specific college admissions issues if it looks like you can move in that direction",
          "author": "admissionsmom",
          "created": 1637159155,
          "upvotes": 8,
          "replies": {
            "hkzvu3m": {
              "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzvu3m/",
              "text": "u/annarasumanaraaaa\n\nthank you!!",
              "author": "mintyquaintchair2",
              "created": 1637162602,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hkznnr4": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkznnr4/",
      "text": "You got some good answers here already, but here are my 2 cents.\n\nYour chances of going to a 4 year directly is very low, especially since you did not have a proper education. If you lie on the application, they will find out and you will be blacklisted from most, if not all 4 year universities. And even if you were able to get into a  4 year, that 4 year should have a good program for your major/field of interest. \n\nAnother thing to consider is your financial situation right now, and what your financial situation will be in the next 4-6 years. \n\nIf I were you I would leave your parents house with the help of someone you can trust. And never look back, I and my friends have suffered by QAnon followers, and it is in your best interest if you don't meet with them until their view's change, if they change. \n\nCheck out r/QAnonCasualties \n\nFrom the options that I know people have after high school, \n\nyou could enroll in a CC (most don't need you to have a GED or high school diploma before applying). And then get your GED+choose a college that you could see your self transferring to, and take the necessary credits to transfer and be an eligible candidate. \n\nMy guess is that will at least take you 2-3 years, and when you transfer to a 4 year university it will take you 2ish years to graduate with your degree. \n\nBe prepared to get a part-time job while you are in CC and in college. Sure you can co-sign a loan, but that will only cover your tuition, you will need a place to live, an allowance, transportation, a cell phone, etc. \n\nIf I were you I would move to a city that is not too expensive to live in, New York and Chicago are not your ideal cities right now since your goal should be to save money. \n\nYou are very brave for posting this, I can't even comprehend what you have been through, it must have been a living hell. Study hard, and prove your parents wrong",
      "author": "Unfair-Homework9276",
      "created": 1637159031,
      "upvotes": 2,
      "replies": {}
    },
    "hkyd39g": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkyd39g/",
      "text": "Depending on the school, you could probably get away with no GPA assuming your SAT’s prove you know what you’re doing. Since you can post here I’m assuming you can at least email various teachers in your state and that’s a good place to start. Talk to them. And lie on your college application, everyone does. In terms of loans, hope your brother can help but there’s financial advisors at every college that can help with that",
      "author": "hiesendinger",
      "created": 1637126949,
      "upvotes": 2,
      "replies": {
        "hkzdrj1": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzdrj1/",
          "text": "\\>And lie on your college application, everyone does. \n\nThis is terrible advice. Do not do this.\n\nThe rest of this advice is fine, but do not lie.",
          "author": "A2CSimp69420",
          "created": 1637153981,
          "upvotes": 9,
          "replies": {}
        },
        "hkzq4gq": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzq4gq/",
          "text": "Do not lie. This is terrible advice.",
          "author": "SpacerCat",
          "created": 1637160151,
          "upvotes": 5,
          "replies": {}
        },
        "hl08akx": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hl08akx/",
          "text": "How have more people not down voted this.  Lie on your application, really, that's garbage advice.",
          "author": "ZeldaLegend3",
          "created": 1637167610,
          "upvotes": 3,
          "replies": {}
        },
        "hl0hbn8": {
          "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hl0hbn8/",
          "text": "Why would you advise them to lie in the app? If colleges find out OP would be blacklisted and then really have no chance at a school. \n\n\nI sure hope you didn’t lie on your app",
          "author": "Possible_Hokie_CO26",
          "created": 1637171118,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkziyic": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkziyic/",
      "text": "I don't know how to get around the GPA thing other than explaining your situation, but there are schools (mostly big public schools) that don't require LORs for admission. What state are you in (if you're okay with sharing)? Your public school options might be your best bet for finding a school that will work with your situation with a relatively low tuition.",
      "author": "Admiralsky",
      "created": 1637156782,
      "upvotes": 1,
      "replies": {}
    },
    "hkzswo9": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hkzswo9/",
      "text": "If you are doing dual enrollment, you can definitely use your professors and counselor from the CC for your letters. Also, the CC should have a “transfer” office where you can ask for help with apps. Good luck.",
      "author": "Perplexed-Owl",
      "created": 1637161364,
      "upvotes": 1,
      "replies": {}
    },
    "hl0v2ju": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hl0v2ju/",
      "text": "A lot of these comments are spot on. If you do reach out to schools, see if they have someone dedicated to “first gen” and/or “homeschool applicants”. While you might not be a traditional first gen applicant, your family is not supportive of your goals and you probably have a lot of the same questions as students that are first gen. \n\nOne other thing is that admissions officers might be considered mandated reporters in your state. If you are being abused by state definitions, they are mandated to report it to the authorities. Just wanted to give you a heads up if you reach out to them.\n\nWishing you the best OP. This community is here for you!",
      "author": "the-wild-rumpus-star",
      "created": 1637176493,
      "upvotes": 1,
      "replies": {}
    },
    "hl0xw64": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hl0xw64/",
      "text": "I know other people have already said this, but I don't think you should lie in your essay.  In fact telling the truth will definitely increase your chance of admission, not many other people can say they were banging out integrals in the middle of the night to avoid the tyrannies of QAnon.\n\nI'm not sure how many CC credits you have currently but I'm not sure it's the best idea to jump into a 4 year University. If I were you I would take a gap year or attend a CC for a year after leaving your parents. Traversing through the college admissions process with basically no actual schooling would be pretty hard so I would take a year to figure things out.  But if you think you're ready to go to a University I guess it's up to you to decide what the best path is.\n\nThis is a crazy and disturbing story that would work for a great application essay.  I hope your situation improves, good luck in the future.",
      "author": "ZeldaLegend3",
      "created": 1637177621,
      "upvotes": 1,
      "replies": {}
    },
    "hl12rct": {
      "link": "/r/ApplyingToCollege/comments/qvrbdj/i_wasnt_allowed_to_attend_school_but_i_really/hl12rct/",
      "text": "No real advice but wishing you the best! It really fucking sucks your parents put you into this situation. However you're clearly more than capable of handling college and making an incredible life for yourself.",
      "author": "ummsoanywayss",
      "created": 1637179545,
      "upvotes": 1,
      "replies": {}
    }
  }
}