{
  "sid": "qe9fsu",
  "link": "/r/ApplyingToCollege/comments/qe9fsu/should_i_submit_all_my_sat_scores/",
  "title:": "Should I submit all my SAT scores?",
  "text": "I got a 1600 on my SAT when I took it in November of my Sophomore year. I had to take the test again my Junior year because our PSAT was cancelled and my score was out of the date window to submit to NMSC for an alternate entry score. I got a 1550 (still a great score but ofc not as good as a 1600). Should I use the SAT score choice option to not submit the 1550 and only submit the 1600? I'm worried if I don't the colleges will worry about why I did worse the second time (I just didn't study as much!)",
  "author": "noah8597",
  "created": 1635010467,
  "updated": 1635183409,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhrgf1q": {
      "link": "/r/ApplyingToCollege/comments/qe9fsu/should_i_submit_all_my_sat_scores/hhrgf1q/",
      "text": "It doesn't matter if colleges see the 1550. But, if you do not submit the 1550, how would colleges know it exists?\n\nPSA, check each of your colleges' websites to see what score reporting methods they accept. Many colleges now accept scores self-reported in the app (or portal), for free, to be followed by an official report only if you later enroll - Common App only includes room to enter your highest section scores. Other colleges still require official score reports sent directly from the testing agency prior to admission, for which you would use Score Choice.",
      "author": "elkrange",
      "created": 1635010771,
      "upvotes": 2,
      "replies": {
        "hhrgomo": {
          "link": "/r/ApplyingToCollege/comments/qe9fsu/should_i_submit_all_my_sat_scores/hhrgomo/",
          "text": "Yeah I've checked and only 4 of my colleges require score reporting, and only 1 requires all scores to be reported. Do you think that 1 college will care that I did worse my second time?",
          "author": "noah8597",
          "created": 1635010888,
          "upvotes": 2,
          "replies": {
            "hhrhsnc": {
              "link": "/r/ApplyingToCollege/comments/qe9fsu/should_i_submit_all_my_sat_scores/hhrhsnc/",
              "text": "You are applying to CMU or Georgetown? Those are the only two requiring all scores this year.\n\nNo college will care that you scored 1550 after scoring 1600. They aren't even going to notice the date.",
              "author": "elkrange",
              "created": 1635011384,
              "upvotes": 2,
              "replies": {
                "hhrhyp2": {
                  "link": "/r/ApplyingToCollege/comments/qe9fsu/should_i_submit_all_my_sat_scores/hhrhyp2/",
                  "text": "My state school (UMD) requires all scores for some ridiculous reason. And the other schools \"encourage reporting of all scores\" so you think I should just send all scores?",
                  "author": "noah8597",
                  "created": 1635011460,
                  "upvotes": 2,
                  "replies": {
                    "hhri5xi": {
                      "link": "/r/ApplyingToCollege/comments/qe9fsu/should_i_submit_all_my_sat_scores/hhri5xi/",
                      "text": "\"Encourage\" is not require.\n\nUMD does not require all scores.\n\n(We are splitting hairs in that no college will think less of you for having a 1550. Just being clear for the benefit of others.)",
                      "author": "elkrange",
                      "created": 1635011550,
                      "upvotes": 1,
                      "replies": {
                        "hhrj8xt": {
                          "link": "/r/ApplyingToCollege/comments/qe9fsu/should_i_submit_all_my_sat_scores/hhrj8xt/",
                          "text": "When I go to select scores it says \"University of Maryland: College Park requires that all SAT scores are submitted for review.\" Is there a different source which suggests otherwise?\n\nEdit: saw your edit, I won't worry about it then - thanks!!",
                          "author": "noah8597",
                          "created": 1635012049,
                          "upvotes": 1,
                          "replies": {
                            "hhrjqy8": {
                              "link": "/r/ApplyingToCollege/comments/qe9fsu/should_i_submit_all_my_sat_scores/hhrjqy8/",
                              "text": "College Board's list of colleges' score reporting requirements is (very) outdated. UMD does not require all scores. (You do not need to follow what College Board says for score reporting; UMD is the authority on what UMD requires.)",
                              "author": "elkrange",
                              "created": 1635012274,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}