{
  "sid": "qcvwp2",
  "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/",
  "title:": "When looking at colleges, find one that have locations on campus where you can scream in private",
  "text": "Imo, it’s an underrated factor of a college campus. I only found out about it when browsing various school subreddits (including mine), and there are tons of threads asking where to scream on campus, so doing my job to prepare all incoming freshman for this. That’s all.",
  "author": "SkyPesos",
  "created": 1634834502,
  "updated": 1636168323,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 1.0,
  "comments": {
    "hhinlw4": {
      "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhinlw4/",
      "text": "I remember hearing about schools with traditions where students scream collectively during finals season",
      "author": "abenn_",
      "created": 1634838963,
      "upvotes": 7,
      "replies": {}
    },
    "hhivxu7": {
      "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhivxu7/",
      "text": "I got you.\n\nLittle known fact: almost every college has secret private bathrooms, and they're perfect for private screaming/crying/whatever else you need privacy for. Spend some time first semester looking for them and *don't share the info with anyone else*. It might be a lobby, office building, administrative building, visitors' center, library, retail/dining, sports facility etc. Many colleges have offices dedicated to various programs/academic centers/organizations that will have shockingly nice private bathrooms. Go beyond the main entrances - check basements, top floors, rear entrances, etc. Aim to find 3-4 that you can stash in your arsenal for when you need them. I know a guy who literally never pooped in his dorm bathroom.\n\nAnother critical thing to check - most colleges have several different housing options. If you don't live in a massive dorm, you might have a private or semi-private bathroom. A lot of honors college housing and \"living/learning communities\" have different setups that include a bathroom for every 1-2 bedrooms.\n\nHere's a comment from NoxiousQuadrumvirate along these same lines:\n\nFollow the age-old advice that is passed down through the years (if it wasn't clear enough, this is old advice that you can find on reddit, but good luck finding the original!):\n\nFind the nice bathroom on campus. There are quite a few, but they're hidden and rarely talked about, precisely because people want to \"protect\" them.\n\nDon't look in the nicest, newest buildings; these do have nice bathrooms but everyone knows it. Don't go to the oldest, most rundown buildings because the facilities are about as bad as you're imagining. Look for something in-between, probably 90's era, maybe 80's. Take the ~60th percentile for your own university.\n\nAvoid areas with high student traffic. These are places like refectories, multiple lecture halls in a single area, near student clubs, the library, or other popular hangout spots. If there are bathrooms in that area then everyone knows about them, which is what you're trying to avoid.\n\nThe best locations will be near more office-like areas. Around purely research areas or administrative sections, there are often single-stall, gender-neutral, and/or handicapped bathrooms that are not used by large numbers of people precisely because they're somewhat out-of-the-way. These places aren't thoroughfares and have no buildings/amenities/services of interest to 99% of the student body so there's no reason for people to walk through.\n\nIf you get the option to pick a dorm room, bear in mind that the rooms which are farthest away from everything/everyone else may have their own smaller bathroom. My own hall did this. There was a large communal bathroom in the centre that most people used, but since my room was in a smaller annex, we had our own private bathroom to share between 3. Again, you're looking for areas with few people that are far away from busy thoroughfares. Everyone needs to pee, so there have to be bathrooms around for everyone.\n\nIf you find one of these mythical bathrooms, never tell anyone where it is. Tell one person and everyone will know, and then you'll have to find a new one. It'd probably be further out of your way too.\n\nBasically, look for floors and hallways without many, if any, people. If you feel uncomfortable and as though you're somewhere you're not supposed to be, then you're on the right track. If an area is out-of-bounds to you then there'll be a locked door or a clear sign or someone will politely ask you if you're lost (you can lie and say yes if you like). It's not like you'll accidentally wander in the CSL or anything; you won't get into trouble just for walking around. If you find a single stall but it isn't for your gender, check the next floor up/down as sometimes they'll alternate.\n\nSee more discussion of this here:  https://www.reddit.com/r/ApplyingToCollege/comments/9lvur5/holy_shit_i_just_realized_my_worst_fear_of_going/?limit=500",
      "author": "ScholarGrade",
      "created": 1634842338,
      "upvotes": 4,
      "replies": {
        "hhknzhx": {
          "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhknzhx/",
          "text": "This dude writes better essays about college bathrooms than I can write about myself",
          "author": "DogGrinder",
          "created": 1634870841,
          "upvotes": 12,
          "replies": {
            "hhkp773": {
              "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhkp773/",
              "text": "Lol, thanks man.",
              "author": "ScholarGrade",
              "created": 1634871442,
              "upvotes": 7,
              "replies": {}
            },
            "hhkrt4n": {
              "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhkrt4n/",
              "text": "Yea that was written... Extremely well",
              "author": "NarutoDragon732",
              "created": 1634872759,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hhijhay": {
      "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhijhay/",
      "text": "So which ones have good screaming spots in your experience?",
      "author": "hopefuleli",
      "created": 1634837292,
      "upvotes": 2,
      "replies": {
        "hhiyujx": {
          "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhiyujx/",
          "text": "At my school, second floor of the Engineering library in the large “quiet study” room.\n\nBesides that, any large lecture hall would work too, or the unisex restroom in the Electrical Engineering building basement.",
          "author": "SkyPesos",
          "created": 1634843532,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhipzfz": {
      "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhipzfz/",
      "text": "EDIT: Ignore the “in private” in the title. It’s obviously better to scream with many people around you.",
      "author": "SkyPesos",
      "created": 1634839938,
      "upvotes": 1,
      "replies": {}
    },
    "hhjngpa": {
      "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhjngpa/",
      "text": "Soundproof music practice booths. Unleash a profanity laced tirade punctuated by a scream with complete confidence. There was one across the hall from where I studied. I used it when I found out I approved a time change for a two hour final exam to a time where I already had a two hour final exam scheduled. The night before the exam. Yes I took both. Yes I ran from one to the other. Yes the booth worked.",
      "author": "ChampionshipPerfect5",
      "created": 1634853693,
      "upvotes": 3,
      "replies": {}
    },
    "hhjhic1": {
      "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhjhic1/",
      "text": "I also saw the UChicago thread",
      "author": "CollegeWithMattie",
      "created": 1634851104,
      "upvotes": 3,
      "replies": {
        "hhl0eo9": {
          "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhl0eo9/",
          "text": "I found this topic on my school's (Purdue) subreddit first. Then saw that it got recommended to another student for being on the NC State subreddit. Then, I did a Google search of \"places to scream on campus\", and the first search results came from the UIUC, GATech and UT Austin subs, which is how I came to the conclusion that this is a common question for an average college experience, and prospective students should take note.",
          "author": "SkyPesos",
          "created": 1634877681,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhlk4z8": {
      "link": "/r/ApplyingToCollege/comments/qcvwp2/when_looking_at_colleges_find_one_that_have/hhlk4z8/",
      "text": "Basement classrooms with no windows . Some colleges also have scream events that you could participate in",
      "author": "ivybrothers",
      "created": 1634893376,
      "upvotes": 1,
      "replies": {}
    }
  }
}