{
  "sid": "r6yywd",
  "link": "/r/ApplyingToCollege/comments/r6yywd/who_else_feels_behind/",
  "title:": "Who else feels behind",
  "text": "Literally so many other seniors I know have gotten a million college acceptances already and some have even committed. Meanwhile I’m over here with my one acceptance feeling bad because I only got into my safety so far. I know it’s my fault for only applying to one rolling admission college (lol) but I still feel behind. \n\nThe worst part is I’ve always been the one looking forward to college and saying I can’t wait to go.\n\nAlso, I applied to Penn State EA and still haven’t gotten my decision yet while I see so many people on here have 💀💀. \n\nI hope I’m not the only one feeling this way.",
  "author": "artemis-meowl",
  "created": 1638419970,
  "updated": 1638478065,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.7,
  "comments": {
    "hmwap7y": {
      "link": "/r/ApplyingToCollege/comments/r6yywd/who_else_feels_behind/hmwap7y/",
      "text": "There are lots of kids who haven’t even gotten started yet! You’re good — but if you want to add on some rolling colleges you should.  You’ll hear back quickly from the Iowa’s, Arizona’s, and KSU!",
      "author": "admissionsmom",
      "created": 1638422005,
      "upvotes": 2,
      "replies": {}
    },
    "hmx2nze": {
      "link": "/r/ApplyingToCollege/comments/r6yywd/who_else_feels_behind/hmx2nze/",
      "text": "I recommended that my kids apply to a few rolling admissions schools to alleviate some stress.  We’ve had good luck with Minnesota, Penn State, Pitt, Rutgers, Arizona, and Delaware, among others.  It’s not too late to dash one off, thanks to the CA…",
      "author": "HappyCava",
      "created": 1638442907,
      "upvotes": 1,
      "replies": {
        "hmxql5m": {
          "link": "/r/ApplyingToCollege/comments/r6yywd/who_else_feels_behind/hmxql5m/",
          "text": "Ouch. Rubbing in the Penn State.",
          "author": "BuffsBourbon",
          "created": 1638456642,
          "upvotes": 1,
          "replies": {
            "hmxrsyy": {
              "link": "/r/ApplyingToCollege/comments/r6yywd/who_else_feels_behind/hmxrsyy/",
              "text": "Crud.  Didn’t mean to do that.  Apologies, Artemis.  Fingers crossed for you!",
              "author": "HappyCava",
              "created": 1638457163,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmxqw2c": {
      "link": "/r/ApplyingToCollege/comments/r6yywd/who_else_feels_behind/hmxqw2c/",
      "text": "Not sure if you’ve read most of the posts on here today, but it’s kids freaking out because they waited until 11:59 last night to hit “submit” and aren’t sure if the app even went through. Pretty sure you’re at/above avg on timeline if you’ve already submitted.",
      "author": "BuffsBourbon",
      "created": 1638456770,
      "upvotes": 1,
      "replies": {}
    }
  }
}