{
  "sid": "qztcwe",
  "link": "/r/ApplyingToCollege/comments/qztcwe/school_profile_for_international_students/",
  "title:": "School Profile for International Students",
  "text": "Hi, I am the first one who apply to US universities in my school. And my school doesn't have a school form.  Can me and principal create one? If so, how?",
  "author": "che__00",
  "created": 1637608858,
  "updated": 1637687335,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlp1lps": {
      "link": "/r/ApplyingToCollege/comments/qztcwe/school_profile_for_international_students/hlp1lps/",
      "text": "Your principal and you can create one. Copy pasting my old comment from a couple of days ago from a similar post:\n\n1. Hopefully, you're not the only one applying to US colleges from your school. If you aren't, gather them together and explain the situation. More people means you're able to make this school profile faster and efficiently. If you're the only one applying, it's still feasible but it's going to take a lot of time and effort\n2. Check out this: https://www.nacacnet.org/knowledge-center/school-profiles/best-practices-for-developing-a-school-profile/ This is literally THE bible for developing a school profile. Take a look at the guide and write down every criteria and information that you need to ask from your school.\n3. Type the info you need in an organized Google Docs. If you know how to use Headings and Table of Contents on gdocs, use that to make it more organized and outlined.\n4. There are probably things you and your friends already know about your school or are easily searchable, like websites or names of school heads, address, etc. Start filling that out.\n5. For the stuff you don't know, such as enrolement data or average grades, message your counselor asap. This is where it's nice to have multiple people working, because you can divide who asks what. If there's no data for specific things like SAT or ACT, it's fine—just leave it blank, but ideally you would have some way to contextualize your school's rigor. Make sure your counselor knows about what you're doing and approves the help.\n6. Once you have all the data, it's time to layout the school profile. If you or your friend knows how to layout using Microsoft Publisher or Adobe InDesign, great! If you don't, then Canva is a good alternative. Remember, 2-3 pages maximum. Also, look at the school profiles of top high schools in the US or international schools in your country. They're usually available in the internet. Fave example is Phillips Exeter Academy—very sleek and aesthetically pleasing.\n7. Once layout is done, send it over to your counselors for checking. If it's all good, congratulations your school has a competent school profile!!\n\nSource: literally had to do this myself too lol. You got this!! If you need any more help, feel free to reach out to me and I'll do my best to help out :)",
      "author": "dominaxe",
      "created": 1637620055,
      "upvotes": 2,
      "replies": {
        "hlp1mw3": {
          "link": "/r/ApplyingToCollege/comments/qztcwe/school_profile_for_international_students/hlp1mw3/",
          "text": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[The Bible](https://snewd.com/ebooks/the-king-james-bible/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
          "author": "Reddit-Book-Bot",
          "created": 1637620069,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}