{
  "sid": "qv0o7l",
  "link": "/r/ApplyingToCollege/comments/qv0o7l/alumni_interview/",
  "title:": "Alumni interview",
  "text": "Just did my interview today with a Duke Alumni. Did it mean something good? The opportunity to have an interview it's a good sing?. My Alumni and I really had a good conversation. I'm so fucking nervous. I ended the call and started crying.",
  "author": "Sarinha8080",
  "created": 1637041236,
  "updated": 1637179538,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hktlyhl": {
      "link": "/r/ApplyingToCollege/comments/qv0o7l/alumni_interview/hktlyhl/",
      "text": "You ended the call without telling the interviewer anything??? Bruh what",
      "author": "Longjumping-Owl-2684",
      "created": 1637042425,
      "upvotes": 1,
      "replies": {
        "hktzkyn": {
          "link": "/r/ApplyingToCollege/comments/qv0o7l/alumni_interview/hktzkyn/",
          "text": "What, no! I'm just saying that I'm very nervous with the results and AFTER the interview I cried a little bit. I have been put all my energy in this application. I'm from Brazil, and here nobody talks about how to get in an American University or guide the students. I did everything by myself, every research, and every decision. So after the interview i was full of emotions. The interview was good, we had a good conversation. She even said that she likes me and admire my story. I just don't how good is this or if the interview it will really count in the end.",
          "author": "Sarinha8080",
          "created": 1637052545,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hktug27": {
      "link": "/r/ApplyingToCollege/comments/qv0o7l/alumni_interview/hktug27/",
      "text": "What questions were asked.",
      "author": "Beneficial_Ad_317",
      "created": 1637048404,
      "upvotes": 1,
      "replies": {
        "hktzxoe": {
          "link": "/r/ApplyingToCollege/comments/qv0o7l/alumni_interview/hktzxoe/",
          "text": "Since I told her I'm from Brazil, she asked why did I choose to leave my country and why Duke. She also asked if i have anything to say about myself that it's not in my application. After this basics things the conversation lead us. And we talked about the pandemic in Brazil and USA. She shared with me her studies at Duke and the opportunities she got there. It was a good conversation. Oh, she also asked me if there's any program or research I'm interested in Duke. I answered everything. And in the end she said she admires my storie...and she even said that I would be a good addition to duke..... I know it might sound like good news. But there's this little voice in my head questioning everything. If the interview matters. If it's important. If I'm good enough hahahhaha",
          "author": "Sarinha8080",
          "created": 1637052838,
          "upvotes": 3,
          "replies": {
            "hku1lxx": {
              "link": "/r/ApplyingToCollege/comments/qv0o7l/alumni_interview/hku1lxx/",
              "text": "For the info session I attended with the Dean of Admissions yesterday, they emphasized that their interviews aren't selective, just a thing of alumni availability in one's geographical location whom they think you can learn from and that they can learn from applicants as well. So it's just one aspect of the application where you can talk about other things you'd want the AOs to know about you.. Even the interviews aren't a big deal cause most applicants don't even receive interview invites and will still get in...\n\nBut I'd say that if one receives an interview invite, it definitely matters since applications are reviewed holistically.. Oh and for when the interviewers have to report back to admissions office, they have to write a report which includes a rating from 1-5, 5 being the highest. So that's why I say that interviews do count as well",
              "author": "Beneficial_Ad_317",
              "created": 1637054268,
              "upvotes": 2,
              "replies": {
                "hku6swt": {
                  "link": "/r/ApplyingToCollege/comments/qv0o7l/alumni_interview/hku6swt/",
                  "text": "Got it! Thanks for the explanation. :) We have acess to our interview rating?",
                  "author": "Sarinha8080",
                  "created": 1637058734,
                  "upvotes": 1,
                  "replies": {
                    "hkukw5k": {
                      "link": "/r/ApplyingToCollege/comments/qv0o7l/alumni_interview/hkukw5k/",
                      "text": "No we don't",
                      "author": "Beneficial_Ad_317",
                      "created": 1637068310,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}