{
  "sid": "q7qpzu",
  "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/",
  "title:": "I am a high school college counselor helping students apply, ask me anything!",
  "text": "I am here on Reddit to give any advice or support I can on the college process. Ask away, I am very transparent on the realities of the college process.\n\nP.s. I  give feedback on personal statements too!!!",
  "author": "Stunning_Culture_560",
  "created": 1634179612,
  "updated": 1645843731,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hgkstx0": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkstx0/",
      "text": "Pls help! I'm not sure what my admission essay should be. The application page offered two topics about either what u hope to learn during ur college years or what factor caused u to apply to this certain college or any personal topic of my choice. Lil background, i failed out my nursing program when I had one semester left causing me to change my major and stay an extra year, I decided to try nursing again at a different college for an accelerated program. Not sure if I should write about my failure and how I still try to chase my goal or something different?",
      "author": "yessir721",
      "created": 1634187944,
      "upvotes": 2,
      "replies": {
        "hgkyptv": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkyptv/",
          "text": "Dm me, I may be able to gives you some suggestions over chat",
          "author": "Stunning_Culture_560",
          "created": 1634192274,
          "upvotes": 1,
          "replies": {
            "hglqv8e": {
              "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hglqv8e/",
              "text": "Thank u, just did",
              "author": "yessir721",
              "created": 1634214801,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgkt0dp": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkt0dp/",
      "text": "1. Do colleges really only spend a couple minutes on our application? What can we do to make our application more eye catching? \n2. Is it suspicious if we submit all of our ap scores except one? I got 4s and 5s on all my exams except APUSH, which I got a 2 on. Would it be a red flag if I didnt report that one?\n3. Does our high school demographic matter? No one at my school has ever gone to a T10 and I'm worried if that will hurt my chances.\n4. Would you be willing to review my essay?",
      "author": "EmmenRose",
      "created": 1634188069,
      "upvotes": 2,
      "replies": {
        "hgky59d": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgky59d/",
          "text": "1.\t⁠Do colleges really only spend a couple minutes on our application? What can we do to make our application more eye catching?\n\nYes, there are many applications read on a daily basis so there isn’t a significant amount of time given to every single application. My rule of thumb is put a face to the application! \n\nAttend in virtual information sessions, participate in interviews if possible. Make sure that you are taking compelling and challenging courses in your senior year. With many colleges opting to suspend the use of standardized testing its pivotal that students make their applications as human as possible.\n\n\n\n2.\t⁠Is it suspicious if we submit all of our ap scores except one? I got 4s and 5s on all my exams except APUSH, which I got a 2 on. \nWould it be a red flag if I didnt report that one?\n\nI don’t think it will draw too much attention. Many times that can worry can be alleviated if you performed exceptionally well in the actual class and possibly have a letter of recommendation from that teacher.\n\n3.\t⁠Does our high school demographic matter? No one at my school has ever gone to a T10 and I'm worried if that will hurt my chances.\n\nAll counselors provide your colleges with the high school’s school report. It’s a document that lists all the courses available at your school. The school will then compare your transcript to what is in the school report.\n\nEx: if you took 2 APs but had the opportunity to take 5\n\n4.\t⁠Would you be willing to review my essay?\n\nSend it over!",
          "author": "Stunning_Culture_560",
          "created": 1634191827,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgkgggz": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkgggz/",
      "text": "On the off chance you're legit.  :)\n\n1. As a counselor, does it irritate you when students apply to \"too many\" schools?  How many is \"too many\"?\n2. Do you happen to know how complete the data in Naviance scatter plots is?  In particular, do you know if accepted/rejected status is self-reported by students?\n3. What myths that students (and parents) believe do you most fervently want to see dispelled?\n4. What aspect of college admissions do you think students spend \"too much\" time/effort on?  What aspect(s) do they spend \\*too little\\* time/effort on?\n5. What is the most damaging \\*non-obvious\\* mistake you see students make w.r.t. admissions?\n6. What is the most beneficial \\*non-obvious\\* thing you see (some) students do w.r.t. admissions?",
      "author": "jayphoward",
      "created": 1634180744,
      "upvotes": 1,
      "replies": {
        "hgkl3lh": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkl3lh/",
          "text": "Sorry this took awhile haha!\n\n1.\t⁠As a counselor, does it irritate you when students apply to \"too many\" schools?  How many is \"too many\"?\n\nFor me I understand that students have various interests and want to cast their net on schools that check different boxes. What I like to tell students is think about which schools are within your match and fit range and have them reflect on how many supplements do you want write. Does every school have supplemental essays? No but a tell tale sign that you may not be invested as you think in a school is if a supplement as dragging you along and you’re having trouble justifying why you want to go there. \n\n\n2.\t⁠Do you happen to know how complete the data in Naviance scatter plots is?  In particular, do you know if accepted/rejected status is self-reported by students?\n\nNaviance is flawed certainly, to answer your question, accepted/rejected status is provided to counselors on a case by case basis. For many private schools, without FERPA authorization we do not have access to particular student information especially regarding acceptances. Students can indicated they were accepted as many cases colleges have refrained from telling me over the phone of a students application status due to confidentiality.\n\n3.\t⁠What myths that students (and parents) believe do you most fervently want to see dispelled?\n\nOh man this a good question! Myths that commonly hear are that  students and/or parents many times feel that community colleges can sometimes feel like a dead end. This is very much not the case. I think it’s worth looking into whether a community college you are looking at has articulation agreements. Basically a partnership between a 2 and 4 year school where you easily transition from one school to the other upon completing the two years at the community college.\n\nAnother myth is that financial aid is set and can’t be changed. Not true! Financial aid appeals very well do work if you are able to provide examples of financial aid packages from competing schools that are offering more. Additionally, if you can indicate that there have been any huge alterations to your families financial circumstances within the past year that can be cause for appealing your financial aid. \n\n4.\t⁠What aspect of college admissions do you think students spend \"too much\" time/effort on?  What aspect(s) do they spend *too little* time/effort on?\n\n\nI think many times students spend too much time thinking about the financial component of college, more so looking for scholarships and sources for grants. Of course scholarships are helpful, but as any good counselor will tell you make sure that you focus on your match and fit first then we can worry about the financial aspect after. Your Expected Family Contribution won’t change when all is accounted for so that time worrying about scholarships, though it can be effective, can be used in seeing what is your return on investment in choosing certain schools/majors. \n\nIn other words, what are some companies/organizations that typically hire from that college? What does the career center look like? Is it helpful? \n\nWhat support systems exist on campus for students? How is mental health prioritized?\n\nLooking into these factors can help students make a plan for what is available to help them reach their goals and supports that exist along the way. \n\n\n5.\t⁠What is the most damaging *non-obvious* mistake you see students make w.r.t. admissions?\n\nThe most damaging *non-obvious*  mistakes that students make with regards to admissions I’ve seen are either dropping difficult courses senior year that may otherwise have made them stand out. As a counselor I have to submit transcripts three times a year to colleges. This includes your transcript from junior year (fall of your senior year), mid year transcript and final transcript. It doesn’t help when a student is taking an AP course in the fall and that course Is no longer in their transcript in the spring. \n\nAlso,  another mistake I see is not taking advantage of interviews. Sometimes students underestimate the value that an interview has in the admissions process. With the adequate preparation and delivery, an interview can help.\n\n6.\t⁠What is the most beneficial *non-obvious* thing you see (some) students do w.r.t. admissions?\n\nThe most beneficial *non-obvious thing I’ve seen some students do with regards to admissions is sending thank you letters/emails to admissions reps that they get in contact with. Admissions reps are people too. Chances are the admissions rep for a college that visits your high school will be the one in charge of reading the applications in your region so it helps to be extra nice :).",
          "author": "Stunning_Culture_560",
          "created": 1634183229,
          "upvotes": 9,
          "replies": {
            "hgkq6q2": {
              "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkq6q2/",
              "text": "Awesome.  Thanks for replying!  Bummer about Naviance; I was hoping the scatter plot data might be somewhat more reliable. If it were complete, it would be a pretty useful resource for estimating chances.",
              "author": "jayphoward",
              "created": 1634186233,
              "upvotes": 1,
              "replies": {}
            },
            "hgl7we6": {
              "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgl7we6/",
              "text": "Agree on most of the points! Some greart advice here...5 and 6 are v important for most applicants. and agree on Naviance isnt a great tool to use - students typically spend too much time focusing on colleges vs particular majors/programs and not trying to create a decent list of schools that would be a good fit for them. this new [RP college tool](https://colleges.roundpier.com/) is actually quite good to find schools based on your interests",
              "author": "wertu1221",
              "created": 1634200180,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hgoaujf": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgoaujf/",
          "text": "Hi, I'd also like to also take a shot at some answers here... Practicing school counselor for a little under a decade at this point... Too lazy to answer all six, but your first three are very enticing!\n\n1.) As I hold senior meetings with my caseload of seniors I will generally recommend a 3 to 8 rule. I will not penalize them for applying to more but the general advice I give them during senior meetings if \"Ultimately, if you find the right fit you will only be going to one of those schools. In essence after 8 schools you have just paid X-1 schools an average of $50 to say \"Yes\" or \"No\" you can go here, even though you ultimately do not. That money may be better served going elsewhere, especially if applying to more than 10 schools. It ultimately isn't going to create more work for me however, especially if using Common App or Naviance (now that they also use the one-and-done system from Common App.)\n\n2.) Naviance's Scatterplot data is **100%** reliant on student and staff reports. The data points are not provided by schools, nor are they automatically imported. For many schools the data is generally created simply from the student saying \"Accepted,\" Rejected,\" or whatever other option. However, I have taken the liberty of hosting Instant Decision Days to more accurately know acceptances versus denials, and many counselors have access to Slate now so we can use that information to accurately input acceptance and denials on behalf of students. Access to the National Clearinghouse can also help with this though it takes a while for the Clearinghouse's information to get updated and accurate and I don't know how many people are going to go in and update a past graduating class to be accurate.\n\n3.) I think his response concerning articulation agreements would be one I agree with as well. I literally have that conversation with every senior every year from the valedictorian to the student who is just now considering college. However, one thing I will say above all else is that your student's counselor is likely much more of an expert than you are, so please do not try to question our competence. We have your student's best interest at heart whereas a college typically doesn't. If a College told you some inane August, September, or October due date you have to beat before \"all the scholarship money runs out\" they're telling you this because they need a higher potential enrollment to keep professors on staff. That is the number one reason they tell this lie! So if your student's school counselor tells you they can't make these dates because they're updating school profiles, preparing updated transcripts, or any other school policy it's because they've experienced this before and are following best practice. Odds are they've seen more in this situation (100s of kids vs your 1) so their knowledge is more vast than yours.",
          "author": "BlaqOptic",
          "created": 1634255532,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgkgjku": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkgjku/",
      "text": "U Wisconsin’s admissions website says sending transcripts directly from high school is ok but Common App makes you self report (SRAR).  How can we fix the issue?",
      "author": "slipperglass",
      "created": 1634180788,
      "upvotes": 1,
      "replies": {
        "hgklzov": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgklzov/",
          "text": "Upon reading the description on U Wisconsin’s website it appears that students have the option of self reporting on common app OR having their high schools send it electronically/post mail. If common app is requesting you to self report you can request an unofficial transcript from your counselor and they should be able to provide you a copy that lists all your courses from 9 to 12. Keep in mind that your counselor will like need to send your transcript anyways since they will need to submit the mid year and final transcript to all of your schools.",
          "author": "Stunning_Culture_560",
          "created": 1634183737,
          "upvotes": 2,
          "replies": {
            "hgob7gm": {
              "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgob7gm/",
              "text": "If doing an SRAR, the school may not require a Mid-Year, especially if the student never reports they've applied to that school. For instance, PSU and Drexel adopted the SRAR two years ago and still had independent applications and Common app options. If a student did the former, we wouldn't have to know they applied there until they accepted  and were ready to send their deposit at which point we would send their final transcript. If going through the CA, then a Mid-Year would definitely be required.",
              "author": "BlaqOptic",
              "created": 1634255700,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgkhr1q": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkhr1q/",
      "text": "Are you willing to look at my personal statement?",
      "author": "R1ceroni",
      "created": 1634181417,
      "upvotes": 1,
      "replies": {
        "hgkl6qc": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkl6qc/",
          "text": "I am! Feel free to dm me and I am happy to give feedback",
          "author": "Stunning_Culture_560",
          "created": 1634183278,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgkw0xf": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkw0xf/",
      "text": "1. Is it ok to take 2 science classes in junior year but none in senior year? Or is it better to take a science class every year? I will have a total of 4 science courses taken either way, just wasn't sure if one way looks better than the other.\n\n2. Are AP tests worthless if I don't take the class? My school has limited APs so I'm planning to self study. It doesn't matter to me if I don't get college credit, as long as it helps give my application a boost",
      "author": "daydreamingpro",
      "created": 1634190213,
      "upvotes": 1,
      "replies": {
        "hgkylkj": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkylkj/",
          "text": "1.\t⁠Is it ok to take 2 science classes in junior year but none in senior year? Or is it better to take a science class every year? I will have a total of 4 science courses taken either way, just wasn't sure if one way looks better than the other.\n\nColleges want to see that you continue to challenge yourself, even in senior year. There’s no right way to handle how you get your high school credits, with that said, you do want to make sure to take any electives that may boost your application if you can just to show you’re not taking it easy. \n\n2.\t⁠Are AP tests worthless if I don't take the class? My school has limited APs so I'm planning to self study. It doesn't matter to me if I don't get college credit, as long as it helps give my application a boost\n\nNot necessarily, if anything it looks exceptionally good. Since you mentioned your school has limited APs, the colleges will know that from your school’s school report. They will be able to se that despite not having the class available you took the test. \n\nThat would be something great to discuss in an interview :)",
          "author": "Stunning_Culture_560",
          "created": 1634192183,
          "upvotes": 2,
          "replies": {
            "hgwxlj0": {
              "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgwxlj0/",
              "text": "tysm for your reply! I have one more question if you don't mind. I'm planning to pursue art or humanities major. The APs offered at my school are pretty much STEM only, such as AP chem, bio, calculus etc. So if I want to take rigorous courses, I will have to fill my schedule with stem APs and leave no room for art and performance (I love choir and drama) courses. Is it more important to take classes that show my passion (but don't look rigorous unfortunately) or should I take the most challenging courses offered at my school? Students at my school are competitive and typically take all the available APs despite their field of interest. I'm worried that my application will look lackluster compared to theirs, esp we all apply to pretty much the same colleges lol",
              "author": "daydreamingpro",
              "created": 1634423755,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgm8fsr": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgm8fsr/",
      "text": "If some kids ur helping keeps bugging u abt adding schools to their list will u hate them",
      "author": "bearecx",
      "created": 1634223083,
      "upvotes": 1,
      "replies": {
        "hgmy5nu": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgmy5nu/",
          "text": "Haha it depends, is it the 15th or 25th school on their list? Jk\n\nOn a serious note I’d ask them a few questions just gauge their interest\n\nAre they applying because they are interested or whether it’s because that school sent them mail, their friend applied there or they saw the school on social media (tik tok/Instagram) \n\nAfter that I would want to know if that school has a supplemental essay and if the student is serious on drafting and completing ANOTHER essay. \n\nThese are things that students may not think about at the time they add it to their list but those supplements really begin to pile up and students end up overwhelmed by all the essays they need to write.",
          "author": "Stunning_Culture_560",
          "created": 1634233690,
          "upvotes": 1,
          "replies": {
            "hgozpxk": {
              "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgozpxk/",
              "text": "Okey thank u",
              "author": "bearecx",
              "created": 1634266967,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgn3vif": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgn3vif/",
      "text": "Best esssay editing service for college apps?",
      "author": "cubessssss",
      "created": 1634236070,
      "upvotes": 1,
      "replies": {}
    },
    "hgo0ott": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgo0ott/",
      "text": "Could you possibly review my app essay? could I dm u I’m looking for advice on how to improve and look more eye catching.",
      "author": "McLovens22",
      "created": 1634250828,
      "upvotes": 1,
      "replies": {
        "hgo9i4l": {
          "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgo9i4l/",
          "text": "Hey! Send it over",
          "author": "Stunning_Culture_560",
          "created": 1634254912,
          "upvotes": 1,
          "replies": {
            "hgwzn9e": {
              "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgwzn9e/",
              "text": "Sent! TY",
              "author": "McLovens22",
              "created": 1634424701,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgkgj7g": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hgkgj7g/",
      "text": "Check out r/CollegeEssays too",
      "author": "roguezebra",
      "created": 1634180782,
      "upvotes": 0,
      "replies": {}
    },
    "hrd7vtd": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/hrd7vtd/",
      "text": "I need help  with extra curricular activities",
      "author": "Important_Valuable96",
      "created": 1641398184,
      "upvotes": 1,
      "replies": {}
    },
    "ht9tk2l": {
      "link": "/r/ApplyingToCollege/comments/q7qpzu/i_am_a_high_school_college_counselor_helping/ht9tk2l/",
      "text": "from your understanding, what are colleges looking for on an application? what makes an applicant stand out in a positive light and what are they wanting students to demonstrate in their application? THANK YOU SO MUCH",
      "author": "gracef1713",
      "created": 1642563639,
      "upvotes": 1,
      "replies": {}
    }
  }
}