{
  "sid": "qx45go",
  "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/",
  "title:": "Do I have to take honors community college courses to transfer to a UC?",
  "text": "At my CC I was advised that taking 15 units of honors courses will give me a better chance at applying to the UC of my choice. Choosing between UCSD and Irvine. I wouldn't have a problem doing this, however, I would really like to finish all my major requirements by the end of this spring and transfer by fall, and I'm not seeing any room in my schedule to fit any honors courses in without petitioning for extra units and overwhelming myself.",
  "author": "cherryxbeau",
  "created": 1637282917,
  "updated": 1637353021,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hl76zd6": {
      "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl76zd6/",
      "text": "Second the other comment, for more competitive majors it could be helpful but it really matters us that you finish your pre reqs with good grades. Transferring is a whole different game than freshman apps. Colleges understand that as a transfer student you have responsibilities outside school that high schoolers don't (remember work IS an extracurricular). Definitely don't feel that you need to overwhelm yourself with honors to get in because there are plenty of people who get in and don't. I definitely reccomend getting in touch with the admissions counselors of the schools you want to apply to. They'll likely have much more targeted advice than what your CC can give.",
      "author": "TutorRealistic6649",
      "created": 1637286393,
      "upvotes": 2,
      "replies": {
        "hl77qa8": {
          "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl77qa8/",
          "text": "Honestly this made me feel a lot better, really thank you. And I didn’t know work was an extracurricular ;o; thank you for letting me know honestly",
          "author": "cherryxbeau",
          "created": 1637286738,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hl72jjv": {
      "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl72jjv/",
      "text": "It's more important to focus on your major requirements and keeping your grades up. Don't overwhelm yourself by forcing the honors courses into your schedule that's already packed.",
      "author": "PBSArthurEnthusiast",
      "created": 1637284343,
      "upvotes": 1,
      "replies": {
        "hl75uu0": {
          "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl75uu0/",
          "text": "Thank you that’s what I figured too",
          "author": "cherryxbeau",
          "created": 1637285876,
          "upvotes": 1,
          "replies": {
            "hl79iik": {
              "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl79iik/",
              "text": "You're welcome!",
              "author": "PBSArthurEnthusiast",
              "created": 1637287558,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hl84ro1": {
      "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl84ro1/",
      "text": "What major are you considering? If CS/Eng, then do everything you can do to boost your app. However, if you’re not CS/Eng, I believe UCI participates in TAG, which is a transfer guarantee program; if you complete a checklist of classes & meet a GPA requirement, you’re in. Guaranteed. UCSD doesn’t participate in TAG, so if you prefer that, again beefing up your app might help — but not at the risk of your GPA suffering a big decline because of course overload.",
      "author": "pixelatedpix",
      "created": 1637303810,
      "upvotes": 1,
      "replies": {
        "hl88xos": {
          "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl88xos/",
          "text": "Yeah I’m doing CS :/ really sucks but I’ll probably just try and apply next fall and see if I’ll get in without any honors, I do have two jobs outside of school that take up most of my time when I’m not studying, not sure if that’ll be of any help for the app",
          "author": "cherryxbeau",
          "created": 1637306729,
          "upvotes": 1,
          "replies": {
            "hl89jm5": {
              "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl89jm5/",
              "text": "If you can work 2 jobs and maintain good grades, that speaks a lot to your ability and time management. Sounds like you’re making the best decision for your situation to not do honors and take a chance; you have to sleep sometime! Hope it works out for you!",
              "author": "pixelatedpix",
              "created": 1637307174,
              "upvotes": 1,
              "replies": {
                "hl89kw8": {
                  "link": "/r/ApplyingToCollege/comments/qx45go/do_i_have_to_take_honors_community_college/hl89kw8/",
                  "text": "Thank you so much :)",
                  "author": "cherryxbeau",
                  "created": 1637307201,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}