{
  "sid": "qak0pt",
  "link": "/r/ApplyingToCollege/comments/qak0pt/is_there_a_list_of_colleges_that_accept/",
  "title:": "is there a list of colleges that accept self-reported SAT and those that don't?",
  "text": "This is a little bit messy for me. Will I have to pay for CB to send my scores to all of the schools that require official score report? How do I self-report? Isn't the testing session on common app enough? Please I need light on this.",
  "author": "lusca_palest",
  "created": 1634553309,
  "updated": 1634653570,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hh3drjp": {
      "link": "/r/ApplyingToCollege/comments/qak0pt/is_there_a_list_of_colleges_that_accept/hh3drjp/",
      "text": ">Please I need light on this.\n\nDepends on the school.\n\nMany allow self-report, some want official scores.   \n\n\nFor schools that want official reports, you’ll need to pay for each one.\n\nMany self-report schools take what you enter into common app, some want you to enter the info on their applicant portal.\n\nBest bet is to check the admissions website for any school you’re interested in, to make sure you’re getting accurate info.",
      "author": "Strict-Special3607",
      "created": 1634553782,
      "upvotes": 2,
      "replies": {}
    },
    "hh5zv6a": {
      "link": "/r/ApplyingToCollege/comments/qak0pt/is_there_a_list_of_colleges_that_accept/hh5zv6a/",
      "text": "Any list you might find is unlikely to be completely accurate.\n\nCheck the admissions websites of the schools to which you are applying for accurate data.\n\nIf official scores are required (about 1/3 of my daughter’s schools), then yes, you will need to pay to have them sent, unless you qualify for a fee waiver.\n\nNo, the self-report section on the Common App is not enough for schools that don’t accept self-reporting.",
      "author": "RichInPitt",
      "created": 1634597733,
      "upvotes": 1,
      "replies": {}
    }
  }
}