{
  "sid": "qgxk14",
  "link": "/r/ApplyingToCollege/comments/qgxk14/college_enrollment_drop_in_us_the_largest_twoyear/",
  "title:": "College enrollment drop in US the largest two-year decline in 50 years",
  "text": "# Less competition = Better chances\n\n[College enrollment drop in US the largest two-year decline in 50 years. College enrollment plummeted during the pandemic. This fall, it's even worse.](https://www.npr.org/2021/10/26/1048955023/college-enrollment-down-pandemic-economy)\n\n&#x200B;\n\n>College enrollment plummeted during the pandemic. This fall, it's even worse. The decline of 3.2% in undergraduate enrollment this fall follows a similar drop of 3.4% the previous year, the first fall of the pandemic, according to the research from the National Student Clearinghouse Research Center.  \n>  \n>The numbers are from a preliminary data set representing 8.4 million undergrad and graduate students from about 50% of U.S. colleges. The numbers show there are now 240,000 fewer undergraduates enrolled this fall compared with the same time last year, and if that rate of decline holds up for the rest of the colleges, that could translate into almost a half-million fewer undergraduate students.  \n>  \n>\"It's very frightening,\" says Doug Shapiro, who runs the nonprofit research center. \"Far from filling the hole of last year's enrollment declines, we are still digging it deeper.\"  \n>  \n>If these preliminary numbers hold up, Shapiro says the last two years of undergrad decline, totaling more than 6%, would be the largest two-year decrease in at least half a century.",
  "author": "JJKKLL10243",
  "created": 1635343831,
  "updated": 1635456263,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "hi90uki": {
      "link": "/r/ApplyingToCollege/comments/qgxk14/college_enrollment_drop_in_us_the_largest_twoyear/hi90uki/",
      "text": "How is this a shit-post?",
      "author": "BuffsBourbon",
      "created": 1635344644,
      "upvotes": 6,
      "replies": {
        "hi93e9d": {
          "link": "/r/ApplyingToCollege/comments/qgxk14/college_enrollment_drop_in_us_the_largest_twoyear/hi93e9d/",
          "text": "People who don't read the whole article would think \"Less competition = Better chances\" is the conclusion. The reality is the exact opposite. For example, Ohio State University saw record high enrollment at the main campus this year in Columbus, but their overall enrollment was down by 0.7%, according to enrollment data from the university.That’s because the satellite campuses, like the OSU Lima campus, saw declines. Notably, the Lima campus saw a decline in enrollment of 12.4% compared to fall 2020. It is more difficult to get into competitive colleges than ever before. Anyway, I've changed the flair to discussion.",
          "author": "JJKKLL10243",
          "created": 1635345719,
          "upvotes": 3,
          "replies": {
            "hi94dl7": {
              "link": "/r/ApplyingToCollege/comments/qgxk14/college_enrollment_drop_in_us_the_largest_twoyear/hi94dl7/",
              "text": "Gotcha",
              "author": "BuffsBourbon",
              "created": 1635346122,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}