{
  "sid": "ri8o1b",
  "link": "/r/ApplyingToCollege/comments/ri8o1b/make_me_hate_wharton/",
  "title:": "Make Me Hate Wharton",
  "text": "Pls",
  "author": "EffectiveYou9178",
  "created": 1639714225,
  "updated": 1639786131,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hovlu1s": {
      "link": "/r/ApplyingToCollege/comments/ri8o1b/make_me_hate_wharton/hovlu1s/",
      "text": "elitist school where everyone just cares about their linkedin page and making connections. everyone is burned out by the end of their first year and the only thing that keeps them going is being able to tell people that they’re in wharton. \n\nextremely cliquey and always feel like they’re better than every other penn student, nonstop assignments and homework, almost impossible to maintain good grades (consistently ranked in top 5 hardest schools to get an A)\n\ni’ve talked to many COOs, CFOs, and CEOs, and they’ve all told me that when interviewing college students for internships or jobs, they literally only care about what you accomplished at your college, not what college you go to. \n\nBasically Wharton is just a glorified business school that will literally teach you the same stuff as any other T-50. I’m guessing you posted this because you either got rejected or don’t want to apply there, but seriously, prioritize your mental health. You’ll succeed and meet amazing people no matter where you end up",
      "author": "alexis25101",
      "created": 1639715862,
      "upvotes": 3,
      "replies": {
        "hovn55u": {
          "link": "/r/ApplyingToCollege/comments/ri8o1b/make_me_hate_wharton/hovn55u/",
          "text": "Word go to NYU stern if u want a Wall Street feeder tho",
          "author": "Nano_illusion",
          "created": 1639716524,
          "upvotes": 1,
          "replies": {}
        },
        "hovuvcv": {
          "link": "/r/ApplyingToCollege/comments/ri8o1b/make_me_hate_wharton/hovuvcv/",
          "text": ">nonstop assignments and homework, almost impossible to maintain good grades (consistently ranked in top 5 hardest schools to get an A)\n\nAccording to current and former Wharton students this isn't true at all, and the courses are supposedly easy. I'm all for coming up with reasons to hate Wharton (got rejected there myself) but at least make the reasons accurate.",
          "author": "FuriousGeorge1435",
          "created": 1639720895,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}