{
  "sid": "ri6mc7",
  "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/",
  "title:": "How would I describe this EC?",
  "text": "(This will sound like a lowkey flex but it really isn't I just can't figure out how to word this activity for the life me)\n\nI basically did independent research at my school about bullying. I interviewed teachers/students and also created a survey which I sent to a majority of the people at my school. I presented the results to my school's administration board and principle and plan on presenting to the county school board early next year. Along with this, I'm also working with admin to implement an anti-bullying program.\n\nHow should I word this in the activities section? Thanks in advance!",
  "author": "Oceandrive-skyline",
  "created": 1639707672,
  "updated": 1639785988,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hov4ec9": {
      "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hov4ec9/",
      "text": "You just did",
      "author": "loserlake420",
      "created": 1639707909,
      "upvotes": 5,
      "replies": {}
    },
    "hov4f82": {
      "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hov4f82/",
      "text": "Also this is a very cool project good for you",
      "author": "loserlake420",
      "created": 1639707920,
      "upvotes": 2,
      "replies": {
        "hov57hr": {
          "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hov57hr/",
          "text": "thank you!",
          "author": "Oceandrive-skyline",
          "created": 1639708276,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hov4jzq": {
      "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hov4jzq/",
      "text": "I’m going to be brutally honest, so please do not take this personally. I think you have to be careful about how you present this. Surveys are not considered strong research methods, because there are many variables that could drastically impact your results (i.e. nonresponse bias). In addition, for this to be a very strong EC, you need this work to be published and have some statistics that contribute to society’s understanding of bullying. Without numbers or impact, this does not mean much. Anyone can create a survey and send it out. What you do with the research and the METRICS/IMPACT that come from it are the important thing. If you do not have this information, I’m not sure I would fill one of your activities with this, unless you have nothing else to include.",
      "author": "Tarheel4lifer24",
      "created": 1639707982,
      "upvotes": 1,
      "replies": {
        "hov56na": {
          "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hov56na/",
          "text": "Thank you. Don't worry about being blunt because I'd much rather receive this type of feedback vs. cliché, false reinforcement feedback. In response to your comment, what are ways you suggest that I can strengthen this EC?",
          "author": "Oceandrive-skyline",
          "created": 1639708265,
          "upvotes": 1,
          "replies": {
            "hov656k": {
              "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hov656k/",
              "text": "Hey, of course! I think something you could do, if the research is substantive, is bring it to a university. I’m not sure where you live, but most big cities have a research university. You could present this information to maybe the psych or education department and see if they pick it up? Another alternative is that you could provide this information and see if a professor would take you on for research. It is difficult to get involved in university research in high school, so it would take the research to a higher level.",
              "author": "Tarheel4lifer24",
              "created": 1639708699,
              "upvotes": 1,
              "replies": {
                "hov7ae6": {
                  "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hov7ae6/",
                  "text": "Got it. Do you think presenting to my county's board can be considered substantial?",
                  "author": "Oceandrive-skyline",
                  "created": 1639709202,
                  "upvotes": 1,
                  "replies": {
                    "hov7zpb": {
                      "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hov7zpb/",
                      "text": "Again, I think it all depends on the impact. Presenting it to the board and not getting any actions from it, and subsequently metrics on its impact, renders the presentation unimportant in the eyes of top schools.",
                      "author": "Tarheel4lifer24",
                      "created": 1639709506,
                      "upvotes": 1,
                      "replies": {
                        "hoxoq9f": {
                          "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxoq9f/",
                          "text": "Look as someone who’s been interviewed by the New York Times and had work published in national news articles I promise that something doesn’t have to be published to be meaningful😭. Activism isn’t just about getting published and all my organizer friends get into ivies based on the community organizing work they’ve done",
                          "author": "loserlake420",
                          "created": 1639758729,
                          "upvotes": 1,
                          "replies": {
                            "hoxpwum": {
                              "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxpwum/",
                              "text": "Nobody said that? Taking a survey, presenting it, and making nothing from it does nothing.",
                              "author": "Tarheel4lifer24",
                              "created": 1639759180,
                              "upvotes": 1,
                              "replies": {
                                "hoxqrlz": {
                                  "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxqrlz/",
                                  "text": "With that logic all activism does nothing since it’s not instantly fixing climate change and wealth inequality",
                                  "author": "loserlake420",
                                  "created": 1639759499,
                                  "upvotes": 1,
                                  "replies": {
                                    "hoxrarg": {
                                      "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxrarg/",
                                      "text": "Um, again, not true. If you actually read my point, surveys are not considered strong sources of research and data. The OP also asked for my opinion on their EC. Also, yes, you’re correct in that pulling data and research is pointless without action. Whether or not the action is successful is not important in whether the action is important. Colleges, and society, want to see people try and create change.",
                                      "author": "Tarheel4lifer24",
                                      "created": 1639759700,
                                      "upvotes": 1,
                                      "replies": {
                                        "hoxwirl": {
                                          "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxwirl/",
                                          "text": "Op literally said they’re implementing an anti bullying program",
                                          "author": "loserlake420",
                                          "created": 1639761672,
                                          "upvotes": 1,
                                          "replies": {
                                            "hoxzwbc": {
                                              "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxzwbc/",
                                              "text": "Working to is not the same as has, and the OP’s statement of “working on” is extremely broad and could mean that it hasn’t even started",
                                              "author": "Tarheel4lifer24",
                                              "created": 1639762970,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hoxp2ik": {
                          "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxp2ik/",
                          "text": "If a kid helps turn out 2000 voters for an election and the candidate loses by 1 vote you think that would be rendered useless? It’s reductionist to act like all activists have to win their campaigns to be making an impact",
                          "author": "loserlake420",
                          "created": 1639758859,
                          "upvotes": 1,
                          "replies": {
                            "hoxqwxc": {
                              "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxqwxc/",
                              "text": "I love how a high school junior is talking about college admissions. Your opinion is valuable, but you have never even gone through the process. Also, that’s not what I said. Metrics can come from situations even where it’s not something of huge magnitude. Fundamentally, though, a survey is not impressive. Your comparison to a campaign is also ridiculous. Working on a campaign, regardless of winning or losing, is direct experience in grassroots lobbying. You can absolutely pull metrics from that. “I interacted with 7000+ voters” is a statement that could come from either a win or a loss and is substantive.",
                              "author": "Tarheel4lifer24",
                              "created": 1639759554,
                              "upvotes": 1,
                              "replies": {
                                "hoxw5h0": {
                                  "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxw5h0/",
                                  "text": "I dont need to be in college to know exactly what all my friends at top schools did to get in?",
                                  "author": "loserlake420",
                                  "created": 1639761532,
                                  "upvotes": 1,
                                  "replies": {
                                    "hoy00wg": {
                                      "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoy00wg/",
                                      "text": "But your friends don’t know either? You can make an educated guess, but you’re arguing just to argue. The OP asked for my opinion, and I shared it.",
                                      "author": "Tarheel4lifer24",
                                      "created": 1639763020,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoxps28": {
      "link": "/r/ApplyingToCollege/comments/ri6mc7/how_would_i_describe_this_ec/hoxps28/",
      "text": "And yeah op of course you could keep working on this project but please don’t believe that it’s not meaningful as it is lmao this is more initiative than most kids I know at t10s",
      "author": "loserlake420",
      "created": 1639759129,
      "upvotes": 1,
      "replies": {}
    }
  }
}