{
  "sid": "rfq5ql",
  "link": "/r/ApplyingToCollege/comments/rfq5ql/how_to_find_out_if_my_credits_transfer/",
  "title:": "How to find out if my credits transfer?",
  "text": " I haven’t actually applied to a college (besides the community college I am at, so it doesn’t really count) before so I’m not sure how a lot of this works. Im applying to an out of state college from a community college and wanted to find out how many of my credits will transfer. How do you find out? Should I just wait and  If I get accepted will they tell me which credits transfer and which ones wont? Or should I contact admissions and ask them if they can determine which of my classes transfer and which don’t?",
  "author": "LongCockLeo",
  "created": 1639429634,
  "updated": 1639514260,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hoff5k3": {
      "link": "/r/ApplyingToCollege/comments/rfq5ql/how_to_find_out_if_my_credits_transfer/hoff5k3/",
      "text": "You may not be able to find out for sure, but see what you can find on the transfer admission websites of colleges you are interested in. Sometimes there will be a link to a credit equivalency tool.\n\nPSA, public universities tend to offer little to no need-based financial aid to out-of-state students and charge them more. Run the Net Price Calculator on the financial aid website of each college you are interested in, with the help of a parent, to see a need-based financial aid estimate before you apply.",
      "author": "elkrange",
      "created": 1639430118,
      "upvotes": 2,
      "replies": {
        "hofh39l": {
          "link": "/r/ApplyingToCollege/comments/rfq5ql/how_to_find_out_if_my_credits_transfer/hofh39l/",
          "text": "I’ve looked at the one they had and it was only for other schools in the same state. \n\nWe’ll be alright on price, we’re going to be able to switch to Instate after a year. I’ll be getting athletic aid as well.",
          "author": "LongCockLeo",
          "created": 1639430914,
          "upvotes": 1,
          "replies": {
            "hofhbq0": {
              "link": "/r/ApplyingToCollege/comments/rfq5ql/how_to_find_out_if_my_credits_transfer/hofhbq0/",
              "text": "Athletic aid is a different situation altogether.\n\nBe aware that you would not be able to switch to in-state after a year at most public universities. Make sure you've read the rules carefully, or have it in writing in your athletic scholarship, etc.",
              "author": "elkrange",
              "created": 1639431010,
              "upvotes": 2,
              "replies": {
                "hofho3q": {
                  "link": "/r/ApplyingToCollege/comments/rfq5ql/how_to_find_out_if_my_credits_transfer/hofho3q/",
                  "text": "My parents are moving there, I contacted admissions and they said if they established residency after a year than i could make the switch",
                  "author": "LongCockLeo",
                  "created": 1639431151,
                  "upvotes": 1,
                  "replies": {
                    "hofiupg": {
                      "link": "/r/ApplyingToCollege/comments/rfq5ql/how_to_find_out_if_my_credits_transfer/hofiupg/",
                      "text": "Good!",
                      "author": "elkrange",
                      "created": 1639431635,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hogsw2b": {
      "link": "/r/ApplyingToCollege/comments/rfq5ql/how_to_find_out_if_my_credits_transfer/hogsw2b/",
      "text": "Contact the admissions offices at the colleges you’re applying to. Whether the credits transfer or not will depend on what major you plan to pursue at the 4-year colleges.",
      "author": "jjhoster",
      "created": 1639452439,
      "upvotes": 1,
      "replies": {}
    }
  }
}