{
  "sid": "rhmlqt",
  "link": "/r/ApplyingToCollege/comments/rhmlqt/stanford_rejection/",
  "title:": "Stanford Rejection!!!",
  "text": "Congrats to those who got in!\n\nRejected from Stanford, not even deferred. I guess college is a crapshoot.\n\nDon't know what went wrong, but for context, I'm a US citizen in India and need huge financial aid. My major EC is research in CS with a Prof. at a reputed univ in the US and I'm working on two projects. We are going to submit the work to journals too very soon. The second EC is that I founded and chaired the MUN club at my school. I had 5 more which were definitely impactful but not very huge as compared to the previous two.\n\nWhat entrepreneurs say is correct, it's not a place for creating something innovative but a place for fun and always favors those with money! Don't know where I'll go but am sure that Stanford would regret having me and everyone else who got rejected. We are way bigger than this and the university suffers a loss. We are here to make a better world and no rejection is gonna stop that! We'll create at a place that acknowledges our talent and we'll definitely get acceptances!",
  "author": "sparshgup",
  "created": 1639644298,
  "updated": 1639786352,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.85,
  "comments": {
    "horkz0b": {
      "link": "/r/ApplyingToCollege/comments/rhmlqt/stanford_rejection/horkz0b/",
      "text": "Hey, I really love the mindset and I really needed it as I was also rejected (not deferred) from Stanford. I believe we can go on and make something big for ourselves in somewhere that will be lucky enough to have us. Stanford missed the chance to our talent and personality, but it just means another institution will be lucky. Good luck!",
      "author": "JeYuChou",
      "created": 1639651562,
      "upvotes": 3,
      "replies": {
        "hort46w": {
          "link": "/r/ApplyingToCollege/comments/rhmlqt/stanford_rejection/hort46w/",
          "text": "Good luck to you too! We’ll all go to someplace perfect for us.",
          "author": "sparshgup",
          "created": 1639657316,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}