{
  "sid": "qdgmd8",
  "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/",
  "title:": "Anyone’s got non-custodial parent problems?",
  "text": "Soo I have a problem, I am an international student, and my parents separated in 2014, and got a divorce in 2016, but I don’t talk to my dad much, he doesn’t help us financially, and obviously he doesn’t live w us, and he doesn’t speak English to fill out css profile on his own, but he isn’t absent, so he kind of exists and I have his contact information and blah blah blah. BUT, I got yelled at for asking for financial documents from my dad, and I don’t have an official statement from police or social workers to fill out CSS profile non-custodial parent waiver. Anyone’s got the same problem? Please, help me, Idk what to do😭",
  "author": "ProjectNo355",
  "created": 1634908229,
  "updated": 1635183561,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hhmwca7": {
      "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/hhmwca7/",
      "text": "I think if you can’t get his financial information and he won’t help, maybe just saying that you have no contact is the best option. If he does contribute, you can fill out his financial information next year, but i don’t know how strict the criteria are for no contact. \n\nCSS profile is kinda bs",
      "author": "s0ggycr0issants",
      "created": 1634919051,
      "upvotes": 2,
      "replies": {
        "hhpxnxx": {
          "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/hhpxnxx/",
          "text": "For no contact we need an official statement from police or social workers, and we don’t have it",
          "author": "ProjectNo355",
          "created": 1634975154,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hho7bac": {
      "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/hho7bac/",
      "text": "I can relate!! I'm in a similar situation with my dad. I hadn't been in contact with him for months until I reached out to him today to get some IDOC stuff filled out. I then realized that I'd made a mistake on my CSS Profile regarding his employment status so now I've got to get that fixed. \n\nBTW, does anyone know how to make changes to the CSS Profile after you've submitted it?",
      "author": "SageSparrow12",
      "created": 1634938580,
      "upvotes": 2,
      "replies": {
        "hhpxzpb": {
          "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/hhpxzpb/",
          "text": "I don’t think it’s possible",
          "author": "ProjectNo355",
          "created": 1634975448,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhm6n7m": {
      "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/hhm6n7m/",
      "text": "If he doesn't help you financially, is it mandatory to add his financial information anyway? Him earning but not contributing won't help with your financial aid stuff right 😭?",
      "author": "anuxietys",
      "created": 1634908414,
      "upvotes": 1,
      "replies": {
        "hhm6rap": {
          "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/hhm6rap/",
          "text": "Yeah, it won’t, but css profile requires his financial information anyway",
          "author": "ProjectNo355",
          "created": 1634908468,
          "upvotes": 2,
          "replies": {
            "hhm7rw5": {
              "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/hhm7rw5/",
              "text": "Ah. Do you have a school counselor who could talk to him about it? A lawyer? Isn't he legally obligated to share his information? If he doesn't comply, can you try and talk to the colleges you're applying to and explain the situation? Maybe email them? \n\nI'm in a low-key similar situation but like he does financially contribute for my education. Hope everything works out, good luck!!",
              "author": "anuxietys",
              "created": 1634908933,
              "upvotes": 1,
              "replies": {
                "hhpxlus": {
                  "link": "/r/ApplyingToCollege/comments/qdgmd8/anyones_got_noncustodial_parent_problems/hhpxlus/",
                  "text": "I don’t my counselor would want to do anything for me, but still thanks a lot!!!",
                  "author": "ProjectNo355",
                  "created": 1634975104,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}