{
  "sid": "q450pr",
  "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/",
  "title:": "AMA about Wellesley College!",
  "text": "Hi guys,  I'm QB Scholar who got in RD to Wellesley College and I'm here to answer any questions you have about the school. \n\nI chose Wellesley out of 13 other schools I got accepted to but it was mainly a competition between Wellesley and WashU (here is the link to my [Chance Me](https://www.reddit.com/r/chanceme/comments/elnju8/chance_me_as_a_questbridge_college_match_finalist/?utm_source=share&utm_medium=web2x&context=3) and [acceptances](https://www.reddit.com/r/QuestBridge/comments/fqba0u/the_struggle_is_over/?utm_source=share&utm_medium=web2x&context=3) but they only includes the QB schools and none of my safeties). I definitely do not regret my decision and I love it here! If you have any questions about attending an all women's college, what to expect from Wellesley academically and socially, why you should consider Wellesley, or legit anything else in the first place hit me up and I'd be happy to tell you! \n\nI submitted some stuff for a [reel](https://www.instagram.com/reel/CUWE_GjJsmP/?utm_source=ig_web_copy_link) on the QB Instagram about Wellesley if you want to see a day in the life kind of thing. I also did an [AMA](https://www.reddit.com/r/ApplyingToCollege/comments/md98km/ama_about_wellesley_college/?utm_source=share&utm_medium=web2x&context=3) like this on A2C last year where I answered a lot of questions so take a look at that too if you'd like.",
  "author": "ConfidentRead3",
  "created": 1633721584,
  "updated": 1639832907,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 1.0,
  "comments": {
    "hfxabj7": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfxabj7/",
      "text": "i'm going tp be blunt-- is everyone lesbian/bi?? i'm straight and i'm worried about fitting in at a women's college socially...",
      "author": "maddiesquesadilla",
      "created": 1633740583,
      "upvotes": 9,
      "replies": {
        "hfzwd21": {
          "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfzwd21/",
          "text": "No, not everyone is lesbian or bi lol. We have a very queer affirming community, yes, but i'd still say that a majority of Wellesley students are straight. You'll fit in regardless I assure you",
          "author": "ConfidentRead3",
          "created": 1633796868,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfwvs70": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfwvs70/",
      "text": "Hi there! If a third party's words mean anything for the readers of this subreddit, someone close to me went to Wellesley and it's an absolutely unbeatable school. Beautiful campus, brilliant professors, amazing students. If you want to roam a little, you can take regular classes for credit at Harvard and MIT.",
      "author": "lotsofgrading",
      "created": 1633733574,
      "upvotes": 3,
      "replies": {
        "hfzyz80": {
          "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfzyz80/",
          "text": "Definitely Agree, the academics and campus here are unbeatable! And yes, we are also allowed to cross-register at MIT.",
          "author": "ConfidentRead3",
          "created": 1633798023,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfx15s0": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfx15s0/",
      "text": "Hi! I've heard Wellesley is pretty competitive/people are super focused on studying over anything else. Is that true in your experience? What's the general vibe on campus?",
      "author": "inkandpapyrus27",
      "created": 1633736105,
      "upvotes": 3,
      "replies": {
        "hfzx8aa": {
          "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfzx8aa/",
          "text": "Vibe wise, its really chill. A lot of people have the preconception of Wellesley as all Type A girls ready to kill each other over grade deflation, but that system was abolished like 4 years ago and since they added shadow grading for first years, everything has been really mellow and everyone is crazy nice. Yes everyone here is pretty academically driven, but I wouldn't say it's that different from other schools. If you went to any elite college I feel like you'd get the same academic drive that you see here at Wellesley, but I will say that Wellesley is unique because everyone here is doing something really cool to make the world a better place, within and outside of academics, and if kind of just motivates you to do the same. For example, I had a friend who interned at one of the labs that created the Pfizer vaccine, or my roommates whose are in a neuropsych and astrochemistry lab respectively and they're both assisting in some truly ground breaking research. When you see that, you really can't help but want to do some crazy cool stuff yourself. Which is why I will say, if you come to Wellesley you will be driven to do a lot more than you imagined.",
          "author": "ConfidentRead3",
          "created": 1633797250,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfxorlk": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfxorlk/",
      "text": "Could you tell us a little bit more about Wintersession? Is this optional, what opportunities do students do during Wintersession.",
      "author": "DisplayAmbitious7472",
      "created": 1633747701,
      "upvotes": 3,
      "replies": {
        "hfzy07w": {
          "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfzy07w/",
          "text": "Yes winter session is optional, and it is an opportunity to do research/study abroad for 2 weeks during your winter break. I haven't completed a winter session yet, but some opportunities I've hear are Chemistry Research in Greece, Practicing Swahili in Tanzania, funded research, and  the Albright Institute does a program during winter session (Albright Institute is a program created by former Secretary of State Madeleine Albright (an alum btw) to help students engage in a forum to solve International issues). I think it's a really cool opportunity, especially for those who want to go abroad but don't want to dedicate a whole semester or year, or if you want to get a taste of what research is like without other coursework on top of it. If you come, I 10/10 recommend that you do a winter session!",
          "author": "ConfidentRead3",
          "created": 1633797597,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfw82ne": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfw82ne/",
      "text": "Did you get off the waitlist for the three colleges that waitlisted you?\n\n&#x200B;\n\nAlso, you said Wellesley is an all Women's college. Does that include transgender women? If someone hadn't fully transitioned but was in the process of doing so, would they also be allowed?",
      "author": "HauntingSir5632",
      "created": 1633723358,
      "upvotes": 2,
      "replies": {
        "hfwk1jf": {
          "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfwk1jf/",
          "text": "Not the op but\n1. Yes\n2. Yes\n\n(It’s about Wellesley, not the waitlists)",
          "author": "Apprehensive-Math240",
          "created": 1633728412,
          "upvotes": 2,
          "replies": {}
        },
        "hfzytaj": {
          "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hfzytaj/",
          "text": "I agree with what u/Apprehensive-Math240 just said, there is an entire office dedicated to assisting queer students coming to Wellesley, but I'm not familiar with their policy for transitioning women. I'd contact the school to confirm, but I'm confident that the answer is yes. Here is the [web page](https://www.wellesley.edu/studentlife/intercultural/oice/lgbtq) for any information you might need regarding queer life at Wellesley \n\nFor the waitlist question, tbh I don't remember and I really didn't bother to wait for the schools I was waitlisted in because I was content with my acceptances. I'm pretty sure I got off the waitlist for Emory but I had already committed to Wellesley by then, and if I rejected the offer to go on the waitlist for Vassar. I don't remember anything about Swarthmore lol. I hope that helps.",
          "author": "ConfidentRead3",
          "created": 1633797953,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg00j1f": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hg00j1f/",
      "text": "I also just wanted to comment here about religious life at Wellesley since whether or not I'd find a Christian Community was a huge issue for me when selecting schools because my faith is incredibly important to me. If this is your concern, I can assure that you will find a community of believers here on campus regardless of your religion. I'm not that involved with the Multi Faith Chaplaincies but they provide resources for students of many faiths, and for Christians specifically, which I am more familiar with, there are a lot of Christian orgs on campus who will support you in your spiritual walk and they'll help connect you with churches all across Boston. I am sure it is the same for the Muslim, Buddhist, Hindu, and other religious communities at Wellesley as well.",
      "author": "ConfidentRead3",
      "created": 1633798713,
      "upvotes": 1,
      "replies": {}
    },
    "hg1yrqb": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hg1yrqb/",
      "text": "Hi! HS Senior here trying to decide whether to ED or not to Wellesley. What's your least favorite thing about Wellesley? With that, what's your favorite thing about it? Is the transportation to Boston really so bad? What's the party scene like at Wellesley?",
      "author": "wild-midwest",
      "created": 1633831196,
      "upvotes": 1,
      "replies": {
        "hg24wfz": {
          "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hg24wfz/",
          "text": "1) Least favorite thing is definitely the lack of air conditioning. NO residential hall has a cooling system which means that  Wellesley is the WORST place to be in the summe. Coming in freshman year in the middle of august was an absolute hell, so you need at least 2 fans to survive lol. \n\n2) My favorite thing about Wellesley is definitely either the academics or the campus. We have some of the most devoted professors here at Wellesley and unlike most elite universities, all classes are taught by the professor and not an aid. The reading lists in all of my history classes are actually interesting and the lectures are engaging and interactive. Campus wise, Wellesley probably has the most beautiful campus in the world, with gothic Hogwarts-like architecture rising from a stunning natural landscape of wooded hills and shining lakes. And it's gorgeous year round: under fall leaves, and powdered snow, and meadows full of flowers in the spring. I doubt you will find a more beautiful campus. \n\n3) Transportation to Boston is not bad at all, we have a shuttle to Boston every 30 minutes for free on weekdays and $3 on weekends so you can pretty much get into boston any time you want. We couldn't leave campus last year, but this year my friends and I have been taking advantage of the shuttles and going all over Boston and it's hella convenient. The cool thing about Wellesley is that you get the whole far removed vibe from the campus (even though your smack dab in the middle of a suburb) but you also have easy access to a major city, so 2 birds with one stone ig\n\n4) I don't party so I couldn't really tell you much, but based on what I've heard the parties at Wellesley aren't very popular so if you do want to party you'll have to go to MIT or Babson.",
          "author": "ConfidentRead3",
          "created": 1633834336,
          "upvotes": 2,
          "replies": {
            "hg258hh": {
              "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hg258hh/",
              "text": "If your hesitant about EDing, I recommend you do Early Action, which is essentially a way for you to have your application reviewed and receive a \"Likely\", \"Unlikely\", \"Possible\" letter. I'm not sure if they're still doing that this year, so you'll have to check, but that's what I did and it also comes with an opportunity for you to join a Fly-in Program to the school which I couldn't attend because of COVID but I'm sure would be a  lot of fun!",
              "author": "ConfidentRead3",
              "created": 1633834515,
              "upvotes": 2,
              "replies": {
                "hg25q9b": {
                  "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hg25q9b/",
                  "text": "Thank you!",
                  "author": "wild-midwest",
                  "created": 1633834781,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh6zdhk": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hh6zdhk/",
      "text": "i’m late to this AMA, but could you speak to the recently repealed grade deflation policy and “stress culture” i’ve heard about? how hard is it now to have a high GPA at Wellesley and how is the overall mental health of the student body?",
      "author": "shiny--serenity",
      "created": 1634615192,
      "upvotes": 3,
      "replies": {
        "hh70cl4": {
          "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hh70cl4/",
          "text": "The stress culture here is pretty healthy as far as my experiences go. Back when grade deflation was a thing, I know it was pretty intense, but not that that system is abolished and they have instituted shadow grading (your first semester is only pass/fail), things have kind of taken a 180 here and are pretty chill. The students here are all very academically oriented though (and so are you, I'm assuming, since you're looking into it) and we all care a lot about our grades so you'll still see a lot of stress, but no more than any other school, I'd like to think. A's are still pretty hard to get at Wellesley anyway because the whole grade deflation mindset still exists so I think that contributes a bit to the stress, especially in the beginning but it's chill otherwise. I know that if you get in your most likely the kind of student accustomed to All A's in high school, just make sure you don't come into Wellesley thinking it'll be the same cause IT WONT, I think I can count on one hand the amount of A's I've received and that is perfectly fine. A B IS GOOD HERE.\n\nOn the issue of mental health as a whole, I've heard from a lot of people with genuine mental health issues that the Stone Counseling Center is not the best, but as I have not utilized these resources I can't speak from first-hand experience. However, I have noticed a very concentrated effort recently to emphasize mental health at the school (e.g. mental health panels, free counseling sessions, giving out stress balls, etc..) so maybe that's a positive sign that things are changing for the better??",
          "author": "ConfidentRead3",
          "created": 1634615761,
          "upvotes": 1,
          "replies": {
            "hh73i5k": {
              "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hh73i5k/",
              "text": "thanks sm for this detailed response, it’s really helpful!",
              "author": "shiny--serenity",
              "created": 1634617727,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hopp1mr": {
      "link": "/r/ApplyingToCollege/comments/q450pr/ama_about_wellesley_college/hopp1mr/",
      "text": "this is random, but does Wellesley still host a fall frenzy? im writing my supplements and wanted to talk about it but I cant find any recent information about it",
      "author": "domelid",
      "created": 1639612674,
      "upvotes": 1,
      "replies": {}
    }
  }
}