{
  "sid": "qb0hld",
  "link": "/r/ApplyingToCollege/comments/qb0hld/it_wont_be_that_bad_will_it/",
  "title:": "It won't be that bad, will it?",
  "text": "I recently made a post basically talking about how I probably won't be passing my honors chemistry class. I wanted to ask your opinion on how bad this will affect me getting into a decent college (I probably won't be able to go somewhere like Harvard but, I don't want to anyway).\nIn my county, high school students need three science courses to graduate and honors chemistry is my third and I'm not passing that one. I've realized that next semester I am scheduled to take AP Environmental Science, which I heard is one of the easiest AP classes (I'm aware that an easy AP class will still prove to be difficult, but I'm hoping it won't be as bad as chemistry). By taking and passing APES I'll fulfill my three science credits and won't have to take another science if I don't want.\nHow do you think colleges are going to react when they see me doing well in an AP course, but not so well in an honors course? Do you think it'll hinder me severely into getting into an okay college?",
  "author": "Sxphxcles",
  "created": 1634605557,
  "updated": 1634653084,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh6hxbs": {
      "link": "/r/ApplyingToCollege/comments/qb0hld/it_wont_be_that_bad_will_it/hh6hxbs/",
      "text": "It’s probably worse than you think. Colleges have minimum requirements for applicants and for some having a chemistry credit is a must. So as a result it has a decent chance of hitting you in the butt.",
      "author": "TritonTheCat",
      "created": 1634606421,
      "upvotes": 1,
      "replies": {
        "hh6i9n8": {
          "link": "/r/ApplyingToCollege/comments/qb0hld/it_wont_be_that_bad_will_it/hh6i9n8/",
          "text": "Fuck.",
          "author": "Sxphxcles",
          "created": 1634606585,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}