{
  "sid": "mdbokg",
  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/",
  "title:": "upvote this if you feel you let yourself down",
  "text": "Ever since I was a kid people told me how intelligent I was.\n\nAlways did well in class with little effort.\n\nCan hold my own in intellectual discussions of most common topics.\n\nOther people ask for my IB coursework/for help on tests.\n\nGot distracted by depression and other things at high school.\n\nPlus I've always been painfully lazy.\n\nHaven't fulfilled my childhood dream (and my parents belief) that I would land a T20.\n\nWhat a waste of potential.\n\n&#x200B;\n\nEdit: I'm not a prestige slut, I think prestige is a meaningless hoop that innocent 15-18 year olds are forced to jump through instead of enjoying their extremely unlikely yet magnificent consciousness. I'm just aware that the *real* world will care what brand I am, and that's what worries me. Also I really wanted to study in the US as it offers interdisciplinarity, unlike the UK's academic tunnel vision. But, to make paying 300k+ instead of 30k+ justifiable, there needs to be a certain amount of prestige.\n\nEdit edit: You guys are my therapist haha. I appreciate the support and glad to hear I’m not alone in this boat. Tbh I wouldn’t even be so upset if I was going to a mediocre university for a course I love (I’m most likely doing mechanical engineering ☹️) . If I was doing literally anything else (such as applied maths which would’ve been nice), I could’ve transferred in F2022 to a US College of Arts and Sciences or a LAC.",
  "author": "CapableEngineer8",
  "created": 1616715912,
  "updated": 1639835365,
  "over_18": false,
  "upvotes": 3230,
  "upvote_ratio": 0.96,
  "comments": {
    "gs8pvqq": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8pvqq/",
      "text": "This is so, so very much me. All my life, I’ve always been known as the “smart one.” The one who never studies for tests and still sets the curve. “You’re brilliant.” “Please give me a shout out when you win a Nobel prize.” Then the time comes to apply to college, and I just throw a couple of applications out there into the wind to safety/target schools. Didn’t bother applying out of state, to T20s, like I had been planning to since I started aggressively lurking on this sub in sophomore year. Didn’t bother with writing my essays until the last days before my application was due. Hastily scribbled out a list of extracurriculars hours before I submitted the application. I just wish I could have gone back in time, slapped me in the face, and told me to get it together.",
      "author": null,
      "created": 1616721353,
      "upvotes": 185,
      "replies": {
        "gs8rixx": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8rixx/",
          "text": "I started 3ish weeks before. Why are we so stupid.",
          "author": "CapableEngineer8",
          "created": 1616722210,
          "upvotes": 53,
          "replies": {
            "gs991td": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs991td/",
              "text": "3 weeks is bad? I worked on my essays for a little over a month (I also had nothing to do that month so it wasn’t like I also had school) and got a few adults to review it. I thought they were pretty good. Isn’t 3 weeks to around a month and a half normal?",
              "author": "Marymarcos345",
              "created": 1616732088,
              "upvotes": 26,
              "replies": {
                "gs99lim": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs99lim/",
                  "text": "I started drafting stuff 4 months in advance for the Common App, and 2 to 3 months in advance for supps",
                  "author": "SnoWFLakE02",
                  "created": 1616732445,
                  "upvotes": 11,
                  "replies": {
                    "gs99xpq": {
                      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs99xpq/",
                      "text": "Mm that’s fair I have a hard time doing more than one thing at once so I just spent half my summer studying for the act and the other half writing all my supps and common app so I didn’t have to worry about it during school. To be fair tho I was working on the essays like 6-8 hours a day, every day during that month so that’s probably why I was still very satisfied with them.",
                      "author": "Marymarcos345",
                      "created": 1616732670,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "gsa6dab": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa6dab/",
                  "text": "A friend of mine started the Yale app 10 days before it was due, he got in. During that time, he wrote his common app essay, his supps, extracurriculars, and filled up the additional info whilst also having each reviewed several times by teachers. Dude’s a goat",
                  "author": "MakingCake2077",
                  "created": 1616760500,
                  "upvotes": 2,
                  "replies": {
                    "gsa6k4c": {
                      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa6k4c/",
                      "text": "That’s insane",
                      "author": "Marymarcos345",
                      "created": 1616760621,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gs8s5bz": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8s5bz/",
          "text": "I'm so scared I'm going to be you (no offense). I feel like I have so much potential as a current sophomore, but I'm starting to get lazy and sloppy in my work nearing the end of the school year. I'm afraid I'll just decline from now on, and not be able to focus.",
          "author": "rebeccabibye58",
          "created": 1616722536,
          "upvotes": 18,
          "replies": {
            "gs8sz4z": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8sz4z/",
              "text": "Don’t be me. Start looking for what you love and shoot for it. Meditate daily and exercise three times a week. Get productive. Adopt a growth mindset. \n\nYou’ll be fine even if you become me, it’s just that hindsight is a real, nasty bitch.",
              "author": "CapableEngineer8",
              "created": 1616722970,
              "upvotes": 30,
              "replies": {
                "gs8trqi": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8trqi/",
                  "text": "Thank you for your tips. I'm sure you're not in a very bad situation, I just don't want to waste all this potential because of procrastination and senioritis in my sophomore year. Hopefully I will continue to be motivated",
                  "author": "rebeccabibye58",
                  "created": 1616723380,
                  "upvotes": 3,
                  "replies": {}
                },
                "gsmeuqe": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsmeuqe/",
                  "text": "thanks.",
                  "author": "Electrical_Fan5918",
                  "created": 1616967759,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gs94379": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs94379/",
              "text": "Don't worry, I've recovered enough self-worth to not take offense. I absolutely second what the other reply mentioned, especially looking for what you love. You may not find it, but exploring your interests will still give you an idea of what you like or loathe to do. One of my biggest regrets has been not trying more things. Also, don't be afraid to reach out for help when you need or find yourself lacking in motivation; things can easily spiral after that point.",
              "author": null,
              "created": 1616729023,
              "upvotes": 8,
              "replies": {}
            },
            "gs9pm3z": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9pm3z/",
              "text": "I'm a junior, also a lil scared. \n\nIt gets better. Just be aware of your study habits and consistently work on them. 1 year is an eternity in these times and you in junior year could turn it around. \n\nIf you don't know how to work on them, just try a few different systems and see which one works best for you",
              "author": "IshwarKarthik",
              "created": 1616745947,
              "upvotes": 4,
              "replies": {}
            },
            "gsk34s2": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsk34s2/",
              "text": "Northwestern commit here—the single best thing I can recommend to everyone in your situation is to write more, be it journaling for a few minutes a day or even just jotting down a weird shower thought and elaborating on it. I wrote a shit ton on Quora in my freshman/sophomore years and because I was so used to the insightful kind of writing college essays require (much different from the objective thesis papers in school), writing my college essays seemed pretty routine. It doesn’t have to be a lot, but a little every day can go a long way:)",
              "author": "splashinpassion",
              "created": 1616912425,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gs9nu6q": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9nu6q/",
          "text": "Dude, reading this made me so sad. I did the same thing my senior year. Wrote my entire CommonApp personal statement the day of the deadline. Although I ended up getting lucky, those days after applying were filled with regret and self-hatred. \n\nAny rising seniors reading this, don’t make this mistake. It’s not about other’s expectations, it’s about proving to yourself your full potential. Sit down one day and write down *something*. Anything. You have to get out the junk, loose thoughts, and cliché sentences before yourself starts to show. That’s what AOs want.",
          "author": "My_Not_RL_Acct",
          "created": 1616744253,
          "upvotes": 18,
          "replies": {
            "gschamf": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gschamf/",
              "text": "Yep, I fell into a depression pit hard during app season and wrote almost every single one of my RD supps within 24 hours of their deadline. I’m not proud of it though I don’t think my essays turned out bad but we’ll see how the pieces fall. I hate that I worked so hard the last 3.5 years only to make such dumb choices in January and that period of time was really a culmination of my lowest moments academically and personally. Though, I got extremely lucky and was accepted to my EA top choice after a deferral so I don’t feel as pressured anymore but I still have regrets",
              "author": "slouchingpotato",
              "created": 1616796878,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gs99wy7": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs99wy7/",
          "text": "Word for word me",
          "author": "theepi987",
          "created": 1616732656,
          "upvotes": 2,
          "replies": {}
        },
        "gsadlka": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsadlka/",
          "text": "Fuck sake for sure. I'm in the same boat but for me drugs happened.",
          "author": "CurtisMaimer",
          "created": 1616764629,
          "upvotes": 1,
          "replies": {}
        },
        "gsw4fob": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsw4fob/",
          "text": "Omg me too. Everyone always tags me as ‘the best’. Whenever I say I’m tired/ I couldn’t study they’ll just be like ‘oh, you’ll still do well’. And I put a lot of effort into my applications, at least I thought I did. But now I’ve gotten so many rejections I’m just exhausted. I’m not even looking forward to opening the rest.",
          "author": "Cool-Chemical7428",
          "created": 1617174713,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gs8g9cx": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8g9cx/",
      "text": "a-are you me because these are the words i've been trying to say but couldn't form into words",
      "author": "wonphorias",
      "created": 1616716373,
      "upvotes": 478,
      "replies": {
        "gs8jzp7": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8jzp7/",
          "text": "I-I've found another one like me. It feels good to know I'm not alone.",
          "author": "CapableEngineer8",
          "created": 1616718277,
          "upvotes": 177,
          "replies": {
            "gs92292": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs92292/",
              "text": "I'm the same way. I should've been extremely smart, but I just can't get myself to do anything anymore. Everything's boring, nothing feels fun anymore. I just fucked around for the last few years without taking anything seriously and the fact that I'm still doing really well - 3.9 gpa and 1500+ sat - speaks volumes to what I could've and should've been.",
              "author": "Sworp123",
              "created": 1616727867,
              "upvotes": 88,
              "replies": {
                "gs9ot3d": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ot3d/",
                  "text": "Did I just find my twin?",
                  "author": "Huzii69",
                  "created": 1616745176,
                  "upvotes": 15,
                  "replies": {}
                },
                "gs9u3d5": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9u3d5/",
                  "text": "THIS",
                  "author": "Decision-Lopsided",
                  "created": 1616750366,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "gs9ncbi": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ncbi/",
              "text": "damn we can resonate together. went through my first 3 years of high school, max ap classes, very little effort. at the end of junior year i started to get depressed and took an \"incomplete\" for 1 online classes but still managed to get the rest As and was valedictorian. im pretty sure the incomplete hurt my chances at the schools I had been dreaming of and I got rejected from my top 3 choices. this, combined with other factors, led to me getting major depressive disorder and last semester I got Bs and 2 Es (for incomplete online classes). now I'm far from valedictorian and I'm hella worried about getting rescinded from the school I committed to. honestly I don't know what I would do at this point if I got rescinded that school is like the only thing i have left.",
              "author": "KaBammii",
              "created": 1616743783,
              "upvotes": 21,
              "replies": {}
            },
            "gs8m0sp": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8m0sp/",
              "text": "you are never alone! we will get through this",
              "author": "wonphorias",
              "created": 1616719319,
              "upvotes": 45,
              "replies": {}
            },
            "gs9ordz": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ordz/",
              "text": "Yep feels pretty same",
              "author": "Huzii69",
              "created": 1616745129,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gs8ztls": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8ztls/",
          "text": "YUP ME TOO",
          "author": "justdoorknobthings",
          "created": 1616726630,
          "upvotes": 6,
          "replies": {}
        },
        "gs8npdy": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8npdy/",
          "text": "And you've just formed the words I wanted to say 😭😭😭😭",
          "author": null,
          "created": 1616720199,
          "upvotes": 15,
          "replies": {}
        },
        "gs9icfc": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9icfc/",
          "text": "ey",
          "author": "amplitudespoon",
          "created": 1616739209,
          "upvotes": 3,
          "replies": {}
        },
        "gs9tcfb": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9tcfb/",
          "text": "we should all hug:(",
          "author": "ravelrain",
          "created": 1616749624,
          "upvotes": 3,
          "replies": {}
        },
        "gs8owkb": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8owkb/",
          "text": "me tio",
          "author": "snufflupaguss",
          "created": 1616720830,
          "upvotes": 7,
          "replies": {}
        },
        "gs8pxf0": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8pxf0/",
          "text": "Junior here but pretty much feel the same :(",
          "author": "KaiwenKHB",
          "created": 1616721377,
          "upvotes": 10,
          "replies": {
            "gs8rd9w": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8rd9w/",
              "text": "Wdym... ur a junior. Do something useful this summer and get some good grades next year. Idk mucb about the US system but my guess id that it’s not too late.",
              "author": "CapableEngineer8",
              "created": 1616722127,
              "upvotes": 23,
              "replies": {
                "gs8s196": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8s196/",
                  "text": "I have planned out mostly what I'm gonna do summer and next year, however I still feel like even if I get all those done(unlikely since I'm a lazy ass) I still have maybe only a combined 30% chance to get in any T20, at this point I'm not sure if it's imposter syndrome or really I'm bad lol",
                  "author": "KaiwenKHB",
                  "created": 1616722475,
                  "upvotes": 10,
                  "replies": {
                    "gs9lw5s": {
                      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9lw5s/",
                      "text": "Don’t beat yourself up too much before it even starts. U could get into a T20, and if u don’t that’s also ok. Ur success isn’t defined by what school u go to, it’s by what u make of ur time in university. It’s how u use the resources the university provides.",
                      "author": "Mapleleaf27",
                      "created": 1616742418,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "gs8sql6": {
                      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8sql6/",
                      "text": "Meditate. Start doing it today. Download the waking up app and get going. It will make you 1 billion % more productive.",
                      "author": "CapableEngineer8",
                      "created": 1616722845,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                },
                "gsacdoy": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsacdoy/",
                  "text": "and... you're a senior. College isn't everything. You can still accomplish things, pursue your passions, whatever you want. You're *eighteen*. It's almost idiotic to think that just because this guy is a junior and that you are a senior, that there is a difference in how much you guys should pursue opportunity. You're both so young, you have so much time to do what you want, regardless of where you go to college, where you live, etc. All of this stuff doesn't matter -- just relax, and do what you want to do.",
                  "author": "earth418",
                  "created": 1616764000,
                  "upvotes": 2,
                  "replies": {}
                },
                "gsa8d6t": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa8d6t/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1616761741,
                  "upvotes": 1,
                  "replies": {
                    "gsb021i": {
                      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsb021i/",
                      "text": "I looked over your chance me and your ECs were somewhat weak for competitive colleges. Nothing about your application really stood out.",
                      "author": "Fort_21",
                      "created": 1616774859,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gs9kemr": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9kemr/",
              "text": "I feel the same and I'm a freshman",
              "author": "Clashboy15",
              "created": 1616741061,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gsaugzh": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsaugzh/",
          "text": "Honestly, it seems like a large fraction of people fall into this category.",
          "author": "Terrible-Marketing-2",
          "created": 1616772412,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gs8fy8l": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8fy8l/",
      "text": "Ray Kroc, Mother Teresa, Alan Rickman. All people who succeeded much later in life. You don’t have to be a genius all the time. Stuff happens. Especially nowadays when college is so sweaty. Keep your head up and you can do anything.",
      "author": "EBITDAC18",
      "created": 1616716215,
      "upvotes": 98,
      "replies": {
        "gs8ip5s": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8ip5s/",
          "text": "Big up",
          "author": "CapableEngineer8",
          "created": 1616717608,
          "upvotes": 20,
          "replies": {}
        },
        "gs9atu2": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9atu2/",
          "text": "Minus mother teresa though, not the best role model...",
          "author": "-TheDragonOfTheWest-",
          "created": 1616733277,
          "upvotes": 32,
          "replies": {
            "gs9g8fm": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9g8fm/",
              "text": "Ray Kroc too, really.",
              "author": "FewElevator4",
              "created": 1616737391,
              "upvotes": 9,
              "replies": {}
            },
            "gs9sfzo": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9sfzo/",
              "text": "Um.. why?",
              "author": "bfBoi99",
              "created": 1616748720,
              "upvotes": 5,
              "replies": {}
            },
            "gse4hzo": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gse4hzo/",
              "text": "[deleted]",
              "author": null,
              "created": 1616825391,
              "upvotes": 0,
              "replies": {
                "gse4oic": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gse4oic/",
                  "text": "Her actions are well documented...",
                  "author": "-TheDragonOfTheWest-",
                  "created": 1616825496,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gs9qcqz": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9qcqz/",
          "text": "Marcel Proust, Ricky Gervais..",
          "author": "Babill",
          "created": 1616746660,
          "upvotes": 5,
          "replies": {}
        },
        "gs9kgho": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9kgho/",
          "text": "You might want to pick a few different role models...",
          "author": "Clashboy15",
          "created": 1616741108,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gs8hnua": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8hnua/",
      "text": "i know you're feeling terrible rn but i wanna thank you for letting me know that i'm not the only one feeling disappointed in myself, there were so many things i could've done in highschool.",
      "author": "Melancholy_raccoon",
      "created": 1616717082,
      "upvotes": 41,
      "replies": {}
    },
    "gs8jawm": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8jawm/",
      "text": "Get good grades, get into a great grad school, do reasonably well there.  That’s what _actually_ matters to employers.",
      "author": "NovaPokeDad",
      "created": 1616717921,
      "upvotes": 42,
      "replies": {
        "gs8lylg": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8lylg/",
          "text": "You're absolutely right. I will take what I've got and shoot for the stars. Doesn't stop me thinking about what could've been though :/ .",
          "author": "CapableEngineer8",
          "created": 1616719287,
          "upvotes": 29,
          "replies": {}
        }
      }
    },
    "gs8gbat": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8gbat/",
      "text": "You are not a waste of potential. \nYour worth is not measured by the college you attend.",
      "author": "slothvb",
      "created": 1616716399,
      "upvotes": 102,
      "replies": {
        "gs8io42": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8io42/",
          "text": "I don't define my worth by the college I attend either. But the professional world will. Won't it?",
          "author": "CapableEngineer8",
          "created": 1616717594,
          "upvotes": 48,
          "replies": {
            "gs8o5n9": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8o5n9/",
              "text": "No. It won’t. Look at all of the people in the world that have gone to colleges and universities other than the top 20 schools. Or, didn’t go to college at all. Your experiences, knowledge, character, work ethic, and attitude are what matter in the professional world. Sure, there are places where it may matter, but again, not every successful person in the world went to a top school. \n\nI attended a small liberal arts college, not well known, not incredibly selective. I had peers that went on to be doctors, lawyers, politicians, writers, film directors, college deans, business owners, etc. \n\nYou get to define what success means to you.",
              "author": "slothvb",
              "created": 1616720436,
              "upvotes": 75,
              "replies": {
                "gs96doy": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs96doy/",
                  "text": "I second this.  No one at work asks where you went to college.  They just want to know how you're going to contribute.  I also went to a small college and I'm working with people who went to t20 schools.  We're peers and making the same salary.  Just look for opportunities when they come and find work that you can be passionate about.  Everything else will fall into place.",
                  "author": "Dense-Wonder9371",
                  "created": 1616730409,
                  "upvotes": 19,
                  "replies": {
                    "gs9hwnc": {
                      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9hwnc/",
                      "text": "Then what do they look at? When you come out of college you don't have that much on your resume, except your GPA and clubs I imagine, and if you were really good then research. But when you come out of college there's almost nothing on your resume other than those things, right? Then what else can jobs look at?",
                      "author": "_red_roof_",
                      "created": 1616738823,
                      "upvotes": 1,
                      "replies": {
                        "gs9l710": {
                          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9l710/",
                          "text": "This will not apply to everyone, but in general try to get internships.  They want to see some experience.  I graduated with a degree in broadcast journalism, did 2 internships while in college and got hired at an all news station.  A few years later, decided to switch career and went into marketing (sold them on my creative background, writing skills, and hustle).  Worked my way up and got hired on at various companies to build their marketing department from ground up.  Then decided to switch career again, this time into analytics where Im working side by side with data scientists and engineers.  Worked in consumer electronics, publishing, automotive, etc... My point is, my college didnt really take me far.  I looked for opportunities and added new skillsets with every job I had which became stepping stones for me.  Once I feel like there's nothing else to learn at a company (usually 3 years for me), I'll move on to another opportunity that interests me.  This is just from my personal experience.",
                          "author": "Dense-Wonder9371",
                          "created": 1616741785,
                          "upvotes": 6,
                          "replies": {
                            "gs9mqja": {
                              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9mqja/",
                              "text": "So then don't the internships care about your college name? What else would they base the acceptance on?",
                              "author": "_red_roof_",
                              "created": 1616743206,
                              "upvotes": 0,
                              "replies": {
                                "gs9p1uo": {
                                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9p1uo/",
                                  "text": "Not from my personal experience.  I sent new samples of my work to various stations and reached out every month.  One news station in los angeles liked my hustle and persistence so they took me on as an intern.  Where Im at, Ive seen a few interns from lesser known colleges get hired and they're now leading teams.",
                                  "author": "Dense-Wonder9371",
                                  "created": 1616745407,
                                  "upvotes": 4,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gs9yvst": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9yvst/",
                  "text": "If you are happy with a \"normal successful\" life it honestly does not matter what college you go to or even really how your grades were in college. You can live a very happy life, make great money, and be completely fulfilled no matter what college you go to.\n\nI do think it's a bit disingenuous for people to pretend like CEOs, VPs, politicians, and major figures don't disproportionately come from a very small number of schools. But honestly, how many people aspire to be a Supreme Court Justice or a VP at a big company? If you have \"normal\" aspirations then it doesn't really matter one way or the other.",
                  "author": "MtlGuitarist",
                  "created": 1616754917,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gs9a9rx": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9a9rx/",
              "text": "Most people dont care. I think the top finance and consulting firms will care. U should be good don't sweat it",
              "author": "clarity_now2",
              "created": 1616732893,
              "upvotes": 2,
              "replies": {}
            },
            "gsapt5e": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsapt5e/",
              "text": "Speaking as an American — with the exception of the old boys’ clubs, grads who make a point of hiring their fellow grads from places like Harvard, Yale, and the like — no one give’s a rat’s bony ass what school you graduated from. It’s irrelevant.\n\nAnd, just a thought:  unless you have a scholarship-dependent major, you can transfer to an American school and, once you’re in, study whatever you want. You’re not locked into anything (keeping in mind, of course, that changing your major midstream may delay graduation and cost more).\n\nAnother thought — spending ten times what you have to for your education is nuts. Don’t do it. We justify our insane tuition and fees with prospective earnings, which is bullshit. A degree is no guarantee of gainful employment. Don’t believe the hype. (And New York and California have some great state schools, which have very reasonable tuition.)",
              "author": "KevlarKat",
              "created": 1616770343,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gs9745o": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9745o/",
      "text": "i always thought i could get in anywhere because i was smart as a little kid. turns out i was precious but absolutely average. shit fuckin blows, man.",
      "author": "bittyitties",
      "created": 1616730862,
      "upvotes": 17,
      "replies": {
        "gsafntf": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsafntf/",
          "text": "No literally. I have good grades especially considering my personal life yet I’m so painful average",
          "author": "HappilyNotHappy",
          "created": 1616765654,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gs8no3w": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8no3w/",
      "text": "I already gave my award to someone else on this sub so I'm going to give you my next one. Related to this on a whole new level.\n\n!remindme 3 days",
      "author": null,
      "created": 1616720179,
      "upvotes": 15,
      "replies": {
        "gs8nq5r": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8nq5r/",
          "text": "I will be messaging you in 3 days on [**2021-03-29 00:56:19 UTC**](http://www.wolframalpha.com/input/?i=2021-03-29%2000:56:19%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8no3w/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fmdbokg%2Fupvote_this_if_you_feel_you_let_yourself_down%2Fgs8no3w%2F%5D%0A%0ARemindMe%21%202021-03-29%2000%3A56%3A19%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20mdbokg)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "author": "RemindMeBot",
          "created": 1616720210,
          "upvotes": 1,
          "replies": {
            "gsl9mia": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsl9mia/",
              "text": "Haha, raced ya to it.",
              "author": null,
              "created": 1616947782,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gs9g1ly": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9g1ly/",
      "text": "I was in your shoes. I kind of still am. Here's what I can say. The sooner I simply focused on what I truly wanted to study and put my effort into that, instead of on the name of the place, the better situation I would be in. It was agony watching many of my peers get into the schools I applied to, while I had what all my teachers and advisors thought was a stronger chance. I got one rejection, two acceptances, and six pointless waitlists. I felt like I had failed myself and failed to live up to others' expectations as well. If you're intent on attending a T20, it's still possible to investigate transfer admissions - hell that's what I actually did. But I'll say what I wasn't prepared for was the feeling when I started sophomore year, having spent a miserable year at one school where I didn't feel I belong, instead of treating it as a formative experience I treated it as a sentence. After transfer, I was infuriated, wondering how so many of my new peers were able to \"best\" me in admissions when so many frankly didn't seem that impressive or academically committed. It's not a game you can win - you're not really going to \"realize what was wrong\" with your app or yourself it seems. I've spent much too long fretting over how I felt I failed once, and this has held me back: I felt like an imposter, and despite my promise I did not let myself flourish in college because I took the admissions game too seriously, assuming that they somehow knew more about me than I did. It's incorrect, and not worth thinking twice about, let alone allowing it to consume you for years. I felt I was never \"good enough\" for this program or that, this or that major, and stifled my own experience feeling that I was never truly meant to belong. The mental illness I had in hs became exacerbated to such a level I didn't think I would survive; I did the unthinkable of earning an F, several C's, and withdrew from 3 courses. I finally got a bit of control towards the end, but im still astounded that me, someone who takes this academic stuff so seriously and has always been an enormously pensive and analytical person, has this as part of my \"official\" record. I have since graduated T20 with a major nobody has heard of and a mediocre-to-sour gpa that gives me grief. As I say, the only thing I got from school was a degree. It wasn't to do with the \"elite rigor,\" it's because I couldn't accept myself, believe in myself, and be decisive and take control of my college experience because it never unfolded in any way I ever expected. I have now become more at peace with the past several years, but I still often wonder about where I \"could be\" had I not fallen into this pit. Please don't let the disappointing sting of this moment limit you further on. A T20 degree is lovely (and not inaccessible to you, again transfer or for a later grad program), but it does not win anyone over on name alone - I and many friends of mine have been hunting for months now in the job search, and I can assure you people are more interested in what you do with the education available to you, the orgs and internships you get involved with, than the school's name. People I consider mentors who attended college I had never even heard of are accomplished working at highly selective companies and T10 PhD programs. None of this is out of your reach based on your first year of college, but I urge you to define what it is you want to study and get involved with, and the opportunities will follow. Forgive the wall of text, I'm on mobile and this was therapeutic.",
      "author": "eyaf20",
      "created": 1616737236,
      "upvotes": 13,
      "replies": {
        "gs9wis8": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9wis8/",
          "text": "This is super helpful! Thanks!",
          "author": "CapableEngineer8",
          "created": 1616752729,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gs99jxk": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs99jxk/",
      "text": "As a child we were told that we are smart, turns out the same thing was told to everyone",
      "author": "blankkoyo",
      "created": 1616732416,
      "upvotes": 13,
      "replies": {}
    },
    "gs8himw": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8himw/",
      "text": "Yep, T20 is the only way to become successful in any way. /s\n\n“Bezos is the only Ivy League graduate leading the top 10 companies, but one of 12 represented in Fortune's top 100.”\n\nhttps://www.usnews.com/education/best-colleges/articles/where-the-top-fortune-500-ceos-attended-college",
      "author": "fatdog1111",
      "created": 1616717010,
      "upvotes": 31,
      "replies": {
        "gs8jj20": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8jj20/",
          "text": "Good point.",
          "author": "CapableEngineer8",
          "created": 1616718036,
          "upvotes": 10,
          "replies": {}
        },
        "gs9gfkt": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9gfkt/",
          "text": "That's not necessarily indicative of non-prestigious schools being good at job placement but just the fact they tend to have higher class sizes, and statistically, the higher your class size, the more likely it is for somebody from it to succeed.",
          "author": "FewElevator4",
          "created": 1616737557,
          "upvotes": 4,
          "replies": {
            "gsc2vle": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsc2vle/",
              "text": "They have larger class sizes, but as the Ivy professor who wrote \"Excellent Sheep\" says, you could stick most of the students at top schools in a closet for 4 years and they'd still be successful given their family network connections. Less prestigious schools have a much higher percentage of students from poor and middle class families. For that reason, the fact that less prestigious schools produce most Fortune 500 CEOs is more impressive than the fact top colleges produce some too. Those who rose from less prestigious schools likely did it without someone else paving their way for them. \n\nFor example, someone I personally know of at a top college has one parent who's a Wall Street exec and another who's a former CEO of one major company and now started a new one. Someone groomed from birth, attending private schools with every resource. Their success will make the top college look at the more impressive, but their success will have nothing to do with having gone there.",
              "author": "fatdog1111",
              "created": 1616791155,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gs8j6j8": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8j6j8/",
      "text": "hey not getting into a T20 isnt a waste of potential, and i’m sure you’ve gotten in (or will get into) a college that is a perfect fit for u! prestige isn’t everything, it’s what we make of the situation:) i’m not going to attend a prestigious institution, but i plan to do study abroad programs and join clubs at my university (it just sounds fun!)\n\nyou got this! this isn’t the end of ur potential—it’s the start of it. keep ur chin up!!",
      "author": "gracescereal",
      "created": 1616717857,
      "upvotes": 9,
      "replies": {}
    },
    "gs8tzio": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8tzio/",
      "text": "I feel exactly the same way. I was always told I was super intelligent. Did super well in school without putting in much effort. I always procrastinate and my mental health wasn’t that great and I started slipping. I think I let myself down. I knew I could’ve worked harder and gotten better grades but I didn’t I knew if I pushed myself I could’ve done amazingly well but I didn’t. I didn’t. And now I feel like I’ll get rejected from all the schools that havent sent out their decisions and I am beyond disappointed in myself. I just feel like I’m not good enough. I should’ve done better.",
      "author": "Available_Sea6673",
      "created": 1616723493,
      "upvotes": 9,
      "replies": {
        "gs9ggij": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ggij/",
          "text": "you just described everything i wanted to say in one comment",
          "author": "psshdjndofnsjdkan",
          "created": 1616737579,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gs99zbg": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs99zbg/",
      "text": ">Plus I’ve been painfully lazy. \n\nI relate so much to this one. Idk if my “painful laziness” is the same as yours. But I just feel so lazy. However I’m still working hard and handing in all the work. It sounds conflicting but I really don’t wanna do shit even tho I’m doing them. I’m so tired. I always think of not doing shit but at the end of the day I pick up my work again.",
      "author": "JanKwong705",
      "created": 1616732699,
      "upvotes": 10,
      "replies": {
        "gs9ewt6": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ewt6/",
          "text": "I know exactly what you’re talking about",
          "author": "Tentative-octopus",
          "created": 1616736312,
          "upvotes": 3,
          "replies": {}
        },
        "gsafzd9": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsafzd9/",
          "text": "It’s fear of failure that makes me do my work back my lack of energy and motivation makes the work not my best. I do the bare minimum to do well. It’s weird",
          "author": "HappilyNotHappy",
          "created": 1616765812,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gs8uyp1": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8uyp1/",
      "text": "the thing is, businesses don't care about what brand you are unless you want to get into investment banking or you're trying to go into law, in which case the prestige of your law school matters, not your undergrad. most fortune 100 ceos didn't even go to any ivy! [https://www.theladders.com/career-advice/new-data-shows-that-going-to-an-ivy-league-school-is-no-longer-a-requirement-for-fortune-100-ceos](https://www.theladders.com/career-advice/new-data-shows-that-going-to-an-ivy-league-school-is-no-longer-a-requirement-for-fortune-100-ceos)\n\n&#x200B;\n\neven then, there's just so much disparity by major. say you want to go into cs or engineering. maybe you'd assume that an ivy would be necessary for success, but schools like uiuc and purdue have even better outcomes than ivies for those programs. you want to go into business? harvard doesn't even let undergrads major in business! instead iu Bloomington and Michigan ross and Berkeley have some of the strongest business programs\n\n&#x200B;\n\nand honestly, if you think you cant be successful without an ivy, that's a personal fault on you. the wanting to go to a us school but not being able to unless it is 'prestigous' makes more sense just for financial reasons but the success thing 100% does not",
      "author": "TiredWatermelon5127",
      "created": 1616724005,
      "upvotes": 7,
      "replies": {}
    },
    "gs8wmwn": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8wmwn/",
      "text": "I don’t wanna shift the blame but I’m in the same situation and I feel like since school never challenged us, we were conditioned to be lazy, form bad habits, and not take school seriously from a young age.\n \nIdk but yeah it’s hard get homework done on time/study properly (especially during online school) when you’re used to being able to do it in 20 minutes during the period before it’s due",
      "author": "luke_duck",
      "created": 1616724897,
      "upvotes": 6,
      "replies": {}
    },
    "gs8wxch": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8wxch/",
      "text": "You literally just perfectly described me you’re not alone!",
      "author": "Planetintj",
      "created": 1616725051,
      "upvotes": 7,
      "replies": {}
    },
    "gs9egzn": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9egzn/",
      "text": "Junior college student here:\n\nI felt the EXACT same way in high school. I have just a few things I’d like to say :)\n\n1. You are not your school, your grades, your social status, or any other label. Any of that can define you if you choose to let it, but the second it falls away you’ll be lost. In my eyes, you’re defined by your willingness to believe in yourself and to get up and keep going. You’ll let yourself down. A lot. Too many times. But as long as you never give up on yourself, you haven’t lost. Believe in yourself.\n\n2. Depression and anxiety is not a “distraction.” It’s a real, complicated, difficult thing that so many go through. You are NOT alone and you WILL come out the other side. Believe in yourself.\n\n3. This is kind of an addendum to the first thing but I got rejected from my dream school while I watched everyone, including my girlfriend at the time get in. I went to the generic state school and after 2 years, I transferred out to the same dream school I got denied from. Here’s the kicker though — I LOVED that “consolation” school and I almost didn’t leave. College, life, is entirely what you make of it. You can choose to settle for the current situation you’re in or fight to make the most of it. I don’t mean that in the white-knuckled grind kind of way either. College is one of the most incredible experiences if you’re privileged enough to attend ANY university. All you have to do is keep your eyes open, say yes to that party invite, and damn believe in yourself.\n\n❤️ - I hope this helps, even if just a little :)",
      "author": "CommanderDingDong",
      "created": 1616735965,
      "upvotes": 6,
      "replies": {}
    },
    "gs8s8m8": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8s8m8/",
      "text": "i feel ya bud. honestly I feel like it’s not worth it to go without the resources that come with a more prestigious school. being low-income means that if I go to college, my tuition will take away opportunities for the rest of my family. is it worth it if it’s a school I don’t love? or if it’s a school that won’t help me in my future? i don’t know. \n\nanywho, i feel you buddy. good luck in this admission cycle and know that you are going to do amazing things, regardless of what uni you attend",
      "author": "feirly",
      "created": 1616722584,
      "upvotes": 7,
      "replies": {}
    },
    "gs9actc": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9actc/",
      "text": "God are you me? This feels like me so fucking much. I feel like a failure because believed my own hype. I pretended to be enough and that it finally caught up to me. That I lied to myself for so long that I actually convinced myself I could make it. But I found out what I've always should have known: I'm such a goddamn fuck up.\n\nLiterally I have one playlist on loop right now that's keeping me moderately stable bc if don't, I'm going to have a panic attack",
      "author": "ToaOfLight",
      "created": 1616732950,
      "upvotes": 6,
      "replies": {
        "gsag8h6": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsag8h6/",
          "text": "Literally how I feel. Since freshman year I was so confident I was in the right path direction and my work was enough and decent. Now I’m looking at colleges and college applications and I feel so fucking stupid. Legit been crying every single day and I feel like an absolute failure. It’s so fucked up that this is what college does to us but god",
          "author": "HappilyNotHappy",
          "created": 1616765935,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gs8r0nh": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8r0nh/",
      "text": "Your potential is only wasted if you give up now.",
      "author": "Quirky_Bumblebee_461",
      "created": 1616721943,
      "upvotes": 11,
      "replies": {}
    },
    "gs94i1m": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs94i1m/",
      "text": "you are me👀",
      "author": "sgatsiii",
      "created": 1616729267,
      "upvotes": 3,
      "replies": {}
    },
    "gs9aedn": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9aedn/",
      "text": "this felt like i was reading my biography ohmygod\nthe worst is that i JUST cannot study, i try, but i just cannot??!?!? and it sucks cause i know im smart but and if i try i could get into a good thingy but just cant?!",
      "author": "lilisoverused",
      "created": 1616732979,
      "upvotes": 3,
      "replies": {}
    },
    "gs9qzg6": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9qzg6/",
      "text": "Coming from someone that has struggled with depression since high school, and is currently failing out of college even though is certifiably of well above average intelligence... \n\nYep",
      "author": "Flumphs_Lair",
      "created": 1616747272,
      "upvotes": 3,
      "replies": {}
    },
    "gsa1slm": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa1slm/",
      "text": "This is exactly like me. And continuing to wait for US results only makes me fall out of love with the UK place I have available. I hope it all works out for us both.",
      "author": "HazardousMatthew",
      "created": 1616757325,
      "upvotes": 3,
      "replies": {
        "gsa3584": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa3584/",
          "text": "Good luck? What uk offer do you have?",
          "author": "CapableEngineer8",
          "created": 1616758316,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gs9h42o": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9h42o/",
      "text": "A lot of people on here are talking about how going to a T20 isn't necessary for success. That is true in a lot of industries, but I don't think most kids who are sad about not getting into a T20 are sad purely because of a career perspective. It's more a lot of us built up our self worth around our academic performance and our intelligence, and the culmination of that according to our society is getting into a 'good college', so if we don't get into a traditionally prestigious college, that might make us feel like we aren't smart as we thought and the one thing we built our identities on is now in question, which creates a lot of doubt and insecurity-- if you think of yourself as the smart kid and suddenly, you get rejected by your top choices, that might make you question how smart you truly are. And if you're not as smart as you thought, what are you? So while the career advice response to not getting into a T20 is correct in a lot of cases and heartfelt, a lot of times imo it doesn't really address the true reason kids are upset about not getting in-- most people who know enough to be on here regularly know you don't need to go to a T20 to be successful, so repeating that doesn't really hit the crux of the reason most people are sad about it. It's an identity issue, not a career prospects one.\n\nJust my 2 cents.",
      "author": "FewElevator4",
      "created": 1616738140,
      "upvotes": 5,
      "replies": {}
    },
    "gs8ibiq": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8ibiq/",
      "text": "as a fellow IB student I can assure you that completing the program means you have not wasted your potential.",
      "author": "waysky20",
      "created": 1616717414,
      "upvotes": 4,
      "replies": {
        "gs98n8h": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs98n8h/",
          "text": "This cause I’m currently on the verge of giving up on the IB diploma",
          "author": "fefetoyo",
          "created": 1616731828,
          "upvotes": 1,
          "replies": {
            "gsce35s": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsce35s/",
              "text": "You’re so close don’t give up! I believe in you, we got a few more weeks till IAs are due you’ve got this",
              "author": "waysky20",
              "created": 1616795569,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gs8sw7z": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8sw7z/",
      "text": "feeling the same way esp bc idk if my rejections reflect me as a student or me as an international seeking aid. it’s easy to blame it on the second reason but frustrating either way. starting to lower what little expectations i even had for my other schools and considering the very real possibility of having to take a gap year",
      "author": "Bronte74",
      "created": 1616722926,
      "upvotes": 2,
      "replies": {}
    },
    "gs98rq1": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs98rq1/",
      "text": "i feel the same way",
      "author": "bi-dragons",
      "created": 1616731908,
      "upvotes": 2,
      "replies": {}
    },
    "gs98z69": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs98z69/",
      "text": "it’s like looking into a mirror!!",
      "author": "stir_fried_apricot",
      "created": 1616732041,
      "upvotes": 2,
      "replies": {}
    },
    "gs99lbf": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs99lbf/",
      "text": "This isnt really related to the main point of the post, but I 100% agree with you on your thoughts about studying in the UK. Theres no flexibility or academic freedom. I got into Kings College London and Bristol, but I want to be able to have a minor and maybe even a double major, so im defintley not going to attend (despite having a really close friend at Kings)",
      "author": "gonijc2001",
      "created": 1616732442,
      "upvotes": 2,
      "replies": {}
    },
    "gs9apya": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9apya/",
      "text": "Holy shit this is literally my life. People always told me I was smart and I could always half ass my way through school and get straight a’s. In high school I completely fucked myself over, and now my grades in some of my classes are beyond salvageable. I’ve probably screwed my chances at a t20, or even any good college. Thanks for sharing, makes me feel a little less disappointed in myself. And hopefully you don’t feel as bad either after seeing how many other people have gone through the same thing.",
      "author": "ender6205",
      "created": 1616733201,
      "upvotes": 2,
      "replies": {
        "gs9o2qu": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9o2qu/",
          "text": "> In high school I completely fucked myself over, and now my grades in some of my classes are beyond salvageable. I’ve probably screwed my chances at a t20, or even any good college.\n\nYou’re still a sophomore, you have lots of time left to change things.\n\nI was in a similar position as you at one point, so I get how you feel. I breezed through middle school and thought I was the shit for effortlessly getting As; turns out middle school was just easy. I was not actually prepared for high school.\n\nNinth grade was rough for me. My extracurriculars were nearly *nonexistent*, and I was pulling mostly low Bs in standard classes (I ended with a flat C in the single honors class I took).\n\nBut it’s never too late to turn things around. I promise I’m not just trying to brag, but I’ve done a lot of things that I never would’ve dreamt of two years ago. \n\nMy freshman grades barred me from a lot of advanced classes as a sophomore, but I still took the hardest classes possible. I joined a bunch of clubs even though I knew I would be at a disadvantage relative to kids who’d been there since 9th grade, and I started reaching out to people for volunteering opportunities. I worked harder than I knew I was capable of for a 4.0 in 10th and 11th grade, and I studied my ass off till I aced every standardized test. When I was getting ready to apply, I spent hours on the websites of all the places I applied to so I could write the best essays possible.\n\nI honestly thought getting into my state college with an acceptance rate in the mid-50s was a stretch at the end of my freshman year, what with my low B average in relatively easy courses, essentially blank activity list, and lack of unique hooks. But I turned things around. About a month ago, I was accepted to one of my top choices—it’s ranked in the low 20s, though it’s within the top 5 for my major.\n\nGlancing over your profile, you’re already *way* ahead of where I was as a sophomore. I took my first two AP classes and started browsing this subreddit as a junior; you took your first two APs as a freshman and you’re posting here as a sophomore. I promise you’ll do alright. \n\nIf *I* can pull through and get into a good school even in an absolute shitstorm of an admissions cycle, you can too. You don’t get to say it’s over till you’re a senior :P",
          "author": "SkunkStriped",
          "created": 1616744480,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gs9cbm5": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9cbm5/",
      "text": "I just woke up to my 3rd rejection and 3rd waitlist and wow I have never resonated with words more than this.\n\nWe need to stay strong OP!",
      "author": "a2k22",
      "created": 1616734328,
      "upvotes": 2,
      "replies": {}
    },
    "gs9d8rs": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9d8rs/",
      "text": "wha.... are you?..... me?.....",
      "author": "Kevin_2112",
      "created": 1616735018,
      "upvotes": 2,
      "replies": {}
    },
    "gs9e40e": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9e40e/",
      "text": "I almost felt someone read my mind bro...",
      "author": "shyxkx",
      "created": 1616735683,
      "upvotes": 2,
      "replies": {}
    },
    "gs9ei7y": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ei7y/",
      "text": "ME",
      "author": "KillerAc1",
      "created": 1616735991,
      "upvotes": 2,
      "replies": {}
    },
    "gs9enlx": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9enlx/",
      "text": "Not sure what you mean by the \"real world\" unless you plan to work in finance or something",
      "author": "buzzbannana",
      "created": 1616736108,
      "upvotes": 2,
      "replies": {}
    },
    "gs9eya0": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9eya0/",
      "text": "same i feel like all of my hard work i put into and all the stress and sleepless nights i had to suffer during my four years of high school are all going down the drain :'(",
      "author": "psshdjndofnsjdkan",
      "created": 1616736344,
      "upvotes": 2,
      "replies": {}
    },
    "gs9f8d1": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9f8d1/",
      "text": "Dude I can relate on all of those things. Man it is so painful when you know your laziness and distractions are depriving you of the life you've always wanted. It even more painful when throughout your life you had achieved so much and in high school you didn't do well because of the reasons you already know. Because of my \"rejections\" I'm starting to wonder if I had ever been \"smart\" before or was it all just an illusion. I feel so unmotivated now.",
      "author": "YellowMango480",
      "created": 1616736569,
      "upvotes": 2,
      "replies": {}
    },
    "gs9ff4u": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ff4u/",
      "text": "just got my fourth rejection and opened to this. absolutely my exact same thoughts thank u :)",
      "author": null,
      "created": 1616736724,
      "upvotes": 2,
      "replies": {}
    },
    "gs9irc2": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9irc2/",
      "text": "Man reading these comments have made me realize how damaging the college admissions process, and by extension this sub, is to teens.",
      "author": null,
      "created": 1616739573,
      "upvotes": 2,
      "replies": {}
    },
    "gs9ly7x": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ly7x/",
      "text": "You don’t know how much this message means to me. I’ve been beating myself up because I haven’t been getting into reach schools and it makes me feel a bit better knowing someone else is also in my position. If we end up at the same college I owe you a high five",
      "author": "Galavant13",
      "created": 1616742470,
      "upvotes": 2,
      "replies": {}
    },
    "gs9p4pd": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9p4pd/",
      "text": "If you think you'll enjoy the education in US more, go for it. Don't look for prestige. Many international students attend many different universities and colleges and do well. Pick a college where you'll be happy and put your best effort. After the first job or the master's degree, no one looks at your UG school. You can do well in any school, prestige be damned!",
      "author": "snbhopali",
      "created": 1616745481,
      "upvotes": 2,
      "replies": {}
    },
    "gs9ynmx": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9ynmx/",
      "text": "You have been sucked into the marketing machine. Find a bunch of schools that have your programs you are interested in, visit them, and feel what fits best in person.  College is what you make of it. 99% of employers know that having a college degree shows that you are able and willing to learn & follow through with tasks enough to complete a 4 year journey.",
      "author": "ihatecats18",
      "created": 1616754713,
      "upvotes": 2,
      "replies": {}
    },
    "gsaa4w1": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsaa4w1/",
      "text": "As a “gifted kid” who got hit with lazy bc they never had to study before high school, and also hit with depression bc of school/home life, I feel you 😔",
      "author": "GruitFummies",
      "created": 1616762768,
      "upvotes": 2,
      "replies": {}
    },
    "gsag3ug": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsag3ug/",
      "text": "Own your actions. You did them for a reason. Learn, live up to your standards, and then get a better understanding for why you made what you're calling mistakes. You now have the opportunity to learn and do better in college.",
      "author": "robmak3",
      "created": 1616765872,
      "upvotes": 2,
      "replies": {}
    },
    "gsagcjz": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsagcjz/",
      "text": "I related to you somewhat. In my family, I'm dubbed as the smart one , and everyone has these high expectations that I'm going to do something big and honestly the expectation feels suffocating. Also, what keeps me down is the fact I have to take the SAT soon and I barely studied. I got a 821 on the PSAT so I'm very nervous that my score won't be high to get into top 20 schools. Don't get me wrong, I'm not stupid and I'm definitely a hard worker but when I get anxiety, it numbs me to the point where I'm afraid to move because of fear of failure. Hopefully things won't always be this way.",
      "author": null,
      "created": 1616765992,
      "upvotes": 2,
      "replies": {}
    },
    "gsajsw2": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsajsw2/",
      "text": "Felt this. Especially since I'm Asian and there is immense pressure for me to exceed and accomplish a lot. Got rejected from my dream school lol",
      "author": "speedy117",
      "created": 1616767620,
      "upvotes": 2,
      "replies": {}
    },
    "gsam1e5": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsam1e5/",
      "text": "i know im intelligent but i just waste my time and potential. i could be a great writer but i just don't ever start. i also don't nurture my own creativity and hunger for knowledge, even though it would be so fucking easy. i hate it but it's hard to change",
      "author": "rootdootmcscoot",
      "created": 1616768637,
      "upvotes": 2,
      "replies": {}
    },
    "gsamg4k": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsamg4k/",
      "text": "Woah are we living the same life 😳",
      "author": "HotShitStassie",
      "created": 1616768824,
      "upvotes": 2,
      "replies": {}
    },
    "gs8uyre": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8uyre/",
      "text": "This is how I feel too but hopefully we'll be alright in the end, I've already been rejected from all my tops haha but more decisions to come so I'll just hope for the best :)  \n\n\nGood luck OP, no college measures your worth and I'm sure you're set out to do great things!",
      "author": "DoughTheBoi",
      "created": 1616724006,
      "upvotes": 3,
      "replies": {}
    },
    "gs92l3t": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs92l3t/",
      "text": "Have your 444th upvote, OP! My situation is kinda same like you. Anyway, hang in there; you got this <3",
      "author": null,
      "created": 1616728158,
      "upvotes": 3,
      "replies": {}
    },
    "gs94azk": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs94azk/",
      "text": "I feel like a waste of potential too :(",
      "author": "clockington",
      "created": 1616729152,
      "upvotes": 2,
      "replies": {}
    },
    "gs8ftd9": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8ftd9/",
      "text": "[removed]",
      "author": null,
      "created": 1616716146,
      "upvotes": -4,
      "replies": {
        "gs8jhfy": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8jhfy/",
          "text": "Ok. \n\nFirst of all. I want to leave the UK and study in the US for interdisciplinarity, not prestige.\n\nSecond of all. To make the return on investment (300k+ vs 30k) worth it, it needs a pretty decent amount of prestige.\n\nI'm not a prestige slut, I think prestige is a meaningless hoop that innocent 15-18 year olds are forced to jump through instead of enjoying their extremely unlikely yet magnificent consciousness.",
          "author": "CapableEngineer8",
          "created": 1616718013,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gsa0agv": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa0agv/",
      "text": "I can't imagine the numbers of kids like me that were left out in smaller schools because they only had one class of students that got to do all the AP classes & all the kids right below them had nothing to do except advanced colouring (world geography) to fill your schedule so you could boost your gpa.\n\nI'm pretty sure I'd have been an engineer & be making bookoo bank right now at spacex, tesla,  or similar if I'd had even one teacher give a damn beyond making sure \"no child was left behind\". That program has crippled an entire generation of people that could have helped prop up murica in this decade of crisis that we've entered, but instead we spent excessive amounts of time making sure the kids that didn't want to be there got to graduate with all Ds or whatever so the schools could have 100% graduation hoorah. . .?\n\nI've seen how other countries don't require education beyond certain levels for certain careers & it baffles me why murica doesn't wanna let kids skip high school so they can go work a fast food frier & spend the rest of their time trying to \"make it big\" on tik tok or whatever. That's what these people are gonna do anyway, so why hurt the \"middle class\" of students that could have excelled in something given the proper motivation or opportunities to try several things before college where trying different things costs you thousands of dollars for classes that potentially could have no academic value to you whatsoever because you decided in the middle of your second year you would have been better off in a completely different major or in a trade school instead.\n\n& how amazing our schools could be if 10, 20, or even 30% of the students were allowed to leave traditional high school after the first year to go to a trade school instead? But that would be \"socialism\" or whatever, so there's no way this idea is ever gonna go anywhere in murica.\n\n🤣",
      "author": null,
      "created": 1616756128,
      "upvotes": 0,
      "replies": {}
    },
    "gs8kgur": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8kgur/",
      "text": "I hate this. Why are people such attention whores on reddit. Maybe you should have studied and got into a t20 school, ofc your gonna be disappointed but its completely your fault dont' come on reddit and expect people to make you feel good the reality is that you did not achieve your goals and that fact is not going to change. Just accept that you fucked up and don't make the same mistake.",
      "author": "Senior_Diamond_1393",
      "created": 1616718520,
      "upvotes": -18,
      "replies": {
        "gs8lloj": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8lloj/",
          "text": "OK snake. You don't know the first thing about me. You don't know how much I did / didn't work. You don't know why I did / didn't do well. You don't know how good my grades were (better than most). You don't know how good my ECs were (unique af).\n\nJust because you were somehow in the position to achieve what you wanted, don't think that you are necessarily more deserving. It was the situation + person that put you where you are (assuming T20 from the condescension), not just the person.\n\nAnd yes. I'm not some sad shit crying in a corner that he fucked up. I'm taking steps to make myself better and not be weighed down by the things that weighed me down before. That doesn't mean I don't have the right to be upset.\n\nMaybe you could make yourself better? Learn not to be an dickhead to random people going through a hard time.",
          "author": "CapableEngineer8",
          "created": 1616719101,
          "upvotes": 14,
          "replies": {
            "gs8n9p2": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8n9p2/",
              "text": "First of all I also got rejected to every ivy and I didn't get into any t20 school. Difference is that I understand that there were better options for the college and I am evaluating my application to see what I could've done better. What makes you so entitled to be mad because you didn't get into a t20, you said you didn't focus on your grades a lot so obviously you didn't deserve it. Understand that millions of kids are applying to these t20 schools and the ones who got in are simply just better.",
              "author": "Senior_Diamond_1393",
              "created": 1616719971,
              "upvotes": -14,
              "replies": {
                "gs8otnc": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8otnc/",
                  "text": "I'm not disputing that their applications were better. Or that the reason I didn't get what I want is external to me. I'm simply grieving and reflecting upon why I didn't live up to my potential (and no, it wasn't a lack of desire to work hard). I don't see what your issue with me putting this post up is- I just want to see if there are people who relate to my situation. I often feel that I am quite alone in feeling this way.",
                  "author": "CapableEngineer8",
                  "created": 1616720787,
                  "upvotes": 8,
                  "replies": {
                    "gs8p9mu": {
                      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8p9mu/",
                      "text": "Just the way you put it makes it seem like you have a god complex and you think you're better than everyone. \"I didn't live up to my potential\" \"Ever since I was a kid people told me how intelligent I was. Always did well in class with minimal effort.\". This isn't some comic book story line where your the main character and something doesn't go your way.",
                      "author": "Senior_Diamond_1393",
                      "created": 1616721026,
                      "upvotes": -14,
                      "replies": {
                        "gs8rsq5": {
                          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs8rsq5/",
                          "text": "Ok now you don’t even have anything logical to attack me with.\n\nI don’t think my post implied a god complex in any way. If you knew me, you would know how much I suffer from low confidence. Those things about doing well in class with minimal effort and being told how intelligent I was are facts - facts that make me upset, not proud. \n\nAlso I called myself lazy and distracted as well, those are internal to me and definitely not arrogant things to say.\n\nDo you have nothing better to do?",
                          "author": "CapableEngineer8",
                          "created": 1616722353,
                          "upvotes": 10,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gs9csib": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9csib/",
          "text": "[deleted]",
          "author": null,
          "created": 1616734673,
          "upvotes": 3,
          "replies": {
            "gsbdgwv": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsbdgwv/",
              "text": "Its just annoying when people think they automatically deserve something highly competitive. If you didn't get in don't blame the admissions process blame yourself.",
              "author": "Senior_Diamond_1393",
              "created": 1616780840,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gs9aun9": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9aun9/",
      "text": "hate GCSEs, all my homies hate GCSEs. glad they are canceled tho\n\nI relate to this a bit too much :( Good luck for your future",
      "author": null,
      "created": 1616733293,
      "upvotes": 1,
      "replies": {}
    },
    "gs9fe7a": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9fe7a/",
      "text": "You're not a waste - you just aren't there yet. I know this sounds trite, but it's impossible to be happy when you compare yourself to others. I was you once. Always the gifted kid, never had to study, perfect ACT, full rides handed out, and then I went to college and shit the bed. I didn't know how to go to make myself go to class, how to study, etc. I loved partying and boys. My avoidance behavior was on point. I crashed and burned - hard. I tried to go back to school a couple times as an adult, and it never got far. I'd knock out a class or two here and there, but I just couldn't get my shit together.\n\n Then I got diagnosed with ADHD and I started seeing a therapist. Highly recommend! They helped me with strategies and coping skills, time management, and overcoming the ridiculous executive dysfunction that has plagued me my entire life. I'm fucking brilliant, but I forget to brush my teeth or put on deodorant almost every day. Once I finally understood myself through therapy and medication, I went back to school and kicked ass. (I mean, I still write papers the night before they're due. Some things never change.) I'm in my 40's and I \\*just\\* graduated with my BSc in a stem field last year. I'm applying to grad school this spring. \n\nA few of my kids are already college grads, and most of my friends have advanced degrees. I had to let go of the notion that getting a bachelor's as an adult was embarrassing, something I should have done at 22, that even in graduating, I was still a failure. I decided I was going to be proud of myself no matter what people thought. Sometimes you have to fake it a little in the beginning, but I hope you don't take 20 years to learn about yourself and love your life. \n\nLife never turns out the way you think it will, but you will have a LOT more chances to do the thing. Hating on yourself for your failures is a waste of energy and only hurts you. You got this.",
      "author": "chickenfightyourmom",
      "created": 1616736704,
      "upvotes": 1,
      "replies": {
        "gs9x0n1": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9x0n1/",
          "text": "I jusy got diagnosed with adhd last week! Not really sure what to make of it...",
          "author": "CapableEngineer8",
          "created": 1616753200,
          "upvotes": 2,
          "replies": {
            "gsc7rze": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsc7rze/",
              "text": "My best suggestion is find a therapist and APRN who work together. Therapist for strategies and talking, and APRN for med management. You'll probably need both, and it's easier when they can work together. There are a lot of tools, tips, and tricks you can do to help manage your symptoms and things you can change in your environment to work WITH your brain instead of against it. Join some forums and groups for ADHD, not just the ones where people are like \"omg that's so me!\" but ones where they really share helpful things. I'm so happy you got a diagnosis early. You have a bright future ahead!",
              "author": "chickenfightyourmom",
              "created": 1616793033,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gs9hk78": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9hk78/",
      "text": "Oof, relatable",
      "author": "wack_af_",
      "created": 1616738521,
      "upvotes": 1,
      "replies": {}
    },
    "gs9hvs3": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9hvs3/",
      "text": "this is exactly me. exactly.",
      "author": "maddiesquesadilla",
      "created": 1616738801,
      "upvotes": 1,
      "replies": {}
    },
    "gs9j93s": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9j93s/",
      "text": "you sound like my high school freshman\n\ntelling her get good grades to keep your options open but dont stress about it\n\nyou are a great person and will do great things",
      "author": "Simple_Collection_77",
      "created": 1616740012,
      "upvotes": 1,
      "replies": {}
    },
    "gs9kb7r": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9kb7r/",
      "text": "I hear you and sympathize with your feelings. It's difficult to receive rejection especially from colleges. When I graduated high school back in 2018, I got rejected from many schools while my peers got accepted into high ranking schools. I had very similar feelings of inadequacy and failure as I felt I was a great student, but now I was unsure of my own worth and worried about how others would view me based on the college I went to. I spent the next few years trying to combat this feeling, holding unfair standards and judgements for myself.\n\nSince then, I've transferred a few times and experienced being at a couple universities. COVID in particular caused me to transfer to a school closer to home. During my educational journey, I've learned a lot about success and happiness. By attending different institutions, I've learned that there are opportunities wherever you go -- all you need is to have determination to continue pursuing your goals. In also watching my old high school classmates, both in prestigious universities and lesser known colleges and CC's (even some who decided college wasn't the right path for them), I've learned that there are many ways to achieve your goals and live a fulfilling life. **Academic achievement does not reflect your worth, and at the end of the day, it doesn't matter what school you go to, but what you** ***do*** **in college.** *You* define your own success, not the branding of the school you go to.\n\nTo anyone reading who also feels this way: Your emotions are valid, and take some time to feel what you are feeling. Appreciate and acknowledge your hard-work -- don't let anonymous admissions officers determine your self-worth and capability. Take a deep breaths; you are not alone in your feelings, and I promise you that things won't always feel this way. Feel free to reach out anytime, and best of luck to you! **You got this!**",
      "author": "gglnoorl",
      "created": 1616740973,
      "upvotes": 1,
      "replies": {}
    },
    "gs9l3u2": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9l3u2/",
      "text": "are you Elon Musk cuz how the hell do you have access to my mind?",
      "author": "aviator_guy",
      "created": 1616741705,
      "upvotes": 1,
      "replies": {}
    },
    "gs9luvb": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9luvb/",
      "text": "Try European universities that have the same structure as US ones? \nExample- Utrecht University in the Netherlands",
      "author": "Nakshaaaa",
      "created": 1616742388,
      "upvotes": 1,
      "replies": {}
    },
    "gs9nmj4": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9nmj4/",
      "text": "Yup I also had these exact thoughts in the shower today. I think it's important for all of us to realize that the potential we feel in ourselves will shine when we get the right opportunity. Whether that be in college, or when you get your first real job, life is what you make of it.",
      "author": "AWV2804",
      "created": 1616744052,
      "upvotes": 1,
      "replies": {}
    },
    "gs9oj43": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9oj43/",
      "text": "I think Op is my alt tbh xd",
      "author": "photon1256",
      "created": 1616744910,
      "upvotes": 1,
      "replies": {}
    },
    "gs9u6ah": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9u6ah/",
      "text": "this hits home",
      "author": "okcool888",
      "created": 1616750448,
      "upvotes": 1,
      "replies": {}
    },
    "gs9vhq0": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9vhq0/",
      "text": "r/aftergifted",
      "author": "FourthDownThrowaway",
      "created": 1616751747,
      "upvotes": 1,
      "replies": {}
    },
    "gs9zxdr": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gs9zxdr/",
      "text": "This might be the wrong sub for this type of encouragement, but the quality of life you can expect to live doesn’t necessarily revolve around the school that you get into. I went to a very average university in Canada and the “prestige” associated with the school was non-existent.\n\nBased on your goals, prestige might not matter. In my case, I started up a business in LA after graduating. Nobody cares where you went to school when you’re self-employed. Wherever you get in, you’ll carve a path that works for you.",
      "author": "TurkeySlurpee666",
      "created": 1616755824,
      "upvotes": 1,
      "replies": {}
    },
    "gsa5f9e": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa5f9e/",
      "text": "Bro you and I are the same person. I’ve gotten rejection after rejection, and I’ve started to wonder where I went wrong. If only I had done this or that. If only.",
      "author": "FieryBlaze21",
      "created": 1616759881,
      "upvotes": 1,
      "replies": {}
    },
    "gsa623n": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa623n/",
      "text": "Basically me, people have always complimented how smart I am. I did amazing in school, always the top of my class. Lazy too. Won crap tons of National and international awards, president of several extracurriculars, and did research too. My dream was to get into an Ivy, and for the first 3 years of my high school experience, it set me up for success... then covid came and right after depression and anxiety. I didn’t do well in my classes averaging B’s for most, C for one and A for a couple. I talked with my teachers about what I’ve been going through in my personal life and shared that info with colleges. After receiving a couple decisions from T50 schools, I’m not optimistic at all for the Ivy decisions. Kinda sucks that everything was going right and then the unexpected happened and killed my dreams. Covid not only hurt my senior year, but it likely impacted where I’d be going for the next four years and potentially the rest of my life.",
      "author": "MakingCake2077",
      "created": 1616760296,
      "upvotes": 1,
      "replies": {}
    },
    "gsa7n7t": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsa7n7t/",
      "text": "I feel like I just read my autobiography",
      "author": "Salt_Procedure_9353",
      "created": 1616761301,
      "upvotes": 1,
      "replies": {}
    },
    "gsaben6": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsaben6/",
      "text": "Didi just find my twin",
      "author": "HahaStoleUrName",
      "created": 1616763469,
      "upvotes": 1,
      "replies": {}
    },
    "gsaedul": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsaedul/",
      "text": "I'm mechanical engineering too, it was definitely a bummer writing off the LAC's. Most of the fundamentals won't change much from school to school though, so you will be fine. Wishing you the best!",
      "author": "The-Turnip",
      "created": 1616765022,
      "upvotes": 1,
      "replies": {
        "gsaekx6": {
          "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsaekx6/",
          "text": "I want to learn some humanities. At my uni in the UK they will completely elimjnate it. They teach us to be engineering stooges.",
          "author": "CapableEngineer8",
          "created": 1616765120,
          "upvotes": 2,
          "replies": {
            "gsaihhj": {
              "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsaihhj/",
              "text": "I feel for you. I didn't apply to any technical institutes (besides MIT) for exactly that reason. \n\nIs there a community college system in the UK? It might be worth taking some humanities courses on the side - just enough to get your mind going. Aside from that, if you can make something in the humanities a hobby, like writing or reading, that's half the battle. Just reading some good books can really open your mind. If there's a quality book club in your area I'd recommend joining",
              "author": "The-Turnip",
              "created": 1616766999,
              "upvotes": 1,
              "replies": {
                "gsaivzg": {
                  "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsaivzg/",
                  "text": "No community college system. For most, no flexibility at all.",
                  "author": "CapableEngineer8",
                  "created": 1616767191,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gsc63sa": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gsc63sa/",
      "text": "Reading it feels like the past year for me . I totally get you mate. I know the feeling when you know you are capable of doing some much more but you end up doing the average stuff",
      "author": "Ok-Fondant-2403",
      "created": 1616792377,
      "upvotes": 1,
      "replies": {}
    },
    "gswuitb": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/gswuitb/",
      "text": "I feel this. As a sophomore. It hurts to see how genuinely amazing people are and you feel like you’ve lied to yourself by thinking your smart all the time. I have no extracurriculars, 3Bs, and an A- average, and I just haven’t been able to bring myself to do anything to improve. I always imagined myself at some prestigious university but I should probably be more realistic. Hopefully I can get into a medical school that carries more weight but idk about darting for Johns Hopkins where I currently stand",
      "author": "SafeBusy8172",
      "created": 1617196961,
      "upvotes": 1,
      "replies": {}
    },
    "ho8k32u": {
      "link": "/r/ApplyingToCollege/comments/mdbokg/upvote_this_if_you_feel_you_let_yourself_down/ho8k32u/",
      "text": "9 months later i'm procrastinating on the eve of finals and ed acceptances and i came to say that i relate to this so painfully hard. my friends all think that i'm going to make it but i know i'm not. my mom and my grandma think that i can get into a t10 even when i know that my work ethic isn't cut out for that. i've been in a state of mental discord for months and emotionally fragile because of that, and on top of that, my grades are finally tanking as i'm struggling with senior year. thank you for putting my feelings into words. i hope things turned out well for you :)",
      "author": "92coups17",
      "created": 1639310180,
      "upvotes": 1,
      "replies": {}
    }
  }
}