{
  "sid": "q4ls3z",
  "link": "/r/ApplyingToCollege/comments/q4ls3z/opinions_on_picking_college_for_environment_v/",
  "title:": "Opinions on picking college for environment v. programs",
  "text": "For the past few months, I was pretty set on James Madison, due to the accelerated masters for teacher certification and its history program. It was my top school choice for becoming a history teacher.\n\nHowever, I also applied to the University of Vermont on a whim, and know they also have a good education program and Teacher Accelerated Masters. It's become my new top choice based entirely on the atmosphere and environment. I want to be in proximity to mountains, a lake, and extreme cold/guaranteed snow, as well as a liberal area. Compared to James Madison, the atmosphere seems like it would be better for me, despite both having similar education quality. \n\nI know the sub has a lot of hardcore T20 people and education only, but what are your thoughts on picking colleges based off atmosphere and the area, as long as education quality doesn't particularly decline?",
  "author": "gouverneurmroosevelt",
  "created": 1633787589,
  "updated": 1634074013,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.84,
  "comments": {
    "hfzdzd9": {
      "link": "/r/ApplyingToCollege/comments/q4ls3z/opinions_on_picking_college_for_environment_v/hfzdzd9/",
      "text": "Tbh I'm kinda in the same dilemma \n\nProbably picking between UMD, UF or UNC for academics, but also would probably die inside if I got into CU Boulder or Clemson and turned them down. \n\nProximity to mountains is paramount",
      "author": "AlpineGecko",
      "created": 1633788268,
      "upvotes": 5,
      "replies": {
        "hg0ipf9": {
          "link": "/r/ApplyingToCollege/comments/q4ls3z/opinions_on_picking_college_for_environment_v/hg0ipf9/",
          "text": "In such cases, my experience is that the financial aid packages (or the total cost of education) will be a decisive factor.  Saving, for example,  $15K/year in UFL which is probably a better program than CU, would be hard to beat. Let alone you can use the $15K to hit mountains and slopes in Fall, Winter, Spring and Summer breaks and still be financially ahead! Good luck!",
          "author": "LoopVariant",
          "created": 1633806751,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hfzh1yk": {
      "link": "/r/ApplyingToCollege/comments/q4ls3z/opinions_on_picking_college_for_environment_v/hfzh1yk/",
      "text": "There are lots of schools that are good for teaching, journalism, physics, mechanical engineering, nursing, etc.  and in many fields the difference in outcome between going to the very best schools and the pretty good schools just isn't that big. It's perfectly fine to value being in the environment you want highly - just be mindful of the costs if that means you are turning down in-state tuition or significant financial aid.\n\nFor teaching in particular, it might also impact where you are looking for your first job -- if you go to JMU it might be easier to find a job in Virginia or the DMV as a whole, where UVM might be better for seeking a job in New England.",
      "author": "BrawnyAcolyte",
      "created": 1633789789,
      "upvotes": 4,
      "replies": {}
    }
  }
}