{
  "sid": "rf32u3",
  "link": "/r/ApplyingToCollege/comments/rf32u3/should_i_attend_college/",
  "title:": "Should I attend college?",
  "text": "So I've been in a dilemma for a while now and its either to attend college or continue working. I graduated 2020 and been working for almost a full year now. I'm currently working within my career choice and getting paid well above minimum wage but it just feels boring. I work at a desk job with no one my age and it's almost depressing in a way. I know attending college just for the experience/social aspect isn't worth the money but I've always liked school in a way, I kinda miss it. So I wouldn't be wasting money just to experience college, I'd leave with a degree (most likely lol). I'm 20 years old right now. If I were to attend college, I would only be 21 so I still have some time to think about this.\n\nTL;DR pros are social experiences and a degree, cons are money struggles.\n\nPros\n\n* Better social life\n* Surrounded by people my age\n* Unique experience\n* In state\n* Money saved up\n* Clubs to join\n* Living in my own space at campus\n* Learn to be more dependable\n* College activities\n* Creating relationships\n* Have a degree to fall back on\n* The campus is fucking awesome\n\nCons\n\n* All the money needed\n* Need to pay off loans\n* Wont live with my parents (they provide a lot, so it's pretty convenient)\n* Have to worry about money while attending\n* Classes and homework\n* Leaving my career job (only temporarily, I'm certain they will rehire me)\n* Most likely need a minimum wage job\n* Stressful nights of studying\n* Big change from how I'm living now, for better or worse",
  "author": "ParaJon",
  "created": 1639357259,
  "updated": 1639514360,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.84,
  "comments": {
    "hobpen6": {
      "link": "/r/ApplyingToCollege/comments/rf32u3/should_i_attend_college/hobpen6/",
      "text": "You don’t want to wake up at 30 and be asking the same questions. If you find yourself constantly thinking about going to school, then you probably should",
      "author": "dalej42",
      "created": 1639359903,
      "upvotes": 9,
      "replies": {}
    },
    "hobxrw7": {
      "link": "/r/ApplyingToCollege/comments/rf32u3/should_i_attend_college/hobxrw7/",
      "text": "I don't have too much to add as a high school senior, but I just wanted to say you might qualify for at least a few scholarships. Oftentimes I find that outside the scholarships organized by non-school affiliated organizations, whatever school one applies to will also have a page dedicated to scholarships they give (in addition to financial aid).",
      "author": "cookiesandsheep",
      "created": 1639363696,
      "upvotes": 2,
      "replies": {}
    },
    "hock7mw": {
      "link": "/r/ApplyingToCollege/comments/rf32u3/should_i_attend_college/hock7mw/",
      "text": "Try going part-time at a community college and see how it goes. You’ll get a taste of the college life, can still live with your parents, won’t have to pay a lot as it’s much cheaper than a 4-year university, and can still work your career job. \n\nIf it goes well, you can see if continuing part-time or going full-time is right for you. Maybe you’ll decide you want to transfer into a four-year university.\n\nYou can make friends and meet people your age without relying on college, although it is a massive help. I wouldn’t choose to set aside a good job and take out loans just for “the college experience.” Think about the financial and professional aspects first and foremost.",
      "author": "OrdinaryEra",
      "created": 1639375357,
      "upvotes": 2,
      "replies": {
        "hodc8eq": {
          "link": "/r/ApplyingToCollege/comments/rf32u3/should_i_attend_college/hodc8eq/",
          "text": "That's an option I'm considering as well. Next year I'm gonna look at attending one or two night classes to test the waters, like you said. Its a tough decision to go head first but I think this option would help me decide fully.",
          "author": "ParaJon",
          "created": 1639397353,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}