{
  "sid": "q74r4a",
  "link": "/r/ApplyingToCollege/comments/q74r4a/extracurriculars_good_for_healthcare/",
  "title:": "extracurriculars good for healthcare",
  "text": "what are some extracurriculars & courses to do in high school if you want to go down the healthcare route?",
  "author": "runningandbooks",
  "created": 1634104439,
  "updated": 1634167118,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hggb11s": {
      "link": "/r/ApplyingToCollege/comments/q74r4a/extracurriculars_good_for_healthcare/hggb11s/",
      "text": "Hospital , nursing home volunteer/internships",
      "author": "kaaaaaaaaaai",
      "created": 1634104712,
      "upvotes": 1,
      "replies": {}
    },
    "hggexax": {
      "link": "/r/ApplyingToCollege/comments/q74r4a/extracurriculars_good_for_healthcare/hggexax/",
      "text": "Free clinic and hospital volunteering/\"internships\"\n\nA lot of the \"internships\" at the free clinics near me are just extremely long medical assistant training with a bunch of volunteering.\n\nYou can do some shadowing, but you can't include these hours on your med school app. They do, however, look good when applying to BS/MD programs and can offer you things to say when interviewing or writing your essay on why you want to pursue healthcare.\n\nColleges also offer summer programs that relate to hospital careers (scribes, assistants, etc), but I recommend looking at the ones focused on research. They look really good on college applications. A guy who did nothing but the summer program at UCSB for 2 years got into Harvard. The UCs offer these.\n\nIf you live in a place with a lot of biopharmaceutical companies, then you can try finding an internship offered there. The one many of my classmates did involved a lot of wet lab experience.\n\nFor me, I'm going into dentistry so I did a lot of shadowing, volunteering, bio/radiography classes (dual enrollment at a CC), research, and dental assistant training.",
      "author": "KANETAI",
      "created": 1634107777,
      "upvotes": 1,
      "replies": {}
    },
    "hghax3g": {
      "link": "/r/ApplyingToCollege/comments/q74r4a/extracurriculars_good_for_healthcare/hghax3g/",
      "text": "In addition to the ones listed — shadowing, research, volunteering, getting a job \n\nI’ve seen future Premed kids do EMS training and work, and scribe training and work",
      "author": "admissionsmom",
      "created": 1634131581,
      "upvotes": 1,
      "replies": {}
    }
  }
}