{
  "sid": "rha87h",
  "link": "/r/ApplyingToCollege/comments/rha87h/wrote_one_sentence_for_the_nyu_essay_still/",
  "title:": "Wrote one sentence for the NYU essay, still waitlisted?",
  "text": "Hi guys, I procrastinated hard (and I mean hard) for my NYU ED application and only finished my personal statement like 10 minutes from the deadline. I had zero time to write my Why NYU essay so I just wrote a single sentence that wasn't even complete. I just wanted to submit the application so my parents would be happy and be done with it. I absolutely do not deserve a place at NYU, my extracurriculars are mid (no leadership roles, switched schools so no long term commitment to clubs), recommendations are from teachers that I barely spoke to and grades started sliding towards the end of junior year. \n\nKnew I would get a rejection letter the moment I hit submit, then today I found out I was waitlisted? Genuinely asking, was this a mistake? I know waitlist isn't too big a deal but do admissions officers excuse a missing essay that easily? I also applied to the Liberal Studies Core program which is probably the least selective, does that factor into it? Or is the waitlist just a soft rejection in this case?\n\nNow I also feel like shit cuz maybe I could've gotten into NYU if I tried on my essay lol. \n\nAlright a sorta off topic question but does anyone know how to find the admissions statistics for NYU? I remember there was an official pdf or something where they reported all the precise amount of applicants they rejected, accepted, etc. \n\nTLDR: wrote one sentence for my Why NYU essay, still got waitlisted and not rejected or deferred, is the waitlist BS?? Do I actually still have a chance of getting in?",
  "author": "IsopodImaginary9171",
  "created": 1639604661,
  "updated": 1639786791,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hophqj6": {
      "link": "/r/ApplyingToCollege/comments/rha87h/wrote_one_sentence_for_the_nyu_essay_still/hophqj6/",
      "text": "Watch everyone write 1 sentence why NYU essays from now on. \n\nIt’s not a mistake. They liked your brevity, you made sense, and maybe you’ll get a spot. Good luck!",
      "author": "WorriedTurnip6458",
      "created": 1639609496,
      "upvotes": 10,
      "replies": {}
    },
    "hophluk": {
      "link": "/r/ApplyingToCollege/comments/rha87h/wrote_one_sentence_for_the_nyu_essay_still/hophluk/",
      "text": "Go to IPEDS for stats from last year: https://nces.ed.gov/ipeds/find-your-college. Search your college and select the \"admissions\" tab. (This is the site where we report official university facts and figures to the Dept of Ed)",
      "author": "jatineze",
      "created": 1639609440,
      "upvotes": 2,
      "replies": {
        "hophq8n": {
          "link": "/r/ApplyingToCollege/comments/rha87h/wrote_one_sentence_for_the_nyu_essay_still/hophq8n/",
          "text": "ayy tysm",
          "author": "IsopodImaginary9171",
          "created": 1639609492,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hovjrpr": {
      "link": "/r/ApplyingToCollege/comments/rha87h/wrote_one_sentence_for_the_nyu_essay_still/hovjrpr/",
      "text": "And this is why the college admissions cycle is a joke.",
      "author": "minionchamp24",
      "created": 1639714873,
      "upvotes": 1,
      "replies": {}
    }
  }
}