{
  "sid": "r027d1",
  "link": "/r/ApplyingToCollege/comments/r027d1/first_quarter_grade_weight/",
  "title:": "First Quarter Grade Weight?",
  "text": "Hi yall! So i EDed Dart and basically i had a really rough first quarter (mental health and familial struggles). not very comfy sharing this info w my AO so that’s beyond the point! but i got 2 As and 6 Bs which is very much an anomaly as evidenced by the rest of my transcript. straight As w/ only 2 B+s (15 APs + 2 college level courses total)\n\nwithin my school first quarter grades only count for 40% of the semester grade. I am also taking 6 APS + multivariable calc so it was a hella rigorous load. also got a 1580 + am a latina entering into mathematics (prob doesn’t matter tho lol). just wondering how much this first quarter dip will weight the rest of my app down/do y’all think im more likely to get deferred?? thank you!",
  "author": "sawdustings",
  "created": 1637633266,
  "updated": 1637687328,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlpvp57": {
      "link": "/r/ApplyingToCollege/comments/r027d1/first_quarter_grade_weight/hlpvp57/",
      "text": "Does your school report quarter grades on your transcript? At least with my school, we had quarter grades, but only the semester grades went on the transcript that got sent to colleges. If your school only formally reports semester grades, than the AOs will never see your first quarter until after your decision comes out.\n\nAlso I'm a student at Dartmouth, feel free to reach out if you have questions",
      "author": "a12435",
      "created": 1637633908,
      "upvotes": 2,
      "replies": {
        "hlpvwcg": {
          "link": "/r/ApplyingToCollege/comments/r027d1/first_quarter_grade_weight/hlpvwcg/",
          "text": "Dart specifically requests first quarter grades regardless! So while my schools transcript only records semester they still asked for the info. Also ahhhh I love Dart and if I get in we should totally connect!!!",
          "author": "sawdustings",
          "created": 1637634001,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}