{
  "sid": "qu3py6",
  "link": "/r/ApplyingToCollege/comments/qu3py6/teachers_havent_written_letters_of/",
  "title:": "Teachers haven't written letters of recommendations yet",
  "text": "So I told my teachers that I made a request on Naviance for letters of recommendations and said that there's no rush and that I will need them in the later days of November, and yes, I emailed them and they responded. Would this be considered the later days of November yet? Once my SAT score come out on the 19th, I wanna send my score (unless it's garbage, then I'm doing test optional) and submit my common app and tell my guidance counselor so she can do her thing. I'm scared though that my teachers have forgotten. I literally requested a recommendation for a new school on Naviance like 10 minutes ago, do they not get emails of my requests? I even asked my counselor for a recommendation like 10 days ago, has she really forgotten that fast? I don't even know how I would know if my counselor wrote me a recommendation or not. I don't want to email them again and sound annoying. My teachers and guidance counselor better not let me down 😭",
  "author": "yoonginoodle",
  "created": 1636936497,
  "updated": 1637180200,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hknrwod": {
      "link": "/r/ApplyingToCollege/comments/qu3py6/teachers_havent_written_letters_of/hknrwod/",
      "text": "Teachers and counselors can upload their reports/letters after you have submitted your applications through an application portal. The application deadline set is for you, not them. Just make sure they get them in sooner than later.",
      "author": "Voldemort57",
      "created": 1636936876,
      "upvotes": 3,
      "replies": {}
    },
    "hkns55d": {
      "link": "/r/ApplyingToCollege/comments/qu3py6/teachers_havent_written_letters_of/hkns55d/",
      "text": "They may be working on it, but they may have also forgotten. If they're doing similar things for a ton of other students, it can be easy to lose track. I know how it feels like you're being annoying and can be apprehensive about emailing them again, but if you've applied/will apply soon and need those letters submitted soon, then send an email and let them know of the deadline.",
      "author": "Blue_Jay89",
      "created": 1636936987,
      "upvotes": 3,
      "replies": {}
    }
  }
}