{
  "sid": "regdpx",
  "link": "/r/ApplyingToCollege/comments/regdpx/how_to_find_medicinerelated_ecs_with_restrictive/",
  "title:": "How to find medicine-related ECs with restrictive parents? 😭",
  "text": "I know that all the seniors are stressing over ED applications rn but hopefully you’ll still see this :)\n\nFor context, my parents are super restrictive—like I-can-only-leave-my-home-for-school type restrictive. I’ve had to drop all of my clubs except one because my parents wouldn’t allow me to stay after-school for anything so I’ve ended up doing a lot of stuff independently outside of school.\n\nThe thing is, I really want to apply for some BSMD programs and these programs really want applicants who have experiences in medicine. \n\nWhile I can get around all of the other things I need, I’m majorly lacking here because my parents won’t let me go volunteer at places (the nearest hospital is like 15 minutes away but they would never drive me and the walk is so long they would never allow it). I only have one long-term care home near me but they aren’t accepting volunteers rn.\n\nI’ve sort of worked it out with my parents where I might be able to get a job within walking distance as long as it’s paid. What are some medical experiences that a pretty normal suburban kid might have around them? I’ve applied to become a pharmacy technician at a local Walgreens (still waiting to hear back) and tried to get a job at the long-term care home but they required me to get CNA certification through their program which was during the school day so I had to decline.\n\nPlz help 😭 I have everything else I need except clinical experience and I genuinely don’t know how I can get that",
  "author": "ApricotQuick8616",
  "created": 1639281187,
  "updated": 1639514952,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "ho7fvov": {
      "link": "/r/ApplyingToCollege/comments/regdpx/how_to_find_medicinerelated_ecs_with_restrictive/ho7fvov/",
      "text": "zooniverse.org has some medical stuff. not the same as clinical experience but just something for an ec",
      "author": "pumpkin2500",
      "created": 1639281511,
      "upvotes": 2,
      "replies": {}
    }
  }
}