{
  "sid": "rfb5rl",
  "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/",
  "title:": "Why would a university defer a student?",
  "text": "Because his stats are not good enough or because of his ECs and essays?",
  "author": "Impossible_Victory34",
  "created": 1639384640,
  "updated": 1639514321,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hocyx4d": {
      "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/hocyx4d/",
      "text": "A whole host of reasons:\n\n1. They like you but you weren’t competitive for the early pool. They want more information (mid-year grades, LOR, etc.) before making a decision. Some schools prefer to deny and only defer a small number of students that apply early (looking at you Stanford and Pomona). \n2. You are a legacy student and they want to preserve the relationship but also want to be able to couch a denial with high RD numbers. \n3. They are assholes who defer everyone who doesn’t get in early (looking at you Georgetown).\n4. They know you are a high stat kid and they want to really know if you love them because they are obsessed with their yield rate and don’t want to be anyone’s second choice (looking at you Northeastern and Case Western).",
      "author": "the-wild-rumpus-star",
      "created": 1639386557,
      "upvotes": 13,
      "replies": {
        "hoe4jxq": {
          "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/hoe4jxq/",
          "text": "Also (ugly but true at a few schools): need blind refers to straight-out acceptances. Some places will be need-blind on acceptances but then be need-aware in who they call up from the deferred list, sometimes even with a phone call to check if the student will accept it. That way they get better yield and acceptance rates while staying \"need blind\" and having more control over their budget.",
          "author": "minimuminfeasibility",
          "created": 1639411409,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hocxhgo": {
      "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/hocxhgo/",
      "text": "maybe its to compare the overall class they're tryna build? so it could be any reason from scores to essays and stuff",
      "author": "9und9zigluftwaffles",
      "created": 1639385344,
      "upvotes": 6,
      "replies": {}
    },
    "hod7kl6": {
      "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/hod7kl6/",
      "text": "iirc in yale’s podcast the AOs talked about how they use deferral as a signal to applicants, telling applicants that their apps are p strong so go ahead and apply to other top-tier schools",
      "author": "starriechu",
      "created": 1639393928,
      "upvotes": 3,
      "replies": {}
    },
    "hocxd9l": {
      "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/hocxd9l/",
      "text": "Remind me in 2 hours lol",
      "author": "KKW2003",
      "created": 1639385247,
      "upvotes": 2,
      "replies": {}
    },
    "hocyi7v": {
      "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/hocyi7v/",
      "text": "Any of the above, a combination of the above, or many other reasons.\n\nFundamentally, because the student did not meet the criteria for early admission.",
      "author": "RichInPitt",
      "created": 1639386208,
      "upvotes": 1,
      "replies": {
        "hocymhy": {
          "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/hocymhy/",
          "text": "What's the difference in the application between a student that got deferred and one that got rejected?",
          "author": "Impossible_Victory34",
          "created": 1639386304,
          "upvotes": 1,
          "replies": {
            "hod2wml": {
              "link": "/r/ApplyingToCollege/comments/rfb5rl/why_would_a_university_defer_a_student/hod2wml/",
              "text": "A student is rejected when a school doesn’t beleive the student fits with the school.\n\nA student is deferred when qualified but not among the top X students that the admisssions office decided to accept during the ED process.  The school doesn’t want to be stuck with over-enrollment, so they limit the acceptances and wait to see the entire applicant pool in RD to see if the deferred student is still among the top Y students they decide to accept in total.",
              "author": "RichInPitt",
              "created": 1639390010,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    }
  }
}