{
  "sid": "q5b6u2",
  "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/",
  "title:": "Current or Former Admissions Officer Advice Needed",
  "text": "Throwaway account, for obvious reasons. \n\nI attend a very competitive high school, and I know that there are peers of mine who have emailed college admissions offices with warnings about other students that contain false and slanderous information (ex. falsely claiming that a student used a racial slur against another person). Someone very close to me, and potentially myself, could be targeted by this behavior and already have one specific person asking some suspicious questions and trying to get us in trouble. I asked my counselor, who said that an admissions office will always just ask the student's counselor for further information if the office gets an accusatory email towards the student. In that case, I'd be completely fine. However, I also know that most applications get fewer than ten minutes for review in admissions offices and have found some speculation on College Confidential that for most applicants, the school won't ask the students counselor and will simply deny them admission if there are any accusations, baseless though they may be. That's what really worries me, the idea that any random person could just lie and ruin everything I've worked for. \n\nCan any current or former admissions officers outline what would happen in an admissions office should this situation arise? Thank you so much for your help.",
  "author": "throwaway081621",
  "created": 1633882779,
  "updated": 1634073342,
  "over_18": false,
  "upvotes": 82,
  "upvote_ratio": 0.99,
  "comments": {
    "hg50crg": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg50crg/",
      "text": "What the fuck. Upvoting and waiting for an answer on this one, but I don't think we'll get it. That's a strange situation, because even getting accused of something makes one look bad-- what did they do that made people hate them?  \n\n\nI dunno. I'm not contributing anything here, but we gotta hold tight.",
      "author": "tripletim",
      "created": 1633893942,
      "upvotes": 34,
      "replies": {
        "hg52kd1": {
          "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg52kd1/",
          "text": "It's an odd situation, yeah. People mostly just envy others' successes or feel like there isn't enough to go around - my friend has multiple international awards and doesn't outwardly take many Ls. He hasn't done anything mean or underhanded, it's just jealousy.",
          "author": "throwaway081621",
          "created": 1633894847,
          "upvotes": 11,
          "replies": {
            "hg57m7a": {
              "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg57m7a/",
              "text": "[deleted]",
              "author": null,
              "created": 1633896843,
              "upvotes": -4,
              "replies": {
                "hg68t7f": {
                  "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg68t7f/",
                  "text": "homie please just dont tell anyone where ur going to college (say local cc cuz financial etc) and don't put it on ur linkedin.\n\n&#x200B;\n\nthe sincere apology is such a shitty idea these days so just don't mention it. coming as someone who wrote 2 of them for high profile influencers (yeah the notes app screenshot is not as genuine as you might think)\n\n&#x200B;\n\nedit: you can get any Instagram account removed if you report it with 2 verified accounts. do what u want with that info",
                  "author": "hahalolxddddd",
                  "created": 1633913602,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg5mzr5": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg5mzr5/",
      "text": ">I attend a very competitive high school, and I know that there are peers of mine who have emailed college admissions offices with warnings about other students that contain false and slanderous information \n\nPeople do this now? This is horrible.\n\nCollege admissions offices can likely blacklist your school entirely if this continues.",
      "author": "Berkeley_Simp",
      "created": 1633903352,
      "upvotes": 25,
      "replies": {}
    },
    "hg5lyzz": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg5lyzz/",
      "text": "did they give the AOs all of your details? (ECs list, first name, middle name, last name, country of residence)? If they didn't, then I don't think the AOs can identify you, as they don't even know your face.   \n\n\nAlso, do AOs really even have a \"blacklist\"? Some list of students to not admit because of unethical stuff they think they did?",
      "author": "Lanky-Beautiful-9247",
      "created": 1633902889,
      "upvotes": 8,
      "replies": {
        "hg5mrke": {
          "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg5mrke/",
          "text": "We go to the same school, so the false-reporter has all of that information (barring specifics of the EC list). I have no idea about the blacklist, trying to avoid ending up on it.",
          "author": "throwaway081621",
          "created": 1633903250,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hg690x1": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg690x1/",
      "text": "from my understanding if they get these types of reports they look at ur whole app under a fine comb and usually you can get fucked for other stuff. for example if someone reported u for saying the n word which u didn't say, they'll check shit like whether you were doing x EC for Y years, etc. make sure ur whole application is honest as fuck",
      "author": "hahalolxddddd",
      "created": 1633913709,
      "upvotes": 3,
      "replies": {}
    },
    "hg5qfi0": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg5qfi0/",
      "text": "I'm so sorry to hear that. :(\n\nI've dealt with this sort of thing a couple times at some of the more ambitious, ritzy LA schools, and my clients and I ended up with different \"solutions\" each time.\n\nThe first time, we just decided to let sleeping dogs/racists/sexists lie, and never heard anything about it. My client wanted to write about it in his personal statement, but I told him that was likely a bad idea (and would offer you the same advice if you're considering doing so). I got no intimations that his results were affected.\n\nThe second time, we mentioned it to the lead counselor at the HS and requested that she put a little note in her counselor recommendation that both acknowledged that this was happening and explicitly denied that my client would ever take part in it. Again, no hints that his results were affected in either direction.\n\nI would recommend going the second route if your counselor is open to it.\n\nAnd to answer your question, you can DEFINITELY NOT be sure that AOs will always ask counselors to verify things like this, even if they do sometimes.\n\nBut don't ever, ever, ever read College Confidential for any reason other than a laugh every now and again. The bad info there outnumbers the good by a lot; it's largely parents simply guessing at stuff.",
      "author": "deportedtwo",
      "created": 1633904898,
      "upvotes": 6,
      "replies": {
        "hg6dyx8": {
          "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg6dyx8/",
          "text": "did you ever witness somebody getting rejected for being on a college's blacklist?",
          "author": "Lanky-Beautiful-9247",
          "created": 1633916101,
          "upvotes": 1,
          "replies": {
            "hg6pqqx": {
              "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg6pqqx/",
              "text": "To answer directly, no, but it's more that \"knowing\" such things is just about impossible. That said, I'm just about as sure as I could be that allegations COULD lead to bad things if they're not addressed in an application directly.\n\nThere just aren't any absolutes with regard to how things like this get handled. I'd love to say that every allegation is investigated deeply, truth comes out, etc., but that's unfortunately not necessarily the case. My recommendation above is more along the lines of just playing things as safely as possible, since nearly any reasonable outcome is at least conceivably possible. By having a counselor LOR head that off at the proverbial pass, a lot of the worst possible results become much less likely.\n\nHope that helps!",
              "author": "deportedtwo",
              "created": 1633922067,
              "upvotes": 1,
              "replies": {
                "hg84y62": {
                  "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg84y62/",
                  "text": "That definitely helps! If I hear anything worse/get concrete evidence of this behavior, I will specifically talk to my counselor and name the person who'd be doing the emailing. I don't really want to ruin this person's life if I can avoid it, so I hope it just fizzles out.",
                  "author": "throwaway081621",
                  "created": 1633958684,
                  "upvotes": 1,
                  "replies": {}
                },
                "hg8miqh": {
                  "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg8miqh/",
                  "text": "I don't think addressing any allegations is a good idea if you don't know whether someone actually complained to the AOs or not. Imagine you make a big deal out of it in your app, and it ends up that there are no allegations? That would be a major red flag. The AOs would know that you're a problem kid.",
                  "author": "Lanky-Beautiful-9247",
                  "created": 1633966676,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg4f4ri": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg4f4ri/",
      "text": "! RemindMe 1 day",
      "author": "KaiwenKHB",
      "created": 1633885191,
      "upvotes": 2,
      "replies": {}
    },
    "hg6c0bj": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg6c0bj/",
      "text": "I heard on some admissions podcast that these are not taken at face value. If they are concerned they will call your counselor. I would talk with your counselor about the situation.",
      "author": "ejkensjskwnsnsks",
      "created": 1633915163,
      "upvotes": 2,
      "replies": {}
    },
    "hg5ztmk": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg5ztmk/",
      "text": "!remindme",
      "author": "TakeTheWs",
      "created": 1633909148,
      "upvotes": 1,
      "replies": {
        "hg5zxxm": {
          "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg5zxxm/",
          "text": "**Defaulted to one day.**\n\nI will be messaging you on [**2021-10-11 23:39:08 UTC**](http://www.wolframalpha.com/input/?i=2021-10-11%2023:39:08%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg5ztmk/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fq5b6u2%2Fcurrent_or_former_admissions_officer_advice_needed%2Fhg5ztmk%2F%5D%0A%0ARemindMe%21%202021-10-11%2023%3A39%3A08%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20q5b6u2)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "author": "RemindMeBot",
          "created": 1633909205,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg6d028": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg6d028/",
      "text": "!remindme 1 day",
      "author": "SamManGaming",
      "created": 1633915630,
      "upvotes": 1,
      "replies": {}
    },
    "hg8357d": {
      "link": "/r/ApplyingToCollege/comments/q5b6u2/current_or_former_admissions_officer_advice_needed/hg8357d/",
      "text": "What type of snakes do you have at your school?!",
      "author": "MRSEASONS",
      "created": 1633957720,
      "upvotes": 1,
      "replies": {}
    }
  }
}