{
  "sid": "qhbbju",
  "link": "/r/ApplyingToCollege/comments/qhbbju/potential_discrepancy_in_a_leadership_role/",
  "title:": "Potential discrepancy in a leadership role",
  "text": "I just realized I told my counselor that I am the vice president of a club while really I am the co-president on his info request form. However, on my application, I accurately wrote that I am the co-president. I'm worried this incorrect title either has ended up in the school report or LOR which have already been submitted, and it's too late to change it on my early applications since those have already been submitted. The sponsor of the club is writing a LOR to some of the EA colleges with the correct title, but not all of them. I'm kind of freaking out about this. Are admissions officers going to think I lied about my position if he said VP?",
  "author": "Light_SwitchMaster",
  "created": 1635383211,
  "updated": 1635456223,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiboqgv": {
      "link": "/r/ApplyingToCollege/comments/qhbbju/potential_discrepancy_in_a_leadership_role/hiboqgv/",
      "text": "I don’t think it’s a big deal. It’s not like you’re lying to make yourself look better because co-president is higher than vice right? If they even notice it, they’ll probably just assume your counselor made a mistake. If it really bothers you, you can email the admissions office of the colleges you’ve already applied to and explain what happened.",
      "author": "DogGrinder",
      "created": 1635383716,
      "upvotes": 1,
      "replies": {
        "hibqpqt": {
          "link": "/r/ApplyingToCollege/comments/qhbbju/potential_discrepancy_in_a_leadership_role/hibqpqt/",
          "text": "Co-president is perceived as higher than vice at my school, but I'm comforted by your unsureness on which is better. Hopefully, the admissions officer will also view them as interchangeable.",
          "author": "Light_SwitchMaster",
          "created": 1635384601,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hic47im": {
      "link": "/r/ApplyingToCollege/comments/qhbbju/potential_discrepancy_in_a_leadership_role/hic47im/",
      "text": "This is no big deal. You’re overthinking it. You’re fine!",
      "author": "jjhoster",
      "created": 1635390744,
      "upvotes": 1,
      "replies": {}
    }
  }
}