{
  "sid": "r5ysng",
  "link": "/r/ApplyingToCollege/comments/r5ysng/i_have_questions_with_regards_to_the_admissions/",
  "title:": "I have questions with regards to the admissions process for those, either currently in the military, or are transitioning from military life upon conclusion of their contract.",
  "text": "Either from experience, or your knowledge and understanding, how does the admission process work for veterans, compared to either a transfer student or a student enrolling to university after their subsequent graduation? Does it depend on your specific branch, as to what the university will accept towards admission(as the United States Air Force is the only branch of service that awards airmen associates degrees in their specific job through the community college of the Air Force(along with allowing you to attain more than one.))? How does the Yellow Ribbon program work, application process wise? Thank you all, and have an amazing rest of your day:)",
  "author": "NRS038",
  "created": 1638310082,
  "updated": 1638479144,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hmq9p5d": {
      "link": "/r/ApplyingToCollege/comments/r5ysng/i_have_questions_with_regards_to_the_admissions/hmq9p5d/",
      "text": "I can’t help you much but you probably are gonna want to post in military subs instead, most people here are high schoolers going directly to college.",
      "author": "uchi-ama-throwaway",
      "created": 1638316356,
      "upvotes": 2,
      "replies": {}
    },
    "hmqcgue": {
      "link": "/r/ApplyingToCollege/comments/r5ysng/i_have_questions_with_regards_to_the_admissions/hmqcgue/",
      "text": "The VA does a pretty good job of explaining how the yellow ribbon benefit process works here: [https://www.va.gov/education/about-gi-bill-benefits/post-9-11/yellow-ribbon-program/#how-do-i-get-this-benefit](https://www.va.gov/education/about-gi-bill-benefits/post-9-11/yellow-ribbon-program/#how-do-i-get-this-benefit) .\n\nYou might want to reach out to groups like  [https://service2school.org/resources/](https://service2school.org/resources/) too - they have resources to help with applying to schools.  A lot of schools will also have dedicated veterans affairs offices that can give you more info too - just google veteran with the college name and you should be able to find some points of contact.",
      "author": "BrawnyAcolyte",
      "created": 1638317599,
      "upvotes": 2,
      "replies": {}
    }
  }
}