{
  "sid": "qc191d",
  "link": "/r/ApplyingToCollege/comments/qc191d/just_found_out_that_my_old_school_indeed_did_not/",
  "title:": "Just found out that my old school indeed did NOT send in my transcripts",
  "text": "So as the title showed, I asked my old school (because I switched schools from the 11th grade) to send in my transcripts to colleges I’m applying to since August. I sent them the whole college list and everything and in September the transcripts was suppose to be sent. However, Umiami is telling me they don’t have any record of nothing being sent. \n\nMiami is my ED school, I tried contacting my old school but I’m not getting through to them. I shouldn’t be so worried because Miami have a extra 2 week deadline after Nov 1 to get everything sent in but my old school takes a longggg time to send in anything about 3 weeks max and they’re not answering and I’m trying to not freak out 😭😭😭😭",
  "author": "shekyy_lopie",
  "created": 1634737581,
  "updated": 1634749586,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhd0zgt": {
      "link": "/r/ApplyingToCollege/comments/qc191d/just_found_out_that_my_old_school_indeed_did_not/hhd0zgt/",
      "text": "Did you not provide your new school with your old transcripts when you transferred?",
      "author": "freeport_aidan",
      "created": 1634738025,
      "upvotes": 1,
      "replies": {
        "hhd58cv": {
          "link": "/r/ApplyingToCollege/comments/qc191d/just_found_out_that_my_old_school_indeed_did_not/hhd58cv/",
          "text": "Unfortunately that’s not how my country does things. I did ask my new school if they do that and they told me, “Every school you’ve attended must deal with that specific transcript and send it in themselves.”",
          "author": "shekyy_lopie",
          "created": 1634739951,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}