{
  "sid": "q9ymcd",
  "link": "/r/ApplyingToCollege/comments/q9ymcd/ed_question/",
  "title:": "ED question",
  "text": "Currently still working on supplementals but my counselor says I have to turn in everything by this upcoming Wednesday before she can turn in my transcript. I understand why she needs to turn in the transcript this early because of so many other students but is it really necessary to turn in my essays before then? She says to turn it in just in case things get lost if they're all turned in on the same time.",
  "author": "JWang03",
  "created": 1634476919,
  "updated": 1634654146,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgzgnwy": {
      "link": "/r/ApplyingToCollege/comments/q9ymcd/ed_question/hgzgnwy/",
      "text": "She's wrong about that. You can submit your app before or after she submits the school documents.\n\nUnless your high school uses Naviance for submission of school docs to Common App (and possibly even if it does), I'm not sure she can tell whether you've submitted yet or not.",
      "author": "elkrange",
      "created": 1634479098,
      "upvotes": 2,
      "replies": {
        "hgziarq": {
          "link": "/r/ApplyingToCollege/comments/q9ymcd/ed_question/hgziarq/",
          "text": "Ya, we use Naviance for school docs. Do you think I should just lie about the fact that I turned in my essay so she can turn in my transcript? If I don't she wouldn't turn it in and I don't want to lose almost 2 weeks of time that I can be working on making my essays better",
          "author": "JWang03",
          "created": 1634479899,
          "upvotes": 1,
          "replies": {
            "hh09kw7": {
              "link": "/r/ApplyingToCollege/comments/q9ymcd/ed_question/hh09kw7/",
              "text": "Thoughout this admissions period, your counselor is one of your BFF's. Keep it that way by not lying. She has more students than you to be concerned about...and most offices ask for apps to be ready at least 10 days before the deadline.",
              "author": "Radiant-Chipmunk-987",
              "created": 1634491839,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}