{
  "sid": "q5q83q",
  "link": "/r/ApplyingToCollege/comments/q5q83q/act_testing_error/",
  "title:": "ACT Testing Error",
  "text": "Hello,\n\nI gave the computer-based ACT test recently but my computer ran into a huge error (Especially during the math part). I lost at least 5-8 minutes because my computer stopped responding and I had to change the computer. I was pretty freaked out afterwards but had only 5 minutes left. \n\n&#x200B;\n\nThe math section was super easy and I'm expecting the scale to be extremely strict for the same reason but because of my issue, I didn't get the chance to go back to 4-5 questions that I had flagged. The test centre told me that they'll report it to ACT but they were very incompetent so I'm not sure if they'll actually do it. \n\nI was wondering if I should report this on my common app Additional Information section or if it will look like i'm making some excuse?\n\n&#x200B;\n\nThanks!",
  "author": "ijustneedeconotes",
  "created": 1633935451,
  "updated": 1634073428,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hg7bk82": {
      "link": "/r/ApplyingToCollege/comments/q5q83q/act_testing_error/hg7bk82/",
      "text": "I wouldn't mention this on the CommonApp... You should've instead contacted the ACT customer service and tried to get a replacement test for free.",
      "author": "prsehgal",
      "created": 1633936159,
      "upvotes": 3,
      "replies": {
        "hg7qrs8": {
          "link": "/r/ApplyingToCollege/comments/q5q83q/act_testing_error/hg7qrs8/",
          "text": "Thanks! I just contacted them. Any idea on how I can push for that free test though?",
          "author": "ijustneedeconotes",
          "created": 1633949626,
          "upvotes": 1,
          "replies": {
            "hg7qwah": {
              "link": "/r/ApplyingToCollege/comments/q5q83q/act_testing_error/hg7qwah/",
              "text": "Try contacting your test center too, and see if they can speed up the process.",
              "author": "prsehgal",
              "created": 1633949729,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hg99cao": {
      "link": "/r/ApplyingToCollege/comments/q5q83q/act_testing_error/hg99cao/",
      "text": "AWWWWW...what a rotten experience. Good Luck with the fee.",
      "author": "Radiant-Chipmunk-987",
      "created": 1633976084,
      "upvotes": 1,
      "replies": {}
    }
  }
}