{
  "sid": "r3kwp1",
  "link": "/r/ApplyingToCollege/comments/r3kwp1/third_times_the_charm_going_to_college_after_2/",
  "title:": "third time's the charm...? Going to college after 2 gap years",
  "text": "In more ways than one I've been a lucky individual. No regret fills me because I haven't stepped on a college campus yet, despite trying each year, because I know I've learned a lot through this detour. I didn't go on a spiritual journey across the globe, I didn't spend these years perfecting a project that neatly ties into my major-of-choice, in fact I've left more confused about what it is I want to study.\n\nThis will be the third time I apply to college. Now I *just* want to go to school.\n\nIt's odd how I feel simultaneously inferior and more self-confident this time around. The universities I was 100% sure I'd get into now feel like reaches. All of them seem impossible. But that's a different story. Now I'm worried that if I get accepted into a school, I'll be treated as a lazy person or as an outsider because I will be older than most of my peers. I'll be turning 20 and that's giving me a bit of a crisis.\n\nI just want to hear about other people who had a similar gap year experience and went to college older than what is expected.",
  "author": "ashymustard",
  "created": 1638041365,
  "updated": 1638205090,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 1.0,
  "comments": {
    "hmddu0t": {
      "link": "/r/ApplyingToCollege/comments/r3kwp1/third_times_the_charm_going_to_college_after_2/hmddu0t/",
      "text": "Man... I feel this pain. Back in elementary school I repeated a grade when my parents sent me back to my home country so I could learn the language (I currently live in the US). I've always been self-conscious of my age especially when I have friends over a year and a half younger than me, but over time it's been getting better. \n\nJust know that nobody actually cares about your age and won't judge you for being older, even in middle/high school, so I'm sure it matters even less in college, especially when there's so many people taking gap years. Nobody will know anyway, and even if they do, they won't, and shouldn't care :) (if they do that's their problem, not yours, and most people aren't like that)\n\nGood luck on your apps!",
      "author": "bruhcantthinkofone",
      "created": 1638080531,
      "upvotes": 3,
      "replies": {}
    },
    "hme7mgh": {
      "link": "/r/ApplyingToCollege/comments/r3kwp1/third_times_the_charm_going_to_college_after_2/hme7mgh/",
      "text": "I can 100% relate to you. I have the same journey as you, and I'm already 20!",
      "author": "Sparklez_Legit",
      "created": 1638103165,
      "upvotes": 1,
      "replies": {}
    }
  }
}