{
  "sid": "ri7l4i",
  "link": "/r/ApplyingToCollege/comments/ri7l4i/recording_the_interview/",
  "title:": "Recording the interview??",
  "text": "Wondering if I'm allowed to record my Zoom college interview? I always totally forget what I said in an interview, so I want to be able to save a video to watch it later and know what I can improve on. I'm not going to show the video to anyone else.\n\nI'm using OBS to screen record and stream on Youtube (private), and the video will automatically be archived. The reason I'm doing a live stream instead of just a video is so that I could maybe add some comments in the live chat replay or something, I don't know. Or should I just record a regular video instead of stream?\n\nOn Columbia's interview policy, it says, \"Interviews must not be recorded in any way, either by the interviewer or the applicant.\" But the school I'm interviewing tomorrow is not Columbia, so I don't know if there's a policy? Sorry if this all seems so extra lol",
  "author": "sia-later-ally",
  "created": 1639710768,
  "updated": 1639786078,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hovo2dd": {
      "link": "/r/ApplyingToCollege/comments/ri7l4i/recording_the_interview/hovo2dd/",
      "text": "If your are located in a [two-party-consent state,](https://recordinglaw.com/party-two-party-consent-states/) it is illegal to record a conversation without the other party knowing.\n\nIf you're in a one-party-consent state, then it's just weird and creepy.\n\nIf I found a candidate was recording my interview of them, without telling me, they'd be done.",
      "author": "RichInPitt",
      "created": 1639717019,
      "upvotes": 3,
      "replies": {
        "hovq3p8": {
          "link": "/r/ApplyingToCollege/comments/ri7l4i/recording_the_interview/hovq3p8/",
          "text": "welp I'm in a two-party consent state, didn't know it's illegal for a nonpublic video\n\nI guess it's not worth the risk anyway, thanks for the advice!",
          "author": "sia-later-ally",
          "created": 1639718135,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hovj038": {
      "link": "/r/ApplyingToCollege/comments/ri7l4i/recording_the_interview/hovj038/",
      "text": "If you're not planning to show them to anyone else, then I don't think it should be a problem.",
      "author": "prsehgal",
      "created": 1639714511,
      "upvotes": 2,
      "replies": {
        "hovl5sb": {
          "link": "/r/ApplyingToCollege/comments/ri7l4i/recording_the_interview/hovl5sb/",
          "text": "Ok, thanks!",
          "author": "sia-later-ally",
          "created": 1639715545,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}