{
  "sid": "r5ghvt",
  "link": "/r/ApplyingToCollege/comments/r5ghvt/please_help/",
  "title:": "Please help",
  "text": " My counselor today told me that in the \"School Report\" section, she uploaded 4 transcripts: 9th, 10th, 11th and 12th Mid-term. She uploaded and submitted.  \nShe, then, moved forward and saw the \"Mid-year report\" section, but she had already submitted it in the School report section. Now she can't edit it.  \nWhat do we do? Like, is it ok to submit the Mid-Year report in the \"Transcript\" section of School report because it asked for the current or most recent Transcript.  \nIf that's how it's supposed to be, then why is there a mid-year section?",
  "author": "AkhronusT",
  "created": 1638252489,
  "updated": 1638479347,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hmo28b4": {
      "link": "/r/ApplyingToCollege/comments/r5ghvt/please_help/hmo28b4/",
      "text": "It's alright if she has submitted the mid-year grades on the school report section. You should also request her to only upload the mid year grades in the mid-year report section as well.",
      "author": "sparshgup",
      "created": 1638284118,
      "upvotes": 2,
      "replies": {
        "hmo68j1": {
          "link": "/r/ApplyingToCollege/comments/r5ghvt/please_help/hmo68j1/",
          "text": "She did. Thanks a lot.",
          "author": "AkhronusT",
          "created": 1638285862,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmmyna3": {
      "link": "/r/ApplyingToCollege/comments/r5ghvt/please_help/hmmyna3/",
      "text": "This doesn’t sound like a big deal to me.  I wouldn’t worry about it.  I think it is ok that she submitted the current “Mid-year report” in the Transcript section.  The admissions officers will easily figure that out.\n\nI’ve read a lot more troubling errors on here recently … like the poor person who applied ED to Dartmouth and they claim that on their “peer reference” evaluation, their friend just typed “balls” and submitted it.  I think you are fine.",
      "author": "ChancellorGH",
      "created": 1638256875,
      "upvotes": 1,
      "replies": {}
    }
  }
}