{
  "sid": "q5r4u7",
  "link": "/r/ApplyingToCollege/comments/q5r4u7/how_to_enjoy_my_senior_year/",
  "title:": "How to enjoy my senior year?",
  "text": "How do you guys manage to balance your college apps with academics and your personal life? I keep reading about how senior year is supposed to be your best year of high school and it just feels like the complete opposite of what I'm experiencing.\n\nI signed up for an honors program that does dual enrollment at a nearby university so I've hardly had any free time outside of studying and doing homework. I'm also retaking a course which I got a bad  mark in last year, which, coupled with extracurriculars and uni/scholarship app essays, leaves me with barely any free time to do what I want to do. Ever since the school year started, I've barely had any sleep and feel terrible every day; I haven't had time to hangout with friends or do practically anything I enjoy. The one time I tried getting up early in the morning to go to the gym before class, I had to go to the washroom to puke in the middle of class and passed out on a bench while waiting for a ride home. I've already uninstalled every single video game I have and at most watch 1 or 2 episodes of anime per day.\n\n&#x200B;\n\nIs senior year really supposed to be enjoyable? IDK if I'm doing something wrong or if it gets later on, but ever since the school year has started, I've had the most miserable month of my life and don't see how anyone could possibly find this to be \"the best year of high school\".",
  "author": "throwawaycccj",
  "created": 1633939786,
  "updated": 1634073284,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hg7kz30": {
      "link": "/r/ApplyingToCollege/comments/q5r4u7/how_to_enjoy_my_senior_year/hg7kz30/",
      "text": "Nice of you to assume we are enjoying even a little bit",
      "author": "dabkarlo",
      "created": 1633944637,
      "upvotes": 9,
      "replies": {}
    },
    "hg8fn5r": {
      "link": "/r/ApplyingToCollege/comments/q5r4u7/how_to_enjoy_my_senior_year/hg8fn5r/",
      "text": "I feel like they're  talking more about 'Senior Year after January 1'  For my oldest kid, it was 100% like that, after all apps were in.  And then it continued on for 4 more years of college.  Definitely worth the pain and agony you're going through these next couple of months!",
      "author": "the3twins",
      "created": 1633963714,
      "upvotes": 6,
      "replies": {}
    },
    "hg812e4": {
      "link": "/r/ApplyingToCollege/comments/q5r4u7/how_to_enjoy_my_senior_year/hg812e4/",
      "text": "Clear up time to do things you enjoy. That may mean taking a less rigorous course load and/or applying to fewer colleges.",
      "author": "jayphoward",
      "created": 1633956576,
      "upvotes": 2,
      "replies": {}
    }
  }
}