{
  "sid": "r3x16f",
  "link": "/r/ApplyingToCollege/comments/r3x16f/what_do_you_think_is_a_better_topic_for_uc_piq_8/",
  "title:": "what do you think is a better topic for UC PIQ 8?",
  "text": "i came up with two things (pretty much it’s asking what else aside from what u mentioned in ur app makes u stand out for UC): \n\nthe first is that i like to self-study Japanese on my own but i live in a rural town where no one speaks these languages and there’s no in person classes so going to a UC where it’s more diverse and likely to have folks who speak this language would probably enrich my language learning skills and practice speaking. (i briefly mentioned self-studying japanese in an EC but i didn’t go too in depth, idk if i should add the self-study as a whole other EC)\n\nthe second is that i live in the middle of nowhere with run-down roads and i love skateboarding so it’s really hard to practice unless i’m near my school campus. i made my first real friendships thru skating and i’m excited to see where it takes me. so going to a UC would allow me to network with a larger skate community and have more skate area to pursue something i genuinely love. (i didn’t mention this in my app at all yet).",
  "author": "glossyducky",
  "created": 1638078109,
  "updated": 1638205022,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hmdclxc": {
      "link": "/r/ApplyingToCollege/comments/r3x16f/what_do_you_think_is_a_better_topic_for_uc_piq_8/hmdclxc/",
      "text": "If you already talked about academics in another piq or if its evident with your grades...I'd say go for the second topic. It seems uncommon, which will make you stand out, and because you seem really passionate about it, it will show in your writing. The UCs love passion! However, I think this topic might fit into the creativity piq or greatest talent (correct me if I'm wrong and the piq you want to write will fit in neither)",
      "author": "Chemical-Flatworm487",
      "created": 1638079724,
      "upvotes": 9,
      "replies": {
        "hmdd9d3": {
          "link": "/r/ApplyingToCollege/comments/r3x16f/what_do_you_think_is_a_better_topic_for_uc_piq_8/hmdd9d3/",
          "text": "for the creativity one i already wrote about creating resin art, and tbh im not the best at skating yet do idk if thats rlly my greatest talent ;-;",
          "author": "glossyducky",
          "created": 1638080153,
          "upvotes": 1,
          "replies": {
            "hmddzaz": {
              "link": "/r/ApplyingToCollege/comments/r3x16f/what_do_you_think_is_a_better_topic_for_uc_piq_8/hmddzaz/",
              "text": "Fair enough! Piq 8 seems fine then",
              "author": "Chemical-Flatworm487",
              "created": 1638080629,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmdbpb8": {
      "link": "/r/ApplyingToCollege/comments/r3x16f/what_do_you_think_is_a_better_topic_for_uc_piq_8/hmdbpb8/",
      "text": "In my opinion: I say go for the first one based on topic",
      "author": "Time_Astronaut_1153",
      "created": 1638079149,
      "upvotes": 2,
      "replies": {}
    }
  }
}