{
  "sid": "qz143a",
  "link": "/r/ApplyingToCollege/comments/qz143a/please_help_ftc_or_physics_olympiads_for_mit/",
  "title:": "Please help. FTC or Physics Olympiads for MIT.",
  "text": "Hi. I am a international student from Turkey. I am a 9th grader btw. My school offers a lot of activities and we can choose only one. I want to study engineering in college but problem is FTC is not in Turkey officialy. So we won't be attending the tournament this year but will attend next year. So should i choose physics olympiad and hope to get into the national team or ftc (I'am kinda good at physics.)",
  "author": "firavunfaresi0",
  "created": 1637519331,
  "updated": 1637687952,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hljn2m2": {
      "link": "/r/ApplyingToCollege/comments/qz143a/please_help_ftc_or_physics_olympiads_for_mit/hljn2m2/",
      "text": "Why can’t you do both? Why can you only choose one school activity? And even so, can’t you do FTC at school and just study for the physics olympiad independently to make the national team? If making the physics olympiad is like the math olympiad, it’s certainly something you can study for independently and pass the tests to make the team.",
      "author": "rainingsiberiancats",
      "created": 1637522649,
      "upvotes": 1,
      "replies": {
        "hljt1va": {
          "link": "/r/ApplyingToCollege/comments/qz143a/please_help_ftc_or_physics_olympiads_for_mit/hljt1va/",
          "text": "Because they are counted as clubs and there are only one club lesson",
          "author": "firavunfaresi0",
          "created": 1637525028,
          "upvotes": 1,
          "replies": {
            "hljvjpx": {
              "link": "/r/ApplyingToCollege/comments/qz143a/please_help_ftc_or_physics_olympiads_for_mit/hljvjpx/",
              "text": "Ok, but can’t you still participate in things like the physics olympiad independently since that’s not a school club? Top US colleges will expect more than one activity anyway, so you’ll have to do some things independently outside of your high school",
              "author": "rainingsiberiancats",
              "created": 1637526055,
              "upvotes": 1,
              "replies": {
                "hljy2ee": {
                  "link": "/r/ApplyingToCollege/comments/qz143a/please_help_ftc_or_physics_olympiads_for_mit/hljy2ee/",
                  "text": "Yeah i guess but Turkey's physics olympiad is very hard so don't i need the lessons",
                  "author": "firavunfaresi0",
                  "created": 1637527067,
                  "upvotes": 1,
                  "replies": {
                    "hlk1224": {
                      "link": "/r/ApplyingToCollege/comments/qz143a/please_help_ftc_or_physics_olympiads_for_mit/hlk1224/",
                      "text": "The international olympiads are meant to be very hard, no matter what country you come from. Generally, to make the national team for those, just lessons aren’t enough anyway, and certainly nothing a high school could provide. The most successful people I’ve seen for the international math olympiad (which is even more competitive than physics) were people who genuinely loved the subject and freely spent hours of their day on practicing and learning those problems and concepts. I know a guy who was a two time IMO bronze medalist and I know a guy who was a silver and gold medalist. They both got there completely by self studying and being deeply involved in competitive math for years. My younger brother self studies math without any lessons and passed the primary exam for the IMO the summer after freshman year in Korea, a very competitive country. All this to say, self studying to pass the exams to get on a national olympiad team is more than possible. But it is largely up to your passion and resolve, which is what makes it so difficult.",
                      "author": "rainingsiberiancats",
                      "created": 1637528256,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}