{
  "sid": "rfvn0q",
  "link": "/r/ApplyingToCollege/comments/rfvn0q/applying_to_college_as_a_homeschooler/",
  "title:": "applying to college as a homeschooler",
  "text": "I'm 15, and I would like to eventually become a doctor. I would very much like to go to Northwestern uni in Chicago, but it has a very low acceptance rate.\n\nMy question is basically what I need to do to help me be taken seriously when I submit my application, taking into account that I'm homeschooled.\n\nI have done many extracurriculars - I've done ballet for 6yrs, violin for 7, I did martial arts for 7 years and was in choir for \\~4 years. I also used to volunteer at the local food bank, but that was when I was very young so it probably doesn't count.\n\nI will be taking the SAT and maybe the ACT but I'm not sure.\n\nI'm pretty worried about this, so any comments would be very much appreciated. Thank you!\n\nNote: I will obviously be applying to multiple schools, but this is my top choice.",
  "author": null,
  "created": 1639445234,
  "updated": 1639513778,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hogdtmu": {
      "link": "/r/ApplyingToCollege/comments/rfvn0q/applying_to_college_as_a_homeschooler/hogdtmu/",
      "text": "Subject tests don’t exist.",
      "author": "yshsclg",
      "created": 1639445616,
      "upvotes": 5,
      "replies": {
        "hoge71r": {
          "link": "/r/ApplyingToCollege/comments/rfvn0q/applying_to_college_as_a_homeschooler/hoge71r/",
          "text": "lol I forgot about that. I'll edit it.",
          "author": null,
          "created": 1639445788,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hogxu6u": {
      "link": "/r/ApplyingToCollege/comments/rfvn0q/applying_to_college_as_a_homeschooler/hogxu6u/",
      "text": "forgot the exact wording but its a little harder if you are homeschooled you’d need to prove you have communication skills or something like that\n\nperhaps community involvement",
      "author": "WoWiTzAtHrOwAway",
      "created": 1639454780,
      "upvotes": 3,
      "replies": {}
    },
    "hoh355y": {
      "link": "/r/ApplyingToCollege/comments/rfvn0q/applying_to_college_as_a_homeschooler/hoh355y/",
      "text": "I’m a homeschooled student too, and I’ve considered applying pre-med. I haven’t been through the college application process yet (class of 2023) but I’ve done literally so much research. From everything I’ve found: \n\n- Letters of Recommendation are really important at most schools, make sure you have a coach or teacher to write one \n\n- Take APs and take AP tests. Shows you can do the same work as kids in public school \n\n- Again for standardized testing, the SAT and ACT. Get good scores and prioritize taking one as a homeschooler, don’t go test optional \n\n- Schools compare your ec’s with the opportunities that were available to you. With what you put here, it sounds like you’re already doing well with ECs though haha \n\n- Dual enrollment and lab hours. Lab hours aren’t talked about a lot, but are required at most colleges. Taking classes at a local college will count towards lab hours. Also dual enrollment teachers are good for letters of recommendation\n\nGood luck! You’ve got this. It’s less impossible than it seems.",
      "author": "XToralesX",
      "created": 1639457452,
      "upvotes": 2,
      "replies": {}
    }
  }
}