{
  "sid": "q48x8y",
  "link": "/r/ApplyingToCollege/comments/q48x8y/big_family_application_fee_waiver_goldmine_nacac/",
  "title:": "Big Family? Application Fee Waiver Goldmine: NACAC",
  "text": "I come from a big family: 6 total people. 4 students, which includes me. \n\nTo take this a step forward, 2 of my siblings are the in the same grade as me and, as a result, my family is sending a 3 kids to college at the same time. My other brother (the 4th student) is in the grade below is, so yeah…\n\nTo take this a step even further, we all take a lot of APs. This year, combined, we have a total of 19 exams. Let’s take a look at how much APs have/will cost us throughout high school (and to clarify, I’m not saying APs are bad and I recognize some of this money will help long-term with college credits):\n\nSophomore Year: $432\n\nJunior: $981\n\nSenior: $1,824\n\nTotal: $3,237\n\nWhen you add my other brother’s senior year, it could cost my family anywhere from $3.5k-$3.8k.\n\nRemember, $1,824 just THIS year for just APs. Tack on score sends, CSS profile fees, application fees. \n\nThat’s a LOT of money. We don’t qualify for like homelessness or like the free and reduced lunch and all that kind of stuff yet we still can’t afford the aforementioned expenses.\n\nSo, how can you defray the astronomically high costs of high school and college admissions?\n\nWell, try NACAC, which stands for the National Association for College Admission Counseling.\n\nAs long as you can get a supporting statement from a financial aid officer, community leader, or a *school counselor*, a LOT of colleges will accept this fee waivers.\n\nMost of you guys, here on A2C, have a guidance/school counselor who can sign a NACAC form. Call each college on your list and ask how they want to receive the NACAC fee waiver form \n\nThe ones on my list want my counselor to email a digital version of the signed form. Yours might want the form mailed physically or faxed. You just need check each individual college’s rules.\n\nMake sure to talk to your counselor if you’re in situation like me and that could save you hundreds if not thousands of dollars!!",
  "author": "Classical_Music26",
  "created": 1633733827,
  "updated": 1634074175,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hfwxpff": {
      "link": "/r/ApplyingToCollege/comments/q48x8y/big_family_application_fee_waiver_goldmine_nacac/hfwxpff/",
      "text": "WOW! just wow! That's a huge financial obligation for any family. I'm so glad your family was able to take advantage of the options out there. I'd be very curious about all four of you and your future choices! , wishing all six the best of luck...this post will assist many students!",
      "author": "Radiant-Chipmunk-987",
      "created": 1633734459,
      "upvotes": 3,
      "replies": {}
    }
  }
}