{
  "sid": "qz3x59",
  "link": "/r/ApplyingToCollege/comments/qz3x59/is_there_any_way_to_apply_to_harvard_without_my/",
  "title:": "Is there any way to apply to Harvard without my school knowing? (international)",
  "text": "So I'm from a  very small town in Ontario, Canada and I've always wanted to apply to Harvard. Problem is, no one from my high school has ever even applied to a US school, much less an Ivy League. I've looked at the application and it seems like they contact your guidance counsellor? And you also need some sort of teacher recommendations, I believe. But I would honestly much much prefer if my school (guidance counsellor and teachers) did not know I am applying to Harvard. It's definitely a long shot and I know that, but I know I will regret not at least trying. But I feel super embarrassed about it and I'm worried my guidance counsellor and teachers will think that I think super highly of myself or something.. idk..\n\nSo yeah... is there any possible way for me to apply to Harvard without my school knowing I'm applying to Harvard? I know they need transcripts and stuff but for applying out-of-province you just put in your OUAC code. For applying in Ontario, (as far as I'm aware) your school does not know what exact schools you apply to.\n\nThanks!",
  "author": "harvarddreamthrwy",
  "created": 1637527280,
  "updated": 1637687830,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hlknhm6": {
      "link": "/r/ApplyingToCollege/comments/qz3x59/is_there_any_way_to_apply_to_harvard_without_my/hlknhm6/",
      "text": "No. Without transcripts, a school profile, teacher recommendations, and everything else that comes from your school, you cannot apply to harvard\n\nhttps://college.harvard.edu/admissions/apply/first-year-applicants",
      "author": "freeport_aidan",
      "created": 1637537863,
      "upvotes": 10,
      "replies": {}
    },
    "hlknkbr": {
      "link": "/r/ApplyingToCollege/comments/qz3x59/is_there_any_way_to_apply_to_harvard_without_my/hlknkbr/",
      "text": "No, you cannot apply without the recommendations.\n\n(Be aware that acceptance rates for internationals at top US schools tend to be around half the overall rate. For Harvard, that means less than 2% of international applicants are accepted. However, there are lots of great schools that are not Harvard.)",
      "author": "elkrange",
      "created": 1637537897,
      "upvotes": 3,
      "replies": {}
    },
    "hlknj4p": {
      "link": "/r/ApplyingToCollege/comments/qz3x59/is_there_any_way_to_apply_to_harvard_without_my/hlknj4p/",
      "text": "Not sure if it's still the case, but the counselor and teachers used to get a notification every time you assign their recommendations to a new school... But that shouldn't matter - if you want to apply, go ahead and apply.",
      "author": "prsehgal",
      "created": 1637537882,
      "upvotes": 3,
      "replies": {}
    },
    "hll8kju": {
      "link": "/r/ApplyingToCollege/comments/qz3x59/is_there_any_way_to_apply_to_harvard_without_my/hll8kju/",
      "text": "you can’t apply with those things BUT i’m not sure if this is 100% true but i’m pretty sure the teachers only see what’s on your common app. so i would just add some safeties to your common app when you ask them to submit recommendations and transcripts but once they submit it, you can add harvard to that list on the common app. once you do that, you can add them to harvard without them knowing (unless they check for some reason, which idk why they would). i hope that makes sense!",
      "author": "Worried_Scallion789",
      "created": 1637547643,
      "upvotes": 1,
      "replies": {}
    },
    "hllx7tg": {
      "link": "/r/ApplyingToCollege/comments/qz3x59/is_there_any_way_to_apply_to_harvard_without_my/hllx7tg/",
      "text": "I have a solution \n\nMake your common app account, fill out all your details in the profile. \n\nNow apply to a random college without an application fee. You will need to submit your LORs and Transcripts for that college. Tell your school counselor that you need them for that college, and invite them on your common app. Now, once they submit the LORs and Transcripts, they don't need to submit it again for a different university. \n\nSo, you can now proceed to submit your Harvard application, and your LORs and Transcript will automatically be sent to them :)",
      "author": "normal123445",
      "created": 1637560681,
      "upvotes": 1,
      "replies": {
        "hlmr6k2": {
          "link": "/r/ApplyingToCollege/comments/qz3x59/is_there_any_way_to_apply_to_harvard_without_my/hlmr6k2/",
          "text": "I thought the LORs had to be re-uploaded for different colleges it says so on my common app account (Please correct me if I'm wrong)",
          "author": "justastudent-vibing",
          "created": 1637584472,
          "upvotes": 1,
          "replies": {
            "hlmrv57": {
              "link": "/r/ApplyingToCollege/comments/qz3x59/is_there_any_way_to_apply_to_harvard_without_my/hlmrv57/",
              "text": "Basically, your Recommendors will submit the LOR to common app via their invite. Once they do, the status is updated and it says that the LOR is 'submitted'\n\nNow you have to send your application, and when you do so, you can choose which LOR(s) to submit to the college",
              "author": "normal123445",
              "created": 1637584905,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}