{
  "sid": "riaffy",
  "link": "/r/ApplyingToCollege/comments/riaffy/what_could_i_have_done_differently_dealing_with/",
  "title:": "What Could I Have Done Differently? Dealing With Rejection and Self-Loathing",
  "text": "There's a study I read a while back, I can't find it now, but the summary is this:\n\nThe authors split a group of professors into two rooms. They then gave each group the same collection of student papers to determine if they were worthy of publication. The professors deliberated, and eventually, both groups sorted the group into two piles - qualified and unqualified. The results of the groups' decisions were then compared\n\nThe probability of a paper being selected as \"qualified\" across both groups? Barely over 50%. Essentially, random chance. Paper \"quality,\" however you could possibly choose to measure it, had no bearing on the decisions of those assigned with the task of ranking them, although there were no people more \"qualified\" for the job.\n\nWhich brings me to today, my deferral, and the nagging question I'm sure so many of us have: **What could I have possibly done differently to change this decision?**\n\nFirst, ask yourself this - why is it so rare for a single student to be admitted to *all* the prestigious colleges they apply to? If they're good enough one of HYPSM, certainly they're good for all of them. And yet these across-the-board acceptances are extraordinarily uncommon. Why?\n\nThe answer is because, just like the professors grading papers, Admissions officers are incapable of consistently ranking applicants well, because it is an impossible task. And despite what they and the admissions consultants are paid to tell you, everybody knows that once an applicant passes a certain \"competitive threshold,\" your decision rests upon two factors: random chance and bullshit \"hooks\" based on college connections, big donations, or *[redacted]*. \n\nGiven this, there is one truth that we all have to accept. This truth is painful, especially so because it tears down the facade of meritocracy that students and colleges alike would prefer to maintain. But nevertheless, I hope it will help you find some sense of peace after tonight's bloodbath.\n\nThe truth is that there is nothing you could have done.",
  "author": "Entity001",
  "created": 1639720212,
  "updated": 1639785540,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.94,
  "comments": {}
}