{
  "sid": "rfnc3g",
  "link": "/r/ApplyingToCollege/comments/rfnc3g/goodbye/",
  "title:": "Goodbye",
  "text": "My parents don't want me to go to college and my school won't let me apply. \n\nGuess I really won't be going to college then. \n\nIt's been fun being on this sub for a while, thanks to everyone here for helping out.",
  "author": "Top_Coast_9481",
  "created": 1639422394,
  "updated": 1639513711,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.93,
  "comments": {
    "hoex7x5": {
      "link": "/r/ApplyingToCollege/comments/rfnc3g/goodbye/hoex7x5/",
      "text": "Once you're a legal adult you can do whatever the hell you want, if you have the financial means.  Don't rule it out just yet.",
      "author": "jayphoward",
      "created": 1639422777,
      "upvotes": 77,
      "replies": {}
    },
    "hof0v4s": {
      "link": "/r/ApplyingToCollege/comments/rfnc3g/goodbye/hof0v4s/",
      "text": "There's a lot of options out there. Fight for your dreams whatever they might be. Maybe it won't be today that you can go to college, but if that is really what you want, don't give up and soon you'll be a legal adult to do whatever the f\\*\\*k you want.\n\nAlso, if you apply abroad most universities won't require a counselor rec, so with an official transcript you will have just about everything you need for applications. Some universities even have great scholarship and financial aid programs.\n\nBest of luck in whatever you pursue in life, and don't let anyone else but yourself dictate what your life is going to look like.",
      "author": "Lirianne123",
      "created": 1639424244,
      "upvotes": 34,
      "replies": {}
    },
    "hof0ixd": {
      "link": "/r/ApplyingToCollege/comments/rfnc3g/goodbye/hof0ixd/",
      "text": "wait till ur an adult. get a job. apply to college and have fun :) don't worry. everything happens for a reason!!!",
      "author": "Ancient_Ad_3804",
      "created": 1639424108,
      "upvotes": 17,
      "replies": {}
    },
    "hofx8u5": {
      "link": "/r/ApplyingToCollege/comments/rfnc3g/goodbye/hofx8u5/",
      "text": ">My parents don’t want me to go to college and my school won’t let me apply.\n\nWhy?",
      "author": "thenewredditguy99",
      "created": 1639437686,
      "upvotes": 10,
      "replies": {}
    },
    "hog4i9j": {
      "link": "/r/ApplyingToCollege/comments/rfnc3g/goodbye/hog4i9j/",
      "text": "Maybe try community college or a uni in continental Europe? Both are relatively cheap and can often be done without parental or school approval",
      "author": "Stq1616",
      "created": 1639441291,
      "upvotes": 6,
      "replies": {}
    }
  }
}