{
  "sid": "rhfk51",
  "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/",
  "title:": "Searching/applying to schools in the UK",
  "text": "So I'm currently a junior from NJ and I really want to go to school in the UK but I don't know what to look for/where to look. Also I feel like its harder to get more info about the school. Like, I want to know about the people at the schools, the area, and if it's just an overall cool school. I also do not know about the process about applying to those schools. I'm really new to this but it would mean the world to me if someone could help me out! :)",
  "author": "Janeistall",
  "created": 1639619901,
  "updated": 1639819175,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hoq67gl": {
      "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hoq67gl/",
      "text": "I know certain UK universities are more open to accepting Americans than others …. St. Andrews in Scotland is very American applicant friendly. It is one of the best universities in Great Britain.  Prince William and Kate went there.  \n\nStart with that one, google “American student admissions St. Andrews” and see if you find anything.  \n\nI know that some UK universities participate in American in person and online college fairs / information sessions so keep your eye out for upcoming events in 2022 and look for participatiing UK universities in the list of colleges that are part of the college fair / online event.\n\nYou could also just email the admissions offices of a few UK universities you think you may be interested in, and ask to be put on their mailing list and ask them to send you any information about international applications.",
      "author": "ChancellorGH",
      "created": 1639620437,
      "upvotes": 2,
      "replies": {
        "hoq6sg4": {
          "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hoq6sg4/",
          "text": "AHHH you're a life saver!! thanks so much!!!",
          "author": "Janeistall",
          "created": 1639620693,
          "upvotes": 1,
          "replies": {
            "horbvl4": {
              "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/horbvl4/",
              "text": "One other suggestion is Canadian universities.  They get a ton of American applicants and the acceptance rates are really good.  The very best universities in Canada have much higher acceptance rates than the best American universities.  And Canadian universities are cheaper than American universities.\n\nI have spent a lot of time in Canada. … I love it.  It’s way more convenient than having to go to Europe obviously … but you still get a British flavor in Toronto (Ontario) and British Columbia.  Because of its location in French - influenced eastern Canada, McGill has a French feel to it.  \n\nThe Big 3 Canadian universities:\n\n1)University of Toronto \n2)McGill University \n3)University of British Columbia",
              "author": "ChancellorGH",
              "created": 1639644012,
              "upvotes": 2,
              "replies": {
                "horc6lp": {
                  "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/horc6lp/",
                  "text": "I also forgot to mention that I studied abroad during college at the University of Glasgow, Scotland …. THE BEST YEAR OF MY LIFE.",
                  "author": "ChancellorGH",
                  "created": 1639644260,
                  "upvotes": 2,
                  "replies": {
                    "hoy8n7t": {
                      "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hoy8n7t/",
                      "text": "wowowow really?? Is it okay if you could tell me more about your experience? THANK YOU!",
                      "author": "Janeistall",
                      "created": 1639766329,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hoy8jq0": {
                  "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hoy8jq0/",
                  "text": "That’s awesome! Thank you so much for telling me all about it!! I didn’t even think about Canada :)",
                  "author": "Janeistall",
                  "created": 1639766292,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hoq7r7i": {
      "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hoq7r7i/",
      "text": "All UK schools have websites and they all speak to internationals for admission. \n\nBut first: Why do you want to go abroad? What do you want to study? Can you find a school in the US who offers as good as a program? Why not go to a school in the US who has an international program for a semester etc.? I know plenty of people abroad who would rather come to the States. So why do you want to go the other direction?",
      "author": "pupuphlatter",
      "created": 1639621113,
      "upvotes": 2,
      "replies": {
        "hoy8fga": {
          "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hoy8fga/",
          "text": "To be honest, I really want to experience something different. I think it’s really good to travel while i’m young and it’s something I want to see. I also want to study economics. While, I do want to go abroad for college, I do not know if that is my final decision yet :)",
          "author": "Janeistall",
          "created": 1639766247,
          "upvotes": 1,
          "replies": {
            "hoyd1rf": {
              "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hoyd1rf/",
              "text": "Okay, well one way to get started would be to familiarize yourself with the application process over there... it's handled by UCAS (Universities and Colleges Admissions Service). So it's sort of like what the Common App is over here.\n\nThey have an info page on their site you can check out as an international: [https://www.ucas.com/undergraduate/applying-university/ucas-undergraduate-international-eu-students](https://www.ucas.com/undergraduate/applying-university/ucas-undergraduate-international-eu-students)\n\nThey also have this cool resource where you can talk to actual students from a bunch of schools for some inside info: [https://www.ucas.com/chat-to-students](https://www.ucas.com/chat-to-students)\n\nHave a look at those pages and around the site. Then maybe you'll be able to narrow down what possible schools you'd like, and dig deeper into those and see what you come up with. Good luck!",
              "author": "pupuphlatter",
              "created": 1639768013,
              "upvotes": 1,
              "replies": {
                "hozwd57": {
                  "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hozwd57/",
                  "text": "AHH youre literally the best person on this site! Your help means the world to me! Thank you so much!",
                  "author": "Janeistall",
                  "created": 1639791439,
                  "upvotes": 2,
                  "replies": {
                    "hozzf60": {
                      "link": "/r/ApplyingToCollege/comments/rhfk51/searchingapplying_to_schools_in_the_uk/hozzf60/",
                      "text": "Np. Good luck and enjoy the discovery of all that’s possible…",
                      "author": "pupuphlatter",
                      "created": 1639792883,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}