{
  "sid": "qmo3xm",
  "link": "/r/ApplyingToCollege/comments/qmo3xm/need_help_regarding_college_and_scholarships/",
  "title:": "Need help regarding college and scholarships.",
  "text": "Hey everyone. Im using a throwaway because my main account isnt the right place for this. I need help. I feel like a failure and a let down to my family. I just want to make this right, and if anyone has any experience in a situation like this, I need your advice. \n\nA little about me: I'm a first generation student. I excelled in highschool and graduated top of my class, taking AP, Honors, Sports, and College courses throughout my 4 years. I passed my AP exams with scores of 3-4. And graduated Highschool with almost a full year of college compleated. I am 18 years old, I live with my parents, I have been using a state funded program that allows students to receive 2 years of college for free as long as they are submitting community service hours on time. \n\nIn my last year of highschool, I was diagnosed with severe ADHD, College brought it out, and I couldnt read a single line of textbook without skipping around or losing focus. This lead to severe depression and self doubt, which I am working on (No pitty, Im just giving you a clear picture of who I am) and Impacted my schooling immensely. \n\nI have only ever had the dream and want to become a medical doctor, and surgeon, and to help people who are suffering from diseases that I have seen personally in the past. I know this will take years of school, labor and hard work, and I am more than ready to go through that in order to help people. However since Covid, and my diagnosis, I've been jumping between medication after medication, and I have been a shell of a person since then. Which has lead to my failure to pass some courses I had at my local community college. \n\nWhat I need advice on: I have lost my state funded scholarship, and now have multiple courses with F grades on my transcript (which I've been told will be expunged if I retake and pass them). My parents have only ever wanted me to get good grades and be successful in life, I cant ask them to pay for my college, and Im so damn close to having an associates in medicine. I am more than willing to work to pay for it, and I am desperate for help on where I can get other forms of financial aid/ other scholarships. I dont know where to start and I cant fathom how I can fix this. \n\nThank you for reading, if you dont have advice I understand, I will read every comment.",
  "author": "AcademicThrowRA",
  "created": 1636042426,
  "updated": 1636135762,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "hjbukls": {
      "link": "/r/ApplyingToCollege/comments/qmo3xm/need_help_regarding_college_and_scholarships/hjbukls/",
      "text": "I don't have any advice, but I just wanted to tell you that you're going to get through this. I hope someone gives you the info you need. Love you! <3",
      "author": "hoodfellathrowaway",
      "created": 1636057999,
      "upvotes": 4,
      "replies": {
        "hjf2228": {
          "link": "/r/ApplyingToCollege/comments/qmo3xm/need_help_regarding_college_and_scholarships/hjf2228/",
          "text": "Thank you, I have tried powering through this, but I feel like im constantly hitting a wall. Im just lost right now, and need something to put me back together.",
          "author": "AcademicThrowRA",
          "created": 1636122087,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjcnyr5": {
      "link": "/r/ApplyingToCollege/comments/qmo3xm/need_help_regarding_college_and_scholarships/hjcnyr5/",
      "text": "There should be a financial aid office at your present school and a counseling office to support you through the changes and challenges. I think you need a \"tribe\" of knowledgable\" people to guide you and your family through the process. Good Luck to you!",
      "author": "Radiant-Chipmunk-987",
      "created": 1636070096,
      "upvotes": 3,
      "replies": {}
    },
    "hjf2j41": {
      "link": "/r/ApplyingToCollege/comments/qmo3xm/need_help_regarding_college_and_scholarships/hjf2j41/",
      "text": "Update for comments: I am still reading, I will log out of my account and never log back in, I have a plan, and will continue school and have told my parents, who were upset but not mad. I have decided to take my time and do some serious life changes to get out of this rut. Thank you if you are reading, and to the internet searches in the future, Good luck.",
      "author": "AcademicThrowRA",
      "created": 1636122282,
      "upvotes": 1,
      "replies": {}
    }
  }
}