{
  "sid": "qosyae",
  "link": "/r/ApplyingToCollege/comments/qosyae/are_my_chances_lower_applying_to_biomedical/",
  "title:": "Are my chances lower applying to biomedical engineering major?",
  "text": "hi all! so i am applying to some pretty competitive schools. i want to major in either biology or biomedical engineering (following the premed track), but i would rather do biomedical engineering because i have more stats that fit with that major (my math stats are stronger). however, i feel like engineering schools are overall harder to get into. i would still love to major in biology, so i’m wondering if i should apply to colleges of arts and sciences instead of engineering. i know i could always switch, but switching colleges is harder than switching majors. obviously i want to do anything that will help me gain admission, so i would 100% list biology as a major if i would have better chances at these competitive schools. would it really make a difference in admissions? \n\nanother reason i want to apply with a major in BME is because i wrote about my journey as a woman in stem (and founded a WiSTEM club). biology is actually more female dominated, so it doesn’t fit in as well. engineering is definitely more male dominated so that would fit better. but does this really matter? \n\nthanks!",
  "author": "Low-Rent-3476",
  "created": 1636305165,
  "updated": 1636654556,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjqcnrp": {
      "link": "/r/ApplyingToCollege/comments/qosyae/are_my_chances_lower_applying_to_biomedical/hjqcnrp/",
      "text": "There is a generalization that engineering is always more competitive for admission than other majors/schools at a particular university. That’s not always true. I’m an Engineering Admissions rep at Syracuse, where the admission rate for Engineering is about the same as Arts and Sciences. I’d be happy to chat with you about our BME Program, which is officially known as Bioengineering. You could definitely follow the pre-med track as a Bioengineering major at Syracuse.",
      "author": "jjhoster",
      "created": 1636323923,
      "upvotes": 3,
      "replies": {}
    },
    "hjqladr": {
      "link": "/r/ApplyingToCollege/comments/qosyae/are_my_chances_lower_applying_to_biomedical/hjqladr/",
      "text": "which do you like better based on the schools you are applying to. you also don't have to be committed to a major as you most likely will switch in college.",
      "author": "Sufficient_Pickle702",
      "created": 1636327666,
      "upvotes": 1,
      "replies": {}
    }
  }
}