{
  "sid": "r5yiku",
  "link": "/r/ApplyingToCollege/comments/r5yiku/i_am_incredibly_worried_about_the_process_of/",
  "title:": "I am incredibly worried about the process of applying to college.",
  "text": "Before I start this I would like to first state that my grammar in this post will be awful. I have to leave for a few hours in a few minutes, so I do not have time to grammar check anything. I am quite young, 8th grade (in the USA), but for most of my life I have know what I want my degree to be. It is one of the few things that I am very passionate about. I would say that I am intelligent for my age at least. I research topics related to the degree I would apply for due to interest and I have taught myself math up to pre-calculus (not because I enjoy it, it will just make it easier for me in the future), and I consider myself a fast learner who would do well in. Because of this I would like to go to a somewhat good college/university, unless something major in my life changes, I have absolutely no faith that I would ever be able to go to any Ivy League so that is not of my concern. But I would still like to go to a nice school. My problem is that I have no idea what I need to do to get into a college. I know it probably doesn't matter for someone currently in middle school, but I am worried about things like AP classes. Do I have to take AP classes throughout the entirety of high school or only one year? What are AP tests? Do I need to be in AP classes to take them? If I want to apply to overseas schools with different requirements what do I do? Is it bad that I can't even take what I want my degree to be in high school? Are there any resources that I can talk to about these issues? I am sorry for this poorly formatted thing that is probably missing important information. I'll be back at like 7 PM EST if anyone has any advice or asks for any information. Thanks to anyone who even wastes the few minutes it may have took to read this",
  "author": "isbotdrive",
  "created": 1638309352,
  "updated": 1638479354,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.22,
  "comments": {
    "hmpua1f": {
      "link": "/r/ApplyingToCollege/comments/r5yiku/i_am_incredibly_worried_about_the_process_of/hmpua1f/",
      "text": "💀",
      "author": "AvocadoCool",
      "created": 1638309771,
      "upvotes": 19,
      "replies": {}
    },
    "hmq0kr3": {
      "link": "/r/ApplyingToCollege/comments/r5yiku/i_am_incredibly_worried_about_the_process_of/hmq0kr3/",
      "text": "The college process really isn’t that special or complicated.\n\n1.) Excel in your classes\n\n2.) Take APs as they come. My school offered 0 APs for freshmen, 1 for sophomore, and once you hit junior they were pretty much all available. I took 9 APs, none were “BS classes” like art.\n\n3.) Find an extracurricular you enjoy, stick with it, brownie points if you excel in this too. You can stack ECs if possible ig. If you have an EC that’s just for 5 weeks in the summer, probably find an additional EC. My ECs were debate and a job, held for 3 years and 2 years respectively, which meant I was weekly contributing roughly 30 hours per week to ECs for months at a time.\n\nThe rest is a case-by-case sort of basis. For example, if you’re low income like me then going to any college out of state, even more so in a different country, is pretty much out of the cards. Google can help you with the rest.\n\nAlso make sure to study for the SAT, probably start to practice as a Freshmen and continually progress until you take it years later.",
      "author": "Xymes",
      "created": 1638312398,
      "upvotes": 8,
      "replies": {
        "hmq11ht": {
          "link": "/r/ApplyingToCollege/comments/r5yiku/i_am_incredibly_worried_about_the_process_of/hmq11ht/",
          "text": "Take atleast AP art history or music theory if u want to apply to UCs",
          "author": "AvocadoCool",
          "created": 1638312592,
          "upvotes": 2,
          "replies": {}
        },
        "hmsfr89": {
          "link": "/r/ApplyingToCollege/comments/r5yiku/i_am_incredibly_worried_about_the_process_of/hmsfr89/",
          "text": "damn calling art bs😭",
          "author": "whoreforbrown",
          "created": 1638362646,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmq4be8": {
      "link": "/r/ApplyingToCollege/comments/r5yiku/i_am_incredibly_worried_about_the_process_of/hmq4be8/",
      "text": "Don’t be worried. You’re in middle school and any college will offer you a great education. Where you go will not determine your success or happiness; your ability to balance school and your personal life will. \n\nJoin a few clubs that you might like, take classes that push you but won’t ruin your high school experience, find interesting internships/research/programs to do over your summers or work on your own projects. Don’t do things just for the sake of college or add so many extracurriculars that you burnout. \n\nDo not worry about what your school offers, colleges consider this. AP exams are taken in the spring and cover the entire year of content. All students across the US take the same exam and are given a score from 1-5 (3+ is passing, 4/5 is ideal). Many people self-study successfully but it’s more difficult and taking AP classes demonstrates rigor anyway. Truthfully, AP classes aren’t that bad if you’re interested in the subject. \n\nMost importantly, if you spend the entirety of grades 8-12 worrying about college, you will be miserable. If you need to stress constantly to get into the college you attend, you probably won’t enjoy your life then either. Pursue what makes you healthy and happy and the right fit will follow.",
      "author": "CosmicallyIronic",
      "created": 1638313986,
      "upvotes": 1,
      "replies": {}
    }
  }
}