{
  "sid": "rejiba",
  "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/",
  "title:": "I have heard something about political games in ivy league admissions. I think ivy league schools have no interest in students from Post-soviet countries. What do you think about it?",
  "text": "Yesterday, Dartmouth decisions were out. A student from Kazakhstan with 44 IB, 1540 SAT, unusually high GPA got, 5 times ISO Olympic medalist, awesome extracurricular activities, super essays got rejected.( I compared his application with others who got admitted. His application was stand-out). The same happened with Ara Memberyan a few years ago. According to statistics, ivy league schools admitted very low amount of students from Post-soviet countries.",
  "author": "Xusanboy_Kotibjonov",
  "created": 1639292772,
  "updated": 1639514844,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.81,
  "comments": {
    "ho8jikq": {
      "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/ho8jikq/",
      "text": ">According to statistics, ivy league schools admitted very low amount of students from Post-soviet countries.\n\nAccording to statistics, Ivy League schools admit very few students from anywhere.",
      "author": "Strict-Special3607",
      "created": 1639309719,
      "upvotes": 40,
      "replies": {
        "ho989ug": {
          "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/ho989ug/",
          "text": "This. What’s the acceptance rate for internationals at any of the ivies? Lower than low.",
          "author": "SpacerCat",
          "created": 1639323067,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ho8254j": {
      "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/ho8254j/",
      "text": "Can't say anything about the \"political\" factor here, but the Ivies and similar schools receive thousands of applications with perfect statistics every year - that is not the only thing there looking for, and this is why they reject many such applicants every year.",
      "author": "prsehgal",
      "created": 1639295175,
      "upvotes": 30,
      "replies": {}
    },
    "ho9zyno": {
      "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/ho9zyno/",
      "text": "Hate to poop on your parade, but I'm a Yale first year and I've met a girl from Kazakhstan, a girl from Mongolia, two people from Ukraine, and saw on instagram someone from Uzbekistan.  Not to mention many kids from Russia itself.  It's hard to get into Ivy League schools especially as an international but they're not boycotting countries for being ex soviet.",
      "author": "MrBulldog25",
      "created": 1639334174,
      "upvotes": 4,
      "replies": {}
    },
    "ho9e8kq": {
      "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/ho9e8kq/",
      "text": "I think admissions is complicated especially for internationals. For example every country has a top chemistry student and top math student etc but Harvard can’t take 200 chemists and 200 mathematicians and 200 physicists and on and on. All these people are amazingly smart and accomplished and talented, but if you’re shaping a class, maybe you want 50 chemistry majors and 30 math majors, etc and only 10% of the class will be internationals. That’s why admissions seems unfair or arbitrary.",
      "author": "ApplyingToCollege21",
      "created": 1639325554,
      "upvotes": 3,
      "replies": {}
    },
    "ho82ah2": {
      "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/ho82ah2/",
      "text": "bc unfortunately the money isn't there",
      "author": "sleepkeyichidema",
      "created": 1639295290,
      "upvotes": 7,
      "replies": {}
    },
    "ho9w3m4": {
      "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/ho9w3m4/",
      "text": "Maybe they were asking for full aid and that got them rejected???",
      "author": "getmeoutoflatamplz22",
      "created": 1639332682,
      "upvotes": 2,
      "replies": {}
    },
    "ho82gse": {
      "link": "/r/ApplyingToCollege/comments/rejiba/i_have_heard_something_about_political_games_in/ho82gse/",
      "text": "As a Harvard student, I can confirm.",
      "author": "sejlee09",
      "created": 1639295429,
      "upvotes": 4,
      "replies": {}
    }
  }
}