{
  "sid": "q860jx",
  "link": "/r/ApplyingToCollege/comments/q860jx/schools_i_should_consider_applying_to/",
  "title:": "Schools I should consider applying to?",
  "text": "I am an Illinois resident with a 1430 SAT (800 M 630 EBRW) could superscore to 1500 with my 700 EBRW from April. I have near average or below average EC’s as I’m not sure mine even really count. Some examples are me going to a private school on the weekends to learn the polish language from age 3-17. I have a seal of bi literacy in polish and will have one in Spanish by April. I also participated in a math and soccer team freshman year. I’ve passed a majority of my AP classes and have taken a total of 10 AP classes. Will have around 30ish community service hours by December. I’m planning on majoring in something that would benefit me in preparing for the LSAT as I’m planning on attending law school (philosophy, economics, not really too sure would appreciate suggestions). I don’t really care whether or not the school is large or expensive would appreciate any suggestions for which schools I should apply to.",
  "author": "jasiekkffasola",
  "created": 1634237127,
  "updated": 1634251590,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgngknr": {
      "link": "/r/ApplyingToCollege/comments/q860jx/schools_i_should_consider_applying_to/hgngknr/",
      "text": "What are your parameters?  Budget?  UIUC is probably a decent option.  If you want to pay less, with your stats you can make that happen if you're willing to look at schools that are somewhat less selective than UIUC.",
      "author": "jayphoward",
      "created": 1634241324,
      "upvotes": 1,
      "replies": {}
    },
    "hgnss3b": {
      "link": "/r/ApplyingToCollege/comments/q860jx/schools_i_should_consider_applying_to/hgnss3b/",
      "text": "Here is good place to start https://colleges.roundpier.com",
      "author": "redneck198412",
      "created": 1634247309,
      "upvotes": 1,
      "replies": {}
    }
  }
}