{
  "sid": "ri92kb",
  "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/",
  "title:": "stop saying college admissions are a lottery",
  "text": "okay so this might be controversial, but it rlly annoys me when people say college admissions for top schools are a lottery.\n\nis the process weird? yes.\nis it unfair? absolutely yes.\nis it unpredictable? yes.\nis it a lottery? no.\n\nnobody (and i mean nobody) should be entitled to admission into a top school. chances are you aren’t the only 1600-scoring-nonprofit-founder-international-competition-winner applying to top schools. if there’s anything I’ve learned throughout this process is that personality and fit are key. if you are an amazing student but an absolute robot, you will likely not be competitive in admissions. on the other hand, if you’ve come from a difficult background and have a vibrant personality, you are competitive. \n\nthere’s nothing random about college admissions. i’ve noticed that most people that call them a lottery have been privileged throughout the process, as in advisors, counseling, etc. most people that they look at for evidence of said lottery happen to be low-income minorities. \n\nanyway, moral of the story is: college apps aren’t the end of the world. if you don’t get in to your dream school, you will certainly thrive at an amazing school. there’s no need to deflect onto people who were admitted. there was a reason why they were admitted and you weren’t, but it wasn’t random.\n\nedit: its true—legacies that just get admitted because of their legacy statuses do not deserve it more than students who actually worked their asses off.",
  "author": "Jonathanc0711",
  "created": 1639715537,
  "updated": 1639786556,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.45,
  "comments": {
    "hovlnby": {
      "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovlnby/",
      "text": "\"Everyone that gets into a top school deserves to be there.\" NO WAY. Why would a legacy kid with low(ish) all-around stats get into an ivy? Because he deserved it on his own merit? NO WAY.",
      "author": "Common_Ad7937",
      "created": 1639715774,
      "upvotes": 35,
      "replies": {
        "hovlun3": {
          "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovlun3/",
          "text": "My only gripe with this post",
          "author": "Pitsuh",
          "created": 1639715870,
          "upvotes": 7,
          "replies": {}
        },
        "hovluq6": {
          "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovluq6/",
          "text": "okay ur right I cant argue w that one",
          "author": "Jonathanc0711",
          "created": 1639715871,
          "upvotes": 6,
          "replies": {}
        },
        "hovm345": {
          "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovm345/",
          "text": ">Why would a legacy kid with low(ish) all-around stats get into an ivy?\n\nThey pretty much don’t.\n\nThere’s more than enough highly-qualified legacy applicants that no top school needs to accept “low(ish)” legacy applicants.",
          "author": "Strict-Special3607",
          "created": 1639715986,
          "upvotes": 9,
          "replies": {
            "howkg0f": {
              "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/howkg0f/",
              "text": "Guess what? A top school just accepted one such legacy from my school. Many more qualified applicants from my school were deferred/rejected. This slightly above average legacy kid got in.",
              "author": "Common_Ad7937",
              "created": 1639739422,
              "upvotes": 2,
              "replies": {
                "howo8h8": {
                  "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/howo8h8/",
                  "text": "Well, there’s objective proof, right?",
                  "author": "Strict-Special3607",
                  "created": 1639742023,
                  "upvotes": 1,
                  "replies": {
                    "hox0ixm": {
                      "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hox0ixm/",
                      "text": "Yes, I know the stats.",
                      "author": "Common_Ad7937",
                      "created": 1639748716,
                      "upvotes": 1,
                      "replies": {
                        "hoymh98": {
                          "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hoymh98/",
                          "text": "N = 1\n\nEveryone knows someone with “lowish stats” that got into an Ivy.  This one happens to be a legacy.",
                          "author": "Strict-Special3607",
                          "created": 1639771749,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hovnrkp": {
      "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovnrkp/",
      "text": "I agree to some extent. It's not literally like a lottery - there's a ton of applicantion aspects that objectively differentiate students. However, there is still some element of luck. Supposing the same application was submitted two years, it's possible that one would get in and the other wouldn't, just depending on the context of that incoming class, what the admissions office wanted for the incoming class, and a bunch of other things.",
      "author": "kiddrone",
      "created": 1639716853,
      "upvotes": 10,
      "replies": {}
    },
    "hovldv3": {
      "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovldv3/",
      "text": "also, don’t say ED is only for legacies and athletes just because you didn’t get in with perfect stats. there are many FGLI students that got in early. perfect stats aren’t everything, personality is.",
      "author": "Jonathanc0711",
      "created": 1639715656,
      "upvotes": 4,
      "replies": {}
    },
    "how7b6l": {
      "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/how7b6l/",
      "text": ">there was a reason why they were admitted and you weren’t, but it wasn’t random.\n\nThe reason could be out of your control.\n\nFor example -\n\n1. Limit of students who request need-based financial aid\n2. You are Asian\n3. Your counselor messed up a form\n4. Yield Protection\n5. Too many students applying to your preferred major\n6. High school has too many students/No individual focus (Bad reco letters/Hard to get into clubs)\n\nA lot of factors (income, opportunities, high school location, high school facilities) are out of your control. \n\n>if you are an amazing student but an absolute robot, you will likely not be competitive in admissions\n\nLet me assure you that every top school has a lot of nerds whose pure passion/focus is academically orientated. AOs recognize these students as well and don't treat them as \"robots\".\n\n>there’s no need to deflect onto people who were admitted\n\nUnfortunately with legacy admissions and the semi-recent college scandals surrounding bribes, Asian students etc., people have a severe distrust with the college admissions process and target privileged students who didn't have to work as hard as them. It's the honest truth.\n\nThis post is incredibly arrogant, obnoxious and close-minded.",
      "author": "sidroid123",
      "created": 1639729314,
      "upvotes": 4,
      "replies": {}
    },
    "hovnyyy": {
      "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovnyyy/",
      "text": "i absolutely agree. i feel this kind of mindset that its a lottery takes a very external locus of control approach which isnt healthy. people argue that each year colleges have a defined type(s) of students they'll accept that year like saxophone players or ballerinas for example but i believe that even if you dont have what they're specifically looking for that year but you shine in all other realms and prove that youre worth it then you can get that acceptance letter.",
      "author": "cherry_acorn",
      "created": 1639716968,
      "upvotes": 2,
      "replies": {}
    },
    "hovm3ef": {
      "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovm3ef/",
      "text": "You’re wrong for the simple fact that it is luck based, you even said it yourself… If the applications are unfair or unpredictable then it is luck based. Also the universities constantly talk about having specific applicants that fill a very specific “need” to make a well rounded class. Whether that be a specific niche such as a trombone player or a fencer, but this need changes year after year. How will you know what each university is looking for if they never state what niche they’re looking for, and if it changes year after year? If you’re lucky and the college you applied to needs a niche that you’re focused in then you got lucky, but if they don’t need it that year but may need it next year then you got unlucky, it’s merely that simple. If that’s not luck based then you clearly need to brush up on what “luck” means, as you clearly don’t know what you’re talking about.",
      "author": "UPennSimp26",
      "created": 1639715990,
      "upvotes": 3,
      "replies": {}
    },
    "hovn5um": {
      "link": "/r/ApplyingToCollege/comments/ri92kb/stop_saying_college_admissions_are_a_lottery/hovn5um/",
      "text": ">if you are an amazing student but an absolute robot, you will likely not be competitive in admissions.\n\nAgree with this, to a point.  If you're a robot who is also a math prodigy...you're probably competitive (some places).",
      "author": "jayphoward",
      "created": 1639716533,
      "upvotes": 1,
      "replies": {}
    }
  }
}