{
  "sid": "q75lr1",
  "link": "/r/ApplyingToCollege/comments/q75lr1/am_i_screwing_myself_by_not_shooting_for_the_moon/",
  "title:": "Am I screwing myself by not shooting for the moon",
  "text": "I have pretty good stats, a 1500, ~3.9, extra curriculars out the wazoo, and I’ve been told I have good essay writing skills… but I just don’t know if I want to go to one of those crazy competitive schools. \n\n1. I want to go to medical school and need a good GPA and a lot of money, 2. I have pretty major ADHD and really don’t want to fail (as per wanting to go to medical school), and 3. I just really don’t want to go through this process anymore, today (after realizing I had to rewrite my common app), I had a pretty bad anxiety attack and just felt like I couldn’t make it. The only thing keeping me sane is telling myself that I can just go to my state school (U of O) and get into the honors college, but would that be waisting my chances? All I want is to be over with this process, and be in a school. I don’t want to be heavily impacting the rest of my life because a stupid anxiety attack is making it so I can’t write my essay. \n\nSorry if my writing is jumbled, as it might seem I’m not having the best time right now and am kinda freaking out. Thanks for any responses y’all can give me, I just really need an outside perspective.",
  "author": "Candid_Store3697",
  "created": 1634108333,
  "updated": 1634167110,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hggk9lk": {
      "link": "/r/ApplyingToCollege/comments/q75lr1/am_i_screwing_myself_by_not_shooting_for_the_moon/hggk9lk/",
      "text": "For medical school, go with the easiest and cheapest school. Med school do not care too much about the university's prestige. The only difference is research opportunities, but this can be made up during summer research.",
      "author": "idkname999",
      "created": 1634112493,
      "upvotes": 2,
      "replies": {}
    },
    "hggxzga": {
      "link": "/r/ApplyingToCollege/comments/q75lr1/am_i_screwing_myself_by_not_shooting_for_the_moon/hggxzga/",
      "text": "If you go to a less selective school *at a steep discount* then you haven’t “wasted” your strong college resume.",
      "author": "jayphoward",
      "created": 1634124149,
      "upvotes": 1,
      "replies": {}
    },
    "hggwx1a": {
      "link": "/r/ApplyingToCollege/comments/q75lr1/am_i_screwing_myself_by_not_shooting_for_the_moon/hggwx1a/",
      "text": "Apply to a bs/md program",
      "author": "Cool_Tale3626",
      "created": 1634123390,
      "upvotes": 0,
      "replies": {}
    }
  }
}