{
  "sid": "remugg",
  "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/",
  "title:": "Should I bother to apply?",
  "text": "tl;dr: International junior with relatively low GPA and no ECs, realistic chances of building my curriculum by 2022 RD for top schools, and if not, as a transfer.\n\nSo I'm in my junior year of Spain's highschool equivalent, and I've been thinking for a while that maybe I should try to apply with financial aid to Harvard, MIT, Princeton, Yale and Amherst; but I'm not really sure if I could make it past the initial review, due to my average grades in freshman and sophomore years. I should also add that I've no particularly interesting EC or award, but I'm confident I can rank first in my hs and get a 1550+ on the SAT, and I've seen people getting into these universities with 1400s so maybe this would be representative of my academical progression.\n\nNow, my question is: should I even bother to apply? With relatively low GPA and nothing interesting to put in my application yet,should I start working now towards building my curriculum? Or maybe wait 3 years and try to get in as a transfer student? Or straight up not apply?\n\nPlease no \"You don't lose anything by trying\" or \"It's pure luck just apply\", I'm confident they will throw my application away the moment they see my transcript. Thank you in advance.",
  "author": "Suitable-Ad4325",
  "created": 1639307038,
  "updated": 1639514955,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho8hdlo": {
      "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8hdlo/",
      "text": "The aim of the college application process is not to win a lottery or one in a hundred thousand shot. It is to land the best possible college that your financial and academic situation allow. \n \n\nAn application strategy includes applying to realistic target schools. \n\n\nSo I would say if your whole college strategy is simply to apply to a bunch of highly selective extreme reach schools, you are wasting every body’s time, yours included.",
      "author": "wsbgodly123",
      "created": 1639307961,
      "upvotes": 8,
      "replies": {
        "ho8hrv3": {
          "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8hrv3/",
          "text": "My realistic target and safeties are here in Spain, and that's where I was meaning to go when I said to apply as a transfer. Or wait, you are saying that no matter how hard I work it's too late now?",
          "author": "Suitable-Ad4325",
          "created": 1639308288,
          "upvotes": 2,
          "replies": {
            "ho8lpnq": {
              "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8lpnq/",
              "text": "i wouldnt entirely say so. an international applicant here on this subreddit got into stanford and WLd at uchicago with virtually no ECs, a 1440 sat score but a 44/45 IB and a good essay. Keep in mind that they indicated that they wanted to study a not-so-popular humanities major though",
              "author": "9und9zigluftwaffles",
              "created": 1639311460,
              "upvotes": 4,
              "replies": {
                "ho8ngf2": {
                  "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8ngf2/",
                  "text": "Yeah that's the thing😬 I would be applying for engineering if anything. But afaik, most institutions will value a GPA of 98% more than a 1440 SAT. Thank you anyways.",
                  "author": "Suitable-Ad4325",
                  "created": 1639312753,
                  "upvotes": 1,
                  "replies": {
                    "ho8s205": {
                      "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8s205/",
                      "text": "Yeah in most cases ur SATs can only help. Good luck!",
                      "author": "9und9zigluftwaffles",
                      "created": 1639315593,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "ho8o2u7": {
                  "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8o2u7/",
                  "text": "Mind elaborating more about said applicant? Do they have a national/intl award?",
                  "author": "Choochoochrainn",
                  "created": 1639313194,
                  "upvotes": 1,
                  "replies": {
                    "ho8ryns": {
                      "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8ryns/",
                      "text": "No iirc They have a post on reddit just search stanford 1440",
                      "author": "9und9zigluftwaffles",
                      "created": 1639315540,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ho8monz": {
          "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8monz/",
          "text": "International meta hits different",
          "author": "sleepkeyichidema",
          "created": 1639312195,
          "upvotes": 1,
          "replies": {
            "hob74i1": {
              "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/hob74i1/",
              "text": "bruhhh💀💀 lmao",
              "author": "Suitable-Ad4325",
              "created": 1639351598,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho8sert": {
      "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8sert/",
      "text": "I don’t think you should limit yourself. As a fellow low international student applying to college this year, I say go for it. Work on improving your grades and getting involved in some ECs that you’ll enjoy. Most colleges are need aware for internationals so whether you get into one school over the other could depend on how much you willing to pay. If you qualify for a fee waiver make sure to apply to as many schools as you can(that give good aid) because sometimes getting into college can be completely random. Hope this helps!",
      "author": "k1d1st",
      "created": 1639315796,
      "upvotes": 3,
      "replies": {
        "ho8v67i": {
          "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho8v67i/",
          "text": "lmao its nice to see a fellow habesha on this sub :)",
          "author": "edna_napooi",
          "created": 1639317279,
          "upvotes": 2,
          "replies": {
            "ho97c71": {
              "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/ho97c71/",
              "text": "Omg yes! I need more habesha friends",
              "author": "k1d1st",
              "created": 1639322673,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hob3kzr": {
      "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/hob3kzr/",
      "text": ">junior with relatively low GPA and no ECs,  … but I'm confident I can rank first in my hs\n\nHow does this work?\n\nHonestly, low GPA and no ECs does not scream \n\n>apply with financial aid to Harvard, MIT, Princeton, Yale and Amherst;",
      "author": "RichInPitt",
      "created": 1639350047,
      "upvotes": 1,
      "replies": {
        "hob89e5": {
          "link": "/r/ApplyingToCollege/comments/remugg/should_i_bother_to_apply/hob89e5/",
          "text": "Oh, I should further elaborate in Spain's system, from grades 7-10 secondary school is mandatory for all kids that age, and after graduation you can either do nothing, enter vocational schools or the baccalaureate, either way can lead to university, or advanced vocational schools, or even advanced vocational school and then university. I'm now taking my first year of the baccalaureate having graduated already from secondary school and I'm confident that I can finish 11th grade with honors and 12th grade as \"valedictorian\". And I know that it doesn't scream that's why I'm asking if I could realistically start working towards my app to be at least considered a qualified student into these top schools.",
          "author": "Suitable-Ad4325",
          "created": 1639352105,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}