{
  "sid": "qygoyq",
  "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/",
  "title:": "Why is University of Florida so unheard of in this sub despite it being a t30 school?",
  "text": "title",
  "author": "newthinz",
  "created": 1637448039,
  "updated": 1645847336,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "hlfwapz": {
      "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlfwapz/",
      "text": "There's a number of reasons why you don't see it as much on this sub as you do other schools.\n\n1. **This sub has a high percentage of prospective Engineering and CS students.** Academically, UF doesn't have well-known Engineering or CS departments. Their departments are solid, but UF isn't really well-known for one or two major academic fields like UPenn and Business, Georgia Tech and Engineering/CS, or Syracuse and Communications.\n2. **This sub tends not to attract a lot of students who fit the UF demographic.** Most students here tend to not be the \"big state school/football/party\" types, they tend to be the \"smaller/mid-size school/quieter\" types. Not saying that UF doesn't have quieter students who'd prefer to watch a movie or go hiking rather than party or watch sports, but they definitely have a big sports/party scene.\n3. **It's in Florida, which is quite different from where a lot of people on this sub are from.** Hot, humid, culturally/geographically different from places like the Northeast, West Coast, Asia (international applicants) and Chicago suburbs/DC area suburbs. (those are places where a lot of people on this sub are from.)\n4. **84% of UF students are from Florida.** Geographic diversity is a factor that a lot of applicants take into consideration. I want to go to a school where at least 1/3 of undergrads are from a different state/country.\n5. **UF probably has the least \"prestige\" of any T30 school.** Yes, it's a great school, and if I were a Florida resident, I would DEFINITELY have UF as my top-choice. It's such a great educational experience for the low in-state cost, and it's a really fun school with beautiful weather. But their prestige is rather newly-found. In 1997, their acceptance rate was 54 percent, and it was known as a \"big state school\" with good sports teams. [https://ir.aa.ufl.edu/media/iraaufledu/common-data-set/cds1997-98.pdf](https://ir.aa.ufl.edu/media/iraaufledu/common-data-set/cds1997-98.pdf)\n\nNow, their acceptance rate is lower than 30 percent, and it's beginning to be recognized as an academically strong school. A lot of people on this sub are prestige whores, and they care a lot about how well-known or prestigious their school is, especially for their parents. Because UF's prestige is rather newly-found, their parents might not recognize it to be as academically strong of a school as it truly is.\n\n\\-----\n\nAnd these points were not to diss on UF in any way; just to provide some insights into why UF might not be mentioned a lot on this sub. As I said in #5, I would definitely have UF high up on my list if I were an in-state student.\n\n\\-----\n\nBest of luck. :)",
      "author": "toyota2003",
      "created": 1637449125,
      "upvotes": 20,
      "replies": {
        "hlg098g": {
          "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlg098g/",
          "text": " Yea it’s def in my top 5 list, as I am a Florida resident and qualify for their Bright Futures program (cover full tuition) :)",
          "author": "newthinz",
          "created": 1637450941,
          "upvotes": 3,
          "replies": {}
        },
        "hlg3ez9": {
          "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlg3ez9/",
          "text": "Me, a FL resident, not applying to UF 🤡",
          "author": "gingersnap0916",
          "created": 1637452386,
          "upvotes": 3,
          "replies": {}
        },
        "hlk8elp": {
          "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlk8elp/",
          "text": "Historical acceptance rates are mostly irrelevant because of how much has changed in the college admissions landscape.  In 1995, UChicago had a ~68% acceptance rate.  In 2003, Georgia Tech had a 67% acceptance rate and formula based admissions - a 1250 SAT and 3.7 GPA granted auto-admission.",
          "author": "ScholarGrade",
          "created": 1637531272,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hlfu8ww": {
      "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlfu8ww/",
      "text": "Florida\n\n( source: there I live)",
      "author": "AvocadoCool",
      "created": 1637448179,
      "upvotes": 21,
      "replies": {}
    },
    "hlfvcho": {
      "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlfvcho/",
      "text": "Its US News ranking doesn't really comport with its national reputation, which is, in large part, based on the strength of a school's faculty.  As a whole (may not be true for individual departments) Florida's faculty is less well-regarded than schools like Wisconsin, UT-Austin, Illinois, UW-Seattle, Minnesota, Ohio State, Penn State, Maryland, Indiana, etc.\n\nFlorida is also a relatively recent inductee (1985) to the AAU.  The above schools were inducted in 1900, 1929, 1908, 1950, 1908, 1916, 1958, 1969 and 1909 respectively.  So Florida's reputation (and, generally, its selectivity) is a relatively recent phenomenon., aided no doubt by the Benacquisto scholarship (full COA for any NMF), which no longer exists (for OOS).",
      "author": "jayphoward",
      "created": 1637448685,
      "upvotes": 5,
      "replies": {}
    },
    "hlfzubm": {
      "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlfzubm/",
      "text": "I will go abroad before I go to florida\n\n&#x200B;\n\nsorry to any Floridians in this thread...",
      "author": "fortuitous_rain515",
      "created": 1637450752,
      "upvotes": 9,
      "replies": {}
    },
    "hlfu96i": {
      "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlfu96i/",
      "text": "I personally don't like the state of Florida very much. It's not for me unfortunately.",
      "author": "AaronFM3",
      "created": 1637448182,
      "upvotes": 2,
      "replies": {}
    },
    "hlfxthu": {
      "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlfxthu/",
      "text": "It's a party school",
      "author": "moonriver252",
      "created": 1637449804,
      "upvotes": 1,
      "replies": {
        "hwos4dq": {
          "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hwos4dq/",
          "text": "this comment is funny",
          "author": "RaspberryLittle8438",
          "created": 1644697266,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlj97h1": {
      "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hlj97h1/",
      "text": "Also their admissions process is kinda weird.",
      "author": "HotMousse5209",
      "created": 1637517244,
      "upvotes": 1,
      "replies": {
        "hljib4q": {
          "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hljib4q/",
          "text": "How so?",
          "author": "newthinz",
          "created": 1637520823,
          "upvotes": 1,
          "replies": {
            "hljl3ry": {
              "link": "/r/ApplyingToCollege/comments/qygoyq/why_is_university_of_florida_so_unheard_of_in/hljl3ry/",
              "text": "Well when I was looking into applying it said their RD deadline is Nov 1 and if you don’t apply by then you’re automatically bumped to a waiting list. So, considering all their prompts, the proximity (at that point) to the deadline, and already having REA and EA apps to complete, I didn’t think it was worth applying then. Further, considering the amount of schools that wouldn’t put me on a waiting list after said date I felt like it would be a waste of time to put my energy into submitting an app later. \n\nSo things like this could affect the amount of people that apply, and consequently, talk about it",
              "author": "HotMousse5209",
              "created": 1637521892,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}