{
  "sid": "qz5q7p",
  "link": "/r/ApplyingToCollege/comments/qz5q7p/are_business_schools_worth_it/",
  "title:": "Are Business schools worth it",
  "text": "What’s the difference between going to a  \nBusiness school and just studying economics. \nAre business schools even worth it?",
  "author": "AAAAAAAAAAAEdmfow",
  "created": 1637532518,
  "updated": 1645850852,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlkepjw": {
      "link": "/r/ApplyingToCollege/comments/qz5q7p/are_business_schools_worth_it/hlkepjw/",
      "text": "You’ll probably end up in IB no matter what major if it’s a T20",
      "author": "Pitsuh",
      "created": 1637533964,
      "upvotes": 4,
      "replies": {
        "hwgep9o": {
          "link": "/r/ApplyingToCollege/comments/qz5q7p/are_business_schools_worth_it/hwgep9o/",
          "text": "Feel like business will prepare you better idk I kind of like stern alot",
          "author": "9382159",
          "created": 1644548052,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlkkn2d": {
      "link": "/r/ApplyingToCollege/comments/qz5q7p/are_business_schools_worth_it/hlkkn2d/",
      "text": ">What’s the difference between going to a Business school and just studying economics.\n\nWell, for one, they're not really the same thing.\n\n[https://en.wikipedia.org/wiki/Business\\_education#Undergraduate\\_education](https://en.wikipedia.org/wiki/Business_education#Undergraduate_education)\n\n[https://en.wikipedia.org/wiki/Bachelor\\_of\\_Economics#Curriculum](https://en.wikipedia.org/wiki/Bachelor_of_Economics#Curriculum)\n\nBusiness = stuff like accounting, marketing, finance, operations, management.\n\nEconomics = modeling the economy and the effects of things like taxation, monetary policy, etc.",
      "author": "jayphoward",
      "created": 1637536586,
      "upvotes": 2,
      "replies": {}
    },
    "hlkdbfu": {
      "link": "/r/ApplyingToCollege/comments/qz5q7p/are_business_schools_worth_it/hlkdbfu/",
      "text": "Business and econ will usually have pretty different course requirements for each major. Business tends to be much less quantitative than econ, particularly if you’re studying econ at a college that is known for being more rigorous/theoretical about it. Whether a business school is “worth it” depends on a variety of factors such as the specific school, the cost for your family, your career goals, etc.",
      "author": "rainingsiberiancats",
      "created": 1637533351,
      "upvotes": 1,
      "replies": {}
    },
    "hlkfqvm": {
      "link": "/r/ApplyingToCollege/comments/qz5q7p/are_business_schools_worth_it/hlkfqvm/",
      "text": "Business schools often hace better resources and opportunities for students; a lot of university money is to be made with business. Econ is more theoretical, and while, with the top schools, you can definitely land in many good places with just an Econ BA, it’s usually pretty useless as most undergrad Econ programs aren’t math-heavy and stats-heavy enough. Going into Econ is a strong choice if you want to double major in math and go to grad school or prefer your career a little more ambiguous. A lot of people dislike these options so they’d prefer a business school that has courses in logistics, supply management, finance, accounting, etc.",
      "author": "RepresentativeBat800",
      "created": 1637534420,
      "upvotes": 1,
      "replies": {}
    },
    "hlkg5jj": {
      "link": "/r/ApplyingToCollege/comments/qz5q7p/are_business_schools_worth_it/hlkg5jj/",
      "text": "Look at the course requirements for each on a college's website. Pick the one you prefer to study; if you want to study econ theory, you can always get an MBA later on. If you might want to study undergrad business, apply to at least some business programs, as it may be more difficult to transfer into business after enrolling.\n\n\"Worth it\"? The cost is the same, or about the same, as majoring in econ at most schools. If you are referring to employment prospects immediately following college, that may depend on the concentration you pick in business school.",
      "author": "elkrange",
      "created": 1637534598,
      "upvotes": 1,
      "replies": {}
    }
  }
}