{
  "sid": "qj1v9u",
  "link": "/r/ApplyingToCollege/comments/qj1v9u/does_having_an_associates_degree_cut_down_on_the/",
  "title:": "Does having an associates degree cut down on the amount of time it takes for me to get my bachelors?",
  "text": "I interested in pursuing architectural engineering as a major at the university Miami. I’ll receive my associates degree August 2022. Does that exempt me from courses and cut down on my time studying?",
  "author": "reddituserxoxo1952",
  "created": 1635601772,
  "updated": 1635779152,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hin6cbd": {
      "link": "/r/ApplyingToCollege/comments/qj1v9u/does_having_an_associates_degree_cut_down_on_the/hin6cbd/",
      "text": "It isn't the degree that helps, it's the course credits and whether the four year university will accept those credits for its requirements.\n\nGo to U Miami's website and look at what is required to get the degree. Most of the major requirements for architecture seem unlikely to be courses available at a CC, because that's a rather unique major. However, it might be the case that general education requirements (maybe U Miami calls them cognates or something) could be replaced by some of your CC credits.\n\nLook on the U Miami website for information about transfer credit. Often, decision to give credit will be on a case by case basis for each course, so you might not know before applying if all of your courses will be accepted for credit. But, see what you can find out.",
      "author": "elkrange",
      "created": 1635602323,
      "upvotes": 3,
      "replies": {}
    },
    "hin5iyl": {
      "link": "/r/ApplyingToCollege/comments/qj1v9u/does_having_an_associates_degree_cut_down_on_the/hin5iyl/",
      "text": "Will certainly cut down some, but you’ll need to go course-by-course with your UMiami advisor to see which credits would apply to your specific major and GenEd requirements. Unlikely that ALL of them will.",
      "author": "Strict-Special3607",
      "created": 1635601921,
      "upvotes": 2,
      "replies": {}
    },
    "hin7lya": {
      "link": "/r/ApplyingToCollege/comments/qj1v9u/does_having_an_associates_degree_cut_down_on_the/hin7lya/",
      "text": "The associate's degree by itself is meaningless, but if the course credit you accumulated while earning that associate's degree will transfer to a 4Y university then it may reduce the number of additional courses you need to take in order to earn a bachelor's degree.\n\nContact the Miami admissions office and check whether your credit will transfer.",
      "author": "jayphoward",
      "created": 1635602926,
      "upvotes": 1,
      "replies": {}
    }
  }
}