{
  "sid": "qelpcq",
  "link": "/r/ApplyingToCollege/comments/qelpcq/does_applying_to_yale_early_restrictive_early/",
  "title:": "Does applying to Yale early (“Restrictive Early Action”) actually increases my chance of getting accepted?",
  "text": "The conventional notion goes that candidates who apply in the early decision round have an increased chance of getting admitted. This is reasonable because accepted ED applicants are bound to attend the college they apply to. But Yale only has “Restrictive Early Action”, which doesn’t force candidates to attend should they be accepted. I assume that the benefits that ED applicants have don’t apply in this case? I’ve done some research and believe that the relatively high acceptance acceptance rate during the early round is because of the strength of the early action pool (as confirmed in Yale Daily News).\n\nI’ve completed my application, but many people find some flaws in it that I need to radically change. It’d take a lot of time to polish my application and I now only have 7 days until the deadline. I’m now reconsidering my option to apply early and thinking about applying in the regular decision round instead. So I really want to know whether I will have a better chance at getting accepted if I apply in restrictive early action or in regular decision?",
  "author": "sensindr",
  "created": 1635053124,
  "updated": 1635182958,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhu2ci4": {
      "link": "/r/ApplyingToCollege/comments/qelpcq/does_applying_to_yale_early_restrictive_early/hhu2ci4/",
      "text": "rea is a scam. don't do it unless you are legacy, athlete, or a noble prize winner. For normal people rea and rd hold the same results.",
      "author": "yes_I_am_your_guy",
      "created": 1635058067,
      "upvotes": 6,
      "replies": {
        "hhzxvhq": {
          "link": "/r/ApplyingToCollege/comments/qelpcq/does_applying_to_yale_early_restrictive_early/hhzxvhq/",
          "text": "Ah, thanks for the input! I’ll likely go for RD then! XD",
          "author": "sensindr",
          "created": 1635177185,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}