{
  "sid": "qwexs1",
  "link": "/r/ApplyingToCollege/comments/qwexs1/i_need_an_honest_opinion/",
  "title:": "I need an honest opinion",
  "text": "I’m currently a junior in high school and I really want to go to Georgia tech to major in biomedical engineering, but something recently came up. While I was looking at a college admissions blog, it stated that 95% of Georgia tech applicants have taken AP Calculus or an equivalent course. Unfortunately for me, I do not believe it would be possible for me to take it by my senior year, as I am taking pre calc next semester and taking honors calc my senior year. I currently have a 4.0 GPA(unweighted) and am taking the SAT for the first time, in the coming weeks. I do believe I will be able to get around a 1410, the average score of admitted applicants, as I plan on taking the SAT atleast 3 times. I also love science and am taking AP Bio and AP environmental science this year. In addition hope to take AP chem next year and I am doing almost all of the honors science electives I can at my school. In short, would I have a shoot at making it to Georgia Tech or should I consider elsewhere?",
  "author": "Rasklfish",
  "created": 1637201010,
  "updated": 1637353373,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hl2i2j0": {
      "link": "/r/ApplyingToCollege/comments/qwexs1/i_need_an_honest_opinion/hl2i2j0/",
      "text": "You should definitely try for Georgia Tech if you're so keen on the school, but it's a very competitive school even if you would've taken AP Calculus - so create a well balanced college list and apply accordingly.",
      "author": "prsehgal",
      "created": 1637201746,
      "upvotes": 9,
      "replies": {}
    },
    "hl2rasn": {
      "link": "/r/ApplyingToCollege/comments/qwexs1/i_need_an_honest_opinion/hl2rasn/",
      "text": "Summer math class? Dual enrollment? If I were you I’d exhaust all possible opportunities to advance further in math (if I felt I could get the grades). If you don’t want to/can’t do that, find a safety you’d be happy at (in case GT rejects you).",
      "author": "E513",
      "created": 1637206009,
      "upvotes": 5,
      "replies": {}
    },
    "hl2vlfj": {
      "link": "/r/ApplyingToCollege/comments/qwexs1/i_need_an_honest_opinion/hl2vlfj/",
      "text": "I would recommend you to self register for an ap calc, or take some for credit summer classes at some uni because precal is definitely more than sufficient for you to manage AP calc AB.",
      "author": "Katsura_Do",
      "created": 1637208123,
      "upvotes": 3,
      "replies": {}
    },
    "hl2xyhm": {
      "link": "/r/ApplyingToCollege/comments/qwexs1/i_need_an_honest_opinion/hl2xyhm/",
      "text": "You should definitely apply to Georgia Tech. But also know that with your strong academic profile, you’ll be an outstanding candidate for admission and merit scholarships at many universities. Do a search for accredited biomedical engineering and Bioengineering programs on the ABET website:\n\nhttps://www.abet.org",
      "author": "jjhoster",
      "created": 1637209332,
      "upvotes": 3,
      "replies": {}
    }
  }
}