{
  "sid": "r4m1bi",
  "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/",
  "title:": "advice for a high school junior?",
  "text": "hey everyone! i'm a junior in high school and i was wondering if anyone who is either done with apps or is still applying has anything they wish they knew in junior year or pointers. \n\nso far, i've (thankfully) finished my sat and i have ideas for a personal statement, but is there anything else you guys would suggest i should start doing now?",
  "author": "neveryoubetray",
  "created": 1638155830,
  "updated": 1638204431,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hmhj5dl": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhj5dl/",
      "text": "make sure you become close with your favorite teachers / employers / someone who will write your letters of recommendations",
      "author": "awesome_arthistorian",
      "created": 1638155898,
      "upvotes": 10,
      "replies": {
        "hmhks6y": {
          "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhks6y/",
          "text": "thank you! and yes i'm definitely gonna try to do that this year",
          "author": "neveryoubetray",
          "created": 1638156648,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmhk2ng": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhk2ng/",
      "text": "and i would also do some last minute extracurricular strengthening if you need to. my extracurricular section is underwhelming and i feel like it might potentially hurt my applications",
      "author": "catluver777",
      "created": 1638156320,
      "upvotes": 4,
      "replies": {
        "hmhkq7r": {
          "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhkq7r/",
          "text": "thank you so so so much for all your tips!! yeah i am trying to get closer with some teachers this year but i really haven't looked at where to apply/done tours yet so i'll need to get started. and we're in the same boat with ecs too i'm gonna have to do a lot this year 😭 but again thank you so much i hope you get into your dream school :)",
          "author": "neveryoubetray",
          "created": 1638156623,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmhjbyg": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhjbyg/",
      "text": "definitely determine which schools you're going to apply to now. i've only applied to two schools so far and i have no clue where else i should apply and i wish i would've researched schools wayyyy earlier",
      "author": "catluver777",
      "created": 1638155982,
      "upvotes": 3,
      "replies": {}
    },
    "hmhjmdt": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhjmdt/",
      "text": "also, make a good connection with a teacher now. junior year is a perfect time to find and make a connection with a teacher to write a letter of rec. they'll have your personality, work, and other traits at the top of their mind when writing the letter.",
      "author": "catluver777",
      "created": 1638156113,
      "upvotes": 3,
      "replies": {}
    },
    "hmhm6p7": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhm6p7/",
      "text": "try to get all a’s this year. Strengthen ec’s + try to secure leadership roles. Be unbelievably friendly in 2 classrooms.",
      "author": "Accomplished_Mix_416",
      "created": 1638157303,
      "upvotes": 3,
      "replies": {
        "hmhnnht": {
          "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhnnht/",
          "text": "yup i mean literally nobody gets straight a's at my school bc they're just so harsh but hey i can try :,) and yes i'm definitely working on leadership and connections with teachers so thank you!!",
          "author": "neveryoubetray",
          "created": 1638157988,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmhmwgl": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhmwgl/",
      "text": "Definenity try to get leadership roles in clubs, and as others have said become friends with 2 teaches, so just be around them enough that they know you. Also, the earlier you get things done, the less stress you will have! Good Luck next year!",
      "author": "ImprovementOk1498",
      "created": 1638157648,
      "upvotes": 3,
      "replies": {
        "hmhnsnc": {
          "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhnsnc/",
          "text": "thank you!! i'm trying to not procrastinate on my stuff bc it's a huge weakness for me. good luck to you too!!",
          "author": "neveryoubetray",
          "created": 1638158053,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmho2df": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmho2df/",
      "text": "Same thing as what others have said about preparing to get recs. I’d focus a lot on strengthening the EC/award section too—you have a whole semester left ahead and it’s actually a LOT of time to significantly strengthen extracurricular involvement and impact. My ECs went from basic club membership in sophomore year to having leadership, multiple awards, and my biggest ECs just in junior year. You can make this period of time super impactful if you seize the right opportunities. \n\nMaybe during winter break or when the year starts winding down around May/June, start researching colleges and scholarships (if necessary). I was making my college list up as I applied in senior year and can confirm from experience that it’s not ideal. Even if essays don’t need to all be finished over summer break, a college list and a couple essay ideas ideally should be.",
      "author": "rainingsiberiancats",
      "created": 1638158183,
      "upvotes": 3,
      "replies": {
        "hmhqejd": {
          "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhqejd/",
          "text": "thank you! so about the ecs - i've done things like organizing food drives and leading a tutoring program, but would you mind telling me what scale of awards you've gotten and how you discovered opportunities to get them? my nonacademic section is kinda underwhelming compared to what i've seen so i do need to bolster it a bit.",
          "author": "neveryoubetray",
          "created": 1638159296,
          "upvotes": 2,
          "replies": {
            "hmhs2bw": {
              "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhs2bw/",
              "text": "My awards were mostly in the speech and debate category. I got myself involved with a wider community and went to a bunch of tournaments in first semester, then used my expanded experience to apply for adjudicator positions in second semester for local tournaments (even though they’re typically not open to students) and organize a novice debate tournament. For me it was just a getting more involved and not being afraid to put my name out there and trying out for opportunities. If you’ve done organizing/leading type stuff, you’re ahead of where I was at the end of sophomore year. \n\nI’m not as familiar with what tangential opportunities are available related to what you’ve already done, but a general piece of advice I’d give is to just throw yourself at opportunities that interest you even if it seems unlikely you’d get them, based on your age/experience/anything. I thought I had 0 shot at adjudicator positions only grad student debaters got, but I got them. I thought I had 0 shot at getting an internship in my first year, but I have an internship lined up for the rest of my school year. You really don’t know unless you try, and I want to encourage people in general to just shoot their shot, because I let my lack of confidence keep myself from doing it and it only hurt me. Sorry I couldn’t offer advice more specific to your situation, but if you’re already on this sub, you got this!",
              "author": "rainingsiberiancats",
              "created": 1638160142,
              "upvotes": 2,
              "replies": {
                "hmhss1s": {
                  "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmhss1s/",
                  "text": "thank you so much, i really appreciate you taking the time to write this! i'll keep it in mind because i'm really not involved in academic competitions right now. just gotta go for it i guess!!",
                  "author": "neveryoubetray",
                  "created": 1638160507,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmi0bms": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmi0bms/",
      "text": "Dont do math online.",
      "author": "No_Yogurtcloset696",
      "created": 1638164728,
      "upvotes": 1,
      "replies": {}
    },
    "hmis3dk": {
      "link": "/r/ApplyingToCollege/comments/r4m1bi/advice_for_a_high_school_junior/hmis3dk/",
      "text": "So many amazing summer program opportunities close applications around this time. Apply, apply, apply! Not only does it get you prepared to write essays about yourself, but it can be tons of fun and really add to your ECs if you get into one of the prestigious research programs.",
      "author": "imrlysadrn",
      "created": 1638186422,
      "upvotes": 1,
      "replies": {}
    }
  }
}