{
  "sid": "r296ly",
  "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/",
  "title:": "Is it worth it to apply to a college if I hate the city it's in?",
  "text": "Hey guys, I was previously thinking of applying to USC and UCLA as they are both really good schools and they have good resources for CS. I like both campuses as well. However, I just went to LA for the LA Auto Show, which was held at the convention center and is right next to the Staples Center. It's supposed to be a really good area, but I honestly hated it. It was so dirty, the air smelled horrible (often like marijuana and/or trash), and there were several cracked out homeless people just circling the area so it felt dangerous. My question is, is it worth it to apply to USC and UCLA if I really dislike LA in general? To clarify, both USC and UCLA are reaches that are not at the top of my list (in terms of reaches, they're towards the bottom tbh).",
  "author": "HeisenbergNokks",
  "created": 1637882315,
  "updated": 1638206153,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.77,
  "comments": {
    "hm3c6e6": {
      "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3c6e6/",
      "text": "Nope. If there are schools that tick off more preferences than those schools, don’t bother. You save money, time, and effort. And you allow someone else who really wants to get there a better shot.",
      "author": "pupuphlatter",
      "created": 1637882913,
      "upvotes": 16,
      "replies": {}
    },
    "hm3jq13": {
      "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3jq13/",
      "text": "not at all. I heard that USC's surrounding area isn't that great (unsafe ig) anyway",
      "author": "InitialIdea923",
      "created": 1637886813,
      "upvotes": 6,
      "replies": {}
    },
    "hm3i2ku": {
      "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3i2ku/",
      "text": "Yeah it's fine if you can handle it for 4 years.\n\nYou don't have to live wherever you graduate from",
      "author": "ssssseabass",
      "created": 1637885929,
      "upvotes": 4,
      "replies": {}
    },
    "hm3cce6": {
      "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3cce6/",
      "text": "I’m from LA and idk much about USC but UCLA is in a very different and much nicer area than the Staples Center. You can survive most of your time in LA without going downtown, it’s a massive city. The Staples center is in downtown so that’s why it’s dirty because of where it is near.\n\nIf you do really despise LA though then don’t apply",
      "author": "Strickland23",
      "created": 1637882998,
      "upvotes": 9,
      "replies": {
        "hm3dgp0": {
          "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3dgp0/",
          "text": "I see, thanks for the input. That is what I've heard as well. UCLA is basically in Westwood, so it's a lot more suburban. I may just apply to UCLA then.",
          "author": "HeisenbergNokks",
          "created": 1637883563,
          "upvotes": 2,
          "replies": {
            "hm3dn7t": {
              "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3dn7t/",
              "text": "Good idea",
              "author": "Strickland23",
              "created": 1637883655,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hm3fsyr": {
      "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3fsyr/",
      "text": "Keep in mind UCLA is in a different part of town, so the feel is nicer (a lot nicer - UCLA is in Westwood, which is already nice, and that’s near Brentwood, Century City, & Bel Air of Fresh Prince fame (posh), and the Getty, which is beautiful and if you ever get the chance, go!). \n\nSome UCLA kids rarely go to downtown LA (dtla); they stay in the nice area of town nearish campus, & excursions are only to the beach & to local hip areas. I’m not crazy about where USC is located, but the university’s grounds are very nice, and USC, as a private university, will offer a completely different experience from a massive UC (you’re taken care of vs figure it out).\n\nEven tho I’ve just defended UCLA… and btw have you seen their dining hall ratings?, I’m not a super fan of UCLA because while Westwood is nice, LA traffic would kill me, and public transport is dismal in LA. \n\nPeople decide not to go (or apply) to schools because of weather, urban/suburban/rural locale, architecture, vibe… you name it! This forum is extremely focused on T20, but there are plenty of kids who pick based on quality of life factors. You have to be happy wherever you are. In your case, I’d argue DTLA doesn’t represent the feel of USC or UCLA at all, but I don’t know what your priorities are when choosing a campus.",
      "author": "pixelatedpix",
      "created": 1637884753,
      "upvotes": 5,
      "replies": {
        "hm3mtsz": {
          "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3mtsz/",
          "text": "Totally agree as a UCLA alumna. Spot on.",
          "author": "ZuzuBish",
          "created": 1637888441,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hm44aqs": {
      "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm44aqs/",
      "text": "I can say from experience: ABSOLUTELY, POSITIVELY FUCKITY-DUCK NO. do NOT do that to yourself. you will go insane and it's really hard to get A's when you're having a mental breakdown yeah",
      "author": "tarquinius_maximus",
      "created": 1637897686,
      "upvotes": 2,
      "replies": {
        "hm5bdm6": {
          "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm5bdm6/",
          "text": "So in your experience, did the city that the college is located in matter a lot? I'm basically trying to weigh the benefits of the colleges themselves vs. the downsides of the city (LA).",
          "author": "HeisenbergNokks",
          "created": 1637928941,
          "upvotes": 1,
          "replies": {
            "hm7ootj": {
              "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm7ootj/",
              "text": "yes. absolutely. I went to NYC because I got into a \"good school\" there and it was on paper the best opportunity I had by a huge margin. I didn't do much due diligence and was overconfident. life in the city was so overwhelming and high-stimulus that I started having panic attacks regularly and actually got physically ill towards the end of my 3rd semester. \"benefits\" can't be realized unless you're at a good baseline. it didn't matter that the school was so highly ranked when I was awake for 5 days at a time not eating or doing anything else.\n\nI'm an unusual and extreme example but I think the principle takeaway is that it *will* affect you at some level in a way that undermines the \"benefits\" of \"good\" schools in cities. exactly how much is sort of on you to understand.",
              "author": "tarquinius_maximus",
              "created": 1637970708,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hm3ivno": {
      "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm3ivno/",
      "text": "Sooo petty",
      "author": "allenrod1",
      "created": 1637886363,
      "upvotes": -2,
      "replies": {}
    },
    "hm4okgi": {
      "link": "/r/ApplyingToCollege/comments/r296ly/is_it_worth_it_to_apply_to_a_college_if_i_hate/hm4okgi/",
      "text": "Westwood is so far away from Downtown like an hour out",
      "author": "HuBidenNavalny",
      "created": 1637910195,
      "upvotes": 0,
      "replies": {}
    }
  }
}