{
  "sid": "r6qib0",
  "link": "/r/ApplyingToCollege/comments/r6qib0/a_new_message_in_my_application_portal_but_i/",
  "title:": "A new message in my application portal, but I never received a temporary pin to set up my account?",
  "text": "Okay so I know it’s shitpost wednesday but I’m genuinely confused :0. I applied to SUNY Geneseo yesterday evening, and today I got an email saying that I’ve got a new message/important news in my application portal. I tried to go log in but apparently I need a temporary pin, which I never had in the first place. I checked everywhere in my email, including trash and Spam, and I couldn’t find anything. The email came 30 minutes after the admissions office normally closes so I won’t hear from them by tomorrow the earliest. Is there any way I could get in there within the next day (my aid is done so I’ll be okay with that part), or will I have to wait with the anticipation of them telling me news that has absolutely nothing to do with my decision 😔\n\nedit: they just sent the pin for me to get into the account and damn i got deferred so quickly🧍🏾",
  "author": "Top-Kaleidoscope2700",
  "created": 1638396181,
  "updated": 1638478189,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hmutecr": {
      "link": "/r/ApplyingToCollege/comments/r6qib0/a_new_message_in_my_application_portal_but_i/hmutecr/",
      "text": "Patience, you must have, young Padawan.\n\nThe important message is probably that your application has been received. You’ll get the portal invite/pin in a day or two.",
      "author": "Strict-Special3607",
      "created": 1638397906,
      "upvotes": 1,
      "replies": {
        "hmv4dq5": {
          "link": "/r/ApplyingToCollege/comments/r6qib0/a_new_message_in_my_application_portal_but_i/hmv4dq5/",
          "text": "wow so true. patience it will have to be then 😔",
          "author": "Top-Kaleidoscope2700",
          "created": 1638402708,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}