{
  "sid": "rhjnln",
  "link": "/r/ApplyingToCollege/comments/rhjnln/unique_outcome_couldnt_have_left_me_more_stressed/",
  "title:": "Unique outcome couldn't have left me more stressed",
  "text": "My ED1 school deferred me today. Devastating because my plan was to fully commit to my ED2 school if I got anything other than an admission b/c at the time of the plan's creation I viewed the two schools basically equally. In the time since I've become *much* more attracted to my ED1 school. Now, since they deferred me, I will have to decide whether to go w/ the original plan or take my chances w/ what was the ED1 school by relinquishing the ED2 school's status as ED2. If I choose to go w/ the original ED2 plan, I have to give up my second chance at the ED1 school. Choosing the ED1 school (which is now regular decision) is very risky bc I was dependent on the ED1 status. I'm dependent on the ED2 status, too. This route may result in my denial from both schools. I have a lot of research pondering and being depressed to do. Way to ruin Christmas break + the next 3.5 - 4 months.",
  "author": "EngineCertain1189",
  "created": 1639632813,
  "updated": 1639786732,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hor1rve": {
      "link": "/r/ApplyingToCollege/comments/rhjnln/unique_outcome_couldnt_have_left_me_more_stressed/hor1rve/",
      "text": "I am in almost the same situation right now! I love my second choice a lot and was planning on applying ED2 to it if I got rejected from my 1st choice but I got deferred so I don't want to take the first choice off the table if I get accepted via ED 2 to my second choice. \n\nI found a few safeties that I like a lot also and I'd be okay going to them if all comes to worst. (Obviously still not the most ideal situation but...) \n\nIf you wanna talk abt it, you can always message me!",
      "author": "norahsquestions",
      "created": 1639636516,
      "upvotes": 1,
      "replies": {}
    },
    "horawfq": {
      "link": "/r/ApplyingToCollege/comments/rhjnln/unique_outcome_couldnt_have_left_me_more_stressed/horawfq/",
      "text": "take ed2 you’ll regret it later. you can always transfer or go to a comp grad",
      "author": "HatOnly9300",
      "created": 1639643227,
      "upvotes": 1,
      "replies": {}
    }
  }
}