{
  "sid": "r6w94j",
  "link": "/r/ApplyingToCollege/comments/r6w94j/astronomy_major_cant_afford_college/",
  "title:": "Astronomy major can't afford college.",
  "text": "So hear my plight... I'm looking to get a PhD in astrophysics. I live in northern Virginia close to GMU. My dad makes a ton of money but is only willing to give me about 8k a year for college. This means grants are pretty much out of the question and I have to pay the full brunt of tuition, housing, and all other costs. Without grants, out of state is just not an option leaving me 2 schools for my astronomy bachelors, GMU, which I can commute to putting the cost at about 14k, or UVA, which will be a around 35k including housing. After my undergrad, I am pretty sure I'll go to Leiden in the Netherlands (I can speak dutch because I am South African) for my masters and PhD. From what i've gathered online, Leiden is a cheap (cus EU) top tier astronomy school. The whole issue though is the cost of getting a masters there (because the PhD will pay for itself). If I go to GMU I will definitely be able to save money for grad school but I won't have as good of an undergrad education, while if I go to UVA, I'll get a strong undergrad  but I'll almost certainly be in debt going into grad school.\n\nI think going to GMU and saving is the smart decision as I may not financially even be able to go to grad school if I go to UVA, but at the same time I don't know if I'm shooting myself in the foot.\n\nLiterally any advice will be incredibly welcomed!",
  "author": "SirKoolKId",
  "created": 1638411821,
  "updated": 1638478177,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmvqb3r": {
      "link": "/r/ApplyingToCollege/comments/r6w94j/astronomy_major_cant_afford_college/hmvqb3r/",
      "text": ">The whole issue though is the cost of getting a masters there (because the PhD will pay for itself).\n\nA Master’s degree is ordinarily conferred “along the way” when doing a PhD… unless they do it differently in the Netherlands.",
      "author": "Strict-Special3607",
      "created": 1638412250,
      "upvotes": 2,
      "replies": {
        "hmvvzl1": {
          "link": "/r/ApplyingToCollege/comments/r6w94j/astronomy_major_cant_afford_college/hmvvzl1/",
          "text": "Ya I think it’s setup more as it’s own step within the EU rather than apart of the PhD like it is here.",
          "author": "SirKoolKId",
          "created": 1638414690,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmvxr4v": {
      "link": "/r/ApplyingToCollege/comments/r6w94j/astronomy_major_cant_afford_college/hmvxr4v/",
      "text": "A bit confused if you are currently looking for an undergrad program or a PhD program. But for undergrad, U of Arizona has one of the best astronomy programs in the country.  And they have guaranteed merit scholarships based on GPA that are listed on their website.",
      "author": "Octocorallia",
      "created": 1638415485,
      "upvotes": 1,
      "replies": {
        "hmw0iq7": {
          "link": "/r/ApplyingToCollege/comments/r6w94j/astronomy_major_cant_afford_college/hmw0iq7/",
          "text": "Ya sorry, im looking for a good undergrad course for my current situation and I did not know about the guaranteed scholarship, I will definitely look at that!",
          "author": "SirKoolKId",
          "created": 1638416771,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}