{
  "sid": "r3ehoj",
  "link": "/r/ApplyingToCollege/comments/r3ehoj/admissions_officers_at_top_schools_what_is_the/",
  "title:": "Admissions officers at top schools, what is the \"cutoff\"",
  "text": "We always hear about this cutoff for top schools. If you are below it, you automatically get rejected.\n\nBut what actually is it? 3.5? 3.6? 3.7?\n\nAnd how do test scores play into it? Say a 3.5 is below the cutoff but that applicant has a 1590 on the SAT. Will that prevent them from being automatically rejected?\n\nAnd what percent of applicants typically get automatically rejected because they don't make the cutoff?\n\nEdit: To give some personal context, I have a 3.72 UW (upward trend) and 1500 SAT which I'm insecure about because I feel like it might kill my chance of getting into a T20. I mean if I get rejected for other reasons that's fine but I'd hate to be auto rejected because of my stats",
  "author": "BrownSugar_17",
  "created": 1638022812,
  "updated": 1638205125,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 0.75,
  "comments": {
    "hm9z7fq": {
      "link": "/r/ApplyingToCollege/comments/r3ehoj/admissions_officers_at_top_schools_what_is_the/hm9z7fq/",
      "text": ">We always hear about this cutoff for top schools. If you are below it, you automatically get rejected\n\nWhile you may \"always hear about this cutoff,\" the people who say this have no insight into admissions.",
      "author": "skieurope12",
      "created": 1638023442,
      "upvotes": 51,
      "replies": {
        "hm9zml0": {
          "link": "/r/ApplyingToCollege/comments/r3ehoj/admissions_officers_at_top_schools_what_is_the/hm9zml0/",
          "text": "More often than not, anything that follows the words “I‘ve always heard…“ is utter nonsense.\n\nNot sure why so few people pick up on this pattern.",
          "author": "Strict-Special3607",
          "created": 1638023663,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hmae3ux": {
      "link": "/r/ApplyingToCollege/comments/r3ehoj/admissions_officers_at_top_schools_what_is_the/hmae3ux/",
      "text": "There may not be such a thing as a \"cutoff\" because individual schools grade so differently. I have a similar GPA/SAT and upward trend, but I also transferred schools and they determine grades differently from one another.",
      "author": "abenn_",
      "created": 1638030542,
      "upvotes": 8,
      "replies": {}
    },
    "hm9ypgt": {
      "link": "/r/ApplyingToCollege/comments/r3ehoj/admissions_officers_at_top_schools_what_is_the/hm9ypgt/",
      "text": "If you get an answer from a top-school AO, they will tell you that there is no hard cutoff… because GPA and test scores are only one part of an application.\n\nOf course, as GPA drifts lower the likelihood of being accepted drifts lower.  Also, as GPA drifts lower, so does the likelihood that test scores, ECs, essays, and LORs will be good enough to save an applicant.\n\nBut the simple fact is that it’s not as cut-and-dried as you’d like it to be.\n\nJust look at the Common Data Set for any top school and you’ll see enrolled students with high school GPAs and test scores well below whatever you might believe the “cutoff” to be for top schools.",
      "author": "Strict-Special3607",
      "created": 1638023175,
      "upvotes": 20,
      "replies": {}
    },
    "hmaxxzu": {
      "link": "/r/ApplyingToCollege/comments/r3ehoj/admissions_officers_at_top_schools_what_is_the/hmaxxzu/",
      "text": "A 3.72 UW and 1500 SAT are very strong. I’m sorry to hear that what you’re “hearing” about this process is telling you otherwise. There is so much focus (on this sub and elsewhere) on colleges which reject a lot (the vast majority) of their applicants. I encourage you to channel some of your focus and energy to at least some colleges that admit the majority (50%+) of their applicants, where you’ll be a strong candidate for admission and merit scholarships.",
      "author": "jjhoster",
      "created": 1638038974,
      "upvotes": 13,
      "replies": {}
    },
    "hmamqil": {
      "link": "/r/ApplyingToCollege/comments/r3ehoj/admissions_officers_at_top_schools_what_is_the/hmamqil/",
      "text": "What do you exactly mean by \"1500 SAT which I'm insecure about\"?",
      "author": "moiz20",
      "created": 1638034278,
      "upvotes": 6,
      "replies": {}
    },
    "hmaw0wk": {
      "link": "/r/ApplyingToCollege/comments/r3ehoj/admissions_officers_at_top_schools_what_is_the/hmaw0wk/",
      "text": "how are you insecure about a 1500… that’s a great score!",
      "author": "KingHootII",
      "created": 1638038163,
      "upvotes": 7,
      "replies": {}
    }
  }
}