{
  "sid": "qncium",
  "link": "/r/ApplyingToCollege/comments/qncium/how_important_are_macalesters_location_and/",
  "title:": "how important are Macalester's location and identity optional essays?",
  "text": "here are the briefs:\n\nMacalester is one of few highly selective liberal arts colleges located in the middle of a metropolitan area. Students benefit from the strong sense of community on campus and opportunities to engage in academic, social, and civic engagement options in the Twin Cities of Minneapolis and St. Paul. Have you thought about how Macalester's location might impact your experience? If so, in what ways?\n\nWe fully acknowledge application forms like this often require people to categorize their race, ethnicity, gender, and/or other identities by checking boxes. Two of Macalester's four values are Multiculturalism and Internationalism and one way we try to live these values is providing students space to express their identities \"\"beyond a check box.\"\" You may use this space to help us better understand the importance of one or more identities in your life and how they might shape your worldview.\"",
  "author": "No-Watercress-9116",
  "created": 1636123049,
  "updated": 1639808843,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hjf5f2z": {
      "link": "/r/ApplyingToCollege/comments/qncium/how_important_are_macalesters_location_and/hjf5f2z/",
      "text": "I think all supplemental essays are really important. It’s their way of seeing how you’ll fit best on their campus. It’s your job to show them that",
      "author": "admissionsmom",
      "created": 1636123439,
      "upvotes": 4,
      "replies": {}
    },
    "hlgiu15": {
      "link": "/r/ApplyingToCollege/comments/qncium/how_important_are_macalesters_location_and/hlgiu15/",
      "text": "The location one is very important since it demonstrates a lot of interest. If you are way above their needed stats and apply without it they could reject you because you aren’t serious about attending",
      "author": "Strickland23",
      "created": 1637459771,
      "upvotes": 1,
      "replies": {}
    }
  }
}