{
  "sid": "qojq7u",
  "link": "/r/ApplyingToCollege/comments/qojq7u/how_likely_is_caltech_and_other_schools_that_are/",
  "title:": "How likely is Caltech and other schools that are test optional for class of 21/22 to extend it for class of 2023?",
  "text": "I’m a current junior (class of 2023), and i’m considering cancelling my December SAT that I already signed up for since most colleges I’m interested in are test optional, but I’m also worried about the colleges that still require SAT for class of 2023. How likely are they to extend the test optional policy to class of 2023?",
  "author": "Few_Rooster_4497",
  "created": 1636270738,
  "updated": 1636654632,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjnhpfu": {
      "link": "/r/ApplyingToCollege/comments/qojq7u/how_likely_is_caltech_and_other_schools_that_are/hjnhpfu/",
      "text": "Caltech is not just test optional - they're test blind as of now... But generally speaking, many of the currently test optional schools will continue being so next year too... However, I wouldn't rely on this estimate, since some schools may stop being test optional if the pandemic stops being the reason for test cancellations in the next few months - if you can take the test, I would go ahead with it and then decide if you want to submit your scores.",
      "author": "prsehgal",
      "created": 1636273033,
      "upvotes": 10,
      "replies": {
        "hjpzhsi": {
          "link": "/r/ApplyingToCollege/comments/qojq7u/how_likely_is_caltech_and_other_schools_that_are/hjpzhsi/",
          "text": "they’re not test blind- it says “never required” on the common app which means they may review them if accessible",
          "author": "Vikovi",
          "created": 1636318542,
          "upvotes": 1,
          "replies": {
            "hjqcl13": {
              "link": "/r/ApplyingToCollege/comments/qojq7u/how_likely_is_caltech_and_other_schools_that_are/hjqcl13/",
              "text": "Always refer to the school's own website for their testing policy. If Caltech says that they're test blind, then they're test blind.",
              "author": "prsehgal",
              "created": 1636323890,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjnmr33": {
      "link": "/r/ApplyingToCollege/comments/qojq7u/how_likely_is_caltech_and_other_schools_that_are/hjnmr33/",
      "text": "Caltech will not be a prototype for other schools. Their reasoning was not the same as others.\n\nI certainly wouldn’t cancel plans to take the SAT, betting that all schools in which you might be interested will be test-blind. Even this year, a high test score will benefit your application at most schools. Outside of CA, most are optional, not blind.",
      "author": "RichInPitt",
      "created": 1636277817,
      "upvotes": 4,
      "replies": {}
    }
  }
}