{
  "sid": "rgdsdh",
  "link": "/r/ApplyingToCollege/comments/rgdsdh/i_cant/",
  "title:": "I cant.",
  "text": "Fuck it. I didn't want to do this but I cant hold it in anymore. It feels like everything is going down. Today was the worst day. My Midterms are going shit. I just got my 3rd ACT score which was absolutely horrific. Im an international needing aid and got deferred by my ED College I didnt even want to go to( bc it has a very bad program for my major; I applied purely for aid) I have got 3 rejections so far solely because of my financial status. Im from a stupid ass country where only the rich kids get into good univerisities. Im out here trying my best, doing everything that I can but failing in all possible ways. I dont know what's gonna happen in the future but I have no hope left from the rest of my applications. It sucks being an international.Im helpless at this point. And all I feel is, even if I do get accepted by a college in the US, it wouldn't be a good university like my friends will go to. I hate my life.",
  "author": "Cash-Feisty",
  "created": 1639506382,
  "updated": 1639823005,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hok3ytl": {
      "link": "/r/ApplyingToCollege/comments/rgdsdh/i_cant/hok3ytl/",
      "text": "Why do you blame it on being an international if your ACT score and midterms are bad?",
      "author": "ApplyingToCollege21",
      "created": 1639515086,
      "upvotes": 1,
      "replies": {
        "hokbszx": {
          "link": "/r/ApplyingToCollege/comments/rgdsdh/i_cant/hokbszx/",
          "text": "very likely they previously had great grades and their efforts aren't being rewarded in the same way they are for their better-off peers. besides it is a truth universally acknowledged that internationals looking for financial aid are fighting one hell of an uphill battle",
          "author": "none_oya",
          "created": 1639518296,
          "upvotes": 5,
          "replies": {}
        },
        "hokvrlo": {
          "link": "/r/ApplyingToCollege/comments/rgdsdh/i_cant/hokvrlo/",
          "text": "my midterms exams are being conducted by the govt, and due to covid they decided to change the pattern of the exam so it's so hard to take it. Throughput hs i had a 90%+ aggregate but idk if im gonna keep it like that anymore. And no i wasnt blaming this on being international, I just wanted write whatever bad things were happening in my life.",
          "author": "Cash-Feisty",
          "created": 1639526915,
          "upvotes": 2,
          "replies": {
            "hol4oad": {
              "link": "/r/ApplyingToCollege/comments/rgdsdh/i_cant/hol4oad/",
              "text": "This would be something to explain in the additional information section of the application. They should understand how people are affected by Covid.",
              "author": "ApplyingToCollege21",
              "created": 1639531004,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hokbqyr": {
          "link": "/r/ApplyingToCollege/comments/rgdsdh/i_cant/hokbqyr/",
          "text": "Well presumably the midterms weren’t auto uploaded OP’s colleges, but I see your point.",
          "author": "SupermarketWild3834",
          "created": 1639518273,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hok8txk": {
      "link": "/r/ApplyingToCollege/comments/rgdsdh/i_cant/hok8txk/",
      "text": "don’t give up yet. i’m sure you’ll get accepted a good school soon. i believe in you!",
      "author": "ObviouslyRedTurnip",
      "created": 1639517094,
      "upvotes": 5,
      "replies": {
        "hokbs7f": {
          "link": "/r/ApplyingToCollege/comments/rgdsdh/i_cant/hokbs7f/",
          "text": "No, literally!",
          "author": "SupermarketWild3834",
          "created": 1639518287,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}