{
  "sid": "r68i8e",
  "link": "/r/ApplyingToCollege/comments/r68i8e/i_misreported_what_semester_im_taking_ap_micro/",
  "title:": "I misreported what semester I’m taking AP Micro and Macro in",
  "text": "I was looking through my common app and I realized I reported I was doing AP Micro first semester rather than AP Macro and vice versa. Will this count as academic dishonesty and will it drastically affect my chances?? Also, do I need to contact all the colleges I applied to about this?",
  "author": "giogiorno11",
  "created": 1638340795,
  "updated": 1638478741,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmrousq": {
      "link": "/r/ApplyingToCollege/comments/r68i8e/i_misreported_what_semester_im_taking_ap_micro/hmrousq/",
      "text": "As long as the grades are correct and does not change the gpa, you are ok. But yes, definitely contact all colleges",
      "author": "svday",
      "created": 1638341657,
      "upvotes": 2,
      "replies": {
        "hmrr6d0": {
          "link": "/r/ApplyingToCollege/comments/r68i8e/i_misreported_what_semester_im_taking_ap_micro/hmrr6d0/",
          "text": "Yes, everything else is correct so I will probably just do that then. Thx!",
          "author": "giogiorno11",
          "created": 1638343332,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmroyp4": {
      "link": "/r/ApplyingToCollege/comments/r68i8e/i_misreported_what_semester_im_taking_ap_micro/hmroyp4/",
      "text": "I don’t think so. In my school AP Micro/Macro is all just a full year class and I don’t even think they people in it really know if they’re starting in micro or macro. it’s technically two different classes but most places it’s treated as a full year course. I wouldn’t look too much into it but if you want a second opinion, call their admissions officer and see what they say. You can’t unsend an email but asking a question can’t hurt. The one time i called to ask a question they didn’t ask my name or anything so they had no idea who i even was. So if you’re really stressing call and ask and they’ll tell you whether or not to email, or they might even be able to do something on their end for you.",
      "author": "mercymainaf",
      "created": 1638341733,
      "upvotes": 2,
      "replies": {
        "hmrr8np": {
          "link": "/r/ApplyingToCollege/comments/r68i8e/i_misreported_what_semester_im_taking_ap_micro/hmrr8np/",
          "text": "Yup I thought it was the same for me but turns out we do Macro first and I just found out 😭 but I will probably contact the colleges just in case. thanks!",
          "author": "giogiorno11",
          "created": 1638343379,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmsso74": {
      "link": "/r/ApplyingToCollege/comments/r68i8e/i_misreported_what_semester_im_taking_ap_micro/hmsso74/",
      "text": "For minor honest mistakes, I don’t think anybody will hold anything against you.",
      "author": "jwormbono",
      "created": 1638369345,
      "upvotes": 2,
      "replies": {}
    }
  }
}