{
  "sid": "q7923e",
  "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/",
  "title:": "Help is on the way Dear!",
  "text": "SUNY Help is Here!\n\nHere again to help any of you who have questions regarding the ***State University of New York*** colleges and universities! I am a current employee and alumni of a SUNY. Please ask any questions or DM me!! **Remember, no question is a dumb question!**\n\nSome helpful information as well to remember:\n\nEarly Decision/Early Action Deadline: November 1 (for most schools)\n\nRegular Decision: January 31 (for most schools)\n\nFAFSA Application: October 1\n\nComplete FAFSA NOW. The sooner you complete, the sooner you are in loan, grant and scholarship pools for the colleges you are applying to. YOU DO NOT NEED TO FINISH YOUR APPLICATION TO THE COLLEGE BEFORE FINISHING FAFSA. \n\nPlease ask any questions, concerns or comments and I will be happy to help or guide you!",
  "author": "vickycoco___",
  "created": 1634124275,
  "updated": 1639832254,
  "over_18": false,
  "upvotes": 28,
  "upvote_ratio": 0.95,
  "comments": {
    "hgh8lck": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgh8lck/",
      "text": "Thanks for being here",
      "author": "admissionsmom",
      "created": 1634130422,
      "upvotes": 6,
      "replies": {}
    },
    "hghbt61": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hghbt61/",
      "text": "is it ever sunny at SUNY ?\n\nsorry that was terrible but I couldn't resist",
      "author": "biggestchungus6",
      "created": 1634132017,
      "upvotes": 5,
      "replies": {
        "hgi4xr2": {
          "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgi4xr2/",
          "text": "Sonny, I'm sure you'll see for yourself.\n\n&#x200B;\n\n( I feel like this was worse? lol)",
          "author": "doptimisticidealist",
          "created": 1634144187,
          "upvotes": 3,
          "replies": {
            "hgi8fpz": {
              "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgi8fpz/",
              "text": "I need eye wash",
              "author": "biggestchungus6",
              "created": 1634145578,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hggywuj": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hggywuj/",
      "text": "As an in state applicant, is the acceptance rate higher than or the same as out of state applicants?",
      "author": "jbethel811",
      "created": 1634124789,
      "upvotes": 1,
      "replies": {
        "hggzxfc": {
          "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hggzxfc/",
          "text": "The acceptance is usually higher for in state students applying to their own in state institutions. However, grades are usually the deciding major factor",
          "author": "vickycoco___",
          "created": 1634125458,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgh50al": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgh50al/",
      "text": "Is SUNY Binghamton rolling admission ?",
      "author": "iamnotstupid11",
      "created": 1634128531,
      "upvotes": 1,
      "replies": {
        "hgisc0j": {
          "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgisc0j/",
          "text": "Yes, rolling but they do prefer applications by the deadline",
          "author": "vickycoco___",
          "created": 1634153493,
          "upvotes": 1,
          "replies": {
            "hgixy5b": {
              "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgixy5b/",
              "text": "Ok thanks",
              "author": "iamnotstupid11",
              "created": 1634155756,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgi6k2g": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgi6k2g/",
      "text": "What's the chance of getting a full ride as an international student at any of the SUNY universities?",
      "author": "powertothechick",
      "created": 1634144834,
      "upvotes": 1,
      "replies": {
        "hgis9gz": {
          "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgis9gz/",
          "text": "Very rare because SUNY is a state school so tuition is very low in general compared to private schools",
          "author": "vickycoco___",
          "created": 1634153463,
          "upvotes": 1,
          "replies": {
            "hgkk9di": {
              "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hgkk9di/",
              "text": "Very rare but possible I'm assuming. Thank you",
              "author": "powertothechick",
              "created": 1634182758,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhdl297": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hhdl297/",
      "text": "Hi!\n\nThank you for doing this, I have a question about graduate admissions.\n\nI am a \"non-traditional\" student (28F). I am hoping to apply to some graduate school programs after I graduate from SUNY Empire. My GPA is currently a 4.0 and I'm aiming to achieve a similar GPA by the end of this semester. I volunteer as a court-appointed special advocate in my community and prior to returning to school I was the chef of a restaurant in Brooklyn. I would really like to apply to the University of Albany's PSYD program but I'm worried that SUNY Empire has a bad reputation or isn't taken seriously. I don't have any negative experiences with the school or my classes but I have read some concerning opinions online. \n\nPrior to attending SUNY Empire, I attended SUNY New Paltz (3.8 gpa) and Hofstra University (Honors College). I have legitimate explanations for the gaps in my resume. \n\nSo, my question is:\n\nDo you have any insider information or views on SUNY Empire? Does a 4.0 gpa at this institution hold the same weight as it would at another SUNY school? I would really like to become a school psychologist, and UAlbany is my ideal school.\n\nThanks again!",
      "author": "mellowmeep",
      "created": 1634746459,
      "upvotes": 1,
      "replies": {
        "hhdsfa4": {
          "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hhdsfa4/",
          "text": "Hi there! Yes, going to SUNY Empire holds the same weight as any other school. Just because you’ve read some bad things, doesn’t always means it reflects your current college. They’ll view your based on your grades and you shouldn’t have any issues with getting into U Albany",
          "author": "vickycoco___",
          "created": 1634749336,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhw7j5v": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hhw7j5v/",
      "text": "Hi,\nMy daughter is looking at SUNY Canton (Mortuary Science.)\nWe're out of state applicants. Her extracurriculars are virtually non existent because of Covid. Her grades are decent. (Mostly B's, 3.3 GPA.)\nThere's not a lot of 4 year schools for this major, but I'm wondering how competitive admissions are. I want her to have realistic expectations. And I'm wondering if it's worth it to try to pad up the EC's.",
      "author": "momofweirdos74",
      "created": 1635101734,
      "upvotes": 1,
      "replies": {
        "hhywyuc": {
          "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hhywyuc/",
          "text": "Hi there. SUNY Canton is not difficult to get accepted into. They have an acceptance rate of about 80% percent. As for such a unique program, competition may be higher and more difficult, especially as a 4 year. For exact clarifications on this exact program since it is so niche, I would reach out directly to its representative Funeral Services Administration\nProgram Director\nDavid Penepent\n(315) 386-7170\npenepentd@canton.edu",
          "author": "vickycoco___",
          "created": 1635157308,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hloroox": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hloroox/",
      "text": "Hi sorry I’m a little late to the party but I could really use some advice on transferring! It’s a long complicated story so I’ll be brief \n\nI applied to stony Brook and got accepted back in 2018 and only stayed maybe 3 months max then dropped out due to financial issues and incompetence of the admissions/financial department staff. They wanted to hit me with a 13k$ bill even though I dropped out a day after the cut off date for Tuition and claimed I was an international student even though I have lived here my whole life (only bc I am on DACA). Long story short , they sent my bill to collections then sent it to the attorney generals office who dismissed my case so I have yet to pay the school anything. I also never spoke to anyone there after the fact due to the depression and anxiety the whole situation caused me but am planning to talk to someone this following week. \n\nMy question is this. I am now ready to go back to school and wish to go to FIT this coming fall after having gotten my associates at SUNY Suffolk community college in 2019 but am afraid that I have been “blacklisted” from ever getting a SUNY degree since this was one of the threats they used when trying to get me to pay. Is this a possibility even though suffolk gave me a degree no problem? I just really want to move on from this SBU drama but not sure what to do. Thank you for taking the time to read this 🙏",
      "author": "KmsotWorld",
      "created": 1637615922,
      "upvotes": 1,
      "replies": {
        "hlzkmld": {
          "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hlzkmld/",
          "text": "Blacklisting is not a thing and should not be an issue. The only issue I see is not getting the transcript from Stonybrook if you owe them money because you need ALL transcripts from every school you’ve attended to be accepted to a new school",
          "author": "vickycoco___",
          "created": 1637809435,
          "upvotes": 1,
          "replies": {
            "hmuarfb": {
              "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hmuarfb/",
              "text": "Thank you for this info it helps a lot I will definitely be speaking with someone about this!",
              "author": "KmsotWorld",
              "created": 1638390812,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmclibv": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hmclibv/",
      "text": "My daughter is an average student - 3.0 GPA. (Really bad struggles during virtual learning when locked down) - but is doing well over 3.8 this semester of senior year.  She has a few extra curricular activities but only one with leadership position.  She wrote about the struggles during covid for her personal statement to explain.  I am so concerned because of reading on line about all “these high stat AP, honors, cured cancer and preparing to go to the moon for Christmas” students  that she won’t get accepted to any college.   She applied to all the SUNY’s but I wonder what you think would make her stand out on her applications?  \n\nAlso, do they take into consideration the first report card of senior year on admissions?",
      "author": "Woody1918",
      "created": 1638065264,
      "upvotes": 1,
      "replies": {
        "hmhil0o": {
          "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hmhil0o/",
          "text": "If her overall GPA is a 3.0 she’s in decent shape. It just depends on the SUNY and specific program she applied to. I wouldn’t have personally wrote an essay about Covid as it’s not a unique essay or anything regarding that. She shouldn’t have too many issues getting into the smaller suny schools depending on the program",
          "author": "vickycoco___",
          "created": 1638155625,
          "upvotes": 1,
          "replies": {
            "hmiregi": {
              "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hmiregi/",
              "text": "Thank you for replying.  She actually did not write her essay about Covid.  She just added some explanation on the additional question prompt from Common App asking how Covid effected your education in high school.  I was trying to get an idea about how admissions takes this into consideration because now back at school she has first quarter of senior year  3.9 and second quarter expecting the same.",
              "author": "Woody1918",
              "created": 1638185907,
              "upvotes": 1,
              "replies": {
                "hmivc0r": {
                  "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hmivc0r/",
                  "text": "Overall GPA is the main concern. Seeing an upward trend is helpful but the entire 3 years is what matters and what courses she took and if she’s challenging herself her senior year course wide",
                  "author": "vickycoco___",
                  "created": 1638188694,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hosgceg": {
      "link": "/r/ApplyingToCollege/comments/q7923e/help_is_on_the_way_dear/hosgceg/",
      "text": "Do you think it would be possible to get into suny albany with a 3.28 as a transfer student? I am in my first semester of college looking to transfer for fall 2022",
      "author": "Human_Science_6980",
      "created": 1639668598,
      "upvotes": 1,
      "replies": {}
    }
  }
}