{
  "sid": "q6er9t",
  "link": "/r/ApplyingToCollege/comments/q6er9t/morning_announcements/",
  "title:": "Morning announcements",
  "text": "I would like to preface this post by saying that this is a bit of a silly and trivial question however, that will not stop me from asking it hahaha. I’m a current senior, and I do the morning announcements everyday at school (I say the pledge of allegiance, read announcements pertaining to athletics, clubs, school happenings etc). It takes up only about 10 minutes each morning, however I am one of two students who gets to read the announcements. Is it worthwhile to put this somewhere on my applications? Or is it not important enough to weave in? It feels too minuscule to put down as an activity but I do devote some of my time and energy towards it. Overall, I am conflicted and open to any advice pertaining to the subject.\nTLDR: I read the announcements everyday at school, it is not something super significant but I am wondering if there is a good way to communicate it on my college applications.",
  "author": "sarcasticsunflowerr",
  "created": 1634015426,
  "updated": 1634072811,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hgbkog6": {
      "link": "/r/ApplyingToCollege/comments/q6er9t/morning_announcements/hgbkog6/",
      "text": "I mean sure that's an EC and demonstrates public speaking ability",
      "author": "ssssseabass",
      "created": 1634015565,
      "upvotes": 9,
      "replies": {}
    },
    "hgbksii": {
      "link": "/r/ApplyingToCollege/comments/q6er9t/morning_announcements/hgbksii/",
      "text": "I’d def put it. If not in the activities then where would you tie it in?",
      "author": "admissionsmom",
      "created": 1634015644,
      "upvotes": 5,
      "replies": {}
    },
    "hgbohy1": {
      "link": "/r/ApplyingToCollege/comments/q6er9t/morning_announcements/hgbohy1/",
      "text": "At my school I think this responsibility/honor was delegated to someone in student government. Is there a similar club at your school that the announcement person is tied to? If so then you can just put that club and put read/led morning announcements as part of the description.",
      "author": "glutton2000",
      "created": 1634018289,
      "upvotes": 2,
      "replies": {}
    },
    "hgcgcz8": {
      "link": "/r/ApplyingToCollege/comments/q6er9t/morning_announcements/hgcgcz8/",
      "text": "Mention it. It shows that you and only one other person have been entrusted with something important.",
      "author": "R1ceroni",
      "created": 1634040945,
      "upvotes": 2,
      "replies": {}
    },
    "hgdnfwz": {
      "link": "/r/ApplyingToCollege/comments/q6er9t/morning_announcements/hgdnfwz/",
      "text": "Oh shoot I do this too and I didn't even think about whether to include it or not I should probably consider that",
      "author": "jcald34",
      "created": 1634060249,
      "upvotes": 1,
      "replies": {}
    }
  }
}