{
  "sid": "qywb9y",
  "link": "/r/ApplyingToCollege/comments/qywb9y/if_you_get_an_associates_at_a_community_college/",
  "title:": "If you get an associates at a community college and transfer to a 4 year university, will it take you 2 years to get your bachelors (if you have enough credits)",
  "text": "I’m not sure where to ask this question. I was thinking about going to cc to save $.",
  "author": "caris80",
  "created": 1637505599,
  "updated": 1637687923,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "hlihus0": {
      "link": "/r/ApplyingToCollege/comments/qywb9y/if_you_get_an_associates_at_a_community_college/hlihus0/",
      "text": "That’s how it’s supposed to work, yes. Just make sure all your credits will transfer.",
      "author": "Jamestown_Jimmies",
      "created": 1637505727,
      "upvotes": 9,
      "replies": {}
    },
    "hliidvw": {
      "link": "/r/ApplyingToCollege/comments/qywb9y/if_you_get_an_associates_at_a_community_college/hliidvw/",
      "text": "It’s been like 13 years since I’ve gotten my associates but that’s how it was back then. \n\nYou probably want to speak to admissions at the 4 year university you wanna go to and see if they will transfer credits from a community college. If I’m not mistaken, Most universities in a city work hand in hand with the community colleges in the area as they want students to transfer to the university to finish studies. \n\nHowever, take this with a grain of salt as I haven’t gone in years. Your best bet is to talk to the community college and university admission offices to ensure you have a good path you wanna take while saving some serious money. \n\nBtw: always remember to fill out a FAFSA application. Even if you don’t think you’ll qualify. Free money is free money.\n\nAll the best!",
      "author": "Mean_Hospital_1762",
      "created": 1637505982,
      "upvotes": 4,
      "replies": {}
    },
    "hlirui2": {
      "link": "/r/ApplyingToCollege/comments/qywb9y/if_you_get_an_associates_at_a_community_college/hlirui2/",
      "text": "If everything transfers, and the classes you choose fill the requirements for the four year degree, then yes that is doable.\n\nDefinitely look at the degree map for what you are thinking of studying at the four year school. There might be an articulation agreement that spells out exactly what the equivalent CC classes are which can help.\n\nPlanning ahead is important to avoid situations where you have enough credits, but can't take a course you need because you skipped a prerequisite -- for example you can't take some later engineering courses unless you have taken the required math as well as classes like statics and dynamics in advance.",
      "author": "BrawnyAcolyte",
      "created": 1637510113,
      "upvotes": 2,
      "replies": {}
    },
    "hlixn9c": {
      "link": "/r/ApplyingToCollege/comments/qywb9y/if_you_get_an_associates_at_a_community_college/hlixn9c/",
      "text": "Talk to a few four-year universities before you start at the community college to discuss how/if/which credits at the CC will transfer to the major you want to pursue at the 4-year universities.",
      "author": "jjhoster",
      "created": 1637512495,
      "upvotes": 2,
      "replies": {}
    },
    "hlisln0": {
      "link": "/r/ApplyingToCollege/comments/qywb9y/if_you_get_an_associates_at_a_community_college/hlisln0/",
      "text": "You don't even need to get an associate's degree.  You can graduate with two additional years at the 4Y school if:\n\n1. All of your CC credits transfer, and\n2. All of your transfer credits count toward some degree requirement,\n3. The degree you pursue doesn't require more than 4 years worth of credits (some do),\n4. The degree requirements don't involve any \"chains\" of course prerequisites with length greater than four.  e.g. you need \"D\" to graduate, but to take \"D\" you need to have taken \"C\", and to take \"C\" you need to have taken \"B\", and to take \"B\" you need to have taken \"A\".  And:\n5. The 4Y school doesn't require more than 4 semesters worth of credits \"in residence\" in order to award you a degree (different schools may have different requirements).",
      "author": "jayphoward",
      "created": 1637510423,
      "upvotes": 1,
      "replies": {}
    },
    "hlkkvj0": {
      "link": "/r/ApplyingToCollege/comments/qywb9y/if_you_get_an_associates_at_a_community_college/hlkkvj0/",
      "text": "If you take the correct courses for your intended major and transfer to a school that accepts your credits, this generally happens, yes.\n\n(Just don’t expect to take two years of basic elective courses and graduate MIT Engineering in two years.)",
      "author": "RichInPitt",
      "created": 1637536692,
      "upvotes": 1,
      "replies": {}
    }
  }
}