{
  "sid": "qkh9pf",
  "link": "/r/ApplyingToCollege/comments/qkh9pf/please_suggest_me_anyone_help_me/",
  "title:": "Please suggest me...! Anyone help me!",
  "text": "Result: 10th grade (4.59 out of 5) year 2017\n\n11th grade (4.83 out of 5) year 2018\n\n12th grade (4.00 out of 5) year 2019,\n\nEFC : 6000$\n\nSAT : No\n\nECAs :\n\n1. I founded a math club in school section. We usually assisted students of all levels. They helped one another by solving each other's academic challenges. Every week, we hosted \"weekly meetings\" for them to discuss as well as improve themselves.\n2. I twice participated in the Chemistry and Biology Olympiad at the divisional level/round.\n3. English debating (college section), it was not actually a professional debate.\n4. In 2017, I formed a volunteer team with friends who stood by the helpless people in our area. And I’m trying to expand it as much as possible.\n5. Founder & General Secretary \"The Home Of Dream Foundation \" (2020-active\\*).We are helping the needy & types of people & working in their interest to keep their dreams alive. We help them become Self-reliant.\n6. I recently worked in a volunteer group in the People's Republic of Bangladesh, which was helping people cope with the coronavirus and the recent disaster. Our major task was to make people aware by going from house to house, and distribute necessary things & foods to the victims of the situation. It was from March to end of 2020. Team leader in our area with a sizeable community of members.\n7. In this pandemic, for some days I stayed in a local hospital with some of covid-19 patient to care & help them at every moment.\n8. From 2015, every year I’m trying to teach 3-4 students for free who have financial crisis. In last 3 years I teach for free up to 20 students who are extremely weak in their academics and fear sitting in examination. Most of them were achieved an excellent result.\n9. At my school level, I was selected as computer mentor at the “Sheikh Russell Memorial Computer Club\". At that time I'd no computer or any kind of device. In the meantime in our areas, there were no chances to learn computer.\n10. Last year, I created a business where I provide job opportunities to unemployed people. I employed five workers full-time.\n11. I've a small library in my house where I've about 110+ books in my collections. And still trying to collecting more.\n12. I'm working (with helping some of my friends) for founding a public library in our local area.\n13. I recently started learning computer programming. In future I want to help our cyber security forces to protect corruption, In Sha Allah.\n14. I was the president of School Student Council 4 times in a row & in total 7 times. I was the class president most of the times.\n15. Working with some Social Organizations as an “Executive Member” .\n\n&#x200B;\n\nPlease recommend several colleges where I have a high probability of being admitted.",
  "author": "MH_Mehedi_01",
  "created": 1635782852,
  "updated": 1635890252,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {}
}