{
  "sid": "r67m3m",
  "link": "/r/ApplyingToCollege/comments/r67m3m/questions_about_letter_of_rec/",
  "title:": "Questions about letter of rec!",
  "text": "I’m planning on applying RD to a few schools (I applied to one school already, but it didn’t require lor); and I know nothing about letters of rec and I’m panicking. My main problems are: I still don’t know what schools I want to apply to (I know it’s bad; I plan on having a solid list of schools by the end of this week), and I haven’t requested any letters of recommendation yet. Anyway, I’m confused by the whole process of requesting/sending letters of rec, and I really need the following questions answered:\n\n1. Is it possible to request letters of rec before you even know what schools you will use them for?\n2. Do teachers send it directly to the school or do they send it to you?\n3. I’ve heard that you’re not supposed to read your letters of rec, but then how do you send them to colleges if you can’t see them?\n4. Do schools usually require them to be written by a counselor, or can they be written by teachers, or does it just depend on the school?\n5. Does it matter what subject the teachers who write your lor teach? I was planning on having 2 English teachers write mine because they genuinely know me the best, but will it look bad if they both teach the same subject? I don’t have as good of a relationship with my math/science teachers.\n\nPlease help :(",
  "author": "finegoodandcool",
  "created": 1638337433,
  "updated": 1638478734,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hmrjx92": {
      "link": "/r/ApplyingToCollege/comments/r67m3m/questions_about_letter_of_rec/hmrjx92/",
      "text": "1. Yes, LORs shouldn’t be specific to a college anyway\n\n2. You invite the teacher as a recommender on the common app, and they make their own account via an email that’s sent to them where they will upload their letter \n\n3. You don’t send them. The teachers upload it themselves. \n\n4. Different colleges have different LOR requirements. Many top colleges at least will require 1 counselor LOR and 1-2 academic subject teachers LORs. \n\n5. Some colleges have a requirement like MIT, where they ask for 1 stem rec and 1 non-stem rec. If you’re applying for a stem major, some colleges may require that at least 1 rec is from a stem teacher. If your colleges don’t have any such requirements, imo it’s not ideal but it’s not a problem.",
      "author": "rainingsiberiancats",
      "created": 1638338430,
      "upvotes": 2,
      "replies": {
        "hmrkpmz": {
          "link": "/r/ApplyingToCollege/comments/r67m3m/questions_about_letter_of_rec/hmrkpmz/",
          "text": "Agree with all of this. Ask asap to give your teachers a heads up when apps are due and that you’ll be making the formal request via common app. Allow teachers to plan since they will likely write for more than one student. \n\nSome colleges require up to 3. If you’re a humanities majors I would ask from two humanities and one STEM teachers. If you’re a STEM major, ask for letters from two STEM and one humanities teachers. That should cover it.",
          "author": "TwoSuns168",
          "created": 1638338923,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmrqdmb": {
      "link": "/r/ApplyingToCollege/comments/r67m3m/questions_about_letter_of_rec/hmrqdmb/",
      "text": "ok so no, you don’t need to know where you’re applying so ask ASAP and let them know you need it finished ASAP. You’re guidance counselor is the one who will send the letters so the colleges u apply to once they’re ready. You’re counselor is also the one who should send your transcript. Some schools require a letter specifically from your counselor you can see on common app under requirements if they require a counselor one. if not, a teacher will do just fine. but usually if they require a counselor they also want a teacher to go with it. And for your last point, I would try to get a teacher from a different subject. It doesn’t have to be math or science but it would help to get another subject, but it also depends what you want to do.",
      "author": "mercymainaf",
      "created": 1638342748,
      "upvotes": 2,
      "replies": {}
    }
  }
}