{
  "sid": "qqwx0o",
  "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/",
  "title:": "Opinions on IB?",
  "text": "planning to start the IBDP next year and I just wanted to see how people who took it feel about it. I know about how its rlly hard and 4.0 students get 5s, and I'm still gonna take it even tho my GPA is like 3.5 ish give or take. The teachers in my school say that if you have a good work ethic and Time management you'll be able to get 6s.",
  "author": "Ihasquestionspls",
  "created": 1636558178,
  "updated": 1645858702,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hk2zw3i": {
      "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk2zw3i/",
      "text": "I'm currently in IBDP Y2, and I can assure you that it's certainly manageable. 6's and 7's are definitely attainable if you have a good work ethic, and you'll end up learning a lot along the way.\n\nMost of my IBDP alumni friends also tell me that it has prepared them quite well for university. IB work ethic and practices tend to serve people well into their university years, and the content they've learned provides them with a solid base for their university courses.\n\nPersonally, I think it's great that you're going into the IB, and would suggest that you be prepared for some rigorous (but rewarding!) coursework. Your teachers are right - a good work ethic will be your best friend; it's hard to catch up when you're behind.",
      "author": "Washed_Bananas",
      "created": 1636560825,
      "upvotes": 2,
      "replies": {}
    },
    "hk32aew": {
      "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk32aew/",
      "text": "Currently an IBDP2 student and it, really, depends.\n\nIf you apply yourself from the beginning, pay attention in class, and study before tests, straight 7s are attainable.\n\nIf you don’t have an itch to learn or just hate independent study, the IB isn’t for you.",
      "author": "kaushalt18",
      "created": 1636561780,
      "upvotes": 2,
      "replies": {}
    },
    "hk2z2pk": {
      "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk2z2pk/",
      "text": "\\*for context, I'm an IBDP senior right now\n\nI was originally scared of IB because everyone in IB complains about how it's hell on earth and how they don't get sleep or have a social life. Now, that I'm almost done w/ IB, I can say that most of those people are weirdly just tryna brag about the rigor of the program they are in. It's not as hard as everyone says it is IMO, but you do need to have a good work ethic and you have to be willing to devote a significant amount of time to your studies. There will definitely be some really tough days, even weeks, where you won't get much sleep and you'll feel like a zombie. But this is not representative of a vast majority of the program. \n\nAlso, while IB tests are difficult to score high on, you will be taking most, if not all, of your tests at the end of senior year (after you get your college decisions). If you actually study and try, you'll most likely be able to get 4's and 5's (**at least**) and get your diploma. Overall, I would strongly recommend IB if you are hardworking, determined, and ready to devote a significant amount of time to school.",
      "author": "Ok_Place2147",
      "created": 1636560497,
      "upvotes": 2,
      "replies": {}
    },
    "hk2wcnz": {
      "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk2wcnz/",
      "text": "It depends on what classes you take, some are harder than others. It is definitely one of the most stressful curriculums. You’ll have to do an internal assessment in each subject, a 4000 word extended essay, 1600 word TOK essay + exhibition, CAS, plus the subject coursework/tests themselves. Good work ethic and time management definitely help, but it will still be quite difficult. The worst part is senior year cus that’s when most deadlines are. It’s up to you but if your school offers AP I’d take that instead. The difficulty of IB isn’t recognised enough to be worth the stress imo. \nHowever it does prepare you very well for college and it gives you a very well rounded education. If you want a challenge, take it.",
      "author": "GoatZizGoat25",
      "created": 1636559395,
      "upvotes": 1,
      "replies": {}
    },
    "hk3fuu4": {
      "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk3fuu4/",
      "text": "It’s doable, pick your course correctly though. I’m doing IB and math hl, physics hl and double language A is kicking my ass rn",
      "author": "shoedogodo",
      "created": 1636567013,
      "upvotes": 1,
      "replies": {}
    },
    "hk39fjq": {
      "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk39fjq/",
      "text": "Predicted a 44 IBDP2 student.\n\nIt is up to work ethic. People at my school with only slightly above average intellect who work their ass off can get a 36+.",
      "author": "accumulatowns",
      "created": 1636564545,
      "upvotes": 1,
      "replies": {
        "hk5rtds": {
          "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk5rtds/",
          "text": "You sound very r/iamverysmart lol\n\nWhat is average intellect?",
          "author": "kaushalt18",
          "created": 1636602041,
          "upvotes": 1,
          "replies": {
            "hk67368": {
              "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk67368/",
              "text": "I would say I myself am slightly above average (I just have a great memory and a half decent work ethic). \n\nI think I say that because I notice really dumb people have 36 predicted. I mean, it’s not that hard - 4 6s, 2 5s, and 2/3 points on EE/TOK will get you to a 36. No 7s required. \n\nThe course is hard, yes, but you should do it if you feel like you’re at least of average intellect. Rooting for you OP.",
              "author": "accumulatowns",
              "created": 1636610439,
              "upvotes": 1,
              "replies": {
                "hk6b4co": {
                  "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk6b4co/",
                  "text": "I’m not OP but yeah you’re right",
                  "author": "kaushalt18",
                  "created": 1636613206,
                  "upvotes": 1,
                  "replies": {
                    "hk6d0as": {
                      "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk6d0as/",
                      "text": "Oh, sorry, lmao",
                      "author": "accumulatowns",
                      "created": 1636614608,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hsu23h5": {
          "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hsu23h5/",
          "text": "How do you have good work ethic?",
          "author": "Jealous_Ordinary",
          "created": 1642291775,
          "upvotes": 1,
          "replies": {
            "hswair8": {
              "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hswair8/",
              "text": "Honestly, do it for five minutes. Then see if you want to do it more. The prospect (for me) of crossing things off a list is also good, too.",
              "author": "accumulatowns",
              "created": 1642338786,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk7na4f": {
      "link": "/r/ApplyingToCollege/comments/qqwx0o/opinions_on_ib/hk7na4f/",
      "text": "I got 43 points on my IBDP. I never took AP, but from what I heard, they are better: you are not chained to the same courses for two years, and you can take any combination of AP classes. IB forced me to take geography for two years, while in AP I could take two STEM courses in that time (I’m interested in STEM only)",
      "author": "peegmay",
      "created": 1636644774,
      "upvotes": 1,
      "replies": {}
    }
  }
}