{
  "sid": "qe4em4",
  "link": "/r/ApplyingToCollege/comments/qe4em4/do_your_earlier_highschool_grades_matter_that/",
  "title:": "Do your earlier highschool grades matter that much in admissions?",
  "text": "During my 9th and 10th grade years my grades were fairly average. Sure they weren't bad, hovering mostly around 87-88 / 100 (thats a 3.3 gpa I think?), but they weren't the best either. However in my junior and senior year, my grades have improved drastically, with my first quarter grades of senior year being at 3.9 UW. I'm really proud of how much i've improved, but i'm concerned that my earlier grades will hold me back. So will these grades hold me back, or is my freshman and senior year grades good enough already?",
  "author": "DizzyMint2",
  "created": 1634993749,
  "updated": 1635183395,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hhr4m83": {
      "link": "/r/ApplyingToCollege/comments/qe4em4/do_your_earlier_highschool_grades_matter_that/hhr4m83/",
      "text": "An upward trend is a good sign. Keep doing your best work and make sure your school counselor sends your first marking period or first semester grades to the colleges you’re applying to.",
      "author": "jjhoster",
      "created": 1635005497,
      "upvotes": 1,
      "replies": {
        "hhr94xs": {
          "link": "/r/ApplyingToCollege/comments/qe4em4/do_your_earlier_highschool_grades_matter_that/hhr94xs/",
          "text": "Its actually funny that I got a response from a SU admissions rep because SU is my first choice school. Although im applying to the school of design not engineering",
          "author": "DizzyMint2",
          "created": 1635007531,
          "upvotes": 2,
          "replies": {
            "hhrcwid": {
              "link": "/r/ApplyingToCollege/comments/qe4em4/do_your_earlier_highschool_grades_matter_that/hhrcwid/",
              "text": "That’s great! I would be happy to connect you with my colleagues in SU School of Design. Are you familiar with the portfolio requirements?",
              "author": "jjhoster",
              "created": 1635009199,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhqlyge": {
      "link": "/r/ApplyingToCollege/comments/qe4em4/do_your_earlier_highschool_grades_matter_that/hhqlyge/",
      "text": "Yes, grades are the most important factor in admissions decisions, and all you can do now is continue to do well in your senior year and apply to a balanced list of colleges.",
      "author": "AO585858",
      "created": 1634994561,
      "upvotes": 0,
      "replies": {}
    }
  }
}