{
  "sid": "ri71z1",
  "link": "/r/ApplyingToCollege/comments/ri71z1/im_applying_to_some_of_my_friends_dream_schools/",
  "title:": "I'm applying to some of my friends' dream schools. What do I do if I'm accepted and they're rejected?",
  "text": "I've pretty much gotten over my obsession with prestigious schools--I got into a mid tier school with a great scholarship, and I'll be stoked to go there if I don't get aid elsewhere. My friends, though, *have not* gotten over it and are at the absolute most stressed they've ever been. Unfortunately, we've applied to a lot of the same top-tier schools, and while I'm comfortable with rejection, I know they'll be crushed. UChicago has decisions coming out tomorrow. Me and one of my best friends both applied, but I don't emotionally need it and they do. I'm terrified that I'll get in and they'll get rejected. \n\nPeople who have been rejected and had friends get in, how can I be a good friend if that happens?",
  "author": "Pistachio625",
  "created": 1639709027,
  "updated": 1639807563,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hox0u2g": {
      "link": "/r/ApplyingToCollege/comments/ri71z1/im_applying_to_some_of_my_friends_dream_schools/hox0u2g/",
      "text": "im kinda in the opposite position because a close friend got into uchi with a questbridge scholarship already and im waiting on my result lol. if i get rejected heres what i would and wouldnt want: i dont want her to mention it to me until i say it first (like i dont want texts when the results come our asking for my status), i definitely do not want my friend to console me by degrading herself (“you should have gotten in over me”), and most importantly id just want time to process but for the most part just acting normal?? eventually id get over it",
      "author": "autumnhong",
      "created": 1639748862,
      "upvotes": 1,
      "replies": {
        "hozwkti": {
          "link": "/r/ApplyingToCollege/comments/ri71z1/im_applying_to_some_of_my_friends_dream_schools/hozwkti/",
          "text": "cool. thank you!!",
          "author": "Pistachio625",
          "created": 1639791539,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}