{
  "sid": "qh6bbx",
  "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/",
  "title:": "CS Major, does it matter what school I go to?",
  "text": "Hi guys,\n\nTo clarify my question a bit more, I am stuck between two major options. \n\nOption #1 go to UTSA (in my hometown which obviously requires less hastle). The pros to this are that the requirements to apply/get accepted are lower, it is in my hometown and i'd be able to stay with family and save, but the cons are that it isn't a tier 1 school.\n\nOption #2 go to UT Austin. The obvious issues here are the following:\n\nIn order just to APPLY to UT austin I need to take I believe up to Calc III/Linear Algebra and university level physics. I currently hold a 4.0 but I hear even students with 4.0's get turned down. I am an Air Force Veteran that served in real world/combat operations so that may help on an application but idk. The university has a fantastic cs program; however, I am unsure how much this matters in the real world and if it is worth going through the hell of taking these additional classes I mentioned above just for a chance to apply. Obvious cons are that I also have to move/relocate and pay more out of pocket to live in Austin (which is completely do-able, but slightly inconvenient). \n\nMy fear is putting in all that effort just to get denied and then end up going to UTSA anyway after the fact that I put in all that effort/time. Or, to find out that nobody in the CS world cares and that where I got my degree didn't provide me with any marginal benefit that was worth said effort.\n\nIf you guys could clarify my confusions i'd very much appreciate it!",
  "author": "Sunbro888",
  "created": 1635367965,
  "updated": 1636166346,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 1.0,
  "comments": {
    "hib43lf": {
      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib43lf/",
      "text": "A&M also an option, as much as I hate to send anyone that direction.  (Hook 'em).  Easier admit.  Maybe also Texas State if you're willing to drive up to San Marcos.",
      "author": "jayphoward",
      "created": 1635374524,
      "upvotes": 9,
      "replies": {
        "hib4ieg": {
          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib4ieg/",
          "text": "Is there anything around/to-do @ college station? I've never been.",
          "author": "Sunbro888",
          "created": 1635374705,
          "upvotes": 2,
          "replies": {
            "hib4rd9": {
              "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib4rd9/",
              "text": "Drink beer and go line dancing?  Heh.  I mean, I'm not a fan, but below UT-Austin and maybe UT-Dallas it's the most highly regarded public school in Texas.  AAU member, yadda yadda.  UT-Dallas is another option, btw.",
              "author": "jayphoward",
              "created": 1635374815,
              "upvotes": 7,
              "replies": {
                "hib4x9j": {
                  "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib4x9j/",
                  "text": "I shall put UT dallas on my list! I honestly LOVE dallas (despite having bad experiences with being hit and run/robbed the only 2 times I've been, haha)",
                  "author": "Sunbro888",
                  "created": 1635374887,
                  "upvotes": 3,
                  "replies": {
                    "hib94sk": {
                      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib94sk/",
                      "text": "A&M will feel much more like a traditional college than UT-Dallas I suspect.  Historically UT-Dallas had a lot of commuters, but I hear lately they've been building dorms and trying to convert to a more residential style school.  That said, since you're not an 18yo, you probably don't care about that anyway.  If you have a high SAT score (and esp. if you're a National Merit Finalist) then UT-Dallas is known to be generous with non-need-based aid, but I don't know what the situation is with applicants who aren't coming straight out of high school.\n\nOne other thing about A&M:  given how reverential the school is (in general) with regard to the armed services, it's possible they may have some special scholarships just for veterans.  Definitely something to look into.",
                      "author": "jayphoward",
                      "created": 1635376775,
                      "upvotes": 5,
                      "replies": {
                        "hib9ews": {
                          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib9ews/",
                          "text": "I shall look into A&M as well, the only major turn off for me with that particular school is I am from San Antonio and I love the big city environment. I was stationed in Abilene and HATED feeling the rural/small-town vibe, in some sense. Well actually... The community was much closer and people were more willing to socialize so I guess I can't say I hated it--- but you know what I mean, haha!",
                          "author": "Sunbro888",
                          "created": 1635376901,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hiapnv5": {
      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiapnv5/",
      "text": "You were military, you really shouldn’t be afraid of the challenge. And you shouldn’t be afraid of rejection. If you get accepted to UT, you will love it, and love having been a part of that. \n\nThat being said - meh, the name of your actual undergrad school doesn’t mean much.",
      "author": "BuffsBourbon",
      "created": 1635368584,
      "upvotes": 4,
      "replies": {
        "hiau5eb": {
          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiau5eb/",
          "text": "Honestly I really would love to go to UT. I love the challenge, but disappointment hurts like a bitch lol",
          "author": "Sunbro888",
          "created": 1635370371,
          "upvotes": 3,
          "replies": {
            "hiaxeum": {
              "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiaxeum/",
              "text": "Top Gun came out when I was a kid. I was sold. All I ever wanted to be from then on was a naval aviator. Growing up in Davis, CA, I had no idea how to go about that. Everyone told me I had to apply to the Air Force or Naval Academies. I sent my SATs and both wrote back saying my scores weren’t high enough. I took an SAT class to get my scores up, signed up again, selected the academies to have my scores sent to, took the test…ended up doing worse. Got a letter from both basically saying “look bro, stop.”  \nI ended up at CU Boulder and in ROTC, but not on scholarship because I couldn’t complete the calculus and physics requirements. My advisor said my time would be better spent back in CA at a state college and flying probably wasn’t for me. Even if I did get selected, my academics were so poor that I probably wouldn’t make it through flight school. \nI decided to stay at CU, put in for aviation and see what happens. \n25 years, 3500 hours, 650 arrested landing (300 of them at night), 4 Air Medals (80 combat missions) later- here I am, CAPT/O-6, in major command of a training wing. \nWhy?  Because when people said I might not make it and actually was rejected, I said “F you. Doing it anyway.”\n\nBasically, if you’d be ok NOT going to UT, then you shouldn’t be afraid of being rejected by UT.",
              "author": "BuffsBourbon",
              "created": 1635371692,
              "upvotes": 4,
              "replies": {
                "hiaybfx": {
                  "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiaybfx/",
                  "text": "Honestly this is inspiring and amazing. You're right, honestly, I feel like I'd rather live my life trying than never knowing at all. I'm academically savvy, that's always been a strength of mine, so I think it's worth a shot. Worst case scenario isn't even that bad in all honesty. Thank you so much for your words and for your contribution to our Air Force. I worked as an avionics technician for the B1 and it's always cool talking to a fellow pilot. Even though I've been out for awhile now, haha",
                  "author": "Sunbro888",
                  "created": 1635372065,
                  "upvotes": 2,
                  "replies": {
                    "hib3xar": {
                      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib3xar/",
                      "text": "If you apply to UT, I’d love to hear how that turns out.",
                      "author": "BuffsBourbon",
                      "created": 1635374447,
                      "upvotes": 2,
                      "replies": {
                        "hib44sa": {
                          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib44sa/",
                          "text": "It'll be some while, I still have some classes to knock out; however, I'll keep this post to reflect back onto and DM you from the future when I do apply xD",
                          "author": "Sunbro888",
                          "created": 1635374539,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "hiayu1d": {
                      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiayu1d/",
                      "text": "Glad I could help (if I did). But I’ve got bad news - while the B-one is badass…I’m navy.",
                      "author": "BuffsBourbon",
                      "created": 1635372279,
                      "upvotes": 1,
                      "replies": {
                        "hib000k": {
                          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hib000k/",
                          "text": "Oof, that is bad news, haha. 😂 jk but you have certainly helped",
                          "author": "Sunbro888",
                          "created": 1635372770,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hicoug8": {
      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hicoug8/",
      "text": "Here's my advice-\nTake those classes, learn those things you would need to learn to apply to UT Austin. They are a requirement because they'll help you in your CS studies. UT Austin is a good school with a very good CS program that will open many connections for you. \n\nTo answer your question, no I really don't think it matters which school you go to for your undergrad degree in CS. My aunt works as the Head of a Department of a FAANG company and regularly hires people. I asked her this exact question and she told me they don't even look for the name of your college unless you mention it in your resume. \n\nThat being said, if you like CS, you'll have a more intellectually stimulating experience at UT Austin. And if you don't get in, well... it didn't even matter in the first place.",
      "author": "makarov_skolsvi",
      "created": 1635403711,
      "upvotes": 4,
      "replies": {
        "hicsw6g": {
          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hicsw6g/",
          "text": "This relieves a ton of anxiety, thank you so much! And tbh I'm inspired to give it a shot anyway!",
          "author": "Sunbro888",
          "created": 1635407059,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hibriyo": {
      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hibriyo/",
      "text": ">In order just to APPLY to UT austin I need to take I believe up to Calc III/Linear Algebra and university level physics  \n\n\nUmmm…..no…..",
      "author": "RichInPitt",
      "created": 1635384955,
      "upvotes": 3,
      "replies": {
        "hibx9ng": {
          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hibx9ng/",
          "text": "Or rather, to be \"competitive\" it is recommended I take those classes, at least that's what I interpreted from the website.",
          "author": "Sunbro888",
          "created": 1635387504,
          "upvotes": 2,
          "replies": {
            "hic0tg6": {
              "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hic0tg6/",
              "text": "Bro I'm taking calc ab as a senior and I'm still applying to ut for cs",
              "author": "b3terbread",
              "created": 1635389117,
              "upvotes": 1,
              "replies": {}
            },
            "hicbbx6": {
              "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hicbbx6/",
              "text": "I’m pretty sure those are the courses you take in college lol.",
              "author": "Pokerface735",
              "created": 1635394521,
              "upvotes": 1,
              "replies": {
                "hifw6xu": {
                  "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hifw6xu/",
                  "text": "I should have added that I am trying to transfer from CC right now, haha",
                  "author": "Sunbro888",
                  "created": 1635460935,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hibx7s9": {
          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hibx7s9/",
          "text": "As a comp sci major I thought this was the case, am I under a misunderstanding?",
          "author": "Sunbro888",
          "created": 1635387480,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiao5jz": {
      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiao5jz/",
      "text": "u/FatFIRL Any input? I feel like you'd be a great help in this xD",
      "author": "Sunbro888",
      "created": 1635367997,
      "upvotes": 2,
      "replies": {
        "hidzhge": {
          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hidzhge/",
          "text": "For top tech companies (and any of the many companies that try to imitate the recruiting/screening/interview process), your college brand will not matter much. It certainly helps to make it past resume screening, but you can get a much higher return on passing this step by simply networking well and asking people for referrals. As a new grad you will also be indexed far more on past internship experience than GPA/pedigree.\n\nAlso, personally, I think college is absolutely worthless for CS other than learning the fundamentals, in which case they usually teach you necessary coursework later in your degree than you should learn it anyway. It is still somewhat of a gatekeep towards getting work experience (for example, applying for an internship) but for the most part, just pass your classes, and focus much more of your energy on personal learning, personal projects that interest you, networking/meeting people in the field, getting referrals, etc.",
          "author": "FatFIRL",
          "created": 1635433222,
          "upvotes": 2,
          "replies": {
            "hif7wy7": {
              "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hif7wy7/",
              "text": "Got it! So would you say in this case that pursuing going to say UT austin and delaying graduation by having to take these extra classes for a chance @ admission and spending more out of pocket to relocate to Austin would be unideal?",
              "author": "Sunbro888",
              "created": 1635450720,
              "upvotes": 1,
              "replies": {
                "hife212": {
                  "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hife212/",
                  "text": "Yes, I would say that",
                  "author": "FatFIRL",
                  "created": 1635453185,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hinclnw": {
      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hinclnw/",
      "text": "What was your military home of record/where did you live when you enlisted?",
      "author": "BuffsBourbon",
      "created": 1635605285,
      "upvotes": 1,
      "replies": {
        "hiom6ti": {
          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiom6ti/",
          "text": "San antonio",
          "author": "Sunbro888",
          "created": 1635624661,
          "upvotes": 1,
          "replies": {
            "hiot3yb": {
              "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiot3yb/",
              "text": "Have you looked into this\n\n[Hazelwood Act](https://www.tvc.texas.gov/education/hazlewood-2/)\n\nThis will pay for your college",
              "author": "BuffsBourbon",
              "created": 1635627772,
              "upvotes": 2,
              "replies": {
                "hip4ife": {
                  "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hip4ife/",
                  "text": "Yes! I was unsure if it would work for medical school though. Maybe it might?",
                  "author": "Sunbro888",
                  "created": 1635633020,
                  "upvotes": 1,
                  "replies": {
                    "hiq08yy": {
                      "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiq08yy/",
                      "text": "What??  Now I’m confused. I thought you were doing CS undergrad.",
                      "author": "BuffsBourbon",
                      "created": 1635649083,
                      "upvotes": 2,
                      "replies": {
                        "hiq0c66": {
                          "link": "/r/ApplyingToCollege/comments/qh6bbx/cs_major_does_it_matter_what_school_i_go_to/hiq0c66/",
                          "text": "I am lol sorry I thought this was another post",
                          "author": "Sunbro888",
                          "created": 1635649132,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}