{
  "sid": "qbsa2j",
  "link": "/r/ApplyingToCollege/comments/qbsa2j/very_stressed_about_test_optional_policies/",
  "title:": "Very stressed about test optional policies",
  "text": "I’m taking the ACT October 23 and I feel I have a good shot at getting a pretty good score but I could also not (the math section will be my downfall) \n\nI want to apply EA to a few of my more competitive schools because the program I am applying for is competitive and has limited spots and I’m hoping to get a good financial aid offer. \n\nThe issue is October scores will not come out until November 2nd. A day after the EA deadline. \n\nI know some schools give you extra time to report after the deadline and I do have the option to do that\n\nDo I have to say I am going to submit an ACT score on my application or can I put I am going test optional and still submit later on? \n\nIf I put yes I will submit and I end up getting much less than my desired score I’ve been told I still have to submit or else the application will be marked incomplete \n\nIf I put no and end up getting a good score then my chances of giving my average-ish application a boost for these competitive schools is gone.\n\nAny advice would be appreciated!",
  "author": "Hefty_Garlic6883",
  "created": 1634701832,
  "updated": 1634749682,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhblx70": {
      "link": "/r/ApplyingToCollege/comments/qbsa2j/very_stressed_about_test_optional_policies/hhblx70/",
      "text": "Either boost average application with better essays. Or boost math with more practice on just that section.",
      "author": "TritonTheCat",
      "created": 1634702133,
      "upvotes": 1,
      "replies": {
        "hhbnyk6": {
          "link": "/r/ApplyingToCollege/comments/qbsa2j/very_stressed_about_test_optional_policies/hhbnyk6/",
          "text": "I can never seem to get higher than a 26 😕 I will be dedicating the next few days to math though. My English and reading scores are very good and I could possibly get a near perfect on both. Science has been in the 28-31 range. So really I guess it all depends on what I encounter. My goal is only around a 32.",
          "author": "Hefty_Garlic6883",
          "created": 1634703293,
          "upvotes": 1,
          "replies": {
            "hhbu4xm": {
              "link": "/r/ApplyingToCollege/comments/qbsa2j/very_stressed_about_test_optional_policies/hhbu4xm/",
              "text": "If you get near perfect in English and reading, and a 30ish on science, even If you don’t do too well on math you could still get a low 30s composite score, which isn’t bad at all!",
              "author": "PlayCorvnet",
              "created": 1634707190,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhbmfnc": {
      "link": "/r/ApplyingToCollege/comments/qbsa2j/very_stressed_about_test_optional_policies/hhbmfnc/",
      "text": "if u get a better score then just send an email to the admissions officers at said school and update them :)",
      "author": "Toph-Beifong-FTW",
      "created": 1634702417,
      "upvotes": 1,
      "replies": {
        "hhbns94": {
          "link": "/r/ApplyingToCollege/comments/qbsa2j/very_stressed_about_test_optional_policies/hhbns94/",
          "text": "Thank you! I never thought of that! So is it best I go test optional then email them saying I wish to submit a score?",
          "author": "Hefty_Garlic6883",
          "created": 1634703189,
          "upvotes": 1,
          "replies": {
            "hhbpm80": {
              "link": "/r/ApplyingToCollege/comments/qbsa2j/very_stressed_about_test_optional_policies/hhbpm80/",
              "text": "Do you have any current score you can put in? If not, then yes, go test optional BUT IN ADDITIONAL INFO SECTION MAKE SURE TO CLEARLY STATE that you expect a score for the oct 23rd ACT by Nov 2nd and that they should look forward to an email from you",
              "author": "Toph-Beifong-FTW",
              "created": 1634704283,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhbwqy1": {
      "link": "/r/ApplyingToCollege/comments/qbsa2j/very_stressed_about_test_optional_policies/hhbwqy1/",
      "text": "Once you pick test optional, a LOT of schools won’t let you change that afterwards. \n\nAnd also each school has their own “cut off” SAT or ACT for their EA application. If they said that they accept 10/23 score for their EA consideration, you would be ok. You would need to find out from individual admission.",
      "author": "poohland",
      "created": 1634709095,
      "upvotes": 1,
      "replies": {}
    }
  }
}