{
  "sid": "q6x2u8",
  "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/",
  "title:": "What colleges should I consider? Just an ok student.",
  "text": "Gpa: 3.14 unweighted, 3.5 weighted\n\nSat: 1450\n\nCoursework: AP Comp-sci, AP Seminar, Pre-calc honors\n\nExtracurriculars: 3 years varsity tennis, 2 years varsity bowling, 1 year varsity golf, Urban planning course offered by temple, occasional work at farmers market, 2 years of choir, Volunteer at local tennis camp\n\nInterests: Pretty much open to most degrees. Only exceptions are I don’t wanna pursue humanities, physical sciences or engineering. No interest in law school, med school or anything like that. I do enjoy doing statistics, also interested in technology, business. I enjoy studying social sciences but I don’t want a pure social science degree (bad pay and unemployment)\n\nSub-40k without room and board\n\nPrefer Urban but suburban isn’t a big deal at all\n\nSchools ive already considered: \n\nUmass, Temple, UD Uvm, Sjsu, Cu Boulder, Drexel(targets, hope i can get merit aid for the last two)\n\nReaches: SDSU, Fordham (no idea how I’d pay for that) , Umd (big reach) Udub",
  "author": "QueasyFig6450",
  "created": 1634076999,
  "updated": 1634570991,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hget7bn": {
      "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hget7bn/",
      "text": "\"Best\" public school in your state is usually a strong contender.",
      "author": "jayphoward",
      "created": 1634077444,
      "upvotes": 1,
      "replies": {}
    },
    "hgex1kv": {
      "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hgex1kv/",
      "text": "With those stats I believe you can definitely add Iowa/Iowa State - both solid schools with welcoming campuses and Alabama as target schools who are very willing to give merit aid to OOS students (as long as you don’t mind the location too much), maybe UIC (bit of a commuter school but right in Chicago)/Seattle U (underrated) for very urban places that will be under 40k before room and board - Seattle will cost more but 92% of students get financial aid so they can probably get you to a number that works if admitted - UPortland, UDenver, San Francisco, UHouston\n\nThere’s more if I really looked, and some of them are a higher prestige than others, but with your budget and SAT there’s a lot of schools that you have a realistic shot at, along with some safeties if you don’t mind going to directional schools",
      "author": "myfedoraismlg",
      "created": 1634079135,
      "upvotes": 2,
      "replies": {}
    },
    "hgewlmu": {
      "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hgewlmu/",
      "text": "Are you in state in CA or WA?",
      "author": "the_journeyman3",
      "created": 1634078935,
      "upvotes": 1,
      "replies": {
        "hgf4oxg": {
          "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hgf4oxg/",
          "text": "PA actually",
          "author": "QueasyFig6450",
          "created": 1634082663,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgfdqrr": {
      "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hgfdqrr/",
      "text": "“Just an ok student”\n\nAt my school, you would be pretty outstanding. The only not so great thing is that your gpa is kinda low. But still, you are certainly in a good spot especially with that phenomenal sat score.",
      "author": "Voldemort57",
      "created": 1634086896,
      "upvotes": 1,
      "replies": {
        "hgfeasw": {
          "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hgfeasw/",
          "text": "Yeah my high school is notoriously pretty competitive. Any schools you’d recommend based off my stats?",
          "author": "QueasyFig6450",
          "created": 1634087147,
          "upvotes": 1,
          "replies": {
            "hgfmi6p": {
              "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hgfmi6p/",
              "text": "I’ve no clue about east coast schools. But I have a lot of recommendations if you are looking on the west coast.\n\nThe west coast doesn’t have many “Ivy league” schools. Which, if you’re like me, doesn’t matter because I’m not that dedicated to having the best essays, best extracurriculars, best private counselor, and best everything else to get into a college that accepts 2% of applicants. \n\nThe colleges I want to go to are what many on this sub would consider safeties or targets lol.",
              "author": "Voldemort57",
              "created": 1634090925,
              "upvotes": 1,
              "replies": {
                "hggua1t": {
                  "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hggua1t/",
                  "text": "Would love to hear ur suggestions for west coast",
                  "author": "QueasyFig6450",
                  "created": 1634121369,
                  "upvotes": 1,
                  "replies": {
                    "hgjkxen": {
                      "link": "/r/ApplyingToCollege/comments/q6x2u8/what_colleges_should_i_consider_just_an_ok_student/hgjkxen/",
                      "text": "Alright!\n\nSome of my target schools in California are pretty much any of the UCs except Berkeley and Los Angeles (which are waaay more competitive). My personal favorite UCs are San Diego and Davis, but all are great. They all have different pros and cons. For example, Davis is close to the state Capitol for all those pesky political science majors. \n\nThere’s University of San Diego, which is great if you want the urban beachy vibes of Southern California. University of Washington is another school I would attend in a heartbeat. Both have an acceptance rate of ~50% and are quite urban. \n\nThere’s the University of Oregon and Oregon State University, and Portland State Univeristy which are all pretty easy to get into with 80-96% acceptance rates. \n\nI would just google “USNews top colleges in X state” and that will give you a good idea of what colleges are in each state.",
                      "author": "Voldemort57",
                      "created": 1634165625,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}