{
  "sid": "regplo",
  "link": "/r/ApplyingToCollege/comments/regplo/22_gpa_and_lost_need_help/",
  "title:": "2.2 gpa and lost need help",
  "text": "I have struggled with school and started to build my life together this past year I currently have a 3.5 gpa for my senior year but only adds up to a 2.2 for my last 4 years. I really want to go to university but don’t know where I already am completely informed about community college and will probably end up there however I at least want to try applying to colleges and universities. Is  there any universities that would give me a slight chance of getting accepted or even a program that I can start right now that would give me a guaranteed admission by the fall or spring semester of 2022 all given advice will definitely be taken into consideration and appreciated. \n(I rushed while typing this so my bad if I messed up a couple time)",
  "author": "Creepy_Note6181",
  "created": 1639282301,
  "updated": 1639514989,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "ho7js3i": {
      "link": "/r/ApplyingToCollege/comments/regplo/22_gpa_and_lost_need_help/ho7js3i/",
      "text": "Take the CC route - especially if you are in CA. It wipes your GPA slate clean. You can transfer to top universities two years down.",
      "author": "svday",
      "created": 1639283554,
      "upvotes": 10,
      "replies": {}
    },
    "ho7iln6": {
      "link": "/r/ApplyingToCollege/comments/regplo/22_gpa_and_lost_need_help/ho7iln6/",
      "text": "Can you take an SAT/ACT?  There are some schools out there that have auto admissions based on a test score as long as you have passed enough core high school classes.  University of Nebraska will admit with a 20 ACT / 1040 SAT for example.\n\nYour state might have some schools where your drastically improved grades might help a lot.  Where I live that's Metro State in Denver - 2.6 GPA is the standard for auto admission, but they will consider students with lower stats with a letter of recommendation and essay (and will auto admit 20+ year old students who have a GED or high school diploma).  It's possible your state has some similar options.",
      "author": "BrawnyAcolyte",
      "created": 1639282917,
      "upvotes": 4,
      "replies": {}
    },
    "ho7idg1": {
      "link": "/r/ApplyingToCollege/comments/regplo/22_gpa_and_lost_need_help/ho7idg1/",
      "text": "Im not the most informed on this but there are certain universities such as ASU that will let you in guaranteed if you meet certain testing requirements.  \n\nHere is a link for more information: \n\nhttps://admission.asu.edu/first-year/apply\n\nOther than that I don’t really know much but best of luck on your journey, you got this!",
      "author": "PeanutGlass1605",
      "created": 1639282798,
      "upvotes": 2,
      "replies": {}
    },
    "ho7qct4": {
      "link": "/r/ApplyingToCollege/comments/regplo/22_gpa_and_lost_need_help/ho7qct4/",
      "text": "Any of the public schools in Mississippi will admit you if you score high enough on the ACT.",
      "author": "FullPrice4LatePizza",
      "created": 1639287164,
      "upvotes": 1,
      "replies": {}
    }
  }
}