{
  "sid": "q9ajfv",
  "link": "/r/ApplyingToCollege/comments/q9ajfv/how_do_colleges_match_scores/",
  "title:": "How do colleges match scores?",
  "text": "So I’m applying to college, and I have to send my SAT and TOEFL scores. I know these are sent through the CB and ETS websites respectively. However, will I need to confirm any details on the application or will the college match the score to the application?\n\nOne more thing, I read that the college uses name to match scores. I am an international student, and where I’m from, we don’t have first/last names. Our passport just has a “name” field. I am applying using the first 2 names and I used the same name on my SAT. On my TOEFL however, I had the option to use a \"name\" field as on my passport and so I typed in my first 4 names. I will give an example to illustrate (this is not my real name, nor do I know anyone with this name):\n\n* Passport Name: Liam Noah Oliver Elijah William James Benjamin Lucas Henry Alexander\n* SAT and College Application Name: Liam Noah\n* TOEFL Name: Liam Noah Oliver Elijah.\n\nWould they still be able to match the documents? I have already heard that they are fine with some variation, but is this too much?",
  "author": "ioannes9",
  "created": 1634385328,
  "updated": 1634423268,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hguo6bc": {
      "link": "/r/ApplyingToCollege/comments/q9ajfv/how_do_colleges_match_scores/hguo6bc/",
      "text": "Don't worry, they should be able to match it and you'll see the results on your application portal.",
      "author": "prsehgal",
      "created": 1634385913,
      "upvotes": 4,
      "replies": {
        "hguornn": {
          "link": "/r/ApplyingToCollege/comments/q9ajfv/how_do_colleges_match_scores/hguornn/",
          "text": "Thank you very much. Is the portal separate for each university or is there one unified portal?",
          "author": "ioannes9",
          "created": 1634386315,
          "upvotes": 1,
          "replies": {
            "hguov3l": {
              "link": "/r/ApplyingToCollege/comments/q9ajfv/how_do_colleges_match_scores/hguov3l/",
              "text": "Separate... They'll send you the login details a few days after you submit the application.",
              "author": "prsehgal",
              "created": 1634386380,
              "upvotes": 2,
              "replies": {
                "hgup2it": {
                  "link": "/r/ApplyingToCollege/comments/q9ajfv/how_do_colleges_match_scores/hgup2it/",
                  "text": "Thank you so much.",
                  "author": "ioannes9",
                  "created": 1634386522,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}