{
  "sid": "ri97pa",
  "link": "/r/ApplyingToCollege/comments/ri97pa/feeling_lost_after_ed_rejection_bombshell/",
  "title:": "feeling lost after ED rejection + bombshell target/safety deferral",
  "text": "So I was rejected from my reach ED (Villanova), not unexpected but still sorta hurt. Then today I was deferred from UVM which REALLY hurt since I really thought that would be a slam dunk. Really woke me up to the fact that none of this will be easy and all bets are off.\n\nNow I feel I have to apply ED II to Denison or American, and I like both but I'm not in love with either. TBH I don't love any other college I have a shot at getting into for that matter. I think I have to do ED II to Denison but ugh I just wish I had a school I \\*really\\* wanted to go to. I have a 90/100 average, 90/300 in my class and a 1250 SAT so I'm going test optional.\n\nI applied to Pitt, Utah, CU Boulder, Wheaton MA and Macalester so far. I dunno if any of those will work out in terms of FA.\n\nMaybe I'll just go to my state school (UNH) and call it quits on this pain. I just really wish I did a little better in high school so I could break into the next level of schools (like a NESCAC) :(\n\nSorry for the rant, just needed to release all this somewhere and looking for some moral support 😔",
  "author": "pododog",
  "created": 1639716019,
  "updated": 1639785784,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.79,
  "comments": {
    "hovzdzt": {
      "link": "/r/ApplyingToCollege/comments/ri97pa/feeling_lost_after_ed_rejection_bombshell/hovzdzt/",
      "text": "Hey, sorry man. This exact same thing just happened to my kid. He was rejected ED and then UOregon deferred him. Oregon! Like wth, is everyone racing to be a Duck in Eugene?! \n\nAnyway, we're right there with you. Competition is hard this year, especially in some majors (my kid is doing CS) but there are a lot of good schools still out there. You don't have to settle yet. \n\nGood luck.",
      "author": "LadyMjolnir",
      "created": 1639723767,
      "upvotes": 4,
      "replies": {}
    },
    "hovo0ug": {
      "link": "/r/ApplyingToCollege/comments/ri97pa/feeling_lost_after_ed_rejection_bombshell/hovo0ug/",
      "text": "You don’t have to ED 2 if you don’t have a top school!",
      "author": "ablaha51",
      "created": 1639716996,
      "upvotes": 1,
      "replies": {
        "hovo6uh": {
          "link": "/r/ApplyingToCollege/comments/ri97pa/feeling_lost_after_ed_rejection_bombshell/hovo6uh/",
          "text": "yeah ik its just I'm really worried about my chances if i go all in for RD.",
          "author": "pododog",
          "created": 1639717086,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}