{
  "sid": "rfvthv",
  "link": "/r/ApplyingToCollege/comments/rfvthv/good_gpa_extracurriculars_but_terrible_psat/",
  "title:": "Good GPA, Extracurriculars but terrible PSAT",
  "text": "I’m a junior (16) at an IB school looking to attend a quality institution in hopes of getting a double major in Poli. Sci. and some STEAM. Currently finishing Sem. 1 my GPA is 4.3448. I participate in varsity sports as well as giving community service. I like to think I’m very well rounded and have a strong, respectable character. Unfortunately, I lack the expertise in doing well on standardized testing, recently I got my PSAT score back. I got a 1040. I did better in Reading and Writing but pretty average in Math. \n\nHow crucial is it to have a good SAT/ACT score? And how can I compensate for this? Is it possible I still get in a good school like Berkeley if I manage to maintain my current figures? \n\nSorry if this comes off as bragging, I genuinely just want to know whether or not I need to improve.\n\nThanks",
  "author": "Makenchis",
  "created": 1639445791,
  "updated": 1639514201,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hogfc7u": {
      "link": "/r/ApplyingToCollege/comments/rfvthv/good_gpa_extracurriculars_but_terrible_psat/hogfc7u/",
      "text": "We’ll just don’t submit your scores.  If I’m not mistaken, the UC’s are test blind anyway, so they don’t even look or consider them",
      "author": "Avytar",
      "created": 1639446314,
      "upvotes": 5,
      "replies": {}
    },
    "hogfo9z": {
      "link": "/r/ApplyingToCollege/comments/rfvthv/good_gpa_extracurriculars_but_terrible_psat/hogfo9z/",
      "text": "I got an 1110 on the psat then got a 34 on the act. It’s just about how much effort you want to put in. Good luck",
      "author": "model1233",
      "created": 1639446469,
      "upvotes": 3,
      "replies": {}
    },
    "hoggdyg": {
      "link": "/r/ApplyingToCollege/comments/rfvthv/good_gpa_extracurriculars_but_terrible_psat/hoggdyg/",
      "text": "ucs don't care about sat/act scores anymore so don't even submit them if you don't want to",
      "author": "labyrinthariadne",
      "created": 1639446793,
      "upvotes": 2,
      "replies": {}
    }
  }
}