{
  "sid": "r3pscr",
  "link": "/r/ApplyingToCollege/comments/r3pscr/is_my_alma_mater_a_no_name_school/",
  "title:": "Is my alma mater a \"no name school\"?",
  "text": "I gradauted some time ago from Florida State University and when I was still a HS student, a teacher who I think attended UF mentioned to me about some concern about a \"no name\" or picking a state school over an Ivy League college. Obviously I chose the former since I prefer a college nearby me and ultimately would be better off relying on my gifts, skills, and achievements, than relying on the pedigree of an Ivy League college. Also, I had doubts if I was Ivy League material.",
  "author": "tempthrowaway4792200",
  "created": 1638055363,
  "updated": 1645837659,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmc0fyl": {
      "link": "/r/ApplyingToCollege/comments/r3pscr/is_my_alma_mater_a_no_name_school/hmc0fyl/",
      "text": "Your teacher is a moron. The vast majority of people could go to school literally anywhere and it would make no difference.",
      "author": "TheKaraokeSinger",
      "created": 1638055504,
      "upvotes": 6,
      "replies": {
        "hmc0klv": {
          "link": "/r/ApplyingToCollege/comments/r3pscr/is_my_alma_mater_a_no_name_school/hmc0klv/",
          "text": "But what about the Ivy league?",
          "author": "tempthrowaway4792200",
          "created": 1638055562,
          "upvotes": 2,
          "replies": {
            "hmc1gyh": {
              "link": "/r/ApplyingToCollege/comments/r3pscr/is_my_alma_mater_a_no_name_school/hmc1gyh/",
              "text": "Yeah, their names matter, but only in the most elite positions. The vast majority of people just need a degree and relevant experience. Shitting on somebody for going to FSU makes no sense.",
              "author": "TheKaraokeSinger",
              "created": 1638055972,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hmco82e": {
      "link": "/r/ApplyingToCollege/comments/r3pscr/is_my_alma_mater_a_no_name_school/hmco82e/",
      "text": "It's not as reputable as the ivies, but frankly that doesn't matter that much for 99%+ of jobs — as you said, your skills matter much more",
      "author": "Stq1616",
      "created": 1638066588,
      "upvotes": 1,
      "replies": {}
    },
    "hmd5o2f": {
      "link": "/r/ApplyingToCollege/comments/r3pscr/is_my_alma_mater_a_no_name_school/hmd5o2f/",
      "text": "A) guarantee the comment was tongue and cheek. They are huge rivals so a UF grad would naturally disparage FSU\n\n2) FSU has actually been climbing the rankings in USNWR (which is kind of the bench mark of prestige) and is placed pretty well right now\n\nd) Unless you went to a few of the schools some of the folks on A2C are gunning for (MIT, Chicago, CWRU, etc…not even including Ivies) then you have some attachment to your school’s athletic teams and know something of other schools. Ergo, for 90% of the people who’ve gone to school in the US, they know exactly who the hell FSU is. Huge Football, baseball, and basketball powerhouse in the late 90s-2000s\n\nWeird thing is, if you actually graduated from FSU, you should be fully aware of the perception of that school.",
      "author": "BuffsBourbon",
      "created": 1638075545,
      "upvotes": 1,
      "replies": {}
    },
    "hmfpr58": {
      "link": "/r/ApplyingToCollege/comments/r3pscr/is_my_alma_mater_a_no_name_school/hmfpr58/",
      "text": "Anyone who unironically uses the term \"no name\" is a weirdo. Pay no regard to what your teacher says.",
      "author": "SpidersInMyWalls",
      "created": 1638127986,
      "upvotes": 1,
      "replies": {}
    },
    "hrejhh2": {
      "link": "/r/ApplyingToCollege/comments/r3pscr/is_my_alma_mater_a_no_name_school/hrejhh2/",
      "text": "FSU is not a no name school LMFAO",
      "author": "Emergency_Goose5777",
      "created": 1641416220,
      "upvotes": 1,
      "replies": {}
    }
  }
}