{
  "sid": "qgfj2i",
  "link": "/r/ApplyingToCollege/comments/qgfj2i/is_talking_about_an_old_problem_and_in_an_essay/",
  "title:": "Is talking about an old problem and in an essay considered bad?",
  "text": "TW: Seizures\n\nOkay. I experienced Epileptical seizures for… almost 6 years. It proceeded nearly all through my Freshman year, however finished during the portion of the final quarter. \n\nThe thing is, It influenced my grades severely. I put on weight, turned into an Introvert and so on, and was essentially not in a decent state. \n\nI was contemplating talking how I lost weight, got new interests ( CS bc I used to sit at my home the entire day ), and worked on my grades in the wake of recuperating. (Freshman CGPA was 8.3/10 and Junior is 10/10). \n\nI've seen many posts on this sub which basically say to abstain from talking about topics like these, which is the reason i'm quite conflicted at the moment.\n\nPs: I apply next year.",
  "author": "kiesoma",
  "created": 1635280401,
  "updated": 1635301675,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi5xjo0": {
      "link": "/r/ApplyingToCollege/comments/qgfj2i/is_talking_about_an_old_problem_and_in_an_essay/hi5xjo0/",
      "text": "Keep focus on changes you experienced & learned, less medical and terminology. Good luck next year!",
      "author": "roguezebra",
      "created": 1635282185,
      "upvotes": 2,
      "replies": {}
    },
    "hi5uc9m": {
      "link": "/r/ApplyingToCollege/comments/qgfj2i/is_talking_about_an_old_problem_and_in_an_essay/hi5uc9m/",
      "text": "I'm not really sure how you could write a good essay about this topic. What did you learn from this experience? What important traits does it show about you? Why would this make the AO want to admit you? I don't think this essay would provide good answers to any of those questions. That said, if you have a unique experience that would answer those questions, then go ahead and write about it.",
      "author": "FuriousGeorge1435",
      "created": 1635280946,
      "upvotes": 1,
      "replies": {
        "hi5uki5": {
          "link": "/r/ApplyingToCollege/comments/qgfj2i/is_talking_about_an_old_problem_and_in_an_essay/hi5uki5/",
          "text": "There is actually a LOT that went through during this phase.",
          "author": "kiesoma",
          "created": 1635281034,
          "upvotes": 2,
          "replies": {
            "hi5uyks": {
              "link": "/r/ApplyingToCollege/comments/qgfj2i/is_talking_about_an_old_problem_and_in_an_essay/hi5uyks/",
              "text": "I understand and agree that this was definitely an important part of your life, and that there was a lot going on. But again, what does this tell the AO about you? What important parts of your personality would shine through this essay? Obviously I don't have much to go on here, but based on what you wrote in the post I'm not sure that this essay would provide effective answers to those questions.\n\nEdit: Also, you're a junior. You have time to experiment. Write the essay and see how you feel about it, then change it if you don't like it.",
              "author": "FuriousGeorge1435",
              "created": 1635281183,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}