{
  "sid": "riufcp",
  "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/",
  "title:": "Question about letter of reccomendation",
  "text": "My aunt went to Harvard for her MD. I was wondering if her letter of rec would mean anything for me if I apply as an undergrad to major in biochemistry.\n\nI’m going to apply to Harvard and say that I am alumini. I have a semi-decent chance to get in without her.\n\nI’m also going to shadow under her for 10 full-length days in about a month.",
  "author": "Anonymmmous",
  "created": 1639785814,
  "updated": 1639825729,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hozkfw4": {
      "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hozkfw4/",
      "text": "No. You should only have people who have a professional relationship with you and who know you well write letters of recommendation.",
      "author": "tachyonicinstability",
      "created": 1639785950,
      "upvotes": 1,
      "replies": {
        "hozkou4": {
          "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hozkou4/",
          "text": "I’m going to shadow under her for 10 days full days soon. Does that make a difference? Like do they count as alumini",
          "author": "Anonymmmous",
          "created": 1639786059,
          "upvotes": 1,
          "replies": {
            "hozkwtz": {
              "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hozkwtz/",
              "text": "While that's a good thing to do, you still won't have a professional relationship with her. Letters of recommendation need to come from people who do not have a conflict of interest. \n\nTypically letters are also best from people who have written them often. While an MD is certainly an accomplishment, your family member is unlikely to have experience writing letters often and is not likely to write a compelling letter - no matter how well intentioned she might be.",
              "author": "tachyonicinstability",
              "created": 1639786160,
              "upvotes": 1,
              "replies": {
                "hozl9ot": {
                  "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hozl9ot/",
                  "text": "Let’s suppose she wrote a top-notch one… would there be any problems claiming I’m alumini under her, and would her letter of rec be worth more than if she wasn’t my aunt?",
                  "author": "Anonymmmous",
                  "created": 1639786323,
                  "upvotes": 1,
                  "replies": {
                    "hozm83o": {
                      "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hozm83o/",
                      "text": "Harvard will likely ask you about your relatives who have attended, and if that information matches your letter writer's information, that will work strongly against you. \n\nI can't recommend strongly enough that you have someone with a solely professional relationship write on your behalf. Harvard has enough applicants that they look for reasons to reject students, and a conflict of interest in a letter writer is a strong reason for them to reject you.\n\nA Harvard MD is also not relevant from a legacy perspective, if that is motivating your question. What your aunt can do for you is connect you with other people to work with/shadow/etc. They can write you a letter, though, as I mentioned, people who don't write these often don't usually do a good job.",
                      "author": "tachyonicinstability",
                      "created": 1639786762,
                      "upvotes": 1,
                      "replies": {
                        "hp01oll": {
                          "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hp01oll/",
                          "text": "Oh, I didn’t realize that. I thought the fact that I shadowed under her would deter any problems. I didn’t know they had a place where they asked about people in my family who attended before. Thanks for letting me know.",
                          "author": "Anonymmmous",
                          "created": 1639793956,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hozkddc": {
      "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hozkddc/",
      "text": "have you done any work or shadowing with her?",
      "author": "stressedoutaflol",
      "created": 1639785919,
      "upvotes": 1,
      "replies": {
        "hozkgej": {
          "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hozkgej/",
          "text": "I will do a lot, maybe 10 full-days worth for her in the coming months.",
          "author": "Anonymmmous",
          "created": 1639785956,
          "upvotes": 1,
          "replies": {
            "hp0me2y": {
              "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hp0me2y/",
              "text": "That would be “No“.   \n\n\nShe can’t opine on your abilities based on what you will do in the future.",
              "author": "RichInPitt",
              "created": 1639805308,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hp0m9bn": {
      "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hp0m9bn/",
      "text": "Unless she was a teacher in your school, or you worked for her and she can provide a professional recommendation, no.\n\nYou likely aren’t a Harvard alumni. An aunt doesn’t make you a legacy.\n\nShe can’t provide a professional recommendation based on what you are going to do in the future.",
      "author": "RichInPitt",
      "created": 1639805226,
      "upvotes": 2,
      "replies": {
        "hp0treh": {
          "link": "/r/ApplyingToCollege/comments/riufcp/question_about_letter_of_reccomendation/hp0treh/",
          "text": "Wait what is the difference between alumni and legacy I think I’ve used the terms interchangeably.",
          "author": "Anonymmmous",
          "created": 1639810415,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}