{
  "sid": "qpqlbv",
  "link": "/r/ApplyingToCollege/comments/qpqlbv/how_to_combat_while_waiting/",
  "title:": "How to combat while waiting",
  "text": "My anxiety is getting the better of me. This college application has been a little long with the school asking me for more and more info because they can’t understand/process what I have. I feel sick. I feel like I’m going to get rejected I don’t know what to do. I don’t know if I could call it a gut feeling or if my brain is just being crazy about it.",
  "author": "Worried_Lawfulness43",
  "created": 1636415293,
  "updated": 1636653585,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjvm4mz": {
      "link": "/r/ApplyingToCollege/comments/qpqlbv/how_to_combat_while_waiting/hjvm4mz/",
      "text": "Here’s the deal. College decisions might not go your way. It’s the honest truth,  but you’ve done your part. Put forth your strongest application, nurtured your little baby bird application, and now it has to go do its thing. It’s hard not having control\nOver the process for sure. But just know this. A little pain and heartbreak won’t hurt you. In fact it can make you stronger. So hope for the best and prepare for the worst. It’s called emotional planning — and know that you will be ok no matter the outcome. You might be devastated for a while. It might feel awful. And you might need to do a lot of pillow bashing. But then you’ll work through it. You’ll eat a lot of ice cream and you’ll know that you are way more than any college admissions decision. Your life has more meaning than the name of a college. And you’ll find out that you are so much stronger than you ever imagined. I promise. I see it every year.",
      "author": "admissionsmom",
      "created": 1636420107,
      "upvotes": 4,
      "replies": {
        "hjvmvsh": {
          "link": "/r/ApplyingToCollege/comments/qpqlbv/how_to_combat_while_waiting/hjvmvsh/",
          "text": "Thank you for your kind words. And I hope you’re right in the event that I am rejected. It’s just so hard when the school in question is your dream school. Rejection is just also hard in terms of feeling like any school will want you. It sucks.",
          "author": "Worried_Lawfulness43",
          "created": 1636420458,
          "upvotes": 3,
          "replies": {
            "hjvnkwz": {
              "link": "/r/ApplyingToCollege/comments/qpqlbv/how_to_combat_while_waiting/hjvnkwz/",
              "text": "It does suck. That’s right. But it’s temporary suckiness. Life is full of ups and downs and part of that is learning to deal with the inevitable suckiness life brings you at times. But it’s ephemeral. It will pass.  \n\nAnd this is why I really discourage the idea of dream schools.  I want you to think about what it is you like so much about your dream school. What do you see yourself doing there? What experiences are you having? Then I want you to take that knowledge and find other schools where you can have those experiences because I promise you that dream isn’t in the form of a school. It’s you — so go find and apply to a list of schools where you can find dream you and forget about the dream school.",
              "author": "admissionsmom",
              "created": 1636420776,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hjvjecy": {
      "link": "/r/ApplyingToCollege/comments/qpqlbv/how_to_combat_while_waiting/hjvjecy/",
      "text": "I would just try your best to forget about it until decisions come out. Hang out with friends, spend time with family, etc.  Then whatever happens, happens.",
      "author": "CollegeEssayGuru",
      "created": 1636418845,
      "upvotes": 2,
      "replies": {}
    }
  }
}