{
  "sid": "r7hc1v",
  "link": "/r/ApplyingToCollege/comments/r7hc1v/potential_mistake_in_uc_app/",
  "title:": "Potential mistake in UC app",
  "text": "So I'm a potential F1 visa international applicant from Canada. I just submitted my UC app to Berk and UCLA last night, but I may have accidentally clicked a box that said \"I am seeking financial aid\". The problem is, I can't tell if this was a figment of my imagination or not, because reviewing my application, no section asks about financial aid.\n\nHowever, we all know about financial aid and how it affects your application at need-aware schools, on top of the fact that I dont even need financial aid? My family income is waaay above what qualifies for the blue and gold program. Nor do I qualify for any aid designated for US residents. Just a complete brain fart on my part.\n\nSo what I'm asking is does anyone remember if there was a box to be checked on the UC app asking for financial aid? And if I did mistakenly click this, should I email UC admissions and tell them this is not the case? What should I do?",
  "author": "brandonasaur",
  "created": 1638479207,
  "updated": 1639828593,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmzcpd0": {
      "link": "/r/ApplyingToCollege/comments/r7hc1v/potential_mistake_in_uc_app/hmzcpd0/",
      "text": "I don’t know if there’s a box asking that on the UC app, although I don’t see why there would be seeing as the UCs do not provide any need-based aid to international/OOS students. They assume all will be full pay.",
      "author": "rainingsiberiancats",
      "created": 1638479327,
      "upvotes": 1,
      "replies": {
        "hmzcx93": {
          "link": "/r/ApplyingToCollege/comments/r7hc1v/potential_mistake_in_uc_app/hmzcx93/",
          "text": "The reason why this suddenly sparked worry in my mind was because on common app, even international students can click to be considered for financial aid. And for whatever reason I have a faint memory of doing so on the UC app, could be entirely somethign I imagined though.",
          "author": "brandonasaur",
          "created": 1638479410,
          "upvotes": 1,
          "replies": {
            "hmzd68w": {
              "link": "/r/ApplyingToCollege/comments/r7hc1v/potential_mistake_in_uc_app/hmzd68w/",
              "text": "The common app, yes, because some colleges on the CA provide need-based aid to intls, and most of those colleges are need-aware too. But the UCs don’t provide any need-based aid whether one needs it or not (if you’re intl/OOS), so I can’t see a purpose for such a box on their app. If you’re concerned, you can email the individual UCs about it.",
              "author": "rainingsiberiancats",
              "created": 1638479507,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmzfk1o": {
      "link": "/r/ApplyingToCollege/comments/r7hc1v/potential_mistake_in_uc_app/hmzfk1o/",
      "text": "I didn’t see that option on the UC app?",
      "author": "novideo0",
      "created": 1638480410,
      "upvotes": 2,
      "replies": {
        "hn00zg8": {
          "link": "/r/ApplyingToCollege/comments/r7hc1v/potential_mistake_in_uc_app/hn00zg8/",
          "text": "Thanks. I'm probably just overthinking it. I just remember there being a box to input your household income and I just naturally assumed thered be a financial aid question paired with this.",
          "author": "brandonasaur",
          "created": 1638489124,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}