{
  "sid": "r5gegw",
  "link": "/r/ApplyingToCollege/comments/r5gegw/whats_the_point_of_essays/",
  "title:": "what’s the point of essays?",
  "text": "I’m from Canada and most universities/programs here require GRADES ONLY. Absolutely NO ESSAYS or other supplementary information.\n\nbeen in this sub for a while, I don’t understand what’s wrong with the essays of US schools.\ndo they actually have time to read hundreds of thousands of them every year? if IVY or MIT require essays, fine because they have to select some 1000 best of best students out of 1000000. but what’s wrong with these average ranking schools?",
  "author": "thelogbook",
  "created": 1638252138,
  "updated": 1638479371,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.71,
  "comments": {
    "hmms9p3": {
      "link": "/r/ApplyingToCollege/comments/r5gegw/whats_the_point_of_essays/hmms9p3/",
      "text": "Because average in the US is almost on the same level as THE school in many other countries. A lot of schools in the US don’t require any essays and even more don’t require any supplementals. A decent part of it is wholistic admissions and lack of standardization even within states.",
      "author": "TritonTheCat",
      "created": 1638252449,
      "upvotes": 12,
      "replies": {}
    },
    "hmmt942": {
      "link": "/r/ApplyingToCollege/comments/r5gegw/whats_the_point_of_essays/hmmt942/",
      "text": "because t20 in the us is the top 1%, and even t100 is roughly top 10%, while in my country, it's 30+%\n\nthere's additional rounds of filtering which makes personality matter\n\nthe most prestigious courses in my country only use a single personal statement to weed out people with red flags (an example is someone IK writing for a MBBS \\[medicine\\] app that he cares about helping people, instead of specifics about the mbbs itself)",
      "author": "sleepkeyichidema",
      "created": 1638253097,
      "upvotes": 6,
      "replies": {}
    },
    "hmmxdpx": {
      "link": "/r/ApplyingToCollege/comments/r5gegw/whats_the_point_of_essays/hmmxdpx/",
      "text": "Probably because there are a gazillion more students applying to the schools? If the school is lower ranked, then usually they don't really take into account essays that much. Keep in mind that a lot of these \"average\" schools are still some of the highest-ranked around the world. American schools also don't auto admit certain students above a certain GPA, and require something called holistic review, which means that they take more than just GPA into accepting a student into the school. Even mid-tier schools apart from ivies get tens of thousands of applicants that all have perfect GPAs and test scores. Accepting all of them based on that just isn't a better system. All I'm going to say is that if you're complaining about doing more work for a US school, then don't apply :). You're going to be paying much higher tuition too. Honestly, I could probably talk about this for hours but please just do some more research thanks.",
      "author": "Mysterious_Deal7521",
      "created": 1638255934,
      "upvotes": 7,
      "replies": {}
    },
    "hmpwyml": {
      "link": "/r/ApplyingToCollege/comments/r5gegw/whats_the_point_of_essays/hmpwyml/",
      "text": ">if IVY or MIT require essays, fine because they have to select some 1000 best of best students out of 1000000\n\n  \nWhy do you think that only certain schools have to select the best X students out of Y applicants?\n\nDoes Caltech not need to select the best applicants? Duke? Michigan? Penn State? Where do you draw the “they shouldn’t care” line?",
      "author": "RichInPitt",
      "created": 1638310878,
      "upvotes": 1,
      "replies": {}
    }
  }
}