{
  "sid": "qwx3tt",
  "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/",
  "title:": "If you're in the middle of Essay Rewrites and trying to come up with the perfect word, but don't want to sound like you swallowed a thesaurus, this resource might be helpful: 1000 Words to Write By, by Deanna Carlyle",
  "text": "Happy Thursday Applicants and Essay Writers!\n\nI came across this amazing resource today and wanted to share it with you! It was actually shared in one of my counseling groups, by Ethan Sawyer, College Essay Guy. \n\nI know I always say to avoid sounding like you've swallowed a thesaurus, and I stand by that, but sometimes you just need another word to say what you're trying to say.  This resource gives an amazing list of words to use. As always, only use words you're comfortable with and would use in your vocabulary. Don't go out on any crazy limbs here, because you'll fall off -- and it hurts. If you're not sure how one of these words should work in a sentence, don't use it. \n\n&#x200B;\n\nThis is straight up just copied and pasted from the original document I've linked in the title below. \n\n[1000 Words to Write By](https://www.bluecatscreenplay.com/the-bluecat-screenplay-competition-blog/1000-words-write/?fbclid=IwAR2pD34nj8oB_iKu4LZLxikQNnr4OJ3oAYq9oCwdW5UMny1jztt-m3-Q-Xw) by Deanna Carlyle:\n\nAll the writing advice in the world can’t replace good tools and lots of practice. This is why I’ve compiled the following list of more than a thousand action verbs. I needed a handy, printable reference tool that didn’t strain my eyes or wrists. Try it for yourself sometime. It works.\n\n# For “walks” or “runs” \n\nlumbers plods scurries sidles slinks proceeds wends scuttles goes on his way shuffles scuffs scuffles stumbles shambles waddles wobbles scoots slouches scrambles scampers minces trots strolls saunters ambles marches steps paces roams roves meanders shadows pursues treks continues on drifts past/along strays glides along strides stalks stomps struts swishes swaggers stamps tramps trudges traipses treads limps hobbles lurches staggers trips crawls crosses traverses inches across hurtles gallops charges darts advances approaches bushwhacks chases climbs creeps along, creeps away sneaks tiptoes steps lightly pussyfoots dashes dances prances descends ascends dodges eludes emerges enters evacuates escapes evades flees flits flies hauls off gropes his way launches across scales lunges moves parades passes patrols plows prowls propels pursues races sails rushes sidesteps skids skips steals stomps steers swerves veers lists tramples ushers wades wanders hikes withdraws ambulates perambulates absconds trails after bolts tears tears along make rapid strides covers ground sprints careers scuds hastens races hurries jogs canters lopes trips take flight decamps drifts\n\n# For “thinks, remembers”\n\nwonders asks herself ponders notices reflects strikes her as entertains the notion holds in his mind It occurs to her It comes to her realizes knows she considers she considers this he is tempted to brings to mind he is taken with the idea that she reasons understands considers goes over reviews pictures features imagines pretends hopes fears envisions deliberates envisages calls up conjures up conceives of fancies allows the conceit judges suspects intends expects plans concentrates muses ruminates recalls mulls over broods over projects anticipates concludes esteems takes heed keeps in mind guesses supposes forms an image of conjures hatches fabricates fashions formulates concocts reasons that turns it over in her mind flirts with the idea recollects bears in mind deduces infers thinks back to puts her in mind of calls to mind reminds him of acknowledges weighs reconsiders thinks better of beholds watches for looks on eyes detects contemplates keeps in sight holds in view stands guard keeps watch monitors\n\n# For “says” \n\nutters mumbles drawls parrots echoes snarls blurts moans mutters murmurs coos whispers croons hollers shrills sasses prompts questions demands queries replies suggests responds sings out scoffs screams yells yelps shouts inquires chirps squeals squeaks asks herself asks assures commands cries out exclaims advises announces growls stutters stammers instructs tells jeers scolds laments mocks objects questions roars speculates snaps spits states whines jabbers prates prattles gibbers cackles gabbles sputters blathers rambles on rattles on meanders digresses sermonizes preaches comes out with declaims pontificates harangues rants rhapsodizes gushes spouts lets slip enlightens him points out chats reveals boasts crows vaunts brags disparages belittles notifies addresses blabs natters banters yaks whispers wonders aloud rejoins retorts replies recites repeats remarks comes out with conveys declares summons imparts mentions adds reveals lets out divulges discloses makes known vents airs breathes betrays recites predicts advances avers avows avouches assumes imagines professes claims purports insinuates cites names offers proposes pleads imputes implies asserts expresses pledges ascribes affirms professes admits\n\n# For “looks, sees” \n\nglares glances off regards makes out describes remarks has in sight glowers squints shoots him a look fixes her with a stare sights ogles casts a glance his eyes beg her to amplifies gazes gapes spots surveys turns an eye on looks upon distinguishes fixes her gaze on notes recognizes identifies takes a look takes a glance stares leers scowls scans peers squints gaps notices observes considers watches views takes in studies examines inspects scrutinizes peruses sizes up takes stock of skims glances through flips through perceives discerns\n\n# For “pulls” \n\npulls out removes takes out extracts produces tugs extricates lugs draws drags yanks\n\n# For “jumps” \n\nvaults leaps pounces startles flinches springs lunges launches jerks jolts erupts explodes shoots from\n\n# For “pushes” \n\npropels ballasts sets in motion drives trundles shoves thrusts presses forward makes one’s way squeezes through rouses prompts forges ahead\n\n# For “reacts” \n\nreels back rocks back flushes blanches blushes scowls nods her consent nods his agreement smiles grins grimaces falls silent shrugs and said admits with a nod shakes his head beams smirks simpers lists tilts sways keels over flinches shivers sniffs blinks retracts sighs exhales inhales flicks flings reclines shifts relaxes swallows pouts looks + adj yields hesitates makes no attempt to frowns makes no answer falls silent pauses stars gasps starts startles slackens reclines draws back steps back stiffens resists retreats raises an eyebrow cocks her head to one side puts his head to one side tilts her head chuckles yawns laughs snickers giggles stifles a yawn stifles a laugh takes a deep breath glances off glares shrugs devoid of emotion grins sneers\n\n# For “feels, seems, shows, looks like” \n\nsenses has the impression understands detects seems appears betrays indicates betokens foretokens reveals bespeaks suggests signifies connotes hints at alludes to implies intimates presages portends forewarns discloses displays lays open makes manifest exposes bars strikes her as looks as if looks like has the look of has every appearance of has the earmarks of resembles sounds like exhibits evidences shows manifests emblematic of\n\n# For “takes” \n\ndraws withdraws pulls out a picks selects chooses plucks removes snatches out scoops up roots out snatches traps takes up raises picks up hoists sets upright elevates seizes prizes open wrenches wrests produces extracts extricates accepts fetches grabs snitches takes hold of jimmies gathers grasps grips fingers nabs packs ransacks appropriates swipes snares drags acquires obtains gains procures garners gleans pilfers lowers takes down tears down swaps\n\n# For “put” \n\nstashes places poses posits plunks down mounts positions stations sets before drops crams stuffs sticks lodges plops plunks parks stations plants perches inserts lays sets sets upright stands on end upends deposits consigns relegates straps tosses throws flings lobs hurls heaves casts slaps onto drapes dunks eases shifts interposes installs\n\n# Have fun! And happy word hunting! \n\n&#x200B;\n\nxoxoxo AdmissionsMom\n\none other source I do like -- is an app called power thesaurus -- it has more real talk options for you to choose from than a typical thesaurus.",
  "author": "admissionsmom",
  "created": 1637262615,
  "updated": 1639832399,
  "over_18": false,
  "upvotes": 61,
  "upvote_ratio": 0.95,
  "comments": {
    "hl5uqv0": {
      "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl5uqv0/",
      "text": "thanks for this! is there a similar verb list but for non-narrative essays? like idk how to describe it, but i’m not usually narrating actions in my college essays esp if they’re short; is there a similar list for more self-reflective/future goals type verbs if that makes sense",
      "author": "eclairrrrr",
      "created": 1637265777,
      "upvotes": 5,
      "replies": {
        "hl5v041": {
          "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl5v041/",
          "text": "I’d check out the power thesaurus app. It might be able to provide some options for you",
          "author": "admissionsmom",
          "created": 1637265877,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hl5pf1m": {
      "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl5pf1m/",
      "text": "I wish I had this before I submitted by ED and QB apps 😔",
      "author": "KANETAI",
      "created": 1637263689,
      "upvotes": 4,
      "replies": {
        "hl5svwv": {
          "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl5svwv/",
          "text": "I bet your essays you’ve submitted are already awesome. No reason to have regrets there!  😊",
          "author": "admissionsmom",
          "created": 1637265052,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hl9lqqd": {
      "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl9lqqd/",
      "text": "[deleted]",
      "author": null,
      "created": 1637336915,
      "upvotes": 2,
      "replies": {
        "hl9lumf": {
          "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl9lumf/",
          "text": "Oh very cool!! Lmk when!!",
          "author": "admissionsmom",
          "created": 1637336957,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl7hyok": {
      "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl7hyok/",
      "text": "RemindMe! 6 months",
      "author": "CyanideTP-o-Fremont",
      "created": 1637291411,
      "upvotes": 1,
      "replies": {
        "hl7i1en": {
          "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl7i1en/",
          "text": "I will be messaging you in 6 months on [**2022-05-19 03:10:11 UTC**](http://www.wolframalpha.com/input/?i=2022-05-19%2003:10:11%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hl7hyok/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FApplyingToCollege%2Fcomments%2Fqwx3tt%2Fif_youre_in_the_middle_of_essay_rewrites_and%2Fhl7hyok%2F%5D%0A%0ARemindMe%21%202022-05-19%2003%3A10%3A11%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20qwx3tt)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "author": "RemindMeBot",
          "created": 1637291445,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlbe9gf": {
      "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hlbe9gf/",
      "text": "rewriting your essays after a rejection is certainly a hard process due to the lack of motivation, but you're definitely making it an easier experience with your amazing advice!! a very good post, as always <3",
      "author": "Lanky-Beautiful-9247",
      "created": 1637361995,
      "upvotes": 1,
      "replies": {}
    },
    "hm1k8pe": {
      "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hm1k8pe/",
      "text": "Lol, I’m really good at my native language, so I’m just translating my essay…",
      "author": "redditreaderkz",
      "created": 1637854349,
      "upvotes": 2,
      "replies": {
        "hm1q02o": {
          "link": "/r/ApplyingToCollege/comments/qwx3tt/if_youre_in_the_middle_of_essay_rewrites_and/hm1q02o/",
          "text": "Hope that works for you!",
          "author": "admissionsmom",
          "created": 1637856909,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}