{
  "sid": "qhow1g",
  "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/",
  "title:": "the worst part about college apps is when other people screw you over and you can't do anything about it.",
  "text": "ok i need to go tf off about collegeboard and my counselor. so i applied ED to my top school last night (🎉🥳) but my concerns are far from over!! my counselor has not only failed to sign my ED agreement, but she also hasn't sent the counselor recommendation yet even though she has sent it to other schools?? also! i paid to have my scores sent officially by collegeboard and, even after i checked the box stating i only wanted my most recent SAT sent, they sent that along with my first attempt and my abysmal SAT subject test score, neither of which i wanted to see the light of day again. and one of my grades is incorrectly marked and my teacher has yet to change it, so i can't request first-quarter grades yet!!!! those red X's in my portal reminding me of all the things i haven't done are mad stressing me out, and that shit isn't even my fault. anyway i just needed to put that into the universe.",
  "author": "henlynch",
  "created": 1635433031,
  "updated": 1635455713,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.89,
  "comments": {
    "hie1v74": {
      "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/hie1v74/",
      "text": "[Don't worry about the counselor stuff just yet](https://www.reddit.com/r/ApplyingToCollege/comments/qhmr8l/deadlines_are_for_applicants_not_counselors_and/) (unless you are applying to a school that wants applications complete on deadline day).\n\nMost colleges automatically super score. \n\nVery few students have first quarter grades this early and most colleges don't require them.",
      "author": "UVaDeanj",
      "created": 1635434201,
      "upvotes": 9,
      "replies": {
        "hie2b56": {
          "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/hie2b56/",
          "text": "even with superscore, will the college ignore the SAT subject test score? and this school does require them, albeit it says \"as soon as possible\" and not by a certain date. i'm probably wigging out too much, but i just want all these ends tied up, you know?",
          "author": "henlynch",
          "created": 1635434380,
          "upvotes": 1,
          "replies": {
            "hie2zh4": {
              "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/hie2zh4/",
              "text": "There are thousands of schools, so there's no one answer here. \n\nPersonally, a one-hour, optional exam isn't nearly as interesting as sustained classroom performance over the course of four years in that subject. BUT, you're saying there's still a college that requires the SAT Subject Tests, which were discontinued for US students in January 2021?",
              "author": "UVaDeanj",
              "created": 1635434654,
              "upvotes": 2,
              "replies": {
                "hie36hn": {
                  "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/hie36hn/",
                  "text": "i'm sorry, my antecedent wasn't clear. i meant \"them\" as in first-quarter grades. the subject tests are not required, thankfully.",
                  "author": "henlynch",
                  "created": 1635434733,
                  "upvotes": 1,
                  "replies": {
                    "hie3j63": {
                      "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/hie3j63/",
                      "text": "I think it's safe to say that \"as soon as possible\" means they realize the item won't be ready for the deadline.",
                      "author": "UVaDeanj",
                      "created": 1635434875,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hie15k1": {
      "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/hie15k1/",
      "text": ">so i applied ED to my top school last night…my counselor has not only failed to sign my ED agreement, but she also hasn't sent the counselor recommendation yet\n\nYou applied LAST NIGHT… and are currently complaining about what your counselor has yet to do THIS MORNING?",
      "author": "Strict-Special3607",
      "created": 1635433907,
      "upvotes": -1,
      "replies": {
        "hie1fvh": {
          "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/hie1fvh/",
          "text": "yes, but i've had these items requested for nearly a month now. i sent in the app in the hope that it would light a fire under my counselor to submit these items, especially considering she has done them for some of my EA schools.",
          "author": "henlynch",
          "created": 1635434027,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hifbml0": {
      "link": "/r/ApplyingToCollege/comments/qhow1g/the_worst_part_about_college_apps_is_when_other/hifbml0/",
      "text": "Man wait, does the CB send out your past scores too when you pay?? I'M SO CONFUSED.",
      "author": "alienatedhuman",
      "created": 1635452207,
      "upvotes": 1,
      "replies": {}
    }
  }
}