{
  "sid": "qe6g6u",
  "link": "/r/ApplyingToCollege/comments/qe6g6u/is_anyone_doing_prompt_6_for_the_common_app_essay/",
  "title:": "is anyone doing prompt 6 for the common app essay?",
  "text": "obviously you don't have to tell me your topic but like no one i know is doing it and it makes me feel like i'm just spewing bullshit on my major LMAO. i tried making my essay personal about me but it feels so irrelevant compared to what other people are writing about :( someone please give me reassurance, due dates are coming soonnn",
  "author": "madeira-wine",
  "created": 1635001132,
  "updated": 1635183437,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhrg7h6": {
      "link": "/r/ApplyingToCollege/comments/qe6g6u/is_anyone_doing_prompt_6_for_the_common_app_essay/hhrg7h6/",
      "text": "It doesn't matter what prompt you do. The prompts exist as a starting point for you to write about yourself. My advice is write 650 words that convey the authentic version of you who isn't apparent through your application. By the time you're done, you'll most likely realize you've answered one or more of the prompts. If not, then you can select Prompt 6.",
      "author": "FuriousGeorge1435",
      "created": 1635010675,
      "upvotes": 2,
      "replies": {
        "hhsymjy": {
          "link": "/r/ApplyingToCollege/comments/qe6g6u/is_anyone_doing_prompt_6_for_the_common_app_essay/hhsymjy/",
          "text": "THIS. I spent weeks struggling with my commonapp because I tried to answer a specific prompt… once I started to just write random words, I came up with an idea and first draft within a day. My essay was completed and polished a week later; turns out it fit the exact same prompt I was attempting (and failing) to write\n\nJust start writing, the rest will just fall into place",
          "author": "helpmegetintocolleg",
          "created": 1635035505,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhqyksm": {
      "link": "/r/ApplyingToCollege/comments/qe6g6u/is_anyone_doing_prompt_6_for_the_common_app_essay/hhqyksm/",
      "text": "Prompt 1 all the way",
      "author": "Jayjay_loves_Jesus",
      "created": 1635002486,
      "upvotes": 1,
      "replies": {}
    },
    "hhr8wze": {
      "link": "/r/ApplyingToCollege/comments/qe6g6u/is_anyone_doing_prompt_6_for_the_common_app_essay/hhr8wze/",
      "text": "The topic is less relevant than what you can reveal. \nThe personal part can come through in details of your major- what is boring v exciting, discovery v mundane,   satisfaction or challenge. \n\nMy student wrote a similar essay on obscure historical legal case-not related to major- but tied into today's politics & legislation, which is an interest area.",
      "author": "roguezebra",
      "created": 1635007432,
      "upvotes": 1,
      "replies": {}
    }
  }
}