{
  "sid": "qa3ji1",
  "link": "/r/ApplyingToCollege/comments/qa3ji1/what_do_lors_of_the_average_t20_admit_look_like/",
  "title:": "What do LORs of the average T20 admit look like?",
  "text": "I mean this isn't a factor I can directly control, but is the average T20 admit's LOR closer to \"The best, no flaws <talking about ECs>..etc. glorified bs\" or more like a \"Good student, helps others, one EC maybe, good for ur uni\"",
  "author": "OutsideProfessor1375",
  "created": 1634492367,
  "updated": 1634653614,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "hh0ckv8": {
      "link": "/r/ApplyingToCollege/comments/qa3ji1/what_do_lors_of_the_average_t20_admit_look_like/hh0ckv8/",
      "text": "I think it’s a combination of both those examples you provided. The best LOR’s often show the student in a positive light; the student isn’t expected to be perfect, but if the recommender mentions any challenges the student faced, then  they should also show how they overcame them.   In regards to EC’s, when a teacher shows how a student has been involved within their communities, it provides some more anecdotes and show a stronger connection bereeen the recommender and the student, now don’t get me wrong, you don’t want your recommender to regurgitate your entire EC list, but if you have some important EC’s or EC’s you haven’t shown elsewhere, it would be good for your recommender to expand upon them. You definitely want your recommender to state that you would be an asset to the college, it’s like the bare minimum in these letters lol. Finally, in terms of rank or how good you are compared to others, the recommender doesn’t have to explicitly say that you were the best student they’ve ever taught, but it’d be good if they can truthfully show you as a highlight of their career, of course, not ever single recommender has to say you were that great, they can use other ways to show that, like personal anecdotes or any traits your posses.",
      "author": "Additional-Ad5553",
      "created": 1634493046,
      "upvotes": 8,
      "replies": {}
    },
    "hh0m5p0": {
      "link": "/r/ApplyingToCollege/comments/qa3ji1/what_do_lors_of_the_average_t20_admit_look_like/hh0m5p0/",
      "text": "I read 2 of mine and they were above average at best. Only positive things but nothing incredible. My PI letter essentially said that I have great prospects as a scientist, care a lot about the field, and put in a lot of effort; also briefly commented on my communication skills (academic) and soft skills (said I was a great person and a fun lab member). \n\nNothing like \"best student on the planet\" though. They were all great, good vibes, but nothing insane.",
      "author": "CLOWN_ALERTO",
      "created": 1634496960,
      "upvotes": 4,
      "replies": {}
    },
    "hh0cal9": {
      "link": "/r/ApplyingToCollege/comments/qa3ji1/what_do_lors_of_the_average_t20_admit_look_like/hh0cal9/",
      "text": "No one here really knows, we all waived FERPA (as you should when applying to competitive schools)",
      "author": "ssssseabass",
      "created": 1634492936,
      "upvotes": 7,
      "replies": {
        "hh0qldd": {
          "link": "/r/ApplyingToCollege/comments/qa3ji1/what_do_lors_of_the_average_t20_admit_look_like/hh0qldd/",
          "text": "To be fair there might be teachers or counsellors here that could help answer this",
          "author": "T0x1Ncl",
          "created": 1634498794,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  }
}