{
  "sid": "rinn49",
  "link": "/r/ApplyingToCollege/comments/rinn49/im_angry/",
  "title:": "I’m angry",
  "text": "I’m considered an international student even though I’ve lived in the U.S for 7 years. It just really really sucks, I don’t have the ability to change my visa status really fast for this. The American immigration process sucks, but so does living in a third world country where your talents will be wasted.\nI feel like I’m in an awkward situation, I don’t know if I have anywhere else to go. \nI just got rejected from Notre Dame, I really really wanted to go.\nI’ve worked so hard in my classes but I still couldn’t get the SAT score I wanted because my parents always wanted me to help around the house and sincerely I barely had time to study. \nI applied test optional and I know they say it won’t hurt but I’m an international that needs aid in the US.\nNo one gets it. My parents think I’ll get in everywhere because I’m a good person. Ha. If these schools cared, I hate making this a sob story but I’m so afraid I won’t have anywhere to go. It’s not my fault the only visa we can have is the one that makes us international. \nMy counselor doesn’t even know my name, and every time i ask her for help she tells me she is not equipped to help with international admissions.\nI’m so alone. I’m so scared. I don’t know what I did wrong and I just want to go to a good school. \nI wish I could go back in time and focus more on my SAT. my class rank is also not that impressive because people who take dual enrollment classes go first but I didn’t even know that. \nI’m so mad. I know it’s 1 rejection but I don’t know what type of schools I should be looking at; Harvard? Obviously not, but American U? Can I even get in ? \nI’m so mad. I’m so alone.\nI’m so afraid.",
  "author": "Lanadelreystan24",
  "created": 1639765725,
  "updated": 1639785558,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}