{
  "sid": "qm4xj7",
  "link": "/r/ApplyingToCollege/comments/qm4xj7/who_should_i_ask_for_lor_not_many_choices_and_all/",
  "title:": "Who should I ask for LOR? Not many choices and all have different relations to me.",
  "text": "Who should I ask for LOR? Don’t have many people that I have known for a long time that isn’t related or a friend.\n\nRunning out of time to ask for LOR and it’s mostly because I just have no idea who to choose.\n\nAbout every single year of high school, I’ve had different teachers, so I don’t really have any consistent teachers I have had for multiple years, nor was I part of many athletics so I don’t have any coaches to rely on.\n\nI have a list I have drawn out, and if anyone here has experience with writing or requesting LOR, or actually knows what colleges look for, it would be greatly appreciated if you pick the candidates that best fit those roles. Thank you in advance.\n\n- A Spanish teacher I had through 9-11th grade, head of 2 clubs I was in, but now lives across the country \n\n- Math teacher I have had for 11th & 12th grade who I don’t talk with much, but have good relations with nonetheless\n\n- Math teacher who was the head of a club I joined 10th grade, but only stayed in for that year, and is now my AP stats teacher for 12th grade\n\n- My manager at my work that I have had a job at for 3 years, but I only work during the summer and during breaks\n\n- a science teacher I had in 10th grade that I formed a good bond with\n\n- Computer science teacher I had for a year in 10th grade that I had an okay-good bond with (this is the degree I want to go into)\n\n\n\n\nWhich 2 of these sound the most appealing? Possibly a 3rd one just in case a college requests that. Thanks so much\n\n(Side note: I’m thinking of the Spanish teacher as they had me for 3 years and were the head of 2 clubs I was in, so they could show my progress, but it all comes down to if they will get back in time. I’m tied between my science teacher (who can talk about my character, but not about academic achievements) or my math 11 & 12 teacher (who can show my growth, but not many things personal to me, as we don’t talk to often) I’m just having a hard time choosing.",
  "author": "Allgreygray",
  "created": 1635975418,
  "updated": 1636136379,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hj7imyz": {
      "link": "/r/ApplyingToCollege/comments/qm4xj7/who_should_i_ask_for_lor_not_many_choices_and_all/hj7imyz/",
      "text": "Firstly, what requirements do your colleges have with regards to recs? Most that require 2 minimum will require them to be 2 *teacher* recs, making the manager one inapplicable. If you have a good bond with the manager and/or they can speak very well about your positive traits, consider adding it as a supplemental rec for colleges that allow it. For teachers: do any of your colleges specify what subject areas they should be from? 1 STEM and 1 non-STEM? Related to your major? Etc. \n\nAll that aside, if the 10th grade science teacher has the best bond with you still and can talk about your character, I’d go with that person. For the second recommender, I’d go with either the Spanish teacher or the 11-12th grade math teacher, depending on 1) who can speak more to your personal qualities, and 2) whether your Spanish teacher can get back to you in time. Your recs should speak more about your character than just academic achievements, which colleges can see from your transcript (and possibly awards/test scores).",
      "author": "rainingsiberiancats",
      "created": 1635978033,
      "upvotes": 2,
      "replies": {
        "hj7ne2u": {
          "link": "/r/ApplyingToCollege/comments/qm4xj7/who_should_i_ask_for_lor_not_many_choices_and_all/hj7ne2u/",
          "text": "Good to know, really appreciate the help. I still have yet to look into the specifics for LORs for specific schools, but I will do that very soon. I’m thinking along the same lines as you with the science teacher, I think they are a top candidate for sure. \n\nGood point about focusing on who I have the better connection with because they can see my achievements on my transcript, that makes a lot of sense. Overall, will definitely take your advice and apply it, thanks again.",
          "author": "Allgreygray",
          "created": 1635980055,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}