{
  "sid": "r4eh06",
  "link": "/r/ApplyingToCollege/comments/r4eh06/i_manage_to_completely_forget_to_add_my_sport_to/",
  "title:": "I manage to completely forget to add my sport to the UC activities section when I submitted, how screwed am I? 💀",
  "text": "I had Sunday morning as my hard deadline to submit my application, so I was really eager to turn it in. Right after I submit I realized that I forgot to put that I was in a sport and was team captain for that very sport….\n\nBut at the same time I’m so nonchalant about it because I really did not care for my sport and was only doing it for the application. I was only on JV, did it for 3 years, and am not doing it this year.\n\nSo… how screwed am I? I would like to believe that I’m not screwed at all since I have other ECs which I do actually care about. But all my friends said that I messed up big time.",
  "author": "GoldElevator",
  "created": 1638133824,
  "updated": 1638204560,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hmg694a": {
      "link": "/r/ApplyingToCollege/comments/r4eh06/i_manage_to_completely_forget_to_add_my_sport_to/hmg694a/",
      "text": "if you can, some campuses like ucsd and ucla will allow you to submit edits after you turn in the app! after you get the portal links, go to the “after you apply” page on the uc admissions website and scroll down, there should be links for most schools on how to submit a change. i also made a little mistake on my ECs so i’m doing that too. good luck!",
      "author": "apoptosis_2021",
      "created": 1638134577,
      "upvotes": 3,
      "replies": {
        "hmgelfm": {
          "link": "/r/ApplyingToCollege/comments/r4eh06/i_manage_to_completely_forget_to_add_my_sport_to/hmgelfm/",
          "text": "So I can contact them on adding an entire new extracurricular activity? On the page it says for minor changes but I don’t know if a whole new activity counts as minor 😅",
          "author": "GoldElevator",
          "created": 1638137964,
          "upvotes": 1,
          "replies": {
            "hmglw1r": {
              "link": "/r/ApplyingToCollege/comments/r4eh06/i_manage_to_completely_forget_to_add_my_sport_to/hmglw1r/",
              "text": "i’d say still give it a shot, worst that can happen is they don’t count it.",
              "author": "apoptosis_2021",
              "created": 1638141039,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmhggb4": {
      "link": "/r/ApplyingToCollege/comments/r4eh06/i_manage_to_completely_forget_to_add_my_sport_to/hmhggb4/",
      "text": "For the schools that allow edits I would definitely add the activity, I would say its a minor change, and very unrelated but did you organize your activities by importance? or no?",
      "author": "ImprovementOk1498",
      "created": 1638154636,
      "upvotes": 1,
      "replies": {
        "hmhyc7s": {
          "link": "/r/ApplyingToCollege/comments/r4eh06/i_manage_to_completely_forget_to_add_my_sport_to/hmhyc7s/",
          "text": "I didn’t do it by order of importance",
          "author": "GoldElevator",
          "created": 1638163538,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmhozzr": {
      "link": "/r/ApplyingToCollege/comments/r4eh06/i_manage_to_completely_forget_to_add_my_sport_to/hmhozzr/",
      "text": "Ur not gonna get in or out depending on that EC. Imo it doesn’t matter just leave it and you’ll be good",
      "author": "ShoeGawd",
      "created": 1638158616,
      "upvotes": 1,
      "replies": {}
    }
  }
}