{
  "sid": "ri39gu",
  "link": "/r/ApplyingToCollege/comments/ri39gu/should_i_submit_1520_780_m_740_r_for_mit/",
  "title:": "Should I submit 1520 (780 M, 740 R) for MIT?",
  "text": "Not sure if I should submit my 1520 (780 M, 740 R) for MIT, since it's at the 25th percentile, and my math score is also borderline.\n\nI took it once in March of my junior year and initially wanted to retake it, but ended up not - mostly because test centers around my area were closed due to COVID until around the end of summer, and I felt that restudying for the SAT during the school year would take up too much time.\n\nI am self reporting my AP scores\n\n5: APUSH, Statistics, Calc BC, Calc AB, Psychology, Computer Science A, Computer Science Principles, European History\n\n4: Bio \n\n so I'm not sure if that would be sufficient enough to make up for no SAT/ACT?\n\nMy application isn't stellar - no research, super prestigious science/math competitions, or deep concentration in a certain STEM field - but I do have 2 National Science Olympiad medals (5th and 6th). It seems that those in the 25th percentile are usually extremely strong in other parts of their application (EC's, LORs), and I'm afraid I'm not in that bucket.",
  "author": "dwaynejohnson28",
  "created": 1639697456,
  "updated": 1639786152,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "houhkvg": {
      "link": "/r/ApplyingToCollege/comments/ri39gu/should_i_submit_1520_780_m_740_r_for_mit/houhkvg/",
      "text": "Yes",
      "author": "almondmilkaddict",
      "created": 1639697654,
      "upvotes": 7,
      "replies": {}
    },
    "hounoj6": {
      "link": "/r/ApplyingToCollege/comments/ri39gu/should_i_submit_1520_780_m_740_r_for_mit/hounoj6/",
      "text": "Ok I’m sorry, but this reads like \n“HeY I’m NoT tHe PeRfEcT StUdEnT bUt ShOuLd I sUbMiT nEaR tOp ScOrE?” The answer is heck yeah! Anything 1500+ is amazing and should 100% be sent in. Plus, doesn’t matter if you’re a specialist, you seem like you have a passion, and that’s what top colleges want to see! If you’re that good at Scioly (fellow scioly member here, what events?), then flaunt it! Tailor your essays to it if you’re passionate about it, it speaks volumes\n\nAlso I’m sorry 10 APs?! Good gosh, how’d you survive? And with mostly 5’s?!",
      "author": "No_Investigator4743",
      "created": 1639700392,
      "upvotes": 7,
      "replies": {}
    },
    "hov5p5b": {
      "link": "/r/ApplyingToCollege/comments/ri39gu/should_i_submit_1520_780_m_740_r_for_mit/hov5p5b/",
      "text": "Absolutely submit.",
      "author": "Common_Ad7937",
      "created": 1639708496,
      "upvotes": 2,
      "replies": {}
    },
    "hovgmqx": {
      "link": "/r/ApplyingToCollege/comments/ri39gu/should_i_submit_1520_780_m_740_r_for_mit/hovgmqx/",
      "text": "I would, yes. It’s not at the “only submit above the midpoint” level, but MIT data, and policy, show a very strong preference for test scores.",
      "author": "RichInPitt",
      "created": 1639713394,
      "upvotes": 2,
      "replies": {
        "hovn6iw": {
          "link": "/r/ApplyingToCollege/comments/ri39gu/should_i_submit_1520_780_m_740_r_for_mit/hovn6iw/",
          "text": "Here is what another redditor found: \n\nAcceptance stats at MIT for students who did and did not submit an SAT Data: https://mitadmissions.org/apply/process/stats/  \n14,279 class of 2024 applicants submitted SAT scores and 1,104 were admitted  \n7.73% acceptance rate if SAT scores were submitted  \n5,796 class of 2024 applicants did not submit SAT scores and 353 were admitted  \n6.09% acceptance rate if SAT scores were not submitted  \n20,075 total applicants and 1,457 were admitted  \n7.25% total acceptance rate  \nu/admissionsmom",
          "author": "dwaynejohnson28",
          "created": 1639716543,
          "upvotes": 2,
          "replies": {
            "hoxj0b8": {
              "link": "/r/ApplyingToCollege/comments/ri39gu/should_i_submit_1520_780_m_740_r_for_mit/hoxj0b8/",
              "text": "Yes submit",
              "author": "admissionsmom",
              "created": 1639756542,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}