{
  "sid": "qxs00p",
  "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/",
  "title:": "Rank these business programs (IB, Consulting, etc)",
  "text": "1. NYU (Stern)\n\n2. UNC (Kenan Flagler)\n\n3. USC (Marshall)\n\n4. Michigan (Ross)\n\n5. UVA (McIntire)\n\n6. CMU (Tepper)\n\n7. Cornell (Dyson)\n\n8. Georgetown (McDonough)\n\n9. UT Austin (Mccombs)\n\n10. Northwestern (Econ)\n\nAre these all good choices and within the same tier?",
  "author": "EntertainmentTop8339",
  "created": 1637363363,
  "updated": 1637688471,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.94,
  "comments": {
    "hlblnw6": {
      "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlblnw6/",
      "text": "Having recruited for the world’s largest private Consulting firm for 15+ years, I can tell you that we recruited and hired from all of these as “National Schools” (top tier).  Your school performance, interview, and case study results mattered infinitely more than which of these schools you attended.\n\n(As an alum, I’m partial to Tepper….)",
      "author": "RichInPitt",
      "created": 1637365101,
      "upvotes": 17,
      "replies": {
        "hlbrim5": {
          "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlbrim5/",
          "text": "tips for seniors who hope to go into management consulting other than do well in school and network?",
          "author": "letsgocollege",
          "created": 1637367658,
          "upvotes": 5,
          "replies": {}
        },
        "hlc0z1t": {
          "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlc0z1t/",
          "text": "Is Harvard in the same tier",
          "author": "gfrscvnohrb",
          "created": 1637371955,
          "upvotes": 2,
          "replies": {
            "hlc4c0w": {
              "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlc4c0w/",
              "text": "no HYP is S tier",
              "author": "hoyasaxaa",
              "created": 1637373522,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hlbwkz1": {
          "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlbwkz1/",
          "text": "Yes, Tepper Rocks! 😉",
          "author": "prsehgal",
          "created": 1637369944,
          "upvotes": 1,
          "replies": {
            "hlc27lb": {
              "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlc27lb/",
              "text": "I agree!",
              "author": "EntertainmentTop8339",
              "created": 1637372524,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hlbk5v1": {
      "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlbk5v1/",
      "text": "https://poetsandquantsforundergrads.com/2019/12/20/wharton-again-tops-pqs-best-undergraduate-b-schools-of-2020/4/",
      "author": "elkrange",
      "created": 1637364462,
      "upvotes": 2,
      "replies": {
        "hlbqp9x": {
          "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlbqp9x/",
          "text": "They put UC Berkeley Haas at a rank of 83 and UMich at 2...",
          "author": "EntertainmentTop8339",
          "created": 1637367295,
          "upvotes": 5,
          "replies": {
            "hlbrzvo": {
              "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlbrzvo/",
              "text": "Take all rankings with a huge grain of salt. If I recall, in this case, there was data not submitted or something.  \n\n\nGo visit [wallstreetoasis.com](https://wallstreetoasis.com).",
              "author": "elkrange",
              "created": 1637367874,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hldxocw": {
      "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hldxocw/",
      "text": "All great school, I would choose the state ones based on cost though.",
      "author": "Valthr4x_",
      "created": 1637417778,
      "upvotes": 2,
      "replies": {}
    },
    "hlfuylg": {
      "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlfuylg/",
      "text": "I would warn against being dead-set on IB before even attending university. I think that all too many applicants see it as more lucrative, glamorous, and interesting than those in the industry would consider it to be. The same holds for consulting. That’s not to say that these aren’t fulfilling careers for many; it’s just important to keep an open mind. \n\nThat being said, Cornell places into every single well-known investment bank, every single year. I’m honestly not sure how placement could possibly be any better — it is truly a target, in every sense of the word. If you’ll place from Cornell, you’ll place from anywhere. Consulting isn’t quite as popular at Cornell, honestly. \n\nI cannot provide much insight into the other programs — they’re all fantastic academic schools that I am sure will set you up for success. I just don’t know the details.",
      "author": "LeBorisien",
      "created": 1637448509,
      "upvotes": 2,
      "replies": {}
    },
    "hljgl1f": {
      "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hljgl1f/",
      "text": "For IB:\n\nTargets (in no particular order): Stern, Ross, McIntire, Dyson, McDonough, Northwestern\n\nSemi-targets: Kenan-Flagler, Marshall, Tepper, McCombs\n\nOf the semi-targets, Tepper is surprisingly strong and it's getting better every year but I would still choose a target over it unless you knew you wanted to do something tech related. \n\nMcCombs is a lot better if you're there for BHP, otherwise, its placements are really mediocre when you remember it has a class size of 1000 while Stern/Ross/Wharton all place way better and have a class size of 600 for comparison. If you're in-state and get BHP for McCombs, it's hard to beat and I'd even consider taking it over a target for just price reasons. \n\nMcDonough places surprisingly well for a school that's under the radar for a lot of kids. I've heard from a lot of my friends that they were surprised by how many Georgetown kids they saw and it's all over the Street (including at Elite Boutiques.)\n\nMcIntire is dicey because of how it has the 2 yr structure which means that the good news is you don't actually have to be in McIntire, but if you were to rerecruit I imagine not landing the business school acceptance could be harmful. This might also just be my personal bias but while UVA is considered a target, their presence definitely feels smaller than the other business targets mentioned so I'd personally go with Ross/Stern/McDonoug/Dyson over McIntire.\n\nNorthwestern has good placement supposedly and is a bonafide target but no one really knows what that placement looks like. If you want to go into finance/consulting and want to avoid studying a more academic/theoretical subject, you're better off at one of the business schools you mentioned. \n\nAll in all, each of these are good choices. If you're the \"top of your class\" (in an abstract sense for IB, since GPA doesn't necessarily correlate), you will definitely place into IB comfortably. I would recommend applying and seeing where you end up. Reality is that probably half of these won't even accept you even if you're a stellar candidate so that helps with decision making. \n\nThe other thing I'd say is to be aware of being too set on IB. I was planning to do IB and now I work in tech (at a unicorn; I'm at Stern.) One good point about that is that the whole \"Stern is only IB\" thing is overrated and I have friends who work in industries outside of IB with *very good roles* in them (I'd like to think mine is one of them haha). The other point though is that some schools are more well-rounded. Stern is admittedly not strong for consulting so if you're just asking bc you want money + prestige, I'd say the other targets probably recruit better for consulting (consulting is very much seen as a second choice thing here). Tepper and Cornell and probably USC also have much better ties to tech roles for example. So do strongly consider how you want to hedge your options. This isn't to say you can't get an APM role or an SWE role or consulting role, etc. from any of these schools (remember in the grand scheme of things, these are all very elite, prestigious schools), but certain schools are certainly stronger or have a more pristine reputation than others in certain fields.",
      "author": "doneanddead",
      "created": 1637520154,
      "upvotes": 2,
      "replies": {}
    },
    "hlbk9az": {
      "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlbk9az/",
      "text": "they are all in the same tier with no noticeable differences",
      "author": "Applying_in_2021",
      "created": 1637364504,
      "upvotes": 3,
      "replies": {}
    },
    "hlf8j5e": {
      "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlf8j5e/",
      "text": "Stern and Ross and probably the best bet with McIntire and Mccombs trailing",
      "author": "No-Bookkeeper5440",
      "created": 1637438354,
      "upvotes": 1,
      "replies": {
        "hlgheu8": {
          "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlgheu8/",
          "text": "I’m sure there are a few schools on that list better than McCombs",
          "author": "EntertainmentTop8339",
          "created": 1637459072,
          "upvotes": 1,
          "replies": {
            "hlgxetk": {
              "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlgxetk/",
              "text": "BHP Mccombs is insane",
              "author": "No-Bookkeeper5440",
              "created": 1637467371,
              "upvotes": 1,
              "replies": {
                "hlhamjz": {
                  "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hlhamjz/",
                  "text": "I’d argue still it’s not comparable in terms of IB placement with schools like Cornell, Georgetown, and even Northwestern... in fact a friend of mine transferred from UT BHP to UNC though UNC isn’t even the strongest target",
                  "author": "EntertainmentTop8339",
                  "created": 1637475539,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hld3sly": {
      "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hld3sly/",
      "text": "Where is Wharton :madge:",
      "author": "ImaybeObama",
      "created": 1637395095,
      "upvotes": 1,
      "replies": {
        "hldbs7p": {
          "link": "/r/ApplyingToCollege/comments/qxs00p/rank_these_business_programs_ib_consulting_etc/hldbs7p/",
          "text": "Not applying there... too competitive",
          "author": "EntertainmentTop8339",
          "created": 1637402071,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}