{
  "sid": "q4df0f",
  "link": "/r/ApplyingToCollege/comments/q4df0f/where_could_i_get_in_comp_sci/",
  "title:": "Where could i get in? (Comp sci)",
  "text": "Hey everyone, im a senior applying for colleges majoring in computer science. I was looking at different computer science schools such as UIUC, CMU, UW, Purdue, Georgia Tech, etc.\n\nI have a 3.2 gpa. Weighted. Yes ik it is very sad. I have a 31 act but im retaking it in a couple weeks and expect 33+. I know my gpa is absolutely terrible, but realistically where could i get in? \n\n(Not sure if it makes much of a difference but im a latino male applying from Ohio.)",
  "author": "uhhhlmaoo",
  "created": 1633750696,
  "updated": 1634074133,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hfxw0p5": {
      "link": "/r/ApplyingToCollege/comments/q4df0f/where_could_i_get_in_comp_sci/hfxw0p5/",
      "text": ">but realistically where could i get in?\n\nYou’ve listed some of the most sought-after schools by prospective CS majors. CMU is tied for #1 CS ranking with MIT and Stanford; their middle 50% ACT score ranges from 35 to 36. Not sure what the typical GPA is, but I’m betting it’s commensurate with a 35/36 ACT score.",
      "author": "Strict-Special3607",
      "created": 1633751492,
      "upvotes": 10,
      "replies": {}
    },
    "hfxvbf0": {
      "link": "/r/ApplyingToCollege/comments/q4df0f/where_could_i_get_in_comp_sci/hfxvbf0/",
      "text": "Given your stats, all the schools you've listed would be considered reaches for CS, so start by creating a balanced college list.\n\nCheck out my earlier post on last year's US News CS rankings: https://www.reddit.com/r/ApplyingToCollege/comments/n3tp2i/us_news_2021_ranking_of_best_undergraduate/ - Go through the list and research each school without paying too much attention to their absolute position within the list.\n\nBTW, I would definitely to Ohio State University since you're an in-state applicant and they have an excellent program.",
      "author": "prsehgal",
      "created": 1633751117,
      "upvotes": 5,
      "replies": {}
    },
    "hfxwi4l": {
      "link": "/r/ApplyingToCollege/comments/q4df0f/where_could_i_get_in_comp_sci/hfxwi4l/",
      "text": "Like, I don’t think you could get into UIUC or Georgia Tech. Just cause your gpa is like super low for these schools. Same thing is doubly true for CMU. Try looking at: University of Portland, Worcester Poly, Rensselaer Poly, UWash-Bothell. Since they have strong outcomes for CS with higher admit rates. Source: https://collegescorecard.ed.gov/search/?cip4=1107&cip4_degree=c&cip4_degree=a&cip4_degree=b&fos_salary=80000..150000&page=0&sort=completion_rate:desc&toggle=fos note: CMU is not there because it’s CS is beyond the limit.",
      "author": "TritonTheCat",
      "created": 1633751757,
      "upvotes": 4,
      "replies": {}
    },
    "hfy9yye": {
      "link": "/r/ApplyingToCollege/comments/q4df0f/where_could_i_get_in_comp_sci/hfy9yye/",
      "text": "Ohio State schools.  There are good ones.",
      "author": "JP2205",
      "created": 1633760210,
      "upvotes": 3,
      "replies": {}
    },
    "hg1g716": {
      "link": "/r/ApplyingToCollege/comments/q4df0f/where_could_i_get_in_comp_sci/hg1g716/",
      "text": "Ohio State and the various related schools would be great places to start.\n\nAs others have said, those listed are extreme reaches.",
      "author": "RichInPitt",
      "created": 1633821976,
      "upvotes": 2,
      "replies": {}
    }
  }
}