{
  "sid": "qd8nwf",
  "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/",
  "title:": "Risky Essay Topic",
  "text": "Sorry in advance, I'm writing this late and severely anxious.\n\nOverall, I'm a pretty good student. 4.0 GPA, 1470 SAT, captain of my Computer Science and Math teams, etc. And for the most part, I've been a decent enough kid all throughout high school. But, there's a significant drop in my grades on my transcript, as well as a major shift in my behavior that feels like I have to talk about it. \n\nThe only problem is that I had these issues because of a miscarriage sophomore year, when I was 14. I fell in love with and trusted someone who didn't actually have my best interest at heart and made a mistake because I didn't have very good sex Ed (Texas student.)\n\nI wrote my personal essay about it, but I'm reconsidering submitting it to colleges. It's been checked by two English teachers and my best friend, all of whom are fairly liberal women. \n\nI don't want to hurt my admissions chances with this essay, but everything from my choice of major to my grades and work ethic came from the desperation I felt to be a better person in the name of my daughter. Is it a mistake?",
  "author": "scar_1023",
  "created": 1634874662,
  "updated": 1635183579,
  "over_18": false,
  "upvotes": 33,
  "upvote_ratio": 0.92,
  "comments": {
    "hhkx5na": {
      "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhkx5na/",
      "text": "I wouldn’t submit to religious affiliated universities ( usually catholic), but AOs are generally left leaning as well ( colleges in general are)",
      "author": "Edible-pet-fish",
      "created": 1634875707,
      "upvotes": 37,
      "replies": {
        "hhkxbzx": {
          "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhkxbzx/",
          "text": "Thank you! I'm not too worried about the social aspect, because I'm only applying to secular, liberal schools. My primary fear is coming across as irresponsible or unintelligent, especially since almost everywhere I'm applying is a T50",
          "author": "scar_1023",
          "created": 1634875813,
          "upvotes": 8,
          "replies": {
            "hhleyg7": {
              "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhleyg7/",
              "text": "It was a moment of growth. That’s what a lot of these essays are about. For example, a peer of mine wrote their essay on how they used illicit drugs during high school and got into Columbia. If this is a story about you that you think would help the admissions officers to get to know you better, then that’s all it takes",
              "author": "CommanderOreo",
              "created": 1634888743,
              "upvotes": 18,
              "replies": {}
            },
            "hhl264h": {
              "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhl264h/",
              "text": "If you learned and changed from the experience and make it clear in the essay, perhaps it will be aight",
              "author": "Cannot_Spel",
              "created": 1634878835,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hhlu1i6": {
          "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhlu1i6/",
          "text": "AOs shouldn’t let political bias impact their decisions",
          "author": "Thunderbird23",
          "created": 1634901353,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhl23io": {
      "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhl23io/",
      "text": "Honestly, that sounds like an amazing topic that is really personal. Just be really careful with your specific word choice and the picture that you are making of yourself. Maybe have someone who does not know you read it to see their first impressions?",
      "author": "MidnightNightingale",
      "created": 1634878785,
      "upvotes": 24,
      "replies": {}
    },
    "hhl5qzy": {
      "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhl5qzy/",
      "text": "wait how do you have a 4.0 GPA if you have a significant drop in grades on your transcript?\n\nBut anyway yeah your essay is super risky and there's no telling how AOs will see it- it could reflect very well (AOs could be touched by your determination to make a better life for your child and how you grew from your mistakes, for instance), or it could reflect poorly (AOs could view you as reckless/impulsive, think you're trying to make excuses with by blaming it on \"bad sex ed\", fear that you might get pregnant again in college, etc). \n\nImo you should send it to all your high reaches and have a more \"safe\" essay for your targets/safeties.",
      "author": null,
      "created": 1634881331,
      "upvotes": 11,
      "replies": {
        "hhlan61": {
          "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhlan61/",
          "text": "I have an exact 90 at semester in one class. My history teacher was a saint and passed me one of three \"mini\" semesters. The other I had a 99 and 100.",
          "author": "scar_1023",
          "created": 1634885154,
          "upvotes": 6,
          "replies": {
            "hhlqpz4": {
              "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhlqpz4/",
              "text": "i must break it to you a 90 is not a significant drop in grades, maybe personally but otherwise that’s an acceptable and good grade. there are people applying to top20s with B’s on their transcript and they don’t get penalized for that because their overall GPA is excellent. That’s an outstanding grade especially considering what you were going through",
              "author": "Garden-frog",
              "created": 1634898917,
              "upvotes": 18,
              "replies": {
                "hhlvn9b": {
                  "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhlvn9b/",
                  "text": "The end result wasn't as awful as it could be. I think it's moseso the 71 I had one of the three parts of the semester, even if they can't see it. Thanks for the kind words, it's definitely helpful at a time like this",
                  "author": "scar_1023",
                  "created": 1634902391,
                  "upvotes": 2,
                  "replies": {
                    "hhpi62c": {
                      "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhpi62c/",
                      "text": "If they can't see it then why are you worried about it lol",
                      "author": null,
                      "created": 1634963126,
                      "upvotes": 1,
                      "replies": {
                        "hhpi7uz": {
                          "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhpi7uz/",
                          "text": "I'm a perfectionist",
                          "author": "scar_1023",
                          "created": 1634963158,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhl7nkc": {
      "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhl7nkc/",
      "text": "This is definitely life changing event and you have no option but to mention it. 90% would be sympathetic. That is given. Don’t blame anyone or anything, The focus should be on how you have been handling the situation esp from academic side.",
      "author": "svday",
      "created": 1634882767,
      "upvotes": 6,
      "replies": {}
    },
    "hhlkxo6": {
      "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhlkxo6/",
      "text": "the essay topic is personal and has had a big impact on your life - so i guess it qualifies. however, the main part here to talk about not only what you went through, but what you learned. you need to be able to convey what this hardship taught you. then, you’ll do just fine. all the best!!",
      "author": "Accomplished-Ad-3774",
      "created": 1634894098,
      "upvotes": 4,
      "replies": {}
    },
    "hhm61gi": {
      "link": "/r/ApplyingToCollege/comments/qd8nwf/risky_essay_topic/hhm61gi/",
      "text": "Hi there. I don’t know if you’ve seen this post yet or not, but u/McNeil Admissions and I jointly wrote a post about addressing trauma and other serious or heavy topics in your application. I think you should read it. https://www.reddit.com/r/ApplyingToCollege/comments/pc03za/13_reasons_why_its_ok_to_write_about_trauma_in/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nIt might have some helpful advice or just some reassurance for you. Good on you for taking back your life and moving forward. \nReach out if you have questions or want to discuss further",
      "author": "admissionsmom",
      "created": 1634908134,
      "upvotes": 4,
      "replies": {}
    }
  }
}