{
  "sid": "qt5avf",
  "link": "/r/ApplyingToCollege/comments/qt5avf/colleges_for_me/",
  "title:": "Colleges for me",
  "text": "I was mainly applying to Canada, but I am also looking to apply to the USA. I'm an international student (Indian) doing an Indian curriculum in Qatar. My 10th grades and 9th grades are good, my 11th grades were really bad (covid). So I'm looking to apply to any good universities with high acceptance rates. For example, a good match I have found was Arizona state university.  PS, my sat score is only 1160(took only 1 time, the second time it got canceled sadly, could've brought it up to 1400s). Also, I am scoring very good in my 12th and it'll be evident from my term 1 exam hopefully which I have to take in December. I'm planning on taking computer science. I just want to know some good colleges you guys believe I have a chance in. I also have decent extracurriculars. \n\nMy parents are willing to pay 25K USD each year, I know I don't have any chance in scholarships so I'll probably be looking into loans if needed.",
  "author": "mooncake2004",
  "created": 1636822765,
  "updated": 1637180853,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkhaf10": {
      "link": "/r/ApplyingToCollege/comments/qt5avf/colleges_for_me/hkhaf10/",
      "text": "$25k for total cost of attendance, including living expenses? \n\nUniversity of New Mexico would be around $28k/year total cost of attendance if you had the equivalent of a 3.5 GPA. $32k/year with the equivalent of a 3.0 GPA. \n\nIf your GPA equivalent is above 3.0, you might qualify for scholarships at Mississippi State (not sure if non-resident includes international students there).  That would get your cost under $30k/year I think.\n\nFlorida public universities are fairly inexpensive with no scholarship, but are probably still in the $35-40k range.",
      "author": "BrawnyAcolyte",
      "created": 1636825595,
      "upvotes": 2,
      "replies": {
        "hkheb5o": {
          "link": "/r/ApplyingToCollege/comments/qt5avf/colleges_for_me/hkheb5o/",
          "text": "25K is only for just annual tuition fees, the expenses I can take care of by myself by getting the job and getting extra help from parents. Thanks for these unis.",
          "author": "mooncake2004",
          "created": 1636827249,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}