{
  "sid": "qj79ax",
  "link": "/r/ApplyingToCollege/comments/qj79ax/should_i_write_about_columbias_core/",
  "title:": "Should I write about Columbia's Core?",
  "text": "For my supplements: \n\nI'm a bit torn as I've read/heard many argue that it's cliche, overused, and highly predictable. However, I've also seen students who write about the Core (in a personalized manner of course) have successful results. Columbia puts a giant emphasis on its Core as its premier, distinctive educational factor.  \n\nThe \"Why Columbia\" supplement is also only 200 words now instead of the usual 300 words so I have to be even more concise. I've written a response that I'm honestly happy with, but it makes no mention of the core. I do cite specific examples (courses, campus ECs and orgs) that I love about Columbia, but I'm afraid that omitting any mention of the Core will hurt me. I could probably string together some lines that are personal enough to my specific application about the Core, but that would mean removing some other lines about Columbia-specific activities I hope to partake in. \n\n&#x200B;\n\nAny advice would be greatly appreciated since my app is due Monday lol...",
  "author": "AyaanTheIon",
  "created": 1635617909,
  "updated": 1636159143,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hiojxwm": {
      "link": "/r/ApplyingToCollege/comments/qj79ax/should_i_write_about_columbias_core/hiojxwm/",
      "text": "It's usually a good idea to MENTION that you're aware of and appreciate the rigor of Columbia's Core program, but I definitely wouldn't recommend writing an entire essay about it.\n\nColumbia knows that the Core program has eaten a few souls over the years, and acknowledging that you know how demanding it can be at some point in your application is pretty important.",
      "author": "deportedtwo",
      "created": 1635623671,
      "upvotes": 2,
      "replies": {}
    },
    "hj9d4at": {
      "link": "/r/ApplyingToCollege/comments/qj79ax/should_i_write_about_columbias_core/hj9d4at/",
      "text": "DO mention some way you're genuinely excited to engage with the academics at Columbia (if you're excited for the Core, pick a course/professor in it and say that!). \n\nDON'T call the Core \"rigorous\" or \"demanding\" because (a) any peer institution will be the same, so this isn't a strong reason for liking the Core and (b) the experience of most freshmen (source: current freshman) is that the Core is not as difficult as we expected and that it might actually be less demanding than peer colleges' first year schedules. \n\nAOs are likely aware of this, so you mentioning the unique rigor of the Core is at best useless and at worst shows (a) you've only done surface level research on Columbia's academics and (b) you aren't ready to plunge into rigor at any college of similar workload.",
      "author": "Lawgical101",
      "created": 1636015592,
      "upvotes": 1,
      "replies": {}
    }
  }
}