{
  "sid": "qj4x3w",
  "link": "/r/ApplyingToCollege/comments/qj4x3w/talk_about_being_unable_to_attend_tuition_in/",
  "title:": "Talk about being unable to attend tuition in common app additional info",
  "text": "So I’m from Asia, currently attending HS there. Where I’m from has an academically rigorous education system and I’m also attending the top school in the region. Competition is VERY intensive, and I know 70%-80% of my classmates rely on some form of tuition from tutors/organisations outside of school to maintain or boost their grades. The thing is, I’m from a low-income family that couldn’t afford these costly tuition fees, so I have to get by on my own. My grades are just above average at school, and getting tuition does often give people an edge in academics. \nHowever, I don’t know if I should include this circumstance in my common app add’l info section, because I’m worried I’ll be perceived as “whiny” or just blaming something for my grades. So should I state it there?\n(Note: I’m also first gen and from a single parent family, but colleges will know that elsewhere in my applications. But I just don’t think those conditions show the full picture.)\nThanks in advance.",
  "author": "ales-shir64",
  "created": 1635611034,
  "updated": 1635778933,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hio9pbh": {
      "link": "/r/ApplyingToCollege/comments/qj4x3w/talk_about_being_unable_to_attend_tuition_in/hio9pbh/",
      "text": "depending on your school profile.  if it's recognizably in a rich area where all the students probably invest a ton of money into tutoring, the unis will know.  AOs probably also know which countries have intense systems and a culture of tutoring.  but it definitely doesnt hurt to mention that your financial situation made it impossible to access help with academics.",
      "author": "chuuuuuu-",
      "created": 1635619296,
      "upvotes": 2,
      "replies": {
        "hio9t1z": {
          "link": "/r/ApplyingToCollege/comments/qj4x3w/talk_about_being_unable_to_attend_tuition_in/hio9t1z/",
          "text": "just word it the right way and you wont sound whiny",
          "author": "chuuuuuu-",
          "created": 1635619339,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hinufsm": {
      "link": "/r/ApplyingToCollege/comments/qj4x3w/talk_about_being_unable_to_attend_tuition_in/hinufsm/",
      "text": "Sure. Include in additional info section. Keep to facts & concise.",
      "author": "roguezebra",
      "created": 1635612951,
      "upvotes": 1,
      "replies": {}
    },
    "hinugvp": {
      "link": "/r/ApplyingToCollege/comments/qj4x3w/talk_about_being_unable_to_attend_tuition_in/hinugvp/",
      "text": "Sure. Include in additional info section. Keep to facts & concise.",
      "author": "roguezebra",
      "created": 1635612964,
      "upvotes": 1,
      "replies": {}
    }
  }
}