{
  "sid": "qumvyr",
  "link": "/r/ApplyingToCollege/comments/qumvyr/cu_denver_versus_u_of_az/",
  "title:": "CU Denver versus U of AZ",
  "text": "Any reason I should pick CU Denver (not U o Denver, the private school)?\nI have been accepted to both for Biology. I plan to be on premed track and want to go to Med school.",
  "author": "collegedreams",
  "created": 1637000750,
  "updated": 1637179710,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkr2nka": {
      "link": "/r/ApplyingToCollege/comments/qumvyr/cu_denver_versus_u_of_az/hkr2nka/",
      "text": "Denver as a city is horrible.  I’d choose anywhere  in Arizona in a heartbeat.\n\nEdit: 6 teens shot in an Aurora (Denver suburb) drive by just today.  None fatally, thankfully.",
      "author": "chumer_ranion",
      "created": 1637002057,
      "upvotes": 0,
      "replies": {
        "hkr8e0e": {
          "link": "/r/ApplyingToCollege/comments/qumvyr/cu_denver_versus_u_of_az/hkr8e0e/",
          "text": "Damn why the Denver hate... they got weed over there",
          "author": "ssssseabass",
          "created": 1637004335,
          "upvotes": 7,
          "replies": {
            "hkr9r9r": {
              "link": "/r/ApplyingToCollege/comments/qumvyr/cu_denver_versus_u_of_az/hkr9r9r/",
              "text": "The people are strange (uneasy mix of rich, extremely poor, racist, redneck, liberal, and militant republican).  Cheaper housing seems to be uniformly terrible no matter where you go.  Lots of mass shootings in and around the area.  The drivers are absolutely insane and I fear for my life when being driven down the highway (more than I did in Houston), which apparently has a minimum speed requirement of 93 mph.  Far-ish from Boulder (if you’re even in to that—it’s not that great either) and the weather is bonkers (80 degrees one day, snow the next—not a joke). \n\nOh and the city is hideous except for the wealthiest suburbs.\n\nEdit: oh and don’t let me forget that because of the elevation and weather your face will look like a leather handbag by the time you’re 33\nand you’ll probably get skin cancer.",
              "author": "chumer_ranion",
              "created": 1637004883,
              "upvotes": 3,
              "replies": {
                "hkrahed": {
                  "link": "/r/ApplyingToCollege/comments/qumvyr/cu_denver_versus_u_of_az/hkrahed/",
                  "text": "Heheheheeheh why doed this sound exacrly like WashUuuuuuuuh 🥺😭😂😂😂😂\n\nOksy but like this city sounds bad you right",
                  "author": "ssssseabass",
                  "created": 1637005168,
                  "upvotes": 1,
                  "replies": {
                    "hkt60qj": {
                      "link": "/r/ApplyingToCollege/comments/qumvyr/cu_denver_versus_u_of_az/hkt60qj/",
                      "text": "Turns out there was a shooting in a Denver suburb right as I made that comment.",
                      "author": "chumer_ranion",
                      "created": 1637033746,
                      "upvotes": 1,
                      "replies": {
                        "hkt7o73": {
                          "link": "/r/ApplyingToCollege/comments/qumvyr/cu_denver_versus_u_of_az/hkt7o73/",
                          "text": "Well damn....\n\nThat's scary",
                          "author": "ssssseabass",
                          "created": 1637034525,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hkrthku": {
      "link": "/r/ApplyingToCollege/comments/qumvyr/cu_denver_versus_u_of_az/hkrthku/",
      "text": "As someone who likes Denver, I wouldn't pick CU Denver over U of Arizona unless you are a Colorado resident and live in the area.  It's more of a commuter school - CU Boulder and Colorado State are the main traditional public universities in the state, with Mines as an engineering focused school.\n\nIt does get some boosts in some research ratings because administratively it's tied to Anschutz (the CU med school), but that doesn't really have a significant impact on their undergrad offerings IMO.",
      "author": "BrawnyAcolyte",
      "created": 1637012602,
      "upvotes": 0,
      "replies": {}
    }
  }
}