{
  "sid": "qyf56j",
  "link": "/r/ApplyingToCollege/comments/qyf56j/older_potenital_applicant_need_guidance/",
  "title:": "Older potenital applicant, need guidance",
  "text": "I am currently 27 yo did not do well in highscool and eventually dropped out. I did go and get my GED shortly after and did a semester at a local community college but that did not work out either. I had other priorities and some serious life issues at the time. I was able to retain the info in my courses and tested well, just did not do homework. I recently rekindled interest in going to school for a degree in something i am interested in to provide for a better life  but am concerned that my past poor performance will negatively impact me on admissions to the schools and majors I am interested in, one being a 3.6 gpa in highschool for admission. Would getting gened's done prior to applying help?  Does anyone have insights that could help me?",
  "author": "AreYouAliv3",
  "created": 1637443390,
  "updated": 1637688338,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hlflgqo": {
      "link": "/r/ApplyingToCollege/comments/qyf56j/older_potenital_applicant_need_guidance/hlflgqo/",
      "text": "I'd honestly suggest you do 2 years of community college and try to transfer. That's a much more common route for older applicants, and it gives the transfer uni something to work with. Your results from high school and your GED are dated, so they're hard to use as a measuring stick.\n\nIf you do two years at CC, you can point to good grades there as justification for your transfer. And when you're done, your degree comes from the place where you finish, so it definitely looks better. \n\nI would recommend looking at CCs or other small local colleges to see if they have any deals with a bigger university. Oftentimes CCs will have one big partner where you can get guaranteed admission and even scholarships if you perform well. RIT does this with RCC if I'm not mistaken, for example.",
      "author": "steelerfaninperu",
      "created": 1637444183,
      "upvotes": 9,
      "replies": {}
    },
    "hlg3vz4": {
      "link": "/r/ApplyingToCollege/comments/qyf56j/older_potenital_applicant_need_guidance/hlg3vz4/",
      "text": "Thank you for the information, when i mentioned gen ed courses in my post i should have been more specific that i thought i would be able to take them where i live now at pur local community college before transfering to a school where i could complete a degree in my desired field. It is good to know that is a viable option.",
      "author": "AreYouAliv3",
      "created": 1637452607,
      "upvotes": 3,
      "replies": {}
    },
    "hlfjz6e": {
      "link": "/r/ApplyingToCollege/comments/qyf56j/older_potenital_applicant_need_guidance/hlfjz6e/",
      "text": "Talk to admissions about starting  part time then matriculating in to full time status.",
      "author": "AssumptionNo2054",
      "created": 1637443516,
      "upvotes": 2,
      "replies": {}
    }
  }
}