{
  "sid": "r4rfvt",
  "link": "/r/ApplyingToCollege/comments/r4rfvt/second_language_requirement_help/",
  "title:": "Second Language Requirement Help",
  "text": "Hey y'all, I would just like to ask about the typical university second language requirements. I am in my senior year, and on my transcript I only have 1 year of foreign language because I did not take any in my last 3 years, but I did do foreign language studying by myself separate from school in an academy. Could I count it as a year of foreign language? Also, if it doesn't, could I sign up for an AP foreign language and have it count as a year even if it is self-study? Thanks!",
  "author": "Iwannaseemoontonite",
  "created": 1638175137,
  "updated": 1638204479,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmigba0": {
      "link": "/r/ApplyingToCollege/comments/r4rfvt/second_language_requirement_help/hmigba0/",
      "text": "First definitely check the schools you want to apply to to see what they require and how to satisfy those requirements. \n\nI can't speak for every school, but to my knowledge most schools allow a passing score in an AP foreign language to satisfy the second language requirement (the exact score requirement may vary). But if you're in your senior year and you want to sign up for an AP exam you should do it ASAP because it's getting fairly late in the year and if you're taking it outside school it can be a bit tricky to find a testing location.",
      "author": "EconomicSeahorse",
      "created": 1638176591,
      "upvotes": 1,
      "replies": {
        "hmignwp": {
          "link": "/r/ApplyingToCollege/comments/r4rfvt/second_language_requirement_help/hmignwp/",
          "text": "My school does provide AP tests, and what I'm getting is that I should sign up to fulfill the requirement/recommendations? Because what I am afraid of is that it would not show up on my transcript as a second language and therefore not fulfill the second language requirement/recommendation, and since I am in my senior year I would not receive a grade or score until July next year when I would have already received my acceptances.",
          "author": "Iwannaseemoontonite",
          "created": 1638176890,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}