{
  "sid": "qv5ykn",
  "link": "/r/ApplyingToCollege/comments/qv5ykn/questbridge/",
  "title:": "Questbridge",
  "text": "I tried for the quest bridge college match, and quest bridge is telling me that there is a way for me to do regular decision through them. Does anyone know how to do that because I’m struggling trying to find out. My bad if I sound illiterate.",
  "author": "Muisolosyourfavverse",
  "created": 1637062833,
  "updated": 1639804118,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkuvy00": {
      "link": "/r/ApplyingToCollege/comments/qv5ykn/questbridge/hkuvy00/",
      "text": "If you don't match with any of the schools you listed, you can apply to any Questbridge school with your Questbridge app in the RD cycle. \n\n[https://www.questbridge.org/high-school-students/regular-decision](https://www.questbridge.org/high-school-students/regular-decision) \\- look at the links for the schools that interest you. They will tell you what you need to supply for RD admissions. You upload materials into the portals of individual schools, not through Questbridge.",
      "author": "WithMirthAndLaughter",
      "created": 1637073706,
      "upvotes": 1,
      "replies": {
        "hkuwr6x": {
          "link": "/r/ApplyingToCollege/comments/qv5ykn/questbridge/hkuwr6x/",
          "text": "I didn’t make into the national college match and I was just wondering how I’d go about applying through Questbridge after that",
          "author": "Muisolosyourfavverse",
          "created": 1637074067,
          "upvotes": 1,
          "replies": {
            "hllidoo": {
              "link": "/r/ApplyingToCollege/comments/qv5ykn/questbridge/hllidoo/",
              "text": "I've heard some schools will let you use the Questbridge application even if you aren't a QB finalist, but I don't know much about it. Maybe check with the admissions office at QB schools that interest you - let them know you weren't a finalist but are interested in using the QB app instead of the Common App. Worst they can say is no. Good luck!",
              "author": "WithMirthAndLaughter",
              "created": 1637552356,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}