{
  "sid": "qamvgp",
  "link": "/r/ApplyingToCollege/comments/qamvgp/am_i_just_thinking_too_much_while_i_procrastinate/",
  "title:": "Am I just thinking too much while I procrastinate, or do I have burnout?",
  "text": "An international Junior. ESL. 1440 SAT. 3.97 GPA. \n\nI spent an average of 4\\~6 hours on my homework each night. And another 8\\~10 hours on weekends. I spent 8 hours on robotics ( 3\\* 2 hours practice session at school, 2 hours of administrative work at home). My other clubs take around 4\\~6 hours each week combined (many of them are event-based, so I alternate my center of focus according to what's coming up). With this schedule, I have no time to study for SAT, or even any AP tests (I am shivering just thinking about the Spring AP-prep phase). With all others being A, I have a B in APUSH and a B in English.   \n\n\n  \nObviously, all of these works are trying to get me into a good college. I just realized that my major would most likely start better off if I attend graduate schools (Finacial Management or Engineering). Therefore, this means I have to work my head off for another four years after I enter college.  I just realized how this is quite annoying, I worked my head off for four years to be given the qualification to work my head off for another four years. I mean I kind of chose to do all of these myself, and I am actually \"enjoying\" working myself to death, but it seems a little bit unreasonable. (It gets a little bit nerve-wracking seeing some of my classmates just chilling with easy classes, getting free 4.0s, and partying all day. Since I have some APs, getting a 4.0 become hard.) Obviously, my family needs me to be able to feed myself before the age of 25, and possibly give back to the family (I love them, I do not feel forced) as soon as possible, since my parents are aging and where we live, a good retired life are either based on good stocks you hold, business you own, or how rich and caring your children are.  Someone tell me that I am not alone, that my \"hard work\" is not an illusion. (Saw too many of the Valedictorian-Candidates of my class, which made me panic so often for the little ECs I have, but I am really packed so tight that I do not think I can handle more.)",
  "author": "carbon_yttrium",
  "created": 1634564307,
  "updated": 1634653534,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {}
}