{
  "sid": "q4nllt",
  "link": "/r/ApplyingToCollege/comments/q4nllt/as_my_application_deadline_creeps_closer_im_going/",
  "title:": "As my application deadline creeps closer, I'm going insane",
  "text": "Hi, not sure if this is the right place for this, but I'm need of some advice. I was pretty sure what I wanted to do, the schools I applied to and my career prospects. Suddenly I'm really unsure and full of doubt. I was going to apply as a psych major because it's a pretty broad degree, but now I'm really obsessed with doing something with art/writing instead. It's all hitting me just now and I know I'm not really talented enough to keep my head up in an unstable profession such as that, but what if I dig myself into doing something I don't even like doing just for practical reasons? It all feels too late to change anything and I'm really messed up about it. If I change everything I kept together earlier there's a chance I'll  be fucked. If I don't do anything and just resign myself, I'm worried I'll be miserable for life. I apologize if this is coming off as overdramatic, I just need help to deal with all this.",
  "author": "Individual-Manner-67",
  "created": 1633793502,
  "updated": 1634074124,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfzpxnf": {
      "link": "/r/ApplyingToCollege/comments/q4nllt/as_my_application_deadline_creeps_closer_im_going/hfzpxnf/",
      "text": "Hi there! People change majors all the times.  Many schools, if not all, allow changing your major while you're in school, so, don't sweat it. At this time your focus should be in the applications. Keep the eyes on the prize, and once you get to college, you will explore other classes and even other majors. One of my friends is finishing school as a Poli Sci major, but during an internship last summer, she realized that she doesn't want to be a lawyer and she is exploring other areas now, on her senior year. Hope it helps.",
      "author": "mamaezinha",
      "created": 1633793969,
      "upvotes": 1,
      "replies": {}
    }
  }
}