{
  "sid": "reacds",
  "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/",
  "title:": "Help me figure out where to EDII.",
  "text": "My options are  Northeastern, Boston College, and Boston university. I would be happy to get into any of them and really can’t decide. \nMostly concerned with campus experience and prestige. \nAnyone have any suggestions? Thanks!\n(Side note: which one do you think is easiest to get into?)",
  "author": "Reasonable_Drop_7650",
  "created": 1639261362,
  "updated": 1639515418,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho796hg": {
      "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/ho796hg/",
      "text": "The Northeastern experience is super different from that of BU and BC due to co-op cycles. Also depends on your major for prestige. If you want a general wow factor go with Boston College.",
      "author": "sadalas",
      "created": 1639278128,
      "upvotes": 2,
      "replies": {}
    },
    "ho6bkto": {
      "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/ho6bkto/",
      "text": "I would attend some information sessions, do some research on both the schools websites and people's thoughts online, and tour if you can. BU is the easiest to get in out of the three. Good luck for EDII on whichever college you choose!",
      "author": "Overlooked_Doorway",
      "created": 1639262201,
      "upvotes": 2,
      "replies": {
        "ho6i7ry": {
          "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/ho6i7ry/",
          "text": "I agree, these 3 colleges are very different from each other, and if you research the schools online, read comments on reddit about each school and maybe attend an online information session if one is coming up soon before the ED II deadline … you will have a much better idea and maybe that will let you eliminate at least one of them for EDII.\n\nBoston College has a religious affiliation and it is perhaps slightly more conservative. The campus buildings are beautiful.  BU is a very urban campus … like NYU.  I don’t know much about NE other than everybody thinks of its “co-op” model, so you should google “Northeastern Co-op”.\n\nIf you asked 100 people which one is most prestigious, you would probably get 3 similar sized answers.  If I had to choose one for me, I would probably go 1)BC 2)BU 3)NE.\n\nThe ED acceptance rate for BC and NE is very similar.  BU’s ED acceptance rate is higher, if you are concerned about maximizing your chance of admission through EDII.\n\nSounds like you really want to be in Boston …. perhaps to be near a boy or girl 😂",
          "author": "ChancellorGH",
          "created": 1639265165,
          "upvotes": 3,
          "replies": {
            "ho6m826": {
              "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/ho6m826/",
              "text": "Thanks so much for the advice!\nI just live close and like the city😂",
              "author": "Reasonable_Drop_7650",
              "created": 1639266992,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ho6dspm": {
          "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/ho6dspm/",
          "text": "Alright will do, I’ve really been stressing out with the deadline coming up",
          "author": "Reasonable_Drop_7650",
          "created": 1639263180,
          "upvotes": 1,
          "replies": {}
        },
        "hobq87n": {
          "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/hobq87n/",
          "text": "Doesn’t BU have the lowest acceptance rate of the 3",
          "author": "LegendaryRevolver",
          "created": 1639360280,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho9jmip": {
      "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/ho9jmip/",
      "text": "i applied ed2 to BU and so far it’s been the best decision:) 100 percent has the best social life out of the three and the professors are great. let me know if you have questions !",
      "author": "graciegirly888",
      "created": 1639327766,
      "upvotes": 1,
      "replies": {}
    },
    "ho6dlr9": {
      "link": "/r/ApplyingToCollege/comments/reacds/help_me_figure_out_where_to_edii/ho6dlr9/",
      "text": "I’d say bc for prestige. Don’t know campuses .",
      "author": "jake2160",
      "created": 1639263093,
      "upvotes": 0,
      "replies": {}
    }
  }
}