{
  "sid": "qf0vvj",
  "link": "/r/ApplyingToCollege/comments/qf0vvj/cant_pay_for_anything_but_state_school/",
  "title:": "cant pay for anything but state school",
  "text": "Junior with a 1550 sat, 4.67 GPA, 3 seasons of a sport, volunteer tutoring for 2 different organizations, maybe a national merit semifinalist PSAT score, and active in a few other clubs\n\n&#x200B;\n\nby the looks of it though, I can only attend my state school which has a 70% acceptance rate because of the cost of other schools and how much cheaper the in state. It would basically like being forced to go to my safety.\n\n&#x200B;\n\nWhat are my options? Id estimate that I could cover about 25K a year, not poor enough to qualify for substantial financial aid, parents have to put other siblings through college too. Are there any schools that give full rides? Do I have any options out of this?",
  "author": "Throwaawy12738172983",
  "created": 1635108569,
  "updated": 1635182780,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhx3gyt": {
      "link": "/r/ApplyingToCollege/comments/qf0vvj/cant_pay_for_anything_but_state_school/hhx3gyt/",
      "text": "National merit finalist would open up a lot of big merit scholarships for sure. \n\nMaybe you wouldn't prefer them to your state school, but that's usually full tuition at Fordham, close to full tuition at Texas A&M, full tuition at ASU, and a complete full ride at schools like Alabama or UTD.\n\nYou can also shoot your shot at more selective schools that also have big merit scholarships - Duke, Case Western, etc.",
      "author": "BrawnyAcolyte",
      "created": 1635115274,
      "upvotes": 2,
      "replies": {}
    },
    "hhx3jm8": {
      "link": "/r/ApplyingToCollege/comments/qf0vvj/cant_pay_for_anything_but_state_school/hhx3jm8/",
      "text": "You have to look elsewhere. Many private Universities will put together a package for you to cover a portion of tuition or room/board, but you have to go to them after you apply. That is the crunch, but don’t rule it out.\n\nhttps://www.usnews.com/education/best-colleges/articles/2018-09-13/how-to-get-the-most-generous-financial-aid-package-from-your-college",
      "author": "Speakingrealistic",
      "created": 1635115309,
      "upvotes": 2,
      "replies": {}
    }
  }
}