{
  "sid": "qn1agb",
  "link": "/r/ApplyingToCollege/comments/qn1agb/college_ideas/",
  "title:": "College Ideas",
  "text": "I’m a senior in high school looking for extra colleges to add to my list.\nI’m thinking about majoring in science and would like a school that is strong academically and where I would be challenged. I’m leaning towards LAC because I feel like it would be more meaningful learning and I’d like to get to know the professors \nAt the same time I love the outdoors, spending time with friends, ect. I don’t want to waste college being stressed, I wan it to be a fun experience that isn’t cutthroat.\nRight now I’m applying to CC Whitman Macalster and other similar schools and possibly williams (I love the school but seems to elitist)\nDoes anyone know of other schools which are academically challenging without being overally cut throat, have a chill student body, and preferably good outdoor access? Merrit scholarships are also a plus.",
  "author": "CarsonJ453",
  "created": 1636079663,
  "updated": 1637377187,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjdn5se": {
      "link": "/r/ApplyingToCollege/comments/qn1agb/college_ideas/hjdn5se/",
      "text": "If you want an academically challenging college experience that will have to do more with your major than anything else. \n\nTry looking at like Iowa State or Vermont’s Honors college and similar honors colleges for more rigorous classes. LACs like Reed might fit your bill.",
      "author": "TritonTheCat",
      "created": 1636087081,
      "upvotes": 2,
      "replies": {}
    },
    "hjdx1ph": {
      "link": "/r/ApplyingToCollege/comments/qn1agb/college_ideas/hjdx1ph/",
      "text": "If you want to major in science, at least apply to and consider going to universities with a strong research program. Unless you are premed, Science at the university level is more about research than the actual classes.",
      "author": "ProteinEngineer",
      "created": 1636094286,
      "upvotes": 1,
      "replies": {
        "hjijz6t": {
          "link": "/r/ApplyingToCollege/comments/qn1agb/college_ideas/hjijz6t/",
          "text": "I feel like it would probably be easier to get research at a medium college by getting to know professors well. Though it probably wouldn’t be nearly as cutting edge as research at large universities.",
          "author": "CarsonJ453",
          "created": 1636175017,
          "upvotes": 1,
          "replies": {
            "hjion31": {
              "link": "/r/ApplyingToCollege/comments/qn1agb/college_ideas/hjion31/",
              "text": "It’s not too difficult to join research labs at large universities. Few people actually express interest",
              "author": "ProteinEngineer",
              "created": 1636178293,
              "upvotes": 1,
              "replies": {
                "hjjpquv": {
                  "link": "/r/ApplyingToCollege/comments/qn1agb/college_ideas/hjjpquv/",
                  "text": "I also just want the community feel of a small liberal arts college. I’m applying to a few universities but mostly lacs",
                  "author": "CarsonJ453",
                  "created": 1636204834,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}