{
  "sid": "q92d7f",
  "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/",
  "title:": "How am I suppose to compete with these crazy kids at my school for T20 spots????",
  "text": "Just found out today that a girl at my school went to Germany to perform her cello piece! I searched up her name and apparently she's one of the nation's best player, and has gone to other countries to perform. \n\nJust...insane, and she's not even the only one. One of the kids in my grade swim junior olympics, another girl raised 11k dollars, and there's a lot more of them lurking in the crowd. How am I even suppose to compete with my slightly above average resume???\n\nHow the hell are these kids so talented? Is there even enough spots to go around?? \n\nI used to be so confident in my activities but that confident has dwindled. I hate admitting it, but I'm average. It sucks that I worked so hard just to ... come out average in the end.",
  "author": "aprilseasons",
  "created": 1634348853,
  "updated": 1634575158,
  "over_18": false,
  "upvotes": 65,
  "upvote_ratio": 0.98,
  "comments": {
    "hgtcnm8": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgtcnm8/",
      "text": "At Cornell, every year when the new freshmen come in, the daily sun writes a paper highlight their accomplishments. And it’s actually really impressive. On the other hand, they also accepted me sooooooooo… but then it might be harder when they are from the same school…",
      "author": "smolfish-6352",
      "created": 1634350652,
      "upvotes": 43,
      "replies": {
        "hgtdi9o": {
          "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgtdi9o/",
          "text": "I guess I started to embrace being “average” when I was in college. There’s absolutely nothing wrong with it. I learned that there will always be those people doing impressive things, and then there will be me. On the other hand, I am sure some people might disagree that you are just average. I believe there are people look up to you and what you accomplished.",
          "author": "smolfish-6352",
          "created": 1634351117,
          "upvotes": 16,
          "replies": {}
        },
        "hgxbykw": {
          "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgxbykw/",
          "text": "\\> work your balls off\n\n\\> go to Cornell\n\nit never even began for ithacacels",
          "author": "BSC56",
          "created": 1634430445,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hgud8hl": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgud8hl/",
      "text": "bruhhh but like when you have overachievers in the family??\n\nmy brother is j like a math genius and studies at cambridge\n\nmy cousin went 2 columbia\n\nmy other cousin is a national swim champ, a great MUNer, top in her class, 36 ACT, so amazing at research that a top research facility features her paper as a model one – she's prob getting into all her dream schools\n\nand I am just hoping for... at least something\n\nalso sibs if you find this post, pls don't do through my profile, thanks 🤩",
      "author": "mintyquaintchair2",
      "created": 1634377064,
      "upvotes": 19,
      "replies": {
        "hguslds": {
          "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hguslds/",
          "text": "Ikr how awkward it will be.😂",
          "author": "Safe_Asparagus033",
          "created": 1634388691,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgurvla": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgurvla/",
      "text": "AOs think in terms of regions, not schools. So you really are competing against more kids, but more slots. Don't worry about your classmates crowding you out of like, 1 slot of your school.",
      "author": "FoolishConsistency17",
      "created": 1634388265,
      "upvotes": 4,
      "replies": {}
    },
    "hgtadz9": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgtadz9/",
      "text": "IKR. AND IT IS ALWAYS THE SCHOOLS THAT YOU THINK ARE FUCKING FOR LOSERS. FOR EXAMPLE MY SCHOOL IS 50% PEOPLE WHO DGAF ABOUT HIGH SCHOOL AND YET WE HAVE A USACO CAMPER AND ISEF FINALIST. THE OTHER \\~7 PEOPLE WHO CARE HAVE MY LEVEL ACHIEVEMENTS. WORST PART IS WE ONLY SEND 4 PEOPLE TO T15.\n\nIT ALL CAME FULL CIRCLE. WE WERE NOT SPECIAL IN MIDDLE SCHOOL FOR NOT TAKING GEOMETRY IN 8TH GRADE WE WERE NOT SPECIAL IN 9TH GRADE FOR NOT TAKING CALC BC NOW WE ARE NOT SPECIAL AS JUNIORS FOR NOT HAVING THE CRAZY ECS KIDS WHO TOOK PRECALC IN 9TH GRADE HAD",
      "author": null,
      "created": 1634349415,
      "upvotes": 8,
      "replies": {
        "hgtb9ap": {
          "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgtb9ap/",
          "text": "Okay you're wayyyyy over thinking this.\n\nThere's nothing wrong with taking precalc in 11th grade!",
          "author": "ssssseabass",
          "created": 1634349886,
          "upvotes": 12,
          "replies": {
            "hgthr35": {
              "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgthr35/",
              "text": "Honestly, I think it's much better to have a solid foundation than be rushing into advanced courses without knowing why. Either way, Calc is taught in college and the typical American highschool schedule actually goes up to Precalc for Seniors (which is why the ACT and SAT test that at most).",
              "author": "leaf1598",
              "created": 1634353481,
              "upvotes": 5,
              "replies": {}
            },
            "hgtbjww": {
              "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgtbjww/",
              "text": "no im in calc bc. but its just that it always came around full circle. the kids who were special in middle school are now usaco campers. I went through a major shift in mindset... and yet the people who were equal to me in achievement and maturity in 9th grade maintained their maturity as well as their status. They bragged about math level in 9th grade, now they brag about ECs (getting into LBW/COSMOS)",
              "author": null,
              "created": 1634350043,
              "upvotes": 2,
              "replies": {
                "hgtcqws": {
                  "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgtcqws/",
                  "text": "Don't worry about math too much like that.\n\nAlso let's goo Junior Calc BC Buddies :D",
                  "author": "Berkeley_Simp",
                  "created": 1634350701,
                  "upvotes": 1,
                  "replies": {
                    "hgtcw6q": {
                      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgtcw6q/",
                      "text": "no its not that. its the fact that things havent changed. freshman year and middle school i was not the best because i wasnt the highest math level. now i am not the best becasue I dont have a national award/biggest baddest achievement of everyone else i am competing against in my hs. .",
                      "author": null,
                      "created": 1634350782,
                      "upvotes": 1,
                      "replies": {
                        "hgthch8": {
                          "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgthch8/",
                          "text": "Once your college acceptances start rolling in you will start to realize that you go to an above average school. San Ramon Dougherty Valley High sent 73 kids to Berkeley two years ago. And that's just enrolled, not accepted.",
                          "author": "Berkeley_Simp",
                          "created": 1634353251,
                          "upvotes": 2,
                          "replies": {
                            "hgthk3u": {
                              "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgthk3u/",
                              "text": "haha that is true. very true.",
                              "author": null,
                              "created": 1634353373,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "hgvl5eq": {
                              "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgvl5eq/",
                              "text": "well it IS a top 50 high school in the US according to their site and is also in-state. nonetheless, 73 kids to Berkeley is a TON",
                              "author": "whotookmyusernam",
                              "created": 1634402653,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hgv4qag": {
              "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgv4qag/",
              "text": "Seriously though every AO you ask will see that as normal. If someone took it as a freshman then they would not see that as normal.",
              "author": "abenn_",
              "created": 1634395175,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgvftrq": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgvftrq/",
      "text": "Us unaccomplished plebs can stand out by writing banger essays, or at least I hope we can",
      "author": "i_stan_t_cells",
      "created": 1634400290,
      "upvotes": 2,
      "replies": {}
    },
    "hgvhzbi": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgvhzbi/",
      "text": "I totally get the sentiment; I've been there.\n\nAt the same time, though, insecurity about your abilities and attaching your self-worth/happiness to something as arbitrary as ECs will only result in unhappiness and an inability to do things because you love them.\n\nDetach yourself from external things and be proud of what you've done, and push yourself to do the best you can -- not for college, but for yourself.\n\nIn the context of college: Put forth your best application, and let the rest happen. College is no doubt important, but ultimately, regardless of where you go, most of your success (as defined by you) will come from your own hard work and initiative than opportunities at a particular college.",
      "author": "ritzzzcrackers",
      "created": 1634401249,
      "upvotes": 2,
      "replies": {
        "hgwhas6": {
          "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgwhas6/",
          "text": "this",
          "author": "Valerievato",
          "created": 1634416458,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgv5z6d": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgv5z6d/",
      "text": "You know a uni can accept are than one kid form the same school, and they might not be the same major as you or be applying to the same schools",
      "author": "HahaStoleUrName",
      "created": 1634395773,
      "upvotes": 1,
      "replies": {}
    },
    "hgxbt9c": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgxbt9c/",
      "text": "\\> another girl raised 11k dollars\n\nThe fact that this is the third thing you could come up with means that there are only two accomplished kids at your school.  What the hell does $11,000 mean?  That's nothing.",
      "author": "BSC56",
      "created": 1634430379,
      "upvotes": 0,
      "replies": {
        "hgxm4c6": {
          "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgxm4c6/",
          "text": "are you kidding me?? 11k dollars is a lot of money and hard for any normal high school student to raise. its impressive & i think your views of what \"nothing\" is is altered because you probably attend a hypercompetitive hs",
          "author": "aprilseasons",
          "created": 1634435329,
          "upvotes": 3,
          "replies": {}
        },
        "hgxs9j4": {
          "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgxs9j4/",
          "text": "Bruh u stupid",
          "author": "NESLegends",
          "created": 1634438415,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgx8lnw": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgx8lnw/",
      "text": "I understand how you feel. My school has a lot of high income students, and the top twenty at my school all have doctor-engineer-lawyer parents. It feels so difficult to “compete” with these people when they have the resources to be excellent. I don’t have an answer, but I try to stay hopeful that whoever reads my application understands me in the context of my environment. My parents don’t have 5k for a violin instructor, I cannot afford to not watch my brothers and grandma after school, I cannot compete. It’s okay. It’s not your fault. You are still excellent.",
      "author": "xathan12",
      "created": 1634428884,
      "upvotes": 1,
      "replies": {}
    },
    "hgyd3g0": {
      "link": "/r/ApplyingToCollege/comments/q92d7f/how_am_i_suppose_to_compete_with_these_crazy_kids/hgyd3g0/",
      "text": "God it’s the most awful thing in the world right? My little brother who’s a good damned sophomore is more accomplished and more praised than I could ever be. He’s brilliant, has a architect internship, fences, runs varsity cross country and track, is in the musical, has perfect grades, and 0 mental illness. I’m not even applying for a T20 school. My school is #73 in the nation and I have worked so hard but no matter what I do I am never seen as enough. I had a fucking painting hang in a museum and I’m STILL NOT ENOUGH! There are kids at my school who went to the Olympic qualifiers, national ranking atheletes, national merit scholars with perfect sat and gpa, kids with research papers, kids with nonprofits, and then there’s just those of us sitting in the back of the AP class who aren’t as smart or as gifted working 5x as hard just to not be enough. It is beyond draining.",
      "author": "ItsEggTime_113",
      "created": 1634450620,
      "upvotes": 1,
      "replies": {}
    }
  }
}